{"neutrino": {"2410.24125": "2024-10-31, **Dirac Leptogenesis in Left-Right Symmetric Models**, K. S. Babu et.al., [2410.24125v1](http://arxiv.org/abs/2410.24125v1)\n\n Left-right symmetric models which employ a generalized seesaw mechanism to generate quark and charged lepton masses are known to solve the strong CP problem via parity symmetry, without the need for the axion. These models lead to naturally light Dirac neutrinos with their masses arising through radiatve corrections. In this work, we show how baryogenesis via Dirac leptogenesis can be implemented in this framework. A pair of left-right symmetric scalar doublets $\\phi\\_{L,R}$ carrying $(B-L)$ charge of $3$ is introduced for this purpose, which preserves the parity solution to the strong CP problem. Small neutrino masses are generated through one-loop diagrams mediated by these scalars. The decay of vector-like leptons ($E\\_i$) involved in the seesaw mechanism to generate charged lepton masses, $E\\_i \\rightarrow \\overline{\\nu}\\_{jR} \\,\\phi\\_R^-$, creates a right-handed neutrino ($\\nu\\_{R}$) asymmetry, while preserving total lepton number. The compensating lepton asymmetry is converted to baryon asymmetry via electroweak sphalerons. We show that for a large range of model parameters successful baryogenesis can be realized, with the $W\\_R^\\pm$ gauge boson mass being as low as $10^6$ GeV.\n\n", "2410.24103": "2024-10-31, **Non-holomorphic modular $A_{5}$ symmetry for lepton masses and mixing**, Cai-Chang Li et.al., [2410.24103v1](http://arxiv.org/abs/2410.24103v1)\n\n We perform a comprehensive bottom-up study of all the simplest lepton models based on non-holomorphic $A\\_{5}$ modular flavor symmetry, in which neutrinos are assumed to be Majorana particles and their masses are generated by the Weinberg operator or the type I seesaw mechanism. In the case that the generalized CP (gCP) symmetry is not considered, we find that 21 Weinberg operator models and 174 seesaw models can accommodate the experimental data in lepton sector, and all of them depend on six dimensionless free parameters and two overall scales. If gCP symmetry compatible with $A\\_{5}$ modular symmetry is imposed, one more free parameter would be reduced. Then only 4 of the 21 Weinberg operator models and 100 of the 174 seesaw models agree with the experimental data on lepton masses and mixing parameters. Furthermore, we perform a detailed numerical analysis for two example models for illustration.\n\n", "2410.24099": "2024-10-31, **Characterization of the optical model of the T2K 3D segmented plastic scintillator detector**, S. Abe et.al., [2410.24099v1](http://arxiv.org/abs/2410.24099v1)\n\n The magnetised near detector (ND280) of the T2K long-baseline neutrino oscillation experiment has been recently upgraded aiming to satisfy the requirement of reducing the systematic uncertainty from measuring the neutrinonucleus interaction cross section, which is the largest systematic uncertainty in the search for leptonic charge-parity symmetry violation. A key component of the upgrade is SuperFGD, a 3D segmented plastic scintillator detector made of approximately 2,000,000 optically-isolated 1 cm3 cubes. It will provide a 3D image of GeV neutrino interactions by combining tracking and stopping power measurements of final state particles with sub-nanosecond time resolution. The performance of SuperFGD is characterized by the precision of its response to charged particles as well as the systematic effects that might affect the physics measurements. Hence, a detailed Geant4 based optical simulation of the SuperFGD building block, i.e. a plastic scintillating cube read out by three wavelength shifting fibers, has been developed and validated with the different datasets collected in various beam tests. In this manuscript the description of the optical model as well as the comparison with data are reported.\n\n", "2410.23926": "2024-10-31, **Large neutrino mass in cosmology and keV sterile neutrino dark matter from a dark sector**, Cristina Benso et.al., [2410.23926v1](http://arxiv.org/abs/2410.23926v1)\n\n We consider an extended seesaw model which generates active neutrino masses via the usual type-I seesaw and leads to a large number of massless fermions as well as a sterile neutrino dark matter (DM) candidate in the $\\mathcal{O}(10-100) {\\rm~keV}$ mass range. The dark sector comes into thermal equilibrium with Standard Model neutrinos after neutrino decoupling and before recombination via a U(1) gauge interaction in the dark sector. This suppresses the abundance of active neutrinos and therefore reconciles sizeable neutrino masses with cosmology. The DM abundance is determined by freeze-out in the dark sector, which allows avoiding bounds from X-ray searches. Our scenario predicts a slight increase in the effective number of neutrino species $N\\_{\\rm eff}$ at recombination, potentially detectable by future CMB missions.\n\n", "2410.23833": "2024-10-31, **Performance tests and hardware qualification of the FEBs for the Super-FGD of T2K Phase II**, Lorenzo Giannessi et.al., [2410.23833v1](http://arxiv.org/abs/2410.23833v1)\n\n T2K is a long baseline neutrino experiment, entering Phase II with a Near Detector upgrade. The T2K near detector (ND280) upgrade consists of the installation of three new detector systems: a plastic scintillator neutrino active target (Super-FGD), two time projection chambers (HA-TPC) and a time of flight detector (TOF). The Super-FGD is composed of 2-million 1 cm-cube scintillating cubes read by almost 60 thousand wavelength-shifting (WLS) fibers coupled to an MPPC on one end. Given the large number of channels, the limited space inside magnetic environment, and the limited time from production to installation, the development and testing of the Front-end electronics boards (FEB) for the read-out of the Super-FGD channels represented a challenging task for the success of the upgrade. This work presents the performance tests confirming that the FEB aligns with detector requirements, and the hardware qualification of 240 FEBs through a custom QC test bench designed to detect and locate hardware failures to speed up the repairing process. Installation of the electronics in the detector took place in March 2024, one year after the beginning of the FEB mass production, and the first successful neutrino beam run took place in June of the same year.\n\n", "2410.23756": "2024-10-31, **Disentangling data contributions to the precision measurement of the largest leptonic mixing angle**, P. T. Quyen et.al., [2410.23756v1](http://arxiv.org/abs/2410.23756v1)\n\n Leptonic mixing, together with the massiveness of neutrinos, is one of the most significant discoveries in contemporary particle physics. The observed differences in the mixing patterns of quarks and leptons may shed light on our understanding of the three-generation structure of the Standard Model. This study examines the precise measurement of the largest leptonic mixing angle $\\theta\\_{23}$ through the analysis of neutrino oscillation data samples. Our findings indicate that, contrary to common understanding, the ${\\nu}\\_{\\mu}(\\bar{\\nu}\\_{\\mu})\\rightarrow {\\nu}\\_{e}(\\bar{\\nu}\\_{e})$ appearance samples, rather than the ${\\nu}\\_{\\mu}(\\bar{\\nu}\\_{\\mu})\\rightarrow \\nu\\_{\\mu}(\\bar{\\nu}\\_{\\mu})$ disappearance samples, are sensitive to test the hypothesis of maximal mixing $\\theta\\_{23}=\\pi/4$, particularly if $\\theta\\_{23}$ resides in the higher octant and $\\sin^2\\theta\\_{23}<0.54$. The former serves as the primary source for determining the octant of the $\\theta\\_{23}$ mixing angle; however, the latter remains relevant if $\\theta\\_{23}$ is indeed in the lower octant with $\\sin^2\\theta\\_{23}<0.42$. In a joint T2HK and DUNE analysis, utilizing only appearance sub-samples can exclude the maximal-mixing and determine the actual octant for about 60\\% of the currently allowed range of the $\\theta\\_{23}$ angle. We argue that, despite the presence of parameter degeneracy, the precise measurement of $\\theta\\_{23}$ exhibits minimal dependence on other unknown factors, including the CP-violation phase and neutrino mass ordering.\n\n", "2410.23712": "2024-10-31, **Phenomenology of a singlet-doublet-triplet scotogenic framework**, Maud Sarazin et.al., [2410.23712v1](http://arxiv.org/abs/2410.23712v1)\n\n We present an extensive phenomenological study of a scotogenic framework including a scalar singlet, a scalar doublet, a fermionic doublet, and two generations of a fermionic triplet, allowing to provide three non-zero neutrino masses and three viable dark matter candidates. Using a Markov Chain Monte Carlo numerical technique, we probe the parameter space of the model in view of numerous constraints stemming from dark matter, the neutrino sector, and lepton-flavour violating transitions. The dark matter mass distribution of phenomenologically viable scenarios exhibits three very predictive peaks at 550 GeV, 1080 GeV, and 2300 GeV. In all viable parameter regions, the observed relic density is achieved through dominant co-annihilations. Future experiments will be able to probe a large number of the currently viable parameter space, while certain parameter configurations promise interesting collider signatures. For related studies, five typical parameter configurations are given in SLHA format.\n\n", "2410.23343": "2024-10-30, **Flavor Patterns of Fundamental Particles from Quantum Entanglement?**, Jesse Thaler et.al., [2410.23343v1](http://arxiv.org/abs/2410.23343v1)\n\n The Cabibbo-Kobayashi-Maskawa (CKM) matrix, which controls flavor mixing between the three generations of quark fermions, is a key input to the Standard Model of particle physics. In this paper, we identify a surprising connection between quantum entanglement and the degree of quark mixing. Focusing on a specific limit of $2 \\to 2$ quark scattering mediated by electroweak bosons, we find that the quantum entanglement generated by scattering is minimized when the CKM matrix is almost (but not exactly) diagonal, in qualitative agreement with observation. With the discovery of neutrino masses and mixings, additional angles are needed to parametrize the Pontecorvo-Maki-Nakagawa-Sakata (PMNS) matrix in the lepton sector. Applying the same logic, we find that quantum entanglement is minimized when the PMNS matrix features two large angles and a smaller one, again in qualitative agreement with observation, plus a hint for suppressed CP violation. We speculate on the (unlikely but tantalizing) possibility that minimization of quantum entanglement might be a fundamental principle that determines particle physics input parameters.\n\n", "2410.23258": "2024-10-30, **Subphotospheric Emission from Short Gamma-Ray Bursts. II.~Signatures of Non-Thermal Dissipation in the Multi-Messenger Signals**, Annika Rudolph et.al., [2410.23258v1](http://arxiv.org/abs/2410.23258v1)\n\n Building on a general relativistic magnetohydrodynamic simulation of a short gamma-ray burst (sGRB) jet with initial magnetization $\\sigma\\_0=150$, propagating through the dynamical ejecta from a binary neutron star merger, we identify regions of energy dissipation driven by magnetic reconnection and collisionless sub-shocks within different scenarios. We solve the transport equations for photons, electrons, protons, neutrinos, and intermediate particles up to the photosphere, accounting for all relevant radiative processes, including electron and proton acceleration, and investigate the potential impact of magnetic reconnection occurring in different regions along the jet. We find the photon spectra undergo non-thermal modifications below the photosphere, observable in both on-axis and off-axis emission directions, as well as across different scenarios of energy dissipation and subsequent particle acceleration. Interestingly, the spectral index of the photon energy distribution can at most vary by $\\sim20\\%$ across all different dissipation scenarios. Depending on the dissipation mechanism at play, neutrino signatures may accompany the photon signal, pointing to efficient proton acceleration and shedding light on jet physics. Although our findings are based on one jet simulation, they point to a potential universal origin of the non-thermal features of the Band spectrum observed in sGRBs.\n\n", "2410.23257": "2024-10-30, **Right-handed interactions in puzzling $B$-decays**, Damir Bečirević et.al., [2410.23257v1](http://arxiv.org/abs/2410.23257v1)\n\n We explain the difference between the measured decay widths of $b \\to c \\tau \\nu$ processes and of $B\\to K\\nu\\bar{\\nu}$ and their values predicted in the Standard Model by introducing the right-handed interactions both to quarks and to leptons. At low energy scales, in addition to the Standard Model particles, we assume the presence of an additional neutral lepton (right-handed neutrino). We then show a specific realization of such a scenario in a model with a single scalar leptoquark ($S\\_1$), and discuss the corresponding phenomenology.\n\n", "2410.23098": "2024-10-30, **Measurements of hadron production in 90 GeV/c proton-carbon interactions**, H. Adhikary et.al., [2410.23098v1](http://arxiv.org/abs/2410.23098v1)\n\n This paper presents the multiplicity of neutral and charged hadrons produced in 90 GeV$/c$ proton-carbon interactions from a dataset taken by the NA61/SHINE experiment in 2017. Particle identification via dE/dx was performed for the charged hadrons $\\pi^\\pm$, $K^\\pm$, and $p / \\bar{p}$; the neutral hadrons $K^0\\_S$, $\\Lambda$, and $\\bar{\\Lambda}$ were identified via an invariant mass analysis of their decays to charged hadrons. Double-differential multiplicity results as a function of laboratory momentum and polar angle are presented for each particle species; these results provide vital constraints on the predicted neutrino beam flux for current and future long-baseline neutrino oscillation experiments.\n\n", "2410.23014": "2024-10-30, **Impact of scalar NSI with off-diagonal parameters at DUNE and P2SO**, Sambit Kumar Pusty et.al., [2410.23014v1](http://arxiv.org/abs/2410.23014v1)\n\n In this paper, we studied the impact of the off-diagonal SNSI parameters in the future long-baseline neutrino oscillation experiments DUNE and P2SO. In our analysis, we found that the sensitivities of these experiments altered in a very non-trivial way due to the presence of these parameters. Depending on the values of these parameters, they can either completely mimic the standard scenario or can wash out their CP sensitivity. For large values of parameters $\\eta\\_{e\\mu}$ and $\\eta\\_{e\\tau}$, we obtained larger mass ordering and octant sensitivities as compared to the standard three flavour scenario. For the parameter $\\eta\\_{\\mu\\tau}$, the mass ordering sensitivity and the precision of $\\Delta m^2\\_{31}$ deteriorated compared to the standard scenario. Our results also showed that the sensitivities significantly influenced by the phases of the off-diagonal parameters.\n\n", "2410.22945": "2024-10-30, **Broad-band, high-gain, low-frequency Antennas for Radio Detection of Earth-skimming Tau Neutrinos**, Tim Huege et.al., [2410.22945v1](http://arxiv.org/abs/2410.22945v1)\n\n A promising approach to detect high-energy tau neutrinos is through the measurement of impulsive radio emission from horizontal air showers initiated in the Earth's atmosphere. Observations at frequencies between 30 and 80 MHz seem particularly promising -- if high-gain antennas focused at the horizon and blocking out as much as possible of the noisy sky are employed. Due to the large wavelengths, however, designing an antenna with the required properties is highly non-trivial at such low frequencies. In this article, we explore suitable antenna designs that provide the desired high gain, possess a smooth beam, are insensitive to ground conditions, are easily impedance-matched over the wide band, and are mechanically simple for deployment in large numbers in inaccessible terrain. In particular, we consider the \"rhombus\" antenna design for both horizontally and vertically polarized radiation a very attractive option for tau neutrino detection efforts in the atmosphere with the radio technique.\n\n", "2410.22878": "2024-10-30, **High Energy Neutrino Studies in the forward direction with FASER experiment at the LHC**, Osamu Sato et.al., [2410.22878v1](http://arxiv.org/abs/2410.22878v1)\n\n The FASER experiment studies the neutral decay products from LHC collision of 13.6 TeV centre of mass energy at 480m distant away. There could be Beyond Standard Model (BSM) particles such like dark photons or axion like particles etc.., and also high energy neutrinos. The neutrino target is an Emulsion Cloud Chamber with tungsten plates who can measure all three neutrino flavours with clear separation. Recently, FASER has measured the muon and electron neutrino cross-section with a nucleon as $ \\sigma(\\nu\\_{e} + N) = 1.2^{+0.8}\\_{-0.7}\\times 10^{-38} cm^{2}/GeV$ and $ \\sigma(\\nu\\_{\\mu} + N) = 0.5 \\pm{0.2}\\times 10^{-38} cm^{2}/GeV$ in the unexplored energy region of a few hundred GeV to a few TeV so far.\n\n", "2410.22835": "2024-10-30, **Revisiting the model for radiative neutrino masses with dark matter in the $\\mathrm{U(1)}_{B-L}$ gauge theory**, Shinya Kanemura et.al., [2410.22835v1](http://arxiv.org/abs/2410.22835v1)\n\n The radiative seesaw model with gauged $\\mathrm{U(1)}\\_{B-L}\\times\\mathbb{Z}\\_2$ extension is a well-motivated scenario which gives consistent predictions of active neutrino masses and the abundance of dark matter. Majorana masses of right-handed neutrinos, the lightest of which can be identified as dark matter, are given by the spontaneous breaking of the $\\mathrm{U(1)}\\_{B-L}$ gauge symmetry. We revisit this model with the latest constraints from dark matter searches, neutrino oscillations, flavor experiments and collider experiments. We explore the feasible parameter space of this model, and find that there are still allowed regions under the latest experimental constraints. We present new viable benchmark scenarios for this model, i.e., the right-handed neutrino dark matter scenario and the scalar dark matter scenario. We also mention the testability of these benchmark scenarios at future experiments.\n\n", "2410.22781": "2024-10-30, **A New Particle Pusher with Hadronic Interactions for Modeling Multimessenger Emission from Compact Objects**, Minghao Zou et.al., [2410.22781v1](http://arxiv.org/abs/2410.22781v1)\n\n We propose novel numerical schemes based on the Boris method in curved spacetime, incorporating both hadronic and radiative interactions for the first time. Once the proton has lost significant energy due to radiative and hadronic losses, and its gyroradius has decreased below typical scales on which the electromagnetic field varies, we apply a guiding center approximation (GCA). We fundamentally simulate collision processes either with a Monte-Carlo method or, where applicable, as a continuous energy loss, contingent on the local optical depth. To test our algorithm for the first time combining the effects of electromagnetic, gravitational, and radiation fields including hadronic interactions, we simulate highly relativistic protons traveling through various electromagnetic fields and proton backgrounds. We provide unit tests in various spatially dependent electromagnetic and gravitational fields and background photon and proton distributions, comparing the trajectory against analytic results. We propose that our method can be used to analyze hadronic interactions in black hole accretion disks, jets, and coronae to study the neutrino abundance from active galactic nuclei.\n\n"}, "dark matter": {"2410.24197": "2024-10-31, **Generative modelling for mass-mapping with fast uncertainty quantification**, Jessica J. Whitney et.al., [2410.24197v1](http://arxiv.org/abs/2410.24197v1)\n\n Understanding the nature of dark matter in the Universe is an important goal of modern cosmology. A key method for probing this distribution is via weak gravitational lensing mass-mapping - a challenging ill-posed inverse problem where one infers the convergence field from observed shear measurements. Upcoming stage IV surveys, such as those made by the Vera C. Rubin Observatory and Euclid satellite, will provide a greater quantity and precision of data for lensing analyses, necessitating high-fidelity mass-mapping methods that are computationally efficient and that also provide uncertainties for integration into downstream cosmological analyses. In this work we introduce MMGAN, a novel mass-mapping method based on a regularised conditional generative adversarial network (GAN) framework, which generates approximate posterior samples of the convergence field given shear data. We adopt Wasserstein GANs to improve training stability and apply regularisation techniques to overcome mode collapse, issues that otherwise are particularly acute for conditional GANs. We train and validate our model on a mock COSMOS-style dataset before applying it to true COSMOS survey data. Our approach significantly outperforms the Kaiser-Squires technique and achieves similar reconstruction fidelity as alternative state-of-the-art deep learning approaches. Notably, while alternative approaches for generating samples from a learned posterior are slow (e.g. requiring $\\sim$10 GPU minutes per posterior sample), MMGAN can produce a high-quality convergence sample in less than a second.\n\n", "2410.24082": "2024-10-31, **First Light and Reionisation Epoch Simulations (FLARES) XVII: Learning the galaxy-halo connection at high redshifts**, Maxwell G. A. Maltz et.al., [2410.24082v1](http://arxiv.org/abs/2410.24082v1)\n\n Understanding the galaxy-halo relationship is not only key for elucidating the interplay between baryonic and dark matter, it is essential for creating large mock galaxy catalogues from N-body simulations. High-resolution hydrodynamical simulations are limited to small volumes by their large computational demands, hindering their use for comparisons with wide-field observational surveys. We overcome this limitation by using the First Light and Reionisation Epoch Simulations (FLARES), a suite of high-resolution (M\\_gas = 1.8 x 10^6 M\\_Sun) zoom simulations drawn from a large, (3.2 cGpc)^3 box. We use an extremely randomised trees machine learning approach to model the relationship between galaxies and their subhaloes in a wide range of environments. This allows us to build mock catalogues with dynamic ranges that surpass those obtainable through periodic simulations. The low cost of the zoom simulations facilitates multiple runs of the same regions, differing only in the random number seed of the subgrid models; changing this seed introduces a butterfly effect, leading to random differences in the properties of matching galaxies. This randomness cannot be learnt by a deterministic machine learning model, but by sampling the noise and adding it post-facto to our predictions, we are able to recover the distributions of the galaxy properties we predict (stellar mass, star formation rate, metallicity, and size) remarkably well. We also explore the resolution-dependence of our models' performances and find minimal depreciation down to particle resolutions of order M\\_DM ~ 10^8 M\\_Sun, enabling the future application of our models to large dark matter-only boxes.\n\n", "2410.23631": "2024-10-31, **Direct Detection of Dark Baryons Naturally Suppressed by $\\mathcal{H}$-parity**, Pouya Asadi et.al., [2410.23631v1](http://arxiv.org/abs/2410.23631v1)\n\n We identify symmetries in a broad class of vector-like confining dark sectors that forbid the leading electromagnetic moments that would ordinarily mediate dark baryon scattering with the Standard Model. The absence of these operators implies dark baryon dark matter has much smaller cross sections for elastic scattering off nuclei, leading to suppressed direct detection signals. In the confined description, we identify an ``$\\mathcal{H}$-parity'' symmetry that exists in any dark sector with dark quarks transforming under a vector-like representation of a new confining SU($N\\_c$) gauge theory as well as a vector-like representation of the electroweak group SU(2)$\\_L$. The parity is independent of $N\\_c$ and $N\\_f$, though it is essential that the dark quarks are neutral under hypercharge. This parity forbids dark hadron electric and magnetic dipole moments, charge radius, and anapole moment, while permitting dimension-7 operators that include polarizability, electroweak loop-induced interactions, as well as lower dimensional electromagnetic $\\textit{transition}$ moments between different neutral dark baryon states. We work out an explicit example, $N\\_c=N\\_f=3$, that is the most minimal theory with fermionic dark baryons. In this specific model, we use the non-relativistic quark model to show the magnetic dipole moment and charge radius vanish while the transition moments are non-zero, consistent with $\\mathcal{H}$-parity. We discuss the implications of a suppressed direct detection signal, emphasizing that this broad class of models provide a well-motivated target for future colliders.\n\n", "2410.23454": "2024-10-30, **Dark Matter Candidates and Searches**, Nassim Bozorgnia et.al., [2410.23454v1](http://arxiv.org/abs/2410.23454v1)\n\n Astrophysical observations suggest that most of the matter in the cosmos consists of a new form that has not been observed on Earth. The nature and origin of this mysterious dark matter are among the most pressing questions in fundamental science. In this review we summarize the current state of dark matter research from two perspectives. First, we provide an overview of the leading theoretical proposals for dark matter. And second, we describe how these proposals have driven a broad and diverse global search program for dark matter involving direct laboratory searches and astrophysical observations. This review is based on a Green Paper on dark matter prepared as part of the 2020 Astroparticle Community Planning initiative undertaken by the Canadian Subatomic Physics community but has been significantly updated to reflect recent advances.\n\n", "2410.23350": "2024-10-30, **On the time-dependent density of quadratically coupled dark matter around ordinary matter objects**, Clare Burrage et.al., [2410.23350v1](http://arxiv.org/abs/2410.23350v1)\n\n Wave-like dark matter may feature quadratic couplings to ordinary matter. This carries profound consequences for the phenomenologies of such models. It changes the dark matter density around dense objects made from ordinary matter such as planets and stars, thereby changing the sensitivity of direct detection experiments on Earth as well as implying forces on other ordinary matter objects in the vicinity. In this note we study the time dependence of the dark matter field around spherical objects of ordinary matter. This work indicates the time-scale on which accelerating objects settle into a stationary state and delineates the applicability of stationary solutions for experimental dark matter tests. We also use this to understand (and effectively eliminate) the infinities in energies, forces, and pressures that appear when naively comparing the total energy around objects with different size but the same total number of ordinary matter particles.\n\n", "2410.23019": "2024-10-30, **High Precision Astrometry Science in the Context of Space Mission Prospectives**, Fabien Malbet et.al., [2410.23019v1](http://arxiv.org/abs/2410.23019v1)\n\n Astrometry is one of the oldest branches of astronomy which measures the position, the proper motion and parallax of celestial objects. Following the Hipparcos and Gaia missions that have measured several billions of them using global astrometry, we propose to increase astrometry precision on pointed objects using differential astrometry in a large field in order to unravel rocky planets in habitable zones of stars in the Sun vicinity and investigate the nature of dark matter in galactic environments as recommended by the ESA Senior Committee in the Voyager 2050 prospective. Substantial technology developments in a number of critical areas is needed in order to reach the highest required precision of sub-micro-arcsecond. One of them is CMOS image sensors using the stitching technique to merge the multiple design structures on the wafer and produce array with very large number of pixels. Another one is to calibrate the pixel positions using projecting modulating interferometric laser fringes on the array. Finally, the distortion of the optical system can be monitored and compensated using reference stars as metrology sources. The final precision depends on the diameter and the field of view of the telescope that is used as well as the time spent on each target. We present here the science goals that can be achieved with such missions either within the framework of an ESA Medium-class mission or even in the NASA most challenging Habitable Worlds Observatory, a large space telescope recommended by the American Astronomy and Astrophysics prospective for the 2020s and designed specifically to search for signs of life on planets orbiting other stars.\n\n", "2410.22863": "2024-10-30, **Impact of extreme ultraviolet radiation on the scintillation of pure and xenon-doped liquid argon**, P. Agnes et.al., [2410.22863v1](http://arxiv.org/abs/2410.22863v1)\n\n The Xenon-Argon Technology (X-ArT) collaboration presents a study on the dynamics of pure and xenon-doped liquid argon (LAr) scintillation. Using two types of silicon photomultipliers sensitive to different wavelength ranges, we identify a long-lived extreme ultraviolet (EUV) radiative component that enhances the light yield. This component is present in both pure and xenon-doped LAr, becoming more pronounced at higher xenon concentrations, where it complements the traditional collisional energy transfer process. To explain this mechanism, we develop a comprehensive model of the Xe-doped LAr scintillation process that integrates both collisional and radiative contributions. Additionally, we investigate how xenon doping affects LAr scintillation light yield and pulse shape discrimination. Finally, we hypothesize that the EUV component may explain the emission of spurious electrons, a known challenge in light dark matter searches using noble liquids. By characterizing the scintillation dynamics in Xe-doped LAr, identifying the long-lived EUV component, and exploring the potential origin of spurious electrons, this work lays the groundwork for optimizing detector performance and advancing the design and sensitivity of future noble liquids particle detectors.\n\n", "2410.22702": "2024-10-30, **Beyond Hawking evaporation of black holes formed by dark matter in compact stars**, Ujjwal Basumatary et.al., [2410.22702v1](http://arxiv.org/abs/2410.22702v1)\n\n The memory burden effect is an explicit resolution to the information paradox by which an evaporating black hole acquires quantum hair, which then suppresses its rate of mass loss with respect to the semi-classical Hawking rate. We show that this has significant implications for particle dark matter that captures in neutron stars and forms black holes that go on to consume the host star. In particular, we show that constraints on the nucleon scattering cross section and mass of spin-0 and spin-1/2 dark matter would be extended by several orders of magnitude.\n\n"}, "supernova": {"2410.24173": "2024-10-31, **StarDICE III: Characterization of the photometric instrument with a Collimated Beam Projector**, Thierry Souverin et.al., [2410.24173v1](http://arxiv.org/abs/2410.24173v1)\n\n The measurement of type Ia supernovae magnitudes provides cosmological distances, which can be used to constrain dark energy parameters. Large photometric surveys require a substantial improvement in the calibration precision of their photometry to reduce systematic uncertainties in cosmological constraints. The StarDICE experiment is designed to establish accurate broadband flux references for these surveys, aiming for sub-percent precision in magnitude measurements. This requires a precise measurement of the filter bandpasses of both the StarDICE and survey instruments with sub-nanometer accuracy. To that end, we have developed the Collimated Beam Projector (CBP), an optical device capable of calibrating the throughput of an astronomical telescope and of its filters. The CBP is built from a tunable laser source and a reversed telescope to emit a parallel monochromatic light beam that is continuously monitored in flux and wavelength. The CBP output light flux is measured using a large area photodiode, previously calibrated relative to a NIST photodiode. We derive the StarDICE telescope throughput and filter transmissions from the CBP measurements, anchoring it to the absolute calibration provided by the NIST. After analyzing the systematic uncertainties, we achieved sub-nanometer accuracy in determining filter central wavelengths, measured each filter transmission with a precision of 0.5% per 1nm bin, and detected out-of-band leakages at 0.01%. Furthermore, we have synthesized the equivalent transmission for full pupil illumination from four sample positions in the StarDICE telescope mirror, with an accuracy of approximately 0.2nm for central wavelengths and 7mmag for broadband fluxes. We demonstrated our ability to characterize a telescope throughput down to the mmag, and paved the way for future developments, such as a portable CBP version for in-situ transmission monitoring.\n\n", "2410.24134": "2024-10-31, **Measurement of the power spectrum turnover scale from the cross-correlation between CMB lensing and {\\sl Quaia}**, David Alonso et.al., [2410.24134v1](http://arxiv.org/abs/2410.24134v1)\n\n We use the projected clustering of quasars in the Gaia-unWISE quasar catalog, Quaia, and its cross-correlation with CMB lensing data from Planck, to measure the large-scale turnover of the matter power spectrum, associated with the size of the horizon at the epoch of matter-radiation equality. The turnover is detected with a significance of between $2.3$ and $3.1\\sigma$, depending on the method used to quantify it. From this measurement, the equality scale is determined at the $\\sim20\\%$ level. Using the turnover scale as a standard ruler alone (discarding information from the large-scale curvature of the power spectrum), in combination with supernova data through an inverse distance ladder approach, we measure the current expansion rate to be $H\\_0=62.7\\pm17.2\\,{\\rm km}\\,{\\rm s}^{-1}\\,{\\rm Mpc}^{-1}$. The addition of information coming from the power spectrum curvature approximately halves the standard ruler uncertainty. Our measurement in combination with calibrated supernovae from Pantheon$+$ and SH0ES constrains the CMB temperature to be $T\\_{\\rm CMB}=3.10^{+0.48}\\_{-0.36}\\,{\\rm K}$, independently of CMB data. Alternatively, assuming the value of $T\\_{\\rm CMB}$ from COBE-FIRAS, we can constrain the effective number of relativistic species in the early Universe to be $N\\_{\\rm eff}=3.0^{+5.8}\\_{-2.9}$.\n\n", "2410.23959": "2024-10-31, **CEERS: Forging the First Dust -- Transition from Stellar to ISM Grain Growth in the Early Universe**, Denis Burgarella et.al., [2410.23959v1](http://arxiv.org/abs/2410.23959v1)\n\n We investigate the coevolution of metals and dust for 173 galaxies at 4.0<z<11.4 observed with JWST/NIRSpec. We use the code CIGALE that integrates photometric and spectroscopic data. Our analysis reveals a critical transition at Mstar = 10^8.5 MSun, from galaxies dominated by supernovae and AGB stardust, to those dominated by grain growth. This implies a two-mode building of dust mass, supported by model predictions. The detection of stardust galaxies provides a natural and inherent explanation to the excess of UV-bright galaxies at z>10 by JWST. Besides, we observe that the metallicity of galaxies at z>8 presents a metal-to-stellar mass ratio larger than a few 10^-3, above a floor. This suggests a very fast rise of metals at high redshift, impacting the tentative detections of population III objects.\n\n", "2410.23576": "2024-10-31, **On the initial spin periods of magnetars born in weak supernova explosions and their gravitational wave radiation**, Yu-Long Yan et.al., [2410.23576v1](http://arxiv.org/abs/2410.23576v1)\n\n The initial spin periods of newborn magnetars are \\textbf{strongly associated with the origin of their strong magnetic fields, both of which can affect the electromagnetic radiation and gravitational waves (GWs) emitted at their birth.} Combining the upper limit $E\\_{\\rm SNR}\\lesssim10^{51}$ erg on the explosion energies of \\textbf{the supernova (SN) remnants around slowly-spinning magnetars} with a detailed investigation on the evolution of newborn magnetars, we set constraints on the initial spin periods of magnetars \\textbf{born in weak SN explosions}. Depending on the conversion efficiency $\\eta$ of the electromagnetic energy of \\textbf{these} newborn magnetars into the kinetic energy of SN ejecta, the minimum initial spin periods of \\textbf{these} newborn magnetars are $P\\_{\\rm i, min}\\simeq 5-6$ ms for an ideal efficiency $\\eta=1$, $P\\_{\\rm i, min}\\simeq 3-4$ ms for a possible efficiency $\\eta=0.4$, and $P\\_{\\rm i, min}\\simeq 1-2$ ms for a relatively low efficiency $\\eta=0.1$. \\textbf{Based on these constraints and adopting reasonable values for the physical parameters of the newborn magnetars, we find that their GW radiation at $\\nu\\_{\\rm e,1}=\\nu$ may be undetectable by the Einstein Telescope (ET) since the maximum signal-to-noise ratio (${\\rm S/N}$) is only 2.41 even the sources are located at a very close distance of 5 Mpc, where $\\nu$ are the spin frequencies of the magnetars. At such a distance, the GWs emitted at $\\nu\\_{\\rm e,2}=2\\nu$ from the newborn magnetars with dipole fields $B\\_{\\rm d}=5\\times10^{14}$ and $10^{15}$ G may be detectable by the ET because ${\\rm S/N}$ are 10.01 and 19.85, respectively. However, if these newborn magnetars are located at $20$ Mpc away in the Virgo supercluster, no GWs could be detected by the ET due to low ${\\rm S/N}$.\n\n", "2410.23572": "2024-10-31, **Detection of the extended $γ$-ray emission from the new supernova remnant G321.3-3.9 with Fermi-LAT**, Xiaolei Guo et.al., [2410.23572v1](http://arxiv.org/abs/2410.23572v1)\n\n With the 15 yrs of Pass 8 data recorded by the {\\em Fermi} Large Area Telescope, we report the detection of an extended gigaelectronvolt emission component with a 68\\% containment radius of $0^{\\circ}\\!.85$, which is spatially associated with the newly identified supernova remnant (SNR) G321.3-3.9. The $\\gamma$-ray spectrum is best described by a log-parabola model in the energy range of 100 MeV - 1 TeV, which shows a significant spectral curvature at $\\sim$ 1 GeV. Either a leptonic or a hadronic model could explain the multi-wavelength data of G321.3-3.9, while the leptonic model predicts a too low strength of magnetic field. Also considering the flat radio spectrum of G321.3-3.9 and the $\\gamma$-ray upper limit in the low energy band, the hadronic model is favored. The spatial coincidence between the $\\gamma$-ray morphology and the diffuse thermal X-ray emission of G321.3-3.9 and the curved gigaelectronvolt $\\gamma$-ray spectrum of it make G321.3-3.9 to be similar to the typical middle-aged SNRs interacting with molecular clouds. Such characteristics provide another evidence of the potential hadronic origin for its $\\gamma$-ray emission. While there is no molecular cloud detected around G321.3-3.9, which challenges the hadronic model.\n\n", "2410.23345": "2024-10-30, **The SRG/eROSITA diffuse soft X-ray background. I. The local hot bubble in the western Galactic hemisphere**, Michael C. H. Yeung et.al., [2410.23345v1](http://arxiv.org/abs/2410.23345v1)\n\n The SRG/eROSITA All-Sky Surveys (eRASSs) combine the advantages of complete sky coverage and the energy resolution provided by the charge couple device and offer the most holistic and detailed view of the diffuse soft X-ray background (SXRB) to date. The first eRASS (eRASS1) was completed at solar minimum, when solar wind charge exchange emission was minimal, providing the clearest view of the SXRB. We aim to extract spatial and spectral information from each constituent of the SXRB in the western Galactic hemisphere, focusing on the local hot bubble (LHB). We extracted and analysed eRASS1 spectra from almost all directions in the western Galactic hemisphere by dividing the sky into equal signal-to-noise bins. We fitted all bins with fixed spectral templates of known background constituents. We find the temperature of the LHB exhibits a north-south dichotomy at high latitudes ($\\|b\\|>30^{\\circ}$), with the south being hotter, with a mean temperature at $kT=121.8\\pm0.6\\,$eV and the north at $kT=100.8\\pm0.5\\,$eV. At low latitudes, the LHB temperature increases towards the Galactic plane, especially towards the inner Galaxy. The LHB emission measure (${\\rm EM\\_{LHB}}$) enhances approximately towards the Galactic poles. The ${\\rm EM\\_{LHB}}$ map shows clear anti-correlation with the local dust column density. In particular, we found tunnels of dust cavities filled with hot plasma, potentially forming a wider network of hot interstellar medium. We also constructed a three-dimensional LHB model from ${\\rm EM\\_{LHB}}$, assuming constant density. The average thermal pressure of the LHB is $P\\_{\\rm thermal}/k=10100^{+1200}\\_{-1500}\\,{\\rm cm^{-3}\\,K}$, a lower value than typical supernova remnants and wind-blown bubbles. This could be an indication of the LHB being open towards high Galactic latitudes.\n\n", "2410.23346": "2024-10-30, **ASURA-FDPS-ML: Star-by-star Galaxy Simulations Accelerated by Surrogate Modeling for Supernova Feedback**, Keiya Hirashima et.al., [2410.23346v1](http://arxiv.org/abs/2410.23346v1)\n\n We introduce new high-resolution galaxy simulations accelerated by a surrogate model that reduces the computation cost by approximately 75 percent. Massive stars with a Zero Age Main Sequence mass of about 8 solar masses and above explode as core-collapse supernovae (CCSNe), which play a critical role in galaxy formation. The energy released by CCSNe is essential for regulating star formation and driving feedback processes in the interstellar medium (ISM). However, the short integration timesteps required for SNe feedback present significant bottlenecks in star-by-star galaxy simulations that aim to capture individual stellar dynamics and the inhomogeneous shell expansion of SNe within the turbulent ISM. Our new framework combines direct numerical simulations and surrogate modeling, including machine learning and Gibbs sampling. The star formation history and the time evolution of outflow rates in the galaxy match those obtained from resolved direct numerical simulations. Our new approach achieves high-resolution fidelity while reducing computational costs, effectively bridging the physical scale gap and enabling multi-scale simulations.\n\n", "2410.23336": "2024-10-30, **The Massive and Quiescent Elliptical Host Galaxy of the Repeating Fast Radio Burst FRB20240209A**, T. Eftekhari et.al., [2410.23336v1](http://arxiv.org/abs/2410.23336v1)\n\n The discovery and localization of FRB20240209A by the Canadian Hydrogen Intensity Mapping Fast Radio Burst (CHIME/FRB) experiment marks the first repeating FRB localized with the CHIME/FRB Outriggers and adds to the small sample of repeating FRBs with associated host galaxies. Here we present Keck and Gemini observations of the host that reveal a redshift $z=0.1384\\pm0.0004$. We perform stellar population modeling to jointly fit the optical through mid-infrared data of the host and infer a median stellar mass log$(M\\_*/{\\rm M\\_{\\odot}})=11.34\\pm0.01$ and a mass-weighted stellar population age $\\sim11$Gyr, corresponding to the most massive and oldest FRB host discovered to date. Coupled with a star formation rate $<0.36\\,{\\rm M\\_{\\odot}\\ yr^{-1}}$, the specific star formation rate $<10^{-11.8}\\rm\\ yr^{-1}$ classifies the host as quiescent. Through surface brightness profile modeling, we determine an elliptical galaxy morphology, marking the host as the first confirmed elliptical FRB host. The discovery of a quiescent early-type host galaxy within a transient class predominantly characterized by late-type star-forming hosts is reminiscent of short-duration gamma-ray bursts, Type Ia supernovae, and ultraluminous X-ray sources. Based on these shared host demographics, coupled with a large offset as demonstrated in our companion paper, we conclude that preferred progenitors for FRB20240209A include magnetars formed through merging binary neutron stars/white dwarfs or the accretion-induced collapse of a white dwarf, or a luminous X-ray binary. Together with FRB20200120E localized to a globular cluster in M81, our findings provide strong evidence that some fraction of FRBs may arise from a process distinct from the core collapse of massive stars.\n\n", "2410.23190": "2024-10-30, **Diffusive shock acceleration of dust grains at supernova remnants**, P. Cristofari et.al., [2410.23190v1](http://arxiv.org/abs/2410.23190v1)\n\n Diffusive shock acceleration (DSA) is a prominent mechanism for energizing charged particles up to very large rigidities at astrophysical collisionless shocks. In addition to ions and electrons, it has been proposed that interstellar dust grains could also be accelerated through diffusive shock acceleration, for instance, at supernova remnants (SNRs). Considering interstellar dust grains of various size and composition, we investigate the possibility of grain acceleration at young SNR shocks (throughout the free expansion and Sedov-Taylor phases) and the maximum energies reached by the accelerated grains. We investigate the potential implications on the abundance of refractory species relative to volatile elements in the cosmic-ray composition. We rely on semi-analytical descriptions of particle acceleration at strong shocks, and on self-similar solutions for the dynamics of SNR shock waves. For simplicity, type Ia thermonuclear SNRs expanding in uniform interstellar medium are considered. We find that the acceleration of dust grains at relativistic speed is possible, up to Lorentz factor of $\\sim 10^{2}$, kinetic energy $E\\_{\\rm k}/\\text{nuc}\\sim 10^2$ GeV/nuc for the smaller grains of size $a\\sim 5 \\times 10^{-7}$ cm. We find that the subsequent sputtering of grains can produce nuclei with a rigidity sufficient to be injected in the process of diffusive shock acceleration. Such scenario can help naturally account for the overabundance of refractory elements in the Galactic cosmic-ray composition, provided that a fraction $\\eta \\sim 10^{-3}-10^{-2}$ of dust grains swept up by a SNR are energized through DSA.\n\n", "2410.23167": "2024-10-30, **Massive star evolution models incorporating $α$-enhanced composition -- I. BPASS Single star models**, Conor M Byrne et.al., [2410.23167v1](http://arxiv.org/abs/2410.23167v1)\n\n Stellar evolution modelling is fundamental to many areas of astrophysics including stellar populations in both nearby and distant galaxies. It is heavily influenced by chemical composition. Observations of distant galaxies and nucleosynthesis calculations show that $\\alpha$-process elements are enriched faster than iron group elements. We present a dense grid of single-star models calculated using the BPASS stellar evolution code and covering masses ($0.1\\le\\mathrm{M/M}\\_\\odot\\le316$), metallicity mass fractions ($10^{-5} \\le Z \\le 0.04$) and $\\alpha$-to-iron abundance ratios ($-0.2\\le[\\alpha/\\mathrm{Fe}]\\le+0.6$). By comparing Solar-scaled models to ones enriched in $\\alpha$-process elements, we find that stellar radii, surface temperatures, Main Sequence lifetimes, supernova progenitor properties and supernova rates are all sensitive to changes in [$\\alpha$/Fe]. Lifetimes of low-mass stars differ by up to 0.4 dex, while surface temperatures of massive stars at the end of the Main Sequence also differ by around 0.4 dex. Inferred supernova rates when [Fe/H] is unknown can be highly uncertain. Models with different [$\\alpha$/Fe] but comparable iron abundances show smaller variations, indicating that while iron primarily defines the course of evolution; $\\alpha$-enhancement nonetheless has an impact of up to 0.1 dex on stellar properties. Such changes are small for individual stars, but have a large cumulative effect when considering an entire stellar population as demonstrated by isochrone fitting to nearby clusters. Changes in radii and lifetimes have further consequences for a stellar population including binary stars, as they influence the timing, nature and occurrence rate of mass transfer events.\n\n", "2410.23093": "2024-10-30, **Differentiable Conservative Radially Symmetric Fluid Simulations and Stellar Winds -- jf1uids**, Leonard Storcks et.al., [2410.23093v1](http://arxiv.org/abs/2410.23093v1)\n\n We present jf1uids, a one-dimensional fluid solver that can, by virtue of a geometric formulation of the Euler equations, model radially symmetric fluid problems in a conservative manner, i.e., without losing mass or energy. For spherical problems, such as ideal supernova explosions or stellar wind-blown bubble expansions, simulating only along a radial dimension drastically reduces compute and memory demands compared to a full three-dimensional method. This simplification also alleviates constraints on backpropagation through the solver. Written in JAX, jf1uids is a GPU-compatible and fully differentiable simulator. We demonstrate the advantages of this differentiable physics simulator by retrieving the wind's parameters for an adiabatic stellar wind expansion from the final fluid state using gradient descent. As part of a larger \"stellar winds, cosmic rays and machine learning\" research track, jf1uids serves as a solid foundation to be extended with additional physics modules, foremost cosmic rays and a neural-net powered gas-cooling surrogate and improved by higher order and more accurate numerical schemes. All code is available under https://github.com/leo1200/jf1uids/.\n\n"}}