{"neutrino": {"2408.07700": "2024-08-14, **Profile Likelihoods in Cosmology: When, Why and How illustrated with $Λ$CDM, Massive Neutrinos and Dark Energy**, Laura Herold et.al., [2408.07700v1](http://arxiv.org/abs/2408.07700v1)\n\n Frequentist parameter inference using profile likelihoods has received increased attention in the cosmology literature recently since it can give important complementary information to Bayesian credible intervals. Here, we give a pedagogical review to frequentist parameter inference in cosmology with particular focus on when the graphical profile likelihood construction gives meaningful constraints, i.e.\\ confidence intervals with correct coverage. This construction rests on the assumption of the asymptotic limit of a large data set such as in \\textit{Wilks' theorem}. We assess the validity of this assumption in the context of three cosmological models with \\textit{Planck} 2018 \\texttt{Plik\\\\_lite} data: While our tests for the $\\Lambda$CDM model indicate that the profile likelihood method gives correct coverage, $\\Lambda$CDM with the sum of neutrino masses as a free parameter appears consistent with a Gaussian near a boundary motivating the use of the boundary-corrected or Feldman-Cousins graphical method; for $w\\_0$CDM with the equation of state of dark energy, $w\\_0$, as a free parameter, we find indication of a violation of the assumptions. Finally, we compare frequentist and Bayesian constraints of these models. Our results motivate care when using the graphical profile likelihood method in cosmology.\n\n", "2408.07641": "2024-08-14, **Exploring New Physics with PandaX-4T Low Energy Electronic Recoil Data**, PandaX Collaboration et.al., [2408.07641v1](http://arxiv.org/abs/2408.07641v1)\n\n New particles beyond the Standard Model of particle physics, such as axions, can be effectively searched through their interactions with electrons. We use the large liquid xenon detector PandaX-4T to search for novel electronic recoil signals induced by solar axions, neutrinos with anomalous magnetic moment, axion-like particles, dark photons, and light fermionic dark matter. A detailed background model is established with the latest datasets with 1.54 $\\rm tonne \\cdot year$ exposure. No significant excess above the background has been observed, and we have obtained competitive constraints for axion couplings, neutrino magnetic moment, and fermionic dark matter interactions.\n\n", "2408.07598": "2024-08-14, **TeV scale Leptogenesis with triplet Fermion in Connection to Muon $g-2$ and W mass anomaly**, Simran Arora et.al., [2408.07598v1](http://arxiv.org/abs/2408.07598v1)\n\n We propose extending the minimal scotogenic model with a triplet fermion and a singlet scalar. All the fields change non-trivially under an additional $Z\\_{4}\\times Z\\_{2}$ symmetry. The $Z\\_{4}\\times Z\\_{2}$ symmetry allows only diagonal Yukawa couplings among different generations of SM leptons and right-handed singlet neutrinos. The one-loop radiative diagrams generate neutrino mass. The Yukawa coupling of the triplet fermion with the inert doublet positively contributes to the muon anomalous magnetic moment. The imposed $Z\\_{4}\\times Z\\_{2}$ symmetry forbids the conventional leptogenesis from the right-handed neutrino decay. A net lepton asymmetry can be generated in the muonic sector from triplet fermion decay. Involvement of the Yukawa coupling both in leptogenesis and in the anomalous magnetic moment of the muon results in a strong correlation between leptogenesis and the recent Fermi lab result. We show a viable parameter space for TeV scale leptogenesis while explaining the Fermi lab results. The inert scalar is the dark matter candidate in this model. The model also poses the potential to explain the latest results on W boson mass from the CDF-II experiment.\n\n", "2408.07172": "2024-08-13, **UHECR Clustering: Lightest Nuclei from Local Sheet Galaxies**, Daniele Fargion et.al., [2408.07172v1](http://arxiv.org/abs/2408.07172v1)\n\n The ultra-high-energy cosmic ray (UHECR) puzzle is reviewed under the hints of a few basic results: clustering, anisotropy, asymmetry, bending, and composition changes with energies. We show how the lightest UHECR nuclei from the nearest AGN or Star-Burst sources, located inside a few Mpc Local Sheets, may explain, at best, the observed clustering of Hot Spots at tens EeV energy. Among the possible local extragalactic candidate sources, we derived the main contribution of very few galactic sources. These are located in the Local Sheet plane within a distance of a few Mpc, ejecting UHECR at a few tens of EeV energy. UHECR also shine at lower energies of several EeV, partially feeding the Auger dipole by LMC and possibly a few nearer galactic sources. For the very recent highest energy UHECR event, if a nucleon, it may be explained by a model based on the scattering of UHE ZeV neutrinos on low-mass relic neutrinos. Such scatterings are capable of correlating, via Z boson resonance, the most distant cosmic sources above the GZK bound with such an enigmatic UHECR event. Otherwise, these extreme events, if made by the heaviest composition, could originate from the largest bending trajectory of heaviest nuclei or from nearby sources, even galactic ones. In summary, the present lightest to heavy nuclei model UHECR from the Local Sheet could successfully correlate UHECR clustering with the nearest galaxies and AGN. Heavy UHECR may shine by being widely deflected from the Local Sheet or from past galactic, GRB, or SGR explosive ejection.\n\n", "2408.07053": "2024-08-13, **DarkMatters: A powerful tool for WIMPy analysis**, Michael Sarkis et.al., [2408.07053v1](http://arxiv.org/abs/2408.07053v1)\n\n We introduce a new software package, DarkMatters, which has been designed to facilitate the calculation of all aspects of indirect dark matter detection of WIMPs in astrophysical settings. Two primary features of this code are the improvement in performance compared to existing tools, and higher levels of accuracy when determining radio synchrotron emission associated with WIMP annihilations, both of which are enabled by the employment of a set of modern and novel numerical techniques. The code also includes functionality for a multi-wavelength set of output products including gamma-ray, radio and neutrino fluxes which can be saved in common formats used by the astronomical community, such as the FITS data file format. The calculations may be tailored to work with a wide range of astrophysical target structures, from dwarf galaxies to galaxy clusters, and the configuration of the underlying calculations is managed by a set of key-value dictionary entries that are easy to understand and use. The code base is publicly accessible through an online repository with a permissive MIT source code licence.\n\n", "2408.07015": "2024-08-13, **Measurement of neutrino oscillation parameters with the first six detection units of KM3NeT/ORCA**, KM3NeT Collaboration et.al., [2408.07015v1](http://arxiv.org/abs/2408.07015v1)\n\n KM3NeT/ORCA is a water Cherenkov neutrino detector under construction and anchored at the bottom of the Mediterranean Sea. The detector is designed to study oscillations of atmospheric neutrinos and determine the neutrino mass ordering. This paper focuses on an initial configuration of ORCA, referred to as ORCA6, which comprises six out of the foreseen 115 detection units of photo-sensors. A high-purity neutrino sample was extracted, corresponding to an exposure of 433 kton-years. The sample of 5828 neutrino candidates is analysed following a binned log-likelihood method in the reconstructed energy and cosine of the zenith angle. The atmospheric oscillation parameters are measured to be $\\sin^2\\theta\\_{23}= 0.51^{+0.04}\\_{-0.05}$, and $ \\Delta m^2\\_{31} = 2.14^{+0.25}\\_{-0.35}\\times 10^{-3}~\\mathrm{eV^2} \\cup \\{-2.25,-1.76\\}\\times 10^{-3}~\\mathrm{eV^2}$ at 68\\% CL. The inverted neutrino mass ordering hypothesis is disfavoured with a p-value of 0.25.\n\n", "2408.06599": "2024-08-13, **Radial oscillations of proto-neutron stars**, T. T. Sun et.al., [2408.06599v1](http://arxiv.org/abs/2408.06599v1)\n\n We investigate radial oscillations of proto-neutron stars, employing equations of state described by the Brueckner-Hartree-Fock theory or the relativistic mean field model, and assuming isentropy and fixed lepton fractions for the internal structure. We calculate the eigenfrequencies and corresponding oscillation functions, which show different characteristics in different mass regions. In the low-mass region around 1.4 solar mass, the radial oscillation frequencies are lowered by large entropy and neutrino trapping, along with a reduction of the average adiabatic index. In the region close to the maximum mass, the fundamental oscillation frequency drops rapidly and vanishes at the maximum mass, in accordance with the critical stability criterion $\\partial M /\\partial \\rho\\_c = 0$, as for cold neutron stars.\n\n"}, "dark matter": {"2408.07667": "2024-08-14, **Possible wormholes in $f(R)$ gravity sourced by solitonic quantum wave and cold dark matter halos and their repulsive gravity effect**, Abdelghani Errehymy et.al., [2408.07667v1](http://arxiv.org/abs/2408.07667v1)\n\n In this paper, we present new generalized wormhole (WH) solutions within the context of $f(R)$ gravity. Specifically, we focus on $f(R)$ gravitational theories formulated in the metric formalism, with our investigation centered on a power-law form represented by $f(R) = \\epsilon R^{\\chi}$. Here, $\\epsilon$ is an arbitrary constant, and $\\chi$ is a real number. Notably, this form possesses the advantageous property of reducing to Einstein gravity when $\\epsilon=1$ and $\\chi=1$. To obtain these novel WH solutions, we establish the general field equations for any $f(R)$ theory within the framework of Morris-Thorne spacetime, assuming metric coefficients that are independent of time. By utilizing an anisotropic matter source and a specific type of energy density associated with solitonic quantum wave (SQW) and cold dark matter (CDM) halos, we calculate two distinct WH solutions. We thoroughly investigate the properties of the exotic matter (ExoM) residing within the WH geometry and analyze the matter contents through energy conditions (ECs). Both analytical and graphical methods are employed in this analysis to examine the validity of different regions. Notably, the calculated shape functions for the WH geometry satisfy the necessary conditions in both scenarios, emphasizing their reliability. This ExoM is characterized by an energy-momentum tensor that violates the null energy condition (NEC) and, consequently, the weak energy condition as well, in the vicinity of the WH throats. Furthermore, we investigated the repulsive effect of gravity and discovered that its presence results in a negative deflection angle for photons following null geodesics. Importantly, we observed that the deflection angle consistently exhibits negative values across all $r\\_0$ values in both scenarios, indicating the manifestation of the repulsive gravity effect.\n\n", "2408.07617": "2024-08-14, **New Horizons for Psi: Studying fundamental fields with numerical relativity**, Katy Clough et.al., [2408.07617v1](http://arxiv.org/abs/2408.07617v1)\n\n This set of notes was designed to accompany two hours of lectures and practical exercises at the New Horizons for Psi workshop in Lisbon in July 2024 entitled \"Studying fundamental fields with numerical relativity\". Numerical relativity is a tool used to help understand the behaviours of metric and matter fields in dynamical, strong gravity situations. It has been used to study a range of situations involving fundamental fields, including superradiance, modified gravity, dynamical friction, dark matter accretion and early universe cosmology. The purpose of this course is to provide some background and hands-on experience in numerical relativity that will help students to better understand the possibilities provided by this tool, as well as its limitations.\n\n", "2408.07373": "2024-08-14, **Ellipticities of Galaxy Cluster Halos from Halo-Shear-Shear Correlations**, Zhenjie Liu et.al., [2408.07373v1](http://arxiv.org/abs/2408.07373v1)\n\n We report the first detection of the halo ellipticities of galaxy clusters by applying the halo-shear-shear correlations (HSSC), without the necessity of major axis determination. We use the Fourier\\\\_Quad shear catalog based on the Hyper Suprime-Cam Survey and the group catalog from the DESI Legacy Surveys for the measurement of group/cluster lensing and HSSC. Our analysis includes the off-centering effects. We obtain the average projected ellipticity of dark matter halos with mass $13.5 < {\\rm log} (M\\_G h/ M\\_\\odot) < 14.5$ within 1.3 virial radius to be $0.48^{+0.12}\\_{-0.19}$. We divide the sample into two groups based on mass and redshift, and we find that halos with higher mass tend to exhibit increased ellipticity. We also reveal that high-richness halos have larger ellipticities, confirming the physical picture from numerical simulation that high-richiness halos have a dynamical youth and more active mass accretion phase.\n\n", "2408.07352": "2024-08-14, **Polarization Measurements as a Probe of Axion-Photon Coupling: a Study of GRB 221009A**, Boris Betancourt Kamenetskaia et.al., [2408.07352v1](http://arxiv.org/abs/2408.07352v1)\n\n Axion Like Particles (ALPs) can be produced in Gamma Ray Bursts, altering the polarization of the electromagnetic emission in these events. For the first time, we derive bounds on the axion-photon coupling from polarization measurements of GRB 221009A, performing a full calculation of the Stokes parameters, as it is typically done in the astrophysics community. Within astrophysical uncertainties, our limits on the axion-photon coupling are competitive with complementary probes in the axion mass range $10^{-9}$ eV $\\lesssim m\\_a \\lesssim 10^{-8}$ eV, further allowing to probe motivated parameter space of ALP dark matter.\n\n", "2408.06652": "2024-08-13, **Search for QCD Axions in light of String Theory**, Qiaoli Yang et.al., [2408.06652v1](http://arxiv.org/abs/2408.06652v1)\n\n The QCD axion stands as one of the most promising candidates for resolving the strong CP problem. However, the value of the axion's decay constant $f\\_a$ and, by extension, its mass $m\\_a$, remain uncertain within the framework of effective field theory, posing a challenge for experimental detection. Fortunately, fields such as cosmology and astrophysics can offer crucial clues about potential mass ranges. Additionally, string theory and the more recent swampland principles might shed some light on the subject. The most straightforward string theory compactifications suggest that $f\\_a$ is around the GUT scale, leading to an anthropic abundance of dark matter. We found that this range can be detected through hydrogen atomic transitions. The recent concept of the dark dimension scenario introduces an alternative possibility. If axions are confined to the four-dimensional Standard Model brane, their decay constant $f\\_a$ would be on the order of $10^{10}$ GeV. In this scenario, where axions constitute only a minor portion of dark matter, we show that a laser-interferometry setup would be an effective detection method.\n\n", "2408.06555": "2024-08-13, **Resonant Forbidden CP Asymmetry from Soft Leptons**, Shinya Kanemura et.al., [2408.06555v1](http://arxiv.org/abs/2408.06555v1)\n\n To explain the baryon asymmetry in the early universe via leptogenesis, quantum corrections to new particles are commonly invoked to generate the necessary CP asymmetry. We demonstrate, however, that a large CP asymmetry can already arise from Standard Model leptons. The mechanism relies on resummation of soft leptons at finite temperatures. The CP asymmetry, which is kinetically forbidden in vacuum, can be resonantly enhanced from thermally resummed leptons by seven orders of magnitude. Contrary to the resonance from exotic particles, we show that the resonant enhancement from soft leptons is protected by controlled widths under finite-temperature perturbation theory. We quantify such CP asymmetries in leptogenesis with secluded flavor effects and comment on the significance and application. The mechanism exploits the maximal role of leptons themselves, featuring low-scale leptogenesis, minimal model buildings and dark matter cogenesis.\n\n"}, "supernova": {"2408.07640": "2024-08-14, **Insight into the occurrence of particle acceleration through the investigation of Wolf-Rayet stars using uGMRT observations**, A. B. Blanco et.al., [2408.07640v1](http://arxiv.org/abs/2408.07640v1)\n\n Massive stars produce strong stellar winds that consist of continuous outflows of material at speeds of thousands of km/s. These winds convey large amounts of kinetic power, especially in the case of Wolf-Rayet (WR) stars. When these winds interact with nearby material, they will likely produce shocks. Among other processes, particle acceleration is expected to occur. This is particularly well established in the case of massive binary systems, where the stellar winds collide, allowing these systems to be identified thanks to the detection of synchrotron radio emission, produced by a population of relativistic particles accelerated in the shocks. Our goal is to investigate the occurrence of particle acceleration among massive stars in their pre-supernova evolution phases. To this end, we observed a subset of five WR stars in the radio domain using the upgraded Giant Metrewave Radio Telescope (uGMRT), located in India. The observations were carried out in bands 4 (550-950 MHz) and 5 (1050-1450 MHz) for all the targets. We detected radio emission for only WR 110 in bands 4 and 5. Its thermal spectrum displays a consistent index of +0.74 down to uGMRT bands. The four other targets were not detected and we derived 3$\\sigma$ upper limits. Our upper limits in Band 4 are the first provided for these targets below 1 GHz. None of the targets was identified as a synchrotron radio emitter in these radio bands. If some synchrotron emission is produced in these systems, the non-detection with uGMRT can be most likely attributed to strong free-free absorption (FFA). This is especially relevant for WR 98a, which is catalogued as a particle accelerator based on previous measurements at higher radio frequencies. We discuss how the prominence of FFA constitutes a severe obstacle to identifying particle accelerators in the radio domain.\n\n", "2408.07443": "2024-08-14, **Constraining SN Ia Progenitors from the Observed Fe-peak Elemental Abundances in the Milky Way Dwarf Galaxy Satellites**, Ryan K. Alexander et.al., [2408.07443v1](http://arxiv.org/abs/2408.07443v1)\n\n Chemical abundances of iron-peak elements in the red giants of ultra-faint dwarf galaxies (UFD) and dwarf spheroidal galaxies (dSph) are among the best diagnostics in the cosmos to probe the origin of Type Ia Supernovae (SNe Ia). We incorporate metallicity-dependent SN Ia nucleosynthesis models for different progenitor masses in our inhomogeneous galactic chemical evolution model, i-GEtool, to recreate the observed elemental abundance patterns and their spread in a sample of UFD and dSph galaxies with different average metallicities and star formation histories. Observations across different environments indicate that [Mn/Mg] increases on average with metallicity while [Ni/Mg] remains nearly constant. Chemical evolution models assuming SN Ia progenitors with Chandrasekhar mass (M$\\_{\\text{Ch}}$) produce similar to identical [Mn/Mg]-[Fe/H] and [Ni/Mg]-[Fe/H] patterns to those observed in the examined UFD and dSph galaxies, without needing to invoke a substantial fraction of sub-M$\\_{\\text{Ch}}$ progenitors that changes across the different environments, as claimed by some previous chemical evolution studies. We note though that the observed UFD sample is still statistically poor to draw firm conclusions. Sub-M$\\_{\\text{Ch}}$ progenitors in our dSph models systematically under produce both [Mn/Mg] and [Ni/Mg], with the 1M$\\_{\\odot}$ model explaining a number of outliers in [Ni/Fe], while the outliers in [Mn/Mg] require higher sub-M$\\_{\\text{Ch}}$ progenitor masses. The average dispersion of [X/Mg] from our UFD model ranges between $0.20$ and $0.25$ for iron-peak elements, with the exception of [Sc/Mg] that has $\\sigma \\approx 0.39$.\n\n", "2408.07175": "2024-08-13, **Evolving Dark Energy or Supernovae Systematics?**, George Efstathiou et.al., [2408.07175v1](http://arxiv.org/abs/2408.07175v1)\n\n Recent results from the Dark Energy Spectroscopic Instrument (DESI) collaboration have been interpreted as evidence for evolving dark energy. However, this interpretation is strongly dependent on which Type Ia supernova (SN) sample is combined with DESI measurements of baryon acoustic oscillations (BAO) and observations of the cosmic microwave background (CMB) radiation. The strength of the evidence for evolving dark energy ranges from ~3.9 sigma for the Dark Energy 5 year (DES5Y) SN sample to ~ 2.5 sigma for the Pantheon+ sample. Here I compare SN common to both the DES5Y and Pantheon+ compilations finding evidence for an offset of ~0.04 mag. between low and high redshifts. Correcting for this offset brings the DES5Y sample into very good agreement with the Planck LCDM cosmology. Given that most of the parameter range favoured by the uncorrected DES5Y sample is discrepant with many other cosmological datasets, I conclude that the evidence for evolving dark energy is most likely a result of systematics in the DES5Y sample.\n\n", "2408.07130": "2024-08-13, **On the Progenitor of the Crab Pulsar**, Elvira Cruz-Cruz et.al., [2408.07130v1](http://arxiv.org/abs/2408.07130v1)\n\n The Crab supernova is interesting because we know that it was not a binary at death, the outcome was a neutron star, and because of the supernova remnant's apparently low energy and mass. Using Gaia EDR3 parallaxes and photometry, we examine the stellar population local to the Crab in a cylinder with a projected radius of 100 pc and parallax range $0.427 < \\varpi < 0.619$ mas set by the uncertainties in the Crab's parallax. We also individually model the most luminous stars local to the Crab. The two most luminous stars are blue, roughly main sequence stars with masses of $\\sim11 M\\_{\\odot}$. We estimate the stellar population's age distribution using Solar metallicity PARSEC isochrones. The estimated age distribution of the 205 $M\\_{G} < 0$ stars modestly favor lower mass stars consistent with an AGB star or a lower mass binary merger as the progenitor, but we cannot rule out higher masses. This may be driven by contamination due to the $\\sim700$ pc length of the cylinder in distance.\n\n", "2408.06807": "2024-08-13, **Quantifying Bursty Star Formation in Dwarf Galaxies**, Yuan-Sen Ting et.al., [2408.06807v1](http://arxiv.org/abs/2408.06807v1)\n\n Dwarf galaxy star formation histories are theoretically expected to be bursty, potentially leaving distinct imprints on their chemical evolution. We propose that episodic starbursts with quiescent periods longer than $\\sim$100 Myr should lead to discontinuous tracks in a dwarf galaxy's [$\\alpha$/Fe]-[Fe/H] chemical abundance plane, with metallicity gaps as large as 0.3-0.5 dex at [Fe/H] = -2. This occurs due to continued Fe production by Type Ia supernovae during quiescent periods. We demonstrate that Gaussian mixture models can statistically distinguish discontinuous and continuous tracks based on the Akaike Information Criterion. Applying this method to APOGEE observations of the Sculptor dSph galaxy suggests an episodic star formation history with $\\sim$300 Myr quiescent periods. While current dwarf galaxy datasets are limited by small spectroscopic sample sizes, future surveys and extremely large telescopes will enable determining large numbers of precise chemical abundances, opening up the investigation of very short timescales in early dwarf galaxy formation. This unprecedentedly high time resolution of dwarf galaxy formation in the early Universe has important implications for understanding both reionization in the early Universe and the episodic star formation cycle of dwarf galaxies.\n\n", "2408.06744": "2024-08-13, **ASASSN-21js: A multi-year transit of a ringed disc**, T. H. Pramono et.al., [2408.06744v1](http://arxiv.org/abs/2408.06744v1)\n\n The early-type star ASASSN-21js started to fade in 2021, as was detected by the All Sky Automated Survey for Supernovae, undergoing a multi-year eclipse that is still underway. We interpret this event as being due to a structured disc of material transiting in front of the star. The disc is in orbit around a substellar object with the mass and luminosity of a brown dwarf or smaller. We want to determine the expected duration and ending date of the eclipse. We modelled a tilted and inclined azimuthally symmetric ring system around an unseen companion and calculated the resulting time-varying light curve as the object transited in front of the star. We made an initial estimate of the ring parameters and used these as inputs to an MCMC algorithm to determine the geometric properties of the rings with associated uncertainties. The model most consistent with the light curve to date is a two-ring system at high inclination with respect to the line of sight that has a semi-major axis of 71.6 stellar radii. With an estimate of the stellar radius, the transverse velocity is around 0.7 km/s, which if bound to the star is an orbit with a semi-major axis of around 13000 au, placing it in the Oort cloud of the parent star. The transit is ongoing and will finish around MJD 61526 (May 1 2027). We encourage the community to continue observing this object in order to understand its properties.\n\n"}}