{"neutrino": {"2304.13665": "2023-04-26, **Asymptotic Analysis on Binned Likelihood and Neutrino Floor**, Jian Tang et.al., [2304.13665v1](http://arxiv.org/abs/2304.13665v1)\n\n Observations of suspected coherent elastic neutrino-nucleus scatterings by dark matter direct detection experiments highlight the need for an investigation into the so-called ``neutrino floor\". We focus on the discovery limit, a statistical concept to identify the neutrino floor, and analyze the asymptotic behaviour of the profile binned likelihood ratio test statistic where the likelihood is constructed by variate from events in each bin and pull terms from neutrino fluxes. To achieve the asymptotic result, we propose two novel methods: i) Asymptotic-Analytic method, which furnishes the analytic result for large statistics, is applicable for more extra nuisance parameters, and enables the identification of the most relevant parameters in the statistical analysis; ii) Quasi-Asimov dataset, which is analogous to Asimov dataset but with improved speed. Applying our methods to the neutrino floor, we significantly accelerate the computation procedure compared to the previous literature, and successfully address cases where Asimov dataset fails. Our derivation on the asymptotic behavior of the test statistic not only facilitates research into the impact of neutrinos on the search for dark matter, but may also prove relevant in similar application scenarios.\n\n", "2304.13546": "2023-04-26, **Linking Resonant leptogenesis with dynamics of the inverse seesaw theory with $ A_{4} $ flavor symmetry**, Maibam Ricky Devi et.al., [2304.13546v1](http://arxiv.org/abs/2304.13546v1)\n\n In this paper, we analyse resonant leptogenesis in a low scale inverse seesaw model with $A\\_4$ flavor symmetry, in a model we explored earlier to explain light neutrino masses and mixings, and also charged lepton flavor violating decay $\\mu\\rightarrow e\\gamma$. Six $ A\\_{4} $ scalar singlets and one $ A\\_{4} $ fermion triplet are included, which are charged under the group $A\\_{4}\\times U(1)\\_{X} \\times Z\\_{5} \\times Z\\_{4} $, with at least two degenerate RH (Right Handed) neutrinos. The light neutrino masses and leptogenesis both share a same origin with the heavy right handed neutrinos. Thus, we expound the possibility of generating resonant leptogenesis in this model at energies as low as 1 TeV. We then analyse our findings to envision if our model inclines more towards weak or strong washout.\n\n", "2304.13491": "2023-04-26, **Neutrino Oscillations by a Manifestly Coherent Mechanism and Massless vs. Massive Neutrinos**, Anca Tureanu et.al., [2304.13491v1](http://arxiv.org/abs/2304.13491v1)\n\n The neutrino oscillations in vacuum are derived in a manifestly coherent scheme. The mechanism is operative in a quantum field theoretical framework, justifying nevertheless a formal analogy with quantum mechanical two- (or more) level systems and their oscillatory behaviour. Both the flavour states and the massive states are eigenstates of certain Hamiltonians which, in special conditions, can be argued to share the same Hilbert space. In this scheme, flavour neutrinos are massless and play the role of asymptotic states for any interactions, including the weak interactions, while massive neutrinos are effective propagation states. The vacuum is interpreted as a medium, where the flavour neutrinos undergo coherent forward scatterings which modify their energy and mix their flavour. The treatment of matter conversion and MSW effect fits in naturally; the extension to other neutral particle oscillations, like $K\\_0-\\bar K\\_0$, is straightforward. The scheme is eclectic insofar as it combines seamlessly quantum field theory and quantum mechanics.\n\n", "2304.13303": "2023-04-26, **Determination of neutrino mass ordering from Supernova neutrinos with T2HK and DUNE**, Papia Panda et.al., [2304.13303v1](http://arxiv.org/abs/2304.13303v1)\n\n In this paper we study the possibility of determining the neutrino mass ordering from the future supernova neutrino events at the DUNE and T2HK detectors. We estimate the expected number of neutrino event rates from a future supernova explosion assuming GKVM flux model corresponding to different processes that are responsible for detecting the supernova neutrinos at these detectors. We present our results in the form of $\\chi^2$, as a function of supernova distance. For a systematic uncertainty of 5\\%, our results show that, the neutrino mass ordering can be determined at $5 ~\\sigma$ C.L. if the supernova explosion occurs at a distance of 44 kpc for T2HK and at a distance of 6.5 kpc for DUNE. Our results also show that the sensitivity of T2HK gets affected by the systematic uncertainties for the smaller supernova distances. Further, we show that in both DUNE and T2HK, the sensitivity gets deteriorated to some extent due to presence of energy smearing of the neutrino events. This occurs because of the reconstruction of the neutrino energy from the energy-momentum measurement of the outgoing leptons at the detector.\n\n", "2304.13045": "2023-04-25, **Self-consistent optimization of the $z$-Expansion for $B$ meson decays**, Daniel Simons et.al., [2304.13045v1](http://arxiv.org/abs/2304.13045v1)\n\n We discuss the self-consistency imposed by the analyticity of regular parts of form factors, appearing in the $z$-expansion for semileptonic $B$-meson decays, when fitted in different kinematic regions. Relying on the uniqueness of functions defined by analytic continuation, we propose four metrics which measure the departure from the ideal analytic self-consistency. We illustrate the process using Belle data for $B\\rightarrow D\\ell \\nu\\_\\ell$. For this specific example, the metrics provide consistent indications that some choices (order of truncation, BGL or BCL) made in the form of the $z$-expansion can be optimized. However, other choices ($z$-origin, location of isolated poles and threshold constraints) appear to have very little effect on these metrics. We briefly discuss the implication for optimization of the $z$-expansion for nucleon form factors relevant for neutrino oscillation experiments.\n\n", "2304.13050": "2023-04-25, **Do we have enough evidence to invalidate the mean-field approximation adopted to model collective neutrino oscillations?**, Shashank Shalgar et.al., [2304.13050v1](http://arxiv.org/abs/2304.13050v1)\n\n Recent body of work points out that the mean-field approximation, widely employed to mimic the neutrino field within a neutrino-dense source, might give different results in terms of flavor evolution with respect to the correspondent many-body treatment. In this paper, we investigate whether such conclusions derived within a constrained framework should hold in an astrophysical context. We show that the plane waves, commonly adopted in the many-body literature to model the neutrino field, provide results that are crucially different with respect to the ones obtained using wavepackets of finite size streaming with a non-zero velocity. The many-body approach intrinsically includes coherent and incoherent scatterings. The mean-field approximation, on the other hand, only takes into account the coherent scattering in the absence of the collision term. Even if incoherent scatterings are included in the mean-field approach, the nature of the collision term is different from that in the many-body approach. Because of this, if only a finite number of neutrinos is considered, as often assumed, the two approaches naturally lead to different flavor outcomes. These differences are further exacerbated by vacuum mixing. We conclude that existing many-body literature, based on closed neutrino systems with a finite number of particles, is neither able to rule out nor assess the validity of the mean-field approach adopted to simulate the evolution of the neutrino field in dense astrophysical sources, which are open systems.\n\n", "2304.13044": "2023-04-25, **Repeated patterns of gamma-ray flares reveal structured jets of blazars as likely neutrino sources**, Polina Novikova et.al., [2304.13044v1](http://arxiv.org/abs/2304.13044v1)\n\n Fermi-LAT observations provide continuous and regularly-sampled measurements of gamma-ray photon flux for hundreds of blazars. Many of these light curves, spanning almost 15 years, have been thoroughly examined for periodicity in multiple studies. However, the possibility that blazars may exhibit irregularly repeating flaring patterns in their gamma-ray light curves has not been systematically explored. In this study, we aim to find repeating episodes of flaring activity in the 100 brightest blazars using Fermi-LAT light curves with various integration times. We use a Bayesian Blocks representation to convert the time series into strings of symbols and search for repeating sub-strings using a fuzzy search algorithm. As a result, we identify 27 repeated episodes in the gamma-ray light curves of 10 blazars. We find that the patterns are most likely produced in structured jets composed of a fast spine and a slower sheath. When individual emission features propagate in the spine, they scatter seed photons produced in the non-uniform sheath through the inverse Compton mechanism, resulting in a set of gamma-ray flares with a similar profile every such passage. Additionally, we explore the theoretically-predicted possibility that the spine-sheath structure facilitates the production of high-energy neutrinos in blazar jets. Using the catalogue of track-like events detected by the IceCube neutrino telescope, we find evidence supporting this hypothesis at a $3.5\\sigma$ significance level.\n\n", "2304.12675": "2023-04-25, **Search for correlations of high-energy neutrinos detected in IceCube with radio-bright AGN and gamma-ray emission from blazars**, R. Abbasi et.al., [2304.12675v1](http://arxiv.org/abs/2304.12675v1)\n\n The IceCube Neutrino Observatory sends realtime neutrino alerts with high probability of being astrophysical in origin. We present a new method to correlate these events and possible candidate sources using $2,089$ blazars from the Fermi-LAT 4LAC-DR2 catalog and with $3,413$ AGNs from the Radio Fundamental Catalog. No statistically significant neutrino emission was found in any of the catalog searches. The result is compatible with a small fraction, $<1$%, of AGNs being neutrino emitters and prior evidence for neutrino emission presented by IceCube and other authors from sources such as TXS 0506+056 and PKS 1502+06. We also present cross-checks to other analyses that claim a significant correlation using similar data samples, and we find that adding more information on the neutrino events and more data overall makes the result compatible with background.\n\n", "2304.12546": "2023-04-25, **Analyzing the time spectrum of supernova neutrinos to constrain their effective mass or Lorentz Invariance Violation**, C. A. Moura et.al., [2304.12546v1](http://arxiv.org/abs/2304.12546v1)\n\n We analyze the expected arrival time spectrum of supernova neutrinos using simulated luminosity and computing the expected number of events in future detectors such as the DUNE Far Detector and Hyper-Kamiokande. We develop a general method using minimum square statistics that can compute the sensitivity to any variable affecting neutrino time of flight. We apply this method in two different situations: First, we compare the time spectrum changes due to different neutrino mass values to put limits in electron (anti)neutrino effective mass. Second, we constrain Lorentz Invariance Violation through the mass scale, $M\\_{QG}$, at which it would occur. We consider two main neutrino detection techniques: 1. DUNE-like liquid argon TPC, for which the main detection channel is $\\nu\\_e +\\, ^{40}\\mbox{Ar} \\rightarrow e^- +\\, ^{40}\\mbox{K}^*$, related to the supernova neutronization burst, and 2. HyperK-like water Cherenkov detector, for which $\\bar \\nu\\_e + p \\rightarrow e^+ + n$ is the main detection channel. We consider a fixed supernova distance of 10~kpc and two different masses of the progenitor star: (i) 15~$M\\_\\odot$ with neutrino emission time up to 0.3~s and (ii) 11.2~$M\\_\\odot$ with neutrino emission time up to 10~s.The best mass limits at 3$\\sigma$ are of $\\mathcal{O}(1)$~eV. For $\\nu\\_e$, the best limit comes from a DUNE-like detector if the mass ordering happens to be inverted. For $\\bar \\nu\\_e$, the best limit comes from a HyperK-like detector. The best limit for the Lorentz Invariance Violation mass scale at 3$\\sigma$ level, considering superluminal or subluminal effect, is $M\\_{QG} \\gtrsim 10^{13}$~GeV ($M\\_{QG} \\gtrsim 5 \\times 10^{5}$~GeV) for linear (quadratic) energy dependence.\n\n", "2304.12538": "2023-04-25, **Thermal neutrino self-energy beyond the contact approximation**, Andrea Erdas et.al., [2304.12538v1](http://arxiv.org/abs/2304.12538v1)\n\n Using the Schwinger proper time method I calculate exactly the bubble diagram contribution to the thermal neutrino self-energy, obtaining exact results that cannot be achieved using the contact approximation. These results allow me to obtain the dispersion relation for neutrino in a medium under several different conditions.\n\n", "2304.12527": "2023-04-25, **Type-II Majoron Dark Matter**, Carla Biggio et.al., [2304.12527v1](http://arxiv.org/abs/2304.12527v1)\n\n We discuss in detail the possibility that the \"type-II majoron\" -- that is, the pseudo Nambu-Goldstone boson that arises in the context of the type-II seesaw mechanism if the lepton number is spontaneously broken by an additional singlet scalar -- account for the dark matter (DM) observed in the universe. We study the requirements the model's parameters have to fulfill in order to reproduce the measured DM relic abundance through two possible production mechanisms in the early universe, freeze-in and misalignment, both during a standard radiation-dominated era and early matter domination. We then study possible signals of type-II majoron DM and the present and expected constraints on the parameter space that can be obtained from cosmological observations, direct detection experiments, and present and future searches for decaying DM at neutrino telescopes and cosmic-ray experiments. We find that -- depending on the majoron mass, the production mechanism, and the value of the vacuum expectation value of the type-II triplet -- all of the three decay modes (photons, electrons, neutrinos) of majoron DM particles can yield observable signals at future indirect searches for DM. Furthermore, in a corner of the parameter space, detection of majoron DM is possible through electron recoil at running and future direct detection experiments.\n\n"}, "dark matter": {"2304.13585": "2023-04-26, **Merging galaxy clusters in IllustrisTNG**, Ewa L. Lokas et.al., [2304.13585v1](http://arxiv.org/abs/2304.13585v1)\n\n Mergers between galaxy clusters are an important stage in the formation of the large-scale structure of the Universe. Some of the mergers show a spectacular bow shock that formed as a result of recent passage of a smaller cluster through a bigger one, the classic example of this being the so-called bullet cluster. In this paper, I describe ten examples of interacting clusters identified among 200 of the most massive objects, with total masses above $1.4 \\times 10^{14}$ M$\\_{\\odot}$, from the IllustrisTNG300 simulation by searching for prominent bow shocks in their temperature maps. Despite different mass ratios of the two merging clusters, the events are remarkably similar in many respects. In all cases, the companion cluster passed close to the main one only once, between 0.9 and 0.3 Gyr ago, with the pericenter distance of 100-530 kpc and a velocity of up to 3400 km s$^{-1}$. The subcluster, typically an order of magnitude smaller in mass than the main cluster before the interaction, loses most of its dark matter and gas in the process. The displacement between the collisionless part of the remnant and the bow shock is such that the remnant typically lags behind the shock or coincides with it, with a single exception of the merger occurring with the largest velocity. Usually about 1% of the gas cells in the merging clusters are shocked, and the median Mach numbers of these gas cells are around two. Due to the relatively small size of the simulation box, no close analog of the bullet cluster was found, but I identified one case that is similar in terms of mass, velocity, and displacement. The presented cases bear more resemblance to less extreme observed interacting clusters such as A520 and Coma.\n\n", "2304.13576": "2023-04-26, **Stochastic gravitational-wave background at 3G detectors as a smoking gun for microscopic dark matter relics**, G. Franciolini et.al., [2304.13576v1](http://arxiv.org/abs/2304.13576v1)\n\n Microscopic horizonless relics could form in the early universe either directly through gravitational collapse or as stable remnants of the Hawking evaporation of primordial black holes. In both cases they completely or partially evade cosmological constraints arising from Hawking evaporation and in certain mass ranges can explain the entirety of the dark matter. We systematically explore the stochastic gravitational-wave background associated with the formation of microscopic dark-matter relics in various scenarios, adopting an agnostic approach and discussing the limitations introduced by existing constraints, possible ways to circumvent the latter, and expected astrophysical foregrounds. Interestingly, this signal is at most marginally detectable with current interferometers but could be detectable by third-generations instruments such as the Einstein Telescope, strengthening their potential as discovery machines.\n\n", "2304.13361": "2023-04-26, **Quark and lepton model with flavor specific dark matter and muon $g-2$ in modular $A_4$ and hidden $U(1)$ symmetries**, Takaaki Nomura et.al., [2304.13361v1](http://arxiv.org/abs/2304.13361v1)\n\n We propose a quark and lepton model explaining their masses, mixings, and CP violating phases, introducing modular $A\\_4$ and hidden gauged $U(1)$ symmetries. The hidden $U(1)$ brings us heavier Majorana fermions that are requested by chiral anomaly cancellations, and we work on a canonical seesaw scenario due to their neutral particles.In this framework, we search for favorite parameter space to satisfy both the experimental values and show predictions, applying the $\\chi$ square analysis.Then, we discuss a bosonic dark matter candidate that only annihilates into muon state due to the modular $A\\_4$ flavor symmetry where we suppose the main interaction of dark matter to be Yukawa terms. And we study muon anomalous magnetic dipole moment where there are not any constraints of lepton flavor violations thanks to this flavor symmetry. Finally, we show the allowed space to satisfy the observed relic density of dark matter and the muon anomalous magnetic dipole moment.\n\n", "2304.13325": "2023-04-26, **Exploring CP-violation in $Y=0$ inert triplet with real singlet**, Shilpa Jangid et.al., [2304.13325v1](http://arxiv.org/abs/2304.13325v1)\n\n In this article, we examine the Standard Model extended with a $Y=0$ Higgs triplet and a real singlet. We consider the Higgs triplet to be odd under the $Z\\_2$ symmetry, and hence the lightest stable particle from the inert triplet becomes the dark matter candidate, whereas the real singlet is considered to be even under the $Z\\_2$ symmetry. A dimension-5 effective term is introduced with the help of a real singlet, which breaks the CP symmetry and gives an additional source of CP-violation in the fermion sector. The phase transition proceeds in two-steps, with the symmetry breaking in the singlet direction occurring first and later leading to the usual electroweak symmetry breaking minima, while electroweak baryogenesis is associated with the second step. The parameters chosen for the electroweak phase transition are found to be consistent with the Planck scale stability and the perturbativity using two-loop $\\beta$-functions. The DM mass bound for inert triplet, i.e., 1.2 TeV (below which it is under abundance), also comes out to be consistent with the strongly first-order phase transition, which was not possible solely with inert triplet. The upper bound on the triplet mass comes out to be $\\leq 3.8$ TeV, which satisfies the strongly first-order phase transition. This particular benchmark point also satisfies the correct baryon asymmetry of the Universe $(6.13 \\times 10^{-11})$, and the gravitational wave spectrum also lies within the detectable frequency range of LISA $(6.978 \\times 10^{-4} - 1.690 \\times 10^{-2} )$ Hz and BBO $(2.80\\times 10^{-3}-1.096)$ Hz experiments.\n\n", "2304.13243": "2023-04-26, **Direct detection of finite-size dark matter via electron recoil**, Wenyu Wang et.al., [2304.13243v1](http://arxiv.org/abs/2304.13243v1)\n\n In direct dark matter (DM) detection via scattering off the electrons, the momentum transfer plays a crucial role. Previous work showed that for self-interacting DM, if the DM particle has a size (the so-called puffy DM), the radius effect could dominate the momentum transfer and become another source of velocity dependence for self-scattering cross section. In this work we investigate the direct detection of puffy DM particles with different radii through electron recoil. We find that comparing with the available experimental exclusion limits dominated by the mediator effect for XENON10, XENON100 and XENON1T, the constraints on the puffy DM-electron scattering cross-section become much weaker for large radius DM particles. For small-radius DM particles, the constraints remain similar to the point-like DM case.\n\n", "2304.13137": "2023-04-25, **Data Analysis of three parameter models of deceleration parameter in FRW Universe**, Amine Bouali et.al., [2304.13137v1](http://arxiv.org/abs/2304.13137v1)\n\n Constraining the dark energy deceleration parameter is one of the fascinating topics in the recent cosmological paradigm. This work aims to reconstruct the dark energy using parametrization of the deceleration parameter in a flat FRW universe filled with radiation, dark energy, and pressure-less dark matter. Thus, we have considered four well-motivated parameterizations of q(z), which can provide the evolution scenario from the deceleration to acceleration phase of the Universe. We have evaluated the expression of the corresponding Hubble parameter of each parametrization by imposing it into the Friedmann equation. We have constrained the model parameter through H(z), Pantheon, and baryons acoustic oscillation (BOA) data. Next, we have estimated the best-fit values of the model parameters by using Monte Carlo Markov Chain (MCMC) technique and implementing H(z)+ BAO+SNe-Ia dataset. Then we analyzed the cosmographic parameter, such as deceleration, jerk, and snap parameters, graphically by employing the best-fit values of the model parameter. Moreover, we have analyzed statefinder and Om diagnostics parameters for each scenario to discriminate various dark energy models. Using the information criteria, the viability of the models have examined. In the end, we have analogized our outcomes with the standard {\\Lambda}CDM model to examine the viability of our models\n\n", "2304.13054": "2023-04-25, **Boson Star Normal Modes**, James Hung-Hsu Chan et.al., [2304.13054v1](http://arxiv.org/abs/2304.13054v1)\n\n Boson stars are gravitationally bound objects that arise in ultralight dark matter models and form in the centers of galactic halos or axion miniclusters. We systematically study the excitations of a boson star, taking into account the mixing between positive and negative frequencies introduced by gravity. We show that the spectrum contains zero-energy modes in the monopole and dipole sectors resulting from spontaneous symmetry breaking by the boson star background. We analyze the general properties of the eigenmodes and derive their orthogonality and completeness conditions which have non-standard form due to the positive-negative frequency mixing. The eigenvalue problem is solved numerically for the first few energy levels in different multipole sectors and the results are compared to the solutions of the Schr\\\"odinger equation in fixed boson star gravitational potential. The two solutions differ significantly for the lowest modes, but get close for higher levels. We further confirm the normal mode spectrum in 3D wave simulations where we inject perturbations with different multipoles. As an application of the normal mode solutions, we compute the matrix element entering the evaporation rate of a boson star immersed in a hot axion gas. The computation combines the use of exact wavefunctions for the low-lying bound states and of the Schr\\\"odinger approximation for the high-energy excitations.\n\n", "2304.13053": "2023-04-25, **Halo Formation from Yukawa Forces in the Very Early Universe**, Guillem Domènech et.al., [2304.13053v1](http://arxiv.org/abs/2304.13053v1)\n\n If long-range attractive forces exist and are stronger than gravity then cosmic halo formation can begin in the radiation-dominated era. We study a simple realization of this effect in a system where dark matter fermions have Yukawa interactions mediated by scalar particles, analogous to the Higgs boson in the standard model. We develop a self-consistent description of the system including exact background dynamics of the scalar field, and precise modelling of the fermion density fluctuations. For the latter, we provide accurate approximations for the linear growth as well as quantitative modelling of the nonlinear evolution using N-body simulations. We find that halo formation occurs exponentially fast and on scales substantially larger than simple estimates predict. The final fate of these halos remains uncertain, but could be annihilation, dark stars, primordial black holes, or even the existence of galaxy-sized halos at matter-radiation equality. More generally, our results demonstrate the importance of mapping scalar-mediated interactions onto structure formation outcomes and constraints for beyond the standard model theories.\n\n", "2304.12621": "2023-04-25, **Evolution of Resonant Self-interacting Dark Matter Halos**, Ayuki Kamada et.al., [2304.12621v1](http://arxiv.org/abs/2304.12621v1)\n\n Recent analysis on the stellar kinematics of ultra-faint dwarf (UFD) galaxies has put a stringent upper limit on the self-scattering cross section of dark matter, i.e., $\\sigma/m<{\\cal O}(0.1)\\,{\\rm cm^2/g}$ at the scattering velocity of ${\\cal O}(10)\\,{\\rm km/s}$. Resonant self-interacting dark matter (rSIDM) is one possibility that can be consistent with the UFDs and explain the low central densities of rotation-supported galaxies; the cross section is resonantly enhanced to be $\\sigma/m = {\\cal O}(1)\\,{\\rm cm^2/g}$ around the scattering velocity of ${\\cal O}(100)\\,{\\rm km/s}$ while being suppressed at lower velocities. To further assess this possibility, since the inferred dark matter distribution of halos from astrophysical observations is usually compared to that in constant-cross section SIDM (cSIDM), whether the structures of rSIDM halos can be approximated by the cSIDM halo profiles needs to be clarified. In this work, we employ the grovothermal fluid method to investigate the structural evolution of rSIDM halos in a wide mass range. We find that except for halos in a specific mass range, the present structures of rSIDM halos are virtually indistinguishable from those of the cSIDM halos. For halos in the specific mass range, the resonant self-scattering renders a break in their density profile. We demonstrate how such a density-profile break appears in astrophysical observations, e.g., rotation curves and line-of-sight velocity dispersion profiles. We show that for halos above the specific mass range, the density-profile break thermalizes to disappear before the present. We demonstrate that such distinctive thermalization dynamics can leave imprints on the orbital classes of stars with similar ages and metallicities.\n\n", "2304.12613": "2023-04-25, **Can a variation of Fine Structure Constant influence the fate of Gravitational Collapse?**, Soumya Chakrabarti et.al., [2304.12613v1](http://arxiv.org/abs/2304.12613v1)\n\n We show that it is possible to steer clear of a spacetime singularity during gravitational collapse by considering the time-variation of a fundamental coupling, in this case, the fine structure constant {\\alpha}. We study a spherical distribution of cold dark matter coexisting with other fluid elements, collapsing under its own gravity. Dark matter is written as a scalar field interacting with electrically charged matter. This leads to a time variation of {\\alpha} and as a consequence, a breakdown of local charge conservation within the sphere. The exterior has no such field and therefore, Einstein's GR and standard equivalence principles remain valid. We derive the lowest possible bound on the collapse of this sphere beyond which there is a bounce and dispersal of most of the accumulated matter. We discuss the critical behavior of the system around this point and show that the bound is connected to a length scale of the order of Planck, introduced in theory for dimensional requirements.\n\n", "2304.12558": "2023-04-25, **Inflationary E-models revisited**, Daniel Frolovsky et.al., [2304.12558v1](http://arxiv.org/abs/2304.12558v1)\n\n The E-type $\\alpha$-attractor models of single-field inflation were generalized further in order to accommodate production of primordial black holes (PBH) via adding a near-inflection point to the inflaton scalar potential at smaller scales, in good agreement with measurements of the cosmic microwave background (CMB) radiation. A minimal number of new parameters was used but their fine-tuning was maximized in order to increase possible masses of PBH formed during an ultra-slow-roll phase leading to a large enhancement of the power spectrum of scalar (curvature) perturbations by 6 or 7 orders of magnitude against the power spectrum of perturbations observed in CMB. It was found that extreme fine-tuning of the parameters in our models can lead to a formation of the Earth-size PBH with the masses of approximately $10^{27}$ g, still in agreement with CMB observations. Quantum corrections are known to lead to the perturbative upper bound on the amplitude of large scalar perturbations responsible for PBH production. The quantum (one-loop) corrections in our models were found to be suppressed by one order of magnitude for PBH with the masses of approximately $10^{19}$ g, which may form the whole dark matter in the Universe.\n\n", "2304.12553": "2023-04-25, **Energy extraction from rotating hairy black hole via magnetic reconnection mechanism**, Zhen Li et.al., [2304.12553v1](http://arxiv.org/abs/2304.12553v1)\n\n The magnetic reconnection in the ergosphere has been shown to be a promising mechanism to extract energy from the rotating Kerr black hole. In this work, we investigate the role of magnetic reconnection in energy extraction from the newly suggested rotating hairy black holes which have an extra hair due to the additional surrounding sources, such as dark matter or dark energy. We examine how the hairy parameters characterized the hair affect the magnetic reconnection process in addition to other important variables of the magnetic reconnection process, including the parameter spaces that permit energy extraction, the power, efficiency and power ratios with respect to the Blandford-Znajek mechanism.\n\n"}, "supernova": {"2304.13508": "2023-04-26, **Infrared spectroscopy of the 2022 eruption of the recurrent nova U Sco**, A. Evans et.al., [2304.13508v1](http://arxiv.org/abs/2304.13508v1)\n\n We present near-infrared spectroscopy of the 2022 eruption of the recurrent nova U Sco, over the period from 5.2 to 45.4 days after outburst. This is the most intensive infrared study of this nova. Our observations started early after the outburst and extended almost to the end of the ``Super Soft'' X-ray phase. A major find is the presence of coronal lines from day 9.41, one of the earliest appearances of these in any nova, classical or recurrent. The temperature of the coronal gas is $7\\times10^5$ K. There is also evidence for the presence of much cooler ($\\lesssim2.5\\times10^4$ K) gas. Remarkable changes are seen in the HeI $1.083\\mu$m line, the strength of which declines, then recovers, in anti-correlation with the X-ray behaviour. We conclude that shock ionisation is the dominant excitation mechanism for the coronal line emission. There is evidence in the infrared spectra for the presence of black body emission at $\\sim20000$ K, which we tentatively identify with the irradiated secondary, and for free-free/free-bound emission. For the previously determined binary inclination of $82.7$ degrees, the implied ejection velocities are as high as 22000 km s$^{-1}$. These velocities appear unprecedented in nova outflows, and are comparable to those seen in supernovae, thereby marking U Sco as a truly remarkable object.\n\n", "2304.13080": "2023-04-25, **Multi-scale stamps for real-time classification of alert streams**, Ignacio Reyes-Jainaga et.al., [2304.13080v1](http://arxiv.org/abs/2304.13080v1)\n\n In recent years, automatic classifiers of image cutouts (also called \"stamps\") have shown to be key for fast supernova discovery. The upcoming Vera C. Rubin Observatory will distribute about ten million alerts with their respective stamps each night, which it is expected to enable the discovery of approximately one million supernovae each year. A growing source of confusion for these classifiers is the presence of satellite glints, sequences of point-like-sources produced by rotating satellites or debris. The currently planned Rubin stamps will have a size smaller than the typical separation between these point sources. Thus, a larger field of view image stamp could enable the automatic identification of these sources. However, the distribution of larger field of view stamps would be limited by network bandwidth restrictions. We evaluate the impact of using image stamps of different angular sizes and resolutions for the fast classification of events (AGNs, asteroids, bogus, satellites, SNe, and variable stars), using available data from the Zwicky Transient Facility survey. We compare four scenarios: three with the same number of pixels (small field of view with high resolution, large field of view with low resolution, and a proposed multi-scale strategy) and a scenario with the full ZTF stamp that has a larger field of view and higher resolution. Our multi-scale proposal outperforms all the scenarios, with a macro f1-score of 87.39. We encourage Rubin and its Science Collaborations to consider the benefits of implementing multi-scale stamps as a possible update to the alert specification.\n\n", "2304.12913": "2023-04-25, **Europium enrichment and hierarchical formation of the Galactic halo**, L. Cavallo et.al., [2304.12913v1](http://arxiv.org/abs/2304.12913v1)\n\n Context. The origin of the large star-to-star variation of the [Eu/Fe] ratios observed in the extremely metal-poor (at [Fe/H]$\\leq-3$) stars of the Galactic halo is still a matter of debate.\\\\ Aims. In this paper, we explore this problem by putting our stochastic chemical evolution model in the hierarchical clustering framework, with the aim of explaining the observed spread in the halo.\\\\ Methods. We compute the chemical enrichment of Eu occurring in the building blocks that have possibly formed the Galactic halo. In this framework, the enrichment from neutron star mergers can be influenced by the dynamics of the binary systems in the gravitational potential of the original host galaxy. In the least massive systems, the neutron stars can merge outside the host galaxy and so only a small fraction of newly produced Eu can be retained by the parent galaxy itself.\\\\ Results. In the framework of this new scenario, the accreted merging neutron stars are able to explain the presence of stars with sub-solar [Eu/Fe] ratios at [Fe/H]$\\leq-3$, but only if we assume a delay time distribution for merging of the neutron stars $\\propto t^{-1.5}$. We confirm the correlation between the dispersion of [Eu/Fe] at a given metallicity and the fraction of massive stars which give origin to neutron star mergers. The mixed scenario, where both neutron star mergers and magneto-rotational supernovae do produce Eu, can explain the observed spread in the Eu abundance also for a delay time distribution for mergers going either as $\\propto t^{-1}$ or $\\propto t^{-1.5}$.\n\n"}}