{"neutrino": {"2305.16249": "2023-05-25, **First measurement of $η$ production in neutrino interactions on argon with MicroBooNE**, MicroBooNE collaboration et.al., [2305.16249v1](http://arxiv.org/abs/2305.16249v1)\n\n We present a measurement of $\\eta$ production from neutrino interactions on argon with the MicroBooNE detector. The modeling of resonant neutrino interactions on argon is a critical aspect of the neutrino oscillation physics program being carried out by the DUNE and Short Baseline Neutrino programs. $\\eta$ production in neutrino interactions provides a powerful new probe of resonant interactions, complementary to pion channels, and is particularly suited to the study of higher-order resonances beyond the $\\Delta(1232)$. We measure a flux-integrated cross section for neutrino-induced $\\eta$ production on argon of $3.22 \\pm 0.84 \\; \\textrm{(stat.)} \\pm 0.86 \\; \\textrm{(syst.)}$ $10^{-41}{\\textrm{cm}}^{2}$/nucleon. By demonstrating the successful reconstruction of the two photons resulting from $\\eta$ production, this analysis enables a novel calibration technique for electromagnetic showers in GeV accelerator neutrino experiments.\n\n", "2305.16234": "2023-05-25, **Capability of the proposed long-baseline experiments to probe large extra dimension**, Samiran Roy et.al., [2305.16234v1](http://arxiv.org/abs/2305.16234v1)\n\n Future long-baseline experiments will play an important role in exploring physics beyond the standard model. One such new physics concept is the large extra dimension (LED), which provides an elegant solution to the hierarchy problem. This model also explains the small neutrino mass in a natural way. The presence of LED modifies the standard neutrino oscillation probabilities. Hence, the long-baseline experiments are sensitive to the LED parameters. We explore the potential of the three future long-baseline neutrino experiments, namely T2HK, ESSnuSB, and DUNE, to probe the LED parameter space. We also compare the capability of the charged and neutral current measurements at DUNE to constrain the LED model. We find that T2HK will provide more stringent bounds on the largest compactification radius ($R\\_{\\rm{ED}}$) compared to the DUNE and ESSnuSB experiments. At $90\\%$ C.L., T2HK can exclude $R\\_{\\rm{ED}}\\sim 0.45~(0.425)$ $\\mu$m for the normal (inverted) mass hierarchy scenario.\n\n", "2305.16146": "2023-05-25, **An Optically Targeted Search for Gravitational Waves emitted by Core-Collapse Supernovae during the Third Observing Run of Advanced LIGO and Advanced Virgo**, Marek J. Szczepańczyk et.al., [2305.16146v1](http://arxiv.org/abs/2305.16146v1)\n\n We present the results from a search for gravitational-wave transients associated with core-collapse supernovae observed optically within 30 Mpc during the third observing run of Advanced LIGO and Advanced Virgo. No gravitational wave associated with a core-collapse supernova has been identified. We then report the detection efficiency for a variety of possible gravitational-wave emissions. For neutrino-driven explosions, the distance at which we reach 50% detection efficiency is up to 8.9 kpc, while more energetic magnetorotationally-driven explosions are detectable at larger distances. The distance reaches for selected models of the black hole formation, and quantum chromodynamics phase transition are also provided. We then constrain the core-collapse supernova engine across a wide frequency range from 50 Hz to 2 kHz. The upper limits on gravitational-wave energy and luminosity emission are at low frequencies down to $10^{-4}\\,M\\_\\odot c^2$ and $5 \\times 10^{-4}\\,M\\_\\odot c^2$/s, respectively. The upper limits on the proto-neutron star ellipticity are down to 5 at high frequencies. Finally, by combining the results obtained with the data from the first and second observing runs of LIGO and Virgo, we improve the constraints of the parameter spaces of the extreme emission models. Specifically, the proto-neutron star ellipticities for the long-lasting bar mode model are down to 1 for long emission (1 s) at high frequency.\n\n", "2305.15211": "2023-05-24, **Bilinear R-parity violating supersymmetry under the light of neutrino oscillation, higgs and flavor data**, Arghya Choudhury et.al., [2305.15211v1](http://arxiv.org/abs/2305.15211v1)\n\n In this work, we explore a well motivated beyond the Standard Model scenario, namely, R-parity violating Supersymmetry, in the context of light neutrino masses and mixing. We assume that the R-parity is only broken by the lepton number violating bilinear term. We try to fit two non-zero neutrino mass square differences and three mixing angle values obtained from the global $\\chi^2$ analysis of neutrino oscillation data. We have also taken into account the updated data of the standard model (SM) Higgs mass and its coupling strengths with other SM particles from LHC Run-II along with low energy flavor violating constraints like rare b-hadron decays. We have used a Markov Chain Monte Carlo (MCMC) analysis to constrain the new physics parameter space. While doing so, we ensure that all the existing collider constraints are duly taken into account. Through our analysis we have derived the most stringent constraints possible till date with existing data on the 9 bilinear R-parity violating parameters along with $\\mu$ and $\\tan\\beta$. We further explore the possibility of explaining the anomalous muon (g - 2) measurement staying within the parameter space allowed by neutrino, Higgs and flavor data while satisfying the collider constraints as well. We find that there still remains a small sub-TeV parameter space where the required excess can be obtained.\n\n", "2305.14931": "2023-05-24, **Search for Majorana neutrinos in same-sign $WW$ scattering events from $pp$ collisions at $\\sqrt{s}=13$ TeV**, ATLAS Collaboration et.al., [2305.14931v1](http://arxiv.org/abs/2305.14931v1)\n\n A search for Majorana neutrinos in same-sign $WW$ scattering events is presented. The analysis uses $\\sqrt{s}= 13$ TeV proton-proton collision data with an integrated luminosity of 140 fb$^{-1}$ recorded during 2015-2018 by the ATLAS detector at the Large Hadron Collider. The analysis targets final states including exactly two same-sign muons and at least two hadronic jets well separated in rapidity. The modelling of the main backgrounds, from Standard Model same-sign $WW$ scattering and $WZ$ production, is constrained with data in dedicated signal-depleted control regions. The distribution of the transverse momentum of the second-hardest muon is used to search for signals originating from a heavy Majorana neutrino with a mass between 50 GeV and 20 TeV. No significant excess is observed over the background expectation. The results are interpreted in a benchmark scenario of the Phenomenological Type-I Seesaw model. In addition, the sensitivity to the Weinberg operator is investigated. Upper limits at the 95% confidence level are placed on the squared muon-neutrino-heavy-neutrino mass-mixing matrix element $\\vert V\\_{\\mu N} \\vert^{2}$ as a function of the heavy Majorana neutrino's mass $m\\_N$, and on the effective $\\mu\\mu$ Majorana neutrino mass $\\|m\\_{\\mu\\mu}\\|$.\n\n"}, "dark matter": {"2305.16293": "2023-05-25, **Cosmic Energy Density: Particles, Fields and the Vacuum**, Cristian Armendariz-Picon et.al., [2305.16293v1](http://arxiv.org/abs/2305.16293v1)\n\n We revisit the cosmic evolution of the energy density of a quantized free scalar field and assess under what conditions the particle production and classical field approximations reproduce its correct value. Because the unrenormalized energy-momentum tensor diverges in the ultraviolet, it is necessary to frame our discussion within an appropriate regularization and renormalization scheme. Pauli-Villars avoids some of the drawbacks of adiabatic subtraction and dimensional regularization and is particularly convenient in this context. In some cases, we can predict the evolution of the energy density irrespectively of the quantum state of the field modes. To further illustrate our results we focus however on the {\\it in} vacuum, the preferred quantum state singled out by inflation, and explore to what extent the latter determines the subsequent evolution of the energy density regardless of the unknown details of reheating. We contrast this discussion with examples of transitions to radiation domination that avoid some of the problems of the one commonly studied in the literature, and point out some instances in which the particle production or the classical field approximations lead to the incorrect energy density. Along the way, we also elaborate on the connection of our analysis to dynamical dark energy models and axion-like dark matter candidates.\n\n", "2305.16290": "2023-05-25, **Model-independent reconstruction of the Interacting Dark Energy Kernel: Binned and Gaussian process**, Luis A. Escamilla et.al., [2305.16290v1](http://arxiv.org/abs/2305.16290v1)\n\n The cosmological dark sector remains an enigma, offering numerous possibilities for exploration. One particularly intriguing option is the (non-minimal) interaction scenario between dark matter and dark energy. In this paper, to investigate this scenario, we have implemented Binned and Gaussian model-independent reconstructions for the interaction kernel alongside the equation of state; while using data from BAOs, Pantheon+ and Cosmic Chronometers. In addition to the reconstruction process, we conducted a model selection to analyze how our methodology performed against the standard $\\Lambda$CDM model. Our results revealed a slight indication for some oscillatory dynamics in the interaction kernel and, as a by-product, also in DE and DM. A consequence of this outcome is the possibility of a sign change in the direction of the energy transfer between DE and DM and a possible transition from a negative DE energy density in early-times to a positive one at late-times. While our reconstructions provided a better fit to the data compared to the standard model, the Bayesian Evidence showed an intrinsic penalization due to the extra degrees of freedom. Nevertheless these reconstructions could be used as a basis for other physical models with lower complexity but similar behavior.\n\n", "2305.16200": "2023-05-25, **Convergence of small scale Ly$α$ structure at high-$z$ under different reionization scenarios**, Caitlin C. Doughty et.al., [2305.16200v1](http://arxiv.org/abs/2305.16200v1)\n\n The Ly$\\alpha$ forest (LAF) at $z>5$ probes the thermal and reionization history of the intergalactic medium (IGM) and the nature of dark matter, but its interpretation requires comparison to cosmological hydrodynamical simulations. At high-$z$, convergence of these simulations is more exacting since transmission is dominated by underdense voids that are challenging to resolve. With evidence mounting for a late end to reionization, small structures down to the sub-kpc level may survive to later times than conventionally thought due to the reduced time for pressure smoothing to impact the gas, further tightening simulation resolution requirements. We perform a suite of simulations using the Eulerian cosmological hydrodynamics code Nyx, spanning domain sizes of 1.25-10 $h^{-1}$ Mpc and 5-80 $h^{-1}$ kpc cells, and explore the interaction of these variables with the timing of reionization on the properties of the matter distribution and the simulated LAF at $z=5.5$. In observable Ly$\\alpha$ power, convergence within 10% is achieved for $k< 0.1$ s/km, but larger $k$ shows deviation of up to 20 percent. While a later reionization retains more small structure in the density field, because of the greater thermal broadening there is little difference in the convergence of LAF power between early ($z=9$) and later ($z=6$) reionizations. We conclude that at $z\\sim5.5$, resolutions of 10 kpc are necessary for convergence of LAF power at $k<0.1$ s/km, while higher-$k$ modes require higher resolution, and that the timing of reionization does not significantly impact convergence given realistic photoheating.\n\n", "2305.16176": "2023-05-25, **A Parametric Model for Self-Interacting Dark Matter Halos**, Daneng Yang et.al., [2305.16176v1](http://arxiv.org/abs/2305.16176v1)\n\n We propose a parametric model for studying self-interacting dark matter (SIDM) halos. The model uses an analytical density profile, calibrated using a controlled N-body SIDM simulation that covers the entire gravothermal evolution, including core-forming and -collapsing phases. By normalizing the calibrated density profile, we obtain a universal description for SIDM halos at any evolution phase. The model allows us to infer properties of SIDM halos based on their cold dark matter (CDM) counterparts. As a basic application, we only require two characteristic parameters of an isolated CDM halo at $z=0$. We then extend the model to incorporate effects induced by halo mass changes, such as major mergers or tidal stripping, making it applicable to both isolated halos and subhalos. The parametric model is tested and validated using cosmological zoom-in SIDM simulations available in the literature.\n\n", "2305.16169": "2023-05-25, **Dark Higgs Bosons at Colliders**, Torben Ferber et.al., [2305.16169v1](http://arxiv.org/abs/2305.16169v1)\n\n The Large Hadron Collider (LHC) has confirmed the Higgs mechanism to be responsible for generating mass in the Standard Model (SM), making it attractive to also consider spontaneous symmetry breaking as the origin of mass for new particles in a dark sector extension of the SM. Such a dark Higgs mechanism may in particular give mass to a dark matter candidate and to the gauge boson mediating its interactions (called dark photon). In this review we summarise the phenomenology of the resulting dark Higgs boson and discuss the corresponding search strategies with a focus on collider experiments. We consider both the case that the dark Higgs boson is heavier than the SM Higgs boson, in which case leading constraints come from direct searches for new Higgs bosons as well missing-energy searches at the LHC, and the case that the dark Higgs boson is (potentially much) lighter than the SM Higgs boson, such that the leading sensitivity comes from electron-positron colliders and fixed-target experiments. Of particular experimental interest for both cases is the associated production of a dark Higgs boson with a dark photon, which subsequently decays into SM fermions, dark matter particles or long-lived dark sector states. We also discuss the important role of exotic decays of the SM-like Higgs boson and complementary constraints arising from early-universe cosmology, astrophysics and direct searches for dark matter in laboratory experiments.\n\n", "2305.15736": "2023-05-25, **Non-thermal warm dark matter limits from small-scale structure**, Arka Banerjee et.al., [2305.15736v1](http://arxiv.org/abs/2305.15736v1)\n\n We present small-scale structure constraints on sterile dark matter produced from a heavy mediator particle, inspired by models of moduli decay. Dark matter particles produced through this mechanism can contribute to the entire dark matter energy density but the particles have a non-thermal phase-space distribution; however, we show that the resulting linear matter power spectra can be mapped to effective thermal-relic warm dark matter models. This production mechanism is therefore subject to warm dark matter constraints from small-scale structure as probed by ultra-faint dwarf galaxy abundances and strong gravitational lensing flux ratio statistics. We use the correspondence to thermal-relic models to derive a lower bound on the non-thermal particle mass of $107\\ \\mathrm{keV}$, at $95\\%$ confidence. These are the first and most stringent constraints derived on sterile dark matter produced via the heavy mediator decay scenario we consider.\n\n", "2305.15517": "2023-05-24, **Nuclear star clusters as probes of dark matter halos: the case of the Sagittarius Dwarf Spheroidal Galaxy**, Robin Herlan et.al., [2305.15517v1](http://arxiv.org/abs/2305.15517v1)\n\n The Sagittarius dwarf spheroidal (Sgr dSph) galaxy is currently being accreted and disrupted by the tidal field of the Milky Way. Recent observations have shown that the central region of the dwarf hosts at least three different stellar populations, ranging from old and metal-poor over intermediate metal-rich to young metal-rich. While the intermediate-age metal-rich population has been identified as part of the galaxy, the oldest and youngest populations belong to M54, the nuclear star cluster (NSC) of the Sgr dSph galaxy. The old metal-poor component of M54 has been interpreted as at least one decayed GC which was initially orbiting its host galaxy. The youngest population formed in situ from gas accreted into M54 after its arrival at the centre of the host. In this work, we use the observed properties of M54 to explore the shape of the inner density profile of the Sgr dSph galaxy. To do so, we simulate the decay of M54 towards the centre of the dark matter (DM) halo of its host. We model the DM density profile using different central slopes, and we compare the results of the simulations to the most recent observations of the structural properties of M54. From this comparison, we conclude that a GC that decays in a DM halo with a density profile $\\propto r^{-\\gamma}$ and $\\gamma \\leq 1$ shows a rotational signal and flattening comparable to those observed for M54. Steeper profiles produce, instead, highly rotating and more flattened NSCs which do not match the properties of M54.\n\n", "2305.15478": "2023-05-24, **Exploring the centre of mass properties of LG-like galaxies**, Jean-Baptiste Salomon et.al., [2305.15478v1](http://arxiv.org/abs/2305.15478v1)\n\n From high resolution cosmological simulations of the Local Group in realistic environment, namely HESTIA simulations, we study the position and kinematic deviations that may arise between the disc of a Milky Way (or Andromeda)-like galaxy and its halo. We focus on the 3-dimensional analysis of the centres of mass (COM). The study presents two parts. We first consider individual particles to track down the very nature and amplitude of the physical deviations of the COM with respect to the distance from the disc centre. Dark matter dominates the behaviour of the COM of all particles at all distances. But the total COM is also very close to the COM of stars. In the absence of a significant merger, the velocity offsets are marginal (10 km/s) but the positional shifts can be important compared to the disc characteristics (>10 kpc). In the event of a massive accretion, discrepancies are of the same order as the recent finding for the MW under the Magellanic Clouds influence. In a second part, the accent is put on the study of various populations of subhaloes and satellites. We show that satellites properly represent the entire subhalo population. There exists strong mismatch in phase space between the satellites' COM and the host disc. Moreover, the results are highly inhomogeneous between the simulations, and thus between the accretion histories. Finally, we point out that these shifts are mainly due to a few of the most massive objects.\n\n", "2305.15473": "2023-05-24, **Worldline effective field theory of inspiralling black hole binaries in presence of dark photon and axionic dark matter**, Arpan Bhattacharyya et.al., [2305.15473v1](http://arxiv.org/abs/2305.15473v1)\n\n We investigate the correction to the potential that gives rise to the bound orbits and radiation from non-spinning inspiralling binary black holes in a dark matter environment consisting of axion-like particles and dark photons using the techniques of Worldline Effective Field Theory. We compute the conservative dynamics up to $1$PN order for gravitational, electromagnetic, and Proca fields and up to $2$PN order for the scalar field. The effect of axion-electromagnetic coupling ($g\\_{a\\gamma\\gamma}$) arises to the conservative dynamics at $2.5$PN order and the kinetic mixing constant ($\\gamma$) at $1$PN order. Furthermore, we calculate the radiation due to the various fields present in our theory. We find that the contribution of $g\\_{a\\gamma\\gamma}$ to the gravitational radiation appears at $N^{(7)}LO$ and to the scalar radiation appears at $N^{(5)}LO$. We also find that these radiative corrections due to the coupling $g\\_{a\\gamma\\gamma}$ vanishes for any orbit confined to a plane because of the existence of a binormal like term in effective radiative action but give rise to non-zero contributions for any orbit that lies in three dimensions. Last but not the least, $\\gamma$ contributes to the gravitational radiation at $N^{(2)}LO$ and $N^{(4)}LO$.\n\n", "2305.15462": "2023-05-24, **Transverse velocities and matter gradient correlations: a new signal and a new challenge to moving-lens analyses**, Selim C. Hotinli et.al., [2305.15462v1](http://arxiv.org/abs/2305.15462v1)\n\n An observer that is moving towards a high-density region sees, on average, a higher matter density and more foreground-emitting sources ahead than behind themself. Consequently, the average abundance and luminosity of objects producing cosmological signals around an in-falling dark matter halo is larger in the direction of the halo's motion. In this Letter, we demonstrate this effect from simulated cosmological maps of the thermal Sunyaev Zel'dovich effect and the cosmic infrared background. We find that, for a wide range of halo masses and redshifts, oriented stacked profiles of these foregrounds show significant, potentially detectable gradients aligned with the transverse velocity of halos. The signal depends on the halo's mass and redshift, as well as the physical properties of the cosmic web surrounding the halos. We show that this signal is sufficiently prominent to be detected in future Cosmic Microwave Background experiments, therefore offering a new window into the study of cosmological structures. We argue that the dipolar morphological structure of this signal, its orientation, as well as its overall large amplitude, constitute a challenge for the detection of the transverse velocity through the study of the moving lens effect for stacked halos.\n\n", "2305.15185": "2023-05-24, **Recent results from continuous gravitational wave searches using data from LIGO/Virgo/KAGRA's third observing run**, Andrew L. Miller et.al., [2305.15185v1](http://arxiv.org/abs/2305.15185v1)\n\n The third observing run of advanced LIGO, Virgo and KAGRA brought unprecedented sensitivity towards a variety of quasi-monochromatic, persistent gravitational-wave signals. Continuous waves allow us to probe not just the existence of canonical asymmetrically rotating neutron stars, but also different forms of dark matter, thus showing the wide-ranging astrophysical implications of using a relatively simple signal model. I will describe the major results from the numerous continuous-wave searches that were performed in O3, both inside and outside the LIGO/Virgo/KAGRA collaborations, and show how impactful to multi-messenger physics that they have been.\n\n"}, "supernova": {"2305.16003": "2023-05-25, **Solution To The Cosmic Rays Puzzle ?**, Shlomo Dado et.al., [2305.16003v1](http://arxiv.org/abs/2305.16003v1)\n\n Recent observations provide compelling evidence that the bulk of the high energy cosmic rays (CRs) and gamma-ray bursts (GRBs) are co-produced by highly relativistic jets of plasmoids of stellar matter. These jets are launched by fall back matter on newly born neutron stars and stellar black holes in core collapse of stripped envelope massive stars with or without an associated supernova. The electrons in the plasmoids produce GRB pulses mainly by inverse Compton scattering of photons on their path, while magnetic reflection of the charged particles produces the high energy cosmic rays.\n\n", "2305.15481": "2023-05-24, **Radio Observations of Six Young Type Ia Supernovae**, C. E. Harris et.al., [2305.15481v1](http://arxiv.org/abs/2305.15481v1)\n\n Type Ia supernovae (SNe Ia) are important cosmological tools, probes of binary star evolution, and contributors to cosmic metal enrichment; yet, a definitive understanding of the binary star systems that produce them remains elusive. In this work we present early-time (first observation within 10 days post-explosion) radio observations of six nearby (within 40 Mpc) SNe Ia taken by the Jansky Very Large Array, which are used to constrain the presence of synchrotron emission from the interaction between ejecta and circumstellar material (CSM). The two motivations for these early-time observations are (1) to constrain the presence of low-density winds and (2) to provide an additional avenue of investigation for those SNe Ia observed to have early-time optical/UV excesses that may be due to CSM interaction. We detect no radio emission from any of our targets. Toward our first aim, these non-detections further increase the sample of SNe Ia that rule out winds from symbiotic binaries and strongly accreting white dwarfs. For the second aim, we present a radiation hydrodynamics simulation to explore radio emission from an SN Ia interacting with a compact shell of CSM, and find that relativistic electrons cannot survive to produce radio emission despite the rapid expansion of the shocked shell after shock breakout. The effects of model assumptions are discussed for both the wind and compact shell conclusions.\n\n", "2305.15355": "2023-05-24, **Modeling the chemical enrichment history of the Bulge Fossil Fragment Terzan 5**, Donatella Romano et.al., [2305.15355v1](http://arxiv.org/abs/2305.15355v1)\n\n Terzan 5 is a heavily obscured stellar system located in the inner Galaxy. It has been postulated to be a stellar relic, a Bulge Fossil Fragment witnessing the complex history of the assembly of the Milky Way bulge. In this paper, we follow the chemical enrichment of a set of putative progenitors of Terzan 5 to assess whether the chemical properties of this cluster fit within a formation scenario in which it is the remnant of a primordial building block of the bulge. We can explain the metallicity distribution function and the runs of different element-to-iron abundance ratios as functions of [Fe/H] derived from optical-infrared spectroscopy of giant stars in Terzan 5, by assuming that the cluster experienced two major star formation bursts separated by a long quiescent phase. We further predict that the most metal-rich stars in Terzan 5 are moderately He-enhanced and a large spread of He abundances in the cluster, Y = 0.26-0.335. We conclude that current observations fit within a formation scenario in which Terzan 5 originated from a pristine, or slightly metal-enriched, gas clump about one order of magnitude more massive than its present-day mass. Losses of gas and stars played a major role in shaping Terzan 5 the way we see it now. The iron content of the youngest stellar population is better explained if the white dwarfs that give rise to type Ia supernovae (the main Fe factories) sink towards the cluster center, rather than being stripped by the strong tidal forces exerted by the Milky Way in the outer regions.\n\n", "2305.14733": "2023-05-24, **New constraints on the kinematic, relativistic and evolutionary properties of the PSR J1757$-$1854 double neutron star system**, A. D. Cameron et.al., [2305.14733v1](http://arxiv.org/abs/2305.14733v1)\n\n PSR J1757$-$1854 is one of the most relativistic double neutron star binary systems known in our Galaxy, with an orbital period of $P\\_\\text{b}=4.4\\,\\text{hr}$ and an orbital eccentricity of $e=0.61$. As such, it has promised to be an outstanding laboratory for conducting tests of relativistic gravity. We present the results of a 6-yr campaign with the 100-m Green Bank and 64-m Parkes radio telescopes, designed to capitalise on this potential. We identify secular changes in the profile morphology and polarisation of PSR J1757$-$1854, confirming the presence of geodetic precession and allowing the constraint of viewing geometry solutions consistent with General Relativity. We also update PSR J1757$-$1854's timing, including new constraints of the pulsar's proper motion, post-Keplerian parameters and component masses. We conclude that the radiative test of gravity provided by PSR J1757$-$1854 is fundamentally limited to a precision of 0.3 per cent due to the pulsar's unknown distance. A search for pulsations from the companion neutron star is also described, with negative results. We provide an updated evaluation of the system's evolutionary history, finding strong support for a large kick velocity of $w\\ge280\\,\\text{km s}^{-1}$ following the second progenitor supernova. Finally, we reassess PSR J1757$-$1854's potential to provide new relativistic tests of gravity. We conclude that a 3-$\\sigma$ constraint of the change in the projected semi-major axis ($\\dot{x}$) associated with Lense-Thirring precession is expected no earlier than 2031. Meanwhile, we anticipate a 3-$\\sigma$ measurement of the relativistic orbital deformation parameter $\\delta\\_\\theta$ as soon as 2026.\n\n"}}