{"neutrino": {"2308.05720": "2023-08-10, **Correlating neutrino millicharge and muon $(g-2)$ in an abelian $L_μ-L_τ$ model**, Ashutosh Kumar Alok et.al., [2308.05720v1](http://arxiv.org/abs/2308.05720v1)\n\n The inclusion of an additional $U(1)$ gauge symmetry is a common feature in many extensions of the Standard Model, revealing the intricate connections between particle physics and cosmology. The $L\\_{\\mu} - L\\_{\\tau}$ model stands as a prominent member of this distinguished family, characterized by its anomaly-free nature and resilience in the face of collider constraints. This framework provides a unique vantage point for investigating both the intriguing mystery of the muon $(g-2)$ anomaly and the puzzling issue of the Hubble tension. However, due to the presence of kinetic mixing between the photon and $Z'$ in this model, the neutrinos have the potential to acquire minuscule electric charges, often referred to as millicharges ($q\\_{\\nu}$) which is directly related to the strength of the new gauge couplings. A crucial question emerges: how does the model's inclusion of millicharges, while adhering to the stringent constraints imposed by experimental observations, influence its inherent ability to address the muon $(g-2)$ anomaly and the Hubble tension? We find the current upper bounds on $q\\_{\\nu}$ derived from experiments such as the beam dump, XENONnT and LUX-ZEPLIN experiments can impose strong constraints on the $U(1)\\_{L\\_{\\mu} - L\\_{\\tau}}$ coupling. Consequently, these constraints may limit the ability of the model to fully accommodate the current measurement of $(g-2)\\_{\\mu}$ while having a relatively minor impact on the resolution of the Hubble tension.\n\n", "2308.05691": "2023-08-10, **Semi-visible dark photon in a model with vector-like leptons for the $(g-2)_{e,μ}$ and $W$-boson mass anomalies**, Waleed Abdallah et.al., [2308.05691v1](http://arxiv.org/abs/2308.05691v1)\n\n We propose a model realizes that a semi-visible dark photon which can contribute to the anomalous magnetic moment ($g-2$) of both electron and muon. In this model, the electron $g-2$ is deviated from the Standard Model (SM) prediction by the 1-loop diagrams involving the vector-like leptons, while that of muon is deviated due to a non-vanishing gauge kinetic mixing with photons. We also argue that the $W$-boson mass can be deviated from the SM prediction due to the vector-like lepton loops, so that the value obtained by the CDF II experiment can be explained. Thus, this model simultaneously explains the recent three anomalies in $g-2$ of electron and muon as well as the $W$-boson mass. The constraints on the $\\mathcal{O}(1)~\\mathrm{GeV}$ dark photon can be avoided because of the semi-invisible decay of the dark photon, $A^\\prime \\to 2 N \\to 2\\nu \\,2\\chi \\to 2\\nu \\,4e$, where $N$ is a SM singlet vector-like neutrino and $\\chi$ is a CP-even Higgs boson of the $U(1)^\\prime$ gauge symmetry.\n\n", "2308.05630": "2023-08-10, **Reactor Antineutrino Spectral \"Bump\": Cumulative Fission Yields of Irradiated U-235 and Pu-239 Measured by HPGe Gamma-Ray Spectroscopy**, Samuel Kim et.al., [2308.05630v1](http://arxiv.org/abs/2308.05630v1)\n\n Recent measurements of the reactor antineutrino emission show that there exists a spectral excess (the \"bump\") in the 5-7 MeV region when compared to the Huber-Muller prediction based on the conversion method. Analysis within an alternate prediction technique, the summation method, suggests that the bump could be due to excess contributions from a certain few of the beta-decaying fission products. However, it has been shown that when updated fission yield values are used in the summation method, the predicted excess vanishes. In the present preliminary study, fission yields for nuclides suspected of causing the neutrino spectral bump are investigated using gamma-ray spectroscopy of U-235 and Pu-239 samples freshly irradiated using the High Flux Isotope Reactor. For several of the suspect nuclides, the derived fission yields are consistent with JEFF3.3 fission yield library. The exception is the case of Cs-140 from Pu-239, where the discrepancy between the fitted and expected values suggests a potential error in the fission yield library. This highlights the importance of using accurate nuclear data libraries in the analysis of the reactor antineutrino spectra, and the need for ongoing efforts to improve these libraries.\n\n", "2308.05607": "2023-08-10, **Probing invisible dark photon models via atmospheric collisions**, Mingxuan Du et.al., [2308.05607v1](http://arxiv.org/abs/2308.05607v1)\n\n Atmospheric collisions can copiously produce dark sector particles in the invisible dark photon model, leading to detectable signals in underground neutrino detectors. We consider the dark photon model with the mass mixing mechanism and use the Super-K detector to detect the electron recoil events caused by the atmospherically produced dark sector particles within the model. We find that the combined data from four Super-K runs yield new leading constraints for the invisible dark photon in the mass range of $\\sim(0.5-1.4)$ GeV, surpassing the constraints from NA64, BaBar, and searches for millicharged particles.\n\n", "2308.05492": "2023-08-10, **Neutrinos from interactions between the relativistic jet and large-scale structures of BL Lac objects investigated through their gamma-ray spectrum**, Luca Foffano et.al., [2308.05492v1](http://arxiv.org/abs/2308.05492v1)\n\n Absorption and emission lines in the optical spectrum are typically used to investigate the presence of large-scale environments in active galactic nuclei (AGNs). BL Lac objects - which are a category of AGNs with the relativistic jet pointing directly to the observer - are supposed to represent a late evolution stage of AGNs. Their large-scale structures are probably poorer of material, which is distributed with lower densities throughout the circumnuclear environment. Their accretion disk is weak and weakly reprocessed, making the non-thermal continuum of the relativistic jet dominate their optical spectrum and preventing us from identifying the thermal emission of the photon fields produced by such large-scale structures. However, these photon fields may still exist and eventually interact with the gamma rays traveling in the blazar jet via gamma-gamma pair production, producing observable effects such as absorption features in their spectral energy distribution. Interestingly, the same photon field might also lead to the production of high-energy neutrinos, acting as targets for proton-photon interactions. In this contribution, we present the results of a set of simulations over a wide parameter space describing both the blazar jet and the photon field properties. We discuss the most effective conditions that may produce fluxes of neutrinos compatible with the sensitivities of the current and the next generation of neutrino detectors. We will also discuss how the possible neutrino flux would be related to the properties of the large-scale structures investigated indirectly through the analysis of the gamma-ray spectrum of the BL Lac object.\n\n", "2308.05330": "2023-08-10, **Refining the IceCube detector geometry using muon and LED calibration data**, Matti Janson et.al., [2308.05330v1](http://arxiv.org/abs/2308.05330v1)\n\n The IceCube Neutrino Observatory deployed 5160 digital optical modules (DOMs) on 86 cables, called strings, in a cubic kilometer of deep glacial ice below the geographic South Pole. These record the Cherenkov light of passing charged particles. Knowledge of the DOM positions is vital for event reconstruction. While vertical positions have been calibrated, previous in-situ geometry calibration methods have been unable to measure horizontal deviations from the surface positions, largely due to degeneracies with ice model uncertainties. Thus the lateral position of the surface position of each hole is to date in almost all cases used as the lateral position of all DOMs on a given string. With the recent advances in ice modeling, two new in-situ measurements have now been undertaken. Using a large sample of muon tracks, the individual positions of all DOMs on a small number of strings around the center of the detector have been fitted.   Verifying the results against LED calibration data shows that the string-average corrections improve detector modeling. Directly fitting string-average geometry corrections for the full array using LED data agrees with the average corrections as derived from muons where available. Analyses are now ongoing to obtain per-DOM positions using both methods and in addition, methods are being developed to correct the recorded arrival times for the expected scattering delay, allowing for multilateration of the positions using nanosecond-precision propagation delays.\n\n", "2308.05227": "2023-08-09, **Investigation of CP-even Higgs bosons decays $H \\rightarrow μτ$ within constraints of $l_a \\rightarrow l_b γ$ in a 3-3-1 model with inverse seesaw neutrinos**, H. V. Quyet et.al., [2308.05227v1](http://arxiv.org/abs/2308.05227v1)\n\n In a 3-3-1 model with inverse seesaw neutrinos, we use a simple form of Higgs potential to give four CP-even Higgs bosons ($H \\equiv h^0\\_1,h^0\\_2,h^0\\_3,h^0\\_4$). We investigate $H \\rightarrow \\mu \\tau$ decays in the parameter space regions satisfying the experimental limits of $l\\_a \\rightarrow l\\_b \\gamma$ with running parameters being the mass of the charged Higgs boson ($m\\_{H\\_1^\\pm}$) and the mixing matrix of the heavy neutrinos ($M\\_R$). We show that there exist regions of parameter space where all partial widths $\\Gamma (H \\rightarrow \\mu \\tau)$ are less than the current experimental limit ($4.1 \\times 10^{-6} GeV$). Analyzing the contributing components to $\\Gamma (H \\rightarrow \\mu \\tau)$, we also compare the mass of the SM-like Higgs boson with the corresponding ones of the other CP-even Higgs bosons in this model.\n\n", "2308.05147": "2023-08-09, **From Dirac to Majorana: the Cosmic Neutrino Background capture rate in the minimally extended Standard Model**, Yuber F. Perez-Gonzalez et.al., [2308.05147v1](http://arxiv.org/abs/2308.05147v1)\n\n We investigate the capture rate of the cosmic neutrino background on tritium within the Standard Model, extended to incorporate three right-handed singlet neutrinos with explicit lepton-number violation. We consider a scenario where the $6 \\times 6$ neutrino mixing matrix factorizes into three independent $2 \\times 2$ pairs and analyze the states produced from weak interactions just before neutrino decoupling. Taking into account the unrestricted Majorana mass scale associated with lepton number violation, spanning from the Grand Unification scale to Planck-suppressed values, we observe a gradual transition in the capture rate from a purely Majorana neutrino to a purely (pseudo) Dirac neutrino. We demonstrate that the capture rate is modified if the lightest active neutrino is relativistic, and this can be used to constrain the tiniest value of mass-squared difference $\\sim 10^{-35}\\,{\\rm eV}^2$, between the active-sterile pair, probed so far. Consequently, the cosmic neutrino capture rate could become a promising probe for discerning the underlying mechanism responsible for generating neutrino masses.\n\n", "2308.04833": "2023-08-09, **Search for Dark Matter Decay in Nearby Galaxy Clusters and Galaxies with IceCube**, Minjin Jeong et.al., [2308.04833v1](http://arxiv.org/abs/2308.04833v1)\n\n Dark matter could decay into Standard Model particles producing neutrinos directly or indirectly. The resulting flux of neutrinos from these decays could be detectable at neutrino telescopes and would be associated with massive celestial objects where dark matter is expected to be accumulated. Recent observations of high-energy astrophysical neutrinos at IceCube might hint at a signal produced by the decay of TeV to PeV scale dark matter. This analysis searches for neutrinos from decaying dark matter in nearby galaxy clusters and galaxies. We focus on dark matter masses from 10 TeV to 1 EeV and four decay channels: $\\nu\\bar{\\nu}$, $\\tau^{+}\\tau^{-}$, $W^{+}W^{-}$, $b\\bar{b}$. Three galaxy clusters, seven dwarf galaxies, and the Andromeda galaxy are chosen as targets and stacked within the same source class. A well-established IceCube data sample is used, which contains 11 years of upward-going track-like events. In this contribution, we present preliminary results of the analysis.\n\n"}, "dark matter": {"2308.05723": "2023-08-10, **$(g-2)_μ$ and Stau coannihilation : Dark Matter and Collider Analysis**, Manimala Chakraborti et.al., [2308.05723v1](http://arxiv.org/abs/2308.05723v1)\n\n Slepton coannihilation is one of the most promising scenarios that can bring the predicted Dark Matter (DM) abundance in the the Minimal Supersymmetric Standard Model (MSSM) into agreement with the experimental observation. In this scenario, the lightest supersymmetric particle (LSP), usually assumed to be the lightest neutralino, can serve as a Dark Matter (DM) candidate while the sleptons as the next-to-LSPs (NLSPs) lie close in mass. In our previous studies analyzing the electroweak (EW) sector of MSSM, a degeneracy between the three generations of sleptons was assumed for the sake of simplicity. In case of slepton coannihilation this directly links the smuons involved in the explanation for $(g-2)\\_\\mu$ to the coannihilating NLSPs required to explain the DM content of the universe. On the other hand, in Grand Unified Theories such degeneracy do not hold, and often the lighter stau turns out to be the NLSP at the EW scale, with the smuons (and selectrons) somewhat heavier. In this paper we analyze a non-universal slepton mass scenario at the EW scale where the first two generations of sleptons are taken to be mass-degenerate and heavier than the staus, enforcing stau coannihilation. We analyze the parameter space of the MSSM in the light of a variety of experimental data namely, the DM relic density and direct detection (DD) limits, LHC data and especially, the discrepancy between the experimental result for $(g-2)\\_\\mu$, and its Standard Model (SM) prediction. We find an upper limit on the LSP and NLSP masses of about ~ 550 GeV. In contrast to the scenario with full degeneracy among the three families of sleptons, the upper limit on the light smuon/selectron mass moves up by ~ 200 GeV. We analyze the DD prospects as well as the physics potential of the HL-LHC and a future high-energy $e^+ e^-$ collider to investigate this scenario further.\n\n", "2308.05653": "2023-08-10, **Dark Matter Phenomenology in 2HDMS in light of the 95 GeV excess**, Juhi Dutta et.al., [2308.05653v1](http://arxiv.org/abs/2308.05653v1)\n\n The Two Higgs Doublet model extended with a complex scalar singlet (2HDMS) is a well-motivated Beyond Standard Model candidate addressing several open problems of nature. In this work, we focus on the dark matter (DM) phenomenology of the complex scalar singlet where the real part of the complex scalar obtains a vacuum expectation value. The model is characterized by an enlarged Higgs spectrum comprising six physical Higgs bosons and a pseudoscalar DM candidate. We address the impact of accommodating the 95 GeV excess on the 2HDMS parameter space and DM observables after including all theoretical and experimental constraints. Finally, we look into the prospects of this scenario at HL-LHC and future lepton colliders for a representative benchmark.\n\n", "2308.05606": "2023-08-10, **An extraordinarily massive galaxy that formed its stars at $z \\gtrsim 11$**, Karl Glazebrook et.al., [2308.05606v1](http://arxiv.org/abs/2308.05606v1)\n\n The formation of galaxies by gradual hierarchical co-assembly of baryons and cold dark matter halos is a fundamental paradigm underpinning modern astrophysics. A key test of this paradigm is via the observations of massive galaxies at early times as the evolution of the masses and abundances of dark matter halos is straight forward to simulate and massive halos should contain the universal cosmic baryon fraction at high redshift. Extremely massive quiescent galaxies > $10^{11}$ M$\\_\\odot$ have now been observed as early as 1-2 billions years after the Big Bang producing tension with theoretical models and driving significant revisions. Typical spectroscopic ages of these objects are 300-500 Myr. Here we report on the spectroscopic observations with the James Webb Space Telescope of one of these objects that is quite different from the rest; selected by it having much redder colours. We see spectral features typical of much older stellar populations and detailed modeling shows that they formed at least 1.5 billion years earlier in time $z \\gtrsim 11$ in a rapid star formation event. Dark matter halos massive enough to host these ancestors ought not to have assembled at this time. This observation may point to a significant gap in our understanding of early stellar populations, galaxy formation and/or the nature of dark matter.\n\n", "2308.05569": "2023-08-10, **Vacuum Branching, Dark Energy, Dark Matter**, Don Weingarten et.al., [2308.05569v1](http://arxiv.org/abs/2308.05569v1)\n\n Beginning with the Everett-DeWitt many-worlds interpretation of quantum mechanics, there have been a series of proposals for how the state vector of a quantum system might split at any instant into orthogonal branches, each of which exhibits approximately classical behavior. In an earlier version of the present work, we proposed a decomposition of a state vector into branches by finding the minimum of a measure of the mean squared quantum complexity of the branches in the branch decomposition. Here we define a formulation of quantum complexity for quantum electrodynamics on a lattice in Minkowski space. With respect to a particular Lorentz frame, for a system beginning in a state of low complexity, branching occurs repeatedly over time with each branch splitting successively into further sub-branches among which the branch followed by the real world is chosen according to the Born rule. Alternatively, in an explicitly Lorentz covariant formulation, the real world is a single random draw from the set of branches at asymptotically late time, which can then be restored to finite time in a particular Lorentz frame by sequentially retracing the set of branching events implied by the late time choice. The earlier version here is simplified by replacing a definition of complexity based on the physical vacuum with a definition based on the bare vacuum. As a consequence of this replacement, the physical vacuum itself is predicted to branch yielding branches with energy densities slightly larger than that of the unbranched vacuum. If the vacuum energy renormalization constant is chosen as usual to give 0 energy density to the unbranched vacuum, vacuum branches will appear to have a combination of dark energy and dark matter densities but no additional particle content.\n\n", "2308.05544": "2023-08-10, **Black hole surrounded by the pseudo-isothermal dark matter halo**, Yi Yang et.al., [2308.05544v1](http://arxiv.org/abs/2308.05544v1)\n\n The abundance of dark matter in the actual universe motivates us to construct the black hole spacetime enveloped by dark matter. In this paper, we present a new spherically symmetric black hole surrounded by the pseudo-isothermal dark matter halo, and then explore the effects of the pseudo-isothermal halo profile on a rotating black hole at the M87 galactic center, aiming to achieve a black hole solution that aligns with those found in the real universe. Using the Newman-Janis method, we derive a rotating black hole solution encompassed by the pseudo-isothermal halo, which is consistent with observations of actual black holes that are believed to possess spin. Our investigation focuses on the impact of the pseudo-isothermal halo on the black hole event horizon, time-like and null orbits, as well as the black hole shadow. We find that as the spin parameter $a$ increases, the interval between the inner event horizon and the outer event horizon of the rotating black hole surrounded by the pseudo-isothermal halo in M87 diminishes. This leads to the formation of an extreme black hole. The presence of dark matter, however, has minimal effect on the event horizon. Moreover, in the M87 as the spin parameter $a$ increases, the black hole shadow deviates increasingly from a standard circle, with larger spin parameters causing more pronounced distortion relative to the standard circle. Surprisingly, we observe that the dark matter density has very little influence on the shadow of the black hole surrounded by the pseudo-isothermal halo in the M87. This study contributes to a deeper understanding of black hole structures and the role of dark matter in the universe.\n\n", "2308.05375": "2023-08-10, **Electron $g-2$ corrections from axion dark matter**, Ariel Arza et.al., [2308.05375v1](http://arxiv.org/abs/2308.05375v1)\n\n We consider the effects of a local axion dark matter background on the $g-2$ of the electron. We calculate loop corrections to the photon-electron vertex and determine analytical formulas for the spin and cyclotron frequencies when the electron is in an external magnetic field. By comparing with current measurements of these observables, we are able to place the strongest constraint on the axion-elecron coupling for axion masses below $10^{-15}\\text{eV}$.\n\n", "2308.05249": "2023-08-09, **A minimal model of fermion FIMP dark matter**, Carlos E. Yaguna et.al., [2308.05249v1](http://arxiv.org/abs/2308.05249v1)\n\n We investigate a simple extension of the standard model (SM) in which the dark matter consists of a feebly interacting fermion (FIMP), charged under a new $Z\\_4$ symmetry, that is produced in the early Universe by the freeze-in mechanism. The only other new particle included in the model is a singlet scalar, also charged under the $Z\\_4$, which couples to the fermion via Yukawa interactions and to the SM Higgs. The model is truly minimal, as it admits just five free parameters: two masses and three dimensionless couplings. Depending on their values, the freeze-in mechanism can be realized in different ways, each characterized by its own production processes. For all of them, we numerically study the relic density as a function of the free parameters of the model and determine the regions consistent with the dark matter constraint. Our results show that this scenario is viable over a wide range of couplings and dark matter masses. This model, therefore, not only offers a novel solution to the dark matter problem, but it also provides a minimal realization of freeze-in for fermion dark matter.\n\n", "2308.05214": "2023-08-09, **Z $\\to$ 3X decay width from dark matter Standard Model extension**, D. O. R. Azevedo et.al., [2308.05214v1](http://arxiv.org/abs/2308.05214v1)\n\n We propose a Born-Infeld contribution to the $U(1)\\_{B-L}$ extension of the Standard Model to explain the anomalous decay of beryllium by the X17 neutral boson, its possible connections to dark matter and the observed MeV gamma-ray bursts. The decay width of the $Z^0$ decay into 3$X$ process is computed based on NA64 experiment data.\n\n", "2308.05181": "2023-08-09, **The missing quasar image in the gravitationally lensed quasar HE0230$-$2130: implications on dark satellites and the cored lens mass distribution**, S. Ertl et.al., [2308.05181v1](http://arxiv.org/abs/2308.05181v1)\n\n The quasar HE0230$-$2130 is lensed by two galaxies at similar redshifts into four observed images. Using modeled quasar positions from fitting the brightness of the quasar images in ground-based imaging data from the Magellan telescope, we find that lens mass models where both galaxies are each parametrized with a singular power-law (PL) profile predict five quasar images. One of the predicted images is unobserved even though it is distinctively offset from the lensing galaxies and is bright enough to be observable. This missing image gives rise to new opportunities to study the galaxies' mass distribution. To interpret the quad configuration of this system, we test different profile assumption with the aim to obtain lens mass models that predicts correctly only four observed images. We test the effect of adopting cored profiles for the lensing galaxies, of external shear, and of additional profiles to represent a dark matter clump. By comparing the Bayesian evidence of different model parametrizations, we favor the model class that consists of two singular PL profiles for the lensing galaxies and a cored isothermal sphere in the region of the previously predicted fifth images (rNIS profile). We estimate the mass of the rNIS clumps inside its Einstein radius and find that 18\\% are in the range $10^6 M\\_{\\odot} \\leq M\\_{\\rm rNIS}\\leq 10^9 M\\_{\\odot}$, which is the predicted mass range of dark matter subhalos in cold dark matter simulations, or the mass of low-mass dark matter satellite galaxies. The second most likely model class, with a relative probability of 94\\%, is the model where the smaller lensing galaxy is described by a cored PL profile with external shear. Our study demonstrates that lensed quasar images are sensitive to dark matter structure in the gravitational lens.\n\n", "2308.05165": "2023-08-09, **Non-Parametric Analysis for the Dark Matter Density Evolution**, Z. C. Santana et.al., [2308.05165v1](http://arxiv.org/abs/2308.05165v1)\n\n In this paper, we investigate a potential departure in the standard dark matter density evolution law, $\\rho\\_{dm} = \\rho\\_{dm,0}(1+z)^3$. The method involves considering a deformed evolution model, denoted as $\\rho\\_{dm} = \\rho\\_{dm,0}(1+z)^3f(z)$, and searching the presence of any deviation ($f(z)\\neq 1$). As one may see, $f(z)$ is a general function that parametrizes a digression from the standard law. We use data of baryon acoustic oscillations, type I Supernovae luminosity distances, and galaxy cluster gas mass fraction observations to reconstruct $f(z)$ by Gaussian process regression. Unlike previous works, it enables us to investigate a possible deviation without using a specific function to describe it. We have obtained $f(z)=1$, the standard model scenario, within $2\\sigma$ c.l. in all the considered cases.\n\n", "2308.05145": "2023-08-09, **FLORAH: A generative model for halo assembly histories**, Tri Nguyen et.al., [2308.05145v1](http://arxiv.org/abs/2308.05145v1)\n\n The mass assembly history (MAH) of dark matter halos plays a crucial role in shaping the formation and evolution of galaxies. MAHs are used extensively in semi-analytic and empirical models of galaxy formation, yet current analytic methods to generate them are inaccurate and unable to capture their relationship with the halo internal structure and large-scale environment. This paper introduces FLORAH, a machine-learning framework for generating assembly histories of ensembles of dark matter halos. We train FLORAH on the assembly histories from the GUREFT and VSMDPL N-body simulations and demonstrate its ability to recover key properties such as the time evolution of mass and concentration. We obtain similar results for the galaxy stellar mass versus halo mass relation and its residuals when we run the Santa Cruz semi-analytic model on FLORAH-generated assembly histories and halo formation histories extracted from an N-body simulation. We further show that FLORAH also reproduces the dependence of clustering on properties other than mass (assembly bias), which is not captured by other analytic methods. By combining multiple networks trained on a suite of simulations with different redshift ranges and mass resolutions, we are able to construct accurate main progenitor branches (MPBs) with a wide dynamic mass range from $z = 0$ up to an ultra-high redshift $z \\approx 20$, currently far beyond that of a single N-body simulation. FLORAH is the first step towards a machine learning-based framework for planting full merger trees; this will enable the exploration of different galaxy formation scenarios with great computational efficiency at unprecedented accuracy.\n\n", "2308.04955": "2023-08-09, **Confronting global 21-cm signal with $\\mathbb{Z}_3$ symmetric dark matter models**, Debarun Paul et.al., [2308.04955v1](http://arxiv.org/abs/2308.04955v1)\n\n While the $\\mathbb{Z}\\_3$ symmetric dark matter models have shown tremendous prospects in addressing a number of (astro-)particle physics problems, they can leave interesting imprints on cosmological observations as well. We consider two such promising models: semi-annihilating dark matter (SADM) and Co-SIMP $2\\rightarrow 3$ interaction, and investigate their effects on the global 21-cm signal. SADM is found to address the EDGES observation with the aid of an excess radio background, whereas Co-SIMP can explain the EDGES dip by virtue of an intrinsic cooling effect without invoking any such excess radiation. Hence, the latter model turns out to be a rare model within the domain of CDM, that uses leptophilic interaction to achieve the EDGES dip. Further, keeping in mind the ongoing debate between EDGES and SARAS 3 on the global 21-cm signal, we demonstrate that our chosen models can still remain viable in this context, even if the EDGES data requires reassessment in future. We then extend our investigation to possible reflections on the Dark Ages, followed by a consistency check with the CMB and BAO observations via Planck 2018(+BAO) datasets. This work thus presents a compelling case of exploring these interesting particle physics models in the light of different cosmological observations.\n\n", "2308.04822": "2023-08-09, **Properties of Heavy Higgs Bosons and Dark Matter under Current Experimental Limits in the $μ$NMSSM**, Zhaoxia Heng et.al., [2308.04822v1](http://arxiv.org/abs/2308.04822v1)\n\n Searches for new particles beyond the Standard Model (SM) are an important task for the Large Hadron Collider (LHC). In this paper, we investigate the properties of the heavy non-SM Higgs bosons in the $\\mu$-term extended Next-to-Minimal Supersymmetric Standard Model ($\\mu$NMSSM). We scan the parameter space of the $\\mu$NMSSM considering the basic constraints from Higgs data, dark matter (DM) relic density, and LHC searches for sparticles. And we also consider the constraints from the LZ2022 experiment and the muon anomaly constraint at 2$\\sigma$ level.   We find that the LZ2022 experiment has a strict constraint on the parameter space of the $\\mu$NMSSM, and the limits from the DM-nucleon spin-independent (SI) and spin-dependent (SD) cross-sections are complementary. Then we discuss the exotic decay modes of heavy Higgs bosons decaying into SM-like Higgs boson. We find that for doublet-dominated Higgs $h\\_3$ and $A\\_2$, the main exotic decay channels are $h\\_3\\rightarrow Z A\\_1$, $h\\_3\\rightarrow h\\_1 h\\_2$, $A\\_2\\rightarrow A\\_1 h\\_1$ and $A\\_2\\rightarrow Z h\\_2$, and the branching ratio can reach to about 23$\\%$, 10$\\%$, 35$\\%$ and 10$\\%$ respectively. At the 13 TeV LHC, the production cross-section of $ggF\\rightarrow h\\_3\\rightarrow h\\_1 h\\_2$ and $ggF\\rightarrow A\\_2\\rightarrow A\\_1 h\\_1$ can reach to about $10^{-11}$pb and $10^{-10}$pb, respectively.\n\n"}, "supernova": {"2308.05252": "2023-08-09, **Annotated Coadds: Concise Metrics for Characterizing Survey Cadence and for Discovering Variable and Transient Sources**, D. L. Shupe et.al., [2308.05252v1](http://arxiv.org/abs/2308.05252v1)\n\n In order to study transient phenomena in the Universe, existing and forthcoming imaging surveys are covering wide areas of sky repeatedly over time, with a range of cadences, point spread functions, and depths. We describe here a framework that allows an efficient search for different types of time-varying astrophysical phenomena in current and future, large data repositories. We first present a methodology to generate and store key survey parameters that enable researchers to determine if a survey, or a combination of surveys, allows specific time-variable astrophysical phenomena to be discovered. To facilitate further exploration of sources in regions of interest, we then generate a few sample metrics that capture the essential brightness characteristics of a sky pixel at a specific wavelength. Together, we refer to these as \"annotated coadds\". The techniques presented here for WISE/NEOWISE-R data are sensitive to 10 percent brightness variations at around 12th Vega magnitude at 4.5 microns wavelength. Application of the technique to ZTF data also enabled the detection of 0.5 mag variability at 20 AB mag in the r-band. We demonstrate the capabilities of these metrics for different classes of sources: high proper-motion stars, periodic variable stars, and supernovae, and find that each metric has its advantages depending on the nature of variability. We also present a data structure which will ease the search for temporally varying phenomena in future surveys.\n\n", "2308.05165": "2023-08-09, **Non-Parametric Analysis for the Dark Matter Density Evolution**, Z. C. Santana et.al., [2308.05165v1](http://arxiv.org/abs/2308.05165v1)\n\n In this paper, we investigate a potential departure in the standard dark matter density evolution law, $\\rho\\_{dm} = \\rho\\_{dm,0}(1+z)^3$. The method involves considering a deformed evolution model, denoted as $\\rho\\_{dm} = \\rho\\_{dm,0}(1+z)^3f(z)$, and searching the presence of any deviation ($f(z)\\neq 1$). As one may see, $f(z)$ is a general function that parametrizes a digression from the standard law. We use data of baryon acoustic oscillations, type I Supernovae luminosity distances, and galaxy cluster gas mass fraction observations to reconstruct $f(z)$ by Gaussian process regression. Unlike previous works, it enables us to investigate a possible deviation without using a specific function to describe it. We have obtained $f(z)=1$, the standard model scenario, within $2\\sigma$ c.l. in all the considered cases.\n\n", "2308.05157": "2023-08-09, **No evidence for missing covariance in the Pantheon+ SuperNova sample distance moduli**, Bohdan Bidenko et.al., [2308.05157v1](http://arxiv.org/abs/2308.05157v1)\n\n Inspired by the discussion in the community on possible hidden systematic errors in late universe cosmological probes and non-trivial physical models developed to reduce the Hubble tension, we investigate the Pantheon and Pantheon+ SNe samples for possible deviations from the original $\\Lambda$CDM analysis. To simultaneously account for possible systematics or deviations from $\\Lambda$CDM, we adopt Gaussian processes to model additional covariance while making no further assumptions on their origin. We explore both stationary and non-stationarity corrections to the covariance. While small changes in the inferred cosmological parameters $H\\_0$ and $\\Omega\\_{m}$ can occur, we find no statistically significant evidence for missing covariance. We find an upper limit for the Gaussian processes amplitude $\\sigma < 0.031$ mag with $95\\%$ confidence, which corresponds to $20\\%$ of the average statistical error in the Pantheon+ sample. The strongest effect we find on the inferred cosmological parameter posterior can reduce the statistical significance of the Hubble tension between Pantheon+ and Planck estimates from 5.3$\\sigma$ to 4.5$\\sigma$. Therefore, we conclude that the SN cosmological parameter inference is robust against the analysis modifications studied in this work.\n\n", "2308.05148": "2023-08-09, **Gamma-Ray Bursts Observed by the Transiting Exoplanet Survey Satellite: Prompt Optical Counterparts and Afterglows of Swift-XRT Localized GRBs**, Rahul Jayaraman et.al., [2308.05148v1](http://arxiv.org/abs/2308.05148v1)\n\n Throughout the past three decades, only a few tens of observations have been made of optical flashes contemporaneous with gamma-ray bursts (GRBs), despite the thousands of GRBs that have been detected during that same timeframe. In this work, we present light curves from the Transiting Exoplanet Survey Satellite (TESS) for a sample of 7 GRBs that were localized to within 10\" by the Swift X-ray Telescope. For each burst, we characterize both the prompt emission, if it exists, and the afterglow, and conduct searches for late-time emission from a supernova or kilonova component. We also constrain the physical parameters of the burst based on the TESS light curve, and present a novel method to account for the effects of TESS's cosmic ray mitigation strategy on the observed flux from these GRBs. This allows us to establish upper limits on the true magnitude of any GRB-associated optical flash. Finally, we discuss how TESS's continuous monitoring and new weekly downlink schedule are proving invaluable in the rapid follow-up and characterization of short-duration transients, including GRBs; these could potentially enable TESS to detect electromagnetic counterparts to gravitational-wave events.\n\n", "2308.05102": "2023-08-09, **Two of a Kind: Comparing big and small black holes in binaries with gravitational waves**, Amanda M. Farah et.al., [2308.05102v1](http://arxiv.org/abs/2308.05102v1)\n\n When modeling the population of merging binary black holes, analyses generally focus on characterizing the distribution of primary (i.e. more massive) black holes in the binary, while simplistic prescriptions are used for the distribution of secondary masses. However, the secondary mass distribution provides a fundamental observational constraint on the formation history of coalescing binary black holes. If both black holes experience similar stellar evolutionary processes prior to collapse, as might be expected in dynamical formation channels, the primary and secondary mass distributions would show similar features. If they follow distinct evolutionary pathways (for example, due to binary interactions that break symmetry between the initially more massive and less massive star), their mass distributions may differ. We explicitly fit the secondary mass distribution, finding that if the primary and secondary mass distributions are different, the previously-identified peak in the primary mass distribution may be driven by an even larger peak in the secondary mass distribution. Alternatively, if we assume that the two masses are drawn from the same underlying distribution, they both show a peak at $31.4\\_{-2.6}^{+2.3} \\, M\\_{\\odot}$. This value is shifted lower than that obtained when assuming the peak only exists in the marginal primary mass distribution, placing this feature in further tension with expectations from a pulsational pair-instability supernova pileup. We anticipate that by the end of the fifth LIGO-Virgo-KAGRA observing run, we will be able to determine whether the data prefer distinct or identical component mass distributions to $>4\\sigma$, providing important clues to the formation history of coalescing binary black holes.\n\n", "2308.04989": "2023-08-09, **Constraining Supernova Ia Progenitors by their Locations in Host Galactic Disc**, A. A. Hakobyan et.al., [2308.04989v1](http://arxiv.org/abs/2308.04989v1)\n\n Among the diverse progenitor channels leading to Type Ia Supernovae (SNe Ia), there are explosions originating from white dwarfs with sub-Chandrasekhar masses. These white dwarfs undergo detonation and explosion triggered by primary detonation in the helium shell, which has been accreted from a companion star. The double-detonation model predicts a correlation between the age of the progenitor system and the near peak brightness: the younger the exploding progenitors, the brighter the SNe. In this paper, we present our recent achievements on the study of SNe Ia properties in different locations within host galactic discs and the estimation of their progenitor population ages. Observationally, we confirm the validity of the anticipated correlation between the SN photometry and the age of their progenitors.\n\n", "2308.04959": "2023-08-09, **Rayleigh and Raman scattering cross-sections and phase matrices of the ground-state hydrogen atom, and their astrophysical implications**, Mitsuru Kokubo et.al., [2308.04959v1](http://arxiv.org/abs/2308.04959v1)\n\n We present explicit expressions for Rayleigh and Raman scattering cross-sections and phase matrices of the ground $1s$ state hydrogen atom based on the Kramers-Heisenberg dispersion formula. The Rayleigh scattering leaves the hydrogen atom in the ground-state while the Raman scattering leaves the hydrogen atom in either $ns$ ($n\\geq2$; $s$-branch) or $nd$ ($n\\geq3$; $d$-branch) excited state, and the Raman scattering converts incident ultraviolet (UV) photons around the Lyman resonance lines into optical-infrared (IR) photons. We show that this Raman wavelength conversion of incident flat UV continuum in dense hydrogen gas with a column density of $N\\_{\\text{H}} > 10^{21}~\\text{cm}^{-2}$ can produce broad emission features centred at Balmer, Paschen, and higher-level lines, which would mimic Doppler-broadened hydrogen lines with the velocity width of $\\gtrsim 1,000~\\text{km}~\\text{s}^{-1}$ that could be misinterpreted as signatures of Active Galactic Nuclei, supernovae, or fast stellar winds. We show that the phase matrix of the Rayleigh and Raman $s$-branch scatterings is identical to that of the Thomson scattering while the Raman $d$-branch scattering is more isotropic, thus the Paschen and higher-level Raman features are depolarized compared to the Balmer features due to the flux contribution from the Raman $d$-branch. We argue that observations of the line widths, line flux ratios, and linear polarization of multiple optical/IR hydrogen lines are crucial to discriminate between the Raman-scattered broad emission features and Doppler-broadened emission lines.\n\n", "2308.04863": "2023-08-09, **Using 4MOST to refine the measurement of galaxy properties: A case study of Supernova hosts**, J. Dumayne et.al., [2308.04863v1](http://arxiv.org/abs/2308.04863v1)\n\n The Rubin Observatory's 10-year Legacy Survey of Space and Time will observe near to 20 billion galaxies. For each galaxy the properties can be inferred. Approximately $10^5$ galaxies observed per year will contain Type Ia supernovae (SNe), allowing SN host-galaxy properties to be calculated on a large scale. Measuring the properties of SN host-galaxies serves two main purposes. The first is that there are known correlations between host-galaxy type and supernova type, which can be used to aid in the classification of SNe. Secondly, Type Ia SNe exhibit correlations between host-galaxy properties and the peak luminosities of the SNe, which has implications for their use as standardisable candles in cosmology. We have used simulations to quantify the improvement in host-galaxy stellar mass ($M\\_\\ast$) measurements when supplementing photometry from Rubin with spectroscopy from the 4-metre Multi-Object Spectroscopic Telescope (4MOST) instrument. We provide results in the form of expected uncertainties in $M\\_\\ast$ for galaxies with 0.1 < $z$ < 0.9 and 18 < $r\\_{AB}$ < 25. We show that for galaxies mag 22 and brighter, combining Rubin and 4MOST data reduces the uncertainty measurements of galaxy $M\\_\\ast$ by more than a factor of 2 compared with Rubin data alone. This applies for elliptical and Sc type hosts. We demonstrate that the reduced uncertainties in $M\\_\\ast$ lead to an improvement of 7\\% in the precision of the \"mass step\" correction. We expect our improved measurements of host-galaxy properties to aid in the photometric classification of SNe observed by Rubin.\n\n", "2308.04677": "2023-08-09, **The dusty red supergiant progenitor and the local environment of the Type II SN 2023ixf in M101**, Ze-Xi Niu et.al., [2308.04677v1](http://arxiv.org/abs/2308.04677v1)\n\n As one of the closest supernovae (SNe) in the last decade, SN 2023ixf is an unprecedented target to investigate the progenitor star that exploded. However, there is still significant uncertainty in the reported progenitor properties. In this work, we present a detailed study of the progenitor of SN 2023ixf with two independent analyses. We first modelled its spectral energy distribution (SED) based on Hubble Space Telescope optical, Spitzer mid-infrared (IR), and ground-based near-IR data. We find that stellar pulsation and circumstellar extinction have great impacts on SED fitting, and the result suggests a relatively massive red supergiant (RSG) surrounded by C-rich dust with an initial mass of 16.2--17.4 Msun. The corresponding mass-loss rate estimate is 1e-5 Msun/yr. We also derived the star formation history of the SN environment based on resolved stellar populations, and the most recent star-forming epoch corresponds to a progenitor initial mass of 17--19 Msun, in agreement with that from our SED fitting. Therefore, we conclude that the progenitor of SN 2023ixf is close to the high-mass end for Type II SN progenitors.\n\n"}}