{"neutrino": {"2409.17878": "2024-09-26, **Sterile sector impacting the correlations and degeneracies among mixing parameters at the Deep Underground Neutrino Experiment**, Sabila Parveen et.al., [2409.17878v1](http://arxiv.org/abs/2409.17878v1)\n\n We investigate the physics potential of the upcoming Deep Underground Neutrino Experiment (DUNE) in probing active-sterile mixing. We present analytic expressions for relevant oscillation probabilities for three active and one sterile neutrino of eV-scale mass and highlight essential parameters impacting the oscillation signals at DUNE. We then explore the space of sterile parameters as well as study their correlations among themselves and with parameters appearing in the standard framework ($\\delta\\_{13}$ and $\\theta\\_{23}$). We perform a combined fit for the near and far detector at DUNE using GLoBES. We consider alternative beam tune (low energy and medium energy) and runtime combinations for constraining the sterile parameter space. We show that charged current and neutral current interactions over the near and far detector at DUNE allow for an improved sensitivity for a wide range of sterile neutrino mass splittings.\n\n", "2409.17868": "2024-09-26, **First Search for Light Dark Matter in the Neutrino Fog with XENONnT**, E. Aprile et.al., [2409.17868v1](http://arxiv.org/abs/2409.17868v1)\n\n We search for dark matter (DM) with a mass [3,12] $\\mathrm{GeV} / c^2$ using an exposure of 3.51 $\\mathrm{t} \\times \\mathrm{y}$ with the XENONnT experiment. We consider spin-independent, spin-dependent, momentum-dependent, mirror DM, and self-interacting DM with a light mediator coupling to Standard Model particles. Using a lowered energy threshold compared to the previous WIMP search, a blind analysis of [0.5, 5.0] $\\mathrm{keV}$ nuclear recoil events reveals no significant signal excess over the background. XENONnT excludes spin-independent DM-nucleon cross sections $>2.5 \\times 10^{-45} \\mathrm{~cm}^2$ at $90 \\%$ confidence level for 6 $\\mathrm{GeV} / c^2$ DM. The solar ${ }^8 \\mathrm{B}$ neutrino coherent elastic neutrino-nucleus scattering background accounts for approximately half of the background in the signal region. In the considered mass range, the DM sensitivity approaches the 'neutrino fog', the limitation where neutrinos produce a signal that is indistinguishable from that of light DM-xenon nucleus scattering.\n\n", "2409.17826": "2024-09-26, **Majorana and the bridge between matter and anti-matter**, Francesco Vissani et.al., [2409.17826v1](http://arxiv.org/abs/2409.17826v1)\n\n This short essay aims to offer a discursive presentation of three scientific articles by Ettore Majorana highlighting the fundamental importance of one of them - the last one - for the investigation of the intimate constitution of matter. The search for evidence to support Majorana's thesis is the prime motivation of the conference \"Multi-Aspect Young Oriented Advanced Neutrino Academy\" at the G.P. Grimaldi Foundation in Modica, Sicily.\n\n", "2409.17824": "2024-09-26, **1930-1937: the first $β$-rays and neutrino theories**, Francesco Vissani et.al., [2409.17824v1](http://arxiv.org/abs/2409.17824v1)\n\n The conceptual bases of Fermi's $\\beta$-ray theory (at its 90th anniversary) are examined, highlighting the innovative drive and inspirational role for the progress that followed just afterwards. Moreover, the three different ideas of the neutrino born from the proposals of Pauli 1930, again Fermi 1933 and Majorana 1937 papers are discussed, emphasising the interest of the latter for current expectations.\n\n", "2409.17768": "2024-09-26, **Contribution of gaseous tritium source rear wall to tritium beta-spectrum in Troitsk nu-mass experiment**, V. G. Chernov et.al., [2409.17768v1](http://arxiv.org/abs/2409.17768v1)\n\n We avaluate the contribution of electron scattering on the rear wall of a windowless gaseous tritium source in the Troitsk nu-mass setup. There is a finite probability for them to scatter, return back and reach the detector. A such additional component distorts the measured electron spectrum. We calculate the scattering on the rear side of the vacuum pipe by the GEANT4 simulation and trace the electrons back through the magnetic fields to the spectrometer and registration system. The contribution is a few orders of magnitude smaller compared to the original spectrum at the end of the beta-spectrum of 18.6 keV but reaches 2\\% at 11 keV. Taking into account this rear wall scattering we can fit well the measured spectrum in search for a sterile neutrino component in the tritium beta decay.\n\n", "2409.17498": "2024-09-26, **Dark Photon-Photon Resonance Conversion of GRB221009A through Extra Dimension**, M. Afif Ismail et.al., [2409.17498v1](http://arxiv.org/abs/2409.17498v1)\n\n The recently observed very high energy (VHE) photons dubbed as GRB221009A by several terrestrial observatories such as LHAASO and Carpet-2 require a physics explanation beyond the standard model. Such energetic gamma ray bursts, originating from yet unknown very distance source at redshift z = 0.1505, would be directly scattererd by extragalactic background lights (EBL) rendering its improbable detection at the earth. We show that dark photon which resides in extra dimension would be able to resolve this issue when it oscillates resonantly with the photon in similar fashion with neutrino oscillation. We demonstrate that, for dark photon mass equals to 1 eV, the probability of GRB221009A photons with energy above 0.2 TeV to reach the earth lies in the range between $10^{-6} \\, \\text{to} \\, 95\\% $ for kinetic mixing values $10^{-14} \\leq \\epsilon \\leq 10^{-12.5}$ allowed by current constraints.\n\n"}, "dark matter": {"2409.18103": "2024-09-26, **The Self-Organized Criticality of Dark Matter**, Mingjie Jin et.al., [2409.18103v1](http://arxiv.org/abs/2409.18103v1)\n\n Inspired by the phenomena of self-organized criticality in non-equilibrium systems, we propose a new mechanism for dark matter freeze-out, wherein the final relic abundance is independent of initial inputs.\n\n", "2409.17976": "2024-09-26, **Gamma Lines and Dark Matter from Anomaly Cancellation**, Hridoy Debnath et.al., [2409.17976v1](http://arxiv.org/abs/2409.17976v1)\n\n We discuss a simple theory for physics beyond the Standard Model where a Majorana dark matter is predicted from anomaly cancellation. We discuss in detail the minimal theory where the baryon number is a local symmetry spontaneously broken at the low scale. The correlation between the cosmological constraints on the dark matter relic density, the direct detection and collider bounds is investigated. We discuss in great detail the gamma lines from dark matter annihilation showing the possibility to test these predictions in the near future at gamma-ray telescopes such as CTA. We investigate all processes contributing to the total photon flux from dark matter annihilation and point out the unique features that can be used to test this theory for dark matter.\n\n", "2409.17803": "2024-09-26, **Search for Dark Matter in association with a Higgs boson at the LHC: A model independent study**, Sweta Baradia et.al., [2409.17803v1](http://arxiv.org/abs/2409.17803v1)\n\n Astrophysical and cosmological observations strongly suggest the existence of Dark Matter. However, it's fundamental nature is still elusive. Collider experiments at Large Hadron Collider (LHC) offer a promising way to reveal the particle nature of the dark matter. In such an endeavour, we investigate the potential of the mono-Higgs plus missing $E\\_T$ signature at the LHC to search for dark matter. Without going in a particular Ultra-Violet complete model of dark matter, we have used the framework of Effective Field Theory to describe the dynamics of a relatively light fermionic dark matter candidate, which interacts with the Standard Model via dimension-6 and dimension-7 operators involving the Higgs and the gauge bosons. Both cut-based and Boosted Decision Tree (BDT) algorithms have been used to extract the signal for dark matter production over the Standard Model backgrounds, assuming an integrated luminosity of $3000~fb^{-1}$ at $\\sqrt{s}~=~14$ TeV at the High Luminosity phase of the LHC (HL-LHC). The BDT is seen to separate the dark matter signal at $5\\sigma$ significance, for masses below 200 GeV, showcasing the prospects of this search at the HL-LHC.\n\n", "2409.17760": "2024-09-26, **Motion of spinning particles around black hole in a dark matter halo**, Qin Tan et.al., [2409.17760v1](http://arxiv.org/abs/2409.17760v1)\n\n The motion of a rapidly rotating object in curved spacetime is affected by the spin-curvature force, an effect captured in the motion of spinning test particles. Recently, Cardoso et al.~[Phys. Rev. D 105, L061501 (2022)] found an exact solution describing a black hole immersed in a Hernquist distribution of dark matter. In this work, we investigate the motion of spinning particles around this black hole. We use the Mathison-Papapetrou-Dixon equation and the Tulczyjew spin-supplementary condition to calculate the effective potential, four-momentum, and four-velocity of the spinning particle. The equatorial motion of spinning test particles and the properties of the innermost stable circular orbit are further studied. We find that the existence of dark matter halos can significantly change the orbital eccentricity, energy, and the innermost stable circular orbit parameters of spinning test particles. Compared to the Schwarzschild black hole, dark matter halos bring the innermost stable circular orbit of a spinning test particle closer to the event horizon. These results could help us understanding the properties of black holes in dark matter halos.\n\n"}, "supernova": {"2409.18096": "2024-09-26, **The importance of nuclear star clusters for massive black hole growth and nuclear star formation in simulated low-mass galaxies**, Christian Partmann et.al., [2409.18096v1](http://arxiv.org/abs/2409.18096v1)\n\n Observed low-mass galaxies with nuclear star clusters (NSCs) can host accreting massive black holes (MBH). We present simulations of dwarf galaxies ($M\\_{\\mathrm{baryon}} \\sim 0.6 - 2.4 \\times 10^8 \\rm \\, M\\_\\odot$) at solar mass resolution ($0.5\\rm \\, M\\_\\odot < m\\_{\\mathrm{gas}} < 4 \\rm \\, M\\_\\odot$) with a multi-phase interstellar medium (ISM) and investigate the impact of NSCs on MBH growth and nuclear star formation (SF). The Griffin simulation model includes non-equilibrium low temperature cooling, chemistry and the effect of HII regions and supernovae (SN) from massive stars. Individual stars are sampled down to 0.08 $\\rm M\\_\\odot$ and their non-softened gravitational interactions with MBHs are computed with the regularised Ketju integrator. MBHs with masses in the range of $10^2 - 10^5 \\, \\rm M\\_\\odot$ are represented by accreting sink particles without feedback. We find that the presence of NSCs boost nuclear SF (i.e. NSC growth) and MBH accretion by funneling gas to the central few parsecs. Low-mass MBHs grow more rapidly on $\\sim 600$ Myr timescales, exceeding their Eddington rates at peak accretion. MBH accretion and nuclear SF is episodic (i.e. leads to multiple stellar generations), coeval and regulated by SN explosions. On 40 - 60 Myr timescales the first SN of each episode terminates MBH accretion and nuclear SF. Without NSCs, low-mass MBHs do not grow and MBH accretion and reduced nuclear SF become irregular and uncorrelated. This study gives the first insights into the possible co-evolution of MBHs and NSCs in low-mass galaxies and highlights the importance of considering dense NSCs in galactic studies of MBH growth.\n\n", "2409.17879": "2024-09-26, **Towards primordial gravitational waves and $n_s=1$ in light of BICEP/Keck, DESI BAO and Hubble tension**, Hao Wang et.al., [2409.17879v1](http://arxiv.org/abs/2409.17879v1)\n\n Recent observational data seem to show a $\\gtrsim 3\\sigma$ evidence for an evolving dark energy (DE) against the cosmological constant, so the standard $\\Lambda$CDM model. In this paper, we perform the search for the primordial gravitational waves with the potential pre-recombination solutions to the Hubble tension, using recent DESI baryon acoustic oscillation measurements combined with BICEP/Keck cosmic microwave background (CMB) B-mode polarization, Planck CMB and Pantheon supernova data, which reveal that the low bound of the tensor-to-scalar ratio $r$ is $> 1.5\\sigma$ non-zero with the bestfit $r\\_{0.05}\\sim 0.01$ and the scalar spectral index $n\\_s= 1$ (both $\\|r\\_{0.05}-0.01\\|$ and $\\|n\\_s-1\\|\\sim {\\cal O} (0.001)$). In particular, we observe the unnoticed impact of CMB B-mode polarization data for constraining the nature of DE, which together with early dark energy solutions to the Hubble tension is calling for the return of post-recombination $\\Lambda$CDM.\n\n", "2409.17737": "2024-09-26, **Convective vortices in collapsing stars**, Yerassyl Telman et.al., [2409.17737v1](http://arxiv.org/abs/2409.17737v1)\n\n Recent studies show that non-radial structures arising from massive star shell convection play an important role in shaping core-collapse supernova explosions. During the collapse phase, convective vortices generate acoustic waves that interact with the supernova shock. This amplifies turbulence in the post-shock region, contributing to explosion. We study how various physical parameters influence the evolution of these convective vortices during stellar collapse using simplified simulations. We model the collapsing star with a transonic Bondi flow and represent convection as solenoidal velocity perturbations. Our results are consistent with previous studies, demonstrating that the peak perturbation amplitude scales linearly with the pre-collapse convective Mach number and inversely with the angular wavenumber of convection. While the shell radius and width primarily determine the timescale of accretion, they have little impact on the peak perturbation amplitudes. Finally, we show that when the convective Mach number is below approximately 0.2, the dynamics remain within the linear regime.\n\n", "2409.17542": "2024-09-26, **Evidence for Type Ib/c origin of the supernova remnant G292.0+1.8**, Takuto Narita et.al., [2409.17542v1](http://arxiv.org/abs/2409.17542v1)\n\n Circumstellar material (CSM) produced by mass loss from massive stars ($\\gtrsim10 M\\_{\\odot}$) through strong stellar winds or binary stripping provides rich information for understanding progenitors of core-collapse supernova remnants. In this paper we present a grating spectroscopy of a Galactic SNR G292.0+1.8, which is claimed to be a Type Ib/c remnant in a binary system according to recent studies. If G292.0+1.8 was experienced a strong mass-loss via binary interactions before its explosion, an oxygen-rich material produced in the He-burning layer is expected to be observed in the central belt-like structure formed by shock-heated CSM. Using the Reflection Grating Spectrometer onboard XMM-Newton, we detect N VII Ly$\\alpha$ line (0.50 keV) for the first time in G292.0+1.8 and find that the abundance ratio of nitrogen to oxygen is significantly lower (N/O$=0.5\\pm0.1$) than the solar value. This low N/O suggests that the progenitor of experienced strong mass-loss and ended up to a Wolf-Rayet (WR) star exposing the He-burning layer at the pre-supernova. Comparing our result and the evolution models of single stars and binaries, we conclude that the progenitor of G292.0+1.8 experienced strong mass-loss enough to occur a Type Ib/c supernova. Our finding is another crucial piece of evidence for a stripped-envelope supernova such as Type Ib/c as the origin of G292.0+1.8.\n\n"}}