{"neutrino": {"2505.15227": "2025-05-21, **The CRAB facility at the TU Wien TRIGA reactor: status and related physics program**, H. Abele et.al., [2505.15227v1](http://arxiv.org/abs/2505.15227v1)\n\n The CRAB (Calibrated nuclear Recoils for Accurate Bolometry) project aims to precisely characterize the response of cryogenic detectors to sub-keV nuclear recoils of direct interest for coherent neutrino-nucleus scattering and dark matter search experiments. The CRAB method relies on the radiative capture of thermal neutrons in the target detector, resulting in a nuclear recoil with a well-defined energy. We present a new experimental setup installed at the TRIGA Mark-II reactor at Atominstitut (Vienna), providing a low intensity beam of thermal neutrons sent to the target cryogenic detector mounted inside a wet dilution refrigerator Kelvinox 100. A crown of BaF$\\_2$ detectors installed outside the dewar enables coincident detection of the high-energy $\\gamma$ escaping the target crystal after neutron capture. After the presentation of all components of the setup we report the analysis of first commissioning data with a CaWO$\\_4$ detector of the \\NUCLEUS experiment. They show stable operation of the cryostat and detectors on a week-scale. Due to an energy resolution currently limited to 20 eV we use neutron beam induced events at high energy, in the 10 to 100 keV range, to demonstrate the excellent agreement between the data and simulation and the accurate understanding of external background. Thanks to these data we also propose an updated decay scheme of the low-lying excited states of $^{187}$W. Finally, we present the first evidence of neutron-capture induced coincidences between $\\gamma$-detectors and a cryogenic detector. These promising results pave the way for an extensive physics program with various detector materials, like CaWO$\\_4$, Al$\\_2$O$\\_3$, Ge and Si.\n\n", "2505.15019": "2025-05-21, **Sensitivity of the Hyper-Kamiokande experiment to neutrino oscillation parameters using acceleration neutrinos**, Hyper-Kamiokande Collaboration et.al., [2505.15019v1](http://arxiv.org/abs/2505.15019v1)\n\n This paper describes the analysis to estimate the sensitivity of the Hyper-Kamiokande experiment to long-baseline neutrino oscillation parameters using accelerator (anti)neutrinos. Results are presented for the CPV discovery sensitivity and precision measurements of the oscillation parameters $\\delta\\_{CP}$, $\\sin^2\\theta\\_{23}$, $\\Delta m^2\\_{32}$ and $\\sin^2\\theta\\_{13}$. With the assumed Hyper-Kamiokande running plan, a $5\\sigma$ CPV discovery is possible in less than three years in the case of maximal CPV and known MO.In the absence of external constraints on the MO, considering the MO sensitivity of the Hyper-Kamiokande measurement using atmospheric neutrinos, the time for a CPV discovery could be estimated to be around six years. Using the nominal final exposure of $27 \\times 10^{21}$ protons on target, corresponding to 10 years, with a ratio of 1:3 in neutrino to antineutrino beam mode, we expect to select approximately 10000 charged current, quasi-elastic-like, muon neutrino events, and a similar number of muon anti-neutrino events. In the electron (anti)neutrino appearance channels, we expect approximately 2000 charged current, quasi-elastic-like electron neutrino events and 800 electron antineutrino events. These larges event samples will allow Hyper-Kamiokande to exclude CP conservation at the $5\\sigma$significance level for over 60% of the possible true values of $\\delta\\_{CP}$.\n\n", "2505.14878": "2025-05-20, **Radiative neutrino mass models from non-invertible selection rules**, Tatsuo Kobayashi et.al., [2505.14878v1](http://arxiv.org/abs/2505.14878v1)\n\n We apply non-invertible selection rules coming from a fusion algebra to radiative neutrino mass models where fields are labeled by the elements in the algebra. Since non-invertible selection rules only hold at tree level, radiative corrections naturally explain the origin of tiny neutrino masses. Furthermore, a remnant symmetry of the fusion algebra protects the stability of dark matter, which is conventionally imposed in radiative neutrino models. We also find that interesting neutrino mass textures are realized by assigning fields to family-dependent elements in the algebra.\n\n", "2505.14491": "2025-05-20, **Neutrinophilic Super-Resonant Dark Matter**, Murat Abdughani et.al., [2505.14491v1](http://arxiv.org/abs/2505.14491v1)\n\n Dark matter (DM) annihilation can be significantly enhanced through narrow resonances or the Sommerfeld enhancement effect, with both mechanisms potentially combining in a super-resonant annihilation process. In such scenarios, the conventional assumption that kinetic equilibrium persists until chemical decoupling may not hold, leading to substantial impacts on the final DM relic density. However, a strongly enhanced annihilation cross-section into Standard Model particles, except neutrinos, is constrained by cosmic microwave background (CMB) observations. We thus investigate DM annihilation into neutrino pair final states, focusing on the role of kinetic decoupling. We solve the coupled Boltzmann equations to determine the relic density and constrain the parameter space using current experimental data, while also forecasting the sensitivity of future experiments.\n\n", "2505.14332": "2025-05-20, **Constraints on Neutrino Secret Interactions from Multi-messenger Neutrinos Scattering on C$ν$B**, Maria Petropavlova et.al., [2505.14332v2](http://arxiv.org/abs/2505.14332v2)\n\n We present new constraints on neutrino secret interactions ($\\nu$SI) by studying high-energy neutrinos from well-known astrophysical sources, such as SN1987A, the blazars TXS $0506+056$ and PKS $0735+178$, the active galaxy NGC 1068, and KM3-230213A neutrino event. We extend existing limits by covering a previously unconstrained region of the mediator mass parameter space. Our analysis focuses on Dirac neutrinos interacting with a massive spin-one boson as they propagate through the Cosmic Neutrino Background. We consider both ultra-relativistic and non-relativistic regimes, deriving bounds on the $\\nu$SI coupling constant across the full $\\nu$SI mediator mass range. Our results obtained using analytical methods, demonstrate significant constraints on the $\\nu$SI coupling in the low-mass mediator mass region for a given cutoff parameter.\n\n", "2505.13877": "2025-05-20, **Cosmic Ray Muon Polarization to Facilitate Atmospheric Neutrino Physics**, Ming-Chen Sun et.al., [2505.13877v2](http://arxiv.org/abs/2505.13877v2)\n\n Atmospheric neutrinos (ATNs) offer a paradigm to understand neutrino properties while it is critical to quantify uncertainties in the flux modelings. Measurement of cosmic ray muons will contribute to the precision measurement of atmospheric neutrino oscillations due to the same parent particles. This letter suggests measuring the polarization of cosmic ray muons with an array strategy good for understanding low-energy cosmic ray muons and atmospheric neutrinos. Constraints on long-standing atmospheric neutrino flux uncertainties in the few-GeV range are achievable within one year using a $\\mathcal{O}(10) \\mathrm{m}^2$ array of Cosmic-Ray muon Spin polarization detectoRs (CRmuSRs).\n\n", "2505.13876": "2025-05-20, **The dynamics of the parsec-scale jet in the neutrino blazar PKS 0735+178**, Yu-Sik Kim et.al., [2505.13876v1](http://arxiv.org/abs/2505.13876v1)\n\n Recent studies of individual track-like TeV-PeV IceCube neutrino events suggest that strongly jetted AGNs, blazars, can be plausible sources of extragalactic high-energy neutrinos. Although the broadband emission and neutrinos from such blazars can be modeled by hadronic jets with inverse Compton processes, various models show degeneracies. One of the reasons is the lack of high-resolution observations pinpointing the location and physical conditions of neutrino-emitting plasma. Here, we present a VLBI study of PKS 0735+178 that was recently associated with a high energy neutrino event IceCube-211208A (IC211208) as well as alerts from other neutrino observatories. We analyzed publicly available VLBA 15 and 43 GHz data of 0735+178 during 2020-2024, resolving the mas-scale jet and tracing its time evolution in flux and structure, before and after IC211208. We find significant enhancements in the radio flux density, apparent brightness temperature, and synchrotron opacity at 15-43 GHz of the VLBI nuclear region after IC211208, strengthening the temporal correlation between 0735+178 and IC211208. Furthermore, we find that the source ejected a new VLBI component C2 from the VLBI core before IC211208. C2 traveled further downstream at ~4.2c apparent speed, close to the historical maximum speed for this object. C2 then passed a subluminally moving feature in the jet C1 located at ~0.13 mas (~0.77 pc) downstream the core at the time of IC211208. The time of this apparent passage is statistically coincident with the time of IC211208 within 1sigma uncertainty, suggesting the location of this apparent passage to be a probable spatial origin of IC211208. We discuss the physical implications of these findings.\n\n"}, "dark matter": {"2505.15764": "2025-05-21, **Direct Detection of Cosmic Walls with Paleo Detectors**, Wen Yin et.al., [2505.15764v1](http://arxiv.org/abs/2505.15764v1)\n\n Paleo detectors are emerging dark matter detection technology that exploits ancient minerals as passive, time-integrated detectors. Unlike conventional real-time experiments, they search for permanent damage tracks-typically tens of nanometers to micrometers long-left in crystal lattices by rare particle interactions, most notably dark matter induced nuclear recoils accumulated over millions to billions of years. In this paper I propose a direct detection strategy for cosmic walls-either bubble walls produced by a late-time first-order phase transition or domain walls in a scaling regime-using paleo detectors as the target medium. Because the cosmic wall is expected to traverse Earth at most $\\mathcal{O}(1)$ time(s) in cosmic history, an ancient, continuously exposed detector is the only feasible way to observe it directly. By calculating the target recoils, I find that the smoking-gun signature would be parallel damage tracks found worldwide in minerals older than the wall-crossing epoch. I derive the limit on the wall-target coupling by assuming that a wall passed through the Earth within the last 0.5 Gyr. I also mention a novel indirect detection of ultra-relativistic cosmic walls by noting the induced cosmic rays.\n\n", "2505.15619": "2025-05-21, **Search for Dark Photon Dark Matter of a Mass around $36.1\\text{ }\\mathrmμ\\mathrm{eV}$ Using a Frequency-tunable Cavity Controlled through a Coupled Superconducting Qubit**, K. Nakazono et.al., [2505.15619v1](http://arxiv.org/abs/2505.15619v1)\n\n We report the results of a search for dark photon dark matter using a cavity that employs a transmon qubit as a frequency tuning component. The tuning mechanism utilizes the energy level shift (Lamb shift) arising from the mode mixing between the qubit and the cavity mode. This method offers several advantages: (i) it does not introduce physical thermal noise from the tuning mechanism itself, (ii) it avoids electromagnetic leakage typically associated with cavity seams, and (iii) its implementation is straightforward. We excluded the dark photon parameter region for a dark photon mass around $36.1 \\ \\mathrm{\\mu eV} $with a peak sensitivity of $\\chi \\sim 10^{-12}$ over the mass range $[36.0791, 36.1765] \\ \\mathrm{\\mu eV}$, surpassing the existing cosmological bounds.\n\n", "2505.15550": "2025-05-21, **The Sagittarius stellar stream embedded in a fermionic dark matter halo**, Santiago Collazo et.al., [2505.15550v1](http://arxiv.org/abs/2505.15550v1)\n\n Stellar streams are essential tracers of the gravitational potential of the Milky Way, with key implications to the problem of dark matter (DM) model distributions, either within or beyond phenomenological $\\Lambda$CDM halos. For the first time in the literature, a DM halo model based on first physical principles such as quantum statistical mechanics and thermodynamics is used to try to reproduce the 6D observations of the Sagittarius (Sgr) stream. We model both DM haloes, the one of Sgr dwarf and the one of its host with a spherical self-gravitating system of neutral fermions which accounts for the effects of particles escape and fermion degeneracy, the latter causing a high-density core at the center of the halo. Full baryonic components for each galaxy are also considered. We use a spray algorithm with $\\sim 10^{5}$ particles to generate the Sgr tidal debris, which evolves in the gravitational potential of the host-progenitor system, to compare with the full phase-space data of the stream. We repeat this kind of simulations for different parameter setups of the fermionic model including the particle mass, with special attention to test different DM halo morphologies allowed by the physics. We find that across the different families of fermionic halo models, they can only reproduce the trailing arm of the Sgr stream. Within the observationally allowed span of enclosed masses where the stream moves, neither the power-law like, nor the polytropic behaviour of the fermionic halo models can answer for the observed trend of the leading tail. A conclusion which is shared by former analysis using other type of spherically symmetric haloes. We conclude that further model sophistications such as abandoning spherical symmetry and including the Large Magellanic Cloud perturber are needed for a proper modelisation of the overall Milky Way potential within this kind of first principle halo models.\n\n", "2505.15540": "2025-05-21, **Quasinormal Modes of Schwarzschild Black Holes in the Dehnen-(1, 4, 5/2) Type Dark Matter Halos**, Qi-Qi Liang et.al., [2505.15540v1](http://arxiv.org/abs/2505.15540v1)\n\n The Dehnen - type dark matter density distribution model is mainly used for dwarf galaxies. In recent years, researchers have speculated that black holes may exist in this dark matter model and have given the black hole metric solutions. On this basis, this paper conducts a systematic study on the quasinormal modes of a Schwarzschild black hole in a Dehnen - (1,4, 5/2) dark matter halo, revealing the influences of dark matter distribution and perturbation field types on the black hole's quasinormal modes.The research uses the shadow radius data of the M87$^{\\ast}$ black hole. Through the geodesic equation, two sets of dark matter halo parameter values of $\\rho\\_{\\rm s}$ and $r\\_{\\rm s}$ are determined, and the specific numerical values of the black hole's event horizon radius, photon sphere radius, and shadow radius under the corresponding conditions are obtained. The wave equations and effective potentials of the black hole under the perturbations of the scalar field, electromagnetic field, and axial gravitational were analyzed. It was found that the larger the values of $\\rho\\_{\\rm s}$ or $r\\_{\\rm s}$, the smaller the peak value of the effective potential, and the wave function oscillation slows down with a lower frequency. The black hole remains stable under perturbations. These studies provide relevant data for the quasinormal modes of the Schwarzschild black hole in the Dehnen-(1,4, 5/2) type dark matter halo. They also offer crucial evidence for understanding the interaction mechanism between the black hole and the dark matter halo.\n\n", "2505.15530": "2025-05-21, **A fast deep-learning approach to probing primordial black hole populations in gravitational wave events**, Jun-Qian Jiang et.al., [2505.15530v1](http://arxiv.org/abs/2505.15530v1)\n\n Primordial black holes (PBHs), envisioned as a compelling dark matter candidate and a window onto early-Universe physics, may contribute to the part of the gravitational-wave (GW) signals detected by the LIGO-Virgo-KAGRA network. Traditional hierarchical Bayesian analysis, which relies on precise GW-event posterior estimates, for extracting the information of potential PBH population from GW events become computationally prohibitive for catalogs of hundreds of events. Here, we present a fast deep-learning framework, leveraging Transformer and normalizing flows, that maps GW-event posterior samples to joint posterior distributions over the hyperparameters of the PBH population. Our approach yields accurate credible intervals while reducing end-to-end inference time to $\\mathcal{O}(1)$ s on a single GPU. These results underscore the potential of deep learning for fast, high-accurately PBH population studies in the era of next-generation GW detectors.\n\n", "2505.15448": "2025-05-21, **Constraining scalar-tensor theories from higher harmonics with GW230529**, Baoxiang Wang et.al., [2505.15448v1](http://arxiv.org/abs/2505.15448v1)\n\n The Advanced LIGO and Virgo collaborations recently detected a gravitational wave event, GW230529\\\\_181500, during the fourth observing run, which is most plausibly attributed to the merger of a neutron star and a black hole. This observation provides an opportunity to test a class of gravitational theories that deviate from general relativity. In such theories, additional terms contribute to the gravitational wave signal only in cases of asymmetric binaries. This study focuses on two scalar-tensor models within this class of theories: the Screened Modified Gravity and Brans-Dicke theory. These models have potential applications in areas such as dark matter, dark energy, cosmic inflation, and primordial nucleosynthesis. With the GW230529\\\\_181500 and Bayesian Markov-chain Monte Carlo analyses, we derive a 90\\% credible lower bound as $ \\frac{\\varphi\\_{\\rm\\_{VEV}}}{M\\_{\\rm Pl}}<1.7\\times10^{-2}$ and $\\omega\\_{\\rm BD}>25.12$ by using dominant-mode correction. Asymmetric binary systems usually have a significant mass ratio, in such cases, higher harmonic modes cannot be neglected. Our work considers higher harmonic corrections from scalar-tensor theories and provides a tighter constraint of $ \\frac{\\varphi\\_{\\rm\\_{VEV}}}{M\\_{\\rm Pl}}<1.5\\times10^{-2}$ and $\\omega\\_{\\rm BD}>32.68$, with a 13.3\\% and 30.1\\% improvement respectively. Combining GW230529\\\\_181500, GW200115 and GW190814 and including higher modes, the constraint is improved to $\\frac{\\varphi\\_{\\rm\\_{VEV}}}{M\\_{\\rm Pl}}<7.84\\times10^{-3}$ and $\\omega\\_{\\rm BD}>123.75$. This is currently the strongest constraint from GWs, contingent upon GW190814 being an NSBH event.\n\n", "2505.15419": "2025-05-21, **Impact of general relativistic accretion on primordial black holes**, Santabrata Das et.al., [2505.15419v1](http://arxiv.org/abs/2505.15419v1)\n\n We demonstrate that general relativistic corrections to the accretion of relativistic matter onto primordial black holes (PBHs) can significantly enhance their mass growth during the early Universe. Contrary to previous Newtonian treatments, our analysis reveals that PBH masses can increase by an order of magnitude before evaporation, leading to substantial modifications of their lifetime and cosmological imprints. We quantify the resulting shifts in the minimum PBH mass constrained by Big Bang Nucleosynthesis (BBN), the revised lower bound for PBHs surviving today, and the dark matter parameter space allowed by PBH evaporation. Furthermore, we show that the enhanced accretion alters the high-frequency gravitational wave spectrum from PBH evaporation, potentially within the reach of future detectors. Our results provide a comprehensive, relativistically consistent framework to delineate the role of PBHs in early-universe cosmology and dark matter phenomenology.\n\n", "2505.15226": "2025-05-21, **Comparison of simulations and semi-analytical model for WDM subhalo mass functions**, Mizuki Ono et.al., [2505.15226v1](http://arxiv.org/abs/2505.15226v1)\n\n The Cold Dark Matter (CDM) model successfully explains large-scale structure formation, but challenges remain at smaller scales, leading to interest in Warm Dark Matter (WDM) as an alternative. The abundance of Milky Way subhalos depends on the mass of WDM particles, allowing constraints to be obtained by comparing observations and theoretical models. However, high-resolution simulations of heavier WDM particle masses are computationally demanding, making semi-analytical approaches valuable. In this study, we evaluate the ability of the Semi-Analytical Sub-Halo Inference Modeling for WDM (SASHIMI-W) to reproduce subhalo mass functions for heavier WDM particle masses. We perform high-resolution cosmological N-body simulations for CDM and WDM with particle masses of 1 keV, 3 keV, and 10 keV, and compare the ratio of the subhalo mass function between WDM and CDM cases. Our results show that SASHIMI-W successfully reproduces the simulation results over redshifts z = 0 to z = 2. Furthermore, both simulations and the semi-analytical model show a slight redshift dependence in the subhalo suppression ratio. However, a direct comparison of the differential subhalo mass functions shows discrepancies in the mid- and low-mass regions, suggesting that the tidal stripping effects implemented in SASHIMI-W may be too strong for WDM subhalos, or that the removal of spurious subhalos in the simulations is insufficient. These results validate the use of SASHIMI-W in constraining WDM properties, and highlight the need for refinements in both tidal effect modeling and spurious subhalo filtering to improve subhalo abundance predictions.\n\n", "2505.14783": "2025-05-20, **Fornax dwarf spheroidal in MOND: its formation and the survival of its globular clusters**, Michal Bílek et.al., [2505.14783v1](http://arxiv.org/abs/2505.14783v1)\n\n The Fornax dwarf spheroidal galaxy has five massive globular clusters (GCs). They are often used for testing different dark matter and modified gravity theories, because it is difficult to reconcile their old stellar ages with the short time they need to settle in the center of the galaxy due to dynamical friction. Using high resolution $N$-body simulations with the Phantom of Ramses code, we investigate whether the GCs of Fornax can be reconciled with the modified Newtonian dynamics (MOND), namely its QUMOND formulation. Observational data interpreted in MOND indicate that Fornax is a tidal dwarf galaxy formed at redshift $z=0.9$ in a flyby of the Milky Way (MW) and Andromeda galaxies, and that its GCs were initially massive star clusters in the disk of the MW. This helps us to set up and interpret the simulations. In the simulations, a point-mass GC orbits Fornax, and they both orbit the MW. When we ran multiple simulations with varying initial conditions for the GC, we found a 20% probability of Fornax being observed with five unsunk GCs. The unsunk GCs have the observed radial distribution. Moreover, we found: 1) In MOND, Fornax has an orbit around the MW such that the pericenters coincide with the observed peaks in the star formation history of Fornax; 2) The simulations reproduce the observed ``diffuse stellar halo'' of Fornax; 3) The simulations predict that Fornax has a stellar stream, which could be detectable in the existing data. 4) An extra simulation shows that if Fornax was initially a rotating disky tidal dwarf galaxy, the gravitational influence of the MW would be able to transform it into a nonrotating spheroidal. 5) Sometimes Phantom of Ramses does not conserve angular momentum. This makes the GC sink too fast if it is simulated as an $N$-body object.\n\n", "2505.14779": "2025-05-20, **Accretion of self-interacting dark matter onto supermassive black holes**, V. M. Sabarish et.al., [2505.14779v1](http://arxiv.org/abs/2505.14779v1)\n\n Dark matter (DM) spikes around supermassive black holes (SMBHs) may lead to interesting physical effects such as enhanced DM annihilation signals or dynamical friction within binary systems, shortening the merger time and possibly addressing the `final parsec problem'. They can also be promising places to study the collisionality of DM because their velocity dispersion is higher than in DM halos allowing us to probe a different velocity regime. We aim to understand the evolution of isolated DM spikes for self-interacting dark matter (SIDM) and compute the BH accretion rate as a function of the self-interaction cross-section per unit DM mass ($\\sigma/m\\_\\chi$). We have performed the first $N$-body simulations of SIDM spikes around supermassive black holes (SMBH) and studied the evolution of the spike with an isolated BH starting from profiles similar to the ones that have been shown to be stable in analytical calculations. We find that the analytical profiles for SIDM spikes remain stable over the time-scales of hundreds of years that we have covered with our simulations. In the long-mean-free-path (LMFP) regime, the accretion rate onto the BHs grows linearly with the cross-section and flattens when we move towards the short-mean-free-path (SMFP) regime. In both regimes, our simulations match analytic expectations, which are based on the heat conduction description of SIDM. A simple model for the accretion rate allows us to calibrate the heat conduction in the gravothermal fluid prescription of SIDM. Using this prescription, we determine the maximum allowed accretion rate which occurs when $r\\_{\\rm isco} \\rho(r\\_{\\rm isco}) \\sigma/m\\_\\chi \\sim 1$, where $r\\_{\\rm isco}$ the radius of the innermost stable orbit. Our calibrated DM accretion rates could be used for statistical analysis of SMBH growth and incorporated into subgrid models to study BH growth in cosmological simulations.\n\n", "2505.14768": "2025-05-20, **X-ray properties of compact elliptical galaxies**, Orsolya E. Kovacs et.al., [2505.14768v1](http://arxiv.org/abs/2505.14768v1)\n\n We present the X-ray analysis of seven local compact elliptical galaxies (cEGs), selected for their morphological resemblance to high-redshift red nuggets. As likely descendants of the red nugget population, cEGs offer a unique window into the early Universe, enabling the study of early galaxy evolution and the interplay between black holes, stellar bulges, and dark matter halos. Using data from Chandra and XMM-Newton, we investigate the properties of the hot gaseous halos in cEGs. Two galaxies - MRK 1216 and PGC 32873 - host luminous, spatially extended X-ray atmospheres, allowing us to derive radial thermodynamic profiles. For MRK 1216, we performed high-resolution spectral modeling with RGS data, which hints at super-solar $\\alpha/\\rm{Fe}$ abundance ratios. The remaining galaxies show either faint or undetected X-ray halos, though several display AGN-like (active galactic nucleus) power-law emission. In the context of local scaling relations, cEGs show only mild deviations from the general galaxy population, exhibiting a slightly steeper $M\\_{\\star}-L\\_{X}$ relation and occupying the lower boundary of the $M\\_{\\star}$-$M\\_{\\rm vir}$ relation. These trends suggest that high-redshift red nuggets may also host a diverse range of X-ray atmospheres. We speculate that the compactness of cEGs may trace back to the population of `little red dots' (LRDs), hinting at a potential link between LRDs, red nuggets, and compact relic galaxies in the local Universe.\n\n", "2505.14676": "2025-05-20, **A JWST View of the Overmassive Black Hole in NGC 4486B**, Behzad Tahmasebzadeh et.al., [2505.14676v1](http://arxiv.org/abs/2505.14676v1)\n\n We present a new stellar dynamical measurement of the supermassive black hole (SMBH) in the compact elliptical galaxy NGC 4486B, based on integral field spectroscopy with JWST/NIRSpec. The two-dimensional kinematic maps reveal a resolved double nucleus and a velocity dispersion peak offset from the photometric center. Utilizing two independent methods-Schwarzschild orbit-superposition and Jeans Anisotropic Modeling-we tightly constrain the black hole mass by fitting the full line-of-sight velocity distribution. Our axisymmetric Schwarzschild models yield a best-fit black hole mass of $M\\_{BH} = 3.6^{+0.6}\\_{-0.6} \\times 10^8 \\, M\\_{\\odot}$, slightly lower but significantly more precise than previous estimates. However, since our models do not account for the non-equilibrium nature of the double nucleus, this value may represent a lower limit. The inferred black hole mass corresponds to approximately 4-13% of the total stellar mass, providing robust evidence for an overmassive SMBH in NGC 4486B. Combined with the galaxy's location deep within the Virgo Cluster, our results support the interpretation that NGC 4486B is the tidally stripped remnant core of a formerly massive galaxy. As the JWST/NIRSpec field of view is insufficient to constrain the dark matter halo, we incorporate archival ground-based long-slit kinematics extending to 5 arcsec. While this provides some leverage on the dark matter content, the constraints remain relatively weak. We place only an upper limit on the dark matter fraction, with $M\\_{DM}/M\\_{*} < 0.5$ within 1 kpc-well beyond the effective radius. The inferred black hole mass remains unchanged with or without a dark matter halo.\n\n", "2505.14754": "2025-05-20, **Model-Independent Machine Learning Approach for Nanometric Axial Localization and Tracking**, Andrey Alexandrov et.al., [2505.14754v1](http://arxiv.org/abs/2505.14754v1)\n\n Accurately tracking particles and determining their position along the optical axis is a major challenge in optical microscopy, especially when extremely high precision is needed. In this study, we introduce a deep learning approach using convolutional neural networks (CNNs) that can determine axial positions from dual-focal plane images without relying on predefined models. Our method achieves an axial localization accuracy of 40 nanometers - six times better than traditional single-focal plane techniques. The model's simple design and strong performance make it suitable for a wide range of uses, including dark matter detection, proton therapy for cancer, and radiation protection in space. It also shows promise in fields like biological imaging, materials science, and environmental monitoring. This work highlights how machine learning can turn complex image data into reliable, precise information, offering a flexible and powerful tool for many scientific applications.\n\n", "2505.14426": "2025-05-20, **Distribution of Dark Matter in Galaxies**, P. Steffen et.al., [2505.14426v1](http://arxiv.org/abs/2505.14426v1)\n\n Properties of dark matter particles are investigated using astronomical data evaluated by the SPARC-group: the data of 2693 rotational data points from 153 different galaxies have been combined to an average gravitational behavior of the galaxies. The ratio of dark matter mass to the baryonic mass within the galaxies is determined, as well as the distributions of dark matter masses, mass densities and rotational velocities\n\n", "2505.14291": "2025-05-20, **Searching for Light Dark Matter and Dark Sectors with the NA64 experiment at the CERN SPS**, Yu. M. Andreev et.al., [2505.14291v1](http://arxiv.org/abs/2505.14291v1)\n\n Since its approval in 2016, NA64 has pioneered light dark matter (LDM) searches with electron, positron, muon, and hadron beams. The experiment has successfully met its primary objectives, as outlined in the EPPS input (2018), and even exceeded them, producing results that demonstrate its ability to operate in a near-background-free environment. The Physics Beyond Collider (PBC) initiative at CERN recognizes NA64's contributions as complementary and worthy of continued exploration. Its key advantage over beam-dump approaches is that the signal rate scales as the square of the coupling rather than the fourth power, reducing the required number of beam particles for the same sensitivity.   To fully exploit the NA64 physics potential, an upgrade during LS3 will enable the experiment to run in background-free mode at higher SPS beam rates. Planned upgrades include: (a) improved detector hermeticity with a new veto hadron calorimeter, (b) enhanced particle identification with a synchrotron radiation detector, and (c) increased beam rates via upgraded electronics.   With the recently strengthened NA64 collaboration, stable operations and timely data analysis are planned for LHC Run 4. The expected beam exposures are approximately 1e13 electrons, 1e11 positrons (at 40 and 60 GeV), and 2e13 muons on target. This will allow NA64 to explore new LDM parameter space, with the potential for discovery or conclusive exclusion of many well-motivated models.\n\n", "2505.14258": "2025-05-20, **3D matter power spectrum correspondence to 1D Lyman-alpha flux power spectrum**, Ivan Ridkokasha et.al., [2505.14258v1](http://arxiv.org/abs/2505.14258v1)\n\n The 3D distribution of matter at small scales encodes valuable information about the nature of dark matter and other fundamental physics. A prominent probe of such scales outside galaxies is the Lyman-alpha forest, which studies absorption features in the spectra of high-redshift quasars caused by neutral hydrogen. The measured quantity is the power spectrum of the absorbed flux, which indirectly traces the underlying matter distribution. However, the connection between the measured flux power spectrum and the underlying 3D dark matter power spectrum is highly nontrivial. The flux power spectrum (i) represents a one-dimensional projection of the density field; (ii) traces only neutral hydrogen, subject to thermodynamic pressure; and (iii) is a nonlinear function of local matter density. Additionally, thermal broadening and redshift-space distortions-determined not only by the hydrogen distribution but also by its thermal state and local velocity field-further complicate interpretation. To robustly constrain dark matter properties using the Lyman-alpha forest, these systematics must be carefully modeled and controlled. In this paper, we present a simple phenomenological recipe for mapping the 3D matter power spectrum to the flux power spectrum. We first motivate our approach in the linear regime, then extend it to later times and into the nonlinear regime. We validate our model against a broad suite of warm and cold dark matter simulations, demonstrating that our recipe yields consistent and accurate estimates across a wide parameter space.\n\n"}, "supernova": {"2505.15768": "2025-05-21, **Current constraints on the minimally extended varying speed of light model through the cosmic distance duality relation**, Jaiane Santos et.al., [2505.15768v1](http://arxiv.org/abs/2505.15768v1)\n\n One of the most crucial tests of the standard cosmological model consists on testing possible variations on fundamental physical constants. In frameworks such as the minimally extended varying speed of light model (meVSL), the relationship between the luminosity distance ($D\\_{\\text{L}}$) and the angular diameter distance ($D\\_{\\text{A}}$), namely the cosmic distance duality relation (CDDR), is expected to deviate from $\\eta(z) \\equiv D\\_{\\text{L}}(z)/D\\_{\\text{A}}(z) = (1+z)^{2}$, making it a powerful probe of a potential variation of such a fundamental constant. Hence, we test the viability of the meVSL model through the CDDR by comparing $D\\_{\\text{A}}$ measurements, provided by the transverse (2D) and anisotropic (3D) baryon acoustic oscillations (BAO) observations from different surveys, like SDSS, DES and DESI, in combination with $D\\_{\\text{L}}$ measurements from Pantheon+ type Ia Supernova (SNe) compilation. The Gaussian Process reconstruction is employed on the SN data to match $D\\_{\\text{A}}$ with $D\\_{\\text{L}}$ at the same redshift. We find no deviation of the standard CDDR relation within 1-2$\\sigma$ confidence level when considering SNe with 2D and 3D BAO samples combined together, as well as when considering SNe with 3D BAO only. However, when SNe and 2D BAO only are considered, the standard CDDR is only recovered at $\\sim 4\\sigma$ confidence level. However, such a result might be due to some recently discussed tensions between SN and BAO datasets, especially at low redshifts, in addition to possible inconsistencies between the BAO datasets individually. Therefore, our results show no significant evidence in favour of the meVSL model, once these potential systematics are taken into account.\n\n", "2505.15691": "2025-05-21, **Stellar population modelling of neutron stars and black holes: spatially-resolved graveyards in MaNGA/SDSS-IV galaxies**, Claudia Maraston et.al., [2505.15691v1](http://arxiv.org/abs/2505.15691v1)\n\n We update our stellar population models for the time evolution of the number and mass of massive remnants - neutron stars and black holes - with a new initial mass-remnant mass relation for core collapse supernovae. The calculations are based on hydrodynamical simulations and induced explosions of a subset of previously published pre-supernovae models spanning a wide range of stellar mass, metallicity and different values for rotation velocity. The resulting stellar population models predict lower numbers of neutron stars (by up to 0.3 dex) and higher numbers of black holes (by up to 0.8 dex), especially when stellar rotation is considered. The mass fraction locked in neutron stars and black holes is lowest in high-metallicity populations, with the largest number of remnants found at about half-solar metallicity. This mirrors the amount of available gas, ranging from 35 per cent to 45 per cent. We then apply our new models to IFU spectra for ~10,000 galaxies from the SDSS-IV/MaNGA survey for which we previously published spatially-resolved star formation histories. This allows us to probe spatially-resolved graveyards in galaxies of different types. The number and radial distribution of remnants depend on a galaxy's mass, star formation history and metal content. More massive and hence more metal-rich galaxies are found to host fewer remnants. Radial gradients in the number of remnants depend on galaxy mass mostly because of the mass-dependent profiles in mass density: the gradients are flat in low-mass galaxies, and negative in high-mass galaxies, particularly in Milky Way analogues.\n\n", "2505.15614": "2025-05-21, **Implementation of CR Energy SPectrum (CRESP) algorithm in PIERNIK MHD code. II. Propagation of Primary and Secondary nuclei in a magneto-hydrodynamical environment**, Antoine Baldacchino-Jordan et.al., [2505.15614v1](http://arxiv.org/abs/2505.15614v1)\n\n We developed a new model for the production and propagation of spectrally resolved primary and secondary Cosmic Ray (CR) nuclei elements within the framework of the Cosmic Ray Energy Spectrum (CRESP) module of the PIERNIK MHD code. We extend the algorithm to several CR nuclei and demonstrate our code's capability to model primary and secondary CR species simultaneously. Primary C, N, and O are accelerated in supernova (SN) remnants. In contrast, the spallation collisions of the primary nuclei against the thermal ISM protons lead to secondary Li, Be, and B products. All the CR species evolve according to the momentum-dependent Fokker-Planck equations that are dynamically coupled to the MHD system of equations governing the evolution of the ISM. We demonstrate the operation of this system in the gravity-stratified box, reproducing the Milky Way conditions in the Sun's local environment. We perform a parameter study by investigating the impact of the SN rate, CR parallel diffusion coefficient $D\\_\\parallel$, and the rigidity-dependent diffusion coefficient power index $\\delta$. A novel result of our investigation is that the Secondary to Primary flux ratio \\BtoC grows when the diffusion coefficient grows, due to the weaker vertical magnetic field resulting from CR buoyancy effects. Moreover, a higher SN rate leads to lower values of \\BtoC because of stronger winds and the shorter residence of primary CR particles in dense disk regions.\n\n", "2505.14780": "2025-05-20, **Binary stars take what they get: Evidence for Efficient Mass Transfer from Stripped Stars with Rapidly Rotating Companions**, Thibault Lechien et.al., [2505.14780v1](http://arxiv.org/abs/2505.14780v1)\n\n Binary stars and their interactions shape the formation of compact binaries, supernovae, and gravitational wave sources. The efficiency of mass transfer - the fraction of mass retained by the accretor during binary interaction - is a critical parameter that significantly impacts the final fate of these systems. However, this parameter is observationally poorly constrained due to a scarcity of well-characterized post-mass-transfer binaries. Be+sdOB binaries, consisting of a rapidly rotating Be star and a stripped hot subdwarf companion, are particularly valuable for studying mass transfer since they represent clear examples of past binary interaction. Recently, a significantly expanded observational sample of 16 Be+sdOB binaries with well-constrained masses was obtained through combined spectroscopic and interferometric observations. In this work, we compile and analyze this sample to provide robust constraints on the mass transfer efficiency in binaries that underwent stable mass transfer during the donor's hydrogen-shell burning phase. Our analysis reveals that mass transfer was predominantly conservative: half of the systems require mass transfer efficiencies above 50%. This challenges commonly adopted assumptions of highly non-conservative mass transfer in binary evolution modeling. Our findings are inconsistent with models that account for spin-up and limit accretion due to a centrifugal barrier. We also find tension with a commonly used mass transfer model in rapid population synthesis that limits accretion based on the thermal timescale of the accretor. These results have strong implications for almost all products of binary evolution including the variety of supernovae, white dwarfs, blue stragglers, runaway stars, X-ray binaries, and gravitational-wave sources.\n\n", "2505.13825": "2025-05-20, **TransFit: An Efficient Framework for Transient Light-Curve Fitting with Time-Dependent Radiative Diffusion**, Liang-Duan Liu et.al., [2505.13825v1](http://arxiv.org/abs/2505.13825v1)\n\n Modeling the light curves (LCs) of luminous astronomical transients, such as supernovae, is crucial for understanding their progenitor physics, particularly with the exponential growth of survey data. However, existing methods face limitations: efficient semi-analytical models (e.g., Arnett-like) employ significant physical simplifications (like time-invariant temperature profiles and simplified heating distributions), often compromising accuracy, especially for early-time LCs. Conversely, detailed numerical radiative transfer simulations, while accurate, are computationally prohibitive for large datasets. This paper introduces TransFit, a novel framework that numerically solves a generalized energy conservation equation, explicitly incorporating time-dependent radiative diffusion, continuous radioactive or central engine heating, and ejecta expansion dynamics. The model accurately captures the influence of key ejecta properties and diverse heating source characteristics on light curve morphology, including peak luminosity, rise time, and overall shape. Furthermore, TransFit provides self-consistent modeling of the transition from shock-cooling to $^{56}$Ni}-powered light curves. By combining physical realism with computational speed, TransFit provides a powerful tool for efficiently inverting LCs and extracting detailed physical insights from the vast datasets of current and future transient surveys.\n\n"}}