{"neutrino": {"2407.18233": "2024-07-25, **One-point Statistics in various cosmic environments in the presence of massive neutrinos**, Mohadese Khoshtinat et.al., [2407.18233v1](http://arxiv.org/abs/2407.18233v1)\n\n Studying the structures (halos and galaxies) within the cosmic environments (void, sheet, filament, and node) where they reside is an ongoing attempt in cosmological studies. The link between the properties of structures and the cosmic environments may help to unravel the nature of the dark sector of the Universe. In this paper, we study the cosmic web environments from the spatial pattern perspective in the context of $ \\Lambda $CDM and $ \\nu \\Lambda $CDM as an example of an extension to the vanilla model. To do this, we use the T-web classification method and classify the cosmic environments for the catalogues from the gevolution N-body simulations for $ \\Lambda $CDM and $ \\nu \\Lambda $CDM cosmology. Then, we compute the first nearest neighbour cumulative distribution function, spherical contact cumulative distribution function, and $ J$-function for every cosmic environment. In the context of the standard model, the results indicate that these functions can differentiate the various cosmic environments. In association with distinguishing between extensions of the standard model of cosmologies, these functions within the cosmic environment seem beneficial as a complementary probe.\n\n", "2407.18211": "2024-07-25, **Confronting a Standard Model extension with a dark $U(1)$ gauge sector with the prediction for the W-boson mass**, Stefan Dittmaier et.al., [2407.18211v1](http://arxiv.org/abs/2407.18211v1)\n\n The Dark Abelian Sector Model (DASM) is an extension of the Standard Model of particle physics with an additional spontaneously broken $U\\_\\text{d}(1)$ gauge symmetry connected to a dark sector, i.e. the SM particles do not carry the corresponding charge. In addition to the gauge boson resulting from the extra $U\\_\\text{d}(1)$ gauge symmetry, the particle content is extended by a further Higgs boson, one Dirac fermion as well as right-handed neutrinos. Employing the $U\\_Y(1)$ field-strength tensor as well as the SM Higgs mass operator (the only two singlet operators of the SM with dimension less than four) and the right-handed neutrino fields, we open three portals to the dark sector.   After an introduction of the model, we discuss a renormalization scheme for the complete model with a special focus on the renormalization of the mixing angles. Finally, as an example of application, we present the prediction for the W-boson mass derived from muon decay in the DASM.\n\n", "2407.18189": "2024-07-25, **Unlocking Discovery Potential for Decaying Dark Matter and Faint X-ray Sources with XRISM**, Yu Zhou et.al., [2407.18189v1](http://arxiv.org/abs/2407.18189v1)\n\n Astrophysical emission lines arising from particle decays can offer unique insights into the nature of dark matter (DM). Using dedicated simulations with background and foreground modeling, we comprehensively demonstrate that the recently launched XRISM space telescope with powerful X-ray spectroscopy capabilities is particularly well-suited to probe decaying DM, such as sterile neutrinos and axion-like particles, in the mass range of few to tens of keV. We analyze and map XRISM's DM discovery potential parameter space by considering Milky Way Galactic DM halo, including establishing an optimal line-of-sight search, as well as dwarf galaxies where we identify Segue 1 as a remarkably promising target. We demonstrate that with only 100 ks exposure XRISM/Resolve instrument is capable of probing the underexplored DM parameter window around few keV and testing DM couplings with sensitivity that exceeds by two orders existing Segue 1 limits. Further, we demonstrate that XRISM/Xtend instrument sensitivity enables discovery of the nature of faint astrophysical X-ray sources, especially in Segue 1, which could shed light on star-formation history. We discuss implications for decaying DM searches with improved detector energy resolution in future experiments.\n\n", "2407.18102": "2024-07-25, **A bound on thermal y-distortion of the cosmic neutrino background**, Gabriela Barenboim et.al., [2407.18102v1](http://arxiv.org/abs/2407.18102v1)\n\n We consider the possibility that the cosmic neutrino background might have a nonthermal spectrum, and investigate its effect on cosmological parameters relative to standard $\\Lambda$-Cold Dark Matter ($\\Lambda$CDM) cosmology. As a specific model, we consider a thermal $y$-distortion, which alters the distribution function of the neutrino background by depleting the population of low-energy neutrinos and enhancing the high-energy tail. We constrain the thermal $y$-parameter of the cosmic neutrino background using Cosmic Microwave Background (CMB) and Baryon Acoustic Oscillation (BAO) measurements, and place a $95\\%$-confidence upper bound of $y \\leq 0.043$. The $y$-parameter increases the number of effective relativistic degrees of freedom, reducing the sound horizon radius and increasing the best-fit value for the Hubble constant $H\\_0$. We obtain an upper bound on the Hubble constant of $H\\_0 = 71.12\\ \\mathrm{km/s/Mpc}$ at $95\\%$ confidence, substantially reducing the tension between CMB/BAO constraints and direct measurement of the expansion rate from Type-Ia supernovae. Including a spectral distortion also allows for a higher value of the spectral index of scalar fluctuations, with a best-fit of $n\\_{\\mathrm{S}} = 0.9720 \\pm 0.0063$, and a $95\\%$-confidence upper bound of $n\\_{\\mathrm{S}} \\leq 0.9842$.\n\n", "2407.18047": "2024-07-25, **Neutrino cosmology after DESI: tightest mass upper limits, preference for the normal ordering, and tension with terrestrial observations**, Jun-Qian Jiang et.al., [2407.18047v1](http://arxiv.org/abs/2407.18047v1)\n\n The recent DESI Baryon Acoustic Oscillation measurements have led to tight upper limits on the neutrino mass sum, potentially in tension with oscillation constraints requiring $\\sum m\\_{\\nu} \\gtrsim 0.06\\,{\\text{eV}}$. Under the physically motivated assumption of positive $\\sum m\\_{\\nu}$, we study the extent to which these limits are tightened by adding other available cosmological probes, and robustly quantify the preference for the normal mass ordering over the inverted one, as well as the tension between cosmological and terrestrial data. Combining DESI data with Cosmic Microwave Background measurements and several late-time background probes, the tightest $2\\sigma$ limit we find without including a local $H\\_0$ prior is $\\sum m\\_{\\nu}<0.05\\,{\\text{eV}}$. This leads to a strong preference for the normal ordering, with Bayes factor relative to the inverted one of $46.5$. Depending on the dataset combination and tension metric adopted, we quantify the tension between cosmological and terrestrial observations as ranging between $2.5\\sigma$ and $5\\sigma$. These results are strenghtened when allowing for a time-varying dark energy component with equation of state lying in the physically motivated non-phantom regime, $w(z) \\geq -1$, highlighting an interesting synergy between the nature of dark energy and laboratory probes of the mass ordering. If these tensions persist and cannot be attributed to systematics, either or both standard neutrino (particle) physics or the underlying cosmological model will have to be questioned.\n\n", "2407.17606": "2024-07-24, **A Flexible Data Acquisition System Architecture for the Nab Experiment**, D. G. Mathews et.al., [2407.17606v1](http://arxiv.org/abs/2407.17606v1)\n\n The Nab experiment will measure the electron-neutrino correlation and Fierz interference term in free neutron beta decay to test the Standard Model and probe Beyond the Standard Model Physics. Using National Instrument's PXIe-5171 Reconfigurable Oscilloscope module, we have developed a data acquisition system that is not only capable of meeting Nab's specifications, but flexible enough to be adapted in situ as the experimental environment dictates. The L1 and L2 trigger logic can be reconfigured to optimize the system for coincidence event detection at runtime through configuration files and LabVIEW controls. This system is capable of identifying L1 triggers at at least $1$ MHz, while reading out a peak signal rate of approximately $2$ GB/s. During commissioning, the system ran at a sustained readout rate of $400$ MB/s of signal data originating from roughly $6$ kHz L2 triggers, well within the peak performance of the system.\n\n", "2407.17595": "2024-07-24, **Measurement of the $^8$B Solar Neutrino Flux Using the Full SNO+ Water Phase**, SNO+ Collaboration et.al., [2407.17595v1](http://arxiv.org/abs/2407.17595v1)\n\n The SNO+ detector operated initially as a water Cherenkov detector. The implementation of a sealed covergas system midway through water data taking resulted in a significant reduction in the activity of $^{222}$Rn daughters in the detector and allowed the lowest background to the solar electron scattering signal above 5 MeV achieved to date. This paper reports an updated SNO+ water phase $^8$B solar neutrino analysis with a total livetime of 282.4 days and an analysis threshold of 3.5 MeV. The $^8$B solar neutrino flux is found to be $\\left(2.32^{+0.18}\\_{-0.17}\\text{(stat.)}^{+0.07}\\_{-0.05}\\text{(syst.)}\\right)\\times10^{6}$ cm$^{-2}$s$^{-1}$ assuming no neutrino oscillations, or $\\left(5.36^{+0.41}\\_{-0.39}\\text{(stat.)}^{+0.17}\\_{-0.16}\\text{(syst.)} \\right)\\times10^{6}$ cm$^{-2}$s$^{-1}$ assuming standard neutrino oscillation parameters, in good agreement with both previous measurements and Standard Solar Model Calculations. The electron recoil spectrum is presented above 3.5 MeV.\n\n", "2407.17462": "2024-07-24, **The HalfDome Multi-Survey Cosmological Simulations: N-body Simulations**, Adrian E. Bayer et.al., [2407.17462v1](http://arxiv.org/abs/2407.17462v1)\n\n Upcoming cosmological surveys have the potential to reach groundbreaking discoveries on multiple fronts, including the neutrino mass, dark energy, and inflation. Most of the key science goals require the joint analysis of datasets from multiple surveys to break parameter degeneracies and calibrate systematics. To realize such analyses, a large set of mock simulations that realistically model correlated observables is required. In this paper we present the N-body component of the HalfDome cosmological simulations, designed for the joint analysis of Stage-IV cosmological surveys, such as Rubin LSST, Euclid, SPHEREx, Roman, DESI, PFS, Simons Observatory, CMB-S4, and LiteBIRD. Our 300TB initial data release includes full-sky lightcones and halo catalogs between $z$=0--4 for 11 fixed cosmology realizations, as well as an additional run with local primordial non-Gaussianity ($f\\_{\\rm NL}$=20). The simulations evolve $6144^3$ particles in a 3.75$\\,h^{-1} {\\rm Gpc}$ box, reaching a minimum halo mass of $\\sim 6 \\times 10^{12}\\,h^{-1} M\\_\\odot$ and maximum scale of $k \\sim 1\\,h{\\rm Mpc}^{-1}$. Instructions to access the data, and plans for future data releases, can be found at https://halfdomesims.github.io.\n\n", "2407.17247": "2024-07-24, **Exploring new physics with DUNE high energy flux: the case of Lorentz Invariance Violation, Large Extra Dimensions and Long Range Forces**, Alessio Giarnetti et.al., [2407.17247v1](http://arxiv.org/abs/2407.17247v1)\n\n DUNE is a next-generation long-baseline neutrino oscillation experiment. It is expected to measure with an unprecedent precision the atmospheric oscillation parameters, including the CP-violating phase $\\delta\\_{CP}$. Moreover, several studies have suggested that its unique features should allow DUNE to probe several new physics scenarios. In this work, we explore the performances of the DUNE far detector in constraining new physics if a high-energy neutrino flux is employed (HE-DUNE). We take into account three different scenarios: Lorentz Invariance Violation (LIV), Long Range Forces (LRF) and Large Extra Dimensions (LED). Our results show that HE-DUNE should be able to set bounds competitive to the current ones and, in particular, it can outperform the standard DUNE capabilities in constraining CPT-even LIV parameters and the compactification radius $R\\_{ED}$ of the LED model.\n\n", "2407.17188": "2024-07-24, **The case for adopting the sequential Jacobi's diagonalization algorithm in neutrino oscillation physics**, Gustavo A. Valdiviesso et.al., [2407.17188v1](http://arxiv.org/abs/2407.17188v1)\n\n Neutrino flavor oscillations and conversion in the presence of an interacting background may offer the missing evidence for charge-parity violation in the leptonic sector of the Standard Model, as well as yet undiscovered new interactions. The usual approach for simulating these effects is by numerically integrating the Schrodinger equation over the neutrino trajectory, arriving at the conversion and survival probabilities for each flavor. From these, the neutrino mixing matrix and its parameters are recovered. This work makes the case for a different numerical approach, which starts by recognizing how Jacobi's diagonalization algorithm is the most suitable for neutrino oscillations in general. By switching from physical space to a parameter space of choice, Jacobi's algorithm results in both eigenvalues and eigenvectors simultaneously, with only local round-off errors. This approach is trivially parallelizable, making it a suitable choice for concurrent computation. Moreover, the freedom to build a parameter space allows for quasi-model-independent solutions, which in turn eliminates the necessity of repeating the simulation for every change in the model's parameters. Benchmarks and efficiency analyses are discussed, as well as a concrete neutrino oscillation example.\n\n"}, "dark matter": {"2407.18252": "2024-07-25, **From 100 kpc to 10 Gpc: Dark Matter self-interactions before and after DESI**, Salvatore Bottaro et.al., [2407.18252v1](http://arxiv.org/abs/2407.18252v1)\n\n We consider Dark Matter self-interactions mediated by ultralight scalars. We show that effectively massless mediators lead to an enhancement of the matter power spectrum, while heavier mediators lead to a suppression, together with a feature around their Jeans scale. We derive the strongest present constraints by combining Planck and BOSS data. The recent DESI measurements of Baryon Acoustic Oscillations exhibit a mild preference for long-range self-interactions, as strong as 4 per mille of the gravitational coupling. Forthcoming data from DESI itself and Euclid will confirm or disprove such a hint.\n\n", "2407.18246": "2024-07-25, **Probing the early universe with future GW observatories**, Suvashis Maity et.al., [2407.18246v1](http://arxiv.org/abs/2407.18246v1)\n\n One of the fundamental characteristics of slow roll inflation is its generation of tensor perturbations, which manifest as stochastic gravitational waves (GWs). Slow roll inflation results in a nearly scale-invariant GW spectrum that maintains its scale invariance as it transitions into the radiation-dominated era. However, introducing an intermediate reheating phase can modify the spectral tilt, depending on the equation of state governing that particular epoch. These GWs, especially on smaller scales, are anticipated to be observable by forthcoming GW detectors. In this study, we initially delineate the parameter space encompassing the inflationary energy scale, reheating temperature, and equation of state in a model-independent manner, focusing on the spectra detectable by GW detectors such as LISA, ET, DECIGO, and BBO. We also examine the implications for the $\\alpha$-attractor model of inflation and explore the observational constraints on $n\\_s-r$ prediction in the light of GW detection. Then, we point out the probable ranges for various non-gravitational and gravitational coupling between the inflaton and Standard Model particles considering the perturbative reheating. If one assumes PBHs were formed during the early reheating era, such detection of GW signal also sheds light on the probing PBH parameters. Note that for the case of PBH domination, we also consider the contribution of the induced GW due to the density function in PBH distribution, which helps to decode the phase of early PBH domination. Finally, to test the production of other cosmological relics through future GW missions, we consider dark matter produced via gravitational interaction in the early universe.\n\n", "2407.18084": "2024-07-25, **Testing non-local gravity through Ultra-Diffuse Galaxies kinematics**, Filippo Bouchè et.al., [2407.18084v1](http://arxiv.org/abs/2407.18084v1)\n\n The emergence of the Ultra-Diffuse Galaxies in recent years has posed a severe challenge to the galaxy formation models as well as the Extended Theories of Gravity. The existence of both dark matter lacking and dark matter dominated systems within the same family of astrophysical objects indeed requires the gravity models to be versatile enough to describe very different gravitational regimes. In this work, we study a non-local extension of the theory of General Relativity that has drawn increasing attention in recent years due to its capability to account for the late time cosmic acceleration without introducing any dark energy fluid. We leverage the kinematic data of three Ultra-Diffuse Galaxies: NGC 1052-DF2 and NGC 1052-DF4, which are dark matter lacking, and Dragonfly 44, which exhibits a highly dominant dark matter component. Our analysis shows that the non-local corrections to the Newtonian potential do not affect the kinematic predictions, hence no spoiling effects emerge when the Non-local Gravity model serves as a dark energy model. We additionally provide the minimum value that the characteristic non-local radii can reach at these mass scales.\n\n", "2407.18071": "2024-07-25, **Intergalactic-Absorption Confounding Circumgalactic Observations**, Itai Bromberg et.al., [2407.18071v1](http://arxiv.org/abs/2407.18071v1)\n\n The origin of warm ions in the circum-galactic medium (CGM) surrounding massive galaxies remains a mystery. In this paper, we argue that a significant fraction of the observed warm-ion columns may arise in the intergalactic medium (IGM) surrounding galactic halos. We use a simple spherical collapse model of the dark matter (DM) halos and their baryonic content to compute the evolving ion fractions within and outside virial halos. We show that the photoionized IGM may produce a thick blanket of warm ions around the CGM, thereby contaminating CGM observations. We find that the IGM contributes $> 75\\%$ of the total \\ion{O}{6} column densities in halos with virial masses exceeding a few times $10^{11}~M\\_\\odot$, and that it may dominate the \\ion{O}{6} absorption even for lower mass-halos, depending on the impact parameter. We compare our results with observations and find that our simplified model reproduces the overall \\ion{O}{6} columns as well as their trend with the impact parameter and halo mass. We show that observed warm ion columns may be completely dominated by the IGM envelopes, consistent with CGM$^2$ data. We, therefore, suggest that theoretical interpretations of CGM-survey observations must consider the possible contribution of the surrounding IGM. Although our simplified model suggests that it may be possible to kinematically distinguish between CGM and IGM origins through the absorption line profiles, this distinction is likely unfeasible in realistic astrophysical halos, due to the complex velocity structure in the multi-phased CGM.\n\n", "2407.17872": "2024-07-25, **The DAMIC-M Low Background Chamber**, I. Arnquist et.al., [2407.17872v1](http://arxiv.org/abs/2407.17872v1)\n\n The DArk Matter In CCDs at Modane (DAMIC-M) experiment is designed to search for light dark matter (m$\\_{\\chi}$<10\\,GeV/c$^2$) at the Laboratoire Souterrain de Modane (LSM) in France. DAMIC-M will use skipper charge-coupled devices (CCDs) as a kg-scale active detector target. Its single-electron resolution will enable eV-scale energy thresholds and thus world-leading sensitivity to a range of hidden sector dark matter candidates. A DAMIC-M prototype, the Low Background Chamber (LBC), has been taking data at LSM since 2022. The LBC provides a low-background environment, which has been used to characterize skipper CCDs, study dark current, and measure radiopurity of materials planned for DAMIC-M. It also allows testing of various subsystems like readout electronics, data acquisition software, and slow control. This paper describes the technical design and performance of the LBC.\n\n", "2407.17809": "2024-07-25, **Tracing the evolution of the cool gas in CGM and IGM environments through Mg II absorption from redshift z=0.75 to z=1.65 using DESI-Y1 data**, X. Wu et.al., [2407.17809v1](http://arxiv.org/abs/2407.17809v1)\n\n We present a measurement of the mean absorption of cool gas traced by Mg II (${\\lambda\\lambda 2796, 2803}$) around emission line galaxies (ELGs), spanning spatial scales from 20 kpc to 10 Mpc. The measurement is based on cross-matching the positions of about 2.5 million ELGs at $z = 0.75-1.65$ and the metal absorption in the spectra of 1.4 million background quasars with data provided by the Year 1 sample of the Dark Energy Spectroscopic Instrument (DESI). The ELGs are divided into two redshift intervals: $0.75 < z < 1.0$ and $1.0 < z < 1.65$. We find that the composite spectra constructed by stacking the ELG-QSO pairs show evolution with redshift, with $z>1$ having a systematically higher signal of Mg II absorption. Within 1 Mpc, the covering fraction of the cool gas at $z > 1$ is higher than that of $z < 1$. The enhancement becomes less apparent especially if the projected distance $r\\_{p}>$1 Mpc. Also, ELGs with higher stellar mass and star formation rate (SFR) yield higher clustering of Mg II absorbers at $z<1$. For $z>1$, the covering fractions with different SFRs show little difference. The higher Mg II absorption at higher redshift also supports the observations of higher star formation at cosmic noon. Besides, the profile of Mg II absorption reveals a change of slope on scales of about 1 Mpc, consistent with the expected transition from a dark matter halo-dominated environment to a regime where clustering is dominated by halo-halo correlations. We estimate the cool gas density profile and derive the metal abundance at different redshifts. The growth of metal abundance suggests an increased presence of cool gas in the intergalactic medium (IGM) towards higher redshifts.\n\n", "2407.17599": "2024-07-24, **Unexplained correlation between the Cosmic Microwave Background temperature and the local matter density distribution**, M. Cruz et.al., [2407.17599v1](http://arxiv.org/abs/2407.17599v1)\n\n Recent observations have indicated a Cosmic Microwave Background (CMB) temperature decrement in the direction of local galaxies within the 2MASS Redshift Survey. We investigate this detection by analyzing its frequency dependence and sensitivity to component separation methods, suggesting that Galactic foregrounds are unlikely to be the cause. Contrary to previous studies, we find that the decrement is independent of galaxy type, indicating a possible correlation between the CMB and the overall matter density field. To test this hypothesis, we employ three analytical approaches: cross-correlation analysis, template fitting, and Bayes Factor calculation. Our cross-correlation analysis shows a significant correlation (p < 0.7%) between the CMB and the 2MASS Redshift Survey projected matter density at distances below 50 Mpc/h. Template fitting and Bayes Factor analyses support this finding, albeit with lower significance levels (1% - 5%). Importantly, we do not detect this signal beyond 50 Mpc/h, which constrains potential physical interpretations. We discuss that the physical origin of this correlation could potentially be linked to the dark matter distribution in the halos of galaxies. Further investigation is required to confirm and understand this intriguing connection between the CMB and local matter distribution.\n\n", "2407.17315": "2024-07-24, **Vector Dark Matter Halo: From Polarization Dynamics to Direct Detection**, Jiajun Chen et.al., [2407.17315v2](http://arxiv.org/abs/2407.17315v2)\n\n This study investigates the characteristic polarization formation and evolution of vector dark matter (VDM) in the outer halo of galaxies. By employing numerical simulations, we analyze the behavior of VDM under different initial conditions -- homogeneous, isotropic, and partially polarized. The simulations solve the Schr\\\"odinger-Poisson equations, examining the spin density distribution and its evolution during gravitational collapse and halo formation. Our results reveal that VDM forms halos and central Proca stars from homogeneous and isotropic conditions, with the polarization density fluctuation amplitude mirroring VDM matter density. In scenarios with no initial polarization, spin density remains stable in the halo core but fluctuates in outer regions. Partially polarized initial conditions lead to a conservation of total polarization, with increased core polarization resulting in opposite polarization in the periphery. We examine the novel consequences of the partially polarized state for direct detection of dark photons, i.e., VDM kinetically mixed with ordinary photons.\n\n", "2407.17059": "2024-07-24, **Fuzzy Dark Matter Constraints from the Hubble Frontier Fields**, Jackson Sipple et.al., [2407.17059v1](http://arxiv.org/abs/2407.17059v1)\n\n In fuzzy dark matter (FDM) cosmologies, the dark matter consists of ultralight bosons ($m\\lesssim10^{-20}$ eV). The astrophysically large de Broglie wavelengths of such particles hinder the formation of low-mass dark matter halos. This implies a testable prediction: a corresponding suppression in the faint-end of the ultraviolet luminosity function (UVLF) of galaxies. Notably, recent estimates of the faint-end UVLF at $z\\sim5-9$ in the Hubble Frontier Fields, behind foreground lensing clusters, probe up to five magnitudes fainter than typical (\"blank-field\") regions. These measurements thus far disfavor prominent turnovers in the UVLF at low luminosity, implying bounds on FDM. We fit a semi-empirical model to these and blank-field UVLF data, including the FDM particle mass as a free parameter. This fit excludes cases where the dark matter is entirely a boson of mass $m<1.5\\times10^{-21}$ eV (with $2\\sigma$ confidence). We also present a less stringent bound deriving solely from the requirement that the total observed abundance of galaxies, integrated over all luminosities, must not exceed the total halo abundance in FDM. This more model-agnostic bound disfavors $m<5\\times10^{-22}$ eV ($2\\sigma$). We forecast that future UVLF measurements from JWST lensing fields may probe masses several times larger than these bounds, although we demonstrate this is subject to theoretical uncertainties in modeling the FDM halo mass function.\n\n"}, "supernova": {"2407.17739": "2024-07-25, **Observational Evidence for Magnetic Field Amplification in SN 1006**, Moeri Tao et.al., [2407.17739v1](http://arxiv.org/abs/2407.17739v1)\n\n We report the first observational evidence for magnetic field amplification in the north-east/south-west (NE/SW) shells of supernova remnant SN 1006, one of the most promising sites of cosmic ray (CR) acceleration. In previous studies, the strength of magnetic fields in these shells was estimated to be $B\\_{\\rm SED}$ $\\simeq$ 25$\\mu$G from the spectral energy distribution, where the synchrotron emission from relativistic electrons accounted for radio to X-rays, along with the inverse Compton emission extending from the GeV to TeV energy bands. However, the analysis of broadband radio data, ranging from 1.37~GHz to 100~GHz, indicated that the radio spectrum steepened from $\\alpha\\_1 = 0.52 \\pm 0.02$ to $\\alpha\\_2 = 1.34 \\pm 0.21$ by $\\Delta \\alpha$ = 0.85 $\\pm$ 0.21. This is naturally interpreted as a cooling break under strong magnetic field of $B\\_{\\rm brk}$ $\\ge$ 2~mG. Moreover, the high-resolution MeerKAT image indicated that the width of the radio NE/SW shells was broader than that of the X-ray shell by a factor of only 3$-$20, as measured by Chandra. Such narrow radio shells can be naturally explained if the magnetic field responsible for the radio emissions is $B\\_{\\rm R}$ $\\ge$ 2 mG. Assuming that the magnetic field is locally enhanced by a factor of approximately $a$ = 100 along the NE/SW shells, we argue that the filling factor, which is the volume ratio of such a magnetically enhanced region to that of the entire shell, must be as low as approximately $k$ = 2.5$\\times$10$^{-5}$.\n\n", "2407.17252": "2024-07-24, **Model-agnostic assessment of dark energy after DESI DR1 BAO**, Bikash R. Dinda et.al., [2407.17252v1](http://arxiv.org/abs/2407.17252v1)\n\n Baryon acoustic oscillation measurements by the Dark Energy Spectroscopic Instrument (Data Release 1) have revealed exciting results that show evidence for dynamical dark energy at $\\sim3\\sigma$ when combined with cosmic microwave background and type Ia supernova observations. These measurements are based on the $w\\_0w\\_a$CDM model of dark energy. The evidence is less in other dark energy models such as the $w$CDM model. To avoid imposing a dark energy model, we reconstruct the distance measures and the equation of the state of dark energy independent of any dark energy model and driven only by observational data. To this end, we use both single-task and multi-task Gaussian Process regression. Our results show that the model-agnostic evidence for dynamical dark energy is much less than the evidence from DESI with the $w\\_0w\\_a$CDM model. Our analysis also provides model-independent constraints on cosmological parameters such as the Hubble constant and the matter-energy density parameter at present. We find that the reconstructed values of these parameters are not consistent with the results reported in DESI with the $w\\_0w\\_a$CDM model. However, they are almost consistent with DESI for the $w$CDM model.\n\n", "2407.17154": "2024-07-24, **Forecasting Constraint on the $f(R)$ Theory with the CSST SN Ia and BAO Surveys**, Jun-Hui Yan et.al., [2407.17154v1](http://arxiv.org/abs/2407.17154v1)\n\n The $f(R)$ modified gravity theory can explain the accelerating expansion of the late Universe without introducing dark energy. In this study, we predict the constraint strength on the $f(R)$ theory using the mock data generated from the China Space Station Telescope (CSST) Ultra-Deep Field (UDF) Type Ia supernova (SN Ia) survey and wide-field slitless spectroscopic baryon acoustic oscillation (BAO) survey. We explore three popular $f(R)$ models, and introduce a parameter $b$ to characterize the deviation of the f(R) theory from the $\\Lambda$CDM theory. The Markov Chain Monte Carlo (MCMC) method is employed to constrain the parameters in the $f(R)$ models, and the nuisance parameters and systematical uncertainties are also considered in the model fitting process. Besides, we also perform model comparisons between the $f(R)$ models and the $\\Lambda$CDM model. We find that the constraint accuracy using the CSST SN Ia+BAO dataset alone is comparable to or even better than the result given by the combination of the current relevant observations, and the CSST SN Ia+BAO survey can distinguish the $f(R)$ models from the $\\Lambda$CDM model. This indicates that the CSST SN Ia and BAO surveys can effectively constrain and test the $f(R)$ theory.\n\n", "2407.17143": "2024-07-24, **Astrophysical and cosmological scenarios for gravitational wave heating**, Nigel T. Bishop et.al., [2407.17143v1](http://arxiv.org/abs/2407.17143v1)\n\n Gravitational waves (GWs) passing through a viscous shell of matter are expected to be damped resulting in an increase in the temperature of the fluid as energy is transferred to it from the GWs. In previous work we constructed a model for this process, obtaining an expression for the temperature distribution inside the shell, and it was shown that the temperature increase can be astrophysically significant. In this paper we extend the analysis to GW heating and damping following a binary neutron star merger, GW heating during a core-collapse supernova, and primordial gravitational waves.\n\n"}}