{"neutrino": {"2305.10409": "2023-05-17, **Looking forward to photon-coupled long-lived particles II: dark axion portal**, Krzysztof Jodłowski et.al., [2305.10409v1](http://arxiv.org/abs/2305.10409v1)\n\n The dark axion portal is a dimension-5 coupling between an axion-like particle (ALP), a photon, and a dark photon, which is one of the targets of the intensity frontier searches looking for $\\sim\\,$sub-GeV long-lived particles (LLPs). In this work, we re-examine the limits set by existing detectors such as CHARM and NuCal, and by future experiments such as FASER2, MATHUSLA, and SHiP. We extend previous works by i) considering several mass regimes of the Dark Sector (DS) particles, leading to an extended lifetime regime of the unstable species, ii) including LLPs production occurring in previously neglected vector meson decays that actually dominate the LLP yield, and iii) by implementing secondary LLP production. It takes place by Primakoff-like upscattering of lighter DS species into LLP on tungsten layers of neutrino emulsion detector FASER$\\nu$2. This process will allow FASER2 to cover a significant portion of the $\\gamma c\\tau \\sim 1\\,m$ region of the parameter space that is otherwise difficult to cover due to the large ($\\sim O(100)\\,m$) distance between the primary LLP production point and the decay vessel, where LLP decays take place, which is required in typical beam-dumb experiments for SM background suppression.\n\n", "2305.10305": "2023-05-17, **Effects of Kaluza-Klein Neutrinos on $R_{D}$ and $R_{D^{*}}$**, Janus Capellan Aban et.al., [2305.10305v1](http://arxiv.org/abs/2305.10305v1)\n\n Recent measurements of $R\\_{D}$ and $R\\_{D^{*}}$ by the LHCb collaboration show deviations from their respective Standard Model values. These semileptonic $B$ meson decays, associated with $b\\rightarrow c \\tau \\bar{\\nu}$ transition, are pointing toward new physics beyond the Standard Model via leptonic flavor universality violation. In this paper, we show that such anomaly can be resolved by the cummulative Kaluza-Klein (KK) modes of singlet right-handed neutrino which propagates in the large extra dimensional space. We found that the number of extra dimension should be 2 to explain $R\\_{D}$ and $R\\_{D^{*}}$. We show that both $R\\_{D}$ and $R\\_{D^{*}}$ constraint the energy scale $M\\_{F}$ of this extra dimension which are compatible with the limits from lepton flavor violating tau decays. In contrast, our findings are in tension with the limits coming from the neutrino experiments which set the most stringent lower bound on $M\\_{F}$. The future measurements of $R\\_{D^{(*)}}^{exp}$ with reduced uncertainties will exclude this extra dimensional model with right-handed neutrino propagating in the bulk, if the central values stay.\n\n", "2305.10251": "2023-05-17, **Model of Cosmic Ray Propagation in the Milky Way at the Knee**, G. Giacinti et.al., [2305.10251v1](http://arxiv.org/abs/2305.10251v1)\n\n We present a new model of anisotropic cosmic ray propagation in the Milky Way, where cosmic rays are injected at discrete transient sources in the disc and propagated in the Galactic magnetic field. In the framework of our model, we show that the cosmic ray spectrum is time-dependent and space-dependent around the energy of the knee. It has a major contribution of one or a few nearby recent sources at any given location in the Galaxy, in particular at the position of the Solar system. We find that the distribution of $\\sim$ PeV cosmic rays in our Galaxy is significantly clumpy and inhomogeneous, and therefore substantially different from the smoother distribution of GeV cosmic rays. Our findings have important implications for the calculation and future interpretation of the diffuse Galactic gamma-ray and neutrino fluxes at very high energies.\n\n", "2305.10150": "2023-05-17, **Physics implication from higher weak isospin decomposition**, Phung Van Dong et.al., [2305.10150v1](http://arxiv.org/abs/2305.10150v1)\n\n The $SU(3)\\_L\\otimes U(1)\\_X$ symmetry actually studied is directly broken to the electroweak symmetry $SU(2)\\_L\\otimes U(1)\\_Y$ by a Higgs triplet, predicting a relevant new physics at TeV scale. This work argues, by contrast, that the higher weak isospin $SU(3)\\_L$ might be broken at a high energy scale, much beyond $1$ TeV, by a Higgs octet to an intermediate symmetry $SU(2)\\_L\\otimes U(1)\\_{T\\_8}$ at TeV, before the latter $U(1)\\_{T\\_8}$ recombined with $U(1)\\_X$ defines (i.e., broken to) $U(1)\\_Y$ by a Higgs singlet. The new physics coupled to $SU(3)\\_L$ breaking phase is decoupled, whereas what remains is a novel family-nonuniversal abelian model, $U(1)\\_{T\\_8}\\otimes U(1)\\_X$, significantly overhauling the standard model as well as yielding consistent results for neutrino mass, dark matter, $W$-mass anomaly, and FCNC, differently from the usual 3-3-1 model.\n\n", "2305.10139": "2023-05-17, **Study of collision and $γ$-cascade times following neutron-capture processes in cryogenic detectors**, CRAB collaboration et.al., [2305.10139v1](http://arxiv.org/abs/2305.10139v1)\n\n The emission of $\\gamma$-rays after a neutron capture in a cryogenic detector can generate mono-energetic nuclear recoils in the sub-keV regime, of direct interest for the calibration of Dark Matter and Coherent Elastic Neutrino Nucleus Scattering experiments. Here we show that accurate predictions of the nuclear recoil spectra induced by neutron captures require taking into account the interplay between the development in time of the de-excitation $\\gamma$-cascade of the target nucleus and that of the associated atomic collisions in matter. We present detailed simulations coupling the FIFRELIN code for the description of the $\\gamma$-cascades and the IRADINA code for the modelling of the fast atomic movements in matter. Nuclear recoil spectra are predicted, and made available to the community, for concrete cases of Al$\\_2$O$\\_3$, Si, Ge and CaWO$\\_4$ crystals exposed to a low intensity beam of thermal neutrons. We find that timing effects cause new calibration peaks to emerge in the recoil spectra and also impact the shape of the continuous recoil distribution. We discuss how they could give access to a rich physics program, spanning the accurate study of the response of cryogenic detectors in the sub-keV range, tests of solid state physics simulations and tests of nuclear models.\n\n", "2305.09916": "2023-05-17, **Updated T2K measurements of muon neutrino and antineutrino disappearance using 3.6 $\\times$ 10$^{21}$ protons on target**, M. A. Ramírez et.al., [2305.09916v1](http://arxiv.org/abs/2305.09916v1)\n\n Muon neutrino and antineutrino disappearance probabilities are identical in the standard three-flavor neutrino oscillation framework, but CPT violation and non-standard interactions can violate this symmetry. In this work we report the measurements of $\\sin^{2} \\theta\\_{23}$ and $\\Delta m\\_{32}^2$ independently for neutrinos and antineutrinos. The aforementioned symmetry violation would manifest as an inconsistency in the neutrino and antineutrino oscillation parameters. The analysis discussed here uses a total of 1.97$\\times$10$^{21}$ and 1.63$\\times$10$^{21}$ protons on target taken with a neutrino and antineutrino beam respectively, and benefits from improved flux and cross-section models, new near detector samples and more than double the data reducing the overall uncertainty of the result. No significant deviation is observed, consistent with the standard neutrino oscillation picture.\n\n", "2305.09719": "2023-05-16, **Composite Dark Matter and Neutrino Masses from a Light Hidden Sector**, Aqeel Ahmed et.al., [2305.09719v1](http://arxiv.org/abs/2305.09719v1)\n\n We study a class of models in which the particle that constitutes dark matter arises as a composite state of a strongly coupled hidden sector. The hidden sector interacts with the Standard Model through the neutrino portal, allowing the relic abundance of dark matter to be set by annihilation into final states containing neutrinos. The coupling to the hidden sector also leads to the generation of neutrino masses through the inverse seesaw mechanism, with composite hidden sector states playing the role of the singlet neutrinos. We focus on the scenario in which the hidden sector is conformal in the ultraviolet, and the compositeness scale lies at or below the weak scale. We construct a holographic realization of this framework based on the Randall-Sundrum setup and explore the implications for experiments. We determine the current constraints on this scenario from direct and indirect detection, lepton flavor violation and collider experiments and explore the reach of future searches. We show that in the near future, direct detection experiments and searches for $\\mu \\rightarrow e$ conversion will be able to probe new parameter space. At colliders, dark matter can be produced in association with composite singlet neutrinos via Drell Yan processes or in weak decays of hadrons. We show that current searches at the Large Hadron Collider have only limited sensitivity to this new production channel and we comment on how the reconstruction of the singlet neutrinos can potentially expand the reach.\n\n", "2305.09499": "2023-05-16, **Energy and Angle Dependence of Neutrino Scattering Rates in Proto-Neutron Star and Supernova Matter within Skyrme RPA**, Mingya Duan et.al., [2305.09499v1](http://arxiv.org/abs/2305.09499v1)\n\n Supernova explosions are the most powerful neutrino sources. The neutrino emission is also the dominating cooling mechanism for a proto-neutron star, whose interior is mainly composed of extremely dense and hot nuclear matter. Neutrino transport is an essential part of the simulation of these phenomena, and modern codes are able to implement inelastic neutrino scattering and also to some extent its angle distribution. We therefore study the energy and angle dependence of neutrino scattering rates in proto-neutron star and supernova matter with the full Skyrme RPA response functions. We confirm earlier findings obtained in the Landau approximation that the RPA reduces neutrino scattering, but the detailed differential scattering rates in hot and dense matter depend sensitively on the adopted interaction. The scattering angle distribution is different for different interactions because it depends strongly on the neutron Fermi velocity. We also find that many Skyrme interactions present an unphysical feature that the Fermi velocity of neutrons exceeds the speed of light already at relatively low densities.\n\n", "2305.09383": "2023-05-16, **Observation of collider muon neutrinos with the SND@LHC experiment**, The SND@LHC Collaboration et.al., [2305.09383v1](http://arxiv.org/abs/2305.09383v1)\n\n We report the direct observation of muon neutrino interactions with the SND@LHC detector at the Large Hadron Collider. A data set of proton-proton collisions at $\\sqrt{s} = 13.6\\,$TeV collected by SND@LHC in 2022 is used, corresponding to an integrated luminosity of 36.8$\\,\\rm{fb}^{-1}$. The search is based on information from the active electronic components of the SND@LHC detector, which covers the pseudo-rapidity region of $7.2 < \\eta < 8.4$, inaccessible to the other experiments at the collider. Muon neutrino candidates are identified through their charged-current interaction topology, with a track propagating through the entire length of the muon detector. After selection cuts, 8 $\\nu\\_\\mu$ interaction candidate events remain with an estimated background of 0.076 events, yielding a significance of seven standard deviations for the observed $\\nu\\_\\mu$ signal.\n\n", "2305.09306": "2023-05-16, **A minimal inverse seesaw model with $S_4$ flavour symmetry**, Bikash Thapa et.al., [2305.09306v1](http://arxiv.org/abs/2305.09306v1)\n\n We construct an $S\\_4$ flavour symmetric minimal inverse seesaw model where the standard model is extended by adding two right-handed and two standard model gauge singlets neutrinos to explain the origin of tiny neutrino masses. The resulting model describes the lepton mass spectra and flavour mixing quite well for the case of the normal hierarchy of neutrino masses. The prediction of the model on the Dirac CP-violating phase is centered around $370.087^\\circ$. Furthermore, using the allowed region for the model parameters, we have calculated the value of the effective Majorana neutrino mass, $\\lvert\\langle m\\_{ee}\\rangle\\rvert$, which characterizes neutrinoless double beta decay.\n\n", "2305.09256": "2023-05-16, **Compatibility of CE$ν$NS with muon $g-2$, $W$ mass, and $R(D^{(*)})$ in a gauged ${L_μ-L_τ}$ with a scalar LQ**, Chuan-Hung Chen et.al., [2305.09256v1](http://arxiv.org/abs/2305.09256v1)\n\n Coherent elastic neutrino-nucleon scattering, challenged by the low nucleus recoil energy of a few tens of keV, has been observed by the COHERENT experiment using targets CsI and Ar. We study the contribution of a light $Z'$ mediator in a gauged $U(1)\\_{L\\_\\mu-L\\_\\tau}$ symmetry. In contrast to the mechanism from the kinetic mixing between $U(1)\\_{\\rm em}$ and $U(1)\\_{L\\_\\mu-L\\_\\tau}$, we adopt a dynamical symmetry breaking of the $U(1)\\_{L\\_\\mu-L\\_\\tau}$ by employing an extra Higgs doublet. As a result, the weak charge mediated by $Z'$ only depends on the mass of light gauge boson. Since two Goldstone bosons are required to serve as the longitudinal components of $Z$ and $Z'$, the model does not contain a physical CP-odd scalar. Using the introduced Higgs doublet carrying the $U(1)\\_{\\mu-\\tau}$ charge, new Higgs decay channels $h\\to Z\\_1 Z\\_1/Z\\_1 Z\\_2$ with percent-level branching fractions become accessible. The $W$-mass anomaly observed by CDF II can be resolved by enhancing the oblique parameter $T$. With the flavored gauge symmetry, the Yukawa couplings to fermion flavors are strictly limited. By utilizing the characteristic and introducing a scalar leptoquark $S^{\\frac{1}{3}}=(3,1,2/3)$ that uniquely couples to the $\\tau$ lepton, the excesses of $R(D)$ and $R(D^*)$ can be explained. Moreover, $\\tau \\to \\mu (Z\\_1\\to ) e^- e^+$ via the resonant light gauge boson decay can reach the sensitivity of Belle II at an integrated luminosity of 50 ab$^{-1}$.\n\n"}, "dark matter": {"2305.10428": "2023-05-17, **Field-level Lyman-alpha forest modelling in redshift space via augmented non-local Fluctuating Gunn-Peterson Approximation**, Francesco Sinigaglia et.al., [2305.10428v1](http://arxiv.org/abs/2305.10428v1)\n\n We present an improved analytical model to predict the Lyman-alpha forest at the field level in redshift space from the dark matter field, expanding upon the widely-used Fluctuating Gunn-Peterson approximation (FGPA). In particular, we introduce the dependence on the cosmic web environment (knots, filaments, sheets, voids) in the model, thereby effectively accounting for non-local bias. Furthermore, we include a detailed treatment of velocity bias in the redshift space distortions modelling, allowing the velocity bias to be cosmic-web dependent. We find evidence for a significant difference of the same model parameters in different environments, suggesting that for the investigated setup the simple standard FGPA is not able to adequately predict the Lyman-alpha forest in the different cosmic web regimes. We reproduce the summary statistics of the reference cosmological hydrodynamic simulation we use for comparison, yielding accurate mean transmitted flux, probability distribution function, 3D power spectrum, and bispectrum. In particular, we achieve maximum deviation and average deviations accuracy in the Lyman-alpha forest 3D power spectrum of $\\sim 3\\%$ and $\\sim 0.1\\%$ up to $k\\sim 0.4 \\, h \\, {\\rm Mpc}^{-1}$, $\\sim 5\\%$ and $\\sim 1.8\\%$ up to $k \\sim 1.4 \\, h \\, {\\rm Mpc}^{-1}$. Our new model outperforms previous analytical efforts to predict the Lyman-alpha forest at the field level in all the probed summary statistics, and has the potential to become instrumental in the generation of fast accurate mocks for covariance matrices estimation in the context of current and forthcoming Lyman-alpha forest surveys.\n\n", "2305.10340": "2023-05-17, **Aspherical ULDM Collapse: Variation in the Core-Halo Mass Relation**, Emily Kendall et.al., [2305.10340v1](http://arxiv.org/abs/2305.10340v1)\n\n Ultralight dark matter (ULDM) is an interesting alternative to the cold dark matter (CDM) paradigm. Due to the extremely low mass of the constituent particle ($\\sim 10^{-22}$ eV), ULDM can exhibit quantum effects up to kiloparsec scales. In particular, runaway collapse in the centres of ULDM halos is prevented by quantum pressure, providing a possible resolution to the 'core-cusp problem' of CDM. However, the the detailed relationship between the ULDM core mass and that of the overall halo is poorly understood. We simulate the collapse of both spherical and aspherical isolated ULDM overdensities using AxioNyx, finding that the central cores of collapsed halos undergo sustained oscillatory behaviour which affects both their peak density and overall morphology. The variability in core morphology increases with the asphericity of the initial overdensity and remnants of initial asphericity persist long after collapse. Furthermore, the peak central densities are higher in spherical configurations. Consequently, astrophysically realistic halos may exhibit substantial departures from theoretical core-halo profiles and we would expect a significant variance of the properties of halos with the same mass.\n\n", "2305.10315": "2023-05-17, **WIMP decay as a possible Warm Dark Matter model**, Abineet Parichha et.al., [2305.10315v1](http://arxiv.org/abs/2305.10315v1)\n\n The Weakly Interacting Massive Particles(WIMPs) have long been the favored CDM candidate in the standard $\\Lambda$CDM model. However, owing to great improvement in the experimental sensitivity in the past decade, some parameter space of the SUSY-based WIMP model is ruled out. In addition, WIMP as the CDM particle is also at variance with other astrophysical observables at small scales. We consider a model that addresses both these issues. In the model, the WIMP decays into a massive particle and radiation. We study the background evolution and the first order perturbation theory (coupled Einstein-Boltzmann equations) for this model and show that the dynamics can be captured by a single parameter $r=m\\_L/q$, which is the ratio of the lighter mass and the comoving momentum of the decay particle. We incorporate the relevant equations in the existing Boltzmann code CLASS to compute the matter power spectra and CMB angular power spectra. The decaying WIMP model is akin to a non-thermal Warm Dark Matter(WDM) model and suppresses matter power at small scales, which could alleviate several issues that plague the CDM model. We compare the predictions of the model with CMB, galaxy clustering, and high-z HI data. Both these data sets yield $r\\gtrsim 10^6$, which can be translated into the bounds on other parameters. In particular, we obtain the following lower bounds on the self-annihilation cross-section of WIMPs $\\sigma$, and the lighter mass $m\\_L$: $\\sigma\\gtrsim 5\\times 10^{-44}\\,\\rm cm^2$ and $m\\_L\\gtrsim 2.4\\,\\rm keV$. The lower limit on $m\\_L$ is comparable to constraints on the mass of thermally-produced WDM particle. The limit on the self-annihilation cross-section greatly expands the available parameter space as compared to the stable WIMP scenario.\n\n", "2305.10287": "2023-05-17, **Exploring dark matter models with global fits**, Tomás E. Gonzalo et.al., [2305.10287v1](http://arxiv.org/abs/2305.10287v1)\n\n In this conference paper I present the results from a few global studies of Dark Matter (DM) models, in light of recent constraints from direct detection, indirect detection and collider experiments. I show the most recent analysis of models of singlet Higgs-portal DM, where the DM particle is a scalar, vector, Majorana or Dirac fermion. I also present the results from a global study of an effective field theory of DM, where we find that the model shows a strong preference for a low scale of new physics. For all models I show the prospects for detection or exclusions with future experiments.\n\n", "2305.10242": "2023-05-17, **Bounding the mass of ultralight bosonic Dark Matter particles with the motion of the S2 star around Sgr A***, Riccardo Della Monica et.al., [2305.10242v1](http://arxiv.org/abs/2305.10242v1)\n\n Dark matter is undoubtedly one of the fundamental, albeit unknown, components of the standard cosmological model. The failure to detect WIMPs, the most promising candidate particle for cold dark matter, actually opens the way for the exploration of viable alternatives, of which ultralight bosonic particles with masses $\\sim 10^{-21}$ eV represent one of the most encouraging. N-body simulations have shown that such particles form solitonic cores in the innermost parts of virialized galactic halos that are supported by internal quantum pressure on characteristic $\\sim$kpc de Broglie scales. In the Galaxy, this halo region can be probed by means of S-stars orbiting the supermassive black hole Sagittarius A* to unveil the presence of such a solitonic core and, ultimately, to bound the boson mass $m\\_\\psi$. Employing a Monte Carlo Markov Chain algorithm, we compare the predicted orbital motion of S2 with publicly available data and set an upper bound $m\\_\\psi \\lesssim 3.2\\times 10^{-19}$ eV on the boson mass, at 95% confidence level. When combined with other galactic and cosmological probes, our constraints help to reduce the allowed range of the bosonic mass to $(2.0 \\lesssim m\\_\\psi \\lesssim 32.2)\\times 10^{-20}$ eV, at the 95% confidence level, which opens the way to precision measurements of the mass of the ultralight bosonic dark matter.\n\n", "2305.10175": "2023-05-17, **The Tiered Radio Extragalactic Continuum (T-RECS) simulation II: HI emission and continuum-HI cross-correlation**, Anna Bonaldi et.al., [2305.10175v1](http://arxiv.org/abs/2305.10175v1)\n\n In this paper we extend the Tiered Radio Extragalactic Continuum Simulation (T-RECS) to include HI emission. The HI T-RECS model is based on the most recent HI mass function estimates, combined with prescriptions to convert HI mass to total integrated HI flux. It further models source size, morphology and kinematics, including rotational velocity and HI line width. The continuum T-RECS model is updated to improve the agreement with deeper number counts available at 150\\,MHz. The model for star-forming galaxies (SFGs) is also modified according to the most recent indications of a star formation rate (SFR)--radio luminosity relation, which depends primarily on stellar mass rather than redshift. We further introduce prescriptions to associate an HI mass to the T-RECS radio continuum SFG and Active Galactic Nuclei (AGN) populations. This gives us a way to meaningfully associate counterparts between HI and continuum catalogues, thus building HI $\\times$ continuum simulated observations. Clustering properties of the sources in both HI and continuum are reproduced by associating the galaxies to dark matter haloes of a cosmological simulation. We deliver a set of mock catalogues, as well as the code to produce them, which can be used for simulating observations and predicting results from radio surveys with existing and forthcoming radio facilities, such as the Square Kilometre Array (SKA)\n\n", "2305.09861": "2023-05-17, **An optimized search for dark matter in the galactic halo with HAWC**, A. Albert et.al., [2305.09861v1](http://arxiv.org/abs/2305.09861v1)\n\n The Galactic Halo is a key target for indirect dark matter detection. The High Altitude Water Cherenkov (HAWC) observatory is a high-energy (~300 GeV to >100 TeV) gamma-ray detector located in central Mexico. HAWC operates via the water Cherenkov technique and has both a wide field of view of 2 sr and a >95% duty cycle, making it ideal for analyses of highly extended sources. We made use of these properties of HAWC and a new background-estimation technique optimized for extended sources to probe a large region of the Galactic Halo for dark matter signals. With this approach, we set improved constraints on dark matter annihilation and decay between masses of 10 and 100 TeV. Due to the large spatial extent of the HAWC field of view, these constraints are robust against uncertainties in the Galactic dark matter spatial profile.\n\n", "2305.09827": "2023-05-16, **A non-linear solution to the $S_8$ tension II: Analysis of DES Year 3 cosmic shear**, Calvin Preston et.al., [2305.09827v1](http://arxiv.org/abs/2305.09827v1)\n\n Weak galaxy lensing surveys have consistently reported low values of the $S\\_8$ parameter compared to the $\\textit{Planck}\\ \\Lambda\\rm{CDM}$ cosmology. Amon & Efstathiou (2022) used KiDS-1000 cosmic shear measurements to propose that this tension can be reconciled if the matter fluctuation spectrum is suppressed more strongly on non-linear scales than assumed in state-of-the-art hydrodynamical simulations. In this paper, we investigate cosmic shear data from the Dark Energy Survey (DES) Year 3. The non-linear suppression of the matter power spectrum required to resolve the $S\\_8$ tension between DES and the $\\textit{Planck}\\ \\Lambda\\rm{CDM}$ model is not as strong as inferred using KiDS data, but is still more extreme than predictions from recent numerical simulations. An alternative possibility is that non-standard dark matter contributes to the required suppression. We investigate the redshift and scale dependence of the suppression of the matter power spectrum. If our proposed explanation of the $S\\_8$ tension is correct, the required suppression must extend into the mildly non-linear regime to wavenumbers $k\\sim 0.2 h {\\rm Mpc}^{-1}$. In addition, all measures of $S\\_8$ using linear scales should agree with the $\\textit{Planck}\\ \\Lambda\\rm{CDM}$ cosmology, an expectation that will be testable to high precision in the near future.\n\n", "2305.09822": "2023-05-16, **The flattening of dark matter halo of Centaurus A galaxy (NGC 5128) out to 40 kpc**, Tadeja Veršič et.al., [2305.09822v1](http://arxiv.org/abs/2305.09822v1)\n\n Cosmological simulations predict dark matter shapes that deviate from spherical symmetry. The exact shape depends on the prescription of the simulation and the interplay between dark matter and baryons. This signature is most pronounced in the diffuse galactic haloes that can be observationally probed with planetary nebulae and globular clusters (GCs). The kinematic observations of these halo tracers support intrinsic triaxial shape for the mass generating the gravitational potential. With discrete axisymmetric modelling of GCs as the halo tracers of NGC 5128 we investigate the overall mass distribution of this nearby giant elliptical galaxy. Our modelling approach constrains $c\\_{200}$, $(M/L)\\_{\\star, B}$ and inclination. We derive a preliminary $M\\_{200}\\sim 1 \\times 10^{12}$ M$\\_\\odot$ and flattening $q\\_{\\mathrm{DM}}\\sim 1.3$ indicative of prolate/triaxial halo for NGC 5128.\n\n", "2305.09711": "2023-05-16, **SRF Cavity Searches for Dark Photon Dark Matter: First Scan Results**, Zhenxing Tang et.al., [2305.09711v1](http://arxiv.org/abs/2305.09711v1)\n\n We present the first use of a tunable superconducting radio frequency cavity to perform a scan search for dark photon dark matter with novel data analysis strategies. We mechanically tuned the resonant frequency of a cavity embedded in the liquid helium with a temperature of $2$ K, scanning the dark photon mass over a frequency range of $1.37$ MHz centered at $1.3$ GHz. By exploiting the superconducting radio frequency cavity's considerably high quality factors of approximately $10^{10}$, our results demonstrate the most stringent constraints to date on a substantial portion of the exclusion parameter space, particularly concerning the kinetic mixing coefficient between dark photons and electromagnetic photons $\\epsilon$, yielding a value of $\\epsilon < 2.2 \\times 10^{-16}$.\n\n", "2305.09362": "2023-05-16, **Probing $z \\gtrsim 6$ massive black holes with gravitational waves**, Srija Chakraborty et.al., [2305.09362v1](http://arxiv.org/abs/2305.09362v1)\n\n We investigate the coalescence of massive black hole ($M\\_{\\rm BH}\\gtrsim 10^{6}~\\rm M\\_{\\odot}$) binaries (MBHBs) at $6<z<10$ by adopting a suite of cosmological hydrodynamical simulations of galaxy formation, zoomed-in on biased ($ >3 \\sigma$) overdense regions ($M\\_h\\sim 10^{12}~\\rm M\\_{\\odot}$ dark matter halos at $z = 6$) of the Universe. We first analyse the impact of different resolutions and AGN feedback prescriptions on the merger rate, assuming instantaneous mergers. Then, we compute the halo bias correction factor due to the overdense simulated region. Our simulations predict merger rates that range between 3 - 15 $\\rm yr^{-1}$ at $z\\sim 6$, depending on the run considered, and after correcting for a bias factor of $\\sim 20-30$.   For our fiducial model, we further consider the effect of delay in the MBHB coalescence due to dynamical friction. We find that 83 per cent of MBHBs will merge within the Hubble time, and 21 per cent within 1 Gyr, namely the age of the Universe at $z > 6$. We finally compute the expected properties of the gravitational wave (GW) signals and find the fraction of LISA detectable events with high signal-to-noise ratio (SNR $>$ 5) to range between 66-69 per cent. However, identifying the electro-magnetic counterpart of these events remains challenging due to the poor LISA sky localization that, for the loudest signals ($\\mathcal M\\_c\\sim 10^6~\\rm M\\_{\\odot}$ at $z=6$), is around 10 $\\rm deg^2$.\n\n", "2305.09337": "2023-05-16, **Optimizing the Evolution of Perturbations in the $Λ$CDM Universe**, Nicholas Choustikov et.al., [2305.09337v1](http://arxiv.org/abs/2305.09337v1)\n\n Perturbation theory is a powerful tool for studying large-scale structure formation in the universe and calculating observables such as the power spectrum or bispectrum. However, beyond linear order, typically this is done by assuming a simplification in the time-dependence of gravitational-coupling kernels between the matter and velocity fluctuations. Though the true dependencies are known for Lambda cold dark matter cosmologies, they are ignored due to the computational costs associated with considering them in full and, instead, are replaced by simpler dependencies valid for an Einstein--de-Sitter cosmology. Here we develop, implement and demonstrate the effectiveness of a new numerical method for finding the full dynamical evolution of these kernels to all perturbative orders based upon spectral methods using Chebyshev polynomials. This method is found to be orders of magnitude more efficient than direct numerical solvers while still producing highly accurate and reliable results. A code implementation of the Chebyshev spectral method is then presented and characterised. The code has been made publicly available alongside this paper. We expect our method to be of use for interpretation of upcoming galaxy clustering measurements.\n\n", "2305.09188": "2023-05-16, **Axion-like particle (ALP) portal freeze-in dark matter confronting ALP search experiments**, Dilip Kumar Ghosh et.al., [2305.09188v1](http://arxiv.org/abs/2305.09188v1)\n\n The relic density of Dark Matter (DM) in the freeze-in scenario is highly dependent on the evolution history of the universe and changes significantly in a non-standard (NS) cosmological framework prior to Big Bang Nucleosynthesis (BBN). In this scenario, an additional species dominates the energy budget of the universe at early times (before BBN), resulting in a larger cosmological expansion rate at a given temperature compared to the standard radiation-dominated (RD) universe. To investigate the production of DM in the freeze-in scenario, we consider both standard RD and NS cosmological picture before BBN and perform a comparative analysis. We extend the Standard Model (SM) particle content with a SM singlet DM particle $\\chi $ and an axion-like particle (ALP) $a$. The interactions between ALP, SM particles, and DM are generated by higher dimensional effective operators. This setup allows the production of DM $\\chi$ from SM bath through the mediation of ALP, via ALP-portal processes. These interactions involve non-renormalizable operators, leading to ultraviolet (UV) freeze-in, which depends on the reheating temperature ($T\\_{RH}$) of the early universe. In the NS cosmological scenario, the faster expansion rate suppresses the DM production processes, allowing for enhanced effective couplings between the visible and dark sectors to satisfy the observed DM abundance compared to RD scenario. This improved coupling increases the detection prospects for freeze-in DM via the ALP-portal, which is otherwise challenging to detect in RD universe due to small couplings involved. Using an effective field theory set-up, we show that various ALP searches such as in FASER, DUNE, and SHiP, etc. will be able to probe significant parameter space depending on the different model parameters.\n\n"}, "supernova": {"2305.10144": "2023-05-17, **White dwarf cooling in $f(R,T)$ gravity**, Snehasish Bhattacharjee et.al., [2305.10144v1](http://arxiv.org/abs/2305.10144v1)\n\n In recent times, astounding observations of both over- and under-luminous type Ia supernovae have emerged. These peculiar observations hint not only at surpassing the Chandrasekhar limit but may also suggest potential modifications in the physical attributes of their progenitors, such as their cooling rate. This, in turn, can influence their temporal assessments and provide a compelling explanation for these intriguing observations. In this spirit, we investigate here the cooling process of white dwarfs in $f(R,T)$ gravity with the simplest model $f(R,T) = R + \\lambda T$, where $\\lambda$ is the model parameter. Our modelling suggests that the cooling timescale of white dwarfs exhibits an inverse relationship with the model parameter $\\lambda$, which implies that for identical initial conditions, white dwarfs in $f(R,T)$ gravity cool faster. This further unveils that in the realm of $f(R,T)$ gravity, the energy release rate for white dwarfs increases as $\\lambda$ increases. Furthermore, we also report that the luminosity of the white dwarfs also depends on $\\lambda$ and an upswing in $\\lambda$ leads to an amplification in the luminosity, and consequently a larger white dwarf in general relativity can exhibit comparable luminosity to a smaller white dwarf in $f(R,T)$ gravity.\n\n", "2305.10030": "2023-05-17, **Reducing the uncertainty on the Hubble constant up to 35\\% with an improved statistical analysis: different best-fit likelihoods for Supernovae Ia, Baryon Acoustic Oscillations, Quasars, and Gamma-Ray Bursts**, Maria Giovanna Dainotti et.al., [2305.10030v1](http://arxiv.org/abs/2305.10030v1)\n\n Cosmological models and their parameters are widely debated, especially about whether the current discrepancy between the values of the Hubble constant, $H\\_{0}$, obtained by type Ia supernovae (SNe Ia), and the Planck data from the Cosmic Microwave Background Radiation could be alleviated when alternative cosmological models are considered. Thus, combining high-redshift probes, such as Gamma-Ray Bursts (GRBs) and Quasars (QSOs), together with Baryon Acoustic Oscillations (BAO) and SNe Ia is important to assess the viability of these alternative models and if they can cast further light on the Hubble tension. In this work, for GRBs, we use a 3-dimensional relation between the peak prompt luminosity, the rest-frame time at the end of the X-ray plateau, and its corresponding luminosity in X-rays: the 3D Dainotti fundamental plane relation. Regarding QSOs, we use the Risaliti-Lusso relation among the UV and X-ray luminosities for a sample of 2421 sources. We correct both the QSO and GRB relations by accounting for selection and evolutionary effects with a reliable statistical method. We here use both the traditional Gaussian likelihoods ($\\cal L\\_G$) and the new best-fit likelihoods ($\\cal L\\_N$) to infer cosmological parameters of a non-flat $\\Lambda$CDM and flat $w$CDM models. We obtain for all the parameters reduced uncertainties, up to $35\\%$ for $H\\_{0}$, when applying the new $\\cal L\\_N$ likelihoods in place of the Gaussian ones. Our results remain consistent with a flat $\\Lambda$CDM model, although with a shift of the dark energy parameter $w$ toward $w<-1$ and a curvature density parameter toward $\\Omega\\_k<0$.\n\n", "2305.09721": "2023-05-16, **The signature of galaxy formation models in the power spectrum of the hydrogen 21cm line during reionization**, Joseph S. W. Lewis et.al., [2305.09721v1](http://arxiv.org/abs/2305.09721v1)\n\n Observations of the 21cm line of neutral hydrogen are poised to revolutionize our knowledge of cosmic reionization and the high-redshift population of galaxies. However, harnessing such information requires robust and comprehensive theoretical modeling. We study the non-linear effects of hydrodynamics and astrophysical feedback processes, including stellar and AGN feedback, on the 21cm signal by post-processing three existing cosmological hydrodynamical simulations of galaxy formation: Illustris, IllustrisTNG, and Eagle. Overall and despite their different underlying galaxy-formation models, the three simulations return similar predictions for the global 21cm rightness temperature and its power spectrum. At fixed redshift, most differences are attributable to differences in the history of reionization, in turn driven by differences in the build-up of stellar sources of radiation. However, the impact of astrophysics is imprinted in the 21cm power spectrum through several unique signatures. First, we find significant small scale ($k \\geq 10\\, \\rm {Mpc}^{-1}$) differences between Illustris and IllustrisTNG, where higher velocity winds generated by supernova feedback soften density peaks and lead to lower 21cm power in TNG. Second, we find more 21cm power at intermediate scales ($k \\approx 0.8\\, \\rm {Mpc}^{-1}$) in Eagle, due to differences in ionization driven by highly effective stellar feedback, leading to lower star formation, older and redder stellar populations, and thus lower ionizing luminosities. Though subtle, these features could allow future observations of the 21cm signal, in conjunction with other reionization observables, to constrain theoretical models for galactic feedback at high redshift.\n\n", "2305.09714": "2023-05-16, **An empirical study of dust properties at the earliest epochs**, Joris Witstok et.al., [2305.09714v1](http://arxiv.org/abs/2305.09714v1)\n\n We present an empirical analysis of the properties of dust-continuum emission in a sample of 17 galaxies in the early Universe ($4 < z < 8$) with well-sampled far-infrared (FIR) spectral energy distributions (SEDs) compiled from the literature. We place our results into context by self-consistently comparing to samples of nearby star-forming galaxies, luminous infrared galaxies (LIRGs), and quasars. With the exception of two sources, we find no significant evolution in the dust emissivity index across cosmic time, measuring a consistent value of $\\beta\\_\\text{IR} = 1.8 \\pm 0.3$ at $z > 4$, suggesting the effective dust properties do not change dramatically for most galaxies. Despite having comparable stellar masses, we find the high-redshift galaxies to be similar to, or even more extreme than, LIRGs in the HERUS sample in terms of dust temperature ($T\\_\\text{dust} > 40 \\, \\mathrm{K}$) and IR luminosity ($L\\_\\text{IR} > 10^{11} \\, \\mathrm{L\\_\\odot}$). We find the dust temperature evolves mildly towards high redshift, though the LIRGs and quasars exhibit elevated temperatures indicating a more efficient and/or additional heating mechanism. Where available, we compare stellar-mass estimates to our inferred dust masses, whose degeneracy with dust temperature can only be mitigated with a well-constrained SED. In merely half of the cases the dust yield may be explained by supernovae alone, with four sources ($44\\%$) significantly exceeding a highly optimistic yield where $M\\_\\text{dust} \\approx 0.01 M\\_*$. We discuss possible explanations for this apparent inconsistency and potential observational biases in the measurements of the dust properties of high-redshift galaxies, including in the current IR-bright sample.\n\n", "2305.09417": "2023-05-16, **SN 2016ije: An SN 2002es-like Type Ia Supernova Exploded in a Metal-poor and Low-surface Brightness Galaxy**, Zhitong Li et.al., [2305.09417v2](http://arxiv.org/abs/2305.09417v2)\n\n We have conducted photometric and spectroscopic observations of the peculiar Type Ia supernova (SN Ia) 2016ije that was discovered through the Tsinghua-NAOC Transient Survey. This peculiar object exploded in the outskirts of a metal-poor, low-surface brightness galaxy (i.e., $M\\_{g}$ = $-$14.5 mag). Our photometric analysis reveals that SN 2016ije is subluminous ($M\\_{B,\\rm{max}}$ = $-$17.65$\\pm$0.06 mag) but exhibits relatively broad light curves (${\\Delta}m\\_{15}(B)$ = 1.35$\\pm$0.14 mag), similar to the behavior of SN 2002es. Our analysis of the bolometric light curve indicates that only 0.14$\\pm$0.04 $M\\_{\\odot}$ of $^{56}$Ni was synthesized in the explosion of SN 2016ije, which suggests a less energetic thermonuclear explosion when compared to normal SNe Ia, and this left a considerable amount of unburned materials in the ejecta. Spectroscopically, SN 2016ije resembles other SN 2002es-like SNe Ia, except that the ejecta velocity inferred from its carbon absorption line ($\\sim$ 4500 km s$^{-1}$) is much lower than that from silicon lines ($\\sim$ 8300 km s$^{-1}$) at around the maximum light. Additionally, most of the absorption lines are broader than other 02es-like SNe Ia. These peculiarities suggest the presence of significant unburned carbon in the inner region and a wide line-forming region along the line of sight. These characteristics suggest that SN 2016ije might originate from the violent merger of a white dwarf binary system, when viewed near an orientation along the iron-group-element cavity caused by the companion star.\n\n", "2305.09388": "2023-05-16, **Physics of Binary Star Evolution -- from Stars to X-ray Binaries and Gravitational Wave Sources**, Thomas M. Tauris et.al., [2305.09388v1](http://arxiv.org/abs/2305.09388v1)\n\n The majority of all stars are members of a binary system. The evolution of such binary stars and their subsequent production of pairs of compact objects in tight orbits, such as double neutron stars and double black holes, play a central role in modern astrophysics, Binary evolution leads to the formation of different types of violent cosmic events such as novae, supernova explosions, gamma-ray bursts, mass transfer and accretion processes in X-ray binaries, and the formation of exotic radio millisecond pulsars. In some cases, the binary systems terminate as spectacular collisions between neutron stars and/or black holes. These collisions lead to powerful emission of gravitational waves, as detected by LIGO since 2015. The coming decade is expected to reveal a large number of discoveries of binary compact systems, as well as their progenitors and merger remnants, from major instruments such as the radio Square-Kilometre Array; the gravitational wave observatories LIGO-Virgo-KAGRA-IndIGO and LISA; the astrometric space observatory Gaia; the James Webb Space Telescope; and the X-ray space observatories eXTP, STROBE-X, and Athena. In this light, it is important to have a modern textbook on the physics of binary stars evolution, from ordinary stars to X-ray binaries and gravitational wave sources. The scope of this book is that the reader (student or educated expert) will learn the physics of binary interactions, from stellar birth to compact objects, and relate this knowledge to the latest observations. The reader will learn about stellar structure and evolution, and detailed binary interactions covering a broad range of phenomena, including mass transfer and orbital evolution, formation and accretion onto compact objects (white dwarfs, neutron stars and black holes), and their observational properties. Exercises are provided throughout the book.\n\n"}}