{"neutrino": {"2412.08638": "2024-12-11, **An Improved Precision Calculation of the $0νββ$ Contact Term within Chiral Effective Field Theory**, Graham Van Goffrier et.al., [2412.08638v1](http://arxiv.org/abs/2412.08638v1)\n\n Neutrinoless double-beta ($0\\nu\\beta\\beta$) decay is an as-yet unobserved nuclear process, which stands to provide crucial insights for model-building beyond the Standard Model of particle physics. Its detection would simultaneously confirm the hypothesis that neutrinos are Majorana fermions, thus violating lepton-number conservation, and provide the first measurement of the absolute neutrino mass scale. This work aims to improve the estimation within chiral effective field theory of the so-called ``contact term'' for $0\\nu\\beta\\beta$-decay, a short-range two-nucleon effect which is unaccounted for in traditional nuclear approaches to the process. We conduct a thorough review of the justifications for this contact term and the most precise computation of its size to date $g\\_\\nu^{NN}$ = 1.3(6) at renormalisation point $\\mu=m\\_\\pi$), whose precision is limited by a truncation to elastic intermediate hadronic states. We then perform an extension of this analysis to a subleading class of inelastic intermediate states which we characterise, delivering an updated figure for the contact coefficient ($g\\_\\nu^{NN}$ = 1.4(3) at $\\mu=m\\_\\pi$) with uncertainty reduced by half. Such ab initio nuclear results, especially with enhanced precision, show promise for the resolution of disagreements between estimates of $0\\nu\\nu\\beta\\beta$ from different many-body methods.\n\n", "2412.08537": "2024-12-11, **Phenomenology of Neutrino-Dark Matter Interaction in DSNB and AGN**, Po-Yan Tseng et.al., [2412.08537v1](http://arxiv.org/abs/2412.08537v1)\n\n We introduce a neutrino-scalar dark matter (DM) $\\nu{\\text{-}}\\phi$ interaction and consider Diffuse Supernova Neutrino Background (DSNB) and Active Galactic Nuclei (AGN) representing distinctive neutrino sources. We focus on interaction mediated by a heavy fermionic particle $F$ and investigate the attenuation of neutrino fluxes from these sources. We model the unscattered neutrino flux from DSNB via core-collapse supernova (CCSN) and star-formation rate (SFR), then use the DUNE experiment to set limits on DM-neutrino interaction. For AGNs, NGC 1068 and TXS 0506+056 where the neutrino carries energy above TeV, we select the kinematic region $m^2\\_F \\gg E\\_\\nu m\\_\\phi \\gg m^2\\_\\phi$ such that the $\\nu \\phi$ scattering cross section features an enhancement at high energy. We investigate the constraint on $m\\_\\phi$ and scattering cross section by including DM density spikes at center of AGNs and computing the neutrino flux at IceCube, where the $\\phi\\phi^*$ annihilation cross section is implemented to obtain the saturation density of the spikes.\n\n", "2412.08446": "2024-12-11, **Pulsar Kick: Status and Perspective**, Gaetano Lambiase et.al., [2412.08446v1](http://arxiv.org/abs/2412.08446v1)\n\n The high speeds seen in rapidly rotating pulsars after supernova explosions present a longstanding puzzle in astrophysics. Numerous theories have been suggested over the years to explain this sudden \"kick\" imparted to the neutron star, yet each comes with its own set of challenges and limitations. Key explanations for pulsar kicks include hydrodynamic instabilities in supernovae, anisotropic neutrino emission, asymmetries in the magnetic field, binary system disruption, and physics beyond the Standard Model. Unraveling the origins of pulsar kicks not only enhances our understanding of supernova mechanisms but also opens up possibilities for exploring new physics. In this brief review, we will introduce pulsar kicks, examine the leading hypotheses, and explore future directions for this intriguing phenomenon.\n\n", "2412.08369": "2024-12-11, **Geodesics, accretion disk, gravitational lensing, time delay, and effects on neutrinos induced by a non-commutative black hole**, A. A. Araújo Filho et.al., [2412.08369v1](http://arxiv.org/abs/2412.08369v1)\n\n This paper explores gravitational phenomena associated with a non-commutative black hole. Geodesic equations are derived, and a thin accretion disk is analyzed to model the black hole shadow image, considering an optically thin, radiating, and infalling gas. Retrolensing effects are examined to trace photon emission configurations, while gravitational lensing is investigated through weak and strong deflection limits, with lensing equations and observables applied to Sagittarius A*. The study also includes calculations of time delay, energy deposition rate from neutrino annihilation, phase and probability of neutrino oscillation, and neutrino gravitational lensing.\n\n", "2412.08212": "2024-12-11, **Unveiling the Invisible: ALPs and Sterile Neutrinos at the LHC and HL-LHC**, Kingman Cheung et.al., [2412.08212v1](http://arxiv.org/abs/2412.08212v1)\n\n We investigate the potential of using the signature of mono-Higgs plus large missing energies to constrain on two new physics models, namely the model of an axion-like particle (ALP) and the model of sterile neutrinos. We focus on the Higgs-ALP interactions starting at dimension-six and the Higgs-sterile neutrino interactions starting at dimension-five, via the processes $pp \\to h a a$ for ALP production and $pp \\to h N N$ for sterile neutrinos at the LHC and High Luminosity LHC (HL-LHC), followed by the Higgs decay $h \\to b \\bar{b}$. We establish bounds on the ALP-Higgs coupling $\\frac{C\\_{aH}}{\\Lambda^2}$ and sterile neutrino-Higgs coupling $\\frac{\\lambda\\_3}{M\\_*}$, respectively, for ALP and sterile-neutrino mass ranging from 1 to 60 GeV, using the recent ATLAS data on mono-Higgs plus missing energies at the LHC $(\\sqrt{s} = 13\\;{\\rm TeV}\\; {\\rm and}\\; \\mathcal{L} = 139\\; {\\rm fb}^{-1})$. The most stringent constraint occurs in the missing transverse energy $M\\_{ET}$ range $200 < M\\_{ET} \\leq 350$ GeV. We also estimate the sensitivities that we can achieve at the HL-LHC ($\\sqrt{s} = 14$ TeV and $\\mathcal{L} = 3000$ fb$^{-1}$). We obtain improved sensitivities across various missing energy regions. The ALP model exhibits better sensitivities, particularly at lower mass range, compared to the sterile neutrino model, which shows weaker sensitivities across similar mass and energy ranges. Our results underscore the potential of the mono-Higgs signature as a robust probe for physics beyond the Standard Model.\n\n", "2412.08151": "2024-12-11, **Improving cosmological constraints via galaxy intrinsic alignment in full-shape analysis**, Junsup Shim et.al., [2412.08151v1](http://arxiv.org/abs/2412.08151v1)\n\n The intrinsic alignment (IA) of galaxy shapes probes the underlying gravitational tidal field, thus offering cosmological information complementary to galaxy clustering. In this paper, we perform a Fisher forecast to assess the benefit of IA in improving cosmological parameter constraints, for the first time, leveraging the full-shape (FS) information of IA statistics. Our forecast is based on PFS-like and Euclid-like surveys as examples of deep and wide galaxy surveys, respectively. We explore various cosmological models, with the most comprehensive one simultaneously including dynamical dark energy, curvature, massive neutrinos, and modified gravity (MG). We find that adding FS IA information significantly tightens cosmological constraints relative to the FS clustering-only cases, particularly for dynamical dark energy and nonflat-MG models. For a deep galaxy survey, the Figure-of-Merit for the dark energy equation of state parameters is improved by at least more than $40\\%$ in all dynamical dark energy models investigated. For nonflat-MG models, parameter constraints are tightened by $6-28\\%$, except for the dark matter density and spectral index parameters. For a wide galaxy survey, improvements with IA become milder, although its joint constraints are tighter than those from the deep survey. Our findings highlight the efficacy of the galaxy IA as a complementary cosmological probe to galaxy clustering.\n\n", "2412.08150": "2024-12-11, **Squeezing Full-Shape Dynamical Dark Energy Constraints with Galaxy Alignments**, Junsup Shim et.al., [2412.08150v1](http://arxiv.org/abs/2412.08150v1)\n\n Recent $2-4\\sigma$ deviations from the Cosmological Constant $\\Lambda$ suggest that dark energy (DE) may be dynamical, based on baryon acoustic oscillations and full-shape galaxy clustering (FS GC) analyses. This calls for even tighter DE constraints to narrow down its true nature. In this Letter, we explore how galaxy intrinsic alignments (IA) can enhance the FS GC-based DE constraints, using Fisher forecasts on various extensions of dynamical DE models, including scenarios with curvature, massive neutrinos, and modified gravity. Incorporating IA improves the DE Figure-of-Merit by $42-57\\%$ and tightens the primordial power spectrum amplitude constraints by $17-19\\%$. Our findings highlight IA's potential as a valuable cosmological probe complementary to GC.\n\n", "2412.08136": "2024-12-11, **Isolated Black Holes as Potential PeVatrons and Ultrahigh-energy Gamma-ray Sources**, Shigeo S. Kimura et.al., [2412.08136v1](http://arxiv.org/abs/2412.08136v1)\n\n The origin of PeV cosmic rays is a long-standing mystery, and ultrahigh-energy gamma-ray observations would play a crucial role in identifying it. Recently, LHAASO reported the discovery of ``dark'' gamma-ray sources that were detected above 100 TeV without any GeV--TeV gamma-ray counterparts. The origins of these dark gamma-ray sources are unknown. We propose isolated black holes (IBHs) wandering in molecular clouds as the origins of PeV cosmic rays and LHAASO dark sources. An IBH accretes surrounding dense gas, which forms a magnetically arrested disk (MAD) around the IBH. Magnetic reconnection in the MAD can accelerate cosmic-ray protons up to PeV energies. Cosmic-ray protons of GeV-TeV energies fall to the IBH, whereas cosmic-ray protons at sub-PeV energies can escape from the MAD, providing PeV CRs into the interstellar medium. The sub-PeV cosmic-ray protons interact with the surrounding molecular clouds, producing TeV-PeV gamma rays without emitting GeV-TeV gamma rays. This scenario can explain the dark sources detected by LHAASO. Taking into account the IBH and molecular cloud distributions in our Galaxy, we demonstrate that IBHs can provide a significant contribution to the PeV cosmic rays observed on Earth. Future gamma-ray detectors in the southern sky and neutrino detectors would provide a concrete test to our scenario.\n\n", "2412.08015": "2024-12-11, **On radiative corrections to lepton number violating processes**, Takehiko Asaka et.al., [2412.08015v1](http://arxiv.org/abs/2412.08015v1)\n\n We consider the minimal model of the seesaw mechanism by introducing two right-handed neutrinos, whose masses are comparable to the electroweak scale. This framework is attractive, since it is testable at terrestrial experiments. A critical consequence of this mechanism is the violation of lepton number conservation due to the Majorana masses of both active neutrinos and heavy neutral leptons. In particular, we investigate the impact of the radiative corrections to Majorana masses of left-handed neutrinos on the lepton number violating processes, such as the neutrinoless double beta decay: $(Z, A) \\to (Z+2,A) + 2 e^-$ and the inverse neutrinoless double beta decay: $e^- e^- \\to W^- W^-$. It is shown that the cross section of the inverse neutrinoless double beta decay can increase by ${\\cal O}(10)$~% when the masses of heavy neutral leptons are ${\\cal O}(1)$~TeV, which has significant implications on future experiments.\n\n"}, "dark matter": {"2412.08623": "2024-12-11, **A 1% accurate method to include baryonic effects in galaxy-galaxy lensing models**, Matteo Zennaro et.al., [2412.08623v1](http://arxiv.org/abs/2412.08623v1)\n\n Galaxy clustering and galaxy-galaxy lensing are two of the main observational probes in Stage-IV large-scale structure surveys. Unfortunately, the complicated relationship between galaxies and matter limits the exploitation of this data. Galaxy bias models -- such as the hybrid Lagrangian bias expansion -- allow describing galaxy clustering down to scales as small as $k = 0.7h$/Mpc. However, the galaxy-matter cross-power spectra are already affected by baryons on these scales, directly impacting the modelling of galaxy-galaxy lensing. We propose to extend models of the galaxy-matter cross-power spectrum $P\\_{\\rm gm}(k)$ (currently only accounting for dark matter) by including a baryonic correction inferred from the matter component ($S\\_{\\rm mm}(k)$), so that $P\\_{\\rm gm, full \\, physics} (k) = \\sqrt{S\\_{\\rm mm}} P\\_{\\rm gm, gravity \\, only}$. We use the FLAMINGO simulations to measure the effect of baryons on the galaxy-matter cross-power spectrum and to assess the performance of our model. We perform a Bayesian analysis of synthetic data, implementing a model based on BACCO's hybrid Lagrangian bias expansion (for the nonlinear galaxy bias) and Baryon Correction Model. Ignoring baryons in the galaxy-matter cross-power spectrum leads to a biased inference of the galaxy bias, while ignoring baryons in both the galaxy-matter and matter-matter power spectra leads to a biased inference of both the galaxy bias and cosmological parameters. In contrast, our method is 1% accurate compared to all physics variations in FLAMINGO and on all scales described by hybrid perturbative models ($k < 0.7h$/Mpc). Moreover, our model leads to inferred bias and cosmological parameters compatible within 1$\\sigma$ with their reference values. We anticipate that our method will be a promising candidate for analysing forthcoming Stage-IV survey data.\n\n", "2412.08372": "2024-12-11, **On the construction of fuzzy dark matter halos with arbitrary initial velocities**, Yu-Ming Yang et.al., [2412.08372v1](http://arxiv.org/abs/2412.08372v1)\n\n Cosmological simulations of fuzzy dark matter (FDM) are computationally expensive, and the resulting halos lack flexibility in parameter adjustments, such as virial mass, density profile, and global velocity. Previous studies have introduced a method for constructing FDM halos with predefined density profiles. In this study, we investigate the initial global velocity of these constructed halos and find that it is non-zero. We provide the theoretical formula for this velocity and illustrate that it arises from the interference between states of odd and even parity. Our calculated results closely match simulation outcomes. Additionally, we showcase how to counteract this velocity and create a halo with a customizable initial global velocity. Our study presents a practical method for adjusting the initial global velocity of halos in controlled FDM simulations, facilitating investigations into tidal effects, galaxy collisions, and other scenarios.\n\n"}, "supernova": {"2412.08601": "2024-12-11, **CCSNscore: A multi-input deep learning tool for classification of core-collapse supernovae using SED-Machine spectra**, Yashvi Sharma et.al., [2412.08601v1](http://arxiv.org/abs/2412.08601v1)\n\n Supernovae (SNe) come in various flavors and are classified into different types based on emission and absorption lines in their spectra. SN candidates are now abundant with the advent of large systematic dynamic sky surveys like the Zwicky Transient Facility (ZTF), however, the identification bottleneck lies in their spectroscopic confirmation and classification. Fully robotic telescopes with dedicated spectrographs optimized for SN follow-up have eased the burden of data acquisition. However, the task of classifying the spectra still largely rests with the astronomers. Automating this classification step reduces human effort, and can make the SN type available sooner to the public. For this purpose, we have developed a deep-learning based program for classifying core-collapse supernovae (CCSNe) with ultra-low resolution spectra obtained with the SED-Machine IFU spectrograph on the Palomar 60-inch telescope. The program consists of hierarchical classification task layers, with each layer composed of multiple binary classifiers which are run in parallel to produce a reliable classification. The binary classifiers utilize RNN and CNN architecture and are designed to take multiple inputs, to supplement spectra with g- and r-band photometry from ZTF. On non-host-contaminated and good quality SEDM spectra (\"gold\" test set), CCSNscore is ~94% accurate (correct classifications) in distinguishing between hydrogen-rich (Type II) and hydrogen-poor (Type Ibc) CCSNe. With the help of light curve input, CCSNscore classifies ~83% of the gold set with high confidence (score >= 0.8 and score-error < 0.05), with ~98% accuracy.\n\n", "2412.08449": "2024-12-11, **Calibrating the Tully-Fisher Relation to Measure the Hubble Constant**, Daniel Scolnic et.al., [2412.08449v1](http://arxiv.org/abs/2412.08449v1)\n\n Boubel et al. 2024 (B24) recently used the Tully-Fisher (TF) relation to measure calibrated distances in the Hubble flow and found $H\\_0= 73.3 \\pm 2.1 (stat) \\pm 3.5 (sys)$ km/s/Mpc. The large systematic uncertainty was the result of propagating the conflict between two sources of empirical distance calibration: a difference in zeropoint when calibrating the TF relation with Type Ia supernovae (SNe Ia) versus Cepheids and Tip-of-the-Red-Giant-Branch (TRGB) and an apparent difference in zeropoint between two distinct TRGB datasets. We trace the SN Ia-based calibration used in the TF analysis to a study where $H\\_0$ was fixed to 70 km/s/Mpc rather than measured, (with host distances derived from redshifts and the Hubble law), thus introducing a discrepancy with the other empirically calibrated indicators. In addition, we trace the difference in TRGB zeropoints to a miscalibration of $0.14$ mag that should be $\\sim0.01-0.04$ mag. Using the consistent Cepheid and TRGB calibration from B24 while removing the problematic data reduces the systematic error by a factor of two and results in $H\\_0 = 76.3 \\pm 2.1 \\textrm{(stat)} \\pm 1.5 \\textrm{(sys)}$ km/s/Mpc. This measurement is consistent with previous determinations of $H\\_0$ using the TF relation. We also show that most determinations of $H\\_0$ measurements that replace Type Ia supernovae measurements with another far-field distance indicator yield $H\\_0>73$ km/s/Mpc, reinforcing previous findings that the Hubble tension is not tied to any one distance indicator.\n\n", "2412.08190": "2024-12-11, **Hadronic particle acceleration in the supernova remnant SN 1006 as traced by Fermi-LAT observations**, M. Lemoine-Goumard et.al., [2412.08190v1](http://arxiv.org/abs/2412.08190v1)\n\n The supernova remnant SN 1006 is a source of high-energy particles detected at radio, X-rays, and tera-electronvolt gamma rays. It was also announced as a source of gamma rays by Fermi-LAT but only the north-east (NE) limb was detected at more than $5\\sigma$ significance level. Using 15 years of Fermi-LAT observation and a thorough morphological analysis above 1 GeV, we report the detection of the NE rim at the $6\\sigma$ level and the south-west (SW) rim at the $5.5\\sigma$ level using radio templates from the GLEAM survey. The spectral analysis performed between 100 MeV and 1 TeV allows the detection of a hard spectral index for the NE limb of $1.7 \\pm 0.1 \\pm 0.1$ while the emission detected in the SW is well reproduced with a steeper spectral index of $2.2 \\pm 0.1 \\pm 0.1$. A marginal detection (~$3\\sigma$) of emission coincident with the bright north-west (NW) H$\\alpha$ filament is also described with a similar spectral index of ~2.1. We successfully characterized the non-thermal multi-wavelength emission of the NE and SW limbs with a model in which inverse-Compton emission dominates in the NE while proton-proton interactions becomes significant in the SW due to the enhanced density of the medium.\n\n", "2412.08011": "2024-12-11, **SS433 Microquasar Jet and the TeV Resurgence beam**, D. Fargion et.al., [2412.08011v1](http://arxiv.org/abs/2412.08011v1)\n\n The understanding of microquasars in our galaxy is one of the frontiers of high energy astrophysics. Their models are based on a capturing mass Black Hole, with a nearby spiraling binary companion star. The companion star mass feeds the accretion disk around the Black Hole. This energy also fuels an orthogonal precessing X gamma jets. The spiral precessing tail of such microquasars, as the SS433 system, is due to an ultra-relativistic jet, spraying nucleons and electrons at relativistic speeds. The up-down jet is observable in radio, X, gamma spectra. Its long spirals are spread and diluted within a light-year distance. The source is inside the W50 supernova remnant nebula , whose asymmetry reflects the past and present role of the SS433 jet. Very recently HESS, HAWC discovered, surprisingly at a much far disconnected distance from the SS433, the resurgence of a twin gamma beam tail. Nearly 75 years light distance far away from the same inner jet source. The recent standard model is based on an accelerating shock wave which reaccelerates, the resurgence of a PeV nucleon beam and its TeV secondaries. The surprising recollimation of this TeV beam jet is difficult to be accepted, in the assumption of a planarlike Fermi shock wave model. Here we discuss an alternative framework based on known high energy nuclear physics, capable to simultaneously explaining both the disconnected and the aligned hard TeV jet appearance. Several consequences, that might also be able to validate the model, are considered.\n\n"}}