{"neutrino": {"2310.12915": "2023-10-19, **The standard HVM**, Gauhar Abbas et.al., [2310.12915v1](http://arxiv.org/abs/2310.12915v1)\n\n We discuss the standard hierarchical VEVs model, which predicts the leptonic mixing angles in terms of the Cabibbo angle, and masses of strange and charm quarks as $\\sin \\theta\\_{12}^\\ell \\geq 1 - 2 \\sin \\theta\\_{12}$, $\\sin \\theta\\_{23}^\\ell \\geq 1 - \\sin \\theta\\_{12}$, and $\\sin \\theta\\_{13}^\\ell \\geq \\sin \\theta\\_{12} - \\frac{m\\_s}{m\\_c}$ for the normal mass ordering. This results in very precise predictions of the leptonic mixing angles given by $\\sin \\theta\\_{12}^\\ell = 0.55 \\pm 0.00134 $, $\\sin \\theta\\_{23}^\\ell = 0.775 \\pm 0.00067 $, and $\\sin \\theta\\_{13}^\\ell = 0.1413 - 0.1509 $. Furthermore, we predict neutrinos to be the Dirac kind. The flavour bounds on the model are discussed, and the impact of the standard hierarchical VEVs model on the flavonic dark matter is highlighted by showing its natural emergence.\n\n", "2310.12840": "2023-10-19, **Highlights from the IceCube Neutrino Observatory**, Naoko Kurahashi et.al., [2310.12840v1](http://arxiv.org/abs/2310.12840v1)\n\n As IceCube surpasses a decade of operation in the full detector configuration, results that drive forward the fields of neutrino astronomy, cosmic ray physics, multi-messenger astronomy, particle physics, and beyond continue to emerge at an accelerated pace. IceCube data is dominated by background events, and thus teasing out the signal is the common challenge to most analyses. Statistical accumulation of data, along with better understanding of the background fluxes, the detector, and continued development of our analysis tools have produced many profound results that were presented at ICRC2023. Highlights covered here include the first neutrino observation of the Galactic Plane, the first observation of a steady emission neutrino point source NGC1068, new characterizations of the cosmic ray flux and its secondary particles, and a possible new era in measuring the energy spectrum of the diffuse astrophysical flux. IceCube is poised to make more discoveries and drive fields forward in the near future with many novel analyses coming online.\n\n", "2310.12661": "2023-10-19, **Consistency of Lorentz-invariance violation neutrino scenarios in time delay analyses**, J. M. Carmona et.al., [2310.12661v1](http://arxiv.org/abs/2310.12661v1)\n\n Modifications inspired by quantum gravity in the kinematics of special relativity can manifest in various ways, including anomalies in the time of flight of massless particles and the emergence of decay channels for otherwise stable particles. Typically, these effects are studied independently; however, it may be necessary to combine both to perform a consistent analysis. In this work, we study the interplay between time-of-flight anomalies and neutrino instability in the context of a flavor-independent high-energy Lorentz-invariance violation (LIV) in the neutrino sector. Ensuring compatibility between both types of effects imposes strong constraints on the existence of early neutrinos with energies exceeding a maximum value determined by the scale of new physics. Such constraints depend on the specific LIV scenario and should be integrated into searches for high-energy neutrinos from gamma-ray bursts exhibiting LIV time shifts.\n\n", "2310.12642": "2023-10-19, **Semi-inclusive two-nucleon emission in (anti) neutrino CC scattering within the relativistic mean field framework**, V. L. Martinez-Consentino et.al., [2310.12642v1](http://arxiv.org/abs/2310.12642v1)\n\n This paper delves into the distribution of semi-inclusive events involving the emission of two nucleons in (anti) neutrino charged-current scattering. The analysis is conducted within the framework of relativistic mean field theory applied to nuclear matter. To quantify the likelihood of such semi-inclusive events occurring, we employ a relativistic model of meson-exchange currents that aligns with the 2p2h inclusive cross-section. The outcomes are presented in terms of one-fold and two-fold integrated semi-inclusive cross sections. To highlight disparities among the various emission channels, including proton-proton, neutron-proton, and neutron-neutron, we compare them against a purely phase-space isotropic distribution within the center of mass of the two nucleons. These comparisons reveal significant differences in the event distributions, shedding light on the distinctive characteristics of each channel.\n\n", "2310.12634": "2023-10-19, **Improved treatment of the $T_2$ molecular final-states uncertainties for the KATRIN neutrino-mass measurement**, S. Schneidewind et.al., [2310.12634v1](http://arxiv.org/abs/2310.12634v1)\n\n The KArlsruhe TRItium Neutrino experiment (KATRIN) aims to determine the effective mass of the electron antineutrino via a high-precision measurement of the tritium beta-decay spectrum in its end-point region. The target neutrino-mass sensitivity of 0.2 eV / c^2 at 90% C.L. can only be achieved in the case of high statistics and a good control of the systematic uncertainties. One key systematic effect originates from the calculation of the molecular final states of T\\_2 beta decay. In the first neutrino-mass analyses of KATRIN the contribution of the uncertainty of the molecular final-states distribution (FSD) was estimated via a conservative phenomenological approach to be 0.02 eV^2 / c^4. In this paper a new procedure is presented for estimating the FSD-related uncertainties by considering the details of the final-states calculation, i.e. the uncertainties of constants, parameters, and functions used in the calculation as well as its convergence itself as a function of the basis-set size used in expanding the molecular wave functions. The calculated uncertainties are directly propagated into the experimental observable, the squared neutrino mass m\\_nu^2. With the new procedure the FSD-related uncertainty is constrained to 0.0013 eV^2 / c^4, for the experimental conditions of the first KATRIN measurement campaign.\n\n", "2310.12628": "2023-10-19, **The top quark rare decays with flavor violation**, Ming-Yue Liu et.al., [2310.12628v1](http://arxiv.org/abs/2310.12628v1)\n\n In the present study, we investigate the decays of the top quark $t\\rightarrow c\\gamma$, $t\\rightarrow cg$, $t\\rightarrow cZ$ and $t\\rightarrow ch$. They are extremely rare processes in the Standard Model (SM). As the $U(1)\\_X$ extension of the minimal supersymmetric standard model, the $U(1)\\_X$SSM features new superfields such as the right-handed neutrinos and three Higgs singlet states. We analyze the effects of different sensitivity parameters on the results and make reasonable theorecial predictions useful for future experimental developments. Considering the constraint of the updated experimental data, the numerical results show that the branching ratios of all four processes $t\\rightarrow c\\gamma,~cg,~cZ,~ch$ can reach the same order of magnitude as their experimental upper limits. Among them, $\\tan\\beta$ has the most obvious effect on each process and is the main parameter. $g\\_X$, $g\\_{YX}$, $\\mu$, $M\\_2$, $\\lambda\\_H$, $M\\_{U23}^2$ and $M\\_{Q23}^2$ are important parameters for the processes, and have effects on the numerical results.\n\n", "2310.12591": "2023-10-19, **Electroweak phase transition with radiative symmetry breaking in Type-II seesaw with inert doublet**, Shilpa Jangid et.al., [2310.12591v1](http://arxiv.org/abs/2310.12591v1)\n\n We consider the Type-II seesaw model extended with another Higgs doublet, which is odd under the $Z\\_2$ symmetry. We look for the possibility of triggering the electroweak symmetry breaking via radiative effects. The Higgs mass parameter changes sign from being positive at higher energy scales to negative at lower energy scales in the presence of the TeV scalar triplet. The Planck scale perturbativity is demanded and the electroweak phase transition is studied using two-loop $\\beta$-functions. The maximum allowed values for the interaction quartic coupling of the second doublet field and the triplet field with the Higgs field are $\\lambda\\_3=0.15$ and $\\lambda\\_{\\Phi\\_{1\\Delta}}=0.50$, respectively. Considering these EW values, the first-order phase transition, i.e., $\\phi\\_{+}(T\\_c)/T\\_c\\sim 0.6$ is satisfied only for vanishing doublet and triplet bare mass parameters, $m\\_{\\Phi\\_2}=0.0$ GeV and $m\\_{\\Delta}=0.0$ GeV. The small non-zero induced vacuum expectation value for the scalar triplet also generates the neutrino mass, and the lightest stable neutral particle from the inert doublet satisfies the dark matter constraints for the chosen parameter space. The impact of the thermal corrections on the stability of the electroweak vacuum is also studied, and the current experimental values of the Higgs mass and the top mass lie in the stable region both at the zero temperature and the finite temperature.\n\n", "2310.12392": "2023-10-19, **Long-lived neutral fermions at the DUNE near detector**, Julian Y. Günther et.al., [2310.12392v1](http://arxiv.org/abs/2310.12392v1)\n\n At the Deep Underground Neutrino Experiment (DUNE), a proton beam hits a fixed target leading to large production rates of mesons. These mesons can decay and potentially provide a source of long-lived neutral fermions. Examples of such long-lived fermions are heavy neutral leptons which can mix with the standard-model active neutrinos, and the bino-like lightest neutralino in R-parity-violating supersymmetry. We show that the Standard Model Effective Field Theory extended with right-handed singlet neutrinos can simultaneously describe heavy neutral leptons and bino-like neutralinos in a unified manner. We use the effective-field-theory framework to determine the sensitivity reach of the DUNE near detector in probing various scenarios of long-lived neutral fermions.\n\n", "2310.12310": "2023-10-18, **Overview of the EUSO-SPB2 Target of Opportunity program using the Cherenkov Telescope**, Tobias Heibges et.al., [2310.12310v1](http://arxiv.org/abs/2310.12310v1)\n\n During the Extreme Universe Space Observatory on a Super Pressure Balloon 2 (EUSO-SPB2) mission, we planned Target of Opportunity (ToO) operations to follow up on possible sources of $\\gtrsim 10 \\, {\\rm PeV}$ neutrinos. The original plan before flight was to point the onboard Cherenkov Telescope (CT) to catch the source's path on the sky just below Earth's horizon. By using the Earth as a tau-neutrino to tau-lepton converter, the CT would then be able to look for optical extensive air shower signals induced by tau-lepton decays in the atmosphere. The CT had a field of view of $6.4^\\circ$ vertical $\\times$ $12.8^\\circ$ horizontal. Possible neutrino source candidates include gamma ray bursts, tidal disruption events and other bursting or flaring sources. In addition, follow-ups of binary neutron star mergers would have been possible after the start of the O4 observation run from LIGO-Virgo-KAGRA. The resulting exposure is modeled using the NuSpaceSim framework in ToO mode. With the launch of the EUSO-SPB2 payload on the 13th May 2023, this summarizes the ToO program status and preliminary data, as available.\n\n", "2310.12215": "2023-10-18, **Two-detector flavor sensitivity to ultra-high-energy cosmic neutrinos**, Federico Testagrossa et.al., [2310.12215v1](http://arxiv.org/abs/2310.12215v1)\n\n Ultra-high-energy (UHE) cosmic neutrinos, with energies above 100~PeV, could be finally discovered in the near future. Measuring their flavor composition would reveal information about their production and propagation, but it is unclear if planned UHE neutrino telescopes will have the capabilities to do it. We circumvent this by proposing a new way to measure the UHE neutrino flavor composition that does not rely on individual telescopes having flavor-identification capabilities. We manufacture flavor sensitivity from the joint detection by one telescope sensitive to all flavors -- the radio array of IceCube-Gen2 -- and one mostly sensitive to $\\nu\\_\\tau$ -- GRAND. From this limited flavor sensitivity, predominantly to $\\nu\\_\\tau$, and even under conservative choices of neutrino flux and detector size, we extract important insight. For astrophysics, we forecast meaningful constraints on the neutrino production mechanism; for fundamental physics, vastly improved constraints on Lorentz-invariance violation. These are the first measurement forecasts of the UHE $\\nu\\_\\tau$ content.\n\n", "2310.12124": "2023-10-18, **Time-energy uncertainty relation for neutrino oscillations: historical development, applications and future prospects**, Giuseppe Gaetano Luciano et.al., [2310.12124v1](http://arxiv.org/abs/2310.12124v1)\n\n Time-energy uncertainty relation (TEUR) plays a fundamental role in quantum mechanics, as it allows to grasp peculiar aspects of a variety of phenomena based on very general principles and symmetries of the theory. Using the Mandelstam-Tamm method, TEUR has been recently derived for neutrino oscillations by connecting the uncertainty on neutrino energy with the characteristic time-scale of oscillations. Interestingly enough, the suggestive interpretation of neutrinos as unstable-like particles has proved to naturally emerge in this context. Further aspects have been later discussed in semiclassical gravity by computing corrections to the neutrino energy uncertainty in a generic stationary curved spacetime, and in quantum field theory, where the clock observable turns out to be identified with the non-conserved flavor charge operator. In the present work, we give an overview on the above achievements. In particular, we analyze the implications of TEUR and explore the impact of gravitational and non-relativistic effects on the standard condition for neutrino oscillations. Correlations with the quantum-information theoretic analysis of oscillations and possible experimental consequences are qualitatively discussed.\n\n", "2310.11953": "2023-10-18, **Scotogenic $U(1)_{L_μ-L_τ}$ origin of $(g-2)_μ$, W-mass anomaly and 95 GeV excess**, Debasish Borah et.al., [2310.11953v1](http://arxiv.org/abs/2310.11953v1)\n\n We study a scotogenic extension of the minimal gauged $L\\_{\\mu}-L\\_{\\tau}$ model, including three right-handed singlet fermions and a scalar doublet all odd under an in-built $Z\\_2$ symmetry to explain the anomalous magnetic moments of the muon, CDF-II W-mass anomaly, and the 95 GeV excess reported by the CMS collaboration. While the minimal model can successfully explain the muon $(g-2)$ and CDF-II W-mass anomalies, the required diphoton signal strength for the 95 GeV scalar, together with that of the SM Higgs, can not be obtained in the minimal model. The same can, however, be explained by incorporating two additional scalar doublets whose only role is to contribute radiatively to diphoton decay modes of the light, neutral scalars. Due to the scotogenic extension, the model remains consistent with the observed properties of light neutrinos and dark matter in the Universe.\n\n", "2310.11942": "2023-10-18, **Results and Prospects of T2K**, T. Nosek et.al., [2310.11942v1](http://arxiv.org/abs/2310.11942v1)\n\n T2K is a neutrino oscillation experiment with a 295 km long baseline between the far detector, Super-Kamiokande, and a suite of near detectors to study $\\nu\\_\\mu/\\bar{\\nu}\\_\\mu$ disappearance and $\\nu\\_e/\\bar{\\nu}\\_e$ appearance in a $\\nu\\_\\mu/\\bar{\\nu}\\_\\mu$ neutrino beam produced at J-PARC. The experiment has excluded CP conservation in the three-neutrino oscillation model at $>90~\\%$ CL and precisely constrained the parameters $\\vert \\Delta m\\_{32}^2 \\vert$ and $\\sin^2 \\theta\\_{23}$. This paper reports on the novelties of the most up-to-date 2022 analysis and the near-future prospects of T2K.\n\n", "2310.11826": "2023-10-18, **Novel techniques for alpha/beta pulse shape discrimination in Borexino**, D. Basilico et.al., [2310.11826v1](http://arxiv.org/abs/2310.11826v1)\n\n Borexino could efficiently distinguish between alpha and beta radiation in its liquid scintillator by the characteristic time profile of their scintillation pulse. This alpha/beta discrimination, first demonstrated at the tonne scale in the Counting Test Facility prototype, was used throughout the lifetime of the experiment between 2007 and 2021. With this method, alpha events are identified and subtracted from the beta-like solar neutrino events. This is particularly important in liquid scintillator as alpha scintillation is quenched many-fold. In Borexino, the prominent Po-210 decay peak was a background in the energy range of electrons scattered from Be-7 solar neutrinos. Optimal alpha-beta discrimination was achieved with a \"multi-layer perceptron neural network\", which its higher ability to leverage the timing information of the scintillation photons detected by the photomultiplier tubes. An event-by-event, high efficiency, stable, and uniform pulse shape discrimination was essential in characterising the spatial distribution of background in the detector. This benefited most Borexino measurements, including solar neutrinos in the \\pp chain and the first direct observation of the CNO cycle in the Sun. This paper presents the key milestones in alpha/beta discrimination in Borexino as a term of comparison for current and future large liquid scintillator detectors\n\n", "2310.11821": "2023-10-18, **Evidence of Hadronic Emission from the brightest-of-all-time GRB 221009A**, Kai Wang et.al., [2310.11821v1](http://arxiv.org/abs/2310.11821v1)\n\n Acceleration of hadrons in relativistic shocks has been long expected and invoked to model GRB high-energy photon and neutrino emissions. However, so far there has been no direct observational evidence of hadronic emission from GRBs. The B.O.A.T. (\"brightest of all time\") gamma-ray burst (GRB) 221009A had extreme energies (with an isotropic energy exceeding $10^{55}$ erg) and was detected in broad-band including the very-high-energy (VHE, $>100\\,\\rm GeV$) band up to $>10$ TeV. Here we perform a comprehensive spectral analysis of the GRB from keV to TeV energy range and perform detailed spectral and light curve modelings considering both the traditional synchrotron self-Compton process and the electromagnetic (EM) cascade process initiated by hadronic interactions by accelerated cosmic rays in the external shock. We find that the leptonic scenario alone is not adequate to account for the observations, whereas the proposed scenario with the combination of hadronic and leptonic components can well reproduce the multi-wavelength spectra and the light curve. This result reveals the existence of the accelerated hadronic component in the early afterglow of this extreme burst. According to this scenario, the observed TeV light curve should contain imprints of the prompt MeV emission.\n\n", "2310.11813": "2023-10-18, **Determine the Origin of Very-high-energy Gamma Rays from Galactic Sources by the Prospect of Observing Neutrinos**, Bo-Heng Song et.al., [2310.11813v1](http://arxiv.org/abs/2310.11813v1)\n\n Recently, the Large High Altitude Air Shower Observatory (LHAASO) identified 12 $\\gamma$-ray sources emitting above 100 TeV gamma rays, making them potential PeV cosmic-ray accelerators (PeVatrons). Neutrino observations are crucial in determining whether the gamma-ray radiation process is due to hadronic or leptonic origin. In this paper, we study three detected sources, LHAASO J1908+0621, LHAASO J2018+3651, and LHAASO J2032+4102, which are also the most promising galactic high-energy neutrino candidate sources with the lowest pre-trial p-value based on the stacking searches testing for excess neutrino emission by IceCube Neutrino Observatory. We study the lepto-hadronic scenario for the observed multiband spectra of these LHAASO sources considering the possible counterpart source of the LHAASO sources. The very-high-energy gamma rays are entirely attributed to the hadronic contribution, therefore the most optimistic neutrino flux can be derived. Then, we evaluate the statistical significance (p-value) as the observational time of the IceCube and next-generation IceCube-Gen2 neutrino observatory respectively. We find that the origin of gamma rays totally from the hadronic process or at most partially from the hadronic process can be determined by IceCube-Gen2 for LHAASO J1908+0621 at a $5\\sigma$ significance level with a running time of $\\sim 10$ months. For LHAASO J2018+3651 and LHAASO J2032+4102, the required running time is $\\sim 10$ years ($3\\sigma$) and $\\sim 4$ years ($5\\sigma$), respectively. The future confirmation by the next-generation neutrino telescope will be crucial to understanding the particle acceleration and the radiation processes inside the sources.\n\n"}, "dark matter": {"2310.12501": "2023-10-19, **Inelastic Scattering of Dark Matter with Heavy Cosmic Rays**, Keyu Lu et.al., [2310.12501v1](http://arxiv.org/abs/2310.12501v1)\n\n We investigate the impact of inelastic collisions between dark matter (DM) and heavy cosmic ray (CR) nuclei on CR propagation. We approximate the fragmentation cross-sections for DM-CR collisions using collider-measured proton-nuclei scattering cross-sections, allowing us to assess how these collisions affect the spectra of CR Boron and Carbon. We derive new CR spectra from DM-CR collisions by incorporating these DM-CR cross-sections into the source terms and solving the diffusion equation for the complete network of reactions involved in generating secondary species. Utilizing the latest data from AMS-02 and DAMPE on the Boron-to-Carbon ratio, we estimate a 95\\% upper limit for the effective inelastic cross-section of DM-proton as a function of DM mass. Our findings reveal that at $m\\_\\chi \\simeq 2 \\,\\rm{MeV}$, the effective inelastic cross-section between DM and protons must be less than $\\mathcal{O}(10^{-32})~{\\rm cm}^2$.\n\n", "2310.12496": "2023-10-19, **A novel nuclear recoil calibration for liquid noble gas detectors**, Fengbo Gu et.al., [2310.12496v1](http://arxiv.org/abs/2310.12496v1)\n\n A lot of Dark Matter (DM) models predict single-scattering Nuclear Recoil (NR) events as potential signals. Characterization of a detector's NR response is crucial for underground DM direct detection projects. The traditional calibrating methods characterize a detector with $\\sim$ keV - MeV neutrons emitted from an accelerator, a neutron generator, or a radioactive source. These methods could be improved in several aspects: (a) the neutrons's energy could be more mono-energetic, (b) the to-be-calibrated NR energy should line up with the ROI (Research Of Interest) of the experiment, (c) the calibrating beam's flux should be appropriate. Accordingly, in the paper, we introduce a novel calibration method in which the beam of the target material (instead of neutrons) will be implemented to impinge the detector. For instance, calibrating a liquid helium detector with a helium beam. Since the helium beam can (i) be tuned precisely to have $\\sim < $1\\% energy jitter (so as the recoil energy's uncertainty), (ii) have an energy interval from $\\sim$ 100 eV to tens of keV (depending on the configuration), and (iii) have a tunable flux down to 10$^{10}$/s. Since these unique advantages can also be applied to other noble gases; therefore, we believe the method can be implemented to calibrate other liquid noble gas detectors' NR response.\n\n", "2310.12420": "2023-10-19, **Revisit a realistic intersecting D6-brane with modified soft SUSY terms**, Imtiaz Khan et.al., [2310.12420v1](http://arxiv.org/abs/2310.12420v1)\n\n Because there are a few typos in the supersymmetry breaking sfermion masses and trilinear soft term, regarding the current Large Hadron Collider (LHC) and dark matter searches, we revisit a three-family Pati-Salam model based on intersecting D6-branes in Type IIA string theory on a $\\mathbf{T^6/(\\Z\\_2\\times \\Z\\_2)}$ orientifold with a realistic phenomenology. We study the viable parameter space and discuss the spectrum consistent with the current LHC Supersymmetry searches along with the dark matter relic density bounds from the Planck 2018 data. For the gluinos and first two generations of sfermions, we observe that the gluino mass is in the range [2, 14] TeV, the squarks mass range is [2, 13] TeV and the sleptons mass is in the range [1, 5] TeV. We achieve the cold dark matter relic density consistent with 5$\\sigma$ Planck 2018 bounds via A-funnel and coannihilation channels such as stop-neutralino, stau-neutralino, and chargino-neutralino. Except for a few chargino-neutralino coannihilation solutions, these solutions also satisfy current nucleon-neutralino spin-independent and spin-dependent scattering cross-sections and may be probed by future dark matter searches.\n\n", "2310.12245": "2023-10-18, **The three hundred project: thermodynamical properties, shocks and gas dynamics in simulated galaxy cluster filaments and their surroundings**, Agustín M. Rost et.al., [2310.12245v1](http://arxiv.org/abs/2310.12245v1)\n\n Using cosmological simulations of galaxy cluster regions from The Three Hundred project we study the nature of gas in filaments feeding massive clusters. By stacking the diffuse material of filaments throughout the cluster sample, we measure average gas properties such as density, temperature, pressure, entropy and Mach number and construct one-dimensional profiles for a sample of larger, radially-oriented filaments to determine their characteristic features as cosmological objects. Despite the similarity in velocity space between the gas and dark matter accretion patterns onto filaments and their central clusters, we confirm some differences, especially concerning the more ordered radial velocity dispersion of dark matter around the cluster and the larger accretion velocity of gas relative to dark matter in filaments. We also study the distribution of shocked gas around filaments and galaxy clusters, showing that the surrounding shocks allow an efficient internal transport of material, suggesting a laminar infall. The stacked temperature profile of filaments is typically colder towards the spine, in line with the cosmological rarefaction of matter. Therefore, filaments are able to isolate their inner regions, maintaining lower gas temperatures and entropy. Finally, we study the evolution of the gas density-temperature phase diagram of our stacked filament, showing that filamentary gas does not behave fully adiabatically through time but it is subject to shocks during its evolution, establishing a characteristic z = 0, entropy-enhanced distribution at intermediate distances from the spine of about 1 - 2 $h^{-1}$ Mpc for a typical galaxy cluster in our sample.\n\n", "2310.12231": "2023-10-18, **An almost dark galaxy with the mass of the Small Magellanic Cloud**, Mireia Montes et.al., [2310.12231v1](http://arxiv.org/abs/2310.12231v1)\n\n Almost Dark Galaxies are objects that have eluded detection by traditional surveys such as the Sloan Digital Sky Survey (SDSS). The low surface brightness of these galaxies ($\\mu\\_r$(0)$>26$ mag/arcsec^2), and hence their low surface stellar mass density (a few solar masses per pc^2 or less), suggests that the energy density released by baryonic feedback mechanisms is inefficient in modifying the distribution of the dark matter halos they inhabit. For this reason, almost dark galaxies are particularly promising for probing the microphysical nature of dark matter. In this paper, we present the serendipitous discovery of Nube, an almost dark galaxy with $<\\mu\\_V>$e~ 26.7 mag/arcsec^2. The galaxy was identified using deep optical imaging from the IAC Stripe82 Legacy Project. Follow-up observations with the 100m Green Bank Telescope strongly suggest that the galaxy is at a distance of 107 Mpc. Ultra-deep multi-band observations with the 10.4m Gran Telescopio Canarias favour an age of ~10 Gyr and a metallicity of [Fe/H]$\\sim-1.1$. With a stellar mass of ~4x10^8 Msun and a half-mass radius of Re=6.9 kpc (corresponding to an effective surface density of ~0.9 Msun/pc^2), Nube is the most massive and extended object of its kind discovered so far. The galaxy is ten times fainter and has an effective radius three times larger than typical ultra-diffuse galaxies with similar stellar masses. Galaxies with comparable effective surface brightness within the Local Group have very low mass (~10^5 Msun) and compact structures (effective radius Re<1 kpc). Current cosmological simulations within the cold dark matter scenario, including baryonic feedback, do not reproduce the structural properties of Nube. However, its highly extended and flattened structure is consistent with a scenario where the dark matter particles are ultra-light axions with a mass of m$\\_B$=($0.8^{+0.4}\\_{-0.2}$)$\\times10^{-23}$ eV.}\n\n", "2310.12229": "2023-10-18, **Search for dark matter particles in W$^+$W$^-$ events with transverse momentum imbalance in proton-proton collisions at $\\sqrt{s}$ = 13 TeV**, CMS Collaboration et.al., [2310.12229v1](http://arxiv.org/abs/2310.12229v1)\n\n A search for dark matter particles is performed using events with a pair of W bosons and large missing transverse momentum. Candidate events are selected by requiring one or two leptons ($\\ell =$ electrons or muons). The analysis is based on proton-proton collision data collected at a center-of-mass energy of 13 TeV by the CMS experiment at the LHC and corresponding to an integrated luminosity of 138 fb$^{-1}$. No significant excess over the expected standard model background is observed in the $\\ell\\nu$qq and 2$\\ell$2$\\nu$ final states of the W$^+$W$^-$ boson pair. Limits are set on dark matter production in the context of a simplified dark Higgs model, with a dark Higgs boson mass above the W$^+$W$^-$ mass threshold. The dark matter phase space is probed in the mass range 100-300 GeV, extending the scope of previous searches. Current exclusion limits are improved in the range of dark Higgs masses from 160 to 250 GeV, for a dark matter mass of 200 GeV.\n\n", "2310.12224": "2023-10-18, **AMICO galaxy clusters in KiDS-DR3: Cosmological constraints from angular power spectrum and correlation function**, M. Romanello et.al., [2310.12224v1](http://arxiv.org/abs/2310.12224v1)\n\n We study the tomographic clustering properties of the photometric cluster catalogue derived from the Third Data Release of the Kilo Degree Survey, focusing on the angular correlation function and its spherical harmonic counterpart, the angular power spectrum. We measure the angular correlation function and power spectrum from a sample of 5162 clusters, with an intrinsic richness $\\lambda^*\\geq 15$, in the photometric redshift range $z\\in [0.1, 0.6]$, comparing our measurements with theoretical models, in the framework of the $\\Lambda$-Cold Dark Matter cosmology. We perform a Monte Carlo Markov Chain analysis to constrain the cosmological parameters $\\Omega\\_{\\mathrm{m}}$, $\\sigma\\_8$ and the structure growth parameter $S\\_8\\equiv\\sigma\\_8 \\sqrt{\\Omega\\_{\\mathrm{m}}/0.3}$. We adopt Gaussian priors on the parameters of the mass-richness relation, based on the posterior distributions derived from a previous joint analysis of cluster counts and weak lensing mass measurements carried out with the same catalogue. From the angular correlation function, we obtain $\\Omega\\_{\\mathrm{m}}=0.32^{+0.05}\\_{-0.04}$, $\\sigma\\_8=0.77^{+0.13}\\_{-0.09}$ and $S\\_8=0.80^{+0.08}\\_{-0.06}$, in agreement, within $1\\sigma$, with 3D clustering result based on the same cluster sample and with existing complementary studies on other datasets. For the angular power spectrum, we derive statistically consistent results, in particular $\\Omega\\_{\\mathrm{m}}=0.24^{+0.05}\\_{-0.04}$ and $S\\_8=0.93^{+0.11}\\_{-0.12}$, while the constraint on $\\sigma\\_8$ alone is weaker with respect to the one provided by the angular correlation function, $\\sigma\\_8=1.01^{+0.25}\\_{-0.17}$. Our results show that the 2D clustering from photometric cluster surveys can provide competitive cosmological constraints with respect to the full 3D clustering statistics, and can be successfully applied to ongoing and forthcoming spectro/photometric surveys.\n\n", "2310.12217": "2023-10-18, **Galaxy formation with Wave/Fuzzy Dark Matter: The core-halo structure**, Alvaro Pozo et.al., [2310.12217v1](http://arxiv.org/abs/2310.12217v1)\n\n Dark matter-dominated cores have long been claimed for the well-studied local group dwarf galaxies. More recently, extended stellar halos have been uncovered around several of these dwarfs through deeper imaging and spectroscopy. Such core-halo structures are not a feature of conventional cold dark matter (CDM), based on collisionless particles where smooth, scale-free profiles are predicted. In contrast, smooth and prominent dark matter cores are predicted for Warm and Fuzzy/Wave Dark Matter (WDM/$\\psi$DM) respectively. The question arises to what extent the visible stellar profiles should reflect this dark matter core structure. Here we compare cosmological hydrodynamical simulations of CDM, WDM $\\&$ $\\psi$DM, aiming to predict the stellar profiles for these three DM scenarios. We show that cores surrounded by extended halos are distinguishable for WDM and $\\psi$DM, with the most prominent cores in the case of $\\psi$DM, where the stellar density is enhanced in the core due to the presence of the relatively dense soliton. Our analysis demonstrates that such behavior does not appear in CDM, implying that the small-scale cut-off in the power spectrum present for WDM and $\\psi$DM provides a core-halo transition. Consequently, we estimate the mass of the $\\psi$DM particle at this core-halo transition point. Furthermore, we observe the anticipated asymmetry for $\\psi$DM due to the soliton's random walk, a distinctive characteristic not found in the symmetric distributions of stars in Warm and CDM models.\n\n", "2310.12114": "2023-10-18, **Dissipationless collapse and the dynamical mass-ellipticity relation of elliptical galaxies in Newtonian gravity and MOND**, Pierfrancesco Di Cintio et.al., [2310.12114v1](http://arxiv.org/abs/2310.12114v1)\n\n Context. Deur (2014) and Winters et al. (2023) proposed an empirical relation between the dark to total mass ratio and ellipticity in elliptical galaxies from their observed total dynamical mass-to-light ratio data M/L = (14.1 +/- 5.4){\\epsilon}. In other words, the larger is the content of dark matter in the galaxy, the more the stellar component would be flattened. Such observational claim, if true, appears to be in stark contrast with the common intuition of the formation of galaxies inside dark halos with reasonably spherical symmetry. Aims. Comparing the processes of dissipationless galaxy formation in different theories of gravity, and emergence of the galaxy scaling relations therein is an important frame where, in principle one could discriminate them. Methods. By means of collisionless N-body simulations in modified Newtonian dynamics (MOND) and Newtonian gravity with and without active dark matter halos, with both spherical and clumpy initial structure, I study the trends of intrinsic and projected ellipticities, S\\'ersic index and anisotropy with the total dynamical to stellar mass ratio. Results. It is shown that, the end products of both cold spherical collapses and mergers of smaller clumps depart more and more from the spherical symmetry for increasing values of the total dynamical mass to stellar mass, at least in a range of halo masses. The equivalent Newtonian systems of the end products of MOND collapses show a similar behaviour. The M/L relation obtained from the numerical experiments in both gravities is however rather different from that reported by Deur and coauthors.\n\n", "2310.11955": "2023-10-18, **Exploring the Potential of Residual Impurities in Germanium Detectors for Low-Mass Dark Matter Detection**, Dongming Mei et.al., [2310.11955v1](http://arxiv.org/abs/2310.11955v1)\n\n The pursuit of low-mass dark matter detection hinges on achieving an unprecedentedly low energy detection threshold. Germanium (Ge) detectors, when meticulously tailored with precise impurity compositions, hold the promise of expanding their sensitivity to energy levels below the sub-electronvolt (sub-eV) range. In this study, we embark on an exploration of residual impurities inherent to Ge detectors, focusing on their behavior at helium temperatures. These impurity atoms undergo a captivating freeze-out phenomenon, transitioning into localized states known as excited dipole states. Through compelling evidence derived from the measurement of relative capacitance, we elucidate the transition of impurity atoms from free charge states to these localized dipole states, as the temperature plummets from 11 K to 6.5 K. Our investigation encompasses the intricate formation of these dipole states in both n-type and p-type impurities. Furthermore, we shed light on the electric field generated by these dipole states, unveiling their capacity to ensnare charges and foster the creation of cluster dipole states. Drawing from prior measurements, we affirm that these excited dipole states exhibit a binding energy of less than 10 meV, thus forging a path toward an exceptionally low detection threshold for low-mass dark matter. Capitalizing on this concept, we propose the development of a 1-kg Ge detector equipped with internal charge amplification, an innovative approach poised to surpass electrical noise and, in turn, empower the detection of low-mass dark matter with unprecedented sensitivity.\n\n"}, "supernova": {"2310.12463": "2023-10-19, **Piecewise frequency model for searches for long-transient gravitational waves from young neutron stars**, Benjamin Grace et.al., [2310.12463v1](http://arxiv.org/abs/2310.12463v1)\n\n Previous searches for a gravitational-wave signal from a possible neutron star remnant of the binary neutron star merger event GW170817 have focused on short ($<500$ s) and long duration (2.5 hr -- 8 day) signals. To date, no such post-merger signal has been detected. We introduce a new piecewise model which has the flexibility to accurately follow gravitational-wave signals which are rapidly evolving in frequency, such as those which may be emitted from young neutron stars born from binary neutron star mergers or supernovae. We investigate the sensitivity and computational cost of this piecewise model when used in a fully coherent 1800-second $\\mathcal{F}$-statistic search on simulated data containing possible signals from the GW170817 remnant. The sensitivity of the search using the piecewise model is determined using simulated data, with noise consistent with the LIGO second observing run. Across a 100--2000 Hz frequency band, the model achieves a peak sensitivity of $h\\_{\\text{rss}}^{50\\%} = 4.4 \\times 10^{-23} \\text{Hz}^{-1/2}$ at 200 Hz, competitive with other methods. The computational cost of conducting the search, over a bank of $1.1 \\times 10^{12}$ templates, is estimated at 10 days running on 100 CPU's.\n\n", "2310.12200": "2023-10-18, **LATIS: The Stellar Mass-Metallicity Relation of Star-forming Galaxies at $z\\sim 2.5$**, Nima Chartab et.al., [2310.12200v1](http://arxiv.org/abs/2310.12200v1)\n\n We present the stellar mass - stellar metallicity relation for 3491 star-forming galaxies at $2 \\lesssim z \\lesssim 3$ using rest-frame far-ultraviolet (FUV) spectra from the Ly$\\alpha$ Tomography IMACS Survey (LATIS). We fit stellar population synthesis models from the Binary Population And Spectral Synthesis code (BPASS v$2.2.1$) to medium resolution (R $\\sim 1000$) and high signal-to-noise ($>30$ per 100 km/s over a wavelength range of 1221 - 1800 \\r{A}) composite spectra of galaxies in bins of stellar mass to determine their stellar metallicity, primarily tracing $\\rm Fe/H$. We find a strong correlation between stellar mass and stellar metallicity, with stellar metallicity monotonically increasing with stellar mass at low masses and flattening at high masses ($M\\_* \\gtrsim 10^{10.3} M\\_\\odot$). Additionally, we compare our stellar metallicity measurements with the gas-phase oxygen abundance of galaxies at similar redshift and estimate the average $\\rm [\\alpha/Fe] \\sim 0.6$. Such high $\\alpha$-enhancement indicates that high-redshift galaxies have not yet undergone significant iron enrichment through Type Ia supernovae. Moreover, we utilize an analytic chemical evolution model to constrain the mass loading parameter of galactic winds as a function of stellar mass. We find that as the stellar mass increases, the mass loading parameter decreases. The parameter then flattens or reaches a turning point at around $M\\_* \\sim 10^{10.5} M\\_\\odot$. Our findings may signal the onset of black hole-driven outflows at $z \\sim 2.5$ for galaxies with $M\\_* \\gtrsim 10^{10.5} M\\_\\odot$.\n\n", "2310.12202": "2023-10-18, **A Population of Short-duration Gamma-ray Bursts with Dwarf Host Galaxies**, Anya E. Nugent et.al., [2310.12202v1](http://arxiv.org/abs/2310.12202v1)\n\n We present a population of 11 of the faintest ($> 25.5$ AB mag) short gamma-ray burst (GRB) host galaxies. We model their sparse available observations using the stellar population inference code Prospector-$\\beta$ and develop a novel implementation to incorporate the galaxy mass-radius relation. Assuming these hosts are randomly drawn from the galaxy population and conditioning this draw on their observed flux and size in few photometric bands, we determine that these hosts have dwarf galaxy stellar masses of $7.0\\lesssim\\log(M\\_*/M\\_\\odot)\\lesssim9.1$. This is striking as only $14\\%$ of short GRB hosts with previous inferred stellar masses had $M\\_* \\lesssim 10^{9}\\,M\\_{\\odot}$. We further show these short GRBs have smaller physical and host-normalized offsets than the rest of the population, suggesting that the majority of their neutron star (NS) merger progenitors were retained within their hosts. The presumably shallow potentials of these hosts translate to small escape velocities of $\\sim5.5-80$ km/s, indicative of either low post-supernova systemic velocities or short inspiral times. While short GRBs with identified dwarf host galaxies now comprise $\\approx 14\\%$ of the total Swift-detected population, a number are likely missing in the current population, as larger systemic velocities (observed from Galactic NS population) would result in highly offset short GRBs and less secure host associations. However, the revelation of a population of short GRBs retained in low-mass host galaxies offers a natural explanation for observed $r$-process enrichment via NS mergers in Local Group dwarf galaxies, and has implications for gravitational wave follow-up strategies.\n\n", "2310.12090": "2023-10-18, **Chemical Analysis of the Brightest Star of the Cetus II Ultra-Faint Dwarf Galaxy Candidate**, K. B. Webber et.al., [2310.12090v1](http://arxiv.org/abs/2310.12090v1)\n\n We present a detailed chemical abundance analysis of the brightest star in the ultra-faint dwarf (UFD) galaxy candidate Cetus II from high-resolution Magellan/MIKE spectra. For this star, DES J011740.53-173053, abundances or upper limits of 18 elements from Carbon to Europium are derived. Its chemical abundances generally follow those of other UFD galaxy stars, with a slight enhancement of the alpha-elements (Mg, Si, and Ca) and low neutron-capture element (Sr, Ba, Eu) abundances supporting the classification of Cetus II as a likely UFD. The star exhibits lower Sc, Ti, and V abundances than Milky Way (MW) halo stars with similar metallicity. This signature is consistent with yields from a supernova (SN) originating from a star with a mass of ~11.2 solar masses. In addition, the star has a Potassium abundance of [K/Fe] = 0.81 which is somewhat higher than the K abundances of MW halo stars with similar metallicity, a signature which is also present in a number of UFD galaxies. A comparison including globular clusters (GC) and stellar stream stars suggests that high K is a specific characteristic for some UFD galaxy stars and can thus be used to help classify objects as UFD galaxies.\n\n", "2310.11977": "2023-10-18, **A measurement of the dark energy equation of state with 40 strong lenses**, Natalie B. Hogg et.al., [2310.11977v1](http://arxiv.org/abs/2310.11977v1)\n\n Problems with the cosmological constant model of dark energy motivate the investigation of alternative scenarios. I make the first measurement of the dark energy equation of state using the hierarchical strong lensing time delay likelihood provided by TDCOSMO. I find that the combination of seven TDCOSMO lenses and 33 SLACS lenses is only able to provide an upper bound on the dark energy equation of state, $w < -1.75$, which nevertheless implies the presence of a phantom dark energy component. When the strong lensing time delay data is combined with a collection of cosmic microwave background, baryon acoustic oscillation and Type Ia supernova data, I find that the equation of state remains consistent with a cosmological constant.\n\n", "2310.11912": "2023-10-18, **The JWST Galactic Center Survey -- A White Paper**, Rainer Schoedel et.al., [2310.11912v1](http://arxiv.org/abs/2310.11912v1)\n\n The inner hundred parsecs of the Milky Way hosts the nearest supermassive black hole, largest reservoir of dense gas, greatest stellar density, hundreds of massive main and post main sequence stars, and the highest volume density of supernovae in the Galaxy. As the nearest environment in which it is possible to simultaneously observe many of the extreme processes shaping the Universe, it is one of the most well-studied regions in astrophysics. Due to its proximity, we can study the center of our Galaxy on scales down to a few hundred AU, a hundred times better than in similar Local Group galaxies and thousands of times better than in the nearest active galaxies. The Galactic Center (GC) is therefore of outstanding astrophysical interest. However, in spite of intense observational work over the past decades, there are still fundamental things unknown about the GC. JWST has the unique capability to provide us with the necessary, game-changing data. In this White Paper, we advocate for a JWST NIRCam survey that aims at solving central questions, that we have identified as a community: i) the 3D structure and kinematics of gas and stars; ii) ancient star formation and its relation with the overall history of the Milky Way, as well as recent star formation and its implications for the overall energetics of our galaxy's nucleus; and iii) the (non-)universality of star formation and the stellar initial mass function. We advocate for a large-area, multi-epoch, multi-wavelength NIRCam survey of the inner 100\\,pc of the Galaxy in the form of a Treasury GO JWST Large Program that is open to the community. We describe how this survey will derive the physical and kinematic properties of ~10,000,000 stars, how this will solve the key unknowns and provide a valuable resource for the community with long-lasting legacy value.\n\n"}}