{"neutrino": {"2508.15747": "2025-08-21, **Robustness of Solutions of the Quantum Kinetic Equations in the Presence of Matter Density Fluctuations**, Shashank Shalgar et.al., [2508.15747v1](http://arxiv.org/abs/2508.15747v1)\n\n We investigate the role of fluctuations in the matter density on neutrino flavor evolution by studying their effects on the collision terms in the spherically symmetric quantum kinetics equations (QKEs). We solve the QKEs with varying radial resolution ($r\\_{\\mathrm{bins}} = 150 \\, , 1500 \\, , 15000$) to assess numerical convergence in angular distributions, number densities, and energy spectra for four neutrino flavors ($\\nu\\_e$, $\\bar{\\nu}\\_e$, $\\nu\\_x$, $\\bar{\\nu}\\_x$). Our results demonstrate that the solutions are numerically converged already at the coarsest resolution, with higher resolutions yielding almost identical outcomes. We introduce random perturbations to each radial bin, thus adding perturbations with a length scale that is related to the radial resolution. We study both time-independent and time-dependent perturbations to the matter density that affect the collision term and analyze their effects on neutrino flavor evolution. We find that such fluctuations do not induce any significant instabilities or qualitative changes in flavor evolution. Angular structure remains robust, and flavor-dependent number densities and energy spectra show only minor deviations compared to the unperturbed case. These findings suggest that matter perturbations have a negligible effect on neutrino flavor evolution in spherically symmetric settings.\n\n", "2508.15662": "2025-08-21, **New rephasing invariants and CP violation built from the trios of the CKM or PMNS matrix elements**, Shu Luo et.al., [2508.15662v1](http://arxiv.org/abs/2508.15662v1)\n\n Given the $3\\times 3$ Cabibbo-Kobayashi-Maskawa (CKM) quark flavor mixing matrix $V$, we define a new set of rephasing invariants in terms of the \"trios\" of its nine elements: $\\lozenge^{ijk}\\_{\\alpha\\beta\\gamma} \\equiv (V^{}\\_{\\alpha i} V^{}\\_{\\beta j} V^{}\\_{\\gamma k})/\\det V$ with $\\alpha \\neq \\beta \\neq \\gamma$ and $i \\neq j \\neq k$ running respectively over $(u, c, t)$ and $(d, s, b)$. We find that ${\\rm Im} \\lozenge^{ijk}\\_{\\alpha\\beta\\gamma} = - {\\cal J}$ holds, where ${\\cal J}$ is the well-known Jarlskog invariant of weak CP violation. Analogous rephasing invariants $\\blacklozenge^{ijk}\\_{\\alpha\\beta\\gamma} \\equiv (U^{}\\_{\\alpha I} U^{}\\_{\\beta j} U^{}\\_{\\gamma k})/\\det U$ can be defined for the $3\\times 3$ Pontecorvo-Maki-Nakagawa-Sakata (PMNS) lepton flavor mixing matrix $U$, where $\\alpha \\neq \\beta \\neq \\gamma$ and $i \\neq j \\neq k$ run respectively over $(e, \\mu, \\tau)$ and $(1, 2, 3)$. Taking into account small non-unitarity of $U$ based on the canonical seesaw mechanism for neutrino mass generation, we calculate ${\\rm Im} \\blacklozenge^{ijk}\\_{\\alpha\\beta\\gamma}$ with the help of a full Euler-like block parametrization of the seesaw flavor structure and demonstrate that their leading terms converge to a universal invariant ${\\cal J}^{}\\_\\nu$ in the unitarity limit of $U$.\n\n", "2508.15609": "2025-08-21, **Sub-GeV Sterile Neutrino as a Probe of Neutrino Mass Generation in the Minimal Left-Right Symmetric Model**, Gang Li et.al., [2508.15609v1](http://arxiv.org/abs/2508.15609v1)\n\n The minimal left-right symmetric model (mLRSM) provides an elegant and testable framework for addressing the origin of neutrino masses. We examine the constraints on the sub-GeV sterile neutrino in the type-II seesaw scenario of the mLRSM without left-right mixing, taking limits from collider searches, meson decays, supernovae, neutrinoless double beta ($0\\nu\\beta\\beta$) decay and cosmology. Specifically, we derive the $0\\nu\\beta\\beta$ decay constraints using the advanced effective field theory approach and up-to-date nuclear matrix element calculations. Besides, we update the SN1987A cooling bound with the state-of-the-art simulations, provide new constraints from the energy deposition in the supernova ejecta, and incorporate the stringent sterile neutrino lifetime upper limit $\\tau\\lesssim 0.023$ s from the big bang nucleosynthesis. Our results identify the parameter region compatible with all current experimental and observational constraints, where the sterile neutrino mass lies between 700 MeV and 1 GeV and the right-handed $W$ boson mass is slightly below 20 TeV. This region is exclusively probed by the future tonne-scale $0\\nu\\beta\\beta$ decay experiments, providing a unique window to test the mLRSM and the possible origin of neutrino masses.\n\n", "2508.15332": "2025-08-21, **On the Lagrangian and fermion mass of the unified $SU(2) \\otimes SU(4)$ gauge field theory**, Eckart Marsch et.al., [2508.15332v1](http://arxiv.org/abs/2508.15332v1)\n\n {In the Standard Model of elementary particles the fermions are assumed to be intrinsically massless. Here we propose a new theoretical idea of fermion mass generation (other than by the Higgs mechanism) through the coupling with the vector gauge fields of the unified $SU(2) \\otimes SU(4)$ gauge symmetry, especially with the $Z$ boson of the weak interaction that affects all elementary fermions. The resulting small masses are suggested to be proportional to the self-energy of the $Z$ field as described by a Yukawa potential. Thereby the electrically neutral neutrino just gets a tiny mass through its $Z$-field coupling. In contrast, the electrically charged electron and quarks can become more massive by the inertia induced through the Coulomb energy of the electrostatic fields surrounding them in their rest frames.\n\n", "2508.15289": "2025-08-21, **Cosmology with an emergent Standard Model**, Steven D. Bass et.al., [2508.15289v1](http://arxiv.org/abs/2508.15289v1)\n\n We discuss new ideas that the Standard Model might be emergent with connection to electroweak vacuum stability and related consequences for cosmology. In this scenario, the gauge symmetries and particles of the Standard Model would be ``born'' in some phase transition at a large scale about $10^{16}$ GeV with the Standard Model parameters constrained by the requirement of vacuum stability.Emergent gauge symmetries are well known in condensed matter physics. Perhaps the Standard Model might also be emergent. In this case the particles would be the stable long range excitations of degrees of freedom that operate above the scale of emergence. The dark energy scale comes out with similar size to the tiny masses of light Majorana neutrinos. The emergence scenario comes with interesting constraints on possible dark matter structure. New physics at energy scales around $10^{16}$ GeV might be explored through its effects in the neutrino mass matrix plus using high frequency gravitational waves and polarisation observables in the cosmic microwave background.\n\n", "2508.15161": "2025-08-21, **Verification of Cas A neutron star cooling rate using Chandra HRC-S observations**, Jiaqi Zhao et.al., [2508.15161v1](http://arxiv.org/abs/2508.15161v1)\n\n The young neutron star (NS) in the Cassiopeia A (Cas A) supernova remnant is a fascinating test for theories of NS cooling. Chandra observations have indicated that its surface temperature is declining rapidly, about 2% per decade, using 20 years of data, if a uniform carbon atmosphere is assumed for the NS. This rapid decline may be caused by the neutrons in the NS core transitioning from a normal to a superfluid state. However, most of the Cas A NS observations were performed by the Chandra ACIS detectors, which suffer complicated systematic effects. Here, we test the cooling of the Cas A NS with Chandra HRC data over 25 years. The Chandra HRC detector has independent systematics, serving as a cross-check. Assuming a fixed hydrogen column density ($N\\_{\\rm H}$), we infer the cooling rate of the Cas A NS to be 0.57$^{+0.26}\\_{-0.27}$% per decade. Allowing the $N\\_{\\rm H}$ to vary with time (as estimated using ACIS data), the cooling rate is 1.11$^{+0.25}\\_{-0.28}$% per decade. These cooling rates are smaller than measured using ACIS data, implying systematic uncertainties have not been eradicated from either or both datasets. However, we have verified the decline in the absorbed flux from the Cas A NS using an independent instrument, at $>3\\sigma$ level (4.7%$\\pm$1.5% over 10 years). Additionally, the weaker cooling rate of Cas A NS inferred from HRC datasets eliminates the tension with the theoretically predicted cooling, and can be explained by the reduced efficiency of the neutrino emission accompanying the Cooper pair breaking and formation process in neutron triplet-state superfluid.\n\n", "2508.14988": "2025-08-20, **Search for a Higgs boson produced in association with a charm quark and decaying to a W boson pair in proton-proton collisions at $\\sqrt{s}$ = 13 TeV**, CMS Collaboration et.al., [2508.14988v1](http://arxiv.org/abs/2508.14988v1)\n\n This paper presents a search for a Higgs boson produced in association with a charm quark (cH) which allows to probe the Higgs-charm Yukawa coupling strength modifier $\\kappa\\_\\mathrm{c}$. Higgs boson decays to a pair of W bosons are considered, where one W boson decays to an electron and a neutrino, and the other \\PW boson decays to a muon and a neutrino. The data, corresponding to an integrated luminosity of 138 fb$^{-1}$, were collected between 2016 and 2018 with the CMS detector at the LHC at a center-of-mass energy of $\\sqrt{s}$ = 13 TeV. Upper limits at the 95\\% confidence level (CL) are set on the ratio of the measured yield to the standard model expectation for cH production. The observed (expected) upper limit is 1065 (506). When combined with the previous search for cH in the diphoton decay channel of the Higgs boson, the limits are interpreted as observed (expected) constraints at 95% CL on the value of $\\kappa\\_\\mathrm{c}$, $\\lvert\\kappa\\_\\mathrm{c}\\rvert$ $\\lt$ 47 (51).\n\n", "2508.14969": "2025-08-20, **One Phase to Rule Them All: Spontaneous CP Violation and Leptogenesis in SO(10)**, K. S. Babu et.al., [2508.14969v1](http://arxiv.org/abs/2508.14969v1)\n\n We present a renormalizable $SO(10)$ grand unified theory with a minimal Yukawa sector consisting of a $126\\_H$, a real $10\\_H$ and a real $120\\_H$, where $CP$ violation has a spontaneous origin. We show that the Yukawa sector in this setup, which consists of only 19 real parameters, is capable of simultaneously reproducing the observed fermion masses and mixings, including neutrino oscillations, as well as the baryon asymmetry of the Universe via thermal leptogenesis. In this framework, $CP$ is spontaneously broken when a $CP$-odd Higgs field $54\\_H$, used for GUT symmetry breaking, acquires a non-zero vacuum expectation value. All $CP$-violating phases, including the Dirac phases $\\delta\\_\\mathrm{CKM}$ and $\\delta\\_\\mathrm{PMNS}$, the neutrino Majorana phases, as well as those responsible for leptogenesis, arise solely from a single complex parameter in the Higgs potential. The proposed minimal setup predicts a normal ordering of neutrino masses, with the atmospheric mixing angle $\\theta\\_{23}$ preferred in the first octant and the leptonic $\\delta\\_{\\mathrm{PMNS}}$ lying in the range $(-38^\\circ,\\, +31^\\circ)$. The fermion fits in our scenario further yield a strongly hierarchical mass spectrum for the three right-handed neutrinos, $(M\\_1,\\,M\\_2,\\,M\\_3) \\sim \\left(10^{5},\\, 10^{12},\\, 5\\cdot 10^{14}\\right)~\\mathrm{GeV}$, which is shown to result in successful $N\\_2$-dominated leptogenesis, consistent with current cosmological data.\n\n", "2508.14743": "2025-08-20, **A water Cherenkov detector prototype for future high-energy tau-neutrino experiment**, Monong Yu et.al., [2508.14743v1](http://arxiv.org/abs/2508.14743v1)\n\n The detection of high-energy tau neutrinos remains a critical challenge in neutrino astronomy, limited by inadequate angular resolution and sensitivity in current detectors like IceCube and KM3NeT. We present a modular water Cherenkov detector prototype optimized for tau-neutrino-induced extensive air showers (EAS) in the 1-100 PeV range, leveraging canyon terrain for natural cosmic-ray shielding. Laboratory validation demonstrates this prototype design has high detection efficiency (>99%) and timing resolution (<2 ns) on MIP particles, enabling precise tau-neutrino-induced EAS reconstruction for future study. The results establish a foundation of a low-cost, scalable neutrino observatory, advancing flavor ratio measurements and cosmic-ray origin problems.\n\n", "2508.14726": "2025-08-20, **Scrutinizing Fermionic Dark Matter in Scotogenic Model with Low Reheating Temperature**, Abhishek Roy et.al., [2508.14726v1](http://arxiv.org/abs/2508.14726v1)\n\n The scotogenic model provides a minimal and elegant framework that simultaneously explains neutrino masses and accommodates a viable dark matter (DM) candidate. In this work, we investigate the phenomenology of fermionic DM in the scotogenic model, with a particular emphasis on the effects of a non-standard cosmological history characterized by a low reheating temperature. We demonstrate that entropy injection from inflaton decay can significantly dilute the DM abundance, thereby relaxing the annihilation cross section required to reproduce the observed relic density and opening new regions of viable parameter space. We further analyze the complementarity between current and future direct detection experiments and charged lepton flavour violation (cLFV) searches in probing this scenario. Our results show that next-generation direct detection experiments such as DARWIN and XLZD, together with upcoming cLFV searches (in particular the future sensitivity of $\\mu \\rightarrow 3e$ experiments), will be capable of testing substantial regions of the parameter space, including those associated with low reheating temperatures.\n\n", "2508.14510": "2025-08-20, **Anisotropic Neutrino Emission from Spinning, Moving, and Charged Primordial Black Holes**, Arnab Chaudhuri et.al., [2508.14510v1](http://arxiv.org/abs/2508.14510v1)\n\n The angular and spectral features of neutrinos emitted from primordial black holes (PBHs) carry key imprints of the black hole's fundamental properties. This work investigates the directional emission of neutrinos from Kerr-Newman PBHs undergoing Hawking evaporation, accounting for the combined effects of spin, motion, and electric charge. Rotation induces anisotropic fluxes through axisymmetric geometry and spin-dependent greybody factors, while relativistic motion leads to pronounced Doppler beaming along the direction of travel. Electric charge modifies the thermodynamic evolution and suppresses the emission of like-charged particles, altering the overall spectrum and burst duration. The resulting neutrino flux exhibits rich angular structure, energy dependence, and time profiles that vary with PBH parameters. These directional signatures enhance the prospects for detection at current and future neutrino observatories, and offer new multi-messenger probes of PBH populations in the early universe.\n\n", "2508.14331": "2025-08-20, **Once-in-a-lifetime encounter models for neutrino media II: Quasi-steady states and miscidynamic flavor evolution**, Anson Kost et.al., [2508.14331v1](http://arxiv.org/abs/2508.14331v1)\n\n We extended the once-in-a-lifetime encounter (OILE) model to stochastic interactions among neutrinos. As in the original OILE model, the new model reproduces the mean-field behavior of a dense neutrino gas for time $t\\lesssim (\\mu\\gamma)^{-1}$, where $\\mu$ measures the strength of the mean-field neutrino self-interaction potential and is proportional to the neutrino density, and the dimensionless \"impact parameter\" $\\gamma$ is a measure of the change in the flavor quantum state of a neutrino during interaction with another neutrino when the wave packets of the two neutrinos overlap. As in the mean-field case, the OILE model with random neutrino velocities experiences kinetic flavor decoherence as the flavor quantum states of the neutrinos diverge from each other. Unlike the mean-field case, however, the OILE model has a \"collision term\" due to the quantum entanglement among neutrinos. For $\\gamma\\ll1$, this incoherent effect can drive the neutrinos into a quasi-steady state that is similar to the collective precession mode in a homogeneous and isotropic neutrino gas in the mean-field approximation. Subsequently, the collision term drives the neutrino gas adiabatically through different quasi-steady states and eventually to flavor equilibration. This process is an example of miscidynamic flavor evolution, with the mixing equilibria being the quasi-steady precession states.\n\n"}, "dark matter": {"2508.15490": "2025-08-21, **Measurement of circumgalactic extinction in the Kilo-Degree Survey's Data Release 4**, Eray Genc et.al., [2508.15490v1](http://arxiv.org/abs/2508.15490v1)\n\n Galaxies reside in extended dark matter halos, but their baryonic content, especially dust, remains less well understood. We aim to investigate the amount and distribution of dust in galactic halos by measuring shifts in the observed magnitudes of background galaxies. Dust absorbs and scatters shorter-wavelength light, reddening background sources. We quantify this effect using multi-band magnitude shifts in the Kilo-Degree Survey (KiDS) Data Release 4, distinguishing it from achromatic magnification. Our pipeline is validated using MICE2 mock catalogues, and we explore potential systematics arising from galaxy selection, in contrast to previous quasar-based studies. Simulations show that input halo and dust masses can be recovered independently and jointly using galaxy-galaxy lensing (GGL) and magnitude shifts. A minimum redshift separation of $\\Delta z\\_{\\mathrm B}\\sim0.3$ and brightness cuts are required to minimise overlap effects and the effects of photometric noise, respectively. Applying our pipeline to KiDS data, we first confirm the achromaticity of magnitude shifts in five near-infrared filters ($ZYJHK\\_{\\rm s}$). In optical bands ($ugri$), joint analysis constrains halo mass and dust mass to $0.2$ dex and $0.3$ dex, respectively, yielding $M\\_{\\rm dust}=7.24^{+0.52}\\_{-0.64} \\times 10^7\\,M\\_\\odot$ and $\\log(M\\_{\\rm halo}^{\\rm DM}/M\\_\\odot)=12.33^{+0.08}\\_{-0.04}$. These results agree with previous studies and represent the first successful measurement of magnitude shifts and halo extinction with KiDS, confirming that galaxies reside in extended baryonic halos enriched by gas and dust from feedback processes.\n\n", "2508.14973": "2025-08-20, **Classical constant electric fields and the Schwinger effect in de Sitter**, Mar Bastero-Gil et.al., [2508.14973v1](http://arxiv.org/abs/2508.14973v1)\n\n We study constant classical electric fields and the Schwinger effect in de Sitter space, with potential implications for magnetogenesis and inflationary dark matter production. Treating the photon as a dynamical field, we show that sustaining a constant electric field in de Sitter requires a tachyonic photon mass of order the Hubble scale. This observation has physical implications, as it alters the infrared behaviour of the induced Schwinger current. Using an on-shell renormalization condition consistent with a tachyonic photon, we recompute the current for charged fermions and scalars, finding it to be finite and positive even in the massless limit of the charge carriers-contrary to earlier results predicting a puzzling negative IR divergence. For scalars, we include a non-minimal coupling to the Ricci curvature, enabling us to analyze the conformal limit, where the current closely matches that of charged fermions.\n\n", "2508.14792": "2025-08-20, **Solar wind bremsstrahlung in our Solar System at 21cm, 3mm, and 12microns Wavelengths**, Gilles Couture et.al., [2508.14792v1](http://arxiv.org/abs/2508.14792v1)\n\n Using Monte Carlo techniques, we calculate the bremsstrahlung spectrum that protons and electrons in the solar wind would produce when encountering dark matter (DM) particles within the solar system. We consider two types of interactions for the DM: one where a spin-1/2 neutral DM particle interacts with matter through the exchange of a lighter neutral scalar DM particle and one where a scalar neutral DM particle interacts directly with the matter particle. We consider three wavelengths: 21 cm, 3 mm, and 12 microns. In order to estimate the significance of the signal, we compare our results to experimental results from ARCADE2 and PLANCK, and consider the sensitivities of three telescopes: VLA, ALMA and KECK. We find that in order to produce an observable signal in the first scenario, the neutral fermion must have a mass comparable to the solar wind particle while the exchanged particle must have a mass typically $few\\times 10^5$ smaller. The scalar direct interaction however appears beyond reach for any reasonable coupling.\n\n", "2508.14655": "2025-08-20, **Identifying Monochromatic Signals in LISA and Taiji via Spectral Split: Gravitational Waves versus Ultralight Dark Matter**, Yue-Hui Yao et.al., [2508.14655v1](http://arxiv.org/abs/2508.14655v1)\n\n The detection of gravitational waves (GWs) has opened a new window to explore the dark Universe. Ultralight dark matter (ULDM), an attractive candidate for dark matter, might induce monochromatic signals in gravitational-wave (GW) laser interferometers. However it is not clear how such signals are disentangled from the GWs emitted by galactic compact binaries. Here we initiate the investigation on the spectral split of monochromatic signals caused by detector's heliocentric motion in space and show the annual modulation can induce distinct structures in the spectral harmonics for GWs and ULDM, which would enable to clearly identify the nature of the signal. We show the physical parameters can be inferred with high precision using the Fisher matrix formalism. Our results provide a practical algorithm for probing ULDM and broaden the scientific objectives of future GW detectors in space, such as LISA and Taiji.\n\n", "2508.14626": "2025-08-20, **Origins and lifetimes of secular and tidal bars in simulated disc galaxies**, Matthew Frosst et.al., [2508.14626v1](http://arxiv.org/abs/2508.14626v1)\n\n We investigate the formation of stellar bars in 307 Milky Way-mass disc galaxies in the TNG50 cosmological simulation. Most bars form rapidly in dynamically cold discs shortly after the central stellar mass exceeds that of dark matter. In these cases, bar formation is consistent with secular instabilities driven by the disc's self-gravity, which organises stellar orbits into a coherent bar structure. However, around 25 per cent of barred galaxies are dark matter dominated at the time of bar formation, $t\\_{bar}$, and remain so thereafter. We trace the origin of these bars to tidal perturbations induced by passing satellites or mergers using a new metric, $S\\_{bar}$, quantifying the tidal field acting on the galaxy. At the time of bar formation, we find a negative correlation between $S\\_{bar}$ and the central stellar-to-dark matter mass fraction, indicating that more dark matter-dominated discs require stronger tides to trigger bar formation. These tidally induced bars are more likely to be transient than those that form secularly, although bar properties are otherwise similar. However, the host galaxies differ: secular bars arise in relatively compact discs, while tidal bars appear in extended discs whose properties resemble those of unbarred galaxies. Tidal perturbations can therefore induce bars in galaxies otherwise stable to secular formation, highlighting the dual role of the internal galactic structure and the external environment in bar formation.\n\n", "2508.14624": "2025-08-20, **The revolution in strong lensing discoveries from Euclid**, Natalie E. P. Lines et.al., [2508.14624v1](http://arxiv.org/abs/2508.14624v1)\n\n Strong gravitational lensing offers a powerful and direct probe of dark matter, galaxy evolution and cosmology, yet strong lenses are rare: only 1 in roughly 10,000 massive galaxies can lens a background source into multiple images. The European Space Agency's Euclid telescope, with its unique combination of high-resolution imaging and wide-area sky coverage, is set to transform this field. In its first quick data release, covering just 0.45% of the full survey area, around 500 high-quality strong lens candidates have been identified using a synergy of machine learning, citizen science and expert visual inspection. This dataset includes exotic systems such as compound lenses and edge-on disk lenses, demonstrating Euclid's capacity to probe the lens parameter space. The machine learning models developed to discover strong lenses in Euclid data are able to find lenses with high purity rates, confirming that the mission's forecast of discovering over 100,000 strong lenses is achievable during its 6-year mission. This will increase the number of known strong lenses by two orders of magnitude, transforming the science that can be done with strong lensing.\n\n", "2508.14535": "2025-08-20, **Axion Star Bosenova in Axion Miniclusters**, Zihang Wang et.al., [2508.14535v1](http://arxiv.org/abs/2508.14535v1)\n\n Axionic dark matter can form structures known as miniclusters that host an axion star at their center. The axion star feeds on the host, and the axion star mass may grow beyond its stability limit, leading to a potential bosenova. Since a dilute axion star has a stable mass limit only when self-interaction is considered, we include axion self-interaction effects in this paper, and specify the condition for bosenova in the QCD axion and temperature-independent axion-like particle parameter spaces. We find that self-interaction may dominate the mass growth of the axion star. For a minicluster with a large initial overdensity, bosenova occurs in a large fraction of axion parameter space. For the QCD axion, bosenova occurs within the age of the Universe for miniclusters with an initial overdensity $\\delta\\gtrsim 100$.\n\n"}, "supernova": {"2508.15079": "2025-08-20, **Trans-Fe elements from Type Ia Supernovae. I. Heavy element nucleosynthesis during the formation of near-Chandrasekhar white dwarfs**, Umberto Battino et.al., [2508.15079v1](http://arxiv.org/abs/2508.15079v1)\n\n Type Ia supernovae (SNIa) are thermonuclear explosions of white dwarfs in binary systems. They are central to galactic chemical evolution and serve as standardizable candles in cosmology, yet their progenitors remain uncertain. In this work, we present a grid of five models detailing the evolution and nucleosynthesis of slowly merging carbon-oxygen white dwarfs approaching the Chandrasekhar mass. These models test a variety of physics input settings, including accretion rates, nuclear reaction rates, convection parameters, and the composition of the accreted material. During the merger process, as the mass of the primary white dwarf approaches the Chandrasekhar limit, carbon burning is initiated first on the surface before eventually igniting explosively at the center. As a consequence, the 22Ne(a,n)25Mg reaction activates in the outer layers of all models. The neutrons released in this way produce a weak s-process-like abundance distribution peaking at Kr, which is overproduced by more than a factor of 1000 compared to solar. The trans-Fe elements-enriched outer layer mass varies from 0.04 Msun to 0.11 Msun, depending on the accretion rate. Our explosion simulation of these progenitor models ejects significant amount of first-peak elements (e.g., Kr, Sr) as well as of some long-lived radioactive species, such as 60Fe. In a previous theoretical study, we found that a similar nucleosynthesis process during the progenitor phase may also occur on the surface of near-Chandrasekhar white dwarfs formed through the accretion of H-rich material via the single-degenerate scenario. Therefore, these results suggest trans-Fe enrichment might be a hallmark of near-Chandrasekhar SNIa ejecta, regardless of the specific progenitor channel, and could provide a new spectral signature distinguishing them from sub-Chandrasekhar explosions.\n\n", "2508.15059": "2025-08-20, **Correlating Particle Acceleration Rates with Plasma Conditions in Colliding Wind Binaries**, Gislaine B Cordeiro et.al., [2508.15059v1](http://arxiv.org/abs/2508.15059v1)\n\n Recent observations have revealed star-forming regions as possible origin sites of very-high-energy (TeV) cosmic rays, not associated with supernova remnants. Colliding-wind binaries (CWBs) are strong X-ray and radio synchrotron emitters and have been proposed as potential accelerators of such particles. We perform high-resolution three-dimensional magnetohydrodynamic simulations coupled with test-particle integration to investigate how local plasma conditions affect particle acceleration in CWBs. We find that the maximum particle energies and the hardness of the energy distributions depend on the shock magnetization and cooling efficiency. For moderate magnetization ($\\gt$1 G), CWBs can accelerate hadronic particles up to hundreds of TeV or even PeV energies, with more than 1\\% of particles reaching the very-high-energy range. By correlating the local acceleration rate with plasma quantities - \\textit{magnetic field strength, current density, vorticity, and velocity divergence} - we show that turbulence and magnetic field complexity dominate the acceleration, while classical diffusive shock acceleration plays a limited role. These results suggest that turbulent, magnetically driven processes are key to producing relativistic particles in CWBs, with implications for future high sensitivity $\\gamma$-ray observations (e.g. LACT and CTAO).\n\n", "2508.15014": "2025-08-20, **Exploration of Parameters in f(R,T) Gravity and Comparison with Type Ia Supernovae Data**, Vincent R. Siggia et.al., [2508.15014v1](http://arxiv.org/abs/2508.15014v1)\n\n The expansion of the Universe in $f(R,T)$ gravity is studied. We consider functions of the form $f(R,T)=R+\\lambda T^\\epsilon$ where $\\epsilon<1$. We find that for all models with $\\epsilon<0$, the Universe transitions to exponential growth at late times, just as it does in the standard cosmological model, which corresponds to $\\epsilon=0$. It also fits the type Ia supernova data slightly better than the standard cosmological model, without increasing the number of parameters of the theory. In contrast, the fits for $\\epsilon >0$ rapidly become worse than the standard cosmological model.\n\n", "2508.14890": "2025-08-20, **Estimating Initial Mass of Gaia-Enceladus Dwarf Galaxy with Chemical Evolution Model**, Olcay Plevne et.al., [2508.14890v1](http://arxiv.org/abs/2508.14890v1)\n\n This work investigates the initial mass and chemical evolution history of the Gaia-Enceladus dwarf galaxy. We combine spectroscopic data from APOGEE with astrometric data from Gaia DR3 to identify Gaia-Enceladus candidate stars via a machine-learning pipeline using t-SNE and HDBSCAN. By focusing on kinematic and chemical parameters, especially $\\mathrm{[Fe/H]}$, $\\mathrm{[Mg/Fe]}$, $\\mathrm{[Al/Fe]}$, and $\\mathrm{[Mn/Fe]}$, we uncover a population of metal-poor, high-eccentricity stars that align with literature criteria for Gaia-Enceladus debris. We then apply the \\textit{OMEGA+} chemical evolution model, incorporating MCMC fitting of the observed abundance trends in the $\\mathrm{[Mg/Fe]\\times[Fe/H]}$ plane. Our best-fitting model indicates a gas mass of $4.93\\_{-0.72}^{+0.32}\\times10^9\\,{M\\_{\\odot}}$ for Gaia-Enceladus, placing it at the higher end of previously suggested mass ranges. The model scenario suggests a short star formation timescale, substantial outflows, and a rapid build-up of metals mainly driven by core-collapse supernovae, with a lesser contribution from Type~Ia supernovae. Comparison with observational data in other chemical planes (e.g., $\\mathrm{[Mg/Mn]\\times[Al/Fe]}$) supports this scenario, emphasizing a distinct evolution path relative to the Milky Way. Additionally, our results provide indirect evidence that star formation in Gaia-Enceladus likely ceased within the first 4 Gyr, consistent with earlier inferences of an early merger event. These findings highlight the power of chemical evolution modeling in reconstructing the origin and mass of ancient accreted systems. Overall, we show that Gaia-Enceladus, through a rapid star formation and strong outflows, contributed a significant fraction of the metal-poor stellar halo of the Milky Way.\n\n", "2508.14579": "2025-08-20, **SN 2024hpj: a perspective on SN 2009ip-like events**, I. Salmaso et.al., [2508.14579v1](http://arxiv.org/abs/2508.14579v1)\n\n Supernovae (SNe) IIn are terminal explosions of massive stars that are surrounded by a dense circumstellar medium (CSM). Among SNe IIn, a notable subset is the SNe 2009ip-like, which exhibit an initial, fainter peak attributed to stellar variability in the late evolutionary stages, followed by a brighter peak, interpreted as the SN explosion itself. We analyse the spectrophotometric evolution of SN 2024hpj, a SN IIn with signs of precursor activity. Comparing it with similar objects in the literature, we identify star-forming regions as their preferred environments, while a statistical analysis on the observed rate of SNe 2009ip-like indicates progenitor masses around 25 - 31 solar masses and lower. The diversity of spectrophotometric features within the sample suggests that variations in CSM mass and distribution influence the observed characteristics, indicating a shared progenitor scenario.\n\n", "2508.14570": "2025-08-20, **MUSE Observations Reveal Optical Coronal Iron Lines from Shock Emission in Supernova Remnant 0540-69.3**, L. Tenhu et.al., [2508.14570v1](http://arxiv.org/abs/2508.14570v1)\n\n We investigate the optical shock emission from the Large Magellanic Cloud supernova remnant 0540-69.3 (SNR 0540) using MUSE integral-field-unit data from the VLT. The observations cover the spectral range 4650-9300 $\\r{A}$ and provide a $1\\times1$ arcmin$^{2}$ field of view, encompassing nearly the entire remnant. We analyse the spatial and spectral properties of shock-related emission lines, and identify clumpy optical shock emission e.g. from [S II] $\\lambda\\lambda$6716,6731 doublet and the coronal [Fe XIV] $\\lambda$5303 line (typically at radial velocities $\\lesssim\\|100\\|$ km s$^{-1}$ and $\\lesssim\\|170\\|$ km s$^{-1}$, respectively). These features trace the blast-wave shell seen in previous X-ray studies. Post-shock electron density estimates, based on the [S II]-line ratio, reveal spatial variation, with the highest densities ($\\sim10^4$ cm$^{-3}$) in the bright knots in the west, and lower densities ($\\sim3\\times10^3$ cm$^{-3}$) in the east. The density in the north (southwest) appears significantly lower (higher) but remains unconstrained due to limited signal. We also estimate blast-wave shock velocities using the [Fe XIV] $\\lambda$5303/[Fe XI] $\\lambda$7892 ratio, finding low velocities ($\\sim400$ km s$^{-1}$), consistent with previous studies. All these results support the scenario that the blast wave is interacting with the surrounding interstellar medium, particularly in the western regions. Additionally, we detect four unidentified emission lines, $\\sim$2000-3000 km s$^{-1}$ south from the pulsar in transverse velocity, but their origin remains unclear. Possible explanations, including Fe lines from a high-velocity ejecta clump, all present challenges. Our findings highlight the complex nature of the circum- and interstellar medium surrounding SNR 0540.\n\n", "2508.14476": "2025-08-20, **High-resolution Radio Study of Pulsar Wind Nebula MSH 15-52 and Supernova Remnant RCW 89**, S. Zhang et.al., [2508.14476v1](http://arxiv.org/abs/2508.14476v1)\n\n We present high-resolution radio observations of the pulsar wind nebula (PWN) MSH15-52, which is renowned for its distinctive hand-like shape, and its associated supernova remnant RCW 89. Using the Australia Telescope Compact Array (ATCA), we obtained 3 and 6,cm radio maps with a resolution of 2 arcsec. These unveil small-scale radio features in the system and allow a direct comparison with the arcsecond-resolution X-ray images. We find that the radio emission is composed of a complex filamentary structure. In particular, there is a bar-like feature across the central pulsar B1509-58 in the inner PWN, and the radio sheath wrapping around the pulsar also appears to be made up of filaments. Some prominent X-ray features are not detected in radio, including the one-sided jet in the south and the finger-like structures in the north. These indicates turn over of the particle distribution at low energies in these regions. For RCW 89, the radio emission well coincides with both the X-ray knots and the H{\\alpha} filaments. The high polarization fraction shows that the emission is synchrotron in nature, but it extends well beyond the sharp boundary of the non-thermal X-ray emission, which is difficult to explain.\n\n", "2508.14467": "2025-08-20, **Reconstruction of X-Ray Afterglow Light Curves of GRBs and its implication for constraining Cosmological Parameters**, Yu-Qi Zhou et.al., [2508.14467v1](http://arxiv.org/abs/2508.14467v1)\n\n Gamma-ray bursts (GRBs) serve as important cosmological probes, whose X-ray afterglow light curves (LCs) may exhibit a plateau phase (with temporal slope $\\alpha$ between 0 and 0.5) that may originate from magnetar energy injection. Similar to Type Ia Supernovae, GRBs with a common physical origin can be used as standardizable candles for cosmological studies. However, observational gaps in GRB light curves introduce significant uncertainties in plateau parameter estimation, thereby affecting cosmological constraints. In this work, we employ a stochastic reconstruction technique to reconstruct the X-ray afterglow LCs for 35 GRB samples exhibiting plateau features, generating 50 simulated data points for each LC. Using the reconstructed LCs, we calibrate three luminosity correlations: the $L\\_0$-$t\\_b$, $L\\_0$-$t\\_b$-$E\\_{p,i}$, and $L\\_0$-$t\\_b$-$E\\_{\\gamma,\\mathrm{iso}}$ relation, which are then applied to constrain both flat and non-flat $\\Lambda$CDM cosmological models. The main results include: (i) the $L\\_0$-$t\\_b$ relation yields a slope $b \\approx -1$, supporting a constant magnetar energy injection rate; (ii) light curve reconstruction has limited impact on cosmological parameter constraints; (iii) for the flat $\\Lambda$CDM model constrained by the $L\\_0$-$t\\_b$-$E\\_{p,i}$ relation, the precision of $\\Omega\\_m$ improves by 6.25\\%; For the non-flat $\\Lambda$CDM model constrained by the $L\\_0$-$t\\_b$-$E\\_{p,i}$ relation, the precision of $\\Omega\\_\\Lambda$ improves by 1.01\\%. Our findings suggest that increasing the number of LC data points provides limited improvement to cosmological constraints, while expanding the sample size of GRBs with identical physical origins may be more crucial.\n\n"}}