{"neutrino": {"2505.07514": "2025-05-12, **A two-stage time-stretching TDC with discrete components**, Yanbo Chu et.al., [2505.07514v1](http://arxiv.org/abs/2505.07514v1)\n\n This paper presents the design and testing of a time-stretching-based time-to-digital converter (TDC) implemented with discrete components. The TDC utilizes capacitor charging and discharging to achieve a time resolution of under 100 ps using a 100 MHz clock counter on a low-power, low-cost FPGA, achieving a time amplification factor of over 100. A two-stage time-stretching architecture is employed to reduce the conversion time to below 300 ns for a 10 ns input range. An onboard calibration system, including a pulse generation circuit, is implemented, and calibration results are presented. This system serves as a proof-of-concept platform for circuit optimization toward an ASIC implementation of a front-end TDC targeting future 4D pixel detectors at hadron colliders, with goals of sub-50 ps resolution and power consumption at the $\\mu$W/channel level. Additionally, the design offers a modular, low-cost solution for extracting signal arrival times with 100 ps precision in particle physics experiments, such as photoelectron timing extraction for photodetector readout in neutrino experiments.\n\n", "2505.07493": "2025-05-12, **Estimates of the masses of heavy right-handed neutrino particles using the seesaw mechanism**, V. V. Khruschov et.al., [2505.07493v1](http://arxiv.org/abs/2505.07493v1)\n\n The mass estimates of active and sterile (right-handed) neutrinos are considered at the phenomenological level using the seesaw mechanism. It is assumed that the neutrino mass values depend on three characteristic scales, and the sum of the active neutrino mass values is limited from above by 0.06 eV. The neutrino mass values are estimated, as well as the observable neutrino mass values, namely, the average mass m\\_C of active neutrinos and the kinematic neutrino mass m\\_{\\beta} of beta-decay.\n\n", "2505.07403": "2025-05-12, **Investigating sub-MeV dark matter annihilation to neutrinos using direct detection experiments**, Boris Betancourt Kamenetskaia et.al., [2505.07403v1](http://arxiv.org/abs/2505.07403v1)\n\n Dark matter (DM) could self-annihilate into neutrinos in dense regions of the Universe. We consider the resulting flux of neutrinos from the Milky Way DM halo and derive exclusion limits on the annihilation cross-section using XENONnT electron recoil data. Assuming a $J$-factor independent of the annihilation cross-section, we find leading limits for DM masses below $\\mathcal{O}$(MeV). Self-annihilating DM affects the DM halo via dissolution, introducing a cross-section dependency on the halo profile and thus the $J$-factor. We discuss such a situation in more detail, finding that the signal rate is below the experimental sensitivity of XENONnT, leaving the annihilation cross-section unconstrained.\n\n", "2505.07400": "2025-05-12, **Zooming into the neutrino-associated blazar candidate J1718+4239**, K. Perger et.al., [2505.07400v1](http://arxiv.org/abs/2505.07400v1)\n\n The radio quasar NVSS~J171822+423948 (J1718+4239) was proposed as the counterpart of the IceCube neutrino event IC-201221A. To reveal the nature of the source, we conducted new very long baseline interferometry (VLBI) observations of this blazar candidate with the Very Long Baseline Array (VLBA). The observations were carried out in dual-band mode between $4$ and $7$~GHz. Archival radio data from the literature were also collected for comparison. Our analysis revealed highly variable, Doppler-boosted radio emission of the source, with compact structure at both kpc and pc scales, a slightly inverted spectrum, and a maximum jet inclination angle of $\\theta\\le5\\degr$. These results confirm J1718+4239 as a blazar-type object.\n\n", "2505.07262": "2025-05-12, **Lepton mass textures from non-invertible multiplication rules**, Tatsuo Kobayashi et.al., [2505.07262v1](http://arxiv.org/abs/2505.07262v1)\n\n We study the lepton mass textures, which are derived by $\\mathbb{Z}\\_2$ gauging of $\\mathbb{Z}\\_M$ symmetries. We can obtain various textures for the Yukawa couplings in the charged lepton sector, but the patterns of neutrino mass matrices are limited. All the obtained textures can not be realized by group-theoretical symmetries, and certain textures can lead to realistic results.\n\n"}, "dark matter": {"2505.07770": "2025-05-12, **Circulators based on Coupled Quantum Anomalous Hall Insulators and Resonators**, Luis A. Martinez et.al., [2505.07770v1](http://arxiv.org/abs/2505.07770v1)\n\n Integrated plasmonics is advancing rapidly, enabling a wide range of functionalities to be incorporated onto a single chip. Applications span information processing, computation, quantum sensing, and dark-matter detection. This progress has driven the development of integrated non-reciprocal devices, which are essential for preventing unwanted feedback that can degrade system performance. While non-reciprocal devices have been realized in edge magnetoplasmon materials via classical interference effects, their operation is often complicated by a dependence on input power. Here, we demonstrate that topological circulators utilizing asymmetric coupling offer improved input power range, isolation, and insertion loss. In this configuration, non-reciprocal behavior arises from the coupling between a chiral edge magnetoplasmonic resonator and LC resonators, leading to non-Hermitian dynamics. The coherent photon-plasmon interaction enables a circulator with up to 50 dB of isolation across a broad range of excitation intensities. This is the first experimental demonstration showing that magnetic topological insulators can support the study of chiral plasmonic cavity quantum electrodynamics at radio frequencies, underscoring their potential to enable chip-scale quantum-classical interfaces in superconducting quantum information processing systems.\n\n", "2505.07753": "2025-05-12, **Dark Matter in Multi-Singlet Extensions of the Standard Model**, Maria Gonçalves et.al., [2505.07753v1](http://arxiv.org/abs/2505.07753v1)\n\n We study the simplest extensions of the Standard Model (SM) that originate Dark Matter (DM) candidates, built with the addition of real singlets and new ${Z}\\_2$ symmetries under which the models are invariant. In this type of models the interactions between SM particles are not altered except for the new interactions stemming from the portal couplings that link the SM Higgs with the DM candidates. In the extension with just one singlet, DM masses below about 4 TeV are already excluded by the combination of relic density and direct detection (DD) constraints, except for the resonant case of half the Higgs mass, making them undetectable at the LHC. Adding more real singlets with independent ${Z}\\_2$ symmetries opens up a new mass window for one of the DM candidates and decreases the lower bound on the other. Adding more singlets with independent ${Z}\\_2$ symmetries will not change this picture dramatically. If instead we add new singlets all odd under the same ${Z}\\_2$ symmetry, the allowed mass region for the DM candidate (i.e., the lighter dark sector scalar) will span the entire mass range from half the Higgs mass to the TeV scale. In principle, such light particles could be probed at the LHC in mono-$X$ searches. Although they are still out of reach with the current LHC DM searches, there are good chances to probe the models in some final states at the High-Luminosity (HL-LHC) stage of the LHC.\n\n", "2505.07541": "2025-05-12, **Conceptual Design Report of the SUPAX Experiment**, Dhruv Chouhan et.al., [2505.07541v1](http://arxiv.org/abs/2505.07541v1)\n\n The SUPerconduction AXion search experiment (Supax) is a haloscope designed to probe axion-like particles (ALPs) as candidates for dark matter and solutions to the strong CP problem. ALPs are predicted to couple to photons, allowing their detection through resonant conversion in electromagnetic cavities placed within strong magnetic fields. \\Supax employs a 12 T magnetic field and tunable superconducting cavities with resonance frequencies ranging from 2\\,GHz to 7.2\\,GHz, enabling the exploration of axion masses between 8\\,$\\mu$eV and 30\\,$\\mu$eV. The tuning mechanism, based on piezo motors and gas-pressure regulation, allows for simultaneous scanning of up to three frequencies, significantly improving search efficiency. This paper presents the technical design of the Supax experiment, preliminary R\\&D efforts, and results from prototype experiments. In particular, we exclude dark photons with masses around $35\\,\\mu$eV with a kinetic mixing parameter $\\chi > 5\\cdot 10^{-14}$, i.e. a region of parameter space which has not been previously explored.\n\n", "2505.07465": "2025-05-12, **Close-knit relatives: reproducing galactic rotation curves with a two-component bosonic dark matter model**, Jorge Castelo Mourelle et.al., [2505.07465v1](http://arxiv.org/abs/2505.07465v1)\n\n Bosonic stars,hypothetical astrophysical entities, are generally categorized into two primary classes based on the nature of their constituent particles: Einstein Klein Gordon stars, made up of massive scalar bosons, and Proca stars, their vector ''cousins''. Depending on the boson masses and field frequencies, these objects may exhibit properties of diffuse, massive structures, with sizes comparable to or even exceeding those of galaxies. This concept has inspired the bosonic dark matter halo hypothesis, providing a theoretical framework to effectively model the dark matter content of galactic halos. In this paper we build on our previous work to explore the possibility of using vector and scalar bosons to model the components of galactic dark matter halos and subhalos in order to reproduce the observed rotation curves of galaxies. By employing diverse combinations of those bosonic dark matter models in conjunction with observable data for a sample of galaxies, we show that our two component dark matter approach notably improves the agreement between observations and theoretical predictions with respect to our previous investigation. Our framework may shed new light on the enduring mystery surrounding the apparent matter deficit observed in dwarf and spiral galaxies.\n\n", "2505.07456": "2025-05-12, **Non-minimally coupled scalar field dark sector of the universe: in-depth (Einstein frame) case study**, Marcin Postolak et.al., [2505.07456v1](http://arxiv.org/abs/2505.07456v1)\n\n We revisit non-minimally coupled scalar field cosmologies in the Einstein frame and present a comprehensive analysis that spans background dynamics, linear perturbations, thermodynamics, quantum gravity constraints and baryogenesis. Using a dynamical systems approach, we classify all analytical critical points for a representative set of scalar field potentials: axions (ALPs), cyclic ekpyrotic, exponential (ekpyrotic) with $\\Lambda$, quintessence, and scalar field dark matter. We show that a chameleon-like coupling $f(\\phi)=e^{\\beta\\phi}$ modifies both the expansion history and the growth of structure in a way that remains compatible with current fifth-force searches. Analytical transfer matrices for primordial tensor modes are derived, revealing a scale-dependent break in the gravitational-wave spectrum whose position and amplitude are fixed by the coupling parameter $\\beta$. A causal Israel--Stewart treatment demonstrates that the same coupling supplies an effective bulk pressure that drives a smooth bounce while respecting quantum energy inequalities. Penrose's Weyl-curvature hypothesis is recovered dynamically: during an ekpyrotic phase with $\\omega\\gg1$ the Weyl invariant decays as $a^{-6(1+\\omega)}$, resetting gravitational entropy without violating the generalized second law. A time-varying $\\phi$ simultaneously generates an effective chemical potential $\\mu\\_{B}\\simeq\\beta\\dot{\\phi}/M^{2}$, allowing for spontaneous high-scale baryogenesis whose back reaction on $\\phi$ is negligible for $M\\gtrsim10^{15}\\sqrt{\\beta}$ GeV. Swampland distance and de Sitter criteria are automatically satisfied because the ekpyrotic phase confines the field excursion to $\\Delta\\phi\\lesssim\\mathcal{O}(1)M\\_{\\rm Pl}$. These results establish new links between dark-sector interactions, entropy production, and late-time acceleration while identifying observational windows.\n\n"}, "supernova": {"2505.07665": "2025-05-12, **EP241021a: a months-duration X-ray transient with luminous optical and radio emission**, Shu Xinwen et.al., [2505.07665v1](http://arxiv.org/abs/2505.07665v1)\n\n We present the discovery of a peculiar X-ray transient, EP241021a, by the Einstein Probe (EP) mission, and the results from multiwavelength follow-up observations. The transient was first detected with the Wide-field X-ray Telescope as an intense flare lasting for ~100 s, reaching a luminosity of L\\_(0.5-4 keV)~10^48 erg/s at z=0.748. Further observations with EP's Follow-up X-ray Telescope reveal a huge drop in the X-ray flux by a factor of >1000 within 1.5 days. After maintaining a nearly plateau phase for ~7 days, the X-ray flux declines as t^-1.2 over a period of ~30 days, followed by a sudden decrease to an undetectable level by EP and XMM-Newton, making it the longest afterglow emission detected among known fast X-ray transients. A bright counterpart at optical and radio wavelengths was also detected, with high peak luminosities in excess of 10^44 erg/s and 10^41 erg/s, respectively. In addition, EP241021a exhibits a non-thermal X-ray spectrum, red optical color, X-ray and optical rebrightenings in the light curves, and fast radio spectral evolution, suggesting that relativistic jets may have been launched. We discuss possible origins of EP241021a, including a choked jet with supernova shock breakout, a merger-triggered magnetar, a highly structured jet, and a repeating partial tidal disruption event involving an intermediate-mass black hole, but none can perfectly explain the multiwavelength properties. EP241021a may represent a new type of X-ray transients with months-duration evolution timescales, and future EP detections and follow-up observations of similar systems will provide statistical samples to understand the underlying mechanisms at work.\n\n", "2505.07281": "2025-05-12, **An Actinide-boost Star Discovered in the Gaia-Sausage-Enceladus**, Yangming Lin et.al., [2505.07281v1](http://arxiv.org/abs/2505.07281v1)\n\n We report the discovery of an actinide-boost, very metal-poor ($\\left[\\mathrm{Fe/H} \\right]=-2.38$), $r$-process-enhanced ($\\left[\\mathrm{Eu/Fe} \\right]=0.80$) star, LAMOST J0804+5740, within the Gaia-Sausage-Enceladus (GSE). Based on the high-resolution ($R\\sim36,000\\; and \\;60,000$) and high signal-to-noise ratio spectra obtained with the High Dispersion Spectrograph on the Subaru Telescope, the abundances of 48 species are determined. Its $\\log\\epsilon\\rm(\\mathrm{Th}/\\mathrm{Eu}) = -0.22 $ establishes it as the first confirmed actinide-boost star within the GSE. Comparative analysis of its abundance pattern with theoretical $r$-process models reveals that the magnetorotationally driven jet supernova $r$-process model with $\\hat{L}v$ = 0.2 provides the best fit and successfully reproduces the actinide-boost signature. Kinematic analysis of actinide-boost stars reveals that approximately two-thirds of them are classified as $\\textit{ex-situ}$ stars, suggesting that actinide-boost stars are more likely to originate from accreted dwarf galaxies. As the first actinide-boost star identified within the GSE, J0804+5740 will provide valuable insights into $r$-process nucleosynthesis in accreted dwarf galaxies like the GSE, especially on the production of the heaviest elements.\n\n"}}