{"neutrino": {"2512.16862": "2025-12-18, **Gravity-assisted neutrino masses**, Stefan Antusch et.al., [2512.16862v1](http://arxiv.org/abs/2512.16862v1)\n\n Gravity is generally expected to violate global symmetries, including lepton number. However, neutrino masses from the Planck-suppressed Weinberg operator are typically too small to account for oscillation data. We propose a new model-building approach to low-scale neutrino mass generation, in which an intermediate spontaneous symmetry-breaking scale generates masses and mixings in the heavy neutral lepton (HNL) sector, while leaving an unbroken residual symmetry $G\\_{\\mathrm{res}}$ that forbids light-neutrino masses. The observed light-neutrino masses then arise because gravity breaks $G\\_{\\mathrm{res}}$ via Planck-suppressed operators, inducing the small lepton-number violation required in low-scale seesaw constructions. The HNLs form pseudo-Dirac pairs, with masses potentially within reach of future colliders and complementary tests in precision searches such as charged lepton flavour violation (cLFV). As an illustration, we present a representative realisation of this class of models and show that, for $\\mathcal{O}(1)$ operator coefficients, it predicts a region in the ($M\\_R$, $Θ^2$)-plane that can be testable via displaced-vertex searches at the High-Luminosity (HL) LHC and the FCC-ee.\n\n", "2512.16781": "2025-12-18, **Dark energy and neutrinos along the cosmic expansion history**, Pietro Ghedini et.al., [2512.16781v1](http://arxiv.org/abs/2512.16781v1)\n\n Recent cosmological measurements are hinting that dark energy may evolve, with its equation of state, $w\\_\\mathrm{DE}$, even showing oscillatory patterns. In this work, we employ a model-independent approach to jointly reconstruct $w\\_\\mathrm{DE}$ and the sum of neutrino masses, $\\sum m\\_ν$, adopting the PCHIP method with seven fixed nodes in which we allow the two parameters to vary. We employ CMB, Baryon Acoustic Oscillations and Supernovae Ia data to constrain the values of $w\\_\\mathrm{DE}$ and $\\sum m\\_ν$ at each node. We conduct three different analyses in which we reconstruct $w\\_\\mathrm{DE}$: one with fixed $\\sum m\\_ν=0.06~\\mathrm{eV}$; one in which we allow $\\sum m\\_ν$ to vary, and one in which we also reconstruct $\\sum m\\_ν$ using the PCHIP method. We find the dark energy equation of state to be consistent with the cosmological constant scenario, except when including DESI data and allowing for phantom crossing, where we find a $95\\%$ CL deviation from $w\\_\\mathrm{DE}=-1$ around $z\\sim1.2$. For neutrino masses, we obtain looser constraints when focusing on phantom dark energy, that show further early and late relaxation when reconstructing the mass via the PCHIP method.\n\n", "2512.16562": "2025-12-18, **Prompt Searches for Very-High-Energy γ-Ray Counterparts to IceCube Astrophysical Neutrino Alerts**, J. Abhir et.al., [2512.16562v1](http://arxiv.org/abs/2512.16562v1)\n\n The search for sources of high-energy astrophysical neutrinos can be significantly advanced through a multi-messenger approach, which seeks to detect the gamma rays that accompany neutrinos as they are produced at their sources. Multi-messenger observations have so far provided the first evidence for a neutrino source, illustrated by the joint detection of the flaring blazar TXS 0506+056 in highenergy (HE, E > 1 GeV) and very-high-energy (VHE, E > 100 GeV) gamma rays in coincidence with the high-energy neutrino IceCube-170922A, identified by IceCube. Imaging atmospheric Cherenkov telescopes (IACTs), namely FACT, H.E.S.S., MAGIC, and VERITAS, continue to conduct extensive neutrino target-of-opportunity follow-up programs. These programs have two components: followup observations of single astrophysical neutrino candidate events (such as IceCube-170922A), and observation of known gamma-ray sources after the identification of a cluster of neutrino events by IceCube. Here we present a comprehensive analysis of follow-up observations of high-energy neutrino events observed by the four IACTs between September 2017 (after the IceCube-170922A event) and January 2021. Our study found no associations between gamma-ray sources and the observed neutrino events. We provide a detailed overview of each neutrino event and its potential counterparts. Furthermore, a joint analysis of all IACT data is included, yielding combined upper limits on the VHE gamma-ray flux.\n\n", "2512.16554": "2025-12-18, **Double shell structure in supernova 2024ggi**, Kobi Shiran et.al., [2512.16554v1](http://arxiv.org/abs/2512.16554v1)\n\n We built a simple toy model of a core-collapse supernova (CCSN) ejecta composed of two shells, an outer low-mass spherical shell and an inner elongated massive shell, and show that it can reproduce the evolution of the photospheric radius of SN 2024ggi, Rph(t). During the first week, the larger spherical shell, the S-shell, forms the photosphere. As the shell expands and becomes increasingly transparent, the photosphere moves inward along the mass coordinate, although it grows in size. When the photosphere reaches the long axis of the elongated inner shell, the E-shell begins to contribute to the photosphere, ultimately comprising the entire photosphere. The simple toy model explains the transition of Rph(t) from being concave (decreasing slope) to convex (increasing slope). A single-shell model predicts only concave behavior. The structure of a spherical shell with an inner elongated shell is motivated by the morphologies of several CCSN remnants whose structures have been attributed to multiple pairs of jets in the framework of the jittering jets explosion mechanism (JJEM). The deduced multiple-shell ejecta of SN 2024ggi in this study, and of SN 2023ixf in an earlier study, as well as studies of the polarization of SN 2024ggi, are better compatible with the JJEM than with the neutrino-driven mechanism. Our study supports the growing evidence that the JJEM is the primary explosion mechanism of CCSNe.\n\n", "2512.16517": "2025-12-18, **How massive neutrinos reshape the cosmic web**, Leonor N. L. Simões et.al., [2512.16517v1](http://arxiv.org/abs/2512.16517v1)\n\n We explore the effects of massive neutrinos on the cosmic web using the FLAMINGO simulations. We classify the cosmic web into voids, sheets, filaments, and clusters, and find that massive neutrinos affect the environment by decreasing the volume occupied by clusters and voids. We find that increasing the neutrino mass shifts the volume-weighted density distribution towards higher densities and leads to a more narrow density distribution, which we interpret as neutrinos delaying structure formation. We construct the minimum spanning tree (MST) graph from the subhaloes, adopting a number density chosen to match that expected for DESI-like observations. We show that most MST edges lie in filaments, approximately 70% throughout different simulations, which we link to its sensitivity to neutrino mass. We also link the MST's edge length signal at different scales to different cosmic web environments, with clusters dominating the signal at small scales, voids at longer scales, and filaments at intermediate scales. The strong correlation between MST edges and cosmic web environments reinforces the MST's potential to be used as a classifier for large-scale structure in galaxy surveys. We compare the effects of baryonic physics and massive neutrinos and find that each produces distinct signatures in MST edge lengths. This analysis is performed in 3D space, using the true positions of subhaloes and not accounting for redshift space distortions. Nevertheless, these results emphasise the MST's capability to go beyond two-point statistics, motivating future applications to real observational data.\n\n", "2512.16427": "2025-12-18, **CHIC: Caley-Hamilton, Invariants and Constants for Neutrino Oscillation Probabilities and Gradients**, Pablo Fernández-Menéndez et.al., [2512.16427v1](http://arxiv.org/abs/2512.16427v1)\n\n We use the Caley-Hamilton theorem to derive analytical solutions for the three-flavor neutrino propagation amplitude in a constant-density medium and their derivatives with respect to the mixing parameters. This approach avoids the diagonalization of the Hamiltonian and exploits precomputed matrix invariants to separate the dependence of oscillation probabilities on neutrino energy and propagation baseline. The results are implemented in the CHIC software, which provides simple, fast and efficient computation of oscillation probabilities and their derivatives. Finally, we demonstrate the value of probability gradients for neutrino data analyses and introduce a complementary visualization, the oscillograds, to probe underlying features of neutrino mixing.\n\n", "2512.16281": "2025-12-18, **Neutrino Propagation in Quantum Field Theory at Short and Long Baselines**, Vadim A. Naumov et.al., [2512.16281v1](http://arxiv.org/abs/2512.16281v1)\n\n In a quantum field approach to neutrino oscillations, the neutrino is treated as a propagator, while the external initial and final particle states are described by covariant wave packets. For the asymptotic behavior on short and long macroscopic baselines, the wave packet modified neutrino propagator is expressed through asymptotic series in powers of dimensionless Lorentz and rotation invariant variables. In both regimes, leading-order corrections violate the classical inverse-square law and lead to a decrease in the neutrino-induced event rate. The possibility that the so-called reactor antineutrino anomaly can, at least partially, be explained within this approach is discussed.\n\n", "2512.16222": "2025-12-18, **Long-lived particle production through the PRISM**, Kevin J. Kelly et.al., [2512.16222v1](http://arxiv.org/abs/2512.16222v1)\n\n Accelerator-based neutrino experiments offer a competitive environment to search for long-lived particles with sub-GeV masses. Yet, many theoretical models involving such particles predict very similar phenomenology and nearly identical final-state signatures. In view of this, we study the capabilities of upcoming experiments -- specifically the DUNE near detectors -- to distinguish between different classes of long-lived particles and the mechanisms by which they are produces. We expound how the experiment's excellent energy resolution, combined with the possibility to move the detector off-axis (the DUNE-PRISM concept), work in tandem to improve the discrimination power.\n\n", "2512.16180": "2025-12-18, **Fatjet Signatures of Quintuplet Fermions at the LHC**, Sourabh Dube et.al., [2512.16180v1](http://arxiv.org/abs/2512.16180v1)\n\n This paper explores a simplified extension of the standard model featuring a neutral fermion quintuplet and a scalar quadruplet, which together generate neutrino masses through tree and loop level mechanisms. The quintuplet fermions decay into standard model gauge bosons via the scalars, producing unique collider signatures at the LHC characterized by multilepton and multijet final states. The study focuses on the pair production of quintuplet fermions in the 700-1200 GeV mass range, where their decays produce highly boosted W and Z bosons identifiable as fatjets. Emphasis is placed on the production and decay of doubly charged fermions due to their higher cross section. Advanced jet substructure and kinematic techniques are applied to enhance sensitivity by reducing standard model backgrounds. A detailed analysis of signal significance is performed in the two lepton, two fatjet and three lepton, one fatjet channels for different masses of the fermion and the scalars, optimizing selection cuts to maximize signal efficiency over standard model backgrounds. The study found that both channels exhibit excellent performance, with significance exceeding $5σ$ under realistic conditions including a 50\\% background uncertainty at integrated luminosity up to 3000 fb$^{-1}$.\n\n", "2512.16100": "2025-12-18, **Visible and Invisible Pseudoscalar Meson Decays from Anomaly Sum Rules**, Xurong Chen et.al., [2512.16100v1](http://arxiv.org/abs/2512.16100v1)\n\n The decays of pseudoscalar mesons to real and virtual photons as well as neutrino-antineutrino pairs are considered in the framework of the dispersive method based on Anomaly Sum Rules. The contribution of singlet channel involving the new non-perturbative gluon form factor of virtual photon $B(q^2)$ is systematically taken into account. The detailed analysis of its dependence on photon virtuality $q^2$ relying on the available data for meson transition fomfactors is performed. It is shown that B has quite a nontrivial structure at $q^2 \\sim 1 GeV^2$ which may be a signal of the existence of pseudoscalar glueball with a mass about 1.5-2 GeV. The calculation of the decay to $ν\\bar ν$ pairs leads to the compatibility with the result of Arnellos, Marciano and Parsa of 1982, when pion decay is considered neglecting the mixing effects. The account for these effects results, however, in the enhancement of pion branching ratio by a factor of 3, while that for eta decay is larger by several orders of magnitude. It is stressed, that dependence on the pair invariant mass is entirely defined by QCD and coincides with that of the meson transition form factor. The role of obtained results for the physics at HHaS detector at HIAF is discussed.\n\n", "2512.15968": "2025-12-17, **Measurement of Light Yield Response of Gd-compatible Water-based Liquid Scintillator with the Brookhaven 1-ton testbed**, S. Gwon et.al., [2512.15968v1](http://arxiv.org/abs/2512.15968v1)\n\n The Water-based Liquid Scintillator (WbLS) enables hybrid detection by combining scintillation and Cherenkov signals, providing superior event reconstruction capabilities compared to conventional neutrino detectors. We measured the light yield of Gd-compatible WbLS at varying concentrations from 0.35\\% to 1\\% by mass, using cosmic-ray muons in a 1-ton scale detector at BNL. The light yield is measured as (69.16 $\\pm$ 6.92) ph / MeV at 0.35\\% concentration, which increased to (87.32 $\\pm$ 8.73) ph / MeV at 1\\%. These results establish a quantitative basis for optimizing future WbLS-based detectors in neutrino physics.\n\n", "2512.15893": "2025-12-17, **Fifty shades of grayness: parameterizations of spectral distortions and applications in cosmology**, Gabriela Barenboim et.al., [2512.15893v1](http://arxiv.org/abs/2512.15893v1)\n\n Thermal distribution functions can only be of the Fermi-Dirac or Bose-Einstein types, whereas distorted spectra encompass any possible deviations from these shapes. It is fruitful to devise parameterizations of these distortions with only a few parameters which depend on the physical system considered. A method proposed by Stebbins consists in describing a distorted spectrum as a sum of thermalized spectra with a distribution of temperatures, the moments of which are the parameters of interest. After revisiting and extending this approach by working at the level of the number density distribution instead of the standard spectrum, we build another method which consists in describing the distorted spectrum by a polynomial modulating a reference thermalized spectrum. The distortion parameters are then the coefficients of a decomposition on a suitable orthonormal polynomial basis. We advocate that the latter is computationally easier and allows to describe a wide range of distortions. With this formalism, we efficiently describe the standard distortions of the cosmological backgrounds of neutrinos and photons, and we obtain model-independent constraints on nonstandard distortions of these cosmological relics.\n\n", "2512.15860": "2025-12-17, **Particle Production by Time-Varying Dark Energy and the End of Cosmic Expansion**, Nicolas Patino et.al., [2512.15860v1](http://arxiv.org/abs/2512.15860v1)\n\n We consider various possible consequences of time-varying dark energy due to a quintessence scalar field whose energy density is partially converted to particles as the field evolves down its potential. This particle production acts as a source of thermal friction on the field that can make it difficult to distinguish whether dark energy is due to a radiating field rolling down a steep potential, a purely self-interacting field moving down a flatter potential, or a cosmological constant. By reducing the acceleration of the scalar field, thermal friction increases the amount of accelerated expansion and can cause a sizable bump in the quintessence equation of state. We take special interest in the case where a steep potential rapidly changes from positive to negative as the field evolves, resulting in the end of cosmic expansion and the beginning of contraction. Even in this case, we find that thermal friction lengthens the period of accelerated expansion and consequently delays the end of cosmic expansion, making it challenging to detect the impending transition to contraction using conventional cosmological tests. However, particle production can also provide alternative avenues for detection by generating a background of thermal dark radiation, partly comprised of neutrinos or other particles, whose energy density exceeds the remnant photon energy density.\n\n", "2512.15846": "2025-12-17, **GRHayL: a modern, infrastructure-agnostic, extensible library for GRMHD simulations**, Samuel Cupp et.al., [2512.15846v1](http://arxiv.org/abs/2512.15846v1)\n\n Interpreting multi-messenger signals from neutron stars and black holes requires reliable general-relativistic magnetohydrodynamics (GRMHD) simulations across rapidly evolving high-performance-computing platforms, yet key algorithms are routinely rewritten within infrastructure-specific numerical-relativity codes, hindering verification and reuse. We present the General Relativistic Hydrodynamics Library (GRHayL), a modular, infrastructure-agnostic GR(M)HD library providing conservative-to-primitive recovery, reconstruction, flux/source and induction operators, equations of state, and neutrino leakage through an intuitive interface. GRHayL refactors and extends the mature IllinoisGRMHD code into reusable pointwise and stencil-wise kernels, enabling rapid development and cross-code validation in diverse frameworks, while easing adoption of new microphysics and future accelerators. We implement the same kernels in the Einstein Toolkit (Carpet and CarpetX) and BlackHoles@Home, demonstrating portability with minimal duplication. Validation combines continuous-integration unit tests with cross-infrastructure comparisons of analytic GRMHD Riemann problems, dynamical Tolman-Oppenheimer-Volkoff evolutions, and binary neutron-star mergers, showing comparable or improved behavior over legacy IllinoisGRMHD and established Einstein Toolkit codes.\n\n", "2512.15654": "2025-12-17, **Resonant Type-II + Type-I Hybrid Leptogenesis in SO(10) with Triplet--Neutrino Mass Degeneracy $M_T \\simeq M_{N_3}$**, Gayatri Ghosh et.al., [2512.15654v1](http://arxiv.org/abs/2512.15654v1)\n\n The origin of the baryon asymmetry of the Universe remains one of the central open problems in particle physics and cosmology. We identify a new regime of \\emph{hybrid resonant leptogenesis} in renormalizable SO(10) grand unified theories, where a quasi-degeneracy between the scalar triplet and the heaviest right-handed neutrino, \\( M\\_T \\simeq M\\_{N\\_3}, \\) induces an unavoidable interference between type-I and type-II decay amplitudes. This interference gives rise to a physical CP-violating phase, \\( φ\\_{\\rm HR} = \\arg(μf Y\\_ν^\\dagger), \\) which cannot be removed by field redefinitions and leads to a resonant enhancement of the baryon asymmetry without extreme Yukawa hierarchies or tuning. We show that the observed asymmetry, \\( Y\\_B \\simeq 8.7 \\times 10^{-11}, \\) is naturally reproduced for masses around \\(10^{11}\\,\\mathrm{GeV}\\), moderate washout, and \\(\\mathcal{O}(1)\\) phases. The mechanism is predictive and testable, with correlated implications for lepton-flavour violation and electric dipole moments.\n\n", "2512.15609": "2025-12-17, **Hadronic Clues in Quasars Caught by Fermi-LAT**, Antonio Galván et.al., [2512.15609v1](http://arxiv.org/abs/2512.15609v1)\n\n This work explores whether hadronic processes could be responsible for the high-energy emission seen in quasars identified by the Large Area Telescope (LAT) instrument aboard the Fermi satellite. In contrast to purely leptonic models, this work investigates whether hadronic mechanisms can explain the observed gamma-ray spectra by analyzing the spectral energy distributions (SEDs) of a chosen sample of FSRQs (Flat-Spectrum Radio Quasars). By incorporating both hadronic and leptonic components into their multi-wavelength modeling, we evaluate the model's feasibility to simultaneously describe the data collected by Fermi-LAT and neutrinos detected by IceCube. According to the results, a hadronic contribution would be required to explain the SED of quasars detected by Fermi-LAT. However, their contribution to the neutrino flux detected by IceCube remains understated.\n\n", "2512.15585": "2025-12-17, **Study of a triple-discriminating plastic scintillator detector for fast neutrons, thermal neutrons, and gamma rays**, Y. H. Liu et.al., [2512.15585v1](http://arxiv.org/abs/2512.15585v1)\n\n Detecting fast and thermal neutrons plays a crucial role in neutrino experiments and reactor physics. In this study, we propose a plastic scintillator detector which demonstrates the ability to clearly distinguish fast neutrons, thermal neutrons, and gamma rays within mixed radiation fields, offering a practical approach for multi-radiation detection. Two plastic scintillator assemblies: EJ200+EJ426 and EJ276+EJ426 were setup, and the system energy response was calibrated using three gamma sources(137Cs, 22Na and 60Co). An Am-Be neutron source was employed, and pulse shape discrimination(PSD) was used to separate fast neutrons, thermal neutrons and gamma rays. Using a three-sigma discrimination criterion, the EJ200+EJ426 configuration was found to reliably distinguish thermal neutrons from gamma rays, while the EJ276+EJ426 configuration can effectively discriminate fast neutrons, thermal neutrons and gamma rays at gamma-equivalent energies above 1 MeV.\n\n", "2512.15294": "2025-12-17, **Beyond Stage IV: Quasar and Galaxy Clustering and the Fundamental Physics of the 2040s**, M. Guidi et.al., [2512.15294v1](http://arxiv.org/abs/2512.15294v1)\n\n Stage IV galaxy surveys (DESI, 4MOST, MOONS, Euclid) are establishing precision constraints on cosmological parameters through baryon acoustic oscillations and redshift-space distortions, yet fundamental questions on neutrino masses, inflationary physics, and the nature of gravity remain beyond their reach. We present a science case for next-generation wide-field spectroscopic surveys targeting $1 < z < 6$ with simultaneous observations of thousands of galaxies, quasars, and emission-line galaxies. Such surveys would deliver transformative advances: (i) cosmological constraints on absolute neutrino masses ($Σm\\_ν\\lesssim 0.015\\,\\mathrm{eV}$), three times more stringent than Stage IV, enabling resolution of the neutrino mass hierarchy; (ii) detection of primordial non-Gaussianity at the level of $f\\_{\\mathrm{NL}} \\sim 1$, probing multi-field inflation; (iii) measurements of structure growth $fσ\\_8(z)$ spanning cosmic time to constrain dark energy and test gravitational modifications. Achieving these goals requires revolutionary advances in spectroscopic multiplexing ($\\mathcal{O}(1000)$ simultaneous spectra), sub-$2\\times10^{-4}(1+z)$ redshift precision at scale, and field-level inference techniques exploiting higher-order clustering statistics. We demonstrate that the proposed Wide-field Spectroscopic Telescope concept provides a technically feasible and scientifically compelling path to unlock the physics of neutrinos, inflation, and gravity that will remain inaccessible to Stage IV surveys.\n\n", "2512.15264": "2025-12-17, **Channel-Level Calibration Methods of Silicon Photomultiplier for JUNO-TAO Central Detector**, Jiayang Xu et.al., [2512.15264v1](http://arxiv.org/abs/2512.15264v1)\n\n The Taishan Antineutrino Observatory (TAO or JUNO-TAO) is a satellite observatory for the Jiangmen Underground Neutrino Observatory (JUNO), located 44 meters away from the No.1 reactor of the Taishan Nuclear Power Plant. TAO can measure the reactor antineutrino energy spectrum with excellent energy resolution (better than 2\\% at 1 MeV) using state-of-the-art Silicon Photomultipliers (SiPMs) operated at low temperature. To achieve this goal, the SiPMs (together with their readout electronics) must be well calibrated. This paper presents the channel-level calibration methods for the dark count rate (DCR), relative photon detection efficiency (PDE), time offset, gain, and internal optical crosstalk (IOCT) of the SiPMs based on charge and time information of the collected events. For the calibration of the external optical crosstalk (EOCT), in terms of its rate and emission angle distribution, a novel method is proposed by switching on and off different groups of SiPMs with an LED placed in the detector. Using one million simulated events, the expected calibration biases are evaluated for all the aforementioned parameters: relative PDE (2.1\\%), IOCT (1.4\\%), DCR (0.4\\%), EOCT Rate ($<0.1\\%$), gain ($<0.1\\%$), time offset (0.027 ns). The emission angle distribution of the EOCT photons could be measured with a bias of less than 4\\% in main angular range.\n\n", "2512.15065": "2025-12-17, **A Comprehensive Interpretation of Fermi-LAT Pulsars: Fundamental-Plane Death Border, Visibility Thresholds, and GeV-TeV Unification**, Constantinos Kalapotharakos et.al., [2512.15065v1](http://arxiv.org/abs/2512.15065v1)\n\n We present a framework that links equatorial-current-sheet (ECS) physics to catalog-lelvel phase-averaged gamma-ray pulsar properties. Guided by analytic scalings and 3D particle-in-cell (PIC) simulations, we show that the pulsar \"Fundamental Plane\" (relating gamma-ray luminosity, spectral cutoff energy, spin-down power $\\dot{\\cal{E}}$, and surface magnetic field) is bounded by two regimes: a radiation-reaction-limited branch and a potential-drop-limited branch. Their intersection defines a transition in $\\dot{\\cal{E}}$ that maps to a gamma-ray visibility threshold on the $P-\\dot{P}$ diagram, above which detectability is set by distance and beaming, and below which both cutoff energy and efficiency decline rapidly. Placing ATNF pulsars and McGill magnetars onto these planes reproduces the observed Fermi occupancy, with millisecond pulsars (MSPs) on the observable side, young pulsars (YPs) straddling the threshold, and magnetars clustering at or just below it. At higher $\\dot{\\cal{E}}$, both MSPs and YPs depart from the maximal radiation-reaction-limited envelope at similar cutoff energies, suggesting that enhanced pair creation screens the accelerating electric field in the ECS. We interpret this behavior with a compactness-based criterion for optically thin $γγ$ pair feedback in or near the ECS and briefly note an extension to $γγ\\rightarrowμ^\\pm$ that could yield pulsed multi-TeV neutrinos in the most energetic systems. The framework predicts an MeV-bright, GeV-faint corridor below current Fermi sensitivity, a target for next-generation MeV missions. Finally, motivated by the recent HESSII detection of pulsed multi-TeV emission from Vela, we use PIC particle distributions with a simple seed-photon model to reproduce a multi-TeV inverse-Compton component alongside the GeV curvature emission, supporting a unified ECS-based GeV-TeV origin.\n\n"}, "dark matter": {"2512.16916": "2025-12-18, **Discovering gravitational waveform distortions from lensing: a deep dive into GW231123**, Juno C. L. Chan et.al., [2512.16916v1](http://arxiv.org/abs/2512.16916v1)\n\n Gravitational waves (GWs) are unique messengers as they travel through the Universe without alteration except for gravitational lensing. Their long wavelengths make them susceptible to diffraction by cosmic structures, providing an unprecedented opportunity to map dark matter substructures. Identifying lensed events requires the analysis of thousands to millions of simulated events to reach high statistical significances. This is computationally prohibitive with standard GW parameter estimation methods. We build on top of state-of-the-art neural posterior algorithms to accelerate the lensed inference from CPU days to minutes with DINGO-lensing. We showcase its capabilities by reanalyzing GW231123, the most promising lensed candidate so far, and find that its statistical significance cannot exceed 4$σ$. We observe that 8% of GW231123-like nonlensed simulations favor lensing, which could be explained by the self-similarity of short-duration signals. Still, 58% of GW231123-like lensed simulations have larger support for lensing, showing that higher detection statistics are possible. Although GW231123 exposes the challenges of claiming the first GW lensing detection, our deep-learning methods have demonstrated to be powerful enough to enable the upcoming discovery of lensed GWs.\n\n", "2512.16809": "2025-12-18, **Impact of Supercooling on Direct Searches for Dark Matter and Gravitational Wave Backgrounds**, Davide Racco et.al., [2512.16809v1](http://arxiv.org/abs/2512.16809v1)\n\n An interesting feature of a cosmological phase transition can be a stage of exponential expansion (supercooling). The modified expansion history and the entropy injection at reheating, can affect the final energy fraction of dark matter. In this paper, we revisit the calculation of the freeze-out and freeze-in dynamics, showing additional effects on top of the standard dilution factor if the dark matter production is completed during the supercooling stage. We show for the first time how these effects can be particularly interesting for direct detection, as the parameter space for WIMP-like candidates shifts from excluded to allowed regions, and freeze-in candidates get closer to experimental reach. A phenomenological motivation to consider supercooling is the associated gravitational wave background. The implications of a finite-duration reheating stage, when the equation of state is close to matter-domination, are a peculiar low-frequency spectrum, and its shift to lower frequencies. These effects are a complementary test of the dynamics that we study for dark matter production, and remarkably can link direct detection of dark matter and gravitational wave astronomy.\n\n", "2512.16783": "2025-12-18, **Consistent Excesses in the LHC Electroweak SUSY Searches: GUT-based Singlino/Higgsino Interpretation in the NMSSM**, Emanuele Bagnaschi et.al., [2512.16783v1](http://arxiv.org/abs/2512.16783v1)\n\n The search for supersymmetric models remains one of the main items on the BSM search program at the LHC, with EW SUSY partners still allowed with masses as low as a few hundred GeV. Over the last years, searches for the \"golden channel\", $pp \\to \\tildeχ^0\\_2 \\tildeχ^{\\pm}\\_1 \\to \\tildeχ^0\\_1 Z^{(*)} \\tildeχ^0\\_1 W^{\\pm (*)}$ show consistent excesses between ATLAS and CMS in the 2~soft-lepton and 3~soft-lepton plus missing-$E\\_T$ searches, assuming $m\\_{\\tildeχ^0\\_2} \\approx m\\_{\\tildeχ^{\\pm}\\_1} \\gtrsim 200$ GeV and $Δm\\_{21} := m\\_{\\tildeχ^0\\_2} - m\\_{\\tildeχ^0\\_1} \\approx 20$ GeV. We interpret these excesses in the framework of the Next-to-Minimal Supersymmetric Standard Model. We assume a singlino dominated lightest neutralino as a Dark Matter (DM) candidate. The second and third lightest neutralinos are higgsino like, with the higgsino mixing parameter $μ$ being smaller than the soft SUSY-breaking bino and wino masses, $M\\_1$ and $M\\_2$. We furthermore assume the approximate GUT relations $M\\_1 \\sim M\\_2/2 \\sim M\\_3/6$, with the implication for our scenario of a gluino mass $m\\_{\\tilde{g}} \\sim M\\_3 \\gtrsim 3$ TeV. Scalar masses are assumed to heavy and do not play a role in our analysis. We find that this scenario is in agreement with all relevant experimental constraints, comprising the LHC searches for SUSY particles and additional Higgs bosons, the LHC Higgs-boson rate measurements, the DM direct detection limits and the upper limit on the DM relic density. We demonstrate that this scenario gives an excellent description of the observed excesses in the search for 2~and 3~soft-leptons plus \\ETmiss, with $m\\_{\\tildeχ^0\\_2} \\sim m\\_{\\tildeχ^0\\_3} \\sim m\\_{\\tildeχ^{\\pm}\\_1}$ and $Δm\\_{21} \\sim 20$ GeV. This constitutes the first explanation of the soft-lepton excesses in a model with GUT relations among the soft SUSY-breaking parameters.\n\n", "2512.16769": "2025-12-18, **Operation of silicon photomultipliers in a dilution refrigerator down to 9.4 mK towards a cryogenic cosmic ray muon veto system**, QUEST-DMC Collaboration et.al., [2512.16769v1](http://arxiv.org/abs/2512.16769v1)\n\n We report the characterisation of a FBK NUV-HD-cryo silicon photomultiplier (SiPM) sensor operated in an 9.4 $\\pm$ 0.2 mK environment inside a dilution refrigerator, towards the development of a cryogenic cosmic ray muon veto system to be operated internal to a dilution refrigerator required for low background experiments such as the QUEST-DMC dark matter search experiment. We characterise the single photon response and the gain (the charge produced per detected photon), the dark count noise rate, and correlated noise contributions as a function of operating voltage. This paper also reports first proof of concept measurements of using a SiPM directly coupled to scintillator in a 9.4 mK temperature environment, towards detecting candidate cosmic ray muon signals.\n\n", "2512.16451": "2025-12-18, **Coherence from Randomness: Sub-keV Dark Matter Scattering off Random, Heterogeneous Materials**, Zhi-Han Liu et.al., [2512.16451v1](http://arxiv.org/abs/2512.16451v1)\n\n The sub-keV mass range has long posed a challenge for the direct detection of dark matter via elastic scattering. In this Letter, we propose a new mechanism in which dark matter, assumed to be quadratically coupled to SM particles, scatters from random heterogeneous materials with intrinsic density fluctuations, yielding an enhanced coherent response. This effect can substantially increase the total scattering rate and induce measurable accelerations of the target. Using this idea, we derive new constraints from the MICROSCOPE mission that extend into previously unexplored parameter space for sub-keV dark matter, probing cross sections down to $\\sim 4\\times10^{-38}\\,\\mathrm{cm^2}$.\n\n", "2512.16312": "2025-12-18, **PHELEX: Three Series Of Measurements in the Search for Dark Photons**, A. V. Kopylov et.al., [2512.16312v1](http://arxiv.org/abs/2512.16312v1)\n\n This paper presents the results of measurements of diurnal variations in the single electron count rate arising from dark photon conversion at the cathode of a gas proportional counter. Three experimental series were conducted, each consisting of 4 runs lasting approximately 60 days per run. One can expect an excess in the single electron count rate above the average level if the polarization vector of dark photons in the region traversed by the Sun forms an angle between 20 and 50 degrees with the Earth's rotational axis. Such an effect was observed in the first series (significance 6 sigma) and the second series (significance 4 sigma). However, in the third series, which employed two identical detectors simultaneously, the effect was not observed on either detector. This result practically excludes the possibility that the effect observed earlier was purely instrumental. The results of the three series may be interpreted as a possible effect arising from the Sun's passage through regions of dark matter characterized by different orientations of the dark photon polarization vector.\n\n", "2512.16290": "2025-12-18, **The dominant role of dark matter halo in quenching central galaxies**, Dingyi Zhao et.al., [2512.16290v1](http://arxiv.org/abs/2512.16290v1)\n\n Understanding the quenching of star formation in central galaxies remains a core challenge in galaxy evolution. Two decades ago, the concept of halo quenching was introduced as a dominant mechanism, positing that massive central galaxy quenching is governed by the thermodynamics of gas predominantly influenced by dark matter halos. However, a vastly increasing body of observational evidence consistently indicates that quenching correlates predominantly with central properties like velocity dispersion, bulge mass, and black hole mass. When these properties are controlled, halo mass appears to show weak influence, supporting AGN feedback as the primary mechanism. A recurring key issue, however, is that these studies rely on halo masses derived via abundance matching (AM). Direct observational measurements from weak lensing, satellite kinematics, and galactic dynamics reveal that AM systematically overestimates halo masses of star-forming centrals while underestimating those of passive ones. To accurately assess the true role of halo mass. we re-estimated halo masses for SDSS groups; the resulting halo mass function and stellar-to-halo mass relations (SHMRs) for both populations match theoretical predictions and weak lensing measurements. Using these improved masses, we find direct observational evidence that halo mass is the dominant factor in quenching central galaxies, with a clear threshold at $M\\_{h}\\sim 10^{12.1}M\\_\\odot; $. By applying a simple correction to AM data using weak lensing-derived SHMRs, we demonstrate that previous claims regarding the dominance of central properties stem primarily from systematic biases in AM halo masses. Our results suggest that the significance of AGN feedback is primarily manifested in halos above this mass threshold, in galaxies already primed for quenching. In other words, AGN feedback appears to become effective in halos above this mass threshold.\n\n", "2512.16162": "2025-12-18, **Probing neutron star interiors and the properties of cold ultra-dense matter with the SKAO**, Avishek Basu et.al., [2512.16162v1](http://arxiv.org/abs/2512.16162v1)\n\n Matter inside neutron stars is compressed to densities several times greater than nuclear saturation density, while maintaining low temperatures and large asymmetries between neutrons and protons. Neutron stars, therefore, provide a unique laboratory for testing physics in environments that cannot be recreated on Earth. To uncover the highly uncertain nature of cold, ultra-dense matter, discovering and monitoring pulsars is essential, and the SKA will play a crucial role in this endeavour. In this paper, we will present the current state-of-the-art in dense matter physics and dense matter superfluidity, and discuss recent advances in measuring global neutron star properties (masses, moments of inertia, and maximum rotation frequencies) as well as non-global observables (pulsar glitches and free precession). We will specifically highlight how radio observations of isolated neutron stars and those in binaries -- such as those performed with the SKA in the near future -- inform our understanding of ultra-dense physics and address in detail how SKAO's telescopes unprecedented sensitivity, large-scale survey and sub-arraying capabilities will enable novel dense matter constraints. We will also address the potential impact of dark matter and modified gravity models on these constraints and emphasise the role of synergies between the SKA and other facilities, specifically X-ray telescopes and next-generation gravitational wave observatories.\n\n", "2512.16043": "2025-12-17, **Deconstructive Composite Dark Matter Detection**, Yilda Boukhtouchen et.al., [2512.16043v1](http://arxiv.org/abs/2512.16043v1)\n\n We investigate the detection of composite dark matter that disassembles into a cascade while crossing the Earth. This occurs for loosely bound composite dark matter, where the binding energy per constituent is small, such that scattering with Standard Model nuclei typically imparts enough energy to dissociate a constituent from its composite. Trajectories and cascade profiles are found for dissociated constituents that are further diverted by scattering through the Earth. Such scattering cascades are a common feature of TeV-scale weakly-interacting dark matter loosely bound in composites. We identify underground detector signatures of constituent cascades that depend on composite characteristics; these signatures include non-collinear multiple scatters in detectors, parameter-dependent timing separation of multiscatter events, and regions of parameter space where a dark matter cascade would leave a coincident signature in different underground laboratories.\n\n", "2512.15886": "2025-12-17, **Cored galaxies in cuspy dark matter halos**, Fernando Valenciano et.al., [2512.15886v1](http://arxiv.org/abs/2512.15886v1)\n\n We investigate constraints on the inner stellar density profile from photometric data of dwarf spheroidal and ultra-faint dwarf galaxies. Our aim is to clarify under what conditions cored stellar profiles require dark matter halos that are also cored, deviating from the cuspy profiles expected for cold dark matter halos. We consider a variety of spherically symmetric stellar profiles, which we classify as \"strong\" or \"weak\" cores and cusps according to the behavior of the slope ($b\\_0$) and logarithmic slope ($γ\\_0$) at their centers. We explore which profiles lead to unphysical negative distribution functions when embedded in a cuspy halo, treating isotropic and anisotropic kinematics separately. We find that weakly-cored stellar profiles in 3D (i.e., $b\\_0 \\neq 0$, $γ\\_0=0$) can be consistent with cuspy dark matter profiles, but strong 3D cores ($b\\_0=γ\\_0=0$) are not. However, both weak and strong 3D cores yield nearly indistinguishable inner profiles in projection, which implies that ruling out a dark matter cusp from photometric data alone is highly challenging. As an example, we study the profiles of ultra-faint dwarf galaxies and find that they are consistent with both weak and strong 3D cores. This is not just a result of the limited numbers of stars in these systems, since we reach the same conclusion even for Fornax, one of the most luminous and best-studied dwarf spheroidal companions of the Milky Way. We conclude that, based on current data and analysis techniques, cored surface density profiles in nearby dwarf galaxies cannot be taken as strong evidence against the presence of cuspy dark matter halos.\n\n", "2512.15883": "2025-12-17, **The AIDA-TNG project: abundance, radial distribution, and clustering properties of halos in alternative dark matter models**, Massimiliano Romanello et.al., [2512.15883v1](http://arxiv.org/abs/2512.15883v1)\n\n Warm and self-interactive dark matter cosmologies have been proposed as non-baryonic solutions to the tensions between the $Λ$ Cold Dark Matter model and observations at the kpc scale. In this paper, we use the dark matter-only runs of the \\textsc{aida-tng} project, a set of cosmological simulations of different sizes and resolutions, to analyze the macroscopic impact of alternative dark matter models on the abundance, the radial distribution and the clustering properties of halos. We adopt the halo occupation distribution formalism to characterize the evolution of its parameters $M\\_1$ and $α$ with the mass and redshift selection of our sample. By dividing the halo population into central and satellites, we are able to study their spatial density profile, finding that a Navarro-Frenk-White model is not accurate enough to describe the radial distribution of subhalos, and that a generalized Navarro-Frenk-White model is required instead. Warm dark matter models, in particular, present a cuspier distribution of satellites, whereas self-interacting dark matter exhibits a shallower density profile. Moreover, we find that the small-scale clustering of dark matter halos provides a powerful tool to discriminate between alternative dark matter scenarios, in preparation for a more detailed study that fully incorporates baryonic effects, and for a comparison with observational data from galaxy clustering.\n\n", "2512.15870": "2025-12-17, **Dark Acoustic Oscillations as an Early-Universe Explanation of the DESI Anomaly**, Mathias Garny et.al., [2512.15870v1](http://arxiv.org/abs/2512.15870v1)\n\n DESI DR2 data have been widely interpreted as evidence for late-time evolving dark energy (DE) with an apparent phantom crossing. Here we investigate an alternative explanation, based on early-Universe physics. If dark acoustic oscillations (DAO) are close in scale to baryon acoustic oscillations (BAO), they can bias the extraction of the BAO scale from the peak in the galaxy correlation function. This leads to an apparent shift in the inferred distance if the superposition of BAO and DAO features is misinterpreted as being due to BAO only. Taking this shift into account, we find that a DAO with percent-level amplitude can reconcile DESI DR2 with Planck 2018 as well as Pantheon+ supernovae data, with fit improvement at a similar level as compared to evolving DE. Notably, a DAO feature with the required properties has been predicted in a previously proposed scenario that resolves the Hubble tension via a pre-recombination decoupling of dark matter and dark radiation (DRMD). The presence of a DAO feature close to the BAO peak can be scrutinized with future full-shape galaxy clustering data from DESI and Euclid.\n\n", "2512.15869": "2025-12-17, **The AIDA-TNG project: dark matter profiles and concentrations in alternative dark matter models**, Giulia Despali et.al., [2512.15869v1](http://arxiv.org/abs/2512.15869v1)\n\n In the standard Cold Dark Matter (CDM) scenario, the density profiles of dark matter haloes are well described by analytical models linking their concentration to halo mass. Alternative scenarios, such as warm dark matter (WDM) and self-interacting dark matter (SIDM), modify the inner structure of haloes and predict different profile shapes and central slopes. We employ the AIDA-TNG simulations to investigate how alternative dark matter physics and baryonic processes jointly shape the internal structure of haloes. Using dark-matter-only and full-physics runs, we measure the dark matter density profiles of haloes spanning six orders of magnitude in mass, from 10^9.5 Msun to 10^14.5 Msub, and characterise them with multiple analytical models. We provide the distribution of the best-fitting parameters, as well as the concentration-mass relation in WDM and SIDM. The Einasto profile well reproduces the inner flattening produced in WDM models, both in the collisionless and in the full-physics runs. In SIDM dark-matter-only runs, haloes are better described by explicitly cored profiles, with core sizes that depend on mass and on the self-interaction model. When baryons are included, the differences between CDM and SIDM decrease, and such large dark-matter cores no longer form because adiabatic contraction in the baryon-dominated region counteracts self-interactions. Nevertheless, the coupling between baryons and self-interactions induces a broader range of inner slopes, including cases that are steeper than CDM at Milky Way masses. Alternative dark matter physics thus leaves clear signatures in the inner halo structure, even if baryons significantly reshape these differences. Our results are useful for future studies that need to predict the properties of haloes in multiple dark matter models.\n\n", "2512.15864": "2025-12-17, **Kination and the Inert Doublet Model**, Geneviève Bélanger et.al., [2512.15864v1](http://arxiv.org/abs/2512.15864v1)\n\n The inert doublet model is a two-Higgs-doublet extension of the standard model that provides a minimal and versatile framework for frozen-out dark matter. Assuming standard cosmology, if the dark matter mass ranges between approximately 120 GeV and 500 GeV then it turns out to be underabundant, as gauge interactions render its annihilation too efficient. In this work, we show that this mass window becomes allowed in cosmological scenarios where dark matter freeze-out occurs during a period with a stiff equation of state, $w > 1/3$, such as kination. This predictive setup satisfies all current experimental constraints while remaining within the reach of upcoming detection efforts.\n\n", "2512.15856": "2025-12-17, **The AIDA-TNG project: 3D halo shapes**, C. Giocoli et.al., [2512.15856v1](http://arxiv.org/abs/2512.15856v1)\n\n Context. The shapes of dark matter halos can be used to constrain the fundamental properties of dark matter. In standard Cold Dark Matter (CDM) cosmologies, halos are typically triaxial, with a preference for prolate configurations, particularly at low masses and high redshift. Aims. We focus on the characterization of total matter 3D shape in alternative dark matter models, such as Self-Interacting Dark Matter (SIDM) and Warm Dark Matter (WDM). These scenarios predict different structural properties due to collisional effects or the suppression of small-scale power. Methods. We measure the different halo component shapes - dark matter, stars and gas - at various radii from the center in the AIDA-TNG (Alternative Interacting Dark Matter and Astrophysics - TNG), which is a suite of high-resolution cosmological simulations built upon the IllustrisTNG framework. The intent is to systematically study how different dark matter models - specifically, SIDM and WDM - affect galaxy formation and the structure of dark matter halos, when realistic baryonic physics is also included. Results. SIDM models tend to produce rounder and more isotropic halos, especially in the inner regions, as a result of momentum exchange between dark matter particles. WDM halos are also slightly more spherical than their CDM counterparts, and are typically less concentrated. In all cases, the inclusion of self-consistent baryonic physics makes the central regions of all halos rounder, while still revealing clear distinctions among the various dark matter models. Conclusions. The general framework presented in this work, based on the 3D halo shape, can be useful to interpret multi-wavelength data analyses of galaxies and clusters.\n\n", "2512.15855": "2025-12-17, **Charged black holes in the 1/N expansion**, Georges Obied et.al., [2512.15855v1](http://arxiv.org/abs/2512.15855v1)\n\n We study some implications of $SU(N)\\times U(1)$ theories coupled to gravity in the large-$N$ limit. We find that in theories with quarks transforming as $q\\sim (\\mathbf{N},1)$, black holes (BH) with charge larger than a critical value approach extremality $(M\\_{\\rm BH}=\\sqrt{2} M\\_{\\rm Pl} Q\\_{\\rm BH})$ as they evaporate. This occurs because BHs in this theory can only lose charge by emitting baryons, a process suppressed by a combinatoric factor $e^{-N\\log N}$. Once extremality is reached the BH evolution halts for exponentially long times, $τ\\_{\\rm BH}\\gtrsim e^{N\\log N}$, without being protected by any symmetry. At times $t\\ggτ\\_{\\rm BH}$ the BH forms a cloud of deconfined quarks around it, a \\textit{quark corona}. The quarks are connected to the horizon by strings extending throughout distances that can be much larger than the inverse of the confinement scale, $Λ\\_N^{-1}$. Strikingly, due to energy conservation, these long strings cannot break even for light quarks. These effects can be further enhanced in clockwork-like theories based on Yang-Mills sectors of the type, $SU(N\\_1)\\times SU(N\\_2)\\times ...\\times U(1)$. As an application to phenomenology, we give examples where BHs as light as one gram survive until today without evaporating, opening up regions of parameter space for primordial BH dark matter previously excluded by Hawking evaporation. This result relies only on large-$N$ combinatorics and is independent of the radiation mechanism from the BH, particle masses, and confinement scale. The theories we discuss pass non-trivial tests imposed by Swampland conjectures, including completeness of the spectrum as well as the weak gravity conjecture.\n\n", "2512.15292": "2025-12-17, **Ultralight Dark Matter Constraints from NanoHertz Gravitational Waves**, Shreyas Tiruvaskar et.al., [2512.15292v2](http://arxiv.org/abs/2512.15292v2)\n\n We investigate the impact of ultralight dark matter (ULDM) on the mergers of supermassive black holes (SMBH) and the resulting stochastic gravitational wave background. ULDM is based on exceptionally light particles and yields galactic halos with dense central solitons. This increases the drag experienced by binary SMBH, decreasing merger times and potentially suppressing gravitational radiation from the binary at low frequencies. We develop semi-analytic models for the decay of SMBH binaries in ULDM halos and use current pulsar timing array (PTA) measurements to constrain the ULDM particle mass and its fractional contribution to the dark matter content of the universe. We find a median ULDM particle mass of $7. \\times 10^{-22}$ eV and show that scaling relations suggest that the drag remains effective at relatively low ULDM fractions, which are consistent with all other constraints on the model. Consequently, future pulsar timing measurements will be a sensitive probe of any ULDM contribution to the overall dark matter content of the universe.\n\n", "2512.15278": "2025-12-17, **The Direct Search Experiment for Light Dark Matter (DELight): Overview and Perspectives**, Melih Solmaz et.al., [2512.15278v1](http://arxiv.org/abs/2512.15278v1)\n\n Driven by the null results in the searches for dark matter, the field of direct dark matter detection is constantly evolving to push new frontiers. Ultimately, a vast parameter space for dark matter masses below a few GeV is yet to be explored. That said, low mass dark matter candidates necessitate novel detector designs with lower thresholds and alternative target materials. The Direct search Experiment for Light dark matter (DELight) will deploy a target of superfluid $^4$He instrumented with large area microcalorimeters (LAMCALs) based on magnetic microcalorimeter (MMC) technology in a setup optimized for low mass dark matter searches. This paper presents an overview of this novel upcoming experiment, including detection technology, sensitivity goals and R&D studies.\n\n", "2512.15096": "2025-12-17, **Cosmological Models with Symmetric Teleparallel Gravity and its Extension**, S. A. Narawade et.al., [2512.15096v1](http://arxiv.org/abs/2512.15096v1)\n\n This thesis investigates late-time cosmic acceleration using modified gravity theories with a focus on $f(Q)$ gravity, as an alternative to the $Λ$CDM model. The standard cosmological model attributes the acceleration to a cosmological constant, but it faces issues like the unexplained nature of dark matter and dark energy and discrepancies with certain observations. Modified gravity including $f(Q)$ gravity, offers a potential solution by incorporating dynamic dark energy or changes to gravitational interactions, avoiding the need for a constant cosmological term. Also, thesis evaluates the viability of $f(Q)$ gravity by analyzing observational data from Type Ia Supernovae, Hubble parameter measurements and other cosmological datasets. Using statistical tools like Markov Chain Monte Carlo (MCMC) analysis, this work constrains the parameters of $f(Q)$ gravity and compares it to the $Λ$CDM model.....\n\n", "2512.15073": "2025-12-17, **Dark matter in ALFALFA galaxies: Investigating galaxy-halo connection**, Meng Yang et.al., [2512.15073v1](http://arxiv.org/abs/2512.15073v1)\n\n This paper aims to investigate the galaxy-halo connection using a large sample of individual galaxies with $\\mathrm{H\\,I}$ integrated spectra. We determine their dark matter content by applying a dynamical method based on $\\mathrm{H\\,I}$ line widths measured with the curve-of-growth technique, together with inclination corrections inferred from optical images. We build a sample of 2453 gas-rich predominantly late-type galaxies spanning a stellar mass range of $10^{8.7}M\\_\\odot$ to $10^{11.4}M\\_\\odot$ by matching them one-to-one with their counterparts from the ALFALFA survey and the TNG100 simulation, ensuring a direct match of stellar mass and $\\mathrm{H\\,I}$ radius. We generate mock images and mock $\\mathrm{H\\,I}$ integrated spectra for TNG100 galaxies, and apply the same dynamical method to both ALFALFA and TNG100 mock galaxies to infer their dark matter masses. Across all stellar mass bins, ALFALFA galaxies exhibit lower median dark matter masses than the mock TNG100 simulation results. In each bin, this offset is driven by a tail of galaxies with comparatively low dark matter content, which becomes more prominent toward higher stellar masses. In the highest mass bin ($M\\_* > 10^{11} M\\_\\odot$), late-type ALFALFA galaxies show a median dark matter mass that is 23% lower than that of their counterparts in the TNG100 dark-matter-only simulation, with 32% of ALFALFA galaxies having $M\\_\\mathrm{DM}(<R\\_\\mathrm{HI})<10^{11.5} M\\_\\odot$, compared to 17% in the mock TNG100 sample. These results suggest that a larger fraction of massive late-type galaxies reside in relatively less massive dark matter haloes than predicted by the TNG100 simulation.\n\n"}, "supernova": {"2512.16801": "2025-12-18, **SNR 1987A : Spitzer data from days 6000 to 8000 revisited**, Patrice Bouchet et.al., [2512.16801v1](http://arxiv.org/abs/2512.16801v1)\n\n An excess emission has been observed by Spitzer in the [3, 5] micron range of the SNR 1987A spectrum. It is generally argued that this excess could be due to the presence of warm amorphous carbon dust in the equatorial ring (ER) around the supernova, but the proposed models all have problems. This prompted us to present an alternative view on the interpretation of the Spectral Energy Distribution (SED) of SNR 1987A from the near-IR wavelengths to the radio frequencies (from 3 micron up to 1.4 GHz), between 6000 and 8000 days after outburst. We argue that the origin of that excess could be attributed instead to a free-free emission. We show that under very specific conditions (the free-free is self-absorbed at a cut-off frequency imposed by the mass of the emitting region), it could be produced by collisional heating of the gas. We then discuss the time evolution of the various components of the SED. We establish a linear relationship between the growth of the warm carbon dust mass and that of the silicates dust during the analyzed period. Finally, we build the Spitzer light curves and we show that our models reproduce the observations pretty well, although our study clearly favors the free-free case. In conclusion, we argue that the free-free model provides a formally very good description of the data, however the model does require some very specific parameter choices, and results in an unusually low temperature for the ionized gas.\n\n", "2512.16591": "2025-12-18, **An effective $\\boldsymbolΛ$-Szekeres modelling of the local Universe with Cosmicflows-4**, Marco Galoppo et.al., [2512.16591v1](http://arxiv.org/abs/2512.16591v1)\n\n We develop an effective description of the local cosmic environment, namely, for redshift $z \\lesssim 0.1$, to quantify the bias induced by local structure on cosmological observables. Our approach models the metric of the nearby Universe as a superposition of multi-structured $Λ$-Szekeres patches, calibrated against the HAMLET peculiar velocity and density field reconstructions of Cosmicflows-4. From this framework we compute the fully inhomogeneous and anisotropic quasilocal expansion field predicted by our model, and use it to assess the impact of local structure on estimates of $H\\_0$. For this purpose we analyse low-redshift Type Ia supernovae from the Pantheon+ catalogue. We find that accounting for the local structure increases the Hubble tension, yielding a shift in the best-fit value of the Hubble constant of order $ΔH\\_0 \\approx 0.5\\ \\mathrm{km\\,s^{-1}Mpc^{-1}}$.\n\n", "2512.16404": "2025-12-18, **Implementing F (T ) Gravity in Boltzmann Codes: A Framework for Power Spectrum Computation**, Robert Rugg et.al., [2512.16404v1](http://arxiv.org/abs/2512.16404v1)\n\n This work investigates the nonlinearity of the power-law model of F(T) gravity, highlighting the inability of the Boltzmann solver CLASS to handle nonlinear models. As a workaround, a second-order Taylor expansion is applied to the nonlinear field equations, under the assumption that the extra degree of freedom n, which quantifies deviations from the currently favored cosmological model (ΛCDM), remains sufficiently small to preserve the key properties of the ΛCDM model. The validity of the Taylor expansion is supported by supernova data indicating n \\leq 0.05, for which the power spectrum can be accurately computed within CLASS with a negligible truncation error.\n\n", "2512.16253": "2025-12-18, **Gravitational wave interactions with a viscous fluid: Core collapse supernova, binary neutron star merger, and accretion around a black hole merger**, Nigel T. Bishop et.al., [2512.16253v1](http://arxiv.org/abs/2512.16253v1)\n\n The interaction of gravitational waves (GWs) with matter is normally treated as being insignificant. However, recent work has shown that the interaction with a viscous fluid may be astrophysically important when the distance between the matter and GW source is somewhat smaller than the GW wavelength. Previous work has mainly considered perturbations on a Minkowski background, and here these results are extended to the case that the background is a general, non-vacuum, static, spherically symmetric spacetime. Expressions are obtained for GW damping and the consequent heating of the fluid, and implemented in computer code. The results are applied to astrophysical scenarios: Core collapse supernovae, the post-merger signal from a binary neutron star merger, and matter accreting at a binary black hole merger. It is found that, compared to the Minkowski case, the damping and heating effects increase, in some cases by several orders of magnitude. It is possible for a GW signal to be completely damped, and for the heating to be such that a gamma-ray burst occurs.\n\n", "2512.16130": "2025-12-18, **Unraveling the anomaly in the production of $^{60}$Fe nucleus in massive stars**, Samapti Lakshan et.al., [2512.16130v1](http://arxiv.org/abs/2512.16130v1)\n\n The production of $^{60}$Fe is crucial for nucleosynthesis in massive stars and supernovae. In this work, by using the microscopic EP+IPM (exact pairing plus the independent-particle model) for the nuclear level density (NLD) and extended EP+PDM (exact pairing plus phonon damping model) for the $γ$-ray strength function (gSF), we re-evaluate the substantial enhancement of $^{60}$Fe production recently reported in {\\it A. Spyrou et al., Nat. Comm. {\\bf 15}, 9608 (2024)}, which was attributed to an unexpectedly large Maxwellian-averaged cross section (MACS). Our analysis demonstrates that this enhancement indeed originates from the choice of NLD, which, despite being constrained to reproduce the total NLD and gSF data, lacks a reliable spin dependence, a critical input for Hauser-Feshbach calculations of nuclear reaction rate. In contrast, our predictions yield a significantly lower MACS, calling the claimed enhancement into question. In particular, our approach highlights the microscopic nature of the low-energy enhancement of the gSF, the so-called upbend resonance, which arises from strong particle-particle ($pp$) and hole-hole ($hh$) excitations that emerge only at finite temperature, thereby further reinsisting on the invalidity of the Brink-Axel hypothesis in this low-energy region. Overall, our study reopens the question on the long-standing problem of $^{60}$Fe production in massive stars.\n\n", "2512.15902": "2025-12-17, **Dust evolution across cosmic times as seen through DUSTY-GAEA**, Omima Osman et.al., [2512.15902v1](http://arxiv.org/abs/2512.15902v1)\n\n For many decades, dust has been recognised as an important ingredient in galaxy formation and evolution. This paper presents a novel self-consistent implementation of dust formation by stars, destruction by supernova shocks and hot gas, and growth within the dense interstellar medium (ISM) in the GAEA state-of-the-art galaxy formation model. Our new model, DUSTY-GAEA, reproduces well the dust buildup as a function of stellar mass out to z $\\sim$ 6, the scaling relations between the dust-to-gas/dust-to-metal ratios and stellar mass/metallicty in the local Universe, and the dust mass function in the local Universe and out to z $\\sim$ 1. In the framework of our model, dust growth dominates the cosmic dust budget out to z $\\sim$ 8, and we find that observational constraints beyond the local Universe can be reproduced only assuming such efficient dust growth in the dense ISM. Yet, reproducing the estimated number densities of dust-rich galaxies at higher redshifts remains challenging, as found also in independent theoretical work. We discuss our model predictions in comparison with both observational data and independent theoretical efforts, and highlight how further observational constraints at high redshifts would help constrain dust models.\n\n", "2512.15870": "2025-12-17, **Dark Acoustic Oscillations as an Early-Universe Explanation of the DESI Anomaly**, Mathias Garny et.al., [2512.15870v1](http://arxiv.org/abs/2512.15870v1)\n\n DESI DR2 data have been widely interpreted as evidence for late-time evolving dark energy (DE) with an apparent phantom crossing. Here we investigate an alternative explanation, based on early-Universe physics. If dark acoustic oscillations (DAO) are close in scale to baryon acoustic oscillations (BAO), they can bias the extraction of the BAO scale from the peak in the galaxy correlation function. This leads to an apparent shift in the inferred distance if the superposition of BAO and DAO features is misinterpreted as being due to BAO only. Taking this shift into account, we find that a DAO with percent-level amplitude can reconcile DESI DR2 with Planck 2018 as well as Pantheon+ supernovae data, with fit improvement at a similar level as compared to evolving DE. Notably, a DAO feature with the required properties has been predicted in a previously proposed scenario that resolves the Hubble tension via a pre-recombination decoupling of dark matter and dark radiation (DRMD). The presence of a DAO feature close to the BAO peak can be scrutinized with future full-shape galaxy clustering data from DESI and Euclid.\n\n", "2512.15672": "2025-12-17, **Observational constraints on the spin/anisotropy of the CCOs of Cassiopeia A, Vela Jr. and G347.3-0.5 and a single surviving continuous gravitational wave candidate**, Jing Ming et.al., [2512.15672v1](http://arxiv.org/abs/2512.15672v1)\n\n We carry out the deepest and broadest search for continuous gravitational-wave signals with frequencies between 20-1500 Hz, from three neutron stars at the center of the supernova remnants Cassiopeia A, Vela Jr., and G347.3-0.5. This search was made possible by the computing power shared by thousands of Einstein@Home volunteers. After the initial Einstein@Home search, we perform a multi-stage follow-up of the most promising $\\approx$ 45 million signal candidates. In the last stages, we use independent data to further investigate the remaining candidates from the previous stages. We set the most stringent constraints to date on the gravitational-wave amplitude, equatorial ellipticity, r-mode saturation amplitude, and -- for the first time -- the neutron-star crustal anisotropy. For spin periods lower than 2 ms we constrain the ellipticity to be smaller than $4\\times 10^{-7}$ for all targets. We exclude the crustal anisotropy to be smaller than $5\\times 10^{-3}$ for spin periods between 1.3-100 ms. Only one candidate -- from the low frequency G347.3 search -- survives all follow-ups. We illustrate properties of this candidate. Investigations on new data will aid in clarifying its nature. Such ``new\" data exists and would be optimal for this purpose, but they are not publicly accessible at the time of writing.\n\n", "2512.15096": "2025-12-17, **Cosmological Models with Symmetric Teleparallel Gravity and its Extension**, S. A. Narawade et.al., [2512.15096v1](http://arxiv.org/abs/2512.15096v1)\n\n This thesis investigates late-time cosmic acceleration using modified gravity theories with a focus on $f(Q)$ gravity, as an alternative to the $Λ$CDM model. The standard cosmological model attributes the acceleration to a cosmological constant, but it faces issues like the unexplained nature of dark matter and dark energy and discrepancies with certain observations. Modified gravity including $f(Q)$ gravity, offers a potential solution by incorporating dynamic dark energy or changes to gravitational interactions, avoiding the need for a constant cosmological term. Also, thesis evaluates the viability of $f(Q)$ gravity by analyzing observational data from Type Ia Supernovae, Hubble parameter measurements and other cosmological datasets. Using statistical tools like Markov Chain Monte Carlo (MCMC) analysis, this work constrains the parameters of $f(Q)$ gravity and compares it to the $Λ$CDM model.....\n\n", "2512.15054": "2025-12-17, **A global view on star formation: The GLOSTAR Galactic plane survey XII. Effelsberg's continuum view and data release**, Y. Gong et.al., [2512.15054v1](http://arxiv.org/abs/2512.15054v1)\n\n Extended radio continuum emission and its linear polarization play a key role in probing large-scale structures of synchrotron and free-free emission in the Milky Way. Despite the existence of many radio continuum surveys, sensitive and high-angular-resolution single-dish surveys of extended radio continuum emission remain scarce. As part of the GLObal view of STAR formation (GLOSTAR) survey, we will also crucially complement the existing data from the Karl G. Jansky Very Large Array (VLA) by addressing the missing zero-spacing gap. Within the framework of the GLOSTAR Galactic plane survey, we performed large-scale radio continuum imaging observations toward the Galactic plane in the range $-2^{\\circ}< \\ell <60^{\\circ}$ and $\\|b\\|<1.1^{\\circ}$, as well as the Cygnus X region with the Effelsberg 100-m radio telescope. We present the Effelsberg continuum survey at 4.89GHz and 6.82GHz including linear polarization with angular resolutions of 145$^{\\prime\\prime}$ and 106$^{\\prime\\prime}$, respectively. The survey has been corrected for missing large-scale emission using available low-angular-resolution surveys. Comparison with previous single-dish surveys indicates that our continuum survey represents the highest-quality single-dish data collected to date at this frequency. More than 90\\% of the flux density missed by the VLA D-array data is effectively recovered by the Effelsberg continuum survey. The improved sensitivity and angular resolution of our survey enable reliable mapping of Galactic magnetic field structures, with polarization data that are less affected by depolarization than in previous surveys. The GLOSTAR single-dish continuum data will be released publicly, offering a valuable resource for studying extended objects including HII regions, supernova remnants, diffuse interstellar medium, and Galactic structure. (Abridged)\n\n"}}