{"neutrino": {"2403.17812": "2024-03-26, **Estimating the detection of antineutrinos in the future Brazilian neutron source**, Luiz Paulo de Oliveira et.al., [2403.17812v1](http://arxiv.org/abs/2403.17812v1)\n\n In line with the tradition of employing nuclear reactors for neutrino physics research, we present potential experiments that could be undertaken using the new Brazilian neutron source, the Brazilian Multipurpose Reactor (RMB). This upcoming facility has clearly defined objectives, including the production of radiopharmaceuticals for the healthcare system, material irradiation testing, and research using neutron beams to investigate the micro and mesostructures of various materials. However, we anticipate that the RMB will generate up to $15,500$ antineutrinos daily, potentially expanding the facility's scope to include neutrino physics experiments involving beta and inverse beta reactions. The modern operational conditions of the RMB and its location in the Iper\\'o-Brazil region may also enable neutrino oscillation experiments and the determination of the $\\theta\\_{13}$ parameter, as well as support safeguards activities by the International Atomic Energy Agency (IAEA), allowing for the monitoring of nuclear fuel burning cycles and isotope fractions. We discuss the potential utilization of the RMB as an antineutrino source, proposing experiments and addressing associated technical limitations.\n\n", "2403.17743": "2024-03-26, **Low-energy elastic (anti)neutrino-nucleon scattering in covariant baryon chiral perturbation theory**, Jin-Man Chen et.al., [2403.17743v1](http://arxiv.org/abs/2403.17743v1)\n\n The low-energy antineutrino- and neutrino-nucleon neutral current elastic scattering is studied within the framework of the relativistic SU(2) baryon chiral perturbation theory up to the order of $\\mathcal{O}(p^3)$. We have derived the model-independent hadronic amplitudes and extracted the form factors from them. It is found that differential cross sections ${{\\rm d} \\sigma}/{{\\rm d} Q^2}$ for the processes of (anti)neutrino-proton scattering are in good agreement with the existing MiniBooNE data in the $Q^2$ region $[0.13,0.20]$ GeV$^2$, where nuclear effects are expected to be negligible. For $Q^2\\leq 0.13$ GeV$^2$, large deviation is observed, which is mainly owing to the sizeable Pauli blocking effect. Comparisons with the simulation data produced by the NuWro and GIENE Mento Carlo events generators are also discussed. The chiral results obtained in this work can be utilized as inputs in various nuclear models to achieve the goal of precise determination of the strangeness axial vector form factor, in particular when the low-energy MicroBooNE data are available in the near future.\n\n", "2403.17739": "2024-03-26, **The Unified Era: An understanding journey from observations to the Unified Model of Active Galactic Nuclei**, Leonardo de Lima Santos et.al., [2403.17739v1](http://arxiv.org/abs/2403.17739v1)\n\n The Unified Model of Active Galactic Nuclei (UMAGN) is a comprehensive theoretical framework aimed at elucidating the diverse observations of AGN, encompassing quasars and Seyfert galaxies. The Model attributes the observed variations to different orientations of a surrounding matter disk around a supermassive black hole (SMBH), with the primary factor influencing observational diversity being the alignment of the AGN with the observer's line of sight. We present a comprehensive overview of the observational evidence, empirical and theoretical research, tracing key milestones that led to a unified perspective. We encapsulate the scientific journey culminating in the proposal of the UMAGN, including insights into the accretion disk, torus, and relativistic jet, and emphasize the properties of objects within UMAGN. Additionally, we underscore recent progress in multimessenger research involving electromagnetic waves, gravitational waves, astroparticles, and neutrinos, notably through collaborations such as the Event Horizon Telescope, LIGO/Virgo, IceCube, Pierre Auger, and KM3Net. We argue that these advancements present opportunities to enhance and refine UMAGN, contributing to a deeper understanding of AGNs and their implications for the formation and evolution of galaxies. The convergence of observational and theoretical research, coupled with emerging multimessenger techniques, paves the way for further strides in comprehending these enigmatic cosmic phenomena.\n\n", "2403.17722": "2024-03-26, **Nuclear matrix elements of neutrinoless double-beta decay in covariant density functional theory with different mechanisms**, C. R. Ding et.al., [2403.17722v1](http://arxiv.org/abs/2403.17722v1)\n\n Nuclear matrix elements (NMEs) for neutrinoless double-beta ($0\\nu\\beta\\beta$) decay in candidate nuclei play a crucial role in interpreting results from current experiments and in designing future ones. Accurate NME values serve as important nuclear inputs for constraining parameters in new physics, such as neutrino mass and the Wilson coefficients of lepton-number-violating (LNV) operators. In this study, we present a comprehensive calculation of NMEs for $0\\nu\\beta\\beta$ decay in $^{76}$Ge, $^{82}$Se, $^{100}$Mo, $^{130}$Te, and $^{136}$Xe, using nuclear wave functions obtained from multi-reference covariant density functional theory (MR-CDFT). We employ three types of transition potentials at the leading order in chiral effective field theory. Our results, along with recent data, are utilized to constrain the coefficients of LNV operators. We find that NMEs for the standard and short-range mechanisms are significantly larger than those for the non-standard long-range mechanism. The use of NMEs from various nuclear models does not notably change the parameter space intervals for the coefficients, although MR-CDFT yields the most stringent constraint. Furthermore, our NMEs can also be used to perform a more comprehensive analysis with multiple isotopes.\n\n", "2403.17488": "2024-03-26, **Dynamical origin of neutrino masses and dark matter from a new confining sector**, Maximilian Berbig et.al., [2403.17488v1](http://arxiv.org/abs/2403.17488v1)\n\n A dynamical mechanism, based on a confining non-abelian dark symmetry, which generates Majorana masses for hypercharge-less fermions, is proposed. We apply it to the inverse seesaw scenario, which allows to generate light neutrino masses from the interplay of TeV-scale Pseudo-Dirac mass terms and a small explicit breaking of lepton number. A single generation of vector-like dark quarks, transforming under a $\\text{SU}(3)\\_\\text{D}$ gauge symmetry, is coupled to a real singlet scalar, which serves as a portal between the dark quark condensate and three generations of heavy sterile neutrinos. Such a dark sector and the Standard Model (SM) are kept in thermal equilibrium with each other via sizeable Yukawa couplings to the heavy neutrinos. In this framework the lightest dark baryon, which has spin $3/2$ and is stabilized at the renormalizable level by an accidental dark baryon number symmetry, can account for the observed relic density via thermal freeze-out from annihilations into the lightest dark mesons. These mesons in turn decay to heavy neutrinos, which produce SM final states upon decay. This model may be probed by next generation neutrino telescopes via neutrino lines produced from dark matter annihilations.\n\n", "2403.17269": "2024-03-25, **Robust integration of fast flavor conversions in classical neutrino transport**, Zewei Xiong et.al., [2403.17269v1](http://arxiv.org/abs/2403.17269v1)\n\n The quantum kinetic evolution of neutrinos in dense environments, such as the core-collapse supernovae or the neutron star mergers, can result in fast flavor conversion (FFC), presenting a significant challenge to achieving robust astrophysical modeling of these systems. Recent works that directly simulate the quantum kinetic transport of neutrinos in localized domains have suggested that the asymptotic outcome of FFCs can be modeled by simple analytical prescriptions. In this Letter, we incorporate the analytical prescriptions into global simulations that solve the classical neutrino transport equation including collisions and advection under spherical symmetry. We demonstrate excellent agreement between results obtained using this approach and those directly from the corresponding global quantum kinetic simulations. In particular, this effective method can also precisely capture the collisional feedback effect for cases where the FFC happens inside the neutrinosphere. Our work highlights that a robust integration of FFCs in classical neutrino transport used in astrophysical simulation can be feasible.\n\n", "2403.17228": "2024-03-25, **The role of the Look Elsewhere Effect in determining the significance of an oscillation disappearance search for a light sterile neutrino**, Gioacchino Ranucci et.al., [2403.17228v1](http://arxiv.org/abs/2403.17228v1)\n\n In the ongoing vibrant experimental quest to assess whether the numerous indications for a light sterile neutrino are only experimental fluctuations or the manifestations of a profound and real underlying effect, one aspect which has recently attracted a specific interest is the statistical treatment of the data. Especially in cases of supposed positive hints, the correct statistical assessment of their significance is of paramount importance, to avoid that potential overstatements lead to a wrong understanding of the real status of the experimental investigation in the field. In this work I show how latest crucial advancements in the statistical data processing for the interpretation of the output of a sterile search can be effectively put and understood in the context of the Look Elsewhere Effect phenomenon, developed and now of routine usage for results interpretation in other areas of HEP research.\n\n", "2403.17197": "2024-03-25, **Loop Quantum Gravity effects on electromagnetic properties of charged leptons**, João Paulo S. Melo et.al., [2403.17197v1](http://arxiv.org/abs/2403.17197v1)\n\n The efforts in this contribution consist in reassessing a modified Dirac equation that incorporates a $\\gamma^0 \\gamma\\_5$-Lorentz-symmetry violating (LSV) term induced as a Loop Quantum Gravity (LQG) effect. Originally, this equation has been applied and considered as a good scenario for describing a number of investigations on the flight time of cosmic photons and neutrinos, which suggests that the speed of light in vacuum, in connection with the geometry that describes a granular space-time, takes an energy-dependent form, e.g., $v(E) =1 \\pm E/E\\_{\\tiny{\\textrm{LSV}}}$, with $E\\_{\\tiny{\\textrm{LSV}}} \\approx 6,5 \\times 10^{17}$ GeV for neutrinos. Once LQG provides a viable way to consistently understand this picture, we pursue an analysis of this effective Dirac equation to inspect some of its properties. These include: the derivation of the modified fermionic propagator, attainment of the Gordon decomposition of the vector current with minimal electromagnetic coupling to obtain information on the form factors, examination of the non-relativistic limit of the equation, evaluation of the spin- and velocity-dependent corrections to the Coulomb potential due to LQG effects, and the modified Hamiltonian in the low-relativistic regime. The study of the form factors may open up paths to set up bounds on the LQG parameters from the precision measurements of electromagnetic attributes of the charged leptons, such as their respective electric and magnetic dipole moments.\n\n", "2403.17144": "2024-03-25, **Majorana Neutrinos and Dark Matter from Anomaly Cancellation**, Hridoy Debnath et.al., [2403.17144v1](http://arxiv.org/abs/2403.17144v1)\n\n We discuss a simple theory for neutrino masses where the total lepton number is a local gauge symmetry spontaneously broken below the multi-TeV scale. In this context, the neutrino masses are generated through the canonical seesaw mechanism and a Majorana dark matter candidate is predicted from anomaly cancellation. We discuss in great detail the dark matter annihilation channels and find out the upper bound on the symmetry breaking scale using the cosmological bounds on the relic density. Since in this context the dark matter candidate has suppressed couplings to the Standard Model quarks, one can satisfy the direct detection bounds even if the dark matter mass is close to the electroweak scale. This theory predicts a light pseudo-Nambu-Goldstone boson (the Majoron) associated to the mechanism of neutrino mass. We discuss briefly the properties of the Majoron and the impact of the Big Bang Nucleosynthesis bounds.\n\n", "2403.16949": "2024-03-25, **Beyond-$Λ$CDM Cosmologies with Bayesian Neural Networks II: Massive Neutrinos, Baryonic Feedback, and the Theoretical Error**, L. Thummel et.al., [2403.16949v1](http://arxiv.org/abs/2403.16949v1)\n\n We study the capacity of Bayesian Neural Networks (BNNs) to detect new physics in the dark matter power spectrum. As in previous studies, the Bayesian Cosmological Network (BaCoN) classifies spectra into one of 5 classes: $\\Lambda$CDM, $f(R)$, $w$CDM, Dvali-Gabadaze-Porrati (DGP) gravity and a 'random' class, with this work extending it to include the effects of massive neutrinos and baryonic feedback. We further develop the treatment of theoretical errors in BaCoN-II, investigating several approaches and identifying the one that best allows the trained network to generalise to other power spectrum modelling prescriptions. In particular, we compare power spectra data produced by EuclidEmulator2, HMcode and halofit, all supplemented with the halo model reaction to model beyond-$\\Lambda$CDM physics. We investigate BNN-classifiers trained on these sets of spectra, adding in Stage-IV survey noise and various theoretical error models. Using our optimal theoretical error model, our fiducial classifier achieves a total classification accuracy of $\\sim$ 95% when it is trained on EuclidEmulator2-based spectra with modification parameters drawn from a Gaussian distribution centred around $\\Lambda$CDM ($f(R)$: $\\sigma\\_{fR0} = 10^{-5.5}$, DGP: $\\sigma\\_{r\\mathrm{c}} = 0.173$, $w$CDM: $\\sigma\\_{w0} = 0.097$, $\\sigma\\_{wa}=0.32$). This strengthens the promise of this method to glean the maximal amount of unbiased gravitational and cosmological information from forthcoming Stage-IV galaxy surveys.\n\n", "2403.16884": "2024-03-25, **NMSSM with correct relic density and an additional 95 GeV Higgs boson**, Ulrich Ellwanger et.al., [2403.16884v1](http://arxiv.org/abs/2403.16884v1)\n\n We investigate whether it is possible within the NMSSM to describe simultaneously a correct dark matter relic density complying with the latest null results from the LZ experiment, an extra Higgs boson with a mass of ~95 GeV visible in the bb channel at LEP and the diphoton channel at the LHC, and the deviation of the anomalous magnetic moment of the muon from its value within the Standard Model. We find that this is still possible for a variety of dark matter annihilation mechanisms, for singlino-like but also bino-like lightest supersymmetric particles. We show the signal rates of the extra Higgs boson and the dark matter detection rates as function of the dark matter mass and annihilation mechanism. The dark matter direct detection cross section may well fall below the neutrino floor. The masses of the lightest electroweakly interacting supersymmetric particles are typically not far above 100 GeV, but not excluded due to unconventional decays.\n\n", "2403.16856": "2024-03-25, **Contribution of neutrino-dominated accretion flows to cosmic MeV neutrino background**, Yun-Feng Wei et.al., [2403.16856v1](http://arxiv.org/abs/2403.16856v1)\n\n Neutrino-dominated accretion flows (NDAFs) are one of the important MeV neutrino sources and significantly contribute to the cosmic diffuse neutrino background. In this paper, we investigate the spectrum of diffuse NDAF neutrino background (DNNB) by fully considering the effects of the progenitor properties and initial explosion energies based on core-collapse supernova (CCSN) simulations, and estimate the detectable event rate by Super-Kamiokande detector. We find that the predicted background neutrino flux is mainly determined by the typical CCSN initial explosion energy and progenitor metallicity. For the optimistic cases in which the typical initial explosion energy is low, the diffuse flux of DNNB is comparable to the diffuse supernova neutrino background, which might be detected by the upcoming larger neutrino detectors such as Hyper-Kamiokande, JUNO, and DUNE. Moreover, the strong outflows from NDAFs could dramatically decrease their contribution to the neutrino background.\n\n", "2403.16817": "2024-03-25, **Probing Neutrino Oscillations with Reactor Antineutrinos in JUNO**, Vanessa Cerrone et.al., [2403.16817v1](http://arxiv.org/abs/2403.16817v1)\n\n The Jiangmen Underground Neutrino Observatory (JUNO) is a multi-purpose neutrino experiment currently under construction in South China, in an underground laboratory with approximately 650 m of rock overburden (1800 m.w.e.). The detector consists of a 20 kton liquid scintillator target, contained inside a 35.4-meter-diameter spherical acrylic vessel. The central detector (CD) is equipped with 17,612 20-inch and 25,600 3-inch Photomultipliers Tubes (PMTs), providing more than 75% total photocathode coverage. JUNO's main goal is the determination of the neutrino mass ordering with reactor antineutrinos, emitted from two adjacent nuclear power plants on a ~52.5 km baseline from the experimental site. JUNO's strategic location at a baseline corresponding to the first solar oscillation maximum, where the kinematic phase $\\Delta\\_{21} \\simeq \\frac{\\pi}{2}$, grants it the unique capability to simultaneously probe the effects of oscillations on both solar and atmospheric scales; moreover, it stands out as the first experiment to address the unresolved NMO question through vacuum-dominant oscillations. The oscillated energy spectrum in JUNO changes subtly depending on the neutrino mass ordering, which manifests as an energy-dependent phase shift, thus providing sensitivity to this parameter. Furthermore, the unparalleled size and energy resolution will enable to achieve a sub-percent precision on three parameters: $\\Delta m\\_{21}^{2}$, $\\Delta m\\_{31}^{2}$, and $\\sin^2\\theta\\_{12}$. This contribution will focus on JUNO's oscillation physics potential with reactor antineutrinos, with a particular emphasis on its crucial role in inaugurating a new era of precision within the neutrino sector.\n\n", "2403.16650": "2024-03-25, **Probing Stellar Clusters from Gaia DR2 as Galactic PeVatrons: I -- Expected Gamma-ray and Neutrino Emission**, Alison M. W. Mitchell et.al., [2403.16650v1](http://arxiv.org/abs/2403.16650v1)\n\n Young & massive stellar clusters (SCs) are a potential source of galactic cosmic rays up to very high energies as a result of two possible acceleration scenarios. Collective stellar winds from massive member stars form a wind-blown bubble with a termination shock (TS) at which particle acceleration to PeV energies may occur. Furthermore, shock acceleration may occur at SNRs expanding inside the bubble. By applying a model of CR acceleration at both the wind TS and SNR shocks to catalogues of known SCs derived from Gaia DR2, we identify the most promising targets to search for evidence of PeVatron activity. Predictions for the secondary fluxes of gamma-ray and neutrino emission are derived based on particle acceleration at the collective wind TS and the subsequent hadronic interactions with the surrounding medium. Predictions from our modelling under baseline and optimistic scenarios are compared to data, finding consistent results. We estimate the detection prospects for future gamma-ray and neutrino experiments. We find that degree-scale angular sizes of the wind-blown bubbles are typical, that may pose a challenge for experimental detection. A shortlist of the most promising candidates is provided, with an anticipated flux range. Of order 10 SCs may be detectable with future facilities, and 1-5 could be currently operating as PeVatrons. Of these, three gamma-ray detected SCs have data within our predicted range. Our model can consistently describe gamma-ray measurements of SC emission. Several further as-yet-undetected SCs offer promising targets for future observations, although the flux range allowed by our model can be large (> factor 10). The large angular size of the wind-blown bubble may lead to low surface brightness emission, worsening the problem of source confusion. Nevertheless, we discuss how further work will help to constrain SCs as PeVatron candidates. (abridged)\n\n", "2403.16611": "2024-03-25, **Investigating the impact of the modeling of Earth structure on the neutrino propagation at ultra-high-energies**, Reinaldo Francener et.al., [2403.16611v1](http://arxiv.org/abs/2403.16611v1)\n\n The flux of atmospheric and astrophysical neutrinos measured in UHE neutrino detectors is strongly dependent on the description of the propagation and absorption of the neutrinos during the passage through Earth to the detector. In particular, the attenuation of the incident neutrino flux depends on the details of the matter structure between the source and the detector. In this paper, we will investigate the impact of different descriptions for the density profile of Earth on the transmission coefficient, defined as the ratio between the flux measured in the detector and the incoming neutrino flux. We will consider five different models for the Earth's density profile and estimate how these different models modify the target column density and transmission coefficients for different flavors. The results are derived by solving the cascade equations taking into account the NC interactions and tau regeneration. A comparison with approximated solutions is also presented. Our results indicated that the predictions are sensitive to the model considered for the density profile, with the simplified three layer model providing a satisfactory description when compared with the PREM results.\n\n"}, "dark matter": {"2403.17890": "2024-03-26, **Searching for large dark matter clumps using the Galileo Satnav clock variations**, Bruno Bertrand et.al., [2403.17890v1](http://arxiv.org/abs/2403.17890v1)\n\n This study presents bounds on transient variations of fundamental constants, with typical timescales ranging from minutes to months, using clocks in space. The underlying phenomenology describing such transient variations relies on models for Dark Matter (DM) which suggest possible encounters of macroscopic compact objects with the Earth, due to the motion of the solar system in the galactic halo. If such compact objects possess an effective feeble interaction with the ordinary matter beyond the gravitational one, it may result in effective transient variations of fundamental constants. Such variations leave signatures on clocks onboard GNSS satellites. In this paper, we introduce a phenomenological study dedicated to the search for such DM transient objects using the network of passive hydrogen masers (H-Masers) onboard Galileo satellites. We first model the signature of transient variations of fundamental constants as a frequency modulation in the difference between two satellite clocks, considering the satellite trajectories relative to the transient event. Then, we present first results based on a fast analysis method, the maximum reach analysis. The main result is a significant extension of the discovery range for DM transients, with a sensitivity never achieved before. We investigate indeed the range of transient sizes from $10^5$ to $10^9$ kilometres, which, apart from indirect and model-dependent non-transient effects, has never been explored previously.\n\n", "2403.17697": "2024-03-26, **Cosmology of axion dark matter**, Ciaran A. J. O'Hare et.al., [2403.17697v1](http://arxiv.org/abs/2403.17697v1)\n\n I present an introduction and topical review on axions as a dark matter candidate. Emphasis is placed on issues surrounding the cosmology of axion dark matter that are relevant for present-day searches, including: early-Universe production mechanisms, predictions of the axion mass, bounds on axion properties derived from cosmological data, as well as the direct and indirect detection of relic axion populations.\n\n", "2403.17657": "2024-03-26, **Constraining Primordial Non-Gaussianity from Large Scale Structure with the Wavelet Scattering Transform**, Matteo Peron et.al., [2403.17657v1](http://arxiv.org/abs/2403.17657v1)\n\n We investigate the Wavelet Scattering Transform (WST) as a tool for the study of Primordial non-Gaussianity (PNG) in Large Scale Structure (LSS), and compare its performance with that achievable via a joint analysis with power spectrum and bispectrum (P+B). We consider the three main primordial bispectrum shapes - local, equilateral and orthogonal - and produce Fisher forecast for the corresponding fNL amplitude parameters, jointly with standard cosmological parameters. We analyze simulations from the publicly available \"Quijote\" and \"Quijote-png\" N-body suites, studying both the dark matter and halo fields. We find that the WST outperforms the power spectrum alone on all parameters, both on the fNL's and on cosmological ones. In particular, on fNL\\_loc for halos, the improvement is about 27%. When B is combined with P, halo constraints from WST are weaker for fNL\\_loc (at ~ 15% level), but stronger for fNL\\_eq (~ 25%) and fNL\\_ortho (~ 28%). Our results show that WST, both alone and in combination with P+B, can improve the extraction of information on PNG from LSS data over the one attainable by a standard P+B analysis. Moreover, we identify a class of WST in which the origin of the extra information on PNG can be cleanly isolated.\n\n", "2403.17313": "2024-03-26, **The Physical Origin of the Mass-Size Relation and Its Scatter of Disk Galaxies**, Min Du et.al., [2403.17313v1](http://arxiv.org/abs/2403.17313v1)\n\n Utilizing a kinematic decomposition of simulated galaxies, we focus on galaxies with tiny kinematically inferred stellar halos, indicative of weak external influences. We investigate the intricate interplay between internal (natural) and external (nurture) processes in shaping the scaling relationships of specific angular momentum ($j\\_\\star$), stellar mass ($M\\_\\star$), and size of disk galaxies within the IllustrisTNG simulation. The correlation among mass, size, and angular momentum of galaxies is examined by comparing simulations with observations and the theoretical predictions of the exponential hypothesis. Galaxies with tiny stellar halos exhibit a large scatter in the $j\\_\\star$-$M\\_\\star$ relation, which suggests that it is inherently present in their initial conditions. The analysis reveals that the disks of these galaxies adhere to the exponential hypothesis, resulting in a tight fiducial $j\\_\\star$-$M\\_\\star$-scale length (size) relation that is qualitatively consistent with observations. The inherent scatter in $j\\_\\star$ provides a robust explanation for the mass-size relation and its substantial variability. Notably, galaxies that are moderately influenced by external processes closely adhere to a scaling relation akin to that of galaxies with tiny stellar halos. This result underscores the dominant role of internal processes in shaping the overall $j\\_\\star$-$M\\_\\star$ and mass-size relation, with external effects playing a relatively minor role in disk galaxies. Furthermore, the correlation between galaxy size and the virial radius of the dark matter halo exists but fails to provide strong evidence of the connection between galaxies and their parent dark matter halos.\n\n", "2403.17145": "2024-03-25, **Galaxy groups as the ultimate probe of AGN feedback**, Dominique Eckert et.al., [2403.17145v1](http://arxiv.org/abs/2403.17145v1)\n\n The co-evolution between supermassive black holes and their environment is most directly traced by the hot atmospheres of dark matter halos. Cooling of the hot atmosphere supplies the central regions with fresh gas, igniting active galactic nuclei (AGN) with long duty cycles. Outflows from the central engine tightly couple with the surrounding gaseous medium and provide the dominant heating source preventing runaway cooling. Every major modern hydrodynamical simulation suite now includes a prescription for AGN feedback to reproduce realistic populations of galaxies. However, the mechanisms governing the feeding/feedback cycle between the central black holes and their surrounding galaxies and halos are still poorly understood. Galaxy groups are uniquely suited to constrain the mechanisms governing the cooling-heating balance, as the energy supplied by the central AGN can exceed the gravitational binding energy of halo gas particles. Here we provide a brief overview of our knowledge of the impact of AGN on the hot atmospheres of galaxy groups, with a specific focus on the thermodynamic profiles of groups. We then present our on-going efforts to improve on the implementation of AGN feedback in galaxy evolution models by providing precise benchmarks on the properties of galaxy groups. We introduce the \\XMM~ Group AGN Project (X-GAP), a large program on \\XMM~ targeting a sample of 49 galaxy groups out to $R\\_{500c}$.\n\n", "2403.17044": "2024-03-25, **The Influence of Baryons on Low-mass Haloes**, Haonan Zheng et.al., [2403.17044v1](http://arxiv.org/abs/2403.17044v1)\n\n The Voids-within-Voids-within-Voids (VVV) project used dark-matter-only simulations to study the abundance and structure of dark matter haloes over the full mass range populated in the standard $\\Lambda\\mathrm{CDM}$ cosmology. Here we explore how baryonic effects modify these results for $z=0$ halo masses in the range $10^4$ to $10^7~\\mathrm{M\\_\\odot}$, below the threshold for galaxy formation. Our main study focuses on three simulations from identical initial conditions at $z=127$, one following dark matter only, one including non-radiative gas, and one additionally including the baryonic physics relevant in this halo mass range (cooling and photoheating). In the non-radiative simulation, above $10^{5.5}~\\mathrm{M\\_\\odot}$, halo abundance and internal structure are very similar to the dark-matter-only simulation, and the baryon to dark matter ratio is everywhere close to the cosmic value. At lower mass, this ratio drops and haloes are less concentrated and less massive in the non-radiative case. Test simulations at higher resolution show this to be mainly a resolution effect; the expected drop in baryon content due to residual pressure effects only becomes substantial for $z=0$ haloes below $\\sim 10^{2.7}~\\mathrm{M\\_\\odot}$. However, gas is heated by reionization at $z=6$ in our ``full physics'' run, and this results in almost complete expulsion of gas from all haloes in our simulated mass range. This suppresses the halo mass function by $\\sim 30 \\%$, lowers halo concentration, and consequently weakens the dark matter annihilation signal by $\\sim 40-60 \\%$.\n\n", "2403.16989": "2024-03-25, **Limits on Dark Matter Compact Objects implied by Supermagnified Stars in Lensing Clusters**, Claudi Vall Müller et.al., [2403.16989v1](http://arxiv.org/abs/2403.16989v1)\n\n Supermagnified stars are gravitationally lensed individual stars that are located close to a caustic of a lensing galaxy cluster, and have their flux magnified by a large enough factor (typically ~ 1000) to make them detectable with present telescopes. The maximum magnification is limited by microlensing caused by intracluster stars or other compact objects, which create a network of corrugated critical lines with an angular width proportional to the surface density of microlenses. We consider a set of 9 cases of supermagnified stars reported in the literature, and derive an upper limit on the surface density of compact objects, such as primordial black holes, that might be present as a fraction of the dark matter in addition to known intracluster stars. Any such additional compact objects would widen the corrugated critical line network and therefore the width of the distribution of supermagnified stars around the modeled critical lines of the lens. We find that any compact objects, including primordial black holes, with masses above $\\sim 10^{-6}\\, M\\_{\\odot}$ (for which the microcaustics are smaller than the typical angular size of supermagnified stars) cannot account for more than ~ 3% of the dark matter.\n\n", "2403.16963": "2024-03-25, **Constraining the history of reheating with the NANOGrav 15-year data**, Suvashis Maity et.al., [2403.16963v1](http://arxiv.org/abs/2403.16963v1)\n\n Over the last few years, primordial black holes (PBHs) have emerged as a strong candidate for cold dark matter. A significant number of PBHs are produced when the strength of the primordial scalar power spectrum is enhanced on small scales (compared to the COBE normalized values on large scales). Such primordial spectra also inevitably lead to strong amplification of the scalar-induced, secondary gravitational waves (GWs) at higher frequencies. The recent detection of the stochastic gravitational wave background (SGWB) by the pulsar timing arrays (PTAs) has opened up the possibility of directly probing the very early universe. Different studies have shown that, when PBHs are assumed to have been formed during the epoch of radiation domination, the mechanism for the amplification of the scalar-induced GWs that is required to explain the PTA data can overproduce the PBHs over some ranges of masses. In this work, we assume a specific functional form for the primordial scalar power spectrum and examine the production of PBHs and the scalar-induced secondary GWs during the phase of reheating, which precedes the standard epoch of radiation domination. Specifically, we account for the uncertainties in the conditions for the formation of PBHs and ensure that the extent of PBHs produced remains within the observational bounds. We find that the scalar-induced SGWB generated during a phase of reheating with a steeper equation of state (than that of radiation) fit the NANOGrav 15-year data with a stronger Bayesian evidence than the astrophysical scenario involving GWs produced by merging supermassive binary black holes.\n\n", "2403.16807": "2024-03-25, **A serendipitous discovery of HI-rich galaxy groups with MeerKAT**, M. Glowacki et.al., [2403.16807v1](http://arxiv.org/abs/2403.16807v1)\n\n We report on the serendipitous discovery of 49 HI-rich galaxies in a 2.3 hour Open Time observation with MeerKAT. We present their properties including their HI masses, intensity and velocity maps, and spectra. We determine that at least three HI-rich galaxy groups have been detected, potentially as part of a supergroup. Some members of these galaxy groups show clear interaction with each other in their HI emission. We cross-match the detections with PanSTARRS, WISE and GALEX, and obtain stellar masses and star formation rates. One source is found to be a potential OH megamaser, but further follow-up is required to confidently determine this. For 6 sources with sufficient spatial resolution in HI we produce rotation curves with BBarolo, generate mass models, and derive a dark matter halo mass. While the number of galaxies detected in this relatively short pointing appears to be at the high end of expectations compared to other MeerKAT observations and group HIMF studies, this finding highlights the capability of MeerKAT for other serendipitous discoveries, and the potential for many more HI-rich galaxies to be revealed within both existing and upcoming Open Time datasets.\n\n", "2403.16754": "2024-03-25, **Radial Acceleration Relation of HI-rich Low Surface Brightness Galaxies**, Zi-chen Hua et.al., [2403.16754v1](http://arxiv.org/abs/2403.16754v1)\n\n We investigate the radial acceleration relation (RAR) in low surface brightness galaxies selected from the Arecibo Legacy Fast ALFA survey. We find that the dynamical acceleration $g\\_{\\rm obs}$ and baryonic gravitational acceleration $g\\_{\\rm bar}$ of the HI-rich low surface brightness galaxies still follow the universal RAR of typical late-type galaxies. The universal RAR signifies a consistent correlation between the distribution of baryonic matter and dark matter across galaxies with diverse morphologies and properties. Our findings suggest that the matter distributions in low surface brightness galaxies may indeed resemble that of general late-type galaxies. This implies that low surface brightness galaxies may not originate from dark matter halos with lower densities; instead, they may originate from the dark matter halos with high spins or form through feedback processes.\n\n", "2403.16633": "2024-03-25, **SASHIMI-SIDM: Semi-analytical subhalo modelling for self-interacting dark matter at sub-galactic scales**, Shin'ichiro Ando et.al., [2403.16633v1](http://arxiv.org/abs/2403.16633v1)\n\n We combine the semi-analytical structure formation model, SASHIMI, which predicts subhalo populations in collisionless, cold dark matter (CDM), with a parametric model that maps CDM halos to self-interacting dark matter (SIDM) halos. The resulting model, SASHIMI-SIDM, generates SIDM subhalo populations down to sub-galactic mass scales, for an arbitrary input cross section, in minutes. We show that SASHIMI-SIDM agrees with SIDM subhalo populations from high-resolution cosmological zoom-in simulations in resolved regimes. Crucially, we predict that the fraction of core-collapsed subhalos peaks at a mass scale determined by the input SIDM cross section and decreases toward higher halo masses, consistent with the predictions of gravothermal models and cosmological simulations. For the first time, we also show that the core-collapsed fraction decreases toward lower halo masses; this result is uniquely enabled by our semi-analytical approach. As a proof of principle, we apply SASHIMI-SIDM to predict the boost to the local dark matter density and annihilation rate from core-collapsed SIDM subhalos, which can be enhanced relative to CDM by an order of magnitude for viable SIDM models. Thus, SASHIMI-SIDM provides an efficient and reliable tool for scanning SIDM parameter space and testing it with astrophysical observations. The code is publicly available at https://github.com/shinichiroando/sashimi-si.\n\n", "2403.16568": "2024-03-25, **Gravitational waves from domain wall collapses and dark matter in the SM with a complex scalar**, Hieu The Pham et.al., [2403.16568v1](http://arxiv.org/abs/2403.16568v1)\n\n We study domain wall induced by spontaneously broken $\\mathbb{Z}\\_2$ symmetry and its gravitational wave signature in the standard model with a complex scalar in connection with dark matter physics. In a minimal setup, a linear term of the singlet field is added to the scalar potential as an explicit $\\mathbb{Z}\\_2$ breaking term to make the domain wall unstable. We obtain its minimal size from cosmological constraints and show that the parameter space that can be probed by current and future pulsar time array experiments requires the vacuum expectation value of the singlet field to be greater than $\\mathcal{O}(10-100)$ TeV, along with a singlet-like Higgs mass of $\\mathcal{O}(1-100)$ TeV. However, such a region is severely restricted by the dark matter relic density, which places an upper bound on the singlet vacuum expectation value at approximately 200 TeV, and limits the dark matter mass to about half of the singlet-like Higgs boson mass.\n\n", "2403.16522": "2024-03-25, **Galactic dynamics in the presence of scalaron: A perspective from $\\boldsymbol{f(R)}$ gravity**, Gayatri Mohan et.al., [2403.16522v1](http://arxiv.org/abs/2403.16522v1)\n\n We consider $f(R)$ modified gravity with the chameleon mechanism as an alternative approach to address the dark matter issue on the galactic scale. Metric formalism of $f(R)$ theory is considered in this study. A mathematical transformation tool called conformal transformation which transforms the action from Jordan to Einstein frame is employed to simplify the fourth-order modified field equation and to describe the extra degree of freedom $f\\_R$ by using a minimally coupled scalar field (scalaron) showing the chameleonic character. Then, we examine the viability of a newly introduced $f(R)$ gravity model on behalf of the chameleonic behavior of the scalaron. The model analyzes this behavior of the scalaron successfully with the singularity correction. Further, we consider a test particle (star) in a static, spherically symmetric spacetime to investigate the importance of the scalaron in galactic dynamics. In the non-relativistic limit, the rotational velocity equation for the particle with scalaron contribution is derived. This contribution is found to be model dependent. We generate the rotation curves using the velocity equation and fit the predicted curves to observational data of a set of thirty seven sample galaxies of different categories. The curves are fitted based on two fitting parameters $M\\_0$ and $r\\_c$. The fitting shows good agreement of the prediction with the observed data.\n\n", "2403.17037": "2024-03-25, **Wormhole solutions under the effect of dark matter in $f(R,L_m)$ gravity**, Lakhan V. Jaybhaye et.al., [2403.17037v1](http://arxiv.org/abs/2403.17037v1)\n\n In the background of $f(R, L\\_m)$ gravity, this work investigates three distinct dark matter halo profiles to test the possibility of generalised wormhole geometry within the galactic halo regions. The current study aims to accomplish these goals by examining various dark matter profiles including Universal Rotation Curves (URC), Navarro-Frenk-White (NFW) model-I, and NFW model-II inside two distinct $f(R, L\\_m)$ gravity models. According to the $f(R, L\\_m) = \\frac{R}{2} + L\\_m^\\alpha$ model, the DM halo density profiles produce suitable shape functions that meet all the necessary requirements for exhibiting the wormhole geometries with appropriate choice of free parameters. In addition, to examine DM profiles under the $f(R, L\\_m) = \\frac{R}{2} + (1 + \\lambda R)L\\_m$ model, we consider a specific shape function. Further, we observed that the derived solution from both two models violates the null energy constraints, confirming that the DM supports wormholes to maintain in the galactic halo.\n\n", "2403.16454": "2024-03-25, **Photon orbits and phase transition for Letelier AdS black holes immersed in perfect fluid dark matter**, Ashima Sood et.al., [2403.16454v1](http://arxiv.org/abs/2403.16454v1)\n\n We obtain an exact solution of spherically symmetric Letelier AdS black holes immersed in perfect fluid dark matter (PFDM). Considering the cosmological constant as the positive pressure of the system and volume as its conjugate variable, we analyse the thermodynamics of our black holes in the extended phase space. Owing to the background clouds of strings parameter ($a$) and the parameter endowed with PFDM ($\\beta$), we analyse the Hawking temperature, entropy and specific heat. We also investigate the relationship between the photon sphere radius and the phase transition for the Letelier AdS black holes immersed in PFDM. Through the analysis, we find with a particular condition, there are non-monotonic behaviours between the photon sphere radius, the impact parameter, the PFDM parameter, temperature, and pressure. We can regard both the changes of photon sphere radius and impact parameter before and after phase transition as the order parameter; their critical exponents near the critical point are equal to the same value 1/2, just like ordinary thermal systems. These indicate that a universal relation of gravity may exist near the critical point for a black hole thermodynamic system.\n\n"}, "supernova": {"2403.17741": "2024-03-26, **The low multipoles in the Pantheon+SH0ES data**, Francesco Sorrenti et.al., [2403.17741v1](http://arxiv.org/abs/2403.17741v1)\n\n In previous work we have shown that the dipole in the low redshift supernovae of the Pantheon+SH0ES data does not agree with the one inferred from the velocity of the solar system as obtained from CMB data. We interpreted this as the presence of significant bulk velocities. In this paper we study the monopole, dipole and quadrupole in the Pantheon+SH0ES data. We find that in addition to the dipole also both, the monopole and the quadrupole are detected with high significance. They are of similar amplitudes as the bulk flow. While the monopole is only significant at very low redshift, the quadrupole even increases with redshift.\n\n", "2403.17335": "2024-03-26, **Cosmic-ray Acceleration in Core-Collapse Supernova Remnants with the Wind Termination Shock**, Shoma F. Kamijima et.al., [2403.17335v1](http://arxiv.org/abs/2403.17335v1)\n\n We investigate the attainable maximum energy of particles accelerated in the core-collapse supernova remnant (SNR) shock propagating in the free wind region with the Parker-spiral magnetic field, current sheet, and the wind termination shock (WTS) by using test particle simulations. This work focuses on Wolf-Rayet stars as progenitors. The magnetic field amplification in the free wind region (shock upstream region) is not considered in this work. Test particle simulations show that particles escaped from the core-collapse SNR reach and move along the WTS, and eventually return to the SNR shock from the poles or equator of the WTS. The particle attainable energy can be boosted by this cyclic motion between the SNR shock and WTS and can be larger than the particle energy that is limited by escape from the SNR shock. The particle energy limited by the cyclic motion between the SNR shock and WTS is about $10-100~{\\rm TeV}$. Thus, the core-collapse SNR without upstream magnetic field amplification can be the origin of the break around $10~{\\rm TeV}$ of the energy spectrum of observed cosmic ray protons and helium.\n\n", "2403.17198": "2024-03-25, **Runaway OB Stars in the Small Magellanic Cloud III. Updated Kinematics and Insights on Dynamical vs. Supernova Ejections**, Grant D. Phillips et.al., [2403.17198v1](http://arxiv.org/abs/2403.17198v1)\n\n We use the kinematics of field OB stars to estimate the frequencies of runaway stars generated by the dynamical ejection scenario (DES), the binary supernova scenario (BSS), and the combined two-step mechanism. We update the proper motions for field OB and OBe stars in the Small Magellanic Cloud (SMC) using Gaia DR3. Our sample now contains 336 stars from the Runaways and Isolated O-Type Star Spectroscopic Survey of the SMC (RIOTS4), and we update our algorithm to calculate more accurate velocities compared to those obtained previously from DR2. We find a decrease in median velocity from 39 to 29 km/s, implying that the proper motions from our previous work were systematically overestimated. We present the velocity distribution for OBe stars and quantitatively compare it to those of non-compact binaries and high-mass X-ray binaries. We confirm that OBe stars appear to be dominated by the BSS and are likely post-SN binary systems, further supporting the mass-transfer model to explain the origin of their emission-line disks. In contrast, normal OB stars may show a bimodal velocity distribution, as may be expected from different processes that occur with dynamical ejections. The kinematics of fast-rotating OB stars are similar to those of normal OB stars rather than OBe stars, suggesting that the origin of their high v\\_r*sin(i) is different from that of OBe stars. We update our model parameters describing the kinematic origins of the SMC field population, still confirming that for runaway stars, the DES mechanism dominates, and two-step ejections seem comparable in frequency to pure BSS ejections.\n\n", "2403.17053": "2024-03-25, **Supernova Remnant properties and Luminosity Functions in NGC 7793 using MUSE IFS**, Maria Kopsacheili et.al., [2403.17053v1](http://arxiv.org/abs/2403.17053v1)\n\n In this study we use MUSE Integral Field Spectroscopy (IFS), along with multi-line diagnostics, for the optical identification of Supernova Remnants (SNRs) in the galaxy NGC 7793. We find in total 238 SNR candidates, 225 of them new identifications, increasing significantly the number of known SNRs in this galaxy. The velocity dispersion of the candidate SNRs was calculated, giving a mean value of 27 $ km\\,s^{ -1} $. We construct the H$\\rm \\alpha$, [S II], [O III], and [S II] - H$\\rm \\alpha$ luminosity functions, and for the first time, the [N II], [N II] - H$\\rm \\alpha$, [N II] - [S II], [O III] - [S II], and [O III] - [N II] luminosity functions of the candidate SNRs. Shock models, along with the observed multi-line information were used, in order to estimate shock velocities. The $\\sim$ 65% of the SNRs present velocities < 300 $ km\\,s^{ -1} $. There is a clear correlation between shock velocity and [O III]/H$\\rm \\beta$ ratio, and a less clear but still evident correlation in the relation between shock velocity and the [S II]/H$\\rm \\alpha$, [N II]/H$\\rm \\alpha$ ratios. We also use the [S II]6716/31 ratio of the SNR candidates to calculate their post-shock density, assuming different temperatures. The median value of the density of our sample is $\\sim$ 80 $ cm^{ -3} $, for a temperature of T = $10^4\\,K$. No correlation between shock velocity and density, or density and SNRs with [S II]/H$\\rm \\alpha$ > 0.4 and [S II]/H$\\rm \\alpha$ < 0.4 is observed.\n\n", "2403.16944": "2024-03-25, **The Tarantula $-$ Revealed by X-rays (T-ReX)**, Leisa K. Townsley et.al., [2403.16944v1](http://arxiv.org/abs/2403.16944v1)\n\n The Tarantula Nebula (30 Doradus) is the most important star-forming complex in the Local Group, offering a microscope on starburst astrophysics. At its heart lies the exceptionally rich young stellar cluster R136, containing the most massive stars known. Stellar winds and supernovae have carved 30 Dor into an amazing display of arcs, pillars, and bubbles. We present first results and advanced data processing products from the 2-Ms Chandra X-ray Visionary Project, \"The Tarantula $-$ Revealed by X-rays\" (T-ReX). The 3615 point sources in the T-ReX catalog include massive stars, compact objects, binaries, bright pre-main-sequence stars and compact young stellar (sub)clusters in 30 Dor. After removing point sources and excluding the exceptionally bright supernova remnant N157B (30 Dor B), the global diffuse X-ray maps reveal hot plasma structures resolved at 1$-$10 pc scales, with an absorption-corrected total-band (0.5$-$7 keV) X-ray luminosity of $2.110\\times 10^{37}$ erg s$^{-1}$. Spatially-resolved spectral modeling provides evidence for emission lines enhanced by charge-exchange processes at the interfaces. We identify a candidate for the oldest X-ray pulsar detected to date in 30 Dor, PSR J0538-6902, inside a newly-resolved arctuate X-ray wind nebula, the Manta Ray. The long time baseline of T-ReX monitored dozens of massive stars, several showing periodic variability tied to binary orbital periods, and captured strong flares from at least three low-mass Galactic foreground stars.\n\n", "2403.16889": "2024-03-25, **Quantitative modelling of type Ia supernovae spectral time series: Constraining the explosion physics**, M. R. Magee et.al., [2403.16889v1](http://arxiv.org/abs/2403.16889v1)\n\n Multiple explosion mechanisms have been proposed to explain type Ia supernovae (SNe Ia). Through forward modelling, synthetic observables of explosion models can be directly compared to observations of SNe Ia to constrain the explosion physics. Due to the computational expense associated with multi-dimensional explosion and radiative transfer simulations however, empirical modelling tools have also been developed that allow for fast, customised modelling of individual SNe. Such tools have provided useful insights, but the subjective nature with which empirical modelling is performed makes it difficult to obtain robust constraints on the explosion physics or expand studies to large populations of objects. Machine learning accelerated tools have therefore begun to gain traction. In this paper, we present riddler, a framework for automated fitting of SNe Ia spectral sequences up to shortly after maximum light. We train a series of neural networks on realistic ejecta profiles predicted by the W7 and N100 explosion models to emulate full radiative transfer simulations and apply nested sampling to determine the best-fitting model parameters for multiple spectra of a given SN simultaneously. We show that riddler is able to accurately recover the parameters of input spectra and use it to fit observations of two well-studied SNe Ia. We also investigate the impact of different weighting schemes when performing quantitative spectral fitting. As spectroscopic samples of SNe Ia continue to grow, automated spectral fitting tools such as riddler will become increasingly important to maximise the physical constraints that can be gained in a quantitative and consistent manner.\n\n", "2403.16675": "2024-03-25, **Self-similar solutions in cylindrical magneto-hydrodynamic blast waves with energy injection at the centre**, Antoine Gintrand et.al., [2403.16675v1](http://arxiv.org/abs/2403.16675v1)\n\n The evolution of shocks induced by massive stars does not depend only on the ambient magnetic field strength, but also on its orientation. In the present work, the dynamics of a magnetized blast wave is investigated under the influence of both azimuthal and axial ambient magnetic fields. The blast wave is driven by a central source and forms a shell that results from the accumulation of interstellar matter behind the shock front. A similarity form of the ambient magnetic field and a cylindrical geometry of the blast wave are assumed to obtain self-similar solutions. The model is studied separately for both azimuthal and axial magnetic field and applied to stellar wind bubbles and supernova remnants respectively, using 1D numerical simulations. We found that the magnetized blast wave differs from the self-similar case without an ambient magnetic field. The forward shock front goes slower in the azimuthal case and faster in the axial one. For both tangential orientations, the thickness of the shell increases with the magnetic strength. In the azimuthal case, the thermal energy can be converted to magnetic energy near the inner boundary of the shell. Thus, the temperature drops and the magnetic field increases at the tangential discontinuity of the stellar wind bubble. In the axial case of a supernova remnant, the numerical solution al w ays follows a special curve in the parameter space given by the self-similar model.\n\n", "2403.16562": "2024-03-25, **Phantom scalar field cosmologies constrained by early cosmic measurements**, José Antonio Nájera et.al., [2403.16562v1](http://arxiv.org/abs/2403.16562v1)\n\n In this work, we explore new constraints on phantom scalar field cosmologies with a scalar field employing early times catalogues related to CMB measurements, along with the local standard observables, like Supernovae Type Ia (SNIa), $H(z)$ measurements (Cosmic Clocks), and Baryon Acoustic Oscillations (BAO) baselines. In particular, we studied a tracker phantom field with hyperbolic polar coordinates that have been proposed in the literature. The main goal is to obtain precise cosmological constraints for $H\\_0$ and $\\sigma\\_8$, in comparison to other constructions that present tension in early cosmological parameters. Our results show that phantom scalar field cosmologies have a reduced statistical tension on $H\\_0$ that it is less than 3$\\sigma$ using model-independent CMB catalogues as SPT-3G+WMAP9 and ACTPol DR-4+WMAP9 baselines. This suggests these models using a different phantom potential might address the Hubble constant problem and reduce the systematics involved.\n\n"}}