{"neutrino": {"2601.09644": "2026-01-14, **A New Constraint on the Optical Depth from the Reionization History Independent of CMB Large-Scale E-Mode Polarization**, Yuta Kageura et.al., [2601.09644v1](http://arxiv.org/abs/2601.09644v1)\n\n Recent studies report a mild discrepancy between baryon acoustic oscillation (BAO) and cosmic microwave background (CMB) measurements within the $Λ$CDM framework. This discrepancy could be explained if the optical depth $τ$ inferred from the CMB large-scale E-mode polarization is underestimated, which may be biased by foreground-subtraction or instrumental systematics. In this work, we present a determination of $τ$ independent of the large-scale E-mode polarization, using the latest measurements of the redshift evolution of the neutral hydrogen fraction $x\\_\\mathrm{HI}(z)$, which is constrained by Lyman-$α$ forest and damping-wing absorption measurements at $z\\sim5$-$14$, based on ground-based optical and JWST observations. Combining $x\\_\\mathrm{HI}(z)$ with the Planck CMB power spectra excluding the large-scale E-mode polarization, we obtain $τ=0.0552^{+0.0019}\\_{-0.0026}$, a stringent constraint consistent with the previous CMB results including the large-scale E-mode. We also evaluate a potential systematic error in our method associated with absorption modeling, obtaining $τ=0.0552^{+0.0075}\\_{-0.0049}$. Using this constraint on $τ$, we resolve the degeneracy in the $τ$-$Ω\\_m$ plane and find a $2.4σ$ tension with the DESI DR2 BAO results, thereby confirming the claimed mild discrepancy suggestive of physics beyond $Λ$CDM. Finally, we derive an upper limit on the sum of neutrino masses, $Σm\\_ν<0.0550\\,(0.0717)$ eV at the 95% (99%) confidence level. This limit favors the normal mass ordering and, when combined with the lower limits from neutrino oscillation experiments, yields a further constraint, $Σm\\_ν=0.0594\\_{-0.0007}^{+0.0113}$ eV. However, the cosmological upper limit and the oscillation-based lower limit show a mild $2.2σ$ tension, providing an independent indication of possible physics beyond $Λ$CDM.\n\n", "2601.09598": "2026-01-14, **New modular fixed point models and their phenomenological implications for JUNO, T2HK and DUNE**, Er-Hao Shang et.al., [2601.09598v1](http://arxiv.org/abs/2601.09598v1)\n\n We perform a general analysis of minimal modular fixed point models based on two right-handed neutrinos (2RHNs) and three modular fixed points, and find that the only viable possibilities are based on modular $S\\_4'$ and $A\\_5$ symmetry. Such models are highly predictive, with neutrino masses and the lepton mixing mixing matrix being fixed by three real parameters, as in the Littlest Seesaw Models. We perform an exhaustive scan over all possible models in this class and find many viable fixed points and modular form alignments, after confronting them with the latest neutrino oscillation global fits. The resulting models have the new feature that the two Dirac columns take more general forms than traditional Littlest Seesaw models, resulting in new sum rule relations between the solar and reactor angles, beyond those associated with TM1 (where the first column of the tri-bimaximal mixing matrix is preserved), which are compared to present and future projected JUNO results. We also compare the predictions of these models for the atmospheric angle and CP violating phase to current global fits and future T2HK and DUNE sensitivities.\n\n", "2601.09310": "2026-01-14, **Light neutrinophilic WIMP in the $U(1)_{\\rm B-L+xY}$ model**, Tatsuya Aonashi et.al., [2601.09310v1](http://arxiv.org/abs/2601.09310v1)\n\n Sub-GeV dark matter is an appealing thermal target because it can still be produced via the standard freeze-out mechanism; at such low masses, achieving freeze-out naturally points to the presence of a light mediator, which shifts the most promising discovery avenues from the energy frontier to the intensity frontier. Realizing this picture is nonetheless challenging, since CMB observations tightly constrain energy injection from dark-matter annihilation at recombination and therefore strongly disfavor simple $s$-wave annihilation into visible Standard-Model final states. In this work, we propose a concrete neutrinophilic framework for sub-GeV thermal dark matter (''light WIMPs'') based on an additional gauge symmetry $\\mathrm{U}(1)\\_{\\mathrm{B}-\\mathrm{L}+x\\mathrm{Y}}$; for an appropriate choice of $x$, the new gauge boson couples predominantly to dark matter and neutrinos while its couplings to charged leptons are suppressed, so that sub-GeV dark matter annihilates almost exclusively into neutrinos, with hadronic modes kinematically closed. We map the parameter space in which the observed relic abundance is reproduced via standard thermal freeze-out in a conventional cosmological history, and show that sizable regions remain viable after imposing current cosmological, indirect-detection, and terrestrial constraints; in part of the allowed parameter space, the dark matter also exhibits sufficiently large self-interactions to potentially alleviate small-scale structure tensions.\n\n", "2601.09224": "2026-01-14, **Spontaneous Cogensis by QCD axion in Type I Seesaw**, Eung Jin Chun et.al., [2601.09224v1](http://arxiv.org/abs/2601.09224v1)\n\n We propose a generic axion--driven cogenesis scenario in which both the baryon asymmetry and dark matter abundance originate from the kinetic misalignment. The framework unifies the Peccei--Quinn (PQ) mechanism with a Type--I seesaw sector, where Hubble--induced masses and higher-dimensional PQ--violating operators drive early--time axion rotation. Working within the DFSZ axion model augmented by heavy neutrinos, we identify the parametric window of right-handed neutrino masses, determined by its decay rate, and the range of Hubble scales compatible with successful cogenesis, while maintaining the axion solution to the strong CP problem and satisfying current limits on axion isocurvature perturbations. Our results establish kinetic axion misalignment as a robust and predictive mechanism for axion cogenesis, independent of the inflationary microphysics.\n\n", "2601.09095": "2026-01-14, **Heavy Neutrinos across the Electroweak-to-Multi-TeV Frontier via Novel ML-Enhanced Probes**, Yin-Fa Shen et.al., [2601.09095v1](http://arxiv.org/abs/2601.09095v1)\n\n We propose a new strategy to probe heavy neutrinos with non-universal fermion couplings at the Large Hadron Collider (LHC) using a novel production mechanism and machine-learning algorithms. Focusing on proton--proton collisions at $\\sqrt{s} = 13.6~\\mathrm{TeV}$, we investigate final states containing a charged lepton, missing transverse energy, and two jets. For heavy neutrino masses below $\\mathcal{O}(1~\\mathrm{TeV})$, production is dominated by the $s$ channel process. At higher masses, vector boson fusion becomes the dominant production mechanism, with cross sections that decrease slowly as the heavy neutrino mass increases. We simulate both signal and Standard Model background events and employ gradient-boosted decision trees to optimize event classification. Assuming an integrated luminosity of $3000~\\mathrm{fb^{-1}}$, expected for the high-luminosity, and considering realistic statistical and systematic uncertainties, we find that heavy neutrinos in the mass range $50~\\mathrm{GeV}$--$10~\\mathrm{TeV}$ can be probed with sensitivity to the mixing parameter $\\|V\\_{\\ell N}\\|^2$ spanning from $\\mathcal{O}(10^{-5})$ to 1. This approach enhances the discovery potential for heavy neutrinos and provides a complementary pathway to existing search strategies.\n\n", "2601.08934": "2026-01-13, **Hybrid-Contact Planar HPGe Process Vehicle Toward Ring-Contact Designs**, Kunming Dong et.al., [2601.08934v1](http://arxiv.org/abs/2601.08934v1)\n\n Rare-event searches including dark matter, coherent elastic neutrino--nucleus scattering (CE$ν$NS), and neutrinoless double-beta decay (0$νββ$) require high-purity germanium (HPGe) detectors with ultralow noise, stable backgrounds, and electrode geometries that can scale to larger single-crystal masses. Ring-contact (ring-and-groove) designs address scalability by shaping the electric field to preserve low-capacitance readout, but their nonplanar topology motivates a lithium-contact process that is compatible with conformal deposition and robust high-voltage operation. As a process demonstration toward future ring-contact prototypes, we fabricate and characterize a hybrid-contact planar HPGe device, KL01. Here, ``hybrid'' denotes an $n^{+}$ contact formed by an in-house lithium-suspension paint followed by controlled thermal diffusion, combined with an AJA-developed a-Ge/Al $p^{+}$ contact and a-Ge sidewall passivation. At 77~K the device exhibits pA-scale leakage current under kV bias, a depletion plateau near $V\\_{\\mathrm{dep}}\\approx 1300$~V, and energy resolutions of 1.57~keV FWHM at 59.5~keV and 2.57~keV FWHM at 662~keV. These results validate the compatibility of the paint-and-diffuse lithium process with thin-film a-Ge/Al contacts and establish a practical fabrication workflow to be extended to ring-and-groove electrodes for next-generation rare-event HPGe modules.\n\n", "2601.08898": "2026-01-13, **Particle mixing and quantum reference frames**, Antonio Capolupo et.al., [2601.08898v1](http://arxiv.org/abs/2601.08898v1)\n\n We discuss the role of quantum reference frames in providing a viable definition of rest frame for mixed particles. We then analyze the related concept of frame-dependent entanglement and its impact on the phenomenology of neutral mesons and neutrinos.\n\n", "2601.08532": "2026-01-13, **Enhanced Athermal Phonon Responsivity in a Kinetic Inductance Detector with Integrated Phonon Collectors**, Leonardo Pesce et.al., [2601.08532v1](http://arxiv.org/abs/2601.08532v1)\n\n Cryogenic phonon detectors are adopted in light dark matter searches and coherent elastic neutrino-nucleus scattering experiments as they can achieve low energy thresholds. The phonon mediated sensing of silicon particle absorbers has already been proved with Kinetic Inductance Detectors (KIDs), acting both as sensors and athermal phonon absorbers at the same time. In this work we present the design and the performance of an improved detector, where the KID acts only as sensor and is coupled to dedicated phonon collectors. The separation between the detector and the collectors increases the variation of the quasi-particle density within the device, thereby enhancing its responsivity. The meander of the KID is composed of a 77nm trilayer wire of Aluminum-Titanium-Aluminum, while the phonon collectors are made of a 100nm Aluminum layer and act as quasi-particles funnels. Inside the collectors, the absorbed athermal phonons generate quasi-particles which, after diffusion, are trapped in the lower-gap superconducting trilayer. The performance of this setup is compared to that of a standard phonon-mediated KID, showing an increase in responsivity by around a factor of five.\n\n", "2601.08269": "2026-01-13, **Bifurcated Impact of Neutrino Fast Flavor Conversion on Core-collapse Supernovae Informed by Multi-angle Neutrino Radiation Hydrodynamics**, Ryuichiro Akaho et.al., [2601.08269v1](http://arxiv.org/abs/2601.08269v1)\n\n In this {\\it Letter}, we present a compelling and robust argument for the roles of neutrino fast flavor conversion (FFC) in the explosion mechanism of core-collapse supernova (CCSN), combining the {\\it multi-angle} FFC subgrid model rooted in quantum kinetic theory with the multi-dimensional four-species Boltzmann neutrino radiation hydrodynamics. Employing various progenitor masses and the nuclear equations of states, we find that the effect of FFC on CCSN explosion is bifurcated depending on the progenitors. For the lowest-mass progenitor, FFC facilitates the shock revival and enhances the explosion energy, whereas for higher-mass progenitors its impact is inhibitory. We identify the mass accretion rate as the key determinant governing this bifurcation. When the mass accretion rate is low (high), the contribution of FFC to neutrino heating becomes positive (negative), because the heating efficiency enhancement via FFC-driven spectral hardening of electron-type neutrinos dominates over (is outweighed by) the concurrent reduction in neutrino luminosity. Our results further highlight the limitations of approximate neutrino transport, and demonstrate that a multi-angle treatment is essential for accurately capturing FFC effects; otherwise, FFCs are missed and even generated spuriously.\n\n", "2601.08221": "2026-01-13, **Energy and momentum dependence of the soft-axion interaction rate**, Killian Bouzoud et.al., [2601.08221v1](http://arxiv.org/abs/2601.08221v1)\n\n Axions coupled to thermal non-Abelian gauge fields may have cosmological significance. As the heat bath defines a frame, its influence depends separately on energy and momentum. A light-like momentum ($k \\approx ω$) is relevant for the axion contribution to the effective number of light neutrinos, $ΔN^{ }\\_\\mathrm{eff}$, whereas a vanishing momentum ($k=0$) plays a role for warm natural inflation or ultralight dark matter, and has been employed in lattice estimates (both classical and quantum-statistical) of the strong sphaleron rate. Focussing on soft energies ($α\\_\\mathrm{s}^{ }T \\ll ω\\ll πT$), we carry out an HTL computation to show how the domains $k=0$ and $k \\approx ω$ interpolate to each other. We then compare with lattice data at $k=0$, and connect our analysis to NLO computations at $k \\approx ω\\ge πT$. Assembling the current best input, we re-investigate light QCD axion decoupling dynamics at $T \\ge 200$ MeV, showing that efficient interactions in the ultrasoft domain increase $ΔN^{ }\\_\\mathrm{eff}$ from $\\sim 0.03$ to $\\sim 0.04$ at $f^{ }\\_a = 4\\times 10^8\\_{ }$ GeV.\n\n", "2601.08101": "2026-01-13, **Lepton Magnetic Moments: What They Tell Us**, Fred Jegerlehner et.al., [2601.08101v1](http://arxiv.org/abs/2601.08101v1)\n\n Recently, the exciting new Fermilab (FNAL) Muon g-2 measurement impressively confirmed the final Brookhaven (BNL) result from 2004, and with a result four times more precise, has launched a new serious attack on the Standard Model (SM). On the theoretical side, ab initio lattice QCD (LQCD) calculations of hadronic vacuum polarization have made remarkable progress. They are now the new standard for studying the leading non-perturbative contributions, which have previously hindered matching with the precision required for full exploitation of the experimental results. The lattice results affected both leading hadronic contributions the hadronic vacuum polarization (HVP) and the hadronic light-by-light (HLbL) contributions by increasing the previously generally accepted $e^+e^-$ to hadrons based dispersion relation results. The shifts reduced the discrepancy between theory and experiment, leaving nothing missing. One of the most prominent signs of Beyond the Standard Model (BSM) physics has disappeared: the SM appears validated more than ever, in agreement with what other searches at the Large Hadron Collider (LHC) at CERN tell us! A triumph of the SM, even though the SM cannot explain known cosmological puzzles like dark matter or baryogenesis, and why neutrino masses are so tiny, the absence of strong CP violation, for example. I also argue that the discrepancy between the data-driven dispersive result and the lattice QCD results for the hadronic vacuum polarization can be largely explained by correcting the $e^+e^-$ data for 'rho-gamma' mixing effects.\n\n"}, "dark matter": {"2601.09638": "2026-01-14, **Constraining axion-like dark matter with a radio-frequency atomic magnetometer**, A. Rigoulet et.al., [2601.09638v1](http://arxiv.org/abs/2601.09638v1)\n\n We report on a broadband search for axion-like-particle (ALP) interactions using a radio-frequency-operated $^{87}\\mathrm{Rb}$ atomic magnetometer. The instrument provides wide spectral coverage and sensitivity to an oscillating pseudomagnetic field that may be generated by the gradient coupling of the ALP field to the constituent fermions of atoms. We search for an ALP-gradient signature in the mass range $2.40\\times10^{-10}\\,\\mathrm{eV}/c^{2}$--$2.11\\times10^{-9}\\,\\mathrm{eV}/c^{2}$. No statistically significant signatures of an oscillating magnetic field are observed, and we derive upper limits on the corresponding ALP-proton, -neutron and -electron couplings, $g\\_{αpp}$, $g\\_{αnn}$ and $g\\_{αee}$, respectively. The result on $g\\_{αpp}$ improves over previous laboratory searches, while the limits on $g\\_{αnn}$ and $g\\_{αee}$ complement earlier laboratory searches and astrophysical bounds. The work extends searches for ALP-fermion interactions into a mass region largely unexplored in a dark-matter context, demonstrating the potential of our method for broadband axion-like particle searches targeting the Galactic dark-matter halo.\n\n", "2601.09403": "2026-01-14, **Collapse versus Disruption: The Fate of Compact Stellar Systems in Ultralight Dark Matter Halos**, Yu-Ming Yang et.al., [2601.09403v1](http://arxiv.org/abs/2601.09403v1)\n\n Interference of the ultralight dark matter (ULDM) field generates time-varying gravitational potential fluctuations, which stochastically heat stellar systems embedded in ULDM halos. Small-sized stellar systems are therefore often used to set stringent constraints on ULDM. However, the evolution of systems with sizes well below the ULDM de Broglie wavelength remains poorly explored. Using numerical simulations, we show that the evolution of compact stellar systems in ULDM halos is governed by the interplay between internal stellar relaxation and ULDM-induced heating. We find the following main results. First, in sufficiently compact systems, relaxation-driven core collapse dominates, allowing the system to remain bound and dense, while ULDM-induced stripping of outer stars further accelerates the collapse. Second, in more extended systems, ULDM heating dominates and ultimately disrupts the system. Near the disruption threshold, we identify systems resembling ultra-faint dwarfs like Segue 1. Third, we further introduce a dimensionless parameter to quantify the relative importance of heating and relaxation and finally lead to an evolutionary phase diagram. Our results reveal the rich and nontrivial dynamics of compact stellar systems in ULDM halos, indicating that precise system modeling is essential for robust ULDM constraints.\n\n", "2601.08943": "2026-01-13, **Bound Dark Energy: Particle Physics model in alignment with recent DESI cosmological measurements**, Axel de la Macorra et.al., [2601.08943v1](http://arxiv.org/abs/2601.08943v1)\n\n We present observational constraints on the Bound Dark Energy Cold Dark Matter (BDE-CDM) model using DESI DR2 baryon acoustic oscillation measurements combined with Planck CMB data and Type Ia supernovae compilations (PantheonPlus, Union3, DESY5). In BDE-CDM, dark energy originates from the lightest meson field within a supersymmetric SU(3) dark gauge group with $N\\_f = 6$ flavors, governed by an inverse power-law potential $V(φ) = Λ\\_{c}^{4+2/3} φ^{-2/3}$. Unlike $Λ$CDM and $w\\_0w\\_a$CDM, the dark energy sector contains no free parameters -- the condensation scale $Λ\\_c$ and transition epoch $a\\_c$ are determined by gauge coupling unification constraints. The equation of state evolves from relativistic behavior ($w = 1/3$) before condensation through a kinetic-dominated stiff phase ($w \\simeq 1$), approaching $w\\_0 = -0.9298 \\pm 0.0003$ at present, with $w > -1$ maintained throughout cosmic history, avoiding phantom-regime instabilities. We obtain $Λ\\_{c} = 43.93 \\pm 0.13$~eV and $a\\_c = (2.489 \\pm 0.007) \\times 10^{-6}$, consistent with theoretical predictions. The $w\\_0$-$w\\_a$ confidence contours are approximately 10,000 times smaller than those of $w\\_0w\\_a$CDM while achieving comparable fits, and remain stable across different supernova datasets. Statistical analysis yields $Δ\\mathrm{DIC} = -6.77$ and $Δ\\mathrm{AIC} = -8.97$ relative to $Λ$CDM for BAO+DESY5, constituting strong evidence favoring BDE-CDM model. The model predicts distinctive signatures including 25\\% enhancement in the matter power spectrum at $k \\approx 4.3\\,h\\,\\mathrm{Mpc}^{-1}$. These results establish BDE-CDM as a theoretically motivated framework that successfully addresses the DESI-observed preference for dynamical dark energy while connecting particle physics with cosmological observations.\n\n", "2601.08936": "2026-01-13, **A possible pathway to UHZ1-type systems at z~10 by heterogeneous mass primordial black holes as dark matter**, Alexander Kashlinsky et.al., [2601.08936v1](http://arxiv.org/abs/2601.08936v1)\n\n Recent space-based observations discovered several unusual objects, exhibiting similar properties, at redshifts $z\\gtrsim 10$. Among them is the UHZ1 system at $z=10.1$, containing $\\sim 10^8M\\_\\odot$ in stars, with a similarly massive central black hole of $\\sim 10^{7-8}M\\_\\odot$. Here we propose a possible mechanism for forming such systems which hinges on the presence of primordial black holes (PBHs) covering a range of masses while contributing a significant fraction of the dark matter (DM). We evaluate the accurate expression for the small-scale power responsible for the collapse of the first halos in the presence of the PBH population. The extra power in the matter density field, produced by the granulation term, will cause an earlier collapse of DM halos, populated by PBHs of different masses. In these collapsed and virialized systems the PBHs will undergo 2-body relaxation, driving the more massive PBHs to the halo center under dynamical friction. We quantify this evolution for a distribution of PBH orbital parameters and halo properties. The analysis shows that PBHs can have appropriate mass functions capable of producing systems with parameters similar to what is observed for UHZ1. We suggest that the proposed mechanism could account for a subset of other systems newly discovered with the JWST at high redshifts, including the Little Red Dots.\n\n", "2601.08907": "2026-01-13, **Dark Matter emission at Belle II and NA62 in Minimal Flavor Violation framework**, Federico Mescia et.al., [2601.08907v1](http://arxiv.org/abs/2601.08907v1)\n\n Minimal Flavor Violation (MFV) provides a compelling framework for exploring physics beyond the Standard Model, in which new QCD-singlet fields transforming under the global $\\mathrm{SU}(3)^3$ quark flavor symmetry can naturally be stable and act as dark matter (DM) candidates. We show that the DM-MFV framework naturally accommodates the excess in either $K^+ \\to π^+ ν\\barν$ or $B^+ \\to K^+ ν\\barν$, while a unified explanation of both channels simultaneously cannot be achieved within a minimal setup containing only a single dark matter multiplet with nearly degenerate masses. Overall, our findings underscore the intricate interplay between MFV-based model building, flavored dark matter scenarios, and precision flavor experiments, highlighting flavored dark matter as a framework that is both theoretically robust and experimentally testable.\n\n", "2601.08746": "2026-01-13, **Search for Cosmic Ray Electron Boosted Dark Matter with the CDEX-10 Experiment**, R. Xu et.al., [2601.08746v1](http://arxiv.org/abs/2601.08746v1)\n\n We present new constraints on the cosmic ray electron boosted light dark matter (CReDM) using the 205.4 kg$\\cdot$day data of the CDEX-10 experiment located at the China Jinping Underground Laboratory. The cosmic ray electron spectrum and distribution in the Galaxy are generated by the $\\tt GALPROP$ code package. In the calculation process of DM-electron scattering process in the Galaxy, we consider the energy-dependency of the DM-electron scattering cross section. The constraints on CReDM are set for both heavy and light mediator scenarios using the CDEX-10 dataset. The result exceeds previous Standard Halo Model (SHM) limits for DM mass lower than 0.6 MeV in heavy mediator case and corresponds to the best sensitivity among all direct detection experiments from 1 keV to 0.5 MeV in the light mediator scenario.\n\n", "2601.08675": "2026-01-13, **One-Loop Tensor Power Spectrum from a Non-Minimally Coupled Spectator Field during Inflation**, Zhe Li et.al., [2601.08675v1](http://arxiv.org/abs/2601.08675v1)\n\n We compute the full one-loop corrections to the primordial tensor power spectrum in an inflationary scenario with a non-minimally coupled spectator field, using the in-in formalism. We derive semi-analytic results for the scalar-sourced one-loop tensor spectrum and the effective tensor-to-scalar ratio, $r\\_{\\mathrm{eff}}$ . We consider two representative coupling functions: a localized Gaussian dip (Model G), which leads to moderate loop corrections, and a rapidly oscillatory coupling (Model O), which can yield much larger loop contributions. For Model G, we find a $\\mathcal{O}(1)$ correction to $r\\_{\\mathrm{eff}}$ while Model O can significantly enhance $r\\_{\\mathrm{eff}}$ by several orders of magnitude (relative to the tree-level value). We further calculate the energy density of primordial gravitational waves. Assuming that primordial black holes with mass $10^{-12}M\\_{\\odot}$ generated in this scenario, constitute all of the dark matter, we find that the results are several orders of magnitude lower than the sensitivities of Taiji/TianQin/LISA.\n\n", "2601.08496": "2026-01-13, **Design and construction of a cryogenic subcooler-box for supplying single phase supercritical helium to dark matter and gravitational wave experiments**, Udai Raj Singh et.al., [2601.08496v1](http://arxiv.org/abs/2601.08496v1)\n\n We report on the design, development, and installation of the ALPS Cryo-Platform Subcooler Box (ACPS), which is part of the cryogenic platform being established in the HERA North Hall at DESY to supply helium for cooling large-scale dark-matter and gravitational-wave experiments with very high heat loads. The ACPS is capable of subcooling supercritical helium supplied via the 1.6-km-long HERA transfer line by means of a pipe heat exchanger immersed in a subcooler bath filled with liquid helium produced through Joule-Thomson valves. It is also equipped with numerous cryogenic components, including control valves, flow meters, and safety valves, enabling experimental operation to be carried out directly by the ACPS itself and thereby reducing the cryogenic requirements imposed on the experiments. To support a wide range of experiments, the ACPS provides three transfer lines that deliver different levels of cooling power.\n\n", "2601.08197": "2026-01-13, **A natural explanation of the Galactic Magnetic Fields from multistate Scalar Field Dark Matter**, Maribel Hernández-Márquez et.al., [2601.08197v1](http://arxiv.org/abs/2601.08197v1)\n\n In this article, we investigate the possibility that the large-scale magnetic fields observed in galaxies, of the order of microgauss, arise naturally from a complex Scalar Field Dark Matter (SFDM) halo charged under a local $U(1)$ symmetry. Extending our previous work, where multistate SFDM solutions were shown to form ``gravitational atoms'' capable of explaining the anisotropic distribution of satellite galaxies (VPOS), we analyze here the coupled dynamics of the scalar and a gauge field at the perturbative level. By solving the perturbed Klein-Gordon and gauge-field equations, we find the temporal evolution and show that the spatial structure of the induced electromagnetic fields is governed by the same spherical Bessel functions and spherical harmonics that characterize the ground and excited states of the multi-state SFDM halo. Remarkably, the presence of the gauge field does not modify the dark-matter density distribution, which preserves the multi-state configuration previously obtained. Our results demonstrate that a charged multi-state SFDM halo can generate coherent, large-scale magnetic fields whose morphology is determined by the excited modes of the scalar field, providing a unified framework in which both galactic magnetic fields and VPOS-like structures originate from the underlying quantum nature of dark matter.\n\n", "2601.08090": "2026-01-13, **Measurement of the LCLS-II dark current using the LDMX Trigger Scintillator Prototype**, Elizabeth Berzin et.al., [2601.08090v1](http://arxiv.org/abs/2601.08090v1)\n\n The Light Dark Matter eXperiment (LDMX) is a proposed fixed-target missing momentum search for sub-GeV thermal relic dark matter. LDMX aims to probe thermal dark matter targets with 1016 electrons on target. Such an approach requires a high-repetition rate, low-current beam, with an average of one electron on target per event. These requirements are well-suited to the DArk Sector Experiments at LCLS-II (DASEL) facility, which will take advantage of the unused RF buckets between LCLS-II bunches to produce a well-defined low-current beam with a 26.9 ns bunch spacing. This document describes the results of a measurement of dark current in the Sector 30 transfer line (S30XL) of the LCLS-II beam, using a prototype of the LDMX trigger scintillator (TS) subsystem.\n\n"}, "supernova": {"2601.09552": "2026-01-14, **Blowouts of Nascent Wind Bubbles in Pulsar-Driven Supernovae**, Mingxi Chen et.al., [2601.09552v1](http://arxiv.org/abs/2601.09552v1)\n\n Formation of a rapidly spinning, strongly magnetized neutron star (NS) may occur in various classes of core-collapse events. If the NS injects an amount of energy comparable to the explosion energy of the accompanying supernova (SN) before the SN ejecta becomes transparent, the nascent NS wind bubble can overtake the outer ejecta and undergo a blowout driven by hydrodynamic instabilities. Based on multidimensional numerical studies, we construct a minimal semi-analytic framework to follow the post-blowout dynamics and radiative evolution, map the blowout conditions by scanning the ejecta and NS parameters, and compute survey-ready multi-band light curves. For stripped-envelope SNe with an ejecta mass of $M\\_\\mathrm{ej} \\sim 10\\,M\\_\\odot$ and an explosion energy of $E\\_\\mathrm{sn} \\sim 10^{51}\\,\\mathrm{erg}$, blowout occurs for NSs with magnetic field strengths of $B\\_{\\mathrm{dip}} \\gtrsim 10^{13}\\,\\mathrm{G}$ and spin periods of $P\\_\\mathrm{NS} \\lesssim \\mathrm{a\\ few}\\,\\mathrm{ms}$. Relatively weak-field cases with $B\\_\\mathrm{dip} \\lesssim 10^{14}\\,\\mathrm{G}$ produce luminous double-peaked UV/optical light curves, as observed in the superluminous SN LSQ14bdq, while stronger-field cases with $B\\_\\mathrm{dip} \\gtrsim 10^{14}\\,\\mathrm{G}$ result in hypernovae preceded by X-ray blowout precursors. We also examine weaker and lower-mass SN explosions representing ultra-stripped SNe and accretion- or merger-induced collapse events, in which blowout is more readily achieved over a broader range of NS parameters, producing fast X-ray transients with durations of $ 10^{2\\mbox{--}4}\\,\\mathrm{s}$ and peak luminosities of $10^{42\\mbox{--}48}\\,\\mathrm{erg\\,s^{-1}}$. Our results encourage coordinated UV, optical, and X-ray observations which constrain the formation of the most energetic NSs in the universe.\n\n", "2601.09429": "2026-01-14, **Probing dynamical embeddings in a five-dimensional spacetime in light of DESI BAO**, Abraão J. S. Capistrano et.al., [2601.09429v1](http://arxiv.org/abs/2601.09429v1)\n\n We here investigate the observational viability of Nash gravity as an alternative to the standard $Λ$CDM cosmology. Based on Nash's embedding theorem, the model introduces orthogonal perturbations via variations in the extrinsic curvature, generating scalar-type metric perturbations directly from geometry, without the need to introduce additional fields. We confront the model with current observational data, including Cosmic Microwave Background (CMB) measurements from Planck, Baryon Acoustic Oscillations (BAO) from DESI DR2, and recent Type Ia supernova (SN Ia) compilations. Our analysis shows that Nash gravity provides a good fit to the data, yielding a slightly higher value for the Hubble constant, $H\\_0 = 69.32 \\pm 0.72$ km/s/Mpc, compared to the $Λ$CDM model, thus offering a potential alleviation of the $H\\_0$ tension. Furthermore, the model naturally predicts a suppressed growth of structure, with $S\\_8 \\approx 0.76$ across various joint analyses, potentially alleviating the so-called $S\\_8$ tension, assuming that this discrepancy is not solely due to systematic effects in other independent measurements. In some cases, Nash gravity achieves a better fit to the data than the $Λ$CDM paradigm at the $2σ$ level.\n\n", "2601.09271": "2026-01-14, **Chiellini-Integrable Cosmologies with Phantom Divide Crossing**, Soumya Chakrabarti et.al., [2601.09271v1](http://arxiv.org/abs/2601.09271v1)\n\n We investigate exact cosmological solutions with a massive scalar field minimally coupled to the Einstein-Hilbert action in General Relativity. For an extended Higgs-like scalar self-interaction, we find that the resulting field equations belong to the damped Ermakov-Painlevé II class and construct novel analytical solutions within the framework of the Chiellini integrability condition. We analyze whether the expanding branch of the solutions can describe a late-time cosmic acceleration, using a combined statistical analysis of BAO, CMB, cosmic chronometer and Pantheon+SHOES supernova datasets. A crucial outcome of this exercise is the analytical emergence of a smooth phantom divide crossing in the dark energy equation of state, achieved without introducing any pathological instabilities. The reconstruction yields a present-day Hubble parameter $H\\_0 \\gtrsim 70 \\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, with a reduced tension relative to the $Λ$CDM cosmology. The results indicate that Chiellini-integrable scalar cosmologies are capable of providing a robust and analytically controlled framework for modeling late-time cosmic acceleration and phantom divide crossing, offering a viable alternative to phenomenological dark-energy parametrizations.\n\n", "2601.09087": "2026-01-14, **The Progenitor of the Type II-Plateau SN 2025pht in NGC 1637: The Dustiest, Most Luminous Red Supergiant So Far?**, Schuyler D. Van Dyk et.al., [2601.09087v1](http://arxiv.org/abs/2601.09087v1)\n\n We provide a characterization of the red supergiant (RSG) progenitor candidate for the nearby Type II-plateau supernova (SN) 2025pht in NGC 1637. The star was first detectable in 2001 by the Hubble Space Telescope (HST) and then again in a dozen bands by the James Webb Space Telescope (JWST) in 2024. This \"quasi-snapshot\" of the star's nature almost immediately prior to explosion is unprecedented. The RSG varied in brightness, and we posit that it could have been a pulsating variable, possibly with a long period of ~660 days. The largest uncertainty is the host-galaxy distance, which we establish to be 10.73+/-1.76 Mpc. The star was also heavily extinguished by interstellar dust internal to the host, with visual extinction A\\_V(host)~1.7 mag (total A\\_V(tot)~1.8 mag). Dust radiative-transfer modeling reveals the star's circumstellar medium to be quite dusty and silicate-rich, yielding a bolometric luminosity log(L\\_bol/L\\_Sun)=5.08+/-0.16 and a cool effective temperature T\\_eff=2100--2500 K. The available HST optical data had no bearing on the shape of the candidate's observed spectral energy distribution -- for the first time, without the archival JWST observations we would not have been able to detect and characterize the candidate at all. The SN 2025pht progenitor candidate, although quite similar to that of SN 2023ixf, may be the most luminous candidate identified to date.\n\n", "2601.09063": "2026-01-14, **Pre-Supernova Eruptions Triggered by Sudden Energy Deposition in Low-Mass Core-Collapse Supernova Progenitors**, Shuai Zha et.al., [2601.09063v1](http://arxiv.org/abs/2601.09063v1)\n\n In low-mass core-collapse supernova (CCSN) progenitors, nuclear burning beyond oxygen can become explosive under degenerate conditions, triggering eruptive mass loss before the final explosion. We investigate such pre-SN eruptions using \\texttt{SNEC} hydrodynamic simulations and realistic stellar models, parameterizing the nuclear energy deposition as a fraction of the binding energy of the combined He layer and H-rich envelope. For the lowest-mass model (9 $M\\_\\odot$), the ejecta mass ($M\\_{\\rm ej}$) scales with the energy gained by the H-rich envelope via a power law (index$\\sim$3.5). Across 9-10 $M\\_\\odot$, this relation shows limited scatter within a factor of $\\sim$2.6, enabling an estimation of the gained energy from $M\\_{\\rm ej}$. The shock passage also flattens the bound envelope, which can affect the SN light curve morphology and provide another diagnostic for the eruption. Then, we compute the associated precursor light curves for the 9 $M\\_\\odot$ model with the multi-group radiative-transfer code \\texttt{STELLA}. These signals are typically faint, with bolometric luminosities of $\\sim10^{39}$ erg s$^{-1}$ lasting hundreds of days. Their cool black-body spectra make them brighter in the infrared, yet several magnitudes fainter than observed pre-SN precursors at the threshold for full envelope ejection. To aid future studies, we make our post-eruption stellar profiles and precursor light curves publicly available.\n\n", "2601.08943": "2026-01-13, **Bound Dark Energy: Particle Physics model in alignment with recent DESI cosmological measurements**, Axel de la Macorra et.al., [2601.08943v1](http://arxiv.org/abs/2601.08943v1)\n\n We present observational constraints on the Bound Dark Energy Cold Dark Matter (BDE-CDM) model using DESI DR2 baryon acoustic oscillation measurements combined with Planck CMB data and Type Ia supernovae compilations (PantheonPlus, Union3, DESY5). In BDE-CDM, dark energy originates from the lightest meson field within a supersymmetric SU(3) dark gauge group with $N\\_f = 6$ flavors, governed by an inverse power-law potential $V(φ) = Λ\\_{c}^{4+2/3} φ^{-2/3}$. Unlike $Λ$CDM and $w\\_0w\\_a$CDM, the dark energy sector contains no free parameters -- the condensation scale $Λ\\_c$ and transition epoch $a\\_c$ are determined by gauge coupling unification constraints. The equation of state evolves from relativistic behavior ($w = 1/3$) before condensation through a kinetic-dominated stiff phase ($w \\simeq 1$), approaching $w\\_0 = -0.9298 \\pm 0.0003$ at present, with $w > -1$ maintained throughout cosmic history, avoiding phantom-regime instabilities. We obtain $Λ\\_{c} = 43.93 \\pm 0.13$~eV and $a\\_c = (2.489 \\pm 0.007) \\times 10^{-6}$, consistent with theoretical predictions. The $w\\_0$-$w\\_a$ confidence contours are approximately 10,000 times smaller than those of $w\\_0w\\_a$CDM while achieving comparable fits, and remain stable across different supernova datasets. Statistical analysis yields $Δ\\mathrm{DIC} = -6.77$ and $Δ\\mathrm{AIC} = -8.97$ relative to $Λ$CDM for BAO+DESY5, constituting strong evidence favoring BDE-CDM model. The model predicts distinctive signatures including 25\\% enhancement in the matter power spectrum at $k \\approx 4.3\\,h\\,\\mathrm{Mpc}^{-1}$. These results establish BDE-CDM as a theoretically motivated framework that successfully addresses the DESI-observed preference for dynamical dark energy while connecting particle physics with cosmological observations.\n\n", "2601.08931": "2026-01-13, **Expanding the High-z Supernova Frontier: \"Wide-Area\" JWST Discoveries from the First Two Years of COSMOS-Web**, Ori D. Fox et.al., [2601.08931v1](http://arxiv.org/abs/2601.08931v1)\n\n Transient astronomy in the early Universe (z > 2) remains largely unexplored, lying beyond the rest-frame optical spectroscopic reach of most current observatories. Yet this regime promises transformative insights, with high-redshift transients providing direct access to the early Universe and enabling studies of how stellar populations and cosmology evolve over cosmic time. JWST is uniquely equipped to probe these redshifts efficiently in the rest-frame optical and near-IR. We present results from an initial pathfinder search, covering an area of ~133 arcmin^2 (~0.037 deg^2) independently imaged by the PRIMER and COSMOS-Web (hereafter COSMOS) extragalactic surveys. Although neither program was designed for time-domain astronomy, combining their data results in difference images separated by roughly one year, leading to the discovery of 68 supernovae (SNe) with host photometric redshifts reaching z < 5. For most SNe, only a single epoch is available, but the combination of host redshift, classification, color, and magnitude enables us to prioritize candidates for detailed photometric and spectroscopic follow-up. Among the most notable sources are a relatively bright, blue CCSN at z > 3 (SN 2023aeab) and a young, normal SN Ia at z > 2 (SN 2023aeax). The sample distribution highlights the increasing likelihood that a wide-area JWST program can uncover younger, bluer, and potentially more extreme explosions. While this pathfinder effort is limited in cadence and number of filters, it demonstrates the strong potential of a dedicated, well-planned time-domain survey with JWST to obtain the sample sizes and rate measurements needed to chart SN populations deep into the early Universe.\n\n", "2601.08903": "2026-01-13, **IK Pegasi and the Double Merger Path to Type Ia Supernovae**, Na'ama Hallakoun et.al., [2601.08903v1](http://arxiv.org/abs/2601.08903v1)\n\n Recent Gaia astrometry has revealed thousands of main-sequence + white-dwarf binaries (MS+WD) at separations of ~0.1-10 au, including a subset hosting unusually massive (>~0.8 Msun) WDs. We argue that s-process enrichment in the non-degenerate companion provides a powerful diagnostic for identifying WDs that formed via mergers in hierarchical triple systems. For a massive WD, standard single-star evolution requires a massive (>~4 Msun) progenitor, yet such progenitors produce negligible s-process yields. We define IK Peg-type systems as those exhibiting this mass-yield tension: barium-enhanced companions orbiting WDs too massive to have descended from efficient s-process producers. The well-known system IK Peg exemplifies this class. Applying this framework to published spectroscopic data reveals several additional candidates, and we estimate that a few dozen such systems should exist in the current Gaia sample. If these systems trace inner-binary mergers in primordial triples, they represent observable intermediate stages towards eventual Type Ia supernovae via the double-merger pathway, as predicted by recent population-synthesis models.\n\n", "2601.08550": "2026-01-13, **Reconstructing Gamma Ray Burst Energy Relations with Observational H(z) data in Neural Network Framework**, Nilanjana Bagchi Aurpa et.al., [2601.08550v1](http://arxiv.org/abs/2601.08550v1)\n\n Gamma ray bursts (GRBs) offer a powerful probe of the cosmic expansion history far beyond the redshift range accessible to Type Ia supernovae. However, the calibration of GRB luminosity correlations is hindered by the circularity problem, which arises from assuming a fiducial cosmological model during calibration. In this work, we perform a model independent calibration of GRB luminosity relations using observational Hubble parameter H(z) data from the A220 and J220 compilations, thereby avoiding explicit cosmological assumptions. We employ Artificial Neural Network (ANN) to reconstruct the calibration relation directly from the data. In addition, we implement a Bayesian Neural Network (BNN) framework as an alternative approach, enabling a data driven treatment of both statistical and systematic uncertainties. The calibrated GRB sample is used to constrain the Amati relation, and we systematically compare the outcomes obtained from different calibration techniques and datasets. While the Amati Parameters obtained from GRBs caibrated from the ANN and BNN results are consistent with previous low redshifts calibrations using model-independent methods, the BNN approach provides a more robust framework.\n\n", "2601.08505": "2026-01-13, **A new magnitude--redshift relation based on SNe Ia**, Ósmar Rodríguez et.al., [2601.08505v1](http://arxiv.org/abs/2601.08505v1)\n\n We present a new empirical relation between the standardized magnitude ($m$) of Type Ia supernovae (SNe Ia) and redshift ($z$). Using Pantheon+ and DES-SN5YR, we find a negative linear correlation between $m-5\\log(z(1+z))$ and $z$, implying that their magnitude--redshift relation can be parametrized with just two parameters: an intercept $\\mathcal{M}$ and a slope $b$. This relation corresponds to the luminosity distance $d\\_L(z)=c\\,H\\_0^{-1}z(1+z)10^{bz/5}$ and is valid up to at least $z\\simeq1.1$. It outperforms the $Λ$CDM and flat $w$CDM models and the (2,1) Padé approximant for $d\\_L(z)$, and performs comparably to the flat $Λ$CDM model and the (2,1) Padé($j\\_0=1$) model of Hu et al. Furthermore, the relation is stable in the absence of low-$z$ SNe, making it suitable for fitting Hubble diagrams of SNe Ia without the need to add a low-$z$ sample. In deep fields in particular, assuming that the large-scale density is independent of the comoving radial coordinate, $b\\propto q\\_0+1$. We fit the empirical relation to SN data in eight deep-field regions and find that their fitted $\\mathcal{M}$ and $b$ parameters are consistent within $1.6\\,σ$, in agreement with isotropy. The inferred $q\\_0$ values, ranging from $-0.6$ to $-0.4$, are consistent within $1.5\\,σ$ and significantly lower than zero, indicating statistically consistent cosmic acceleration across all eight regions. We apply the empirical relation to the DES-Dovekie and Amalgame SN samples, finding $b$ values consistent with those from DES-SN5YR and Pantheon+. Finally, using the empirical relation in the hemispheric comparison method applied to Pantheon+ up to $z=1.1$, we find no evidence for anisotropies in $\\mathcal{M}$ and $b$.\n\n", "2601.08313": "2026-01-13, **Interstellar Medium Modulation of Nonlinear Kinetic Alfvén Morphology in Structured Galactic Environments**, Manpreet Singh et.al., [2601.08313v1](http://arxiv.org/abs/2601.08313v1)\n\n We present a spatially dependent framework for the existence and propagation of nonlinear kinetic Alfvén (KA) structures in the interstellar medium (ISM). Using a multi-component analytical model that incorporates the diffuse warm ionized medium together with localized H II regions, supernova remnants (SNR), and stellar-wind bubbles (SWB), we derive location-dependent coefficients governing KA dispersion and nonlinearity. The reductive perturbation method is applied to obtain Korteweg-de Vries (KdV) equations, enabling the characterization of solitons under realistic astrophysical conditions. Numerical analysis demonstrates how superthermality, plasma $β$, temperature, and density gradients modulate soliton amplitude, width, and stability. Our results reveal distinct exclusion zones (EZs) for KA solitons in high-$β$ HII regions and SWB/SNR interiors, as well as ultra low-$β$ regions near central pulsar wind nebulae. While H II regions exhibit simple Gaussian-driven depletions, the complex ``hole-and-shell\" morphologies of SWBs and SNRs imprint sharp spatial variations and discontinuities on soliton properties. This study establishes a direct link between macroscopic ISM morphology, ion-kinetic scale dissipation, and the emergence of coherent Alfvénic activity, with implications for radio scattering, pulsar scintillation, and fine-scale signatures in astrophysical observations.\n\n"}}