{"neutrino": {"2406.06476": "2024-06-10, **Searching for Pseudo-Dirac neutrinos from Astrophysical sources in IceCube data**, Khushboo Dixit et.al., [2406.06476v1](http://arxiv.org/abs/2406.06476v1)\n\n We analyze IceCube public data from its IC86 configuration, namely PSTracks event selection, to search for pseudo-Dirac signatures in high-energy neutrinos from astrophysical sources. Neutrino flux from astrophysical sources is reduced in the pseudo-Dirac scenario due to conversion of active-to-sterile neutrinos as compared to the neutrino oscillation scenario of only three active neutrinos over astrophysical distances. We fit IceCube data using astrophysical flux models for three point-like sources in both scenarios and constrain the active-sterile mass-square-difference in the absence of any evidence for pseudo-Dirac scenario. We find that a common mass-squared-difference $\\delta m^2$ for all three flavors can be constrained as $\\delta m^2 \\lesssim 4 \\times 10^{-19}~eV^2$ for the source NGC 1068, $\\delta m^2 \\lesssim 8 \\times 10^{-20}~eV^2$ for the source TXS 0506+056, and $\\delta m^2 \\lesssim 2.3 \\times 10^{-21}~eV^2$ for the source PKS 1424+240 at 90% C.L. A stacking analysis gives a constrain on $\\delta m^2 \\le 2.3 \\times 10^{-21}~eV^2$ at 90% CL which is dominated by the constraint obtained from PKS 1424+240.\n\n", "2406.06117": "2024-06-10, **Nuclear Reactor Data Excludes Cosmological Triangle in Search for Axion-Like Particles**, Byung Ju Park et.al., [2406.06117v1](http://arxiv.org/abs/2406.06117v1)\n\n We report new constraints on axion-like particle (ALP) using data corresponding to a sodium iodine target exposure of 3063\\,kg$\\cdot$days from the neutrino elastic scattering observation with NaI (NEON) experiment. A 16.7\\,kg of thallium-doped sodium iodide target was located 23.7 meters from a 2.8\\,GW thermal power nuclear reactor. We searched for ALPs produced by high-flux photons by comparing the energy spectra of data collected during reactor-on (1596\\,kg$\\cdot$days exposure) and reactor-off (1467\\,kg$\\cdot$days exposure) periods. No signal consistent with ALP interaction was identified, allowing us to set exclusion limits at the 95\\% confidence level. Our limits cover previously unexplored regions for both photon couplings (${g\\_{a\\gamma}}$) and electron couplings (${g\\_{ae}}$) for axion masses around 1\\,MeV/c$^2$. Notably, the NEON data excludes the unconstrained region identified by laboratory-based searches for photon couplings within the ``cosmological triangle'' for the first time. The observed 95\\% confidence level limits reach as low as ${g\\_{a\\gamma}}$ of 4.33$\\times$ 10$^{-8}$\\,GeV$^{-1}$ and ${g\\_{ae}}$ of 1.10$\\times$ 10$^{-9}$ for axion masses of 1.7\\,MeV/c$^2$ and 1.0\\,MeV/c$^2$, respectively.\n\n", "2406.06067": "2024-06-10, **Fisher's Mirage: Noise Tightening of Cosmological Constraints in Simulation-Based Inference**, Christopher Wilson et.al., [2406.06067v1](http://arxiv.org/abs/2406.06067v1)\n\n We systematically analyze the implications of statistical noise within numerical derivatives on simulation-based Fisher forecasts for large scale structure surveys. Noisy numerical derivatives resulting from a finite number of simulations, $N\\_{sims}$, act to bias the associated Fisher forecast such that the resulting marginalized constraints can be significantly tighter than the noise-free limit. We show the source of this effect can be traced to the influence of the noise on the marginalization process. Parameters such as the neutrino mass, $\\M$, for which higher-order forward differentiation schemes are commonly used, are more prone to noise; the predicted constraints can be akin to those purely from a random instance of statistical noise even using $(1\\mathrm{Gpc}/h)^{3}$ simulations with $N\\_{sims}=500$ realizations. We demonstrate how derivative noise can artificially reduce parameter degeneracies and seemingly null the effects of adding nuisance parameters to the forecast, such as HOD fitting parameters. We mathematically characterize these effects through a full statistical analysis, and demonstrate how confidence intervals for the true noise-free, $N\\_{sims} \\rightarrow \\infty$, Fisher constraints can be recovered even when noise comprises a consequential component of the measured signal. The findings and approaches developed here are important for ensuring simulation-based analyses can be accurately used to assess upcoming survey capabilities.\n\n", "2406.05770": "2024-06-09, **LAYCAST: LAYered CAvern Surface Tracker at future electron-positron colliders**, Ye Lu et.al., [2406.05770v1](http://arxiv.org/abs/2406.05770v1)\n\n We propose a detector concept, LAYered CAvern Surface Tracker (LAYCAST), to be installed on the ceiling and the wall of the cavern hosting the main experiment of future electron-positron colliders such as CEPC and FCC-ee. With detailed and realistic considerations of the design of such a new experiment, the proposed detector is dedicated to extending the sensitivity reach of the main detector to various theoretical scenarios of long-lived particles (LLPs). We study carefully four such scenarios involving a light scalar boson $X$, the heavy neutral lepton $N$, the lightest neutralino $\\tilde{\\chi}^0\\_1$ in the R-parity-violating supersymmetry, and the axion-like particle $a$. Long-lived light scalar bosons are considered to be produced from the Standard-Model (SM) Higgs boson's decay ($h \\to X X$) at the center-of-mass energy $\\sqrt{s} =$ 240 GeV, while the other three types of LLPs are produced either from $Z$-boson decays (viz. $Z \\to \\nu\\, N, ~\\tilde{\\chi}^0\\_1\\, \\tilde{\\chi}^0\\_1 $) or direct scattering process ($ e^- e^+ \\to ~\\gamma\\, a$) at $\\sqrt{s} =$ 91.2 GeV, where $\\gamma$ and $\\nu$ denote the SM photon and neutrino, respectively. With Monte-Carlo simulations, we derive the sensitivities of the proposed experiment to these LLPs and the corresponding signal-event numbers. Our findings show that LAYCAST can probe large new parameter space beyond both current bounds and the expected reach of the main experiments at CEPC and FCC-ee. Comparison with existing works in similar directions is also made.\n\n", "2406.05601": "2024-06-09, **Comparative Study of tau neutrinos event numbers in INO and JUNO detectors from Bartol Flux**, Kartik Joshi et.al., [2406.05601v1](http://arxiv.org/abs/2406.05601v1)\n\n To expand our understanding of neutrino physics, scientific researchers of astroparticle Physics directs their goal of detecting atmospheric tau neutrinos in the GeV range. The effort will fundamentally unlock the nature of these elusive particles while also investigating muon neutrinos and tau neutrino oscillations. The Jiangmen Underground Neutrino Observatory (JUNO), which has already started its operations in 2024, and the India-based Neutrino Observatory (INO), which is not active right now but has future objectives in conducting research, have both emerged as key players in this field. These experiments used theoretical and experimental methodologies to understand the properties and behaviour of atmospheric tau neutrinos. The JUNO experiment, which has an estimated ability to detect around 50 events per year, and the INO, which used an impressive 50,000-ton iron slab as a detector, will contribute significantly in this domain. The detection of all tau neutrinos charged-current (CC) interactions with the detection material, which is divided into former and later events based on the timeline corresponding to scattering and capture in the detector; moreover, the KamLAND experiment is also capable of detecting these tau neutrinos decays, however, in smaller proportions, which could be possibly confused with background signals emerging from oscillations. This has been studied for both experiments for tau neutrinos nuclei cross-sections, and its standard value is taken as a base for calculations. Both INO and JUNO have 5 sigma sensitivity, which was exposed for 5 to 10 years.\n\n"}, "dark matter": {"2406.06395": "2024-06-10, **Dilatonic Couplings and the Relic Abundance of Ultralight Dark Matter**, Ahmad Alachkar et.al., [2406.06395v1](http://arxiv.org/abs/2406.06395v1)\n\n Models of scalar field dark matter where the scalar is a dilaton have a special behaviour, since non-trivial couplings, $d$, to matter result in a contribution to the potential for the field which is proportional to the trace of the stress-energy tensor. We look in more detail at the dilaton mass, $m\\_\\phi$, and initial conditions required to yield the correct relic abundance for couplings that are not already excluded by terrestrial experiments. In minimal models with only couplings accessible to terrestrial searches, we find that dilaton dark matter with $m\\_{\\phi} \\gtrsim 10^{-10}$ eV requires couplings suppressed compared to constraints from equivalence principle (EP) tests and fifth force searches in order to not produce too much dark matter, improving on the strongest current experimental constraints by up to $\\sim {\\cal O}(10)$, with consequences for the proposed mechanical resonator dilaton DM searches. In non-minimal or universally coupled models, the unconstrained couplings of the dilaton to e.g. the top quark can strongly influence the relic abundance at all masses. In particular, this implies that atom interferometry searches at masses $m\\_\\phi\\approx 10^{-19}\\text{ eV}$ are unable to constrain the early Universe behaviour or UV physics of the dilaton. We also find that dilatonic couplings allow for compatibility of $m\\_\\phi \\gtrsim 10^{-7}\\text{ eV}$ with an observably large tensor-to-scalar ratio in the cosmic microwave background, which is not possible for a decoupled scalar of the same mass.\n\n", "2406.06308": "2024-06-10, **Topological structures, dark matter and gravitational waves in $E_6$**, Rinku Maji et.al., [2406.06308v1](http://arxiv.org/abs/2406.06308v1)\n\n We discuss the appearance of topological structures from the spontaneous breaking of $E\\_6$ to the Standard Model via its maximal subgroup $SO(10) \\times U(1)\\_\\psi$. They include dumbbells, metastable strings, as well as domain walls bounded by necklaces. We provide a novel scenario for producing metastable strings based on the symmetry breaking $U(1)\\_\\psi \\longrightarrow Z\\_8 \\longrightarrow Z\\_4$. The metastable string arises from the merger of $Z\\_8$ strings that bound a domain wall. An unbroken gauge $Z\\_2$ symmetry from $SO(10)$ breaking yields viable stable dark matter candidates as well as topologically stable strings. We discuss the gravitational wave emission from two varieties of cosmic strings, namely the superheavy metastable ones and the intermediate scale topologically stable cosmic strings.\n\n", "2406.06194": "2024-06-10, **The Negative Action Keldysh Spinors**, A. Jourjine et.al., [2406.06194v1](http://arxiv.org/abs/2406.06194v1)\n\n We discuss quantization of Dirac spinors with action which is the negative of the standard action. Using the Keldysh QFT formulation, we show that the standard quantization of such Keldysh spinors results in the Hamiltonian bounded from above and in S-matrix for backwards in time scattering. The alternative quantization produces the standard Hamiltonian bounded from below and the standard S-matrix for forwards in time scattering. When the two masses are equal, the sum of their actions describes the standard Keldysh out-of-time-order correlators. When both Keldysh and Dirac spinors are present in a QFT, the standard Fock space is augmented by negative energy states, while its positive and the negative subspaces share the same vacuum state. In absence of gravity the Dirac and the Keldysh spinors do not interact and positive and negative energy states do not exchange quanta with non-zero energy. If Keldysh spinors exist in Nature, then the Universe would consist of bosonic and fermionic particles that are described by both positive and negative Fock energy states with a single vacuum state that cannot be crossed from either side. Such a scenario could explain the non-observation of dark energy/dark matter except via classical gravity.\n\n", "2406.06085": "2024-06-10, **Fiducial-Cosmology-dependent systematics for the DESI 2024 BAO Analysis**, A. Pérez-Fernández et.al., [2406.06085v1](http://arxiv.org/abs/2406.06085v1)\n\n When measuring the Baryon Acoustic Oscillations (BAO) scale from galaxy surveys, one typically assumes a fiducial cosmology when converting redshift measurements into comoving distances and also when defining input parameters for the reconstruction algorithm. A parameterised template for the model to be fitted is also created based on a (possibly different) fiducial cosmology. This model reliance can be considered a form of data compression, and the data is then analysed allowing that the true answer is different from the fiducial cosmology assumed. In this study, we evaluate the impact of the fiducial cosmology assumed in the BAO analysis of the Dark Energy Spectroscopic Instrument (DESI) survey Data Release 1 (DR1) on the final measurements in DESI 2024 III. We utilise a suite of mock galaxy catalogues with survey realism that mirrors the DESI DR1 tracers: the bright galaxy sample (BGS), the luminous red galaxies (LRG), the emission line galaxies (ELG) and the quasars (QSO), spanning a redshift range from 0.1 to 2.1. We compare the four secondary AbacusSummit cosmologies against DESI's fiducial cosmology (Planck 2018). The secondary cosmologies explored include a lower cold dark matter density, a thawing dark energy universe, a higher number of effective species, and a lower amplitude of matter clustering. The mocks are processed through the BAO pipeline by consistently iterating the grid, template, and reconstruction reference cosmologies. We determine a conservative systematic contribution to the error of $0.1\\%$ for both the isotropic and anisotropic dilation parameters $\\alpha\\_{\\rm iso}$ and $\\alpha\\_{\\rm AP}$. We then directly test the impact of the fiducial cosmology on DESI DR1 data.\n\n", "2406.05713": "2024-06-09, **Enhancing the light yield of He:CF$_4$ based gaseous detector**, F. D. Amaro et.al., [2406.05713v1](http://arxiv.org/abs/2406.05713v1)\n\n The CYGNO experiment aims to build a large ($\\mathcal{O}(10)$ m$^3$) directional detector for rare event searches, such as nuclear recoils (NRs) induced by dark matter (DM), such as weakly interactive massive particles (WIMPs). The detector concept comprises a time projection chamber (TPC), filled with a He:CF$\\_4$ 60/40 scintillating gas mixture at room temperature and atmospheric pressure, equipped with an amplification stage made of a stack of three gas electron multipliers (GEMs) which are coupled to an optical readout. The latter consists in scientific CMOS (sCMOS) cameras and photomultipliers tubes (PMTs). The maximisation of the light yield of the amplification stage plays a major role in the determination of the energy threshold of the experiment. In this paper, we simulate the effect of the addition of a strong electric field below the last GEM plane on the GEM field structure and we experimentally test it by means of a 10$\\times$10 cm$^2$ readout area prototype. The experimental measurements analyse stacks of different GEMs and helium concentrations in the gas mixture combined with this extra electric field, studying their performances in terms of light yield, energy resolution and intrinsic diffusion. It is found that the use of this additional electric field permits large light yield increases without degrading intrinsic characteristics of the amplification stage with respect to the regular use of GEMs.\n\n"}, "supernova": {"2406.06510": "2024-06-10, **Most nearby young star clusters formed in three massive complexes**, Cameren Swiggum et.al., [2406.06510v1](http://arxiv.org/abs/2406.06510v1)\n\n Efforts to unveil the structure of the local interstellar medium and its recent star formation history have spanned the past seventy years. Recent studies utilizing precise data from space astrometry missions have revealed nearby, newly formed star clusters with connected origins. Nonetheless, mapping young clusters across the entire sky back to their natal regions has been hindered by a lack of clusters with precise radial velocity data. Here we show that 155 out of 272 (57 percent) high-quality young clusters within one kiloparsec of the Sun arise from three distinct spatial volumes. This conclusion is based upon the analysis of data from the third Gaia release and other large-scale spectroscopic surveys. Currently dispersed throughout the Solar Neighborhood, their past positions over 30 Myr ago reveal that these families of clusters each formed in one of three compact, massive star-forming complexes. One of these families includes all of the young clusters near the Sun -- the Taurus and Sco-Cen star-forming complexes. We estimate that over 200 supernovae were produced from these families and argue that these clustered supernovae produced both the Local Bubble and the largest nearby supershell GSH 238+00+09, both of which are clearly visible in modern three-dimensional dust maps.\n\n", "2406.06390": "2024-06-10, **Reconstructing the genealogy of LIGO-Virgo black holes**, Parthapratim Mahapatra et.al., [2406.06390v1](http://arxiv.org/abs/2406.06390v1)\n\n We propose a Bayesian inference framework to predict the merger history of LIGO-Virgo binary black holes, whose binary components may have undergone hierarchical mergers in the past. The framework relies on numerical relativity predictions for the mass, spin, and kick velocity of the remnant black holes. This proposed framework computes the masses, spins, and kicks imparted to the remnant of the parent binaries, given the initial masses and spin magnitudes of the binary constituents. We validate our approach by performing an \"injection study\" based on a constructed sequence of hierarchically-formed binaries. Noise is added to the final binary in the sequence, and the parameters of the 'parent' and 'grandparent' binaries in the merger chain are then reconstructed. This method is then applied to three GWTC-3 events: GW190521, GW200220\\_061928, GW190426\\_190642. These events were selected because at least one of the binary companions lies in the putative pair-instability supernova mass gap, in which stellar processes alone cannot produce black holes. Hierarchical mergers offer a natural explanation for the formation of black holes in the pair-instability mass-gap. We use the backward evolution framework to predict the parameters of the parents of the primary companion of these three binaries. Our results indicate that at least one component of these three observed binaries was formed through a prior binary black hole merger. This approach can be readily applied to future high-mass gravitational wave events to predict their formation history under the hierarchical merger assumption.\n\n", "2406.06389": "2024-06-10, **Implications of DES 5YR SNe Dataset for $Λ$CDM**, Eoin Ó Colgáin et.al., [2406.06389v1](http://arxiv.org/abs/2406.06389v1)\n\n Dark Energy Survey five-year supernovae data (DES 5YR SNe) in conjunction with Planck CMB and Dark Energy Spectroscopic Instrument (DESI) BAO data has detected a strong dynamical dark energy deviation from the $\\Lambda$CDM model. Here, we shift the focus of DES data to the pressureless matter sector in the $\\Lambda$CDM model by studying the matter density parameter $\\Omega\\_m$. Employing frequentist profile likelihoods, we demonstrate that $\\Omega\\_m$ increases with effective redshift in the DES dataset at up to $2.5 \\sigma$ level. At the highest redshifts, one encounters negative dark energy densities $\\Omega\\_m > 1$. Our findings corroborate earlier observations in Pantheon and Pantheon+ datasets with an independent SNe dataset with a higher effective redshift. In an appendix, we confirm that curvature $\\Omega\\_k$ decreases with effective redshift disfavouring a flat Universe in higher redshift DES SNe at $> 3 \\sigma$. Our choice of $\\Omega\\_k$ prior leads to an underestimation of the tension with a flat Universe.\n\n", "2406.06215": "2024-06-10, **ZTF SN Ia DR2: Evidence of Changing Dust Distributions With Redshift Using Type Ia Supernovae**, B. Popovic et.al., [2406.06215v1](http://arxiv.org/abs/2406.06215v1)\n\n Type Ia supernova (SNIa) are excellent probes of local distance, and the increasing sample sizes of SNIa have driven an increased need to study the associated systematic uncertainties and improve the standardisation methods in preparation for the next generation of cosmological surveys into the dark energy equation-of-state $w$. We aim to probe the potential change in the SNIa standardisation parameter $c$ with redshift and the host-galaxy of the supernova. Improving the standardisation of SNIa brightnesses will require accounting for the relationship between the host and the SNIa, and potential shifts in the SNIa standardisation parameters with redshift will cause biases in the recovered cosmology. Here, we assemble a volume-limited sample of ~3000 likely SNIa across a redshift range of $z = 0.015$ to $z = 0.36$. This sample is fitted with changing mass and redshift bins to determine the relationship between intrinsic properties of SNe Ia and their redshift and host galaxy parameters. We then investigate the colour-luminosity parameter $\\beta$ as a further test of the SNIa standardisation process. We find that the changing colour distribution of SNe Ia with redshift is driven by dust at a confidence of $>4\\sigma$. Additionally, we show a strong correlation between the host galaxy mass and the colour-luminosity coefficient $\\beta$ ($> 4\\sigma$), even when accounting for the quantity of dust in a host galaxy.\n\n", "2406.06109": "2024-06-10, **Multi-Generational Black Hole Population Analysis with an Astrophysically Informed Mass Function**, Yannick Ulrich et.al., [2406.06109v1](http://arxiv.org/abs/2406.06109v1)\n\n We analyze the population statistics of black holes in the LIGO/Virgo/KAGRA GWTC-3 catalog using a parametric mass function derived from simulations of massive stars experiencing pulsational pair-instability supernovae (PPISN). Our formalism enables us to separate the black hole mass function into sub-populations corresponding to mergers between objects formed via different astrophysical pathways, allowing us to infer the properties of black holes formed from stellar collapse and black holes formed via prior mergers separately. Applying this formalism, we find that this model fits the data better than the powerlaw+peak model with Bayes factor $ 9.7\\pm0.1$. We measure the location of the lower edge of the upper black hole mass gap to be $M\\_{\\rm BHMG}=84.05\\_{-12.88}^{+17.19}{\\rm M}\\_{\\odot}$, providing evidence that the $35{\\rm M}\\_{\\odot}$ Gaussian peak detected in the data using other models is not associated with the PPISN pile-up predicted to precede this gap. Incorporating spin, we find that the normalized spins of stellar remnant black holes are close to zero while those of higher generation black holes tend to larger values. All of these results are in accordance with the predictions of stellar structure theory and black hole merger scenarios. Finally, we combine our mass function with the spectral siren method for measuring the Hubble constant to find $H\\_0=36.19\\_{-10.91}^{17.50}$ km/s/Mpc and discuss potential explanations of this low value. Our results demonstrate how astrophysically-informed mass functions can facilitate the interpretation of gravitational wave catalog data to provide information about black hole formation and cosmology. Future data releases will improve the precision of our measurements.\n\n"}}