{"neutrino": {"2311.04206": "2023-11-07, **Elastic and resonance structures of the nucleon from hadronic tensor in lattice QCD: implications for neutrino-nucleon scattering and hadron physics**, Jian Liang et.al., [2311.04206v1](http://arxiv.org/abs/2311.04206v1)\n\n Understanding the transitions of nucleons into various resonance structures through electromagnetic interactions plays a pivotal role in advancing our comprehension of the strong interactions within the domain of quark confinement. Furthermore, gaining precise insights into the elastic and resonance structures of nucleons is indispensable for deciphering the physics from neutrino-nucleus scattering cross sections experimental data, which remain theoretically challenging, even in the context of neutrino-nucleon interactions whose profound understanding is imperative for the neutrino oscillation experiments. One promising avenue involves the direct evaluation of the lepton-nucleon scattering cross sections across quasi-elastic, resonance, shallow-inelastic, and deep inelastic regions, which can be achieved through the hadronic tensor formalism in lattice QCD. In this work, we present the determination of the nucleon's Sachs electric form factor using the hadronic tensor formalism and verify that it is consistent with that from the conventional three-point function calculation. We additionally obtain the transition form factor from the nucleon to its first radial excited state within a finite volume. Consequently, we identify the latter with the nucleon-to-Roper transition form factor $G\\_E^*(Q^2)$, determine the corresponding longitudinal helicity amplitude $S\\_{1/2}(Q^2)$ and compare our findings with experimental measurements, for the first time using the hadronic tensor formalism. The limitations and systematic improvements of the approach are also discussed.\n\n", "2311.04087": "2023-11-07, **Spin-Flavor Oscillations of Relic Neutrinos in Primordial Magnetic Field**, Ashutosh Kumar Alok et.al., [2311.04087v1](http://arxiv.org/abs/2311.04087v1)\n\n The neutrino magnetic moment operator clasps a tiny but non-zero value within the standard model (SM) of particle physics and rather enhanced values in various new physics models. This generation of the magnetic moment ($\\mu\\_\\nu$) is through quantum loop corrections which can exhibit spin-flavor oscillations in the presence of an external magnetic field. Also, several studies predict the existence of a primordial magnetic field (PMF) in the early universe, extending back to the era of Big Bang Nucleosynthesis (BBN) and before. The recent NANOGrav measurement can be considered as a strong indication of the presence of these PMFs. In this work, we consider the effect of the PMF on the flux of relic neutrinos. For Dirac neutrinos, we show that half of the active relic neutrinos can become sterile due to spin-flavor oscillations well before becoming non-relativistic owing to the expansion of the Universe and also before the timeline of the formation of galaxies and hence intergalactic fields, subject to the constraints on the combined value of $\\mu\\_\\nu$ and the cosmic magnetic field at the time of neutrino decoupling. For the upper limit of PMF allowed by the BBN, this can be true even if the experimental bounds on $\\mu\\_{\\nu}$ approaches a few times its SM value.\n\n", "2311.04038": "2023-11-07, **A Possible Impact of Non-Gaussianities on Cosmological Constraints in Neutrino Physics**, Matteo Forconi et.al., [2311.04038v1](http://arxiv.org/abs/2311.04038v1)\n\n The search for non-Gaussian signatures in the Cosmic Microwave Background (CMB) is crucial for understanding the physics of the early Universe. Given the possibility of non-Gaussian fluctuations in the CMB, a recent revision to the standard $\\Lambda$-Cold Dark Matter ($\\Lambda$CDM) model has been proposed, dubbed \"Super-$\\Lambda$CDM\". This model introduces additional free parameters to account for the potential effects of a trispectrum in the primordial fluctuations. In this study, we explore the impact of the Super-$\\Lambda$CDM model on current constraints on neutrino physics. In agreement with previous research, our analysis reveals that for most of the datasets, the Super-$\\Lambda$CDM parameter $A\\_0$ significantly deviates from zero at over a $95\\%$ confidence level. We then demonstrate that this signal might influence current constraints in the neutrino sector. Specifically, we find that the current constraints on neutrino masses may be relaxed by over a factor of two within the Super-$\\Lambda$CDM framework, thanks to the correlation present with $A\\_0$. Consequently, locking $A\\_0=0$ might introduce a bias, leading to overly stringent constraints on the total neutrino mass.\n\n", "2311.03842": "2023-11-07, **Measurement of the neutrino-oxygen neutral-current quasielastic cross section using atmospheric neutrinos in the SK-Gd experiment**, S. Sakai et.al., [2311.03842v1](http://arxiv.org/abs/2311.03842v1)\n\n We report the first measurement of the atmospheric neutrino-oxygen neutral-current quasielastic (NCQE) cross section in the gadolinium-loaded Super-Kamiokande (SK) water Cherenkov detector. In June 2020, SK began a new experimental phase, named SK-Gd, by loading 0.011% by mass of gadolinium into the ultrapure water of the SK detector. The introduction of gadolinium to ultrapure water has the effect of improving the neutron-tagging efficiency. Using a 552.2 day data set from August 2020 to June 2022, we measure the NCQE cross section to be 0.74 $\\pm$ 0.22(stat.) $^{+0.85}\\_{-0.15}$ (syst.) $\\times$ 10$^{-38}$ cm$^{2}$/oxygen in the energy range from 160 MeV to 10 GeV, which is consistent with the atmospheric neutrino-flux-averaged theoretical NCQE cross section and the measurement in the SK pure-water phase within the uncertainties. Furthermore, we compare the models of the nucleon-nucleus interactions in water and find that the Binary Cascade model and the Liege Intranuclear Cascade model provide a somewhat better fit to the observed data than the Bertini Cascade model. Since the atmospheric neutrino-oxygen NCQE reactions are one of the main backgrounds in the search for diffuse supernova neutrino background (DSNB), these new results will contribute to future studies - and the potential discovery - of the DSNB in SK.\n\n", "2311.03804": "2023-11-07, **Searches for neutrino counterparts of gravitational waves from the LIGO/Virgo third observing run with KM3NeT**, KM3NeT Collaboration et.al., [2311.03804v1](http://arxiv.org/abs/2311.03804v1)\n\n The KM3NeT neutrino telescope is currently being deployed at two different sites in the Mediterranean Sea. First searches for astrophysical neutrinos have been performed using data taken with the partial detector configuration already in operation. The paper presents the results of two independent searches for neutrinos from compact binary mergers detected during the third observing run of the LIGO and Virgo gravitational wave interferometers. The first search looks for a global increase in the detector counting rates that could be associated with inverse beta decay events generated by MeV-scale electron anti-neutrinos. The second one focuses on upgoing track-like events mainly induced by muon (anti-)neutrinos in the GeV--TeV energy range. Both searches yield no significant excess for the sources in the gravitational wave catalogs. For each source, upper limits on the neutrino flux and on the total energy emitted in neutrinos in the respective energy ranges have been set. Stacking analyses of binary black hole mergers and neutron star-black hole mergers have also been performed to constrain the characteristic neutrino emission from these categories.\n\n", "2311.03646": "2023-11-07, **Secondary Lepton Production, Propagation, and Interactions with NuLeptonSim**, Austin Cummings et.al., [2311.03646v1](http://arxiv.org/abs/2311.03646v1)\n\n Charged current interactions of neutrinos inside the Earth can result in secondary muons and {\\tau} - leptons which are detectable by a large swath of existing and planned neutrino experiments through a wide variety of event topologies. Consideration of such events can improve detector performance and provide unique signatures which help with event reconstruction. In this work, we describe NuLeptonSim, a propagation tool for neutrinos and charged leptons that builds on the fast NuTauSim framework. NuLeptonSim considers energy losses of charged leptons, modelled both continuously for performance or stochastically for accuracy, as well as interaction models for all flavors of neutrinos, including the Glashow resonance. We demonstrate the results from including these effects on the Earth emergence probability of various charged leptons from different flavors of primary neutrino and their corresponding energy distributions. We find that the emergence probability of muons can be higher than that of taus for energies below 100 PeV, whether from a primary muon or {\\tau} neutrino, and that the Glashow resonance contributes to a surplus of emerging leptons near the resonant energy.\n\n"}, "dark matter": {"2311.03995": "2023-11-07, **Quantum collider probes of the fermionic Higgs portal**, U. Haisch et.al., [2311.03995v1](http://arxiv.org/abs/2311.03995v1)\n\n We explore the sensitivity of future hadron collider measurements in constraining the fermionic Higgs portal, focusing on the case where the new fermions are not accessible in exotic Higgs decays. These portals arise in neutral naturalness and dark matter models and are very challenging to test at colliders. We study the reach of the high-luminosity option of the Large Hadron Collider (HL-LHC), the high-energy upgrade of the LHC (HE-LHC) and a Future Circular Collider (FCC) in off-shell Higgs and double-Higgs production. Interestingly, quantum enhanced indirect probes provide the best sensitivity. We then compare these constraints to the limits one expects to find from other Higgs probes. It is shown that the studied Higgs processes provide complementary constraints, implying that a multi-prong approach will be needed to exploit the full potential of the HL-LHC, HE-LHC and FCC in testing fermionic Higgs-portal interactions. This article provides a roadmap for such a multifaceted strategy.\n\n", "2311.03876": "2023-11-07, **Dark Matter in Fractional Gravity III: Dwarf Galaxies Kinematics**, F. Benetti et.al., [2311.03876v1](http://arxiv.org/abs/2311.03876v1)\n\n Recently we put forward a framework where the dark matter (DM) component within virialized halos is subject to a non-local interaction originated by fractional gravity (FG) effects. In previous works we demonstrated that such a framework can substantially alleviate the small-scale issues of the standard $\\Lambda$CDM paradigm, without altering the DM mass profile predicted by $N-$body simulations, and retaining its successes on large cosmological scales. In this paper we dig deeper to probe FG via high-quality data of individual dwarf galaxies, by exploiting the rotation velocity profiles inferred from stellar and gas kinematic measurements in $8$ dwarf irregulars, and the projected velocity dispersion profiles inferred from the observed dynamics of stellar tracers in $7$ dwarf spheroidals and in the ultra-diffuse galaxy DragonFly 44. We find that FG can reproduce extremely well the rotation and dispersion curves of the analysed galaxies, performing in most instances significantly better than the standard Newtonian setup.\n\n", "2311.03875": "2023-11-07, **Constraints on the interaction of quintessence dark energy with dark matter and the evolution of its equation of state parameter**, Roman Neomenko et.al., [2311.03875v1](http://arxiv.org/abs/2311.03875v1)\n\n The cosmological model with an interaction between dynamical quintessence dark energy and cold dark matter is considered. Evolution of a dark energy equation of state parameter is defined by a dark energy adiabatic sound speed and a dark sector interaction parameter, which must be more physically correct model then a previously used in which such evolution was given by some fixed dependence on scale factor. The constraints on interaction parameter and other parameters of the model was obtained using a cosmic microwave background, baryon acoustic oscillations and supernova SN Ia data.\n\n", "2311.03790": "2023-11-07, **Back to the present: A general treatment for the tidal field from the wake of dynamical friction**, Rain Kipper et.al., [2311.03790v1](http://arxiv.org/abs/2311.03790v1)\n\n Dynamical friction can be a valuable tool for inferring dark matter properties that are difficult to constrain by other methods. Most applications of dynamical friction calculations are concerned with the long-term angular momentum loss and orbital decay of the perturber within its host. This, however, assumes knowledge of the unknown initial conditions of the system. We advance an alternative methodology to infer the host properties from the perturber's shape distortions induced by the tides of the wake of dynamical friction, which we refer to as the tidal dynamical friction. As the shape distortions rely on the tidal field that has a predominantly local origin, we present a strategy to find the local wake by integrating the stellar orbits back in time along with the perturber, then removing the perturber's potential and re-integrating them back to the present. This provides perturbed and unperturbed coordinates and hence a change in coordinates, density, and acceleration fields, which yields the back-reaction experienced by the perturber. The method successfully recovers the tidal field of the wake based on a comparison with N-body simulations. We show that similar to the tidal field itself, the noise and randomness of the dynamical friction force due to the finite number of stars is also dominated by regions close to the perturber. Stars near the perturber influence it more but are smaller in number, causing a high variance in the acceleration field. These fluctuations are intrinsic to dynamical friction. We show that a stellar density of $0.0014 {\\rm M\\_\\odot\\, kpc^{-3}}$ yields an inherent variance of 10% to the dynamical friction. The current method extends the family of dynamical friction methods that allow for the inference of host properties from tidal forces of the wake. It can be applied to specific galaxies, such as Magellanic Clouds, with Gaia data.\n\n"}, "supernova": {"2311.03875": "2023-11-07, **Constraints on the interaction of quintessence dark energy with dark matter and the evolution of its equation of state parameter**, Roman Neomenko et.al., [2311.03875v1](http://arxiv.org/abs/2311.03875v1)\n\n The cosmological model with an interaction between dynamical quintessence dark energy and cold dark matter is considered. Evolution of a dark energy equation of state parameter is defined by a dark energy adiabatic sound speed and a dark sector interaction parameter, which must be more physically correct model then a previously used in which such evolution was given by some fixed dependence on scale factor. The constraints on interaction parameter and other parameters of the model was obtained using a cosmic microwave background, baryon acoustic oscillations and supernova SN Ia data.\n\n"}}