{"neutrino": {"2310.05704": "2023-10-09, **Migdal effect of Phonon-mediated neutrino nucleus scattering in semiconductor detectors**, Yu-Feng Li et.al., [2310.05704v1](http://arxiv.org/abs/2310.05704v1)\n\n In this work, we introduce the theoretical framework of the phonon-mediated Migdal effect for neutrino-nucleus scattering in semiconductors, considering both the Standard Model and the presence of the neutrino magnetic moment. We calculate the rate of electron excitation resulting from the Migdal effect and observe a substantial coherent enhancement compared to ordinary neutrino-electron scattering. Furthermore, we provide numerical sensitivities for detecting the Migdal effect and constraints on the neutrino magnetic moment, utilizing an experimental setup with reactor neutrinos.\n\n", "2310.05693": "2023-10-09, **CONGRuENTS (COsmic-ray, Neutrino, Gamma-ray and Radio Non-Thermal Spectra). II. Population-level correlations between galactic infrared, radio, and γ-ray emission**, Matt A. Roth et.al., [2310.05693v1](http://arxiv.org/abs/2310.05693v1)\n\n Galaxies obey a number of empirical correlations between their radio, {\\gamma}-ray, and infrared emission, but the physical origins of these correlations remain uncertain. Here we use the CONGRuENTS model for broadband non-thermal emission from star-forming galaxies, which self-consistently calculates energy-dependent transport and non-thermal emission from cosmic ray hadrons and leptons, to predict radio and {\\gamma}-ray emission for a synthetic galaxy population with properties drawn from a large deep-field survey. We show that our synthetic galaxies reproduce observed relations such as the FIR-radio correlation, the FIR-{\\gamma} correlation, and the distribution of radio spectral indices, and we use the model to explain the physical origins of these relations. Our results show that the FIR-radio correlation arises because the amount of cosmic ray electron power ultimately radiated as synchrotron emission varies only weakly with galaxy star formation rate as a result of the constraints imposed on gas properties by hydrostatic balance and turbulent dynamo action; the same physics dictates the extent of proton calorimetry in different galaxies, and thus sets the FIR-{\\gamma}-ray correlation. We further show that galactic radio spectral indices result primarily from competition between thermal free-free emission and energy-dependent loss of cosmic ray electrons to bremsstrahlung and escape into galactic halos, with shaping of the spectrum by inverse Compton, synchrotron, and ionisation processes typically playing a sub-dominant role. In addition to explaining existing observations, we use our analysis to predict a heretofore unseen correlation between the curvature of galaxies' radio spectra and their pion-driven {\\gamma}-ray emission, a prediction that will be testable with upcoming facilities.\n\n", "2310.05676": "2023-10-09, **Light Thermal Self-Interacting Dark Matter in the Shadow of Non-Standard Cosmology**, Shu-Yu Ho et.al., [2310.05676v1](http://arxiv.org/abs/2310.05676v1)\n\n In this paper, we construct a viable model for a GeV scale self-interacting dark matter (DM), where the DM was thermally produced in the early universe. In this model, a new vector-like fermion with a dark charge under the $U(1)\\_{D}$ gauge symmetry serves as a secluded WIMP DM and it can dominantly annihilate into the light dark gauge boson and singlet scalar through the dark gauge interaction. Also, the self-interaction of DM is induced by the light dark gauge boson via the same gauge interaction. In addition to these particles, we further introduce two Weyl fermions and a doublet scalar, by which the dark gauge boson produced from $s$-wave DM annihilations can mostly decay into active neutrinos after the dark symmetry breaking such that the CMB bound on the DM with low masses can be eluded. In order to have a common parameter region to explain the observed relic abundance and self-interaction of DM, we also study this model in a non-standard cosmological evolution, where the cosmic expansion driven by a new field species is faster than the standard radiation-dominated universe during the frozen time of DM. Reversely, one can also use the self-interacting nature of light thermal DM to examine the non-standard cosmological history of the universe.\n\n", "2310.05669": "2023-10-09, **Transverse Emittance Reduction in Muon Beams by Ionization Cooling**, MICE Collaboration et.al., [2310.05669v1](http://arxiv.org/abs/2310.05669v1)\n\n Accelerated muon beams have been considered for next-generation studies of high-energy lepton-antilepton collisions and neutrino oscillations. However, high-brightness muon beams have not yet been produced. The main challenge for muon acceleration and storage stems from the large phase-space volume occupied by the beam, derived from the muon production mechanism through the decay of pions from proton collisions. Ionization cooling is the technique proposed to decrease the muon beam phase-space volume. Here we demonstrate a clear signal of ionization cooling through the observation of transverse emittance reduction in beams that traverse lithium hydride or liquid hydrogen absorbers in the Muon Ionization Cooling Experiment (MICE). The measurement is well reproduced by the simulation of the experiment and the theoretical model. The results shown here represent a substantial advance towards the realization of muon-based facilities that could operate at the energy and intensity frontiers.\n\n", "2310.05614": "2023-10-09, **Recent results of cosmic-ray studies with IceTop at the IceCube Neutrino**, Donghwa Kang et.al., [2310.05614v1](http://arxiv.org/abs/2310.05614v1)\n\n The IceCube Neutrino Observatory is a cubic-kilometer Cherenkov detector that is deployed deep in the Antarctic ice at the South Pole. A square kilometer companion surface detector, IceTop, located directly above in the in-ice array, measures cosmic-ray initiated extensive air showers with primary energies between 100 TeV and 1 EeV. By combining the events measured by IceTop and the in-ice detectors of IceCube in coincidence, we can reconstruct the energy spectra for different primary mass groups. Therefore, we provide information about the origin of cosmic rays, in particular, in the transition region from galactic to extra-galactic origin of high-energy cosmic rays. In this contribution we present recent experimental results, as well as prospects by the foreseen enhancement of the surface detectors of IceTop and the future IceCube-Gen2 surface array.\n\n", "2310.05536": "2023-10-09, **Measurement of the muon flux at the SND@LHC experiment**, SND@LHC Collaboration et.al., [2310.05536v1](http://arxiv.org/abs/2310.05536v1)\n\n The Scattering and Neutrino Detector at the LHC (SND@LHC) is a compact standalone experiment, which started taking data at the beginning of Run 3 of the LHC. The experiment is designed to perform measurements with neutrinos produced in proton-proton collisions at the LHC in an energy range between 100 GeV and 1 TeV, and a previously unexplored pseudo-rapidity range of $7.2<\\eta<8.4$. The detector, located 480 m downstream of the ATLAS interaction point in the TI18 tunnel, comprises a veto system followed by an 830 kg target mass consisting of tungsten plates, interleaved with nuclear emulsion plates and Scintillating Fiber (SciFi) electronic trackers, and then a calorimeter and a downstream muon system (DS). The measurement of the muon flux in the TI18 tunnel using the nuclear emulsion tracker and the electronic detectors, SciFi tracker and downstream muon detector, is reported here. The muon flux per integrated luminosity through an 18$\\times$18 cm$^{2}$ area in the emulsions is $1.5 \\pm 0.1(\\textrm{stat}) \\times 10^4\\,\\textrm{fb/cm}^{2}$. The measured muon flux per integrated luminosity through a 31$\\times$31 cm$^{2}$ central SciFi area is $2.06\\pm0.01(\\textrm{stat})\\pm0.12(\\textrm{sys}) \\times 10^{4}\\,\\textrm{fb/cm}^{2}$, while for the downstream muon system the flux is $2.35\\pm0.01(\\textrm{stat})\\pm0.10(\\textrm{sys}) \\times 10^{4}\\,\\textrm{fb/cm}^{2}$ for a 52$\\times$52 cm$^{2}$ central detector region. The total relative uncertainty of the electronic detectors measurements is 6 $\\%$ for the SciFi and 4 $\\%$ for the DS measurement. The Monte Carlo simulation prediction of these fluxes is 20$-$25 $\\%$ lower than the measured values.\n\n", "2310.05474": "2023-10-09, **How much do neutrinos live and weigh?**, Federica Pompa et.al., [2310.05474v1](http://arxiv.org/abs/2310.05474v1)\n\n The next-generation water Cherenkov Hyper-Kamiokande detector will be able to detect thousands of neutrino events from a galactic Supernova explosion via Inverse Beta Decay processes followed by neutron capture on Gadolinium. This superb statistics provides a unique window to set bounds on neutrino properties, as its mass and lifetime. We shall explore the capabilities of such a future detector, constraining the former two properties via the time delay and the flux suppression induced in the Supernovae neutrino time and energy spectra. Special attention will be devoted to the statistically sub-dominant elastic scattering induced events, normally neglected, which can substantially improve the neutrino mass bound via time delays. When allowing for a invisible decaying scenario, the $95\\%~$C.L. lower bound on $\\tau/m$ is almost one order of magnitude better than the one found with SN1987A neutrino events. Simultaneous limits can be set on both $m\\_\\nu$ and $\\tau\\_{\\nu}$, combining the neutrino flux suppression with the time-delay signature: the best constrained lifetime is that of $\\nu\\_1$, which has the richest electronic component. We find $\\tau\\_{\\nu\\_1}\\gtrsim 4\\times 10^5~$s at $95\\%~$C.L. The tightest $95\\%~$C.L. bound on the neutrino mass we find is $0.34~$eV, which is not only competitive with the tightest neutrino mass limits nowadays, but also comparable to future laboratory direct mass searches. Both mass and lifetime limits are independent on the mass ordering, which makes our results very robust and relevant.\n\n", "2310.05420": "2023-10-09, **Féeton ($B-L$ Gauge Boson) Dark Matter for the 511-keV Gamma-Ray Excess and the Prediction of Low-energy Neutrino Flux**, Yu Cheng et.al., [2310.05420v1](http://arxiv.org/abs/2310.05420v1)\n\n The f\\'eeton is the gauge boson of the $U(1)\\_{B-L}$ gauge theory. If the gauge coupling constant is extremely small, it becomes a candidate for dark matter. We show that its decay to a pair of electron and positron explains the observed Galactic 511-keV gamma-ray excess in a consistent manner. This f\\'eeton dark matter decays mainly into pairs of neutrino and anti-neutrino. Future low-energy experiments with improved directional capability make it possible to capture those neutrino signals. The seesaw-motivated parameter space predicts a relatively short f\\'eeton lifetime comparable to the current cosmological constraint.\n\n", "2310.05137": "2023-10-08, **Effects of Annihilation with Low-Energy Neutrinos on High-Energy Neutrinos from Binary Neutron Star Mergers and Rare Core-Collapse Supernovae**, Gang Guo et.al., [2310.05137v1](http://arxiv.org/abs/2310.05137v1)\n\n We explore the possibility that high-energy (HE) neutrinos produced at mildly relativistic shocks can be annihilated with low-energy (LE) neutrinos emitted from the accretion disk around a black hole in binary neutron star mergers and rare core-collapse supernovae. For HE neutrinos produced close to the stellar center ($\\lesssim 10^{9}-10^{11}$ cm), we find that the emerging all-flavor spectrum for neutrinos of $E\\gtrsim 0.1$ PeV could be modified by a factor $E^{-n}$ with $n\\approx 0.4-0.5$. Flavor evolution of LE neutrinos does not affect this result but can change the emerging flavor composition of HE neutrinos. As a consequence, the above annihilation effect needs to be considered for HE neutrinos produced at nonrelativistic or mildly relativistic shocks at small radii. In particular, we point out that models of core-collapse supernovae with slow jets and charmed meson decay can better fit the diffuse HE neutrino flux observed by IceCube if annihilation of HE and LE neutrinos is taken into account. Moreover, the relevance of charmed meson and the annihilation effect can be tested by precise measurements of the diffuse neutrino spectrum and flavor composition.\n\n", "2310.05050": "2023-10-08, **Universality of the Neutrino Collisional Flavor Instability in Core Collapse Supernovae**, Jiabao Liu et.al., [2310.05050v1](http://arxiv.org/abs/2310.05050v1)\n\n Neutrinos are known to undergo flavor conversion processes among the three flavors. The fast flavor conversion (FFC) has been the central piece of flavor conversions taking place in core-collapse supernovae (CCSNe) due to its shorter timescale to the completion of flavor conversion compared to other types of flavor conversion. Although the ordinary collisions between neutrinos and matter were once thought to decohere neutrinos and thus damp flavor conversions, it was recently realized that they can also induce the flavor conversion. The linear analysis showed that the so-called collisional flavor instability or CFI occurs in the absence of FFC. In this paper, we investigate if CFI takes place in of the post-bounce core of CCSNe, using the results of spherically symmetric Boltzmann simulations of CCSNe for four progenitor models with different masses. We also provide a necessary (but not sufficient) condition of matter properties for the occurrence of CFI in optically thick and semi-transparent regions; baryon mass density ($\\rho$), electron fraction ($Y\\_e$), and the degeneracy of electron-type neutrinos ($\\eta\\_{\\nu\\_e}$) need to be $10^{10} {\\rm g/cm^3} \\lesssim \\rho \\lesssim 10^{12} {\\rm g/cm^3}$, $Y\\_e\\lesssim 0.4$, and $\\eta\\_{\\nu\\_e} \\lesssim 0.5$, respectively. This condition allows us to easily locate the place of possible CFI occurence without detailed stability analyses, which is useful for analyzing CFI in CCSN models phenomenologically\n\n"}, "dark matter": {"2310.05827": "2023-10-09, **A Leptonic ALP Portal to the Dark Sector**, Giovanni Armando et.al., [2310.05827v1](http://arxiv.org/abs/2310.05827v1)\n\n We discuss the leptonic ALP portal as a simple scenario that connects observed discrepancies in anomalous magnetic moments to the Dark Matter relic abundance. In this framework an axion-like particle in the multi-MeV range couples to SM leptons and a DM fermion, with mass above the ALP mass but below a GeV. The ALP contributes to $(g-2)\\_\\mu$ and $(g-2)\\_e$ dominantly through 2-loop Barr-Zee diagrams, while the DM abundance is generated by $p$-wave annihilation to ALP pairs. Constraints from beam-dump experiments, colliders and CMB probes are very stringent, and restrict the viable parameter space to a rather narrow region that will be tested in the near future.\n\n", "2310.05815": "2023-10-09, **Light Dark Matter Search Using a Diamond Cryogenic Detector**, CRESST Collaboration et.al., [2310.05815v1](http://arxiv.org/abs/2310.05815v1)\n\n Diamond operated as a cryogenic calorimeter is an excellent target for direct detection of low-mass dark matter candidates. Following the realization of the first low-threshold cryogenic detector that uses diamond as absorber for astroparticle physics applications, we now present the resulting exclusion limits on the elastic spin-independent interaction cross-section of dark matter with diamond. We measured two 0.175 g CVD (Chemical Vapor Deposition) diamond samples, each instrumented with a W-TES. Thanks to the energy threshold of just 16.8 eV of one of the two detectors, we set exclusion limits on the elastic spin-independent interaction of dark matter particles with carbon nuclei down to dark matter masses as low as 0.122 GeV/c2. This work shows the scientific potential of cryogenic detectors made from diamond and lays the foundation for the use of this material as target for direct detection dark matter experiments.\n\n", "2310.05578": "2023-10-09, **Dynamics of viable $f(R)$ dark energy models in the presence of Curvature-Matter interactions**, Anirban Chatterjee et.al., [2310.05578v1](http://arxiv.org/abs/2310.05578v1)\n\n In this study, we analyze the dynamics of the interaction between dark matter and curvature-driven dark energy in viable $f(R)$ gravity models using the framework of dynamical system analysis. We incorporate this interaction by introducing a source term in their respective continuity equations, given by $Q = \\frac{\\kappa^2 \\alpha}{3H}\\tilde{\\rho}\\_{\\rm m}\\rho\\_{\\rm curv}$, and examine two $f(R)$ gravity models that comply with local gravity constraints and cosmological viability criteria. Our findings reveal subtle modifications to fixed points and their stability criteria when compared to the conventional dynamical analysis of $f(R)$ gravity models without matter-curvature interactions as proposed and examined in prior literature. We determine the parameter limits associated with the stability criteria of critical points of the dynamical system for both the models. Additionally, the introduction of interaction reveals variations in the dynamical aspects of cosmic evolution, contingent on the range of values for the relevant model parameters. These results are consistent with the observed features of cosmic evolution within specific limits of the $f(R)$ models parameters and the coupling parameter $\\alpha$. We also examine the evolutionary dynamics of the universe in the interacting scenario, in the context of cosmological and cosmographic parameters. Our analysis demonstrates that the interacting scenario comprehensively accounts for all the observed phases of the universe's evolution and also results in a stable late-time cosmic acceleration. Furthermore, we have examined the impact of the coupling parameter on the evolutionary dynamics, specifically in terms of its influence on the evolution of the matter-to-curvature energy density ratio.\n\n", "2310.05238": "2023-10-08, **Quantum Sensing with superconducting qubits for Fundamental Physics**, Roberto Moretti et.al., [2310.05238v1](http://arxiv.org/abs/2310.05238v1)\n\n Quantum Sensing is a rapidly expanding research field that finds one of its applications in Fundamental Physics, as the search for Dark Matter. Recent developments in the fabrication of superconducting qubits are contributing to driving progress in Quantum Sensing. Such devices have already been successfully applied in detecting few-GHz single photons via Quantum Non-Demolition measurement (QND). This technique allows us to detect the presence of the same photon multiple times without absorbing it, with remarkable sensitivity improvements and dark count rate suppression in experiments based on high-precision microwave photon detection, such as Axions and Dark Photons search experiments. In this context, the INFN Qub-IT project goal is to realize an itinerant single-photon counter based on superconducting qubits that will exploit QND. The simulation step is fundamental for optimizing the design before manufacturing and finally characterizing the fabricated chip in a cryogenic environment. In this study we present Qub-IT's status towards the characterization of its first superconducting transmon qubit devices, illustrating their design and simulation.\n\n", "2310.05221": "2023-10-08, **Inflationary models constrained by reheating**, Gabriel German et.al., [2310.05221v1](http://arxiv.org/abs/2310.05221v1)\n\n The study of reheating in inflationary models is crucial for understanding the early universe and gaining insights into inflationary dynamics and parameters. The reheating temperature $T\\_{re}$ and the duration of the reheating phase, quantified by the number of $e$-folds $N\\_{re}$, have significant implications for particle production, thermalization, and the primordial power spectrum. The duration of reheating affects particle abundance, including dark matter, and shapes the primordial power spectrum and cosmic microwave background anisotropies. By combining cosmological observations and theoretical considerations, we can constrain both $T\\_{re}$ and $N\\_{re}$, which in turn constrain the spectral index $n\\_s$, tensor-to-scalar ratio $r$, and inflation model parameters. Utilizing consistency relations among observables, such as $n\\_s$ and $r$, provides additional constraints on inflationary models and determines bounds for other observables like the running of the scalar spectral index. These bounds are valuable for assessing the viability of models and can serve to specify priors in Bayesian analyses of specific models. As an example of how to proceed, we study in detail a particular case of a generalized $\\alpha$-attractor model that accurately reproduces observed quantities. We present equations for the conditions of instantaneous reheating, establish consistency relations, and explore the generalized $\\alpha$-attractor model using cosmological data.\n\n"}, "supernova": {"2310.05834": "2023-10-09, **Observations of Multiphase, High-Velocity, Shocked Gas in the Vela Supernova Remnant**, Adam M. Ritchey et.al., [2310.05834v1](http://arxiv.org/abs/2310.05834v1)\n\n We present an analysis of high-resolution far-ultraviolet archival spectra obtained with the Space Telescope Imaging Spectrograph on the Hubble Space Telescope of the star HD 75309, which probes high-velocity shocked gas in the Vela supernova remnant (SNR). We examine high-velocity features from intrinsically strong absorption lines of O I, Si II, Si II*, C II, C II*, and Si III. We also detect high-velocity components in the N V doublet and compare these features to observations of high-velocity O VI absorption, available from archival Far Ultraviolet Spectroscopic Explorer data. Kinetic temperatures are derived from the observed fractional abundances of the various ions, while gas densities and thermal pressures are obtained from the relative populations in excited fine-structure levels of C II and Si II. Our results indicate that the highly ionized species at high velocity probe gas in a region immediately behind a shock driven into an interstellar cloud, while the lower ionization species trace material further downstream in the cooling region of the post-shock flow. Low velocity N V and O VI absorption may trace gas in a conductive boundary layer between the unshocked portion of the cloud and the hot X-ray emitting intercloud medium. Temporal variations in high velocity Ca II absorption features observed toward HD 75309 further confirm the highly inhomogeneous nature of the interstellar medium interacting with the Vela SNR.\n\n"}}