{"neutrino": {"2511.16658": "2025-11-20, **Prospects for Neutrino Observation and Mass Measurement from Binary Neutron Star Mergers**, Vedran Brdar et.al., [2511.16658v1](http://arxiv.org/abs/2511.16658v1)\n\n Over the next decade, $\\mathcal{O}(100)$ diffuse supernova neutrino background (DSNB) events are expected in Hyper-Kamiokande. Another neutrino source that has received far less attention is binary neutron star mergers. Including the data from recent simulations, we find that detection in current and near-future neutrino experiments is not feasible, and a megaton-scale detector with $\\mathcal{O}(10)$ MeV threshold, such as the proposed Deep-TITAND, MEMPHYS, or MICA, will be required. This is due to the updated binary neutron star merger rate and the time-of-flight delay caused by the nonzero neutrino mass. Regarding the former, recent results from LIGO, Virgo, and KAGRA has significantly lowered the upper limit on the neutron star merger rate. As for the latter, neutrino events from neutron star mergers are expected to be recorded shortly after the gravitational wave signal. Limiting the analysis to such short time windows can significantly reduce background rates. While this approach has been qualitatively discussed in the literature, the effect of the time delay caused by neutrino mass, which can substantially extend the observation windows, has been disregarded. We present a refined analysis employing energy-dependent time windows and luminosity distance cuts for the mergers and provide realistic estimates of the detector runtime required to record neutrinos from binary neutron star mergers with small background contamination. The relative timing between the neutrino and gravitational wave signals can also be employed to probe the scale of neutrino mass. We find that the sensitivity to the lightest neutrino mass exceeds both the most stringent terrestrial bounds from KATRIN and the projections based on galactic supernovae. This level of sensitivity may become particularly relevant in the future if terrestrial and supernova constraints are not significantly improved.\n\n", "2511.16631": "2025-11-20, **A Core-Collapse Supernova Neutrino Parameterization with Enhanced Physical Interpretability**, Haihao Shi et.al., [2511.16631v1](http://arxiv.org/abs/2511.16631v1)\n\n We introduce a novel parameterization of supernova neutrino energy spectra with a clear physical motivation. Its central parameter, $τ(t)$, quantifies the characteristic thermal-diffusion area during the explosion. When applied to the historic SN1987A data, this parameterization yields statistically significant fits and provides robust constraints on the unobserved low-energy portion of the spectrum. Beyond this specific application, we demonstrate the model's power on a suite of 3D core-collapse supernova simulations, finding that the temporal evolution of $τ(t)$ distinctly separates successful from failed explosions. Furthermore, we constrain the progenitor mass of SN 1987A to approximately 19 solar masses by applying Smoothed Isotonic Regression, while noting the sensitivity of this estimate to observational uncertainties. Moreover, in these simulations, $τ(t)$ and the gravitational-wave strain amplitude display a strong, synergistic co-evolution, directly linking the engine's energetic evolution to its geometric asymmetry. This implies that the thermodynamic state of the explosion is imprinted not only on the escaping neutrino flux, but also recorded in the shape of the energy spectrum. Our framework therefore offers a valuable tool for decoding the detailed core dynamics and multi-messenger processes of future galactic supernovae.\n\n", "2511.16614": "2025-11-20, **Deep Learning Framework for Enhanced Neutrino Reconstruction of Single-line Events in the ANTARES Telescope**, A. Albert et.al., [2511.16614v1](http://arxiv.org/abs/2511.16614v1)\n\n We present the $N$-fit algorithm designed to improve the reconstruction of neutrino events detected by a single line of the ANTARES underwater telescope, usually associated with low energy neutrino events ($\\sim$ 100 GeV). $N$-Fit is a neural network model that relies on deep learning and combines several advanced techniques in machine learning --deep convolutional layers, mixture density output layers, and transfer learning. This framework divides the reconstruction process into two dedicated branches for each neutrino event topology --tracks and showers-- composed of sub-models for spatial estimation --direction and position-- and energy inference, which later on are combined for event classification. Regarding the direction of single-line events, the $N$-Fit algorithm significantly refines the estimation of the zenithal angle, and delivers reliable azimuthal angle predictions that were previously unattainable with traditional $χ^2$-fit methods. Improving on energy estimation of single-line events is a tall order; $N$-Fit benefits from transfer learning to efficiently integrate key characteristics, such as the estimation of the closest distance from the event to the detector. $N$-Fit also takes advantage from transfer learning in event topology classification by freezing convolutional layers of the pretrained branches. Tests on Monte Carlo simulations and data demonstrate a significant reduction in mean and median absolute errors across all reconstructed parameters. The improvements achieved by $N$-Fit highlight its potential for advancing multimessenger astrophysics and enhancing our ability to probe fundamental physics beyond the Standard Model using single-line events from ANTARES data.\n\n", "2511.16506": "2025-11-20, **Two-beam Multiparticle Many-body simulations of Inhomogeneous FFI**, Zoha Laraib et.al., [2511.16506v1](http://arxiv.org/abs/2511.16506v1)\n\n Neutrino flavor evolution in dense astrophysical environments is inherently nonlinear and sensitive to many-body (MB) quantum effects beyond the mean-field (MF) approximation. Existing MB studies are constrained by small system sizes, closed boundaries, and highly idealized symmetry assumptions. We present a unified tensor-network framework that enables simulations of inhomogeneous and anisotropic flavor evolution under conditions relevant to core-collapse supernovae and neutron-star mergers. Within this framework, we examine the effects of inhomogeneity, boundary conditions, and convergence with resolution for multiple neutrino distributions, allowing direct comparison of these setups under one consistent formulation. In our simulations, many-body systems equilibrate earlier than their mean-field counterparts while approaching similar final flavor states. Enlarging the interaction region allows open boundaries to reproduce closed-system behavior, but only when the beams begin superimposed and interact continuously. By contrast, initially separated configurations develop entanglement more slowly, interact over longer times, and equilibrate to a flavor content that differs from that obtained from initially superimposed calculations.\n\n", "2511.16408": "2025-11-20, **Development & Characterization of Electrodes for large-scale Xenon Time Projection Chambers**, A. Elykov et.al., [2511.16408v1](http://arxiv.org/abs/2511.16408v1)\n\n Dual-phase liquid xenon time projection chambers are the core detector elements of many experiments that conduct searches for Dark Matter and rare events, as well as in neutrino and high-energy physics. As part of this detector technology, high-voltage electrodes are instrumental for the generation of observable signals and their physical interpretation. Thus, electrode design and manufacturing has to fulfill stringent requirements, and their production is associated with significant engineering challenges. In this work we describe the successful development of electrodes on the 1.5 m-scale, from their design and simulation to subsequent assembly and high-voltage testing in a gaseous argon environment. The produced electrodes were recently installed as an anode and a cathode during an upgrade to the XENONnT experiment.\n\n", "2511.16196": "2025-11-20, **Probing quark-lepton correlation in GUTs with high-precision neutrino measurements**, Zi-Qiang Chen et.al., [2511.16196v1](http://arxiv.org/abs/2511.16196v1)\n\n GUTs unify quarks and leptons into same representations and predict correlations between their masses and mixing. We take new data of JUNO and perform numerical scans to explore the flavor space compatible with data in SO(10) GUTs. The quark-lepton correlation shows the preference of normal ordering for light neutrino masses, predicts favored region of the CP-violating phase in neutrino oscillations, and classifies GUT models based their testability in neutrinoless double beta decay experiments. The quark-lepton correlation predicts mass spectrum of right-handed neutrinos, pointing to the energy scale of baryon and lepton number violation and providing sources for baryogenesis. We emphasize that, as the high precision measurements of neutrino physics is coming, the quark-lepton correlation will provide increasingly important role in the testability of GUTs, complementary to the proton decay measurement.\n\n", "2511.16181": "2025-11-20, **Neutrino oscillations induced by a new bumblebee black hole**, Yuxuan Shi et.al., [2511.16181v1](http://arxiv.org/abs/2511.16181v1)\n\n This work investigates neutrino propagation in the spacetime of a newly introduced black hole arising from spontaneous Lorentz-symmetry breaking in bumblebee gravity. The analysis focuses on three independent components: the rate at which neutrino-antineutrino annihilation deposits energy in the surrounding region, the geometric contribution to the phase accumulated by neutrino mass eigenstates, and the modifications to flavor conversion produced by weak gravitational lensing. Working with a two-flavor system, both mass orderings are examined, and the calculation incorporates the interference between distinct trajectories reaching the detector. The numerical results show that the Lorentz-violating deformation substantially increases the efficiency of the annihilation channel, produces characteristic shifts in the oscillation phase not present in earlier bumblebee configurations, and reshapes the angular dependence of the lensing-induced flavor transition pattern.\n\n", "2511.15978": "2025-11-20, **Modified Tri-bimaximal neutrino mixing confront with JUNO $θ_{12}$ measurement**, Xiao-Gang He et.al., [2511.15978v1](http://arxiv.org/abs/2511.15978v1)\n\n JUNO collaboration has realsed its first measurement of reactor neutrino oscillations results with $\\sin^2θ\\_{12} = 0.3092\\pm 0.0087$ which improved the precision by a factor of 1.6 relative to the combination of all previous measurements. We confront the minimally modifred tri-bimaximal mixing pattern with the new data. Before the measurement of a non-zero $θ\\_{13}$ mixing angle, the tri-bimximal mixing pattern predicting $θ\\_{13}$ to be zero is one of the most popular simple ones. Modifications have been proposed to keep some features of tri-bimaximal mixing and make it to be consistent with data. One minimal scheme is to keep one of the coloums unchanged by modifing the neutrino mass matrix in models based on $A\\_4$ flavor symmetry. Three mixing patterms ermergy, a) the third, b) the second and c) the first column in the $3\\times 3$ mixing matrix separately unchaged. The option a) mantains the feature that $θ\\_{13}=0$ which is in conflect with data on $θ\\_{13}$ and therefore is ruled out. The option b) is the interesting mixing pattern with $θ\\_{13}$ nonzero, but predicts $V\\_{e2} = 1/\\sqrt{3}$ with interesting predictions for CP violation and other mixing angles. The new $θ\\_{12}$ value measured by JUNO with $\\|V\\_{e2}\\|$ is, however, smaller than $1/\\sqrt{3}$ at a more than 3.5$σ$ level making the search for alternative new paterns desirable. The option c) predicts $V\\_{e2} = cosα/\\sqrt{3}$ which can also accommodate known data at a better than 1$σ$ level. This mixing pattern predicts $\\sin^2θ\\_{12} = 1-3\\sin^2θ\\_{13}$. The model favors inverted neutrino mass herarcy with CP violating variable $\\sin θ-0.84$ . Near future experiments can test the model.\n\n"}, "dark matter": {"2511.16554": "2025-11-20, **Dark Matter-Dark Radiation Interactions and the Hubble Tension**, Manuel A. Buen-Abad et.al., [2511.16554v1](http://arxiv.org/abs/2511.16554v1)\n\n Models in which a subcomponent of dark matter interacts with dark radiation have been proposed as a solution to the Hubble tension. In this framework, the interacting subcomponent of dark matter is in thermal equilibrium with the dark radiation in the early universe, but decouples from it around the time of matter-radiation equality. We study this general class of models and evaluate the quality of fit to recent cosmological data on the cosmic microwave background (from Planck 2018 and ACT DR6), baryon acoustic oscillations, large-scale structure, supernovae type Ia, and Cepheid variables. We focus on three benchmark scenarios that differ in the rate at which the dark matter decouples from the dark radiation, resulting in different patterns of dark acoustic oscillations. Fitting without ACT DR6 data, we find that all three scenarios significantly reduce the Hubble tension relative to $Λ$CDM, with an exponentially fast decoupling being the most preferred. The tension is reduced to less than $2 \\, σ$ in fits that don't include the SH0ES collaboration results as part of the data and to less than $1 \\, σ$ when these are included. When ACT DR6 data is included, the fit is significantly worsened. We find that the largest $H\\_0$ value at the $95 \\%$ confidence region is $70.1$ km/s/Mpc without the SH0ES data, leading to only a mild reduction in the tension. This increases to $72.5$ km/s/Mpc, corresponding to a reduction in the tension to less than $3 \\, σ$, if the SH0ES results are included in the fit.\n\n", "2511.16553": "2025-11-20, **Search for Ultralight Dark Matter with Quantum Magnetometry in the Earth's Cavity**, Ariel Arza et.al., [2511.16553v1](http://arxiv.org/abs/2511.16553v1)\n\n Ultralight dark matter candidates, such as axions and dark photons, are leading dark matter candidates. They may couple feebly to photons, sourcing oscillating electromagnetic signals in the presence of magnetic field. The Earth resonant cavity formed between the ground and the ionosphere provides a natural waveguide that can amplify such signals. We carry out a project aiming to search for new physics using the unshielded high-sensitivity atomic magnetometer, termed the Geomagnetic Probe for nEw physiCS (GPEX). In this work, we report our first search for axion and dark photon dark matter, conducted in the desert of XiaoDushan in Gansu Province, China. Analysis of the collection of one-hour data shows no evidence for axion- or dark photon-induced magnetic signals. Correspondingly, we set the constraints on the axion-photon coupling with $g\\_{aγγ} < 7\\times10^{-10}\\, \\mathrm{GeV^{-1}}$ and the dark photon kinetic-mixing parameter $ε< 2\\times10^{-6}$ in the mass range $3.5 \\times 10^{-16}\\, \\mathrm{eV} \\sim 1.8 \\times 10^{-14}\\, \\mathrm{eV}$. Our findings demonstrate the feasibility of using ground-based quantum magnetic sensors for ultralight dark matter searches. Future networks of such detectors operating over extended periods could further enhance sensitivity, approaching the limits set by astrophysical observations.\n\n", "2511.16487": "2025-11-20, **WIMP Freeze-out dynamics under Tsallis statistics**, Matias P. Gonzalez et.al., [2511.16487v1](http://arxiv.org/abs/2511.16487v1)\n\n We generalize thermal WIMP (Weakly Interacting Massive Particle) freeze-out within Tsallis nonextensive statistics. Using Curado-Tsallis $q$-distributions $f\\_q(E;μ,T)$ we compute $q$-deformed number and energy densities, pressure, entropy density and Hubble rate, $\\{n\\_q,ρ\\_q,P\\_q,s\\_q,H\\_q\\}$. The Boltzmann equation is generalized accordingly to obtain the comoving abundance $Y\\_{χ,q}(x)$ and relic density $Ω\\_{χ,q}h^2$ for a dark-matter candidate $χ$ in a model-independent setup. The thermally averaged cross section is expanded as $\\langleσv\\rangle\\_q \\approx a + b\\,\\langle v\\_{\\rm rel}^2\\rangle\\_q$ up to $p$-wave. The freeze-out parameter $x\\_f(q)$ is determined from $Γ\\_{{\\rm ann},q}(T\\_f)\\simeq H\\_q(T\\_f)$ using a $q$-logarithmic inversion, with the expansion rate modified through ultra-relativistic rescalings $R\\_ρ(q)$ of the effective relativistic degrees of freedom $g\\_*$ and $g\\_{*s}$. We show that $x\\_f$ increases with $q$ and that QCD-threshold features propagate into $Y\\_{χ,q}(x)$ and $Ω\\_{χ,q}h^2$. We then perform two $q$-grid scans: fixing $\\langleσv\\rangle\\_q$ while varying the dark-matter mass $m\\_χ$, and fixing $m\\_χ$ while varying the $s$-wave coefficient $a$. For an $s$-wave dominated scenario we construct $χ^2$ profiles in these planes by comparing $Ω\\_{χ,q}h^2$ with the Planck benchmark $Ω\\_c h^2 = 0.120\\pm 0.001$. In both cases we find a clear degeneracy in the preferred nonextensive parameter $q\\_{\\rm best}$ along valleys in parameter space. However, fixed-mass scans (varying $\\langleσv\\rangle\\_q$) are significantly more constraining than fixed-cross-section scans, reflecting that $Ω\\_{χ,q}h^2$ is mainly controlled by $\\langleσv\\rangle\\_q$, so that for realistic cross sections the best-fit $q\\_{\\rm best}$ remains close to the extensive limit $q\\to 1$.\n\n", "2511.16464": "2025-11-20, **Collision frequency between dark matter subhaloes within Milky Way-like galaxies**, Koki Otaki et.al., [2511.16464v1](http://arxiv.org/abs/2511.16464v1)\n\n In the standard cold dark matter (CDM) model, sub-galactic structures hierarchically collide and merge to build up larger structures. Mergers and collisions between dwarf galaxies and dark matter subhaloes (DMSHs) play an important role in the evolution and formation of structures within a massive galaxy. We investigate the collision frequency between DMSHs associated with a massive host galaxy such as the Milky Way. We analytically estimate the density distribution of DMSH pairs for the relative distance and relative velocity ($r\\_\\mathrm{rel}$-$v\\_\\mathrm{rel}$) and the distance from the centre of the host halo and relative velocity ($r$-$v\\_\\mathrm{rel}$) planes, based on the distribution function of the host halo in the phase space. Then, we evaluate the collision frequencies of DMSHs by integrating the orbital evolution of DMSHs in Milky-Way-like host haloes selected from cosmological $N$-body simulations. The frequency of violent encounters, in which the relative distance of DMSHs is shorter than the sum of scale radii, is averaged as $2.1\\times 10^2\\,\\mathrm{Gyr}^{-1}$. Since the time scale of violent encounters, $4.7\\,\\mathrm{Myr}$, is shorter than the dynamical time of the host halo, collisions between DMSHs occur frequently within the host halo. Although interactions between DMSHs produce pairs with higher relative velocities, the density distributions of all and colliding pairs between DMSHs provided by numerical results are approximately similar to those of the analytical model neglecting the interactions of DMSHs on $r\\_\\mathrm{rel}$-$v\\_\\mathrm{rel}$ plane for all pairs and $r$-$v\\_\\mathrm{rel}$ plane for colliding pairs. We compare our results with observed colliding dwarf galaxies and provide insight into the abundance of DMSHs.\n\n", "2511.16462": "2025-11-20, **Systems for detecting and measuring backgrounds with the SABRE South experiment**, L. J. Milligan et.al., [2511.16462v1](http://arxiv.org/abs/2511.16462v1)\n\n The SABRE (Sodium iodide with Active Background REjection) experiment aims to detect an annual rate modulation from dark matter interactions in ultra-high purity NaI(Tl) crystals which will provide a model independent test of the signal observed by DAMA/LIBRA. SABRE will consist of two separate detectors in the Northern and Southern hemispheres. SABRE South will be located in the newly completed Stawell Underground Physics Laboratory (SUPL), the first deep underground laboratory in the southern hemisphere. The combination of SABRE North and South is intended to disentangle seasonal or site-related effects from the dark matter-like modulated signal. Measuring and understanding backgrounds is essential for the reliability and consistent performance of these searches, and as the first large detector in SUPL SABRE South will also be used to measure backgrounds from radiogenic and cosmogenic sources. The SABRE South veto system is designed to detect the signals generated by radiation and cosmic rays using a 12 kL linear alkyl-benzene (LAB) based liquid scintillator (LS) detector contained in a steel vessel and instrumented with 18 Hamamatsu R5912 photomultiplier tubes (PMTs), alongside a plane of 8 plastic scintillator modules (instrumented with 2 R13089 PMTs) located above the vessel to reliably detect muons from cosmic-rays with a position resolution of 5 cm.\n\n", "2511.16451": "2025-11-20, **The SABRE South Experiment at the Stawell Underground Physics Laboratory**, L. J. Milligan et.al., [2511.16451v1](http://arxiv.org/abs/2511.16451v1)\n\n SABRE aims to provide a test of the signal observed by DAMA/LIBRA through two separate detectors that rely on joint ultra-high NaI(Tl) purity crystal R&D activities: SABRE South at SUPL Australia and SABRE North at LNGS Italy. SABRE South is designed to disentangle seasonal and site-related effects from the dark matter-like modulated signal. Ultra-high purity crystals are immersed in a liquid scintillator veto, further surrounded by passive shielding and a plastic scintillator muon veto. Significant work has been undertaken to assess and mitigate background from the detector materials, and to understand the performance of both the crystal and veto systems. SUPL is a newly built facility located 1024 m underground in Australia. SABRE South is currently being assembled and will be completed in 2025, with first subsystems already installed in SUPL. This proceedings will report on the general status of the SABRE South assembly, its expected performance, and the design of SUPL.\n\n", "2511.16354": "2025-11-20, **Composite Asymmetric Dark Matter from Primordial Black Holes**, Takumi Kuwahara et.al., [2511.16354v1](http://arxiv.org/abs/2511.16354v1)\n\n We investigate a cogenesis scenario for composite asymmetric dark matter framework: a dark sector has a similar strong dynamics to quantum chromodynamics in the standard model, and the dark-sector counterpart of baryons is the dark matter candidate. The Hawking evaporation of primordial black holes plays the role of a source of heavy scalar particles whose $CP$-violating decay into quarks and dark quarks provides particle--anti-particle asymmetries in baryons and dark matter, respectively. Primordial black holes should evaporate after the electroweak phase transition and before the big-bang nucleosynthesis for explaining the baryon asymmetry of the Universe and for consistent cosmology. We find that this scenario explains the observed values for both baryon and dark matter energy densities when the heavy scalar particles have a mass of $10^6 \\text{--} 10^9\\, \\mathrm{GeV}$ and the primordial black holes have masses of $10^7 \\text{--} 10^9\\,\\mathrm{g}$.\n\n", "2511.16244": "2025-11-20, **Constraining interacting dark energy models with black hole superradiance**, Zhen-Hong Lyu et.al., [2511.16244v1](http://arxiv.org/abs/2511.16244v1)\n\n The recent preference for a dynamical dark energy (DE) from the Dark Energy Spectroscopic Instrument seems to call for interactions between DE and dark matter (DM), either from direct DM-DE interaction or indirect interaction induced by modified gravity. Therefore, an independent probe for these kinds of DE-DM interactions would be appealing from observational aspects. In this paper, we propose the black hole superradiance as a novel astrophysical probe for field-theoretic interacting DE-DM models, providing complementary constraints independent of large-scale cosmological observations. The core principle is that the DE-DM interaction can alter the effective mass of the superradiant ultralight boson, thereby modifying its superradiant instability rate around spinning black holes. We explore this connection through two distinct scenarios: a model where the DE field mediates a dark fifth force within the DM sector, affecting the superradiance from DM particles; and a novel mechanism where the DE field itself becomes superradiant due to the effective mass enhancement induced by dense DM spikes around supermassive black holes. By applying a statistical framework to black hole observations in both scenarios, we derive constraints on the fundamental DE-DM coupling strength. Although the current constraints are rather loose due to small samples and inaccurate measurements, our work provides new astrophysical constraints on these interacting DE-DM scenarios and establishes a new synergy between black hole physics and cosmology for probing the fundamental nature of the dark sector.\n\n", "2511.16130": "2025-11-20, **Creation of Viscous Dark Energy by the Hubble Flow: Comparison with SNe Ia Master Sample Binned Data**, Iolanda Navonea et.al., [2511.16130v1](http://arxiv.org/abs/2511.16130v1)\n\n We study a cosmological model featuring evolutionary dark energy, according to the idea that the creation of its constituents arises from the gravitational field of the expanding universe, whose non-equilibrium physics is described by a non-zero bulk viscosity coefficient. This physical scenario calls for two additional parameters with respect to the ΛCDM model, one of which is the equation of state parameter of the created dark energy. The model is constrained by the requirement that its deceleration parameter coincides with the one predicted by the ΛCDM model. Then, we construct the effective running Hubble constant, a theoretical function that corresponds to the ratio of the Hubble parameter in our model to the ΛCDM expansion rate. The model's theoretical predictions for the effective running Hubble constant are compared with the binned data of the Supernovae Ia Master Sample. The comparison is performed by a MCMC procedure for each bin, with three parameters left free to vary, while the particle creation rate is taken from a grid of values, each of which is fixed in the given MCMC run. The most important result emerging from this analysis is that the created dark energy constituent corresponds to an equation of state parameter with phantom character. Only if particle creation is removed do the dark energy constituents acquire a quintessence character. No matter the intrinsic nature of the constituents, their effective z-dependent equation of state parameter is, both with and without considering particle creation, entirely of phantom nature across the considered redshift range.\n\n"}, "supernova": {"2511.16594": "2025-11-20, **FQ Circini: An Ordinary Nova with a High-mass B1 V(n)(e) Companion Whose Decretion Disk Transfers Mass to the White Dwarf via Roche-Lobe Overflow**, Bradley E. Schaefer et.al., [2511.16594v1](http://arxiv.org/abs/2511.16594v1)\n\n FQ Cir was an ordinary fast He/N classical nova, peaking at $V$=10.9. The pre-eruption and post-eruption counterpart was at $V$=14.0, making the smallest known classical nova amplitude of 3.1 mag. The nova light and the counterpart coincide to 0.034 arc-seconds, and the counterpart is a rare hot/blue emission-line star with flickering, so the identification of the quiescent nova is certain. The counterpart is a weak Be main sequence star, B1 V(n)(e). A coherent photometric period appears in all four {\\it TESS} Sectors and in the AAVSO post-eruption light curve, as ellipsoidal modulation with orbital period 2.041738 days. The companion must have been spun-up to a fast rotation, and like all Be stars, a decretion disk is exuded. With the constraints of the blackbody radius and the main sequence, the companion mass is 13.0$^{+0.2}\\_{-0.5}$ $M\\_{\\odot}$, with radius 6.2$\\pm$0.2 $R\\_{\\odot}$. This is the discovery of a cataclysmic variable with a high-mass companion, a new class that we call `High Mass Cataclysmic Variables'. The white dwarf mass is 1.25$\\pm$0.10 $M\\_{\\odot}$ and must have an accretion disk that supplies fuel for the nova eruption. FQ Cir represents a new mode of accretion in interacting binaries, with Roche lobe overflow from the decretion disk feeding mass into the usual accretion disk around the white dwarf, for disk-to-disk accretion. From the mass budget of the binary, the primary star must have its initial mass $>$7.6 $M\\_{\\odot}$, forming an ONe white dwarf, so FQ Cir can never become a Type Ia supernova.\n\n", "2511.16554": "2025-11-20, **Dark Matter-Dark Radiation Interactions and the Hubble Tension**, Manuel A. Buen-Abad et.al., [2511.16554v1](http://arxiv.org/abs/2511.16554v1)\n\n Models in which a subcomponent of dark matter interacts with dark radiation have been proposed as a solution to the Hubble tension. In this framework, the interacting subcomponent of dark matter is in thermal equilibrium with the dark radiation in the early universe, but decouples from it around the time of matter-radiation equality. We study this general class of models and evaluate the quality of fit to recent cosmological data on the cosmic microwave background (from Planck 2018 and ACT DR6), baryon acoustic oscillations, large-scale structure, supernovae type Ia, and Cepheid variables. We focus on three benchmark scenarios that differ in the rate at which the dark matter decouples from the dark radiation, resulting in different patterns of dark acoustic oscillations. Fitting without ACT DR6 data, we find that all three scenarios significantly reduce the Hubble tension relative to $Λ$CDM, with an exponentially fast decoupling being the most preferred. The tension is reduced to less than $2 \\, σ$ in fits that don't include the SH0ES collaboration results as part of the data and to less than $1 \\, σ$ when these are included. When ACT DR6 data is included, the fit is significantly worsened. We find that the largest $H\\_0$ value at the $95 \\%$ confidence region is $70.1$ km/s/Mpc without the SH0ES data, leading to only a mild reduction in the tension. This increases to $72.5$ km/s/Mpc, corresponding to a reduction in the tension to less than $3 \\, σ$, if the SH0ES results are included in the fit.\n\n", "2511.16448": "2025-11-20, **Tracing Early Cosmic Chemical Enrichment: A Uniform XMM-Newton Survey of Metallicity in Galaxy Groups and Clusters**, Anne E Blackwell et.al., [2511.16448v1](http://arxiv.org/abs/2511.16448v1)\n\n Observed metal abundances in the intracluster medium (ICM) of galaxy groups and clusters, $Z\\_{ICM}$, exceed what is expected from present-day stellar populations alone. Galaxy clusters are presumed to be near closed-box systems, allowing constraints to be placed on the origins of metals and stellar populations responsible for $Z\\_{ICM}$. We present a uniform XMM-Newton survey of 26 galaxy groups and clusters, measuring radial metallicity profiles and relating $Z\\_{ICM}$ with the stellar fraction $M\\_*/M\\_{gas}$. We determine $Z\\_{ICM}$ via spectral fitting across multiple annuli finding a best fit of $Z\\_{ICM} = -0.08^{+0.07}\\_{-0.07}\\, log\\left(\\frac{M\\_*}{M\\_{gas}}\\right) + 0.30^{+0.06}\\_{-0.06}$ with intrinsic scatter $σ\\_p = 0.09^{+0.02}\\_{-0.01}$. We use closed-box chemical evolution models to estimate the metallicity yield from observable stellar populations, incorporating updated supernova yields and corrections for metals locked in remnants, $Z\\_* = (1.14 \\pm 0.52) \\, log\\left(1 + \\frac{M\\_*}{M\\_{gas}}\\right)$. Our results demonstrate that present-day stellar populations systematically underpredict $Z\\_{ICM}$, with an inferred excess component increasing in systems with low $M\\_*/M\\_{gas}$. This trend supports the need for an early enrichment population (EEP) distinct from visible stars, $Z\\_{EEP}$. We find this necessity holds when reconsidering the closed-box assumption by removing all galaxy groups, potential leaky systems, deriving $Z\\_{EEP}$ within $1σ$ when including and excluding groups. Three systems (NGC1132, NGC5098, and NGC4325) deviate from the survey trend, exhibiting steep negative radial metallicity gradients and unusually low $Z\\_{ICM}$. We posit these systems to be late-forming whose ICM enrichment reflects only recent stellar populations. Our analysis quantifies the necessity of an EEP and provides trends for testing cluster chemical evolution models.\n\n", "2511.16130": "2025-11-20, **Creation of Viscous Dark Energy by the Hubble Flow: Comparison with SNe Ia Master Sample Binned Data**, Iolanda Navonea et.al., [2511.16130v1](http://arxiv.org/abs/2511.16130v1)\n\n We study a cosmological model featuring evolutionary dark energy, according to the idea that the creation of its constituents arises from the gravitational field of the expanding universe, whose non-equilibrium physics is described by a non-zero bulk viscosity coefficient. This physical scenario calls for two additional parameters with respect to the ΛCDM model, one of which is the equation of state parameter of the created dark energy. The model is constrained by the requirement that its deceleration parameter coincides with the one predicted by the ΛCDM model. Then, we construct the effective running Hubble constant, a theoretical function that corresponds to the ratio of the Hubble parameter in our model to the ΛCDM expansion rate. The model's theoretical predictions for the effective running Hubble constant are compared with the binned data of the Supernovae Ia Master Sample. The comparison is performed by a MCMC procedure for each bin, with three parameters left free to vary, while the particle creation rate is taken from a grid of values, each of which is fixed in the given MCMC run. The most important result emerging from this analysis is that the created dark energy constituent corresponds to an equation of state parameter with phantom character. Only if particle creation is removed do the dark energy constituents acquire a quintessence character. No matter the intrinsic nature of the constituents, their effective z-dependent equation of state parameter is, both with and without considering particle creation, entirely of phantom nature across the considered redshift range.\n\n", "2511.15993": "2025-11-20, **Formation of Extremely Low-Mass White Dwarfs in Wide Orbits**, Yangyang Zhang et.al., [2511.15993v1](http://arxiv.org/abs/2511.15993v1)\n\n Helium white dwarfs (WDs) with masses less than 0.3 $\\rm M\\_{\\sun}$ are known as extremely low-mass WDs (ELM WDs), which cannot be produced by single stellar evolution in theory. Generally, these stars are believed to form through binary interactions. Recently, two ELM WDs in unusually wide orbits were reported, i.e., KIC 8145411 and HE 0430-2457. Their orbital separations are too wide to be produced by the binary evolution scenario. In this work, we study the formation of wide-orbit ELM WD binaries from hierarchical triple systems. In this scenario, an ELM WD is formed from the inner binary and subsequently forms a wide binary system with the third object. We find that the merger of an evolved star with a brown dwarf in the inner binary fails to produce single ELM WDs, but Type Ia supernovae (SNe Ia) explosions can successfully do so. Furthermore, we investigate the impact of the supernova explosion on the orbital distribution of the surviving binary and find that this channel may have a probability of reproducing the orbital parameters of HE 0430-2457, but fails to reproduce the observed features of KIC 8145411. This supports recent observational recalibrations suggesting that KIC 8145411 resides in a triple system rather than a binary.\n\n", "2511.15975": "2025-11-20, **SN 2019vxm: A Shocking Coincidence between Fermi and TESS**, Zachary G. Lane et.al., [2511.15975v1](http://arxiv.org/abs/2511.15975v1)\n\n Shock breakout and, in some cases, jet-driven high-energy emission are increasingly recognized as key signatures of the earliest phases of core-collapse supernovae, especially in Type IIn systems due to their dense, interaction-dominated circumstellar environments. We present a comprehensive photometric analysis of SN 2019vxm, a long-duration, luminous Type IIn supernova, $M\\_V^{}=-21.41\\pm0.05\\;{\\rm mag}$, observed from X-ray to near-infrared. SN 2019vxm is the first superluminous supernovae Type IIn to be caught with well-sampled TESS photometric data on the rise and has a convincing coincident X-ray source at the time of first light. The high-cadence TESS light curve captures the early-time rise, which is well described by a broken power law with an index of $n=1.41\\pm0.04$, significantly shallower than the canonical $n=2$ behavior. From this, we constrain the time of first light to within 7.2 hours. We identify a spatial and temporal coincidence between SN 2019vxm and the X-ray transient GRB191117A, corresponding to a $3.3σ$ association confidence. Both the short-duration X-ray event and the lightcurve modeling are consistent with shock breakout into a dense, asymmetric circumstellar medium, indicative of a massive, compact progenitor such as a luminous blue variable transitioning to Wolf-Rayet phase embedded in a clumpy, asymmetric environment.\n\n"}}