{"neutrino": {"2512.19667": "2025-12-22, **Picosecond laser test unit for photosensor characterization at ambient and low temperatures**, Matthias Raphael Stock et.al., [2512.19667v1](http://arxiv.org/abs/2512.19667v1)\n\n Accurate single photoelectron (SPE) characterization of photosensors is essential for controlling systematic uncertainties in low-light neutrino and dark matter detectors. We present a compact laboratory setup for the characterization of photosensors under controlled, low-light conditions. Specifically, we demonstrate its use with photomultiplier tubes (PMTs) operated at the SPE-level, using picosecond laser pulses and waveform digitization to determine key PMT properties. Measurements as a function of supply voltage and temperature ($-50^\\circ$C to $+20^\\circ$C) are performed on ET Enterprises 9821(Q)B tubes and a Hamamatsu R9980 assembly, which show exponential gain-voltage behavior and device-to-device variation. Cooling increases the gain by $\\sim 0.1\\,\\%/^\\circ$C, while the transit time spread (TTS) and peak-to-valley ratio (P/V) exhibit no clear temperature dependence. TTS decreases with voltage. Late pulses remain at the percent level and prepulses at the sub-percent level. Cable length affects both apparent gain and TTS. A model-independent, data-driven self-convolution method is introduced to quantify double photoelectron contributions from pulse charge spectra. The procedures provide a reproducible, practice-oriented reference for SPE-level PMT characterization and can be extended to other photosensor types.\n\n", "2512.19631": "2025-12-22, **Search for Quadruplet Scalars using Boosted Decision Trees at the LHC**, Amit Chakraborty et.al., [2512.19631v1](http://arxiv.org/abs/2512.19631v1)\n\n Beyond the Standard Model scenarios introduce additional scalar and fermion multiplets, which influence neutrino mass generation mechanisms and yield distinctive collider signatures. This work focuses on a particular scenario involving a neutral fermion quintuplet and a scalar quadruplet. The study examines the production and decay of the scalar quadruplet components at the LHC, emphasizing how their decay patterns, fermiophobic versus fermiophilic, depend on mass differences and Yukawa couplings with the fermion multiplets. A detailed collider analysis targeting final states with at least four leptons and two jets is conducted. The study also incorporates Standard Model backgrounds, leveraging multivariate techniques via Boosted Decision Trees. Results indicate discovery potential for scalar masses around 600-700 GeV and exclusion sensitivity extending beyond 1 TeV, highlighting the promising experimental signatures in the model and its role in probing new physics at colliders.\n\n", "2512.19437": "2025-12-22, **Ultra-high precision high voltage system for PTOLEMY**, R. Ammendola et.al., [2512.19437v1](http://arxiv.org/abs/2512.19437v1)\n\n The PTOLEMY project is prototyping a novel electromagnetic filter for high-precision $β$ spectroscopy, with the ultimate and ambitious long-term goal of detecting the cosmic neutrino background through electron capture on tritium bound to graphene. Intermediate small-scale prototypes can achieve competitive sensitivity to the effective neutrino mass, even with reduced energy resolution. To reach an energy resolution better than \\SI{500}{meV} at the tritium $β$-spectrum endpoint of \\SI{18.6}{keV}, and accounting for all uncertainties in the filtering chain, the electrode voltage must be controlled at the level of a few parts per million and monitored in real time. In this work, we present the first results obtained in this effort, using a chain of commercial ultra-high-precision voltage references, read out by precision multimeters and a \\emph{field mill} device. The currently available precision on high voltage is, in the conservative case, as low as \\SI{0.2}{ppm} per \\SI{1}{kV} single board and $\\lesssim$ \\SI{50}{mV} over the \\SI{10}{kV} series, presently limited by field mill read-out noise. However, assuming uncorrelated Gaussian noise extrapolation, the real precision could in principle be as low as \\SI{0.05}{ppm} over \\SI{20}{kV}.\n\n", "2512.19403": "2025-12-22, **Diagnosing the AGN population origin of TeV neutrinos with their spatial correlation**, Xiao-Bin Chen et.al., [2512.19403v1](http://arxiv.org/abs/2512.19403v1)\n\n The recent IceCube detection of TeV neutrinos from some nearby Seyfert galaxy (e.g., NGC~1068) suggests that active galactic nuclei (AGN) could make a significant contribution to the diffuse flux of astrophysical neutrinos. The absence of TeV gamma-rays from NGC~1068 indicates neutrino production in compact gamma-ray-opaque region. The vicinity of the supermassive black hole, such as disk-corona, is an ideal region, where the high radiation density leads to efficient neutrino production as well as the gamma-ray attenuation. Disk-corona models predict that the neutrino emission from AGNs correlates with X-ray emission, which traces the coronal activity. In this paper, we assess whether the X-ray AGN population origin for TeV neutrinos can be tested by using the spatial correlation between the neutrino population and X-ray AGN population with future neutrino telescopes. By performing simulations, we find that, the AGN origin of the neutrino background above 100\\,TeV can be tested at a confidence level of $\\sim2.4σ$ with five-year observations of IceCube-Gen2, which has an angular resolution of $\\sim0.2$ degree. With better angular resolution and sensitivity in the energy range of above $300$\\,TeV, a 30-${\\rm km^3}$ underwater neutrino telescope, such as High-energy Underwater Neutrino Telescope (HUNT), is expected to reach a significance of $\\sim8.6σ$ in testing the association after five years of exposure.\n\n", "2512.19301": "2025-12-22, **Optical Follow-Up Strategies for the Next Neutrino-Detected Galactic Core-Collapse Supernova**, P. A. Duverne et.al., [2512.19301v1](http://arxiv.org/abs/2512.19301v1)\n\n Core-collapse supernovae (CCSNe) are expected to produce intense bursts of neutrinos preceding the emergence of their electromagnetic (EM) counterparts. The prompt detection of such neutrino signals offers a unique opportunity to trigger early follow-up observations in the EM domain. We aim to assess the feasibility and efficiency of an optical-NIR follow-up strategy for CCSNe discovered via neutrino bursts, by modelling the spatial distribution of events and simulating realistic observational campaigns taking into account the size of the localization error box generated by triangulating the neutrino burst. We modelled the Galactic distribution of CCSNe, including the effects of interstellar extinction, and considered three main progenitor types: Wolf-Rayet stars, red and blue supergiants. We included the shock breakout in the EM signatures that could be detected following the neutrino burst. A population of CCSNe was generated and detected by different networks of neutrino observatories, including IceCube, KM3NeT, Super-Kamiokande, Hyper-Kamiokande, and JUNO. The resulting skymaps were used as input for GWEMOPT to produce optimized follow-up plans with two optical facilities: LSST and the TAROT robotic telescopes. Both LSST and TAROT exhibit comparable detection efficiencies for the simulated CCSN population. However, the TAROT network achieves similar success rates while requiring fewer pointings to cover the CCSN skymap. Our simulations demonstrate that neutrino follow-up campaigns can effectively CCSN optical counterparts using both large and small facilities. Depending on the neutrino network, the median number of pointings for the two tested optical facilities is of the order of 20 to 100 to find the EM emission. The number of images is larger for LSST than for TAROT by a factor of 2 to 4.\n\n", "2512.19138": "2025-12-22, **The Standard Model Prediction for the Rare Decay $B \\to X_s ν\\bar ν$**, Matteo Fael et.al., [2512.19138v1](http://arxiv.org/abs/2512.19138v1)\n\n We present updated and comprehensive Standard Model predictions for the inclusive rare decay $B \\to X\\_s ν\\barν$. Using a state-of-the-art determination of the short-distance coefficient, including NLO QCD and electroweak effects, and implementing a consistent treatment of heavy-quark masses and power corrections within the kinetic scheme, we compute the total decay rate and the neutrino invariant mass spectrum. We incorporate all known perturbative contributions in the heavy quark limit up to $\\mathcal{O}(α\\_s^3)$, evaluate non-perturbative corrections through the Heavy Quark Expansion up to $1/m\\_b^3$, and include estimates of four-quark operator matrix elements from HQET sum rules. We obtain the Standard Model branching ratios $\\text{Br}(B^0 \\to X\\_sν\\barν) = (3.35 \\pm 0.10)\\times 10^{-5} $ and $ \\text{Br}(B^+ \\to X\\_sν\\barν) = (3.62 \\pm 0.11)\\times 10^{-5}, $ representing a significant improvement in both central value and precision compared to previous determinations. We also provide predictions for partial rates with kinematic cuts relevant to Belle II. Our results are timely in view of recent measurements of $B \\to Kν\\barν$ and the first upper limits on inclusive $B \\to X\\_sν\\barν$, and they offer a robust baseline for future searches for physics beyond the Standard Model in $b\\to sν\\barν$ transitions.\n\n", "2512.19101": "2025-12-22, **Physical Conditions for Synthesis of Sc, Ti, and V in Neutrino-driven Supernovae**, Ryota Hatami et.al., [2512.19101v1](http://arxiv.org/abs/2512.19101v1)\n\n We present the results of simulations of nucleosynthesis in a core-collapse supernova (CCSN) including the neutrino process. Using the Si layer of $13M\\_\\odot$ zero-metal progenitor as the initial composition, we calculate the nucleosynthesis by adopting the temperature, density, neutrino flux, and duration of nucleosynthesis as arbitrary parameters and compare the results with the observed abundances ratio of Sc, Ti, and V in very metal-poor (VMP) stars taken from the Stellar Abundances for Galactic Archaeology (SAGA) database. As a result, for the first time, we identify the quantitative requirements on local physical conditions. To reproduce the abundances ratios in the VMP stars, the explosive nucleosynthesis should take place under the neutrino exposure, which is time integration of neutrino flux, of $σ\\_ν\\sim 10^{35}\\,\\mathrm{erg~cm^{-2}}$ and temperature of $2.0\\,\\mathrm{GK}\\leq T \\leq 3.2\\,\\mathrm{GK}$. The dependence on the density and each value of the neutrino flux and the duration of nucleosynthesis is weak. We also discuss whether the quantitative requirements are realized during the explosion. Although the requirements are difficult to be realized in the one-dimensional simulations, the non-monotonic thermal evolution shown in recent three-dimensional simulations may satisfy them. Because the evolution is likely caused by turbulent motion stemming from the initial asphericity of the progenitor, it is important to calculate the long-term three-dimensional supernova explosion of multi-dimensional metal-free progenitor models and follow the nucleosynthesis self-consistently.\n\n", "2512.18909": "2025-12-21, **Application of $K \\to 3π$ amplitudes to semileptonic kaon decays**, Anshika Bansal et.al., [2512.18909v1](http://arxiv.org/abs/2512.18909v1)\n\n We study dispersive representations of nonlocal form factors in $K^+ \\to π^+ \\ell^+ \\ell^-$ and $K^+ \\to π^+ ν\\barν$ decays, with an aim of improving the theoretical description of the spectrum and decay rate of the neutrino mode. Based on unitarity, these representations invoke the $K^+ π^- \\to π^+ π^-$ amplitude in $P$-wave and the pion vector form factor. The $P$-wave amplitude can be effectively parameterized within the dispersive Khuri-Treiman framework, and constrained by experimental information on the CP-conserving $K^+ \\to π^+ π^+ π^-$ and $K^+ \\to π^0 π^0 π^+$ decays. We also emphasize certain relations between charged-lepton and neutrino non-local form factors based on the Operator Product Expansion, which can be used to impose further phenomenological constraints.\n\n"}, "dark matter": {"2512.19666": "2025-12-22, **A cosmologist's take on Little Red Dots**, Valerio De Luca et.al., [2512.19666v1](http://arxiv.org/abs/2512.19666v1)\n\n The James Webb Space Telescope (JWST) has uncovered a population of compact, high-redshift sources, the Little Red Dots (LRDs), which may host supermassive black holes (BHs) significantly heavier than their stellar content compared with local scaling relations. These objects challenge standard models of early galaxy formation and may represent an extreme class of early BH hosts. In this paper, we investigate whether these BHs could have a primordial origin. We first show that the direct formation of these BH masses in the early Universe is excluded by stringent CMB $μ$-distortion limits. We then investigate the assembly of massive BHs from lighter, observationally allowed primordial black holes (PBHs) via hierarchical mergers, finding that, although this channel can operate depending on the merger history, it faces challenges in explaining the observations due to the rarity of the required high-redshift dark matter halos. Finally, we estimate gas accretion onto intermediate-mass PBHs, while jointly tracking metallicity evolution, and identify regions of parameter space in which such growth could reproduce the observed properties of LRDs. As a special case, we focus on the strongly lensed source QSO1, whose extremely low metallicity and large mass provide a stringent test of these formation channels.\n\n", "2512.19636": "2025-12-22, **Heavy neutral bosons and dark matter in the 3-3-1 model with axionlike particle**, T. T. Hieu et.al., [2512.19636v1](http://arxiv.org/abs/2512.19636v1)\n\n We consider heavy neutral bosons in the 3-3-1 model with axionlike particles (331ALP), including the Higgs boson and the $Z^\\prime$ boson which are outside the standard model (SM). Based on gluon-gluon fusion at the LHC, we investigate the signals of cross-sections in the parameter space region satisfying the current experimental limits of lepton flavor violating decay, including processes involving both charged leptons and Higgs boson, and provide predictions of $m\\_{h\\_2}\\geq 600 ~\\mathrm{GeV}$. A new gauge boson, labeled as $Z^{\\prime}$, is predicted $m\\_{Z^{\\prime}}\\geq 5.1 ~\\mathrm{TeV}$ based on the search for high-mass dilepton resonances at ATLAS and CMS. We also introduced the symmetry group $U(1)\\_{\\mathcal{N}}\\otimes \\mathcal{Z}\\_2^\\prime$ into the model to indicate dark matter candidates. Investigating the relic density of dark matter within experimentally permissible limits, we established a relationship between the mass of dark matter and the breaking scale of axion.\n\n", "2512.19633": "2025-12-22, **InterACTing dark radiation models after ACT**, William Cvetko et.al., [2512.19633v1](http://arxiv.org/abs/2512.19633v1)\n\n In this work we assess the implications of the Atacama Cosmology Telescope DR6 measurements for two interacting dark radiation scenarios previously shown to mitigate the Hubble tension. The first model, Wess-Zumino dark radiation (WZDR), features a mass threshold in the dark sector that induces a step-like reduction in the dark radiation abundance as the dark temperature evolves. The second model, new atomic dark matter (nuADaM), introduces dark radiation that remains coupled to a subcomponent of dark matter until shortly before matter-radiation equality. Earlier analyses using Planck data demonstrated that these interactions significantly relax constraints on the dark radiation density and allow values of $H\\_0$ consistent with local distance-ladder determinations. Incorporating ACT DR6, which extends CMB measurements deep into the high-$\\ell$ damping tail, we find that constraints on the additional radiation component tighten substantially in both scenarios, closing most of the parameter space that previously enabled higher values of $H\\_0$. We further analyze a generalized model including both free-streaming and self-interacting dark radiation, and show that the resulting constraints are consistent with ACT's findings for the limiting cases of purely free-streaming or purely self-interacting radiation. Overall, ACT DR6 significantly restricts interacting dark radiation as a solution to the Hubble tension.\n\n", "2512.19592": "2025-12-22, **Constraints on Solar Reflected Dark Matter from a combined analysis of XENON1T and XENONnT data**, XENON Collaboration et.al., [2512.19592v1](http://arxiv.org/abs/2512.19592v1)\n\n We report on a search for sub-GeV dark matter upscattered via the solar reflection mechanism in the heavy mediator scenario. Under the Standard Halo Model, keV to MeV dark matter produces nuclear recoils with energies below the detection threshold of liquid xenon time projection chambers. We enhance sensitivity to low-mass dark matter by considering dark matter-electron scattering, employing dedicated event selections to reduce the detection threshold, and exploiting the additional kinetic energy imparted to the dark matter particle by solar upscattering. Using XENON1T ionization-only and XENONnT low-energy electronic recoil datasets, we exclude previously unconstrained DM-electron scattering cross section for masses between $4.6\\, \\text{keV/}c^2$ and $20\\, \\text{keV/}c^2$, and between $0.2\\, \\text{MeV/}c^2$ and $2\\, \\text{MeV/}c^2$, reaching a minimum of $3.41\\times10^{-39}\\, \\text{cm}^2$ for a mass of $0.3\\, \\text{MeV/}c^2$ at 90\\% confidence level.\n\n", "2512.19476": "2025-12-22, **Analytical study of birefringent cavities for axion-like dark matter search**, Tadashi Kuramoto et.al., [2512.19476v1](http://arxiv.org/abs/2512.19476v1)\n\n Light polarization plays a crucial role in optical-cavity experiments; however, mirror birefringence presents a significant challenge that must be addressed carefully. In this study, a rigorous, nonperturbative framework is developed to quantify birefringence effects by incorporating variations in reflectance and polarization misalignment. We analyze the impact of this framework on the sensitivity of axion-like particle (ALP) dark-matter searches. The results show that both birefringence and misalignment contribute to sensitivity degradation in the low-mass regime; however, the adverse effects of misalignment can be mitigated by selecting a postselection angle greater than the misalignment angle. Furthermore, birefringence produces an additional resonance peak in the high-mass region, which remains largely unaffected by misalignment and postselection variations. This rigorous framework underscores the importance of considering birefringence in high-precision optical-cavity experiments for ALP detection.\n\n", "2512.19463": "2025-12-22, **Double Resonance Strategy for Interferometric Detection of Axions**, Spencer Green et.al., [2512.19463v1](http://arxiv.org/abs/2512.19463v1)\n\n We propose a double-resonant interferometric strategy for axion dark matter detection that combines microwave circuit resonance with Fabry--Pérot optical enhancement. In a strong magnetic field, axion--photon mixing induces a weak oscillating electric field, which is first amplified by a resonant circuit and then transduced into an optical phase shift via the electro-optic effect. Multiple coherent optical passes through the electro-optic medium accumulate this phase shift, enabling interferometric readout using mature optical techniques. We present the basic operating principle, discuss material requirements, and estimate the achievable sensitivity. For representative parameters, the projected reach extends into the parameter space of well-motivated QCD axion models.\n\n", "2512.19298": "2025-12-22, **Search for Axion-Like Particles from Nearby Pre-Supernova Stars**, Saurabh Mittal et.al., [2512.19298v1](http://arxiv.org/abs/2512.19298v1)\n\n Axion-like particles (ALPs) are hypothetical pseudoscalar bosons that arise in many extensions of the Standard Model and are well-motivated dark matter candidates. Nearby massive stars in the late stages of stellar evolution provide a promising environment for enhanced ALP production due to their high core temperatures and densities. We search for a combined signal of ALP-induced hard X-ray and soft $γ$-ray emission from 18 nearby pre-supernova stars using the full public 22-year INTEGRAL/SPI dataset, construct individual stellar spectra and link them in a coherent analysis. A maximum-likelihood approach is used to extract fluxes in the 20--2000 keV energy range. Stellar evolution models are employed to obtain the expected spectral shapes of ALP production processes peaking between 50--500 keV, depending on stellar mass and evolutionary stage. We construct a joint likelihood that incorporates uncertainties in stellar parameters to derive combined constraints on the coupling constants $g\\_{aγ}$ and $g\\_{ae}$ as a function of the ALP mass $m\\_a$. The hard X-ray and soft $γ$-ray fluxes of all selected stars are consistent with zero within uncertainties. We provide upper limits on the continuum emission and on the 511 keV and 1809 keV line fluxes. The combined upper limit on $g\\_{aγ} \\times g\\_{ae}$ is $(0.008 - 2) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) while the ALP-photon coupling is constrained to $g\\_{aγ} = (0.13 - 1.26) x 10^{-11}$ GeV$^{-1}$ (95% C.I.) for $m\\_a\\leqq10^{-11}$ eV, depending on the time to core collapse and magnetic field assumptions. Conservative limits of $(0.27 - 1.25) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) are obtained assuming all but one star are in the early He-burning phase. These results rank among the strongest limits on ALP couplings to date and demonstrate the importance of soft $γ$-ray observations for probing ALPs and massive star evolution.\n\n", "2512.19042": "2025-12-22, **Bose-Einstein Condensate dark matter with logarithmic nonlinearity**, Zahra Haghani et.al., [2512.19042v1](http://arxiv.org/abs/2512.19042v1)\n\n If dark matter is composed of massive bosons, a Bose-Einstein Condensation process must have occurred during the cosmological evolution. Therefore, galactic dark matter may be in a form of a self-gravitating condensate, in the presence of self-interactions. We consider the possibility that the self-interacting potential of the condensate dark matter is of the logarithmic form. In order to describe the condensate dark matter we use the Gross-Pitaevskii equation with a logarithmic nonlinearity, and the Thomas-Fermi approximation. With the use of the hydrodynamic representation of the Gross-Pitaevskii equation we obtain the equation of state of the condensate, which has the form of the ideal gas equation of state, with the pressure proportional to the dark matter density. The basic equation describing the density distribution of the static condensate is derived, and its solution is obtained in the form of a series solution, constructed with the help of the Adomian Decomposition Method. To test the model we consider the properties of the galactic rotation curves in the logarithmic Bose-Einstein Condensate dark matter scenario, by using a sample from the Spitzer Photometry and Accurate Rotation Curves (SPARC) data. The fit of the theoretical predictions of the rotation curves with the observational data indicate that the logarithmic Bose-Einstein Condensate dark matter model gives an acceptable description of the SPARC data, and thus it may be considered as a possible candidate for the in depth understanding of the dark matter properties.\n\n", "2512.19041": "2025-12-22, **Gravitational Production of Massive Spin-2 Particles During Reheating**, Sarunas Verner et.al., [2512.19041v1](http://arxiv.org/abs/2512.19041v1)\n\n We study the minimal gravitational portal for a massive spin-2 dark matter candidate $X\\_{μν}$ produced during perturbative reheating. The dark sector couples to the visible sector only via gravity, and we analyze two unavoidable channels: (i) inflaton condensate annihilation, $φ+φ\\to X+X$, and (ii) thermal scatterings, ${\\rm SM}+{\\rm SM}\\to X+X$, both mediated by graviton exchange. Working in the Fierz-Pauli framework for a free massive spin-2 field of mass $m\\_2$, we derive the graviton-mediated amplitudes and perform a full helicity decomposition of the final state. The relic abundance is obtained analytically in terms of $m\\_2$ and the reheating temperature $T\\_{\\rm RH}$. In the light mass regime $m\\_2 \\ll m\\_φ$ (with $m\\_φ$ the inflaton mass during oscillations), production is overwhelmingly dominated by the longitudinal (helicity-0) mode: the $2\\to2$ cross section is parametrically enhanced, scaling as $\\sim (m\\_φ/m\\_2)^4$, and yields efficient dark matter production despite purely gravitational couplings. Compared to lower-spin cases (spin-$0$, $1/2$, $1$, and $3/2$), massive spin-$2$ production is substantially more efficient for the same reheating history. Over most of the parameter space the inflaton condensate channel dominates the yield, while the thermal contribution is negligible. Avoiding overproduction typically requires either a relatively low $T\\_{\\rm RH}$ or a spin-$2$ mass near threshold, $m\\_2 \\lesssim m\\_φ$. This places the spin-$2$ portal on similar footing to other higher spins in reheating scenarios, while emphasizing the central role of the helicity-$0$ mode and the reheating history in setting the dark matter density.\n\n", "2512.18960": "2025-12-22, **Searching for Ultralight Dark Matter with M{ö}ssbauer Resonance**, Peng-Long Zhang et.al., [2512.18960v1](http://arxiv.org/abs/2512.18960v1)\n\n We investigate the feasibility of probing the interaction between ultralight scalar dark matter and atomic nuclei using a stationary Mossbauer spectroscopy scheme. The exceptional energy resolution of the Mossbauer resonance enables testing nuclear energy shifts arising from the local dark matter field. In principle, a stationary measurement allows faster data acquisition and becomes advantageous at higher dark matter masses in the range 10^{-15} - 10^{-8} eV. We present the projected sensitivity to the dark matter parameter space for three candidate Mossbauer isotopes, Ag-109, Sc-45, and Zn-67. Among them, Ag-109 provides the highest sensitivity, followed by Zn-67. For Ag-109, the scalar dark matter photon coupling f\\_gamma^{-1} can be constrained down to the level of 10^{-18} GeV^{-1}}, exceeding the sensitivity of several existing experiments. The scalar dark matter gluon coupling f\\_g^{-1} can be probed down to 10^{-21} GeV^{-1}, while the scalar dark matter quark coupling y\\_d can reach approximately 10^{-22} GeV^{-1}. These results demonstrate that Mossbauer based techniques offer a promising and competitive approach for probing ultralight dark matter interactions with Standard Model particles.\n\n", "2512.18959": "2025-12-22, **Scalar-Mediated Inelastic Dark Matter as a Solution to Small-Scale Structure Anomalies**, Zihan Wang et.al., [2512.18959v1](http://arxiv.org/abs/2512.18959v1)\n\n We propose a scalar-mediated Self-Interacting Dark Matter (SIDM) model to address small-scale structure anomalies such as the core-cusp and diversity problems. The model is composed by a leptophilic scalar mediator and a pseudo-Dirac dark matter candidate with a mass splitting of 100 eV.We imposed aA dark discrete $\\mathbb{Z}\\_2$ symmetry forbids tree-level elastic scattering. Therefore creates kinematic threshold that suppresses scattering in ultra-faint satellite galaxies while enabling large self-interaction cross-sections in dwarf galaxies via resonant enhancement. To satisfy Big Bang Nucleosynthesis (BBN) requirements, we introduce a dimension-5 magnetic dipole operator that enable the decay of the excited state ($χ\\_2 \\rightarrow χ\\_1 γ$). This operator also provides a unique, low-threshold signal for direct detection experiments, characterized by a distinct $1/E\\_R$ recoil spectrum. We identify a benchmark parameter space around ($m\\_χ\\approx 40$ GeV, $m\\_φ\\approx 20$ MeV) where non-perturbative coupled-channel dynamics successfully reconcile astrophysical observations with cosmological bounds, including CMB constraints on annihilation.\n\n", "2512.18882": "2025-12-21, **Constraints on the polarization angle oscillations of the Crab Nebula with the Simons Array and its applications to the search for axion-like particles**, Tylor Adkins et.al., [2512.18882v1](http://arxiv.org/abs/2512.18882v1)\n\n We present a search for polarization oscillation of the Crab Nebula, also known as Tau A, at millimeter wavelengths using observations with the Simons Array, the successor experiment to POLARBEAR. We follow up on previous work by POLARBEAR using 90 GHz band data of the 2023 observing season of the Simons Array to evaluate the variability of Tau A's polarization angle. Tau A is widely used as a polarization angle calibration source in millimeter-wave astronomy, and thus it is necessary to validate the stability. Additionally, an interesting application of the time-resolved polarimetry of Tau A is to search for axion-like particles (ALPs). We do not detect a global signal across the frequencies considered in this analysis and place a median 95% upper bound of polarization oscillation amplitude $A<0.12^{\\circ}$ over oscillation frequencies from 3.39 year$^{-1}$ to 1.50 day$^{-1}$. This constrains the ALP-photon coupling at a median 95% upper bound of $g\\_{aγγ}< 3.84\\times 10^{-12}\\times\\left(m\\_a/10^{-21}\\,\\mathrm{eV}\\right)$ in the mass range from $4.4\\times10^{-22}$ to $7.2\\times10^{-20}$ eV, assuming the ALP constitutes all of dark matter, its field is a stochastic Gaussian field, and it is the sole source of Tau A's polarization angle oscillation. Additionally, we do not detect signal at the frequencies where 2.5$σ$ hints were previously reported by POLARBEAR, but we do not exclude these signals at the 95% confidence level.\n\n", "2512.18822": "2025-12-21, **Nanohertz Gravitational Waves**, Alberto Sesana et.al., [2512.18822v1](http://arxiv.org/abs/2512.18822v1)\n\n Evidence of a gravitational wave (GW) signal has emerged in pulsar timing array (PTA) data, opening a new window into the nanoHz GW Universe. We explore the physics of GW signals potentially explaining the data, with a primary focus on GW backgrounds (GWBs), considering both astrophysical and cosmological origins. We describe how: (i) An astrophysical nanoHz GWB emerges as the superposition of individual signals from inspiralling massive black-hole binaries (MBHBs); (ii) Environment coupling, eccentricity, and sparse sampling, affect the MBHB signal spectrum and statistical properties, causing great uncertainty in theoretical predictions, but simultaneously offering a handle to discriminate a potential astrophysical origin; (iii) PTA data offers unprecedented opportunities to constrain high-energy physics beyond the standard model, by probing early Universe GWBs, originated during or after inflation; (iv) Different early Universe GWBs, typically created by non-linear and out-of-equilibrium dynamics, can explain the PTA data, as e.g. from inflation scenarios, first order phase transitions, or topological defects; (v) The PTA detection of GWs opens a new window to explore the Universe, with profound implications for astrophysics and particle physics, probing e.g. the equation of state of the early Universe, the origin of the cosmological perturbations, the nature of the dark matter, or whether exotic objects like primordial black holes or cosmic strings exist.\n\n", "2512.18818": "2025-12-21, **Bohmian Quantum Cosmology from the Wheeler-DeWitt Equation**, Spyros Basilakos et.al., [2512.18818v1](http://arxiv.org/abs/2512.18818v1)\n\n We construct a Bohmian quantum cosmological model for a spatially flat Friedmann Robertson Walker universe filled with a single scalar field whose potential provides a unified description of cold dark matter and dark energy at the background level. Starting from the Einstein-Hilbert action supplemented by a scalar field, we derive the minisuperspace Lagrangian and the associated canonical Hamiltonian formulation. By means of a nontrivial canonical transformation, the minisuperspace dynamics is mapped into that of a two dimensional hyperbolic oscillator with a fixed frequency ratio, rendering the Wheeler DeWitt equation exactly solvable by separation of variables. The resulting Wheeler-DeWitt solutions are expressed in terms of parabolic cylinder functions and are parametrised by a continuous separation constant, reflecting the constrained nature of the theory and the absence of a standard Schrodinger time parameter. Adopting the de Broglie-Bohm formulation, we derive deterministic guidance equations in minisuperspace and construct a well defined Bohmian Hubble parameter directly in terms of the pilot-wave phase. Finally, we present a Wheeler-DeWitt-derived toy wave function for which the Bohmian trajectories and the associated cosmological expansion history can be obtained analytically, reproducing the late time $Λ$CDM behaviour while exhibiting quantum modifications at earlier epochs.\n\n", "2512.18577": "2025-12-21, **The Extended Baryonic Tully-Fisher Relation for MaNGA Galaxies**, Nitya Ravi et.al., [2512.18577v1](http://arxiv.org/abs/2512.18577v1)\n\n The baryonic Tully-Fisher relation (BTFR), a relationship between rotational velocity and baryonic mass in spiral galaxies, probes the relative content of baryonic and dark matter in galaxies and thus provides a good test of Lambda CDM. Using H-alpha kinematics to model the rotation curves of spiral galaxies, we construct the BTFR for 5743 SDSS MaNGA DR17 galaxies. To extend the BTFR to higher masses using elliptical galaxies, we estimate their total masses from their stellar velocity dispersions using the virial theorem and define the effective rotational velocity as the velocity a rotation-supported galaxy would exhibit given this mass. The baryonic mass of spiral galaxies is composed of stellar, HI, H2, and He mass, while only the stellar mass is used for the baryonic content of ellipticals. We construct and fit the BTFR for a matched subsample of spiral and elliptical MaNGA and IllustrisTNG 100-1 (TNG100) galaxies, finding BTFR slopes between 3.2 and 4.0. We fit a joint BTFR for the 5743 MaNGA spiral and elliptical galaxies and find a BTFR slope of 3.54 (+0.65/-0.48), which is in good agreement with TNG100 galaxies with baryonic masses greater than 10^9 Msun for which we find a BTFR slope of 3.57 (+0.48/-0.37). Within this mass range, the MaNGA galaxies are consistent with both the Lambda CDM simulation and the prediction from MOND; a sample of lower mass galaxies is necessary to differentiate between the two models.\n\n", "2512.18568": "2025-12-21, **Two-Component Dark Matter with an SU(2) Dark Sector**, Shao-Long Chen et.al., [2512.18568v1](http://arxiv.org/abs/2512.18568v1)\n\n We propose an extension to the standard model incorporating a dark sector with a non-Abelian SU(2) gauge symmetry. The model yields stable dark matter candidates, protected by a residual $Z\\_3$ symmetry arising after the spontaneous symmetry breaking. The dark sector interacts with the SM via a Higgs portal, facilitated from mixing between the SM Higgs doublet and a dark scalar singlet. The model features two distinct DM components. We analyze theoretical and experimental constraints, including perturbativity, unitarity, vacuum stability, dark matter relic density, direct detection, indirect detection, Higgs invisible decays, dark radiation, and ellipticity. Our findings identify viable parameter spaces that satisfy these constraints, as exemplified by two benchmark points.\n\n"}, "supernova": {"2512.19568": "2025-12-22, **On the Metric $f(R)$ gravity Viability in Accounting for the Binned Supernovae Data**, A. Valletta et.al., [2512.19568v1](http://arxiv.org/abs/2512.19568v1)\n\n In this work, two models of metric $f(R)$ gravity in the Jordan frame are investigated as a dynamical description of the late-time cosmic expansion using binned Type~Ia Supernovae data. The aim is to provide an explanation for the effective running of the Hubble constant observed in both the binned Pantheon Sample and the Master Sample. To this end, the effective running Hubble constant $\\mathcal{H}(z)$ is defined as the ratio between the modified Hubble parameter and that of the standard cosmological model ($Λ$CDM), multiplied by $H\\_0$. $\\mathcal{H}(z)$ serves as a diagnostic tool to capture deviations from the $Λ$CDM model.   The first model used is a general representation of metric $f(R)$ gravity in which the gravitational Lagrangian is encoded in an effective redshift-dependent function that mimics the evolution of the Hubble parameter. Due to the limited redshift range covered by the available Supernovae Data, this function can be reliably approximated by a second-order Taylor expansion.   While this more general formulation yields a phenomenological fit that is compatible with that of the $Λ$CDM for the binned Pantheon Sample, the model is not physically viable, as it generically leads to the emergence of an unphysical mass of the scalar field. This issue originates from an implicit restriction imposed on the Cauchy problem for the non-minimally coupled scalar field. To address this limitation, following previous studies, an additional condition on the modified Friedmann equation is introduced, enabling a fully consistent reformulation of the dynamics. The resulting framework not only preserves the agreement with Supernova~Ia data, but also provides a physical justification for the additional condition adopted in earlier analyses of late-time cosmological dynamics.\n\n", "2512.19565": "2025-12-22, **Do low-redshift observations open the doors to an open universe?**, Deng Wang et.al., [2512.19565v1](http://arxiv.org/abs/2512.19565v1)\n\n The detection of a significant deviation from a zero curvature would have profound consequences for inflationary theories and fundamental physics. Relative to high-redshift Planck's CMB measurements, indicating a $\\sim 2σ$ evidence for a closed universe, low-redshift observations of BAO and SN Ia have the advantages of weak dependence on early universe physics, independently observational systematics, and strong redshift dependence of distances in constraining the cosmic curvature. Using the integrated observations from DESI BAO and SN Ia, we find an unexpected $2σ$ evidence for an open universe, regardless of the SN Ia sample employed. When considering DESI, SN Ia and the acoustic scale $θ\\_\\star$ data, the preference for an open universe exceeds the $3σ$ level, reaching $5σ$ for the case of DESY5 Supernovae data. Therefore, low-redshift observations favor an open universe, and this preference persists even when alternative high-redshift priors are adopted. Our results point to the existence of an additional tension between high- and low-redshift observations, present also in non-flat models beyond the minimal $Λ$CDM scheme, thereby challenging the standard inflationary predictions.\n\n", "2512.19386": "2025-12-22, **Machine learning for the early classification of broad-lined Ic supernovae**, Laura Cotter et.al., [2512.19386v1](http://arxiv.org/abs/2512.19386v1)\n\n Science is currently at an age where there is more data than we know how to deal with. Machine learning (ML) is an emerging tool that is useful in drawing valuable science out of incomprehensibly large datasets, identifying complex trends in data that are otherwise overlooked. Moreover, ML can potentially enhance the quality and quantity of scientific data as it is collected. This paper explores how a new ML method can improve the rate of classification of rare Ic-BL supernovae (SNe). New parameters called magnitude rates were introduced to train ML models to identify SNe Ic-BL in large datasets. The same methodology was applied to a population of SN Ia transients to see if the methodology could be reproducible with another SN class. Three magnitudes, three time differences, two magnitude rates and the second derivative of these rates were calculated using the first three available photometric data points in a single filter. Initial investigations show that the Random Forest algorithm provides a strong foundation for the early classifications SNe Ic-BL and SNe Ia. Testing this model again on an unseen dataset shows that the model can identify upward of 13% of the total true SN Ic-BL population, significantly improving upon current methods. By implementing a dedicated observation campaign using this model, the number of SN Ic-BL classified and the quality of early-time data collected each year will see considerable growth in the near future.\n\n", "2512.19298": "2025-12-22, **Search for Axion-Like Particles from Nearby Pre-Supernova Stars**, Saurabh Mittal et.al., [2512.19298v1](http://arxiv.org/abs/2512.19298v1)\n\n Axion-like particles (ALPs) are hypothetical pseudoscalar bosons that arise in many extensions of the Standard Model and are well-motivated dark matter candidates. Nearby massive stars in the late stages of stellar evolution provide a promising environment for enhanced ALP production due to their high core temperatures and densities. We search for a combined signal of ALP-induced hard X-ray and soft $γ$-ray emission from 18 nearby pre-supernova stars using the full public 22-year INTEGRAL/SPI dataset, construct individual stellar spectra and link them in a coherent analysis. A maximum-likelihood approach is used to extract fluxes in the 20--2000 keV energy range. Stellar evolution models are employed to obtain the expected spectral shapes of ALP production processes peaking between 50--500 keV, depending on stellar mass and evolutionary stage. We construct a joint likelihood that incorporates uncertainties in stellar parameters to derive combined constraints on the coupling constants $g\\_{aγ}$ and $g\\_{ae}$ as a function of the ALP mass $m\\_a$. The hard X-ray and soft $γ$-ray fluxes of all selected stars are consistent with zero within uncertainties. We provide upper limits on the continuum emission and on the 511 keV and 1809 keV line fluxes. The combined upper limit on $g\\_{aγ} \\times g\\_{ae}$ is $(0.008 - 2) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) while the ALP-photon coupling is constrained to $g\\_{aγ} = (0.13 - 1.26) x 10^{-11}$ GeV$^{-1}$ (95% C.I.) for $m\\_a\\leqq10^{-11}$ eV, depending on the time to core collapse and magnetic field assumptions. Conservative limits of $(0.27 - 1.25) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) are obtained assuming all but one star are in the early He-burning phase. These results rank among the strongest limits on ALP couplings to date and demonstrate the importance of soft $γ$-ray observations for probing ALPs and massive star evolution.\n\n", "2512.19175": "2025-12-22, **DESI DR2 Constraints on the $R_h=ct$ Universe: Model Viability and Comparison with $Λ$CDM**, Amritansh Mehrotra et.al., [2512.19175v1](http://arxiv.org/abs/2512.19175v1)\n\n We carry out a comparative analysis of the standard $Λ$CDM cosmological model and the alternative $R\\_h=ct$ framework using recent observational data from cosmic chronometers, Type Ia supernova, and baryon acoustic oscillations. The study evaluates the ability of each model to reproduce the observed expansion history of the Universe through a joint statistical assessment based on the chi-squared statistics, Akaike Information Criterion (AIC), Bayesian Information Criteria (BIC), and Bayes factor. While both models yield acceptable fits, $Λ$CDM consistently attains lower information-criterion values and higher likelihood, indicating a superior overall performance. An examination of the redshift evolution of the Hubble parameter $H(z)$ and the deceleration parameter $q(z)$ shows that $Λ$CDM naturally captures the transition from early-time deceleration to late-time acceleration, where as $R\\_h=ct$ predicts a strictly linear expansion. We also estimate the age of the Universe within both models, finding that $Λ$CDM prediction agrees with the Planck 2018 result, while the linear expansion in $R\\_h=ct$ leads to an older cosmic age. Recent JWST observations of unexpectedly mature high-redshift galaxies have reopened the discussion regarding whether the Universe may be older than implied by the standard model; although these results remain under active investigation, they underscore that fully resolving cosmic evolution may require refinements beyond the concordance paradigm.\n\n", "2512.19077": "2025-12-22, **The First Model-Independent Upper Bound on Micro-lensing Signature of the Highest Mass Binary Black Hole Event GW231123**, Aniruddha Chakraborty et.al., [2512.19077v1](http://arxiv.org/abs/2512.19077v1)\n\n The recently discovered gravitational wave (GW) event, GW231123, is the highest mass binary black hole (BBH) merger detected to date by the LIGO-Virgo-KAGRA Collaboration. The inferred source masses of GW231123 lie in a mass range where stellar-progenitor black holes are rare to exist due to the pair instability supernovae mass gap, and hence alternative scenarios of origin of this inferred heavy mass black hole become important. One of such hypotheses of its origin is gravitational lensing that introduces modulations to the amplitude and phase of GWs and can make the inferred mass higher from the true value. In this work, we search for the lensing signatures from GW231123 and all other events in a model-independent approach using the technique \\texttt{$μ$-GLANCE} which carries out tests on its residual strain to look for common features across the detector network through cross-correlation and infers the lensing signal in a Bayesian framework. Our analysis tests yield no strong evidence in support for lensing, though it detects presence of potential residual in the data, which can be a micro-lensing signature with a modulation amplitude less than 0.8 at 95\\% C.I. However, our study finds that current waveform systematics for such heavy mass binary systems are large enough to shadow the detection of lensing from such short-duration GWs such as GW231123, and hence no concluding claim of lensing could be made at this stage. We conclude that if this event is lensed, then in near future, detection of similar lensed events will take place with current detector sensitivity and hence can open a potential discovery space of lensed GW signal with the aid of more accurate waveform models.\n\n", "2512.19066": "2025-12-22, **A Self-Consistent Hubble Expansion in f(T) Gravity model: Confrontation with Recent Observations**, K. S. Kavya et.al., [2512.19066v1](http://arxiv.org/abs/2512.19066v1)\n\n The accelerated expansion of the universe remains one of the most profound puzzles in modern cosmology, often attributed to dark energy within the framework of General Relativity. As an alternative, modified teleparallel gravity theories such as $f(T)$ gravity offer a purely geometric mechanism to explain cosmic acceleration. In this work, we construct a plane-symmetric anisotropic cosmological model in the framework of exponential $f(T)$ gravity, adopting the functional form $f(T) = T + u e^{-vT}$. A key novelty of this study is that the Hubble function $H(z)$ is derived self-consistently from the field equations rather than being prescribed phenomenologically. Furthermore, we provide the first comprehensive observational test of an anisotropic $f(T)$ model using a combination of DESI, gravitational-wave (GW) data, and complementary datasets including OHD, CMB, and Pantheon+SH0ES. Our best-fit analysis yields $70 \\lesssim H\\_0 \\lesssim 73~\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, $0.28 \\lesssim Ω\\_m \\lesssim 0.34$, and $-0.99 \\lesssim ω\\lesssim -0.69$, all consistent with current late-time cosmological observations. The model accurately reproduces the distance modulus of Type Ia supernovae and the luminosity-distance relation from gravitational-wave standard sirens. These results demonstrate that the proposed anisotropic exponential $f(T)$ model can account for the observed cosmic acceleration without invoking a dark-energy component, thereby offering a novel and observationally consistent framework for studying anisotropic extensions of gravity.\n\n"}}