{"neutrino": {"2508.05456": "2025-08-07, **Weak interaction rates of $sd$-shell Urca pairs in stellar environment using a shell-model approach**, Shweta Sharma et.al., [2508.05456v1](http://arxiv.org/abs/2508.05456v1)\n\n In this work, the weak interaction rates of $sd$-shell nuclei in the hot and dense stellar environment are calculated using the shell model. The {\\it ab initio} effective interactions are employed for the calculation of Gamow-Teller strengths and weak rates in addition to the phenomenological interaction. The weak rates are evaluated in a fine grid of density and temperature. The electron capture and $\\beta^-$-decay rates of Urca pairs of nuclei with $A = 23, 25, 29, 31$ and 33 are evaluated as a function of $\\log\\_{10} \\rho Y\\_e$ and the corresponding Urca density is obtained. The screening effects are also included for the evaluation of these stellar weak rates. In addition, the intrinsic cooling strength is evaluated for $A=29,31$ and 33 Urca pairs in neutron star crusts. The stellar weak rates, along with the neutrino energy emitted and the gamma heat production, are tabulated for $A = 29-39$ nuclei.\n\n", "2508.05047": "2025-08-07, **Type-III Seesaw in Non-Holomorphic Modular Symmetry and Leptogenesis**, Priya et.al., [2508.05047v1](http://arxiv.org/abs/2508.05047v1)\n\n Recently, Qu and Ding, have proposed a formalism where modular invariance is extended to non-supersymmetric scenario considering Yukawa couplings as non-holomorphic functions of modules field $\\tau$. Adopting this formalism in this work, we propose a Type-III seesaw model as a unified framework to explain lepton masses and mixing and baryogenesis via leptogenesis. $\\chi^2$ analysis is performed to fit the neutrino oscillation data from NuFIT~6.0 leading to a normal hierarchical pattern of neutrino masses and constrained $CP$ phases. Furthermore, we analyze the generation of the observed baryon asymmetry of the Universe via thermal leptogenesis where the decays of the lightest fermion triplet $\\Sigma\\_1$ into lepton-Higgs final states produce a $CP$ asymmetry $\\varepsilon\\_{CP}$. The complex modules $\\tau$ is responsible for the $CP$ asymmetry produced during leptogenesis. The washout processes dominated by gauge scatterings and inverse decays are studied through the full set of Boltzmann equations. The resulting $B-L$ asymmetry, $Y\\_{B-L}\\sim 10^{-9}$ successfully reproduces the baryon-to-photon ratio demonstrating the model's capability to link low-energy neutrino data with the baryogenesis. The strong gauge-mediated washout of fermion triplets necessitates a leptogenesis scale of $\\mathcal{O}(10^{12}\\,\\mathrm{GeV})$ ensuring compatibility with both the Davidson-Ibarra bound and the thermal history of the Universe. Future pursuits remain open to the exploration of novel avenues aimed at lowering the energy scale associated with leptogenesis.\n\n", "2508.04766": "2025-08-06, **T versus CP effects in DUNE and T2HK**, Sabya Sachi Chatterjee et.al., [2508.04766v1](http://arxiv.org/abs/2508.04766v1)\n\n Time reversal (T) symmetry violations in neutrino oscillations imply the presence of an $L$-odd component in the transition probability at fixed neutrino energy, with $L$ denoting the distance between neutrino source and detector. Within the standard three-flavour framework, we show that the combination of the transition probabilities determined at the DUNE and T2HK experiments can establish the presence of an $L$-odd component, and therefore provide sensitivity to T violation, up to $4\\sigma$ significance. The optimal neutrino energy window is from 0.68 to 0.92 GeV, and therefore a crucial role is played by the low-energy part of the DUNE event spectrum covering the second oscillation maximum. We compare the sensitivity to T violation based on this energy range using neutrino data only with the more traditional search for charge-parity (CP) violation based on the comparison of neutrino versus anti-neutrino beam data. We show that for DUNE it is advantageous to run in neutrino mode only, i.e., searching for T violating effects, whereas T2HK is more sensitive to CP violation, comparing neutrino and anti-neutrino data. Hence, the two experiments offer complementary methods to determine the complex phase in the PMNS mixing matrix.\n\n", "2508.04274": "2025-08-06, **A neutrino data analysis of extra-dimensional theories with massive bulk fields**, Philipp Eller et.al., [2508.04274v1](http://arxiv.org/abs/2508.04274v1)\n\n We present a global neutrino oscillation analysis of models with a single large extra dimension in which right-handed neutrinos possess bulk Dirac masses. Two scenarios are considered: Large Extra Dimensions with bulk masses and the Dark Dimension framework, both predicting a tower of sterile Kaluza-Klein states that mix with active neutrinos. Using data from MINOS/MINOS+, KamLAND, and Daya Bay, we perform a joint likelihood analysis. No signatures of these theories were found. Therefore, we constrain the compactification radius under different bulk mass and Yukawa coupling assumptions. Large positive bulk masses or sizable Yukawas lead to strong bounds, while small couplings or negative bulk masses remain less constrained.\n\n", "2508.04264": "2025-08-06, **Magnetized Proto-Neutron Stars: Structure and Stability**, Harsh Chandrakar et.al., [2508.04264v1](http://arxiv.org/abs/2508.04264v1)\n\n This study examines the evolution of the global properties of magnetized proto-neutron stars (PNSs) across four key stages: neutrino-trapping, deleptonization, the neutrino-transparent phase, and the formation of a cold, catalyzed neutron star (NS). We perform general relativistic magnetohydrodynamic simulations with strong magnetic fields of approximately 10^17 Gauss. The stellar matter is modeled using equations of state (EoS) derived from relativistic mean-field theory, employing density-dependent couplings calibrated by the DDME2 parameterization. We analyze how the gravitational mass, equatorial radius, shape deformation, magnetic flux, and the magnetic-to-binding energy ratio evolve in response to changes in internal composition, thermodynamic conditions, and magnetic field configuration. Our results show that as PNSs evolve, increasing entropy per baryon and decreasing lepton fractions lead to higher core temperatures. These thermodynamic changes enhance the star's susceptibility to magnetic field-induced deformation, facilitate greater magnetic flux confinement, and increase the magnetic-to-binding energy ratio, especially during the deleptonization and neutrino-transparent phases. The PNS's core temperature also determines the efficiency of magnetic field decay. We find that dissipation is fastest during the deleptonization and neutrino-transparent phases, a process that ultimately defines the observable magnetic field of the mature NS.\n\n", "2508.04040": "2025-08-06, **Benchmarks and applications of the nuclear deexcitation event generator \\textsc{NucDeEx}**, Seisho Abe et.al., [2508.04040v1](http://arxiv.org/abs/2508.04040v1)\n\n Neutron multiplicity is a key observable in recent neutrino experiments that can enhance the sensitivity of various neutrino physics searches. Nuclear deexcitation plays a significant role in neutron emissions associated with neutrino-nucleus interactions; therefore, precise prediction of this process is eessential. To address this need, a general-purpose nuclear deexcitation event generator \\textsc{NucDeEx} was developed and released as an open-source package. The treatment of low-lying discrete excited states was updated to better reproduce experimental data. Benchmarks were conducted using existing nuclear deexcitation event generators and experimental data. Application to other simulators, neutrino event generator \\textsc{NEUT} and general particle simulation tool \\textsc{Geant4}, are also presented.\n\n"}, "dark matter": {"2508.05121": "2025-08-07, **Probing lepton flavor violating dark matter scenarios via astrophysical photons and positrons**, Jin-Han Liang et.al., [2508.05121v1](http://arxiv.org/abs/2508.05121v1)\n\n In this Letter we explore, for the first time, the constraints on lepton flavor violating (LFV) dark matter (DM) scenarios via the astrophysical photons and positrons, including both the annihilation and decay modes, ${\\tt DM(+DM)}\\to e^\\pm \\mu^\\mp, e^\\pm \\tau^\\mp, \\mu^\\pm \\tau^\\mp$. Given the presence of LFV interactions in various DM models and the challenge of probing such interactions at terrestrial facilities, such as DM direct detection and collider experiments, indirect detection offers a unique approach to investigating them. We utilize the currently available photon datasets from the XMM-Newton, INTEGRAL, and Fermi-LAT telescopes, along with the positron datasets from the AMS-02 satellite, to establish stringent bounds on the relevant annihilation cross sections or decay widths. In particular, we include contributions to the photon spectrum from final state radiation, radiative decays, and inverse Compton scattering. We find that the INTEGRAL (AMS-02) provides the most stringent bound on the annihilation cross sections and decay widths for DM mass below (above) approximately 20 GeV, which are comparable to those of their lepton flavor conserving counterparts.\n\n", "2508.04961": "2025-08-07, **Constraints on Symmetric Dark Matter from Neutron Star Capture and Collapse**, Yuxin Liu et.al., [2508.04961v1](http://arxiv.org/abs/2508.04961v1)\n\n Dark matter (DM) models with a conserved particle$-$antiparticle number, $n\\_\\chi-n\\_{\\tilde \\chi}$, and the asymmetry in the cosmological abundance $n\\_\\chi\\neq n\\_{\\tilde \\chi}$, are known to be challenged by the existence of old neutron stars (NSs), as the sufficient accumulation of DM will lead to the collapse of NSs into black holes. We demonstrate that the applicability of these constraints is much wider and covers models with symmetric populations of DM, $n\\_\\chi = n\\_{\\tilde \\chi}$, as the process of DM capture regulated by a nucleon-DM scattering can be inherently asymmetric, $\\sigma\\_{\\chi n}\\neq \\sigma\\_{\\tilde\\chi n}$. The asymmetry is induced by the interference of different types of $\\chi$-$n$ interactions, provided that their combination is odd under charge conjugation in the DM sector, $C\\_\\chi$, and even under combined parity $P\\_{\\chi + n}$. We provide a complete analysis of DM-nucleon bilinear $\\chi$-$n$ interactions and find that this asymmetry is very generic. Using canonical NS parameters and local DM halo inputs, we exclude spin-averaged scattering cross sections down to $\\sigma\\_{n\\chi}\\!\\gtrsim\\!10^{-46}\\,{\\rm cm}^{2}$ at DM mass $m\\_\\chi\\!\\lesssim\\!10^{10}\\,{\\rm GeV}$ for the maximally asymmetric capture rate, and show that the constraints persist down to very small values of the cross-section asymmetry, ${\\cal A}=(\\sigma\\_{\\chi n}- \\sigma\\_{\\tilde\\chi n})/(\\sigma\\_{\\chi n}+ \\sigma\\_{\\tilde\\chi n})\\gtrsim 10^{-5}$.\n\n", "2508.04912": "2025-08-06, **Gravitational Waves from Dark Gauge Sectors**, Alexander Belyaev et.al., [2508.04912v1](http://arxiv.org/abs/2508.04912v1)\n\n We explore gravitational-wave (GW) signatures from a strong first-order phase transition in a non-Abelian dark sector, which naturally gives rise to vector dark matter. We consider a general class of models featuring a new dark gauge sector communicating with the Standard Model (SM) through a Higgs portal and a vector-like fermionic portal. We also study the scenario where the dark sector interacts with the SM only via gravity. In all cases, we scan the full parameter space and analyse GW production, highlighting that secluded dark sectors, with excessive dark radiation, fail to produce a LISA-observable GW background. Notably, the fermionic portal yields distinctive GW signals at LISA with peak frequencies of 1-10 mHz, reaching up to 1 Hz for future interferometers like BBO and DECIGO, while the Higgs portal scenario remains limited to around 1 mHz. Both frameworks account for the observed dark matter abundance and predict detectable LISA signals for dark vector bosons near 3-4 TeV (Higgs portal) and 10 TeV (fermionic portal), with a $\\sim$10 GeV dark Higgs. Finally, we identify a unique six-top final state from pair-produced vector-like fermions, offering a striking collider signature within HL-LHC reach. Its detection would provide a smoking-gun signal for the fermionic portal, establishing complementarity between collider, GW, and dark matter signals.\n\n", "2508.04784": "2025-08-06, **Detecting the $π$-axiverse through parametric resonance**, Stephon Alexander et.al., [2508.04784v1](http://arxiv.org/abs/2508.04784v1)\n\n Axions are a leading dark matter candidate. In this work, we study the detectability of a multi-axion-like model, dubbed the $\\pi$-axiverse, that is distinguishable from the string axiverse. The dark matter candidates are $N^2-1$ pseudo-Nambu-Goto modes (pion- and kaon-like states) stemming from spontaneous breaking of a global $SU(N)$ flavor symmetry. The low energy theory includes $N-1$ axionic couplings with additional couplings to the Standard Model photon kinetic energy, reminiscent of the string theory dilaton-photon coupling. We explore the parametric resonance of photons interacting with such a dark sector. Axions are well known to form macroscopic solitonic-like objects (axion stars), which experience instabilities due to overdensities stemming from mergers or accretion processes. The instabilities produce high-intensity bursts of radiation via parametric resonance that may be detected at observatories such as MeerKAT, the Square Kilometre Array (SKA), and the next generation Very Large Array (ngVLA). Using numerical methods, we systematically explore the multi-dimensional parameter space of the $\\pi$-axiverse to search for regions where such signals are detectable, which generically differ from single axion models. We identify regions of the parameter space where MeerKAT, SKA, and ngVLA can resolve such signals, assessing the potential of transient searches to constrain the model. Our results provide a significant step forward in understanding the phenomenology and indirect detection of multi-axion-dilaton dark matter.\n\n", "2508.04781": "2025-08-06, **Constraining the Milky Way dark matter halo with LMC-induced reflex motion**, Rashid Yaaqib et.al., [2508.04781v1](http://arxiv.org/abs/2508.04781v1)\n\n Modelling perturbations of the Milky Way (MW) halo induced by the infall of the Large Magellanic Cloud (LMC) offers new avenues to constrain the dark matter (DM) distribution in our Galaxy. A key observable is the reflex motion of the MW disc with respect to the halo induced by the LMC's infall, which imprints a velocity dipole on kinematics of halo stars. Here we investigate how the dipole varies with Galactocentric radius, and study the sensitivity of the reflex motion signal to different DM outer-halo profiles. Using a suite of basis function expansion (BFE) simulations with truncated NFW profiles ($\\rho \\propto r^{-\\beta}$ beyond $r=50$ kpc), our $N$-body models show that (i) The reflex motion amplitude varies with Galactocentric radius but is largely insensitive to the outer DM slope, implying that the MW-LMC mass ratio alone does not set the dipole strength. (ii) In contrast, the direction of the disc motion is very sensitive to the density distribution of the outer DM halo. (iii) The contraction of the MW halo induced by the LMC's gravitational pull also depends strongly on the outer DM halo profile. (iv) We find a halo instability whose oscillation frequency increases with $\\beta$ producing a potentially observable signature - a sinusoidal pattern of the mean radial velocity of halo stars. Finally, using BFE coefficients we find that steeper truncations produce smaller dipole distortions, while amplifying the quadrupole distortion. These results highlight the limited constraining power of the reflex motion amplitude alone for outer MW profile parameters.\n\n", "2508.04772": "2025-08-06, **Inelastically Decoupling Dark Matter**, Ronny Frumkin et.al., [2508.04772v1](http://arxiv.org/abs/2508.04772v1)\n\n We present a new dark matter candidate, the `inELastically DEcoupling Relic' (iELDER), which is a cold thermal relic whose abundance is determined by the freeze out of its inelastic scattering off of bath particles in the presence of $3\\to2$ self-annihilations. The dark matter is predicted to be light, in the $O(\\mathrm{MeV}-\\mathrm{GeV})$ range, with significant self-annihilations and very weak inelastic couplings to ordinary matter. We demonstrate iELDER dark matter using a $Z\\_3$-symmetric toy model as well as QCD-like pion theories-the latter showing promising prospects for detection and providing a new benchmark for future searches.\n\n", "2508.04767": "2025-08-06, **Effective Field Theory Constraints on Primordial Black Holes from the High-Redshift Lyman-$α$ Forest**, Mikhail M. Ivanov et.al., [2508.04767v1](http://arxiv.org/abs/2508.04767v1)\n\n We present updated constraints on the abundance of primordial black holes (PBHs) dark matter from the high-redshift Lyman-$\\alpha$ forest data from MIKE/HIRES experiments. Our analysis leverages an effective field theory (EFT) description of the 1D flux power spectrum, allowing us to analytically predict the Lyman-$\\alpha$ fluctuations on quasi-linear scales from first principles. Our EFT-based likelihood enables robust inference across redshifts $z = 4.2-5.4$ and down to scales of 100 kpc, within previously unexplored regions of parameter space for this dataset. We derive new bounds on the PBH fraction with respect to the total dark matter $f\\_{\\text{PBH}}$, excluding populations with $f\\_{\\text{PBH}} \\gtrsim 10^{-3}$ for masses $M\\_{\\text{PBH}} \\sim 10^{4}-10^{16} M\\_{\\odot}$. This offers the leading constraint for PBHs heavier than $10^{9} M\\_{\\odot}$ and highlights the Lyman-$\\alpha$ forest as a uniquely sensitive probe of new physics models that modify the structure formation history of our universe.\n\n", "2508.04636": "2025-08-06, **Extension of the Einstein-Dirac-axion-aether theory based on an effective metric with a spinor kernel**, Alexander B. Balakin et.al., [2508.04636v1](http://arxiv.org/abs/2508.04636v1)\n\n We consider an axionic extension of the Einstein-Dirac-aether theory, which is based on the spinor modification of the kinetic term of the pseudoscalar field and describes the backreaction of the spinor field on the axionic dark matter. The main instrument of this extension is the effective metric constructed using the aether velocity four-vector and a kernel, which depends on the basic spinor scalar and on the square of the basic spinor pseudoscalar. The periodic potential of the axion field includes a guiding function, which regulates the dynamics of axions and predetermines the properties of their equilibrium states. This guiding function and the kernel of the effective metric, as well, are considered to be functions of the expansion scalar of the aether flow. The master equation for the guiding function is obtained as a consequence of the Lagrangian invariance with respect to the discrete transformations prescribed by the axion field shift symmetry. The self-consistent set of coupled master equations is derived, which includes new source-terms in the modified master equations for the spinor, axion, vector and gravitational fields. Cosmological applications of the extended theory are considered; new exact solutions of these equations are presented for the isotropic homogeneous model of the Universe evolution. Discussion is focused on the mechanism of backreaction of the spinor field on the axionic dark matter evolution.\n\n", "2508.04593": "2025-08-06, **A new constraint on the $y$-distortion with FIRAS: robustness of component separation methods**, Alina Sabyr et.al., [2508.04593v1](http://arxiv.org/abs/2508.04593v1)\n\n The sky-averaged Compton-$y$ distortion in the cosmic microwave background (CMB) energy spectrum, $\\langle y \\rangle$, provides information about energy injection in the Universe occurring at $z \\lesssim 5\\times10^{4}$. It is primarily sourced by the thermal Sunyaev-Zeldovich effect -- the up-scattering of CMB photons on free electrons in collapsed dark matter halos. In this work and our companion paper, Ref. [1], we perform a re-analysis of the archival COBE/FIRAS data to constrain $\\langle y \\rangle$. We utilize two analysis approaches: (i) fitting the sky-averaged intensity spectrum (frequency monopole) and (ii) fitting the sky spectrum in each pixel (pixel-by-pixel). We obtain the baseline upper limits $\\langle y \\rangle < 31\\times 10^{-6}$ and $\\langle y \\rangle < 8.3\\times 10^{-6}$ (both at $95\\%$ C.L.) for these two approaches, respectively. We present the first detailed comparison of these analysis methods on both mock skies and real data. Our findings suggest that accounting for the spatial variability of foregrounds via pixel-by-pixel fitting allows for tighter constraints on $\\langle y \\rangle$ by a factor of $\\approx 3-5$ as compared to the frequency monopole method. We show that our frequency monopole results agree well with predictions from Fisher forecast techniques based on the sky-averaged signal, which have been used for forecasting future spectral distortion experiments. Our results thus suggest that the scientific reach of future spectral distortion experiments can potentially be enhanced by a factor of a few via more optimal component separation methods, and we identify the pixel-by-pixel method as one such robust way to achieve this. We discuss the implications of our improved constraints on $\\langle y \\rangle$ from the pixel-by-pixel method in Ref. [1].\n\n", "2508.04410": "2025-08-06, **Bursting at the seams: the star-forming main sequence and its scatter at z=3-9 using NIRCam photometry from JADES**, C. Simmonds et.al., [2508.04410v1](http://arxiv.org/abs/2508.04410v1)\n\n We present a comprehensive study of the star-forming main sequence (SFMS) and its scatter at redshifts $3 \\leq z \\leq 9$, using NIRCam photometry from the JADES survey in the GOODS-S and GOODS-N fields. Our analysis is based on a sample of galaxies that is stellar mass complete down to $\\log \\left(M\\_{\\star}/M\\_{\\odot}\\right) \\approx 8.1$. The redshift evolution of the SFMS at an averaging timescale of 10 Myr follows a relation, quantified by the specific star-formation rates (sSFR$\\_{10}$), of $\\mathrm{sSFR}\\propto(1+z)^{\\mu}$ with $\\mu = 2.30^{+0.03}\\_{-0.01}$, in good agreement with theoretical predictions and the specific mass accretion rate of dark matter halos. We find that the SFMS normalisation varies in a complex way with the SFR averaging timescale, reflecting the combined effects of bursty star formation and rising star formation histories (SFHs). We quantify the scatter of the SFMS, revealing that it decreases with longer SFR averaging timescales, from $\\sigma\\_{\\rm{int}} \\approx 0.4-0.5~\\mathrm{dex}$ at 10 Myr to $\\sigma\\_{\\rm{int}} \\approx 0.2~\\mathrm{dex}$ at 100 Myr, indicating that shorter-term fluctuations dominate the scatter, although long-term variations in star formation activity are also present. Our findings suggest that bursty SFHs are more pronounced at lower stellar masses. Furthermore, we explore the implications of our results for the observed over-abundance of UV-bright galaxies at $z > 10$, concluding that additional mechanisms, such as top-heavy initial mass functions, increased star-formation efficiencies, or increased burstiness in star formation are needed to explain these observations. Finally, we emphasize the importance of accurate stellar mass completeness limits when fitting the SFMS, especially for galaxies with bursty SFHs.\n\n", "2508.04312": "2025-08-06, **Probing the Type 3 interacting dark-energy model using matter pairwise velocity**, Kin Ho Luo et.al., [2508.04312v1](http://arxiv.org/abs/2508.04312v1)\n\n Dark sector interactions can be explored via the so-called Type 3 model where dark matter and dark energy exchange momentum only, so as to minimize deviations from the $\\Lambda$CDM background expansion history. Using N-body simulations, we analyze the imprint of Type 3 model parameters, the momentum exchange coupling constant $\\beta$ and the slope of scalar field potential $\\lambda$, on large-scale structure (LSS) observables, particularly the matter pairwise velocity statistics. We find that the effects of $\\beta$ ($< 0$) and $\\lambda$ on the mean matter peculiar pairwise velocity and velocity dispersion are degenerate. Our results highlight the potential of velocity statistics as a probe of dark sector interactions and underscore the importance of disentangling $\\beta$ and $\\lambda$ in cosmological analyses.\n\n", "2508.04018": "2025-08-06, **The Milky Way and M31 rotation curves in Yukawa gravity: phenomenology and Bayesian analysis**, Davendra S. Hassan et.al., [2508.04018v1](http://arxiv.org/abs/2508.04018v1)\n\n Yukawa gravity provides a generalized framework for modeling gravity modification. We investigate the rotation curve profiles of spiral galaxies under Yukawa-like theories governed by the coupling strength $\\beta$ and the interaction range $\\lambda$. We develop a unified analytical and numerical framework to calculate rotational velocities under Yukawa gravity, which includes contributions from all major galactic components: stellar bulge, disk, dark matter (DM) halo, and central supermassive black hole. The calculations show that $\\beta$ and $\\lambda$ strongly influence velocity distributions, shifting peaks, creating double-peak structures, or enhancing dark matter dominance in the bulge or disk. To assess observational implications, we perform Bayesian analyses using data from the Milky Way (MW) and Andromeda (M31), which offer complementary characteristics: MW provides precise velocity profiles across multiple scales, while M31 includes broader morphological constraints. We examine four scenarios: Yukawa gravity without dark matter, dark matter with non-trivial coupling, fully modified gravity, and standard Newtonian gravity. Results show that MW models with $\\lambda < 1$ kpc yield high Bayes factors but risk overfitting, as dark matter mimics baryonic kinematics, while M31's photometric priors from conjugate observations mitigate this, yielding robust parameter estimates. However, in M31, Bayes factors favor Newtonian gravity, suggesting that current data lack the precision to resolve more complex models. This finding highlights two key needs: (i) realistic, physically or empirically informed priors to avoid biased constraints, and (ii) high-precision data with independent photometry to guard against overfitting. Our framework offers a scalable approach for testing gravity with large galactic rotation curve datasets.\n\n"}, "supernova": {"2508.05151": "2025-08-07, **Laboratory Modeling of Supernova Remnants Collisions: Implications for Triggered Star Formation**, Marin Fontaine et.al., [2508.05151v1](http://arxiv.org/abs/2508.05151v1)\n\n Theoretical models of star formation consistently underestimate the rates observed in astronomical surveys. Stars form within giant molecular clouds, which fragment into dense clumps under the combined influences of turbulence, magnetic fields, radiation and gravity. While some of these clumps collapse spontaneously, others require an external trigger, a mechanism estimated to account for 14-25% of star formation in regions such as the Elephant Trunk Nebula. Laboratory astrophysics has emerged as a powerful approach for investigating such triggering processes, particularly those involving supernova remnants (SNRs). Recent experiments, guided by well-established scaling laws, have successfully replicated the dynamics of SNRs and their interactions with dense clumps or other SNRs. In this work, we present a comprehensive numerical study of these experimental configurations using the 3D radiation-hydrodynamics code TROLL. The simulations provide enhanced insight into the underlying physical mechanisms, accurately reproduce key experimental phenomena and offer valuable comparisons with analytical models. This study underscores the strong synergy between laboratory experiments and numerical simulations, laying a robust foundation for future advancements in laboratory astrophysics. Furthermore, we propose a new experimental setup that offers improved scaling for the asymmetric collision observed in the DEM L316 system. Our findings also show that SNR collisions in dense environments can decrease the gravitational stability of dense clumps, thereby promoting their collapse and potentially triggering star formation.\n\n", "2508.04782": "2025-08-06, **A real-time search for Type Ia Supernovae with late-time CSM interaction in ZTF**, Jacco H. Terwel et.al., [2508.04782v1](http://arxiv.org/abs/2508.04782v1)\n\n The nature of Type Ia supernova (SN Ia) progenitor systems and the mechanisms that lead up to their explosions are still widely debated. In rare cases the SN ejecta interact with circumstellar material (CSM) that was ejected from the progenitor system prior to the SN. The unknown distance between the CSM and SN explosion site makes it impossible to predict when the interaction will start. If the time between the SN and start of CSM interaction is of the order of months to years the SN has generally faded and is not actively followed up anymore, making it even more difficult to detect the interaction while it happens. Here we report on a real-time monitoring program which ran between 13-11-2023 and 09-07-2024, monitoring 6914 SNe Ia for signs of late-time rebrightening using the Zwicky Transient Facility (ZTF). Flagged candidates were rapidly followed up with photometry and spectroscopy to confirm the late-time excess and its position. We report the discovery of a $\\sim50$ day rebrightening event in SN 2020qxz around 1200 days after the peak of its light curve. SN 2020qxz had signs of early CSM interaction but faded from view over 2 years before its reappearance. Follow-up spectroscopy revealed 4 emission lines that faded shortly after the end of the ZTF detected rebrightening. Our best match for these emission lines are H$\\beta$ (blue shifted by $\\sim5900$ km s$^{-1}$) and CaII$\\_{\\lambda8542}$, NI$\\_{\\lambda8567}$, and KI$\\_{\\lambda\\lambda 8763, 8767}$, all blue shifted by 5100 km s$^{-1}$ (although we note that these identifications are uncertain). This shows that catching and following up on late-time interactions as they occur can give new clues about the nature of the progenitor systems that produce these SNe by putting constraints on the possible type of donor star, and the only way to do this systematically is to use large sky surveys such as ZTF to monitor a large sample of objects.\n\n", "2508.04775": "2025-08-06, **Resolution-Corrected White Dwarf Gravitational Redshifts Validate SDSS-V Wavelength Calibration and Enable Accurate Mass-Radius Tests**, Stefan M. Arseneau et.al., [2508.04775v1](http://arxiv.org/abs/2508.04775v1)\n\n Leveraging the large sample size of low-resolution spectroscopic surveys to constrain white dwarf stellar structure requires an accurate understanding of the shapes of hydrogen absorption lines, which are pressure broadened by the Stark effect. Using data from both the Sloan Digital Sky Survey and the Type Ia Supernova Progenitor Survey, we show that substantial biases (5-15 km/s) exist in radial velocity measurements made from observations at low spectral resolution relative to similar measurements from high-resolution spectra. Our results indicate that the physics of line formation in high-density plasmas, especially in the wings of the lines, are not fully accounted for in state-of-the-art white dwarf model atmospheres. We provide corrections to account for these resolution-induced redshifts in a way that is independent of an assumed mass-radius relation, and we demonstrate that statistical measurements of gravitational redshift with these corrections yield improved agreement with theoretical mass-radius relations. Our results provide a set of best practices for white dwarf radial velocity measurements from low-resolution spectroscopy, including those from the Sloan Digital Sky Survey, the Dark Energy Spectroscopic Instrument, the 4-meter Multi-Object Spectroscopic Telescope, and the Wide-Field Multiplexed Spectroscopic Facility.\n\n", "2508.04497": "2025-08-06, **Dance to Demise -- How Massive Stars May Form Dense Circumstellar Shells Before Explosion**, Sutirtha Sengupta et.al., [2508.04497v1](http://arxiv.org/abs/2508.04497v1)\n\n We investigate the evolution of red supergiant (RSG) progenitors of core-collapse (CC) supernovae (SNe) with initial masses between 12-20 Msun focusing on effects of enhanced mass loss due to pulsation-driven instabilities in their envelopes and subsequent dynamical ejections during advanced stages of nuclear burning. Using time-dependent mass loss rates from detailed MESA stellar evolution models, including prescriptions for both pulsation-driven superwinds and shock-induced ejections, we construct the circumstellar medium (CSM) before the SN explosion. We calculate resulting CSM density profiles and column densities considering the radiation-driven acceleration of the stellar wind. Our models produce episodes of enhanced mass loss ~10^-4-10^-2 Msun/yr in the last centuries-decades before explosion forming dense CSM (>~10^-15 g/cm^3 at distances <~10^15 cm) - consistent with multi-wavelength observations of Type II SNe such as SN 2023ixf, SN 2020ywx, SN 2017hcc, SN 2005ip and SN 1998S. The formation of such dense CS shells, as predicted by our single star RSG models, provides a natural explanation for observed flash-ionization signatures, X-ray and radio emission, and has important implications for dust formation around Type II SNe.\n\n", "2508.04487": "2025-08-06, **Spectral Energy Correlations of Gamma-Ray Bursts from Structured Jets**, X. L. Zhang et.al., [2508.04487v1](http://arxiv.org/abs/2508.04487v1)\n\n Using 148 out-axis gamma-ray bursts, we build their spectrum-energy relations of peak energy versus isotropic energy, peak energy versus peak luminosity and peak energy versus jet-calibrated energy which are corrected for a structured jet model. These relations are found to depend on the observer's viewing angle as long as the observer is within the jet cone. After converting the out-axis energy relations to the in-axis situations, we find that the corresponding in-axis energy relations are universally steeper, of which all of them can be roughly interpreted by the Synchrotron radiation mechanism as shown in Xu et al.. Meanwhile, we notice that the in-axis means of isotropic energies are about one order of magnitude larger than the out-axis means for both short and long bursts except the Supernova-associated gamma-ray bursts. Furthermore, we apply all the newly-found energy relations to construct the Hubble diagrams of out/in-axis bursts. It is found that the in-axis Hubble diagrams are better cosmological indicators.\n\n", "2508.04277": "2025-08-06, **Stringent constraint on the CCC+TL cosmology with $H(z)$ Measurements**, Lei Lei et.al., [2508.04277v1](http://arxiv.org/abs/2508.04277v1)\n\n Recently, the Covarying Coupling Constants and Tired Light (CCC+TL) hybrid model was proposed to explain the unexpectedly small angular diameters of high-redshift galaxies observed by the James Webb Space Telescope (JWST) that are challenging to reconcile with the $\\Lambda$CDM model. In this work, we test the CCC+TL model against model-independent Hubble parameter [$H(z)$] measurements obtained from cosmic chronometers. It turns out that the parameter set optimized for the type-Ia supernova (SN Ia) dataset within the CCC+TL model fails to reproduce the $H(z)$ data, but the $\\Lambda$CDM model works well. Statistical comparison using the Bayesian Information Criterion (BIC) strongly favors $\\Lambda$CDM over CCC+TL for the $H(z)$ data, with $\\Delta \\mathrm{BIC} = 60.85$. Additionally, the fit of the CCC+TL model to the $H(z)$ data results in a best-fit value for the speed-of-light variation index parameter $\\alpha$ disagreeing with that for the SN Ia data at the $\\sim 6\\sigma$ level, demonstrating significant internal tension within the CCC+TL framework.\n\n", "2508.04053": "2025-08-06, **A second-generation star in a relic dwarf galaxy**, Anirudh Chiti et.al., [2508.04053v1](http://arxiv.org/abs/2508.04053v1)\n\n Stars that contain only trace amounts of elements heavier than helium, referred to as having low \"metallicity\", preserve the chemical fingerprints of the first generation of stars and supernovae. In the Milky Way, the lowest metallicity stars show an extreme over-abundance of carbon relative to other elements, which has been hypothesized to be a unique result of the first low-energy supernovae. However, the origin of this signature has remained a mystery, since no such stars have been discovered in the ancient dwarf galaxies where they are thought to have formed. Here, we present observations of a star in the >10 billion year old ultra-faint dwarf galaxy Pictor II, that shows the lowest iron and calcium abundances outside the Milky Way (<1/43,000th solar and ~1/160,000th solar), with a factor of >3000x relative carbon enhancement. As the first unambiguous second-generation star in a relic dwarf galaxy, this object demonstrates that carbon-enhanced second-generation stars can originate in primordial small-scale systems. This star supports the hypothesis that carbon-enhancement is produced by low-energy-supernovae, since the yields of energetic supernovae are harder to retain in small-scale environments. This key local signature of chemical enrichment by the first stars traces a regime inaccessible to current high-redshift observations, which cannot detect the early enrichment of the smallest galaxies.\n\n"}}