{"neutrino": {"2506.19822": "2025-06-24, **Non-holomorphic modular flavor symmetry and odd weight polyharmonic Maaß form**, Bu-Yao Qu et.al., [2506.19822v1](http://arxiv.org/abs/2506.19822v1)\n\n We extend the framework of non-holomorphic modular flavor symmetry to include the odd weight polyharmonic Maa{\\ss} forms. The integer weight polyharmonic Maa{\\ss} forms of level $N$ can be arranged into multipltets of the homogeneous finite modular group $\\Gamma'\\_N$. We propose to construct the integer weight, including weight one, non-holomorphic polyharmonic Maa{\\ss} forms from the non-holomorphic Eisenstein series. The previous results of even weight polyharmonic Maa{\\ss} forms are reproduced. We apply this formalism to address the flavor structure of the standard model. An example lepton model based on the modular group $\\Gamma'\\_3\\cong T'$ is constructed, where neutrino masses are generated via type-I seesaw mechanism with two right-handed neutrinos. This model can accommodate the experimental data for both normal and inverted neutrino mass orderings. We further extend this model to include quarks, so that the masses and mixing parameters of both quark and lepton sectors can be successfully described in terms of only thirteen real free parameters. It is the modular invariant model with the smallest number of free parameters so far, only normal ordering neutrino mass is viable after including quarks, and the correlations among the input parameters and flavor observables are analyzed.\n\n", "2506.19355": "2025-06-24, **Assessing the accuracy of the GENIE event generator with electron scattering data: Reduced cross section and nuclear transparency**, A. V. Butkevich et.al., [2506.19355v1](http://arxiv.org/abs/2506.19355v1)\n\n The reduced cross sections of the semi-exclusive $(l,l'p)$ lepton scattering process can be identified with distorted nuclear spectral functions. Irrespective of the type of interaction the distorted spectral function is determined mainly by intrinsic properties of the target and the ejected nucleon interaction with residual nucleus. Thus the reduced cross sections of the neutrino and electron scattering on nuclei as functions of nucleon missing momentum and energy are similar up to Coulomb corrections. Here we demonstrate the utility of this approach by benchmarking the GENIE neutrino event generator against a broad set of semi-exclusive electron scattering data for carbon target. We observe persistent disagreements between the generator predictions and data in the range of nucleon missing momenta less than 80 MeV/c. The approach presented in this paper provide a great opportunity to test better the accuracy of nuclear models of quasi-elastic neutrino-nucleus scattering, employed in neutrino event generators.\n\n", "2506.19354": "2025-06-24, **Torsional modulation of atmospheric neutrino oscillation**, Riya Barick et.al., [2506.19354v1](http://arxiv.org/abs/2506.19354v1)\n\n Fermions act as sources of spacetime torsion. However, this torsion is non-dynamical and can be eliminated using its equations of motion. The resulting theory features an effective four-fermion interaction in a torsion-free background. Generically this interaction is non-universal and violates parity. When neutrinos propagate through matter, they experience the effect of this geometrical interaction, which is similar to the MSW effect, but diagonal in the mass basis. Since this quartic interaction term varies linearly with matter density, its effect will be more prominent for atmospheric neutrinos specially for upward going atmospheric neutrinos. We investigate the effect of spacetime geometry on $\\nu\\_\\mu \\to \\nu\\_\\tau$ and $\\nu\\_\\mu \\to \\nu\\_e$ conversion probability and $\\nu\\_\\mu$ survival probability, by solving the Schr\\\"odinger equation using the PREM density profile of the Earth. We also study the dependence of atmospheric neutrino oscillation probability on the CP phase angle in presence of this effect. We further provide a discussion of the MSW and parametric resonances in presence of the geometrical interaction.\n\n", "2506.19241": "2025-06-24, **Measurement of the mean number of muons with energies above 500 GeV in air showers detected with the IceCube Neutrino Observatory**, R. Abbasi et.al., [2506.19241v1](http://arxiv.org/abs/2506.19241v1)\n\n We present a measurement of the mean number of muons with energies larger than 500 GeV in near-vertical extensive air showers initiated by cosmic rays with primary energies between 2.5 PeV and 100 PeV. The measurement is based on events detected in coincidence between the surface and in-ice detectors of the IceCube Neutrino Observatory. Air showers are recorded on the surface by IceTop, while a bundle of high-energy muons (\"TeV muons\") from the shower can subsequently produce a track-like event in the IceCube in-ice array. Results are obtained assuming the hadronic interaction models Sibyll 2.1, QGSJet-II.04, and EPOS-LHC. The measured number of TeV muons is found to be in agreement with predictions from air-shower simulations. The results have also been compared to a measurement of low-energy muons by IceTop, indicating an inconsistency between the predictions for low- and high-energy muons in simulations based on the EPOS-LHC model.\n\n", "2506.19196": "2025-06-23, **On the initial conditions of the $ν$HDM cosmological model**, Nick Samaras et.al., [2506.19196v1](http://arxiv.org/abs/2506.19196v1)\n\n The $\\nu$HDM is the only cosmological model based on Milgromian Dynamics (MOND) with available structure formation simulations. While MOND accounts for galaxies, with a priori predictions for spirals and ellipticals, a light sterile neutrino of 11 eV can assist in recovering scaling relations on the galaxy-cluster scales. In order to perform MONDian cosmological simulations in this theoretical approach, initial conditions derived from a fit to the angular power spectrum of Cosmic Microwave Background (CMB) fluctuations are required. In this work, we employ CosmoSIS to perform a Bayesian study of the $\\nu$HDM model. Using the best-fit values of the posterior, the CMB power spectrum is reevaluated. The excess of power in the transfer function implies a distinct evolution scenario, which can be used further as an input for a set of hydro-dynamical calculations. The resulting values H0 $\\approx$ 56 km/s/Mpc and ${\\Omega}\\_{m\\_{0}} \\approx 0.5$ are far from agreement with respect to the best fit ones in the canonical Cold Dark Matter model, but may be significant in MONDian cosmology. The assumed Planck CMB initial conditions are only valid for the $\\Lambda$CDM cosmology. This work constitutes a first step in an iterative procedure needed to disentangle the model dependence of the derived initial density and velocity fields.\n\n", "2506.19062": "2025-06-23, **WIMPs Below the Radar: Blind Spots and Benchmarks Beyond the Neutrino Floor**, Giorgio Arcadi et.al., [2506.19062v1](http://arxiv.org/abs/2506.19062v1)\n\n We investigate benchmark scenarios for Weakly Interacting Massive Particles (WIMPs) that naturally evade current direct detection constraints by featuring suppressed spin-independent cross-sections. Focusing on three representative models, the Singlet-Doublet fermion model, its extension to a Two-Higgs-Doublet plus pseudoscalar sector (2HDM$+a$), and a dark $SU(3)$ gauge model, we systematically analyze the interplay between thermal freeze-out, direct detection blind spots, and radiative corrections. In each case, we identify viable regions of parameter space where the predicted dark matter relic abundance is consistent with observations while elastic scattering rates lie below current exclusion limits and, in some cases, but now always, below the neutrino floor. Loop-induced effects are shown to play a critical role, particularly in scenarios with suppressed tree-level interactions. Our findings demonstrate that models with rich electroweak and scalar sectors can populate the experimentally challenging, yet phenomenologically motivated parameter space between existing constraints and the ultimate sensitivity of current-technology direct detection experiments.\n\n", "2506.18970": "2025-06-23, **ALPy Cogenesis**, Disha Bandyopadhyay et.al., [2506.18970v1](http://arxiv.org/abs/2506.18970v1)\n\n We propose a novel cogenesis scenario by utilising the two-body decay of heavy right-handed neutrino (RHN) via an effective operator involving an axion-like particle (ALP) dark matter (DM) and a light chiral fermion $\\nu\\_R$. This allows the two-body decay of heavy RHN into $\\nu\\_R$ and ALP thereby generating a lepton asymmetry in $\\nu\\_R$ which later gets transferred to left-handed leptons via sizeable Yukawa coupling with a neutrinophilic Higgs doublet. The asymmetry in left-handed leptons is then converted into baryon asymmetry via electroweak sphalerons. The lepton number violation by heavy RHN also induces a one-loop Majorana mass of $\\nu\\_R$ rendering the light neutrinos to be Majorana fermions. Successful leptogenesis constrain the parameter space in terms of RHN mass and axion decay constant. This has interesting consequences for both ALP and QCD axion DM parameter space within reach of several ongoing and near future experiments. We also propose a Dirac version of this scenario without any total lepton number violation. This leads to a long-lived asymmetric Dirac fermion contributing partially to DM thereby opening up more parameter space for ALP. In addition to axion search experiments, the proposed scenarios can have observable signatures at cosmic microwave background (CMB), DM search as well as terrestrial particle physics experiments.\n\n", "2506.18956": "2025-06-23, **Search for an Anomalous Excess of Single Photons in the MicroBooNE Neutrino Experiment**, Lee Hagaman et.al., [2506.18956v1](http://arxiv.org/abs/2506.18956v1)\n\n Neutrinos are some of the most elusive particles in the standard model, being incredibly common throughout the universe, but interacting with detectors incredibly rarely. Certain properties of neutrinos remain difficult to measure, including their masses, their CP violation properties, and whether or not they are their own antiparticles. Additionally, there have been several anomalous results in neutrino experiments which remain unexplained. MicroBooNE was built in order to study these anomalous results using a more capable detector technology, the Liquid Argon Time Projection Chamber. Specifically, MicroBooNE is able to search for an anomalous excess of low energy electromagnetic showers, which was previously observed by the MiniBooNE experiment. In particular, MicroBooNE is able to study whether the excess could consist of electron showers or photon showers. In this thesis, I describe a search for this anomalous excess by targeting neutral current Delta radiative decays, the largest expected source of single photons in MicroBooNE. We observe data consistent with our nominal expectation, but cannot rule out all potential sources of additional single photon events, particularly those with no visible proton activity. There remains significant potential to probe this channel in even more detail using MicroBooNE and other experiments in the near future.\n\n", "2506.18566": "2025-06-23, **Cosmic Ray Detection with the IceTop Enhancement**, Megha Venugopal et.al., [2506.18566v1](http://arxiv.org/abs/2506.18566v1)\n\n IceTop is the cosmic-ray detector located on the surface of the IceCube Neutrino Observatory at the South Pole, consisting of 81 pairs of ice-Cherenkov tanks. The rise in the energy threshold of air-shower measurements in IceTop due to accumulating snow emphasized the need for the next generation of IceCube surface detectors. For this purpose, the Surface Array Enhancement (SAE) is set to comprise elevated scintillator panels and radio antennas controlled by hybrid DAQ systems. The detectors of the SAE are also expected to extend to the planned IceCube-Gen2 Surface Array. An initial study with a prototype station is already conducted. We briefly review the SAE and the deployment as well as the calibration status of the upcoming stations of the planned array of 32 stations. The focus of this contribution is on the radio detection of extensive air showers. A preliminary estimation of the position of the shower maximum ($X\\_\\mathrm{max}$), that is sensitive to the primary mass, with data from the 3 antennas of the prototype station was carried out. An extension of the method from previous analyses is also briefly discussed.\n\n", "2506.18490": "2025-06-23, **Flash Ionization of the Early Universe by Pop III.1 Supermassive Stars**, Jonathan C. Tan et.al., [2506.18490v1](http://arxiv.org/abs/2506.18490v1)\n\n The Pop III.1 theory for supermassive black hole (SMBH) formation predicts that a substantial fraction of the early universe was ionized by supermassive stars at redshifts $z\\sim20-30$, an era we refer to as ``The Flash''. This is followed by recombination to a mainly neutral state within a few tens of Myr. Here we discuss the implication of this ionization for the scattering optical depth of the cosmic microwave background (CMB), $\\tau$. We find a fiducial contribution of $\\tau\\_{\\rm PopIII.1}\\sim0.04$. Combining this with the contribution to reionization by standard galaxy populations at $z\\lesssim 10$ with $\\tau\\_{\\rm gal}\\simeq0.06$, yields a total of $\\tau\\simeq0.10$. As noted recently by several authors, such a value can help resolve apparent ``problems'' faced by $\\Lambda$CDM of negative neutrino masses and dynamical dark energy that have been implied by recent Baryonic Acoustic Oscillation (BAO) results from the Dark Energy Spectroscopic Instrument (DESI).\n\n"}, "dark matter": {"2506.19721": "2025-06-24, **MUSE-DARK-I: Dark matter halo properties of intermediate-z star-forming galaxies**, B. I. Ciocan et.al., [2506.19721v1](http://arxiv.org/abs/2506.19721v1)\n\n [Abridged] We analyse the dark matter (DM) halo properties of 127 0.3<z<1.5 star-forming galaxies (SFGs) down to low stellar masses (7<log(Mstar/Msun)<11), using data from the MUSE Hubble Ultra Deep Field Survey and photometry from HST and JWST. We employ a 3D forward modelling approach to analyse the morpho-kinematics of our sample, enabling measurement of individual rotation curves out to 2-3 times the effective radius. We perform a disk-halo decomposition with a 3D parametric model that includes stellar, gas, and DM components, with pressure support corrections. We validate our methodology on mock data cubes generated from idealised disk simulations. We select the best-fitting DM model among six density profiles, including the Navarro-Frenk-White and the generalised alpha-beta-gamma profile of Di Cintio et al. (2014, DC14). Our Bayesian analysis shows that DC14 performs as well as or better than the other profiles in >65% of the sample. We find that the kinematically inferred stellar masses agree with values from SED fitting. We find that 89% of galaxies have DM fractions >50%. For 70% of SFGs, we infer a DM inner slope, gamma < 0.5, indicating cored DM profiles, but no correlation is found between gamma and star formation rate of the sample. The stellar- and concentration-mass relations agree with theoretical expectations, but with larger scatter. We confirm the anticorrelation between halo scale radius and DM density. The halo scale radii and DM surface densities increase with Mstar, while DM densities stay constant. We find tentative evidence of an evolution of the DM density with z, which suggests that the DM halos of intermediate-z systems are denser than those of local galaxies. In contrast, the halo scale radii are z-invariant.\n\n", "2506.19719": "2025-06-24, **Cross-sections and experimental signatures for detection of a well-defined dark matter WIMP**, Bailey Tallman et.al., [2506.19719v1](http://arxiv.org/abs/2506.19719v1)\n\n We report the following calculations for a recently proposed bosonic dark matter WIMP with well-defined interactions: (1)~the mass as determined by fitting to the relic abundance; (2)~the current annihilation cross-section for indirect detection; (3)~cross-sections for pair production accompanied by jets in proton colliders with center-of-mass energies ranging from 13 to 100 TeV; (4)~for the high-luminosity LHC, and planned 100 TeV proton collider, detailed plots of experimentally accessible quantities before and after optimal cuts; (5)~cross-sections, and plots of experimentally accessible quantities, for production in e$^+$e$^-$ or muon colliders with center-of-mass energies up to 10 TeV; (6)~cross-section per nucleon for direct detection. The conclusions are given in the text, including the principal prediction that (with optimal cuts) this particle should be detectable at the high-luminosity LHC, perhaps after only two years with an integrated luminosity of 500 fb$^{-1}$.\n\n", "2506.19614": "2025-06-24, **Directional search for light dark matter with quantum sensors**, Hajime Fukuda et.al., [2506.19614v1](http://arxiv.org/abs/2506.19614v1)\n\n The presence of dark matter (DM) stands as one of the most compelling indications of new physics in particle physics. Typically, the detection of wave-like DM involves quantum sensors, such as qubits or cavities. The phase of the sensors is usually discarded as the value of the phase itself is not physically meaningful. However, the difference of the phase between the sensors contains the information of the velocity and direction of the DM wind. We propose a measurement protocol to extract this information from the sensors using quantum states. Our method does not require specific experimental setups and can be applied to any type of DM detector as long as the data from the detectors can be taken quantum mechanically. We also show that our method does not spoil the sensitivity of the DM detectors and is superior to the classical method based on the correlations of the DM signals between the detectors.\n\n", "2506.19506": "2025-06-24, **Tracing Cosmic Voids with fast simulations**, M. D. Lepinzan et.al., [2506.19506v1](http://arxiv.org/abs/2506.19506v1)\n\n Context. Cosmic voids are vast underdense regions in the cosmic web that encode crucial information about structure formation, the composition of the Universe, and its expansion history. Due to their lower density, these regions are less affected by non-linear gravitational dynamics, making them suitable candidates for analysis using semi-analytic methods. Aims. We assess the accuracy of the PINOCCHIO code, a fast tool for generating dark matter halo catalogs based on Lagrangian Perturbation Theory, in modeling the statistical properties of cosmic voids. We validate this approach by comparing the resulting void statistics measured from PINOCCHIO to those obtained from N-body simulations. Methods. We generate a set of simulations using PINOCCHIO and OpenGADGET3, assuming a fiducial cosmology and varying the resolution. For a given resolution, the simulations share the same initial conditions between the different simulation codes. Snapshots are saved at multiple redshifts for each simulation and post-processed using the watershed void finder VIDE to identify cosmic voids. For each simulation code, we measure the following statistics: void size function, void ellipticity function, core density function, and the void radial density profile. We use these statistics to quantify the accuracy of PINOCCHIO relative to OpenGADGET3 in the context of cosmic voids. Results. We find agreement for all void statistics at better than 2{\\sigma} between PINOCCHIO and OpenGADGET3, with no systematic difference in redshift trends. This demonstrates that the PINOCCHIO code can reliably produce void statistics with high computational efficiency compared to full N-body simulations.\n\n", "2506.19327": "2025-06-24, **Detectability of dark matter density distribution via gravitational waves from binary black holes in the Galactic center**, Zhijin Li et.al., [2506.19327v1](http://arxiv.org/abs/2506.19327v1)\n\n The fundamental nature of dark matter (DM) remains unknown, with significant uncertainties in its density profile. DM environments surrounding massive binary black holes (BBHs) modify their orbital dynamics, thereby altering gravitational wave (GW) emissions. For BBH systems at the Galactic Center, dynamical friction induced by DM spikes could produce detectable deviations in GW spectra, potentially observable by future space-based detectors. To address the uncertainties in the Galactic Center's DM profile, we systematically examine two scenarios: the generalized Navarro-Frenk-White (gNFW) profile and its post-spike modification. We investigate the evolutionary effects of DM dynamical friction and accretion on the eccentricity and semi-latus rectum of secondary black holes (BHs) in elliptical orbits. By constructing orbital models with varying initial eccentricities across the mass-semi-latus rectum parameter space and utilizing 30 years of simulated pulsar timing array data from the Square Kilometer Array (SKA), we identify detectable parameter regimes of DM effects and employ these GW observational signatures to constrain different DM density profiles. Our analysis reveals that among gNFW profiles ($\\gamma=2,1.5,1,0.5$), only $\\gamma=2$ produces significant detectable signatures. The formation of DM spikes further enhances these observable waveform deviations for all gNFW slopes.\n\n", "2506.19099": "2025-06-23, **Time dilation observed in Type Ia supernova light curves and its cosmological consequences**, Vaclav Vavrycuk et.al., [2506.19099v1](http://arxiv.org/abs/2506.19099v1)\n\n The cosmic time dilation observed in Type Ia supernova light curves suggests that the passage of cosmic time varies throughout the evolution of the Universe. This observation implies that the rate of proper time is not constant, as assumed in the standard FLRW metric, but instead is time-dependent. Consequently, the commonly used FLRW metric should be replaced by a more general framework, known as the Conformal Cosmology (CC) metric, to properly account for cosmic time dilation. The CC metric incorporates both spatial expansion and time dilation during cosmic evolution. As a result, it is necessary to distinguish between comoving and proper (physical) time, similar to the distinction made between comoving and proper distances. In addition to successfully explaining cosmic time dilation, the CC metric offers several further advantages: (1) it preserves Lorentz invariance, (2) it maintains the form of Maxwell's equations as in Minkowski space-time, (3) it eliminates the need for dark matter and dark energy in the Friedmann equations, and (4) it successfully predicts the expansion and morphology of spiral galaxies in agreement with observations.\n\n", "2506.19096": "2025-06-23, **Constraining exotic high-$z$ reionization histories with Gaussian processes and the cosmic microwave background**, Hanyu Cheng et.al., [2506.19096v1](http://arxiv.org/abs/2506.19096v1)\n\n The large-angle polarization anisotropies observed in the cosmic microwave background (CMB) are generated by Thomson scattering of CMB photons off free electrons in the post-recombination Universe. In the standard $\\Lambda$ cold dark matter cosmological model, the free electron density becomes large at redshifts $z \\lesssim 10$ due to the formation of the first stars, leading to reionization of the intergalactic medium. In this work, we use \\emph{Gaussian processes} to give a model-independent reconstruction of the reionization history of the Universe constrained by the \\textit{Planck} CMB measurements. This method gives a consistent reconstruction of the standard reionization at $z \\lesssim 10$, and strongly constrains any additional high-$z$ reionization. We use our results to construct a new derived parameter expressing the high-$z$ contribution to the CMB optical depth, $\\tau\\_{\\mathrm{highz}}$. The posterior distribution on $\\tau\\_{\\mathrm{highz}}$ can be used to set accurate constraints on models for exotic energy injection, which we demonstrate for the case of decaying dark matter with particle mass in the range $\\mathcal{O}(1\\,\\text{MeV})$. A companion paper demonstrates the use of this methodology to test ensembles of multi-axion models. Our results can be recast to different models using the provided data and code: \\href{https://github.com/Cheng-Hanyu/CLASS\\_reio\\_gpr}{github.com/Cheng-Hanyu/CLASS\\\\_reio\\\\_gpr}.\n\n", "2506.18982": "2025-06-23, **First direct search for light dark matter interactions in a transition-edge sensor**, Christina Schwemmbauer et.al., [2506.18982v1](http://arxiv.org/abs/2506.18982v1)\n\n We propose the use of transition-edge sensor (TES) single-photon detectors as a simultaneous target and sensor for direct dark matter searches, and report results from the first search of this kind. We perform a 489 h science run with a TES device optimized for the detection of 1064 nm photons, with a mass of ~0.2 ng and an energy threshold of ~0.3 eV, and set new limits on dark matter interactions with both electrons and nucleons for dark matter with mass below the MeV scale. With their excellent energy resolution, TESs enable search strategies that are complementary to recent results from superconducting nanowire single-photon detectors and kinetic inductance detectors. We show that next-generation TES arrays hold promise to probe new regions of light dark matter parameter space.\n\n", "2506.18892": "2025-06-23, **$g$-mode oscillations of dark matter admixed neutron stars**, Swarnim Shirke et.al., [2506.18892v1](http://arxiv.org/abs/2506.18892v1)\n\n We investigate $g$-mode oscillations in dark matter admixed neutron stars employing a relativistic mean field model to describe hadronic matter and a model for self-interacting fermionic dark matter motivated by the neutron decay anomaly. Following the construction of such admixed configurations, we derive the equilibrium and adiabatic speeds of sound therein, leading to a computation of the star's $g$-mode spectrum in the Cowling approximation. In particular, we explore the effect of dark matter self-interaction, the nucleon effective mass and dark matter fraction on the principal $g$-mode frequency, and its first overtone. We show that the effect on $g$-mode frequency depends predominantly on the dark matter fraction, and demonstrate an equation of state-independent constraint for the latter. Prospects of identifying the presence of dark matter in neutron stars using $g$-mode are discussed.\n\n", "2506.18595": "2025-06-23, **Search for dark-matter axions beyond the quantum limit: the Cosmological Axion Sarov Haloscope (CASH) proposal**, Andrey L. Pankratov et.al., [2506.18595v1](http://arxiv.org/abs/2506.18595v1)\n\n Firmly established in astrophysical observations, dark matter evades direct detection in experiments. Axions and axion-like particles are among the leading dark-matter candidates, and numerous attempts to detect them in laboratories have been performed. Here, we propose to advance these efforts substantially, extending the sensitivity for dark-matter axions in the mass range $(38-54)~\\mu$eV down to the axion-photon couplings $g\\_{a\\gamma\\gamma}\\lesssim \\left(10^{-14}-10^{-15}\\right)$ GeV$^{-1}$, motivated by generic models of Quantum Chromodynamics axion. Single-photon detectors operating at ultra-low temperatures are key elements of the experiment. The projected sensitivity will be reached in one year of data taking with magnetic field of $(1-10)$ T, making Cosmological Axion Sarov Haloscope (CASH) the most sensitive haloscope in this mass range.\n\n", "2506.18477": "2025-06-23, **Cosmic Sign-Reversal: Non-Parametric Reconstruction of Interacting Dark Energy with DESI DR2**, Yun-He Li et.al., [2506.18477v1](http://arxiv.org/abs/2506.18477v1)\n\n A direct interaction between dark energy and dark matter provides a natural and important extension to the standard $\\Lambda$CDM cosmology. We perform a non-parametric reconstruction of the vacuum energy ($w=-1$) interacting with cold dark matter using the cosmological data from DESI DR2, Planck CMB, and three SNIa samples (PP, DESY5, and Union3). By discretizing the coupling function $\\beta(z)$ into 20 redshift bins and assuming a Gaussian smoothness prior, we reconstruct $\\beta(z)$ without assuming any specific parameterization. The mean reconstructed $\\beta(z)$ changes sign during cosmic evolution, indicating an energy transfer from cold dark matter to dark energy at early times and a reverse flow at late times. At high redshifts, $\\beta(z)$ shows a $\\sim 2\\sigma$ deviation from $\\Lambda$CDM. At low redshifts, the results depend on the SNIa sample: CMB+DESI and CMB+DESI+PP yield $\\beta(z)$ consistent with zero within $2\\sigma$, while CMB+DESI+DESY5 and CMB+DESI+Union3 prefer negative $\\beta$ at $\\sim2\\sigma$. Both $\\chi^2$ tests and Bayesian analyses favor the $\\beta(z)$ model, with CMB+DESI DR2+DESY5 showing the most significant support through the largest improvement in goodness of fit ($\\Delta\\chi^2\\_{\\rm MAP}=-17.76$) and strongest Bayesian evidence ($\\ln\\mathcal{B} = 5.98 \\pm 0.69$). Principal component analysis reveals that the data effectively constrain three additional degrees of freedom in the $\\beta(z)$ model, accounting for most of the improvement in goodness of fit. Our results demonstrate that the dynamical dark energy preference in current data can be equally well explained by such a sign-reversal interacting dark energy, highlighting the need for future observations to break this degeneracy.\n\n", "2506.18457": "2025-06-23, **Observable signatures of Black Holes with Hernquist Dark Matter Halo having a cloud of strings: From Geodesics to Shadow**, Faizuddin Ahmed et.al., [2506.18457v1](http://arxiv.org/abs/2506.18457v1)\n\n We present a comprehensive theoretical investigation of a novel black hole (BH) spacetime: a Schwarzschild BH embedded in a Hernquist-type dark matter halo (HDMH) and surrounded by a cloud of cosmic strings (CSs) -- collectively termed the Schwarzschild-HDMH with CS (SHDMHCS) configuration. By analyzing the spacetime geometry, we explore how key parameters -- the core radius and halo density of the dark matter, along with the string tension -- affect the geodesic motion of both massless and massive particles. Our results reveal that the combined influence of HDMH and CSs modifies the effective potentials for null and timelike geodesics, leading to distinct dynamical behavior compared to standard Schwarzschild geometry. We perform a perturbative analysis for scalar (spin-0), electromagnetic (spin-1), and Dirac (spin-1/2) fields, deriving the associated effective potentials and showing how both the dark halo and CSs alter field propagation and potential barriers. The shadow of the BH is studied in detail: we derive analytical expressions for photon sphere and shadow radii, finding that CSs tend to enlarge the shadow, while HDMH properties tend to shrink it. The combined effects of these parameters significantly influence the shadow's shape and size, producing potentially observable signatures. Our results establish that the SHDMHCS configuration yields distinct observational imprints detectable by present and forthcoming astrophysical instruments. This framework provides new tools for probing exotic matter distributions via gravitational wave observations, orbital dynamics, and high-resolution black hole imaging, offering a pathway to distinguish such configurations from simpler BH models in realistic environments.\n\n", "2506.18442": "2025-06-23, **Revisiting the Electroweak Supersymmetry from the Generalized Minimal Supergravity**, Imtiaz Khan et.al., [2506.18442v1](http://arxiv.org/abs/2506.18442v1)\n\n We explore the Electroweak Supersymmetry (EWSUSY) scenario within the Minimal Supersymmetric Standard Model (MSSM) under the Generalized Minimal Supergravity (GmSUGRA) framework, given that the anomalous magnetic moment of the muon may now be consistent with the Standard Model (SM) prediction, we consider both signs of the Higgsino mass parameter, $\\mu < 0$ and $\\mu > 0$. A comprehensive scan of the parameter space is performed, subject to the experimental constraints from the LHC SUSY searches, Planck 2018 relic density, and LUX-ZEPLIN (LZ) direct detection limits. We identify the viable regions featuring neutralino dark matter production via coannihilation with stau, chargino, stop, sbottom, and gluino, as well as through $A$-funnel, Higgs-resonance, and $Z$-resonance mechanisms. Notably, the $\\mu < 0$ scenario yields a broader allowed parameter space, including for the first time sbottom-neutralino coannihilation solutions in GmSUGRA, which are absent for $\\mu > 0$. While the Higgs-pole and $Z$-pole regions for $\\mu > 0$ are largely excluded by the current LZ bounds, substantial viable regions remain for $\\mu < 0$. Gluino coannihilation scenarios are strongly constrained by the current LHC data. The characteristic mass ranges of interest include sbottoms (0.7-1.3~TeV), stops (up to 1.0~TeV for $\\mu > 0$ and 1.3~TeV for $\\mu < 0$), staus and charginos (up to 1.5~TeV), and pseudoscalar Higgs bosons in the $A$-funnel (0.4-1.4~TeV). Moreover, the supersymmetric contributions to the muon anomalous magnetic moment remain within a $2\\sigma$ deviation from the SM prediction. And our findings suggest that significant portions of the parameter space can be probed at the future LHC SUSY searches and upcoming dark matter direct detection experiments.\n\n", "2506.18411": "2025-06-23, **A new Limit for Axion Dark Matter with SPACE**, M. A. Akgümüs et.al., [2506.18411v1](http://arxiv.org/abs/2506.18411v1)\n\n The axion, which has yet to be discovered, is a promising candidate for dark matter that emerges from Peccei-Quinn theory. This article presents the search for axion dark matter with the \"Student Project for an Axion Cavity Experiment\" (SPACE), which is also the first one in Germany. The hypothetical particle was looked for in the mass range from $16.626~\\mathrm{\\mu eV}$ to $16.653~\\mathrm{\\mu eV}$, corresponding to a frequency range of 4.020 GHz to 4.027 GHz, using a resonant cavity in a peak magnetic field of 14 T. No significant signal was found, allowing us to exclude an axion-photon coupling $g\\_{a\\gamma\\gamma} = 14.6 \\cdot 10^{-13}~\\mathrm{GeV}^{-1}$ for the full mass range and $g\\_{a\\gamma\\gamma} = 2.811 \\cdot 10^{-13}~\\mathrm{GeV}^{-1}$ at peak sensitivity with a 95\\% confidence level. This limit surpasses previous constraints by more than two orders of magnitude.\n\n"}, "supernova": {"2506.19623": "2025-06-24, **Power-law Emission-line Wings and Radiation-Driven Superwinds in Local Lyman Continuum Emitters**, Lena Komarova et.al., [2506.19623v1](http://arxiv.org/abs/2506.19623v1)\n\n We investigate broad emission-line wings, reaching velocities up to 800 km/s, observed in 26 galaxies with Lyman continuum (LyC) observations, primarily from the Low-redshift Lyman Continuum Survey (LzLCS). Using Magellan/MIKE, VLT/X-shooter, and WHT/ISIS high-resolution spectroscopy, we show that this fast gas appears to probe the dominant feedback mechanisms linked to LyC escape. We find that in 14 galaxies, the wings are best fit with power laws with slopes -3.5 to -1.6, with four others best fit by Gaussians of width ~300 km/s; the remaining eight show ambiguous wing morphologies. Gaussian wings are found only at low O32 = [O III]5007/[O II]3726,3729 and high metallicity, while power-law wings span the full range of these parameters. The general evidence suggests a dual-mode paradigm for LyC escape: radiation-driven superwinds traced by power-law wings and supernova-driven feedback traced by Gaussian wings. For the former, the < 3 Myr-old, pre-supernova stellar population correlates with more luminous, faster winds. The data also show that radiation-driven wind parameters like wind luminosity and power-law slope depend on the UV luminosity more than the optically thick covering fraction, consistent with ``picket-fence\" radiative transfer. Observed wing slope values flatten with both escaping LyC luminosity and higher extinction, while still preserving the anticorrelation between these two quantities. Additionally, the differential between red and blue slopes implies that extinction and dense gas are centrally concentrated relative to the wind emission. Overall, our results show that power-law emission-line wings probe LyC-driven winds and LyC escape in metal-poor starbursts.\n\n", "2506.19460": "2025-06-24, **The Crab Nebula at subarcsecond resolution with the International LOFAR Telescope**, M. Arias et.al., [2506.19460v1](http://arxiv.org/abs/2506.19460v1)\n\n We present International LOw Frequency ARray (LOFAR) Telescope (ILT) observations of the Crab Nebula, the remnant of a core-collapse supernova explosion observed by astronomers in 1054. The field of the Crab Nebula was observed between 120 and 168 MHz as part of the LOFAR Two Meter Sky Survey (LoTSS), and the data were re-processed to include the LOFAR international stations to create a high angular resolution ($0.43'' \\times 0.28''$) map at a central frequency of 145 MHz. Combining the ILT map with archival centimeter-range observations of the Nebula with the Very Large Array (VLA) and LOFAR data at 54 MHz, we become sensitive to the effects of free-free absorption against the synchrotron emission of the pulsar wind nebula. This absorption is caused by the ionised filaments visible in optical and infrared data of the Crab Nebula, which are the result of the pulsar wind nebula expanding into the denser stellar ejecta that surrounds it and forming Rayleigh-Taylor fingers. The LOFAR observations are sensitive to two components of these filaments: their dense cores, which show electron densities of $\\gtrsim1,000$ cm$^{-3}$, and the diffuse envelopes, with electron densities of $\\sim50-250$ cm$^{-3}$. The denser structures have widths of $\\sim0.03$ pc, whereas the diffuse component is at one point as large as $0.2$ pc. The morphology of the two components is not always the same. These finding suggests that the layered temperature, density, and ionisation structure of the Crab optical filaments extends to larger scales than previously considered.\n\n", "2506.19440": "2025-06-24, **Elemental Abundances in X-ray Binary Outflows**, Noa Keshet et.al., [2506.19440v1](http://arxiv.org/abs/2506.19440v1)\n\n Line resolved X-ray spectra of outflows from X-ray binaries are interesting since they provide quantifiable measures of the accreted material on to the compact object (black hole or neutron star), which can not be observed directly in the accretion disk. One such measurement that has been largely overlooked is that of the elemental abundances, which potentially provide insights into the origin of the ejected material. Using the Chandra/HETG grating spectrometer we measure and present elemental abundances in four low-mass X-ray binaries. We compare two measurement methods. One is by fitting line series of individual ions and reconstructing the absorption measure distribution (AMD), and the other is a global fit with one or two individual ionization components. All outflows feature a steep AMD strongly favoring high ionization degrees. The present abundances are consistent with previous works suggesting the abundances in the outflows are non-solar. We find a tentative trend of increasing abundances with atomic number, which fits some core-collapse supernova models, but no exact match to a specific one.\n\n", "2506.19163": "2025-06-23, **The DECam MAGIC Survey: Spectroscopic Follow-up of the Most Metal-Poor Stars in the Distant Milky Way Halo**, Vinicius M. Placco et.al., [2506.19163v1](http://arxiv.org/abs/2506.19163v1)\n\n In this work, we present high-resolution spectroscopic observations for six metal-poor stars with [Fe/H]<-3 (including one with [Fe/H]<-4), selected using narrow-band Ca II HK photometry from the DECam MAGIC Survey. The spectroscopic data confirms the accuracy of the photometric metallicities and allows for the determination of chemical abundances for 16 elements, from carbon to barium. The program stars have chemical abundances consistent with this metallicity range. A kinematic/dynamical analysis suggests that all program stars belong to the distant Milky Way halo population (heliocentric distances 35 < dhelio/kpc < 55), including three with high-energy orbits that might have been associated with the Magellanic system and one, J0026-5445, having parameters consistent with being a member of the Sagittarius stream. The remaining two stars show kinematics consistent with the Gaia-Sausage/Enceladus dwarf galaxy merger. J0433-5548, with [Fe/H]=-4.12, is a carbon-enhanced ultra metal-poor star, with [C/Fe]=+1.73. This star is believed to be a bona fide second-generation star, and its chemical abundance pattern was compared with yields from metal-free supernova models. Results suggest that J0433-5548 could have been formed from a gas cloud enriched by a single supernova explosion from a ~11Mo star in the early universe. The successful identification of such objects demonstrates the reliability of photometric metallicity estimates, which can be used for target selection and statistical studies of faint targets in the Milky Way and its satellite population. These discoveries illustrate the power of measuring chemical abundances of metal-poor Milky Way halo stars to learn more about early galaxy formation and evolution.\n\n", "2506.19099": "2025-06-23, **Time dilation observed in Type Ia supernova light curves and its cosmological consequences**, Vaclav Vavrycuk et.al., [2506.19099v1](http://arxiv.org/abs/2506.19099v1)\n\n The cosmic time dilation observed in Type Ia supernova light curves suggests that the passage of cosmic time varies throughout the evolution of the Universe. This observation implies that the rate of proper time is not constant, as assumed in the standard FLRW metric, but instead is time-dependent. Consequently, the commonly used FLRW metric should be replaced by a more general framework, known as the Conformal Cosmology (CC) metric, to properly account for cosmic time dilation. The CC metric incorporates both spatial expansion and time dilation during cosmic evolution. As a result, it is necessary to distinguish between comoving and proper (physical) time, similar to the distinction made between comoving and proper distances. In addition to successfully explaining cosmic time dilation, the CC metric offers several further advantages: (1) it preserves Lorentz invariance, (2) it maintains the form of Maxwell's equations as in Minkowski space-time, (3) it eliminates the need for dark matter and dark energy in the Friedmann equations, and (4) it successfully predicts the expansion and morphology of spiral galaxies in agreement with observations.\n\n", "2506.19071": "2025-06-23, **A Late-time Radio Survey of Type Ia-CSM Supernovae with the Very Large Array**, Olivia Griffith et.al., [2506.19071v1](http://arxiv.org/abs/2506.19071v1)\n\n Type Ia-CSM supernovae (SNe) are a rare and peculiar subclass of thermonuclear SNe characterized by emission lines of hydrogen or helium, indicative of a high-density circumstellar medium (CSM). Their implied mass-loss rates of $\\sim 10^{-4}-10^{-1}$ M$\\_{\\odot}$ yr$^{-1}$ (assuming $\\mathrm{ \\sim 100 \\ km\\ s^{-1}}$ winds) from optical observations are generally in excess of values observed in realistic SN Ia progenitors. In this paper, we present an independent study of CSM densities around a sample of 29 archival Ia-CSM SNe using radio observations with the Very Large Array at 6 GHz. Motivated by the late ($\\sim$2 yr) radio detection of the Ia-CSM SN 2020eyj, we observed old ($>$1 yr) SNe where we are more likely to see the emergent synchrotron emission that may have been suppressed earlier by free-free absorption by the CSM. We do not detect radio emission down to 3$\\sigma$ limits of $\\sim$35 $\\mu$Jy in our sample. The only radio-detected candidate in our sample, SN 2022esa, was likely mis-classified as a Ia-CSM with early spectra, and appears more consistent with a peculiar Ic based on later-epochs. Assuming a wind-like CSM with temperatures between $2 \\times 10^4$ K and $10^5$ K, and magnetic field-to-shock energy fraction ($\\epsilon\\_B$) = $0.01-0.1$, the radio upper limits rule out mass-loss rates between $\\sim 10^{-4}-10^{-2}$ M$\\_{\\odot}$ yr$^{-1}$ (100 km s$^{-1}$)$^{-1}$. This is somewhat in tension with the estimates from optical observations, and may indicate that more complex CSM geometries and/or lower values of $\\epsilon\\_B$ may be present.\n\n", "2506.19007": "2025-06-23, **James Webb Space Telescope Observations of the Nearby and Precisely-Localized FRB 20250316A: A Potential Near-IR Counterpart and Implications for the Progenitors of Fast Radio Bursts**, Peter K. Blanchard et.al., [2506.19007v1](http://arxiv.org/abs/2506.19007v1)\n\n We present deep James Webb Space Telescope near-infrared imaging to search for a quiescent or transient counterpart to FRB 20250316A, which was precisely localized with the CHIME/FRB Outriggers array to an area of $11\\times13$ pc in the outer regions of NGC 4141 at $d\\approx40$ Mpc. Our F150W2 image reveals a faint source near the center of the FRB localization region (\"NIR-1\"; $M\\_{\\rm F150W2}\\approx-2.5$ mag; probability of chance coincidence $\\approx0.36$), the only source within $\\approx2.7\\sigma$. We find that it is too faint to be a globular cluster, young star cluster, red supergiant star, or a giant star near the tip of the red giant branch (RGB). It is instead consistent with a red giant near the RGB \"clump\" or a massive ($\\gtrsim20$ M$\\_{\\odot}$) main sequence star, although the latter explanation is less likely. The source is too bright to be a supernova remnant, Crab-like pulsar wind nebula, or isolated magnetar. Alternatively, NIR-1 may represent transient emission, namely a dust echo from an energetic outburst associated with the FRB, in which case we would expect it to fade in future observations. We explore the stellar population near the FRB and find that it is composed of a mix of young massive stars ($\\sim10-100$ Myr) in a nearby HII region that extends to the location of FRB 20250316A, and old evolved stars ($\\gtrsim$ Gyr). The overlap with a young stellar population, containing stars of up to $\\approx20$ M$\\_\\odot$, may implicate a neutron star / magnetar produced in the core collapse of a massive star as the source of FRB 20250316A.\n\n", "2506.18681": "2025-06-23, **TeV spectral bump of cosmic-ray protons and helium nuclei: the role of nearby supernova remnants**, Sourav Bhadra et.al., [2506.18681v1](http://arxiv.org/abs/2506.18681v1)\n\n The existence of nearby discrete cosmic-ray sources can lead to many interesting effects on the observed properties of cosmic rays. Recent measurements of cosmic rays with the CALET and the DAMPE experiments have revealed a bump-like new feature in the proton and helium spectra in the energy range of ~ (1-100) TeV/nucleon. The origin of the feature is not clearly understood. In this paper, considering an improved and more detailed analysis than previous works, and using an updated age and distance estimates of nearby supernova remnants along with an energy-dependent escape process for cosmic rays from the remnants, we show that the spectral bump can be explained by the contribution of cosmic rays from the nearby supernova remnants, in particular, the Vela remnant. We also show that the contribution from the nearby remnants agrees well with the observed spectra of the heavier cosmic-ray elements from carbon to iron as well as with the measured all-particle cosmic-ray spectrum beyond the knee region when combined with a background flux of cosmic rays originating from distant supernova remnants.\n\n", "2506.18518": "2025-06-23, **The undetectable fraction of core-collapse supernovae in luminous infrared galaxies**, I. Mäntynen et.al., [2506.18518v1](http://arxiv.org/abs/2506.18518v1)\n\n A large fraction of core-collapse supernovae (CCSNe) in luminous infrared galaxies (LIRGs) remain undetected due to extremely high line-of-sight host galaxy dust extinction, and strong contrast between the SN and the galaxy background in the central regions of LIRGs, where the star formation is concentrated. This fraction of undetected CCSNe, unaccounted for by typical extinction corrections, is an important factor in determining CCSN rates, in particular at redshifts $z \\gtrsim 1$, where LIRGs dominate the cosmic star formation. Our aim is to derive a robust estimate for the undetected fraction of CCSNe in LIRGs in the local Universe. Our study is based on the K-band multi-epoch SUNBIRD survey data set of a sample of eight LIRGs using the Gemini-North Telescope with the ALTAIR/NIRI laser guide star adaptive optics system. We used simulated SNe and a standard image subtraction method to determine limiting detection magnitudes for the data set. Subsequently, we used a Monte Carlo method to combine the limiting magnitudes with the survey cadence, and an adopted distribution of CCSN subtypes and their light curve evolution to determine SN detection probabilities. Lastly, we combined these probabilities with the intrinsic CCSN rates of the sample galaxies estimated based on their detailed radiative transfer modeling to derive the fraction of undetectable CCSNe in local LIRGs. For high angular resolution near-infrared surveys, we find an undetectable fraction of $66.0^{+8.6}\\_{-14.6}$\\%, assuming that CCSNe with host extinctions up to $A\\_V$ = 16 mag are detectable, corresponding to the most obscured CCSN discovered in our data set. Alternatively, assuming a host extinction limit of $A\\_V$ = 3 mag, corresponding to typical optical surveys, we find an undetectable CCSN fraction of $89.7^{+2.6}\\_{-4.4}$\\%.\n\n", "2506.18422": "2025-06-23, **From Barthel Randers Kropina Geometries to the Accelerating Universe: A Brief Review of Recent Advances in Finslerian Cosmology**, Amine Bouali et.al., [2506.18422v1](http://arxiv.org/abs/2506.18422v1)\n\n We review recent developments in cosmological models based on Finsler geometry and extensions of general relativity within this framework. Finsler geometry generalizes Riemannian geometry by allowing the metric tensor to depend on position and an additional internal degree of freedom, typically represented by a vector field at each point of the spacetime manifold. We explore whether Finsler-type geometries can describe gravitational interaction and cosmological dynamics. In particular, we examine the Barthel connection and $(\\alpha, \\beta)$ geometries, where $\\alpha$ is a Riemannian metric and $\\beta$ is a one-form. For a specific construction of $\\beta$, the Barthel connection coincides with the Levi-Civita connection of the associated Riemann metric. We review gravitational field and cosmological evolution in three geometries: Barthel-Randers ($F = \\alpha + \\beta$), Barthel-Kropina ($F = \\alpha^2 \\beta$), and the conformally transformed Barthel-Kropina geometry. After presenting the mathematical foundations of Finslerian-type modified gravity theories, we derive generalized Friedmann equations in these geometries assuming a Friedmann-Lema\\^itre-Robertson-Walker type metric. We also present the matter-energy balance equations, interpreting them from the perspective of thermodynamics with particle creation. The cosmological properties of Barthel-Randers and Barthel-Kropina models are explored in detail. The additional geometric terms in these models can be interpreted as an effective dark energy component, generating an effective cosmological constant. Several cosmological solutions are compared with observational data (Cosmic Chronometers, Type Ia Supernovae, Baryon Acoustic Oscillations) using MCMC analysis. A comparison with the $\\Lambda$CDM model shows that Finslerian models fit observational data well, suggesting they offer a viable alternative to general relativity.\n\n"}}