{"neutrino": {"2309.11492": "2023-09-20, **Visible in the laboratory and invisible in cosmology: decaying sterile neutrinos**, Kevork N. Abazajian et.al., [2309.11492v1](http://arxiv.org/abs/2309.11492v1)\n\n The expansion history and thermal physical process that happened in the early Universe before big bang nucleosynthesis (BBN) remains relatively unconstrained by observations. Low reheating temperature universes with normalcy temperatures of $T\\_\\mathrm{RH}\\sim 2\\,\\mathrm{MeV}$ remain consistent with all observations, and accommodate several new physics scenarios that would normally be constrained by high-temperature reheating models, including massive sterile neutrinos. We explore such scenarios' production of keV scale sterile neutrinos and their resulting constraints from cosmological observations. The parameter space for massive sterile neutrinos is much less constrained than in high-$T\\_\\mathrm{RH}$ thermal histories, though several cosmological constraints remain. Such parameter space is the target of several current and upcoming laboratory experiments such as TRISTAN (KATRIN), HUNTER, MAGNETO-$\\nu$, and PTOLEMY. Cosmological constraints remain stringent for stable keV-scale sterile neutrinos. However, we show that sterile neutrinos with a dark decay to radiation through a $Z^\\prime$ or a new scalar are largely unconstrained by cosmology. In addition, this mechanism of sterile neutrinos with large mixing may provide a solution to the Hubble tension. We find that keV-scale sterile neutrinos are therefore one of the best probes of the untested pre-BBN era in the early Universe and could be seen in upcoming laboratory experiments.\n\n", "2309.11254": "2023-09-20, **Searching for dark neutrinos through exotic Higgs decays at the ILC**, Simon Thor et.al., [2309.11254v1](http://arxiv.org/abs/2309.11254v1)\n\n In this study we investigate the feasibility of detecting heavy dark neutrinos ($N\\_d$) through exotic Higgs decays at the proposed International Linear Collider (ILC), specifically in the channel of $e^+ e^- \\to qq~ H$ with $H\\to \\nu N\\_d \\to \\nu~lW \\to \\nu l~qq$. Analyses based on full detector simulations of the ILD are performed at the center-of-mass energy of 250 GeV for two different beam polarization schemes with a total integrated luminosity of 2 $\\mathrm{ab}^{-1}$. A range of dark neutrino masses between the $Z$ boson and Higgs boson masses are studied. The $2\\sigma$ significance reach for the joint branching ratio of $BR(H\\to\\nu N\\_d)\\cdot BR(N\\_d\\to lW)$ is about 0.1%, nearly independent of the dark neutrino masses, while the $5\\sigma$ discovery is possible at a branching ratio of $0.3\\%$. Interpreting these results in terms of constraints on the mixing parameters $\\|\\varepsilon\\_{id}\\|^2$ between SM neutrinos and the dark neutrino, it is expected to have a factor of 10 improvement from current constraints.\n\n", "2309.11105": "2023-09-20, **Interplay of type-I and type-II seesaw in neutrinoless double beta decay in left-right symmetric model**, Vivek Banerjee et.al., [2309.11105v1](http://arxiv.org/abs/2309.11105v1)\n\n The left-right symmetric models (LRSM) generally include type-I and type-II induced seesaw mass as a hybrid mass for the light-active neutrinos. Assuming a particular form of Dirac-type coupling, the Majorana-type coupling present in the seesaw mass formula can be expressed in terms of low-energy neutrino oscillation observables and vacuum expectation values (vevs) of the scalar fields present in the model. The Majorana-type coupling thus admits eight different solutions by considering the interplay of type-I and type-II terms dominate the light neutrino mass. We study the role of all eight solutions in the lepton number violating neutrinoless double beta decay ($0\\nu\\beta\\beta$) process. In LRSM, the right-handed neutrinos, triplet scalars, and gauge bosons of the left and right sectors act as mediators of new contributions to the $0\\nu\\beta\\beta$ process. As a result, the effective mass of electron neutrino appearing in the decay width would be a function of $v\\_R$ (vev of the Higgs triplet of the right sector) along with other parameters of the model, through the masses of the new contributions. The energy scale, $v\\_R$ can be considered as the new physics scale which allows exploring physics beyond the Standard Model. Considering the present and future sensitivity of searches of $0\\nu\\beta\\beta$, we study the role of eight different solutions of the Majorana coupling matrix. In our study, the inverted hierarchy of light neutrino masses is disfavored for all solutions keeping future sensitivity of effective mass in the picture, if the lightest mass of active neutrinos is below $0.001$ eV. Also, our study shows a possibility of new physics contributions saturating the experimental bound on effective mass for $v\\_R$ in the range of $10$ TeV for two particular solutions of the Majorana coupling matrix.\n\n", "2309.10857": "2023-09-19, **Inflation and Higgs Phenomenology in a Model Unifying the DFSZ Axion with the Majoron**, Juhi Dutta et.al., [2309.10857v1](http://arxiv.org/abs/2309.10857v1)\n\n The Two-Higgs-Doublet-Standard Model-Axion-Seesaw-Higgs-Portal inflation (2hdSMASH) model consisting of two Higgs doublets, a Standard Model (SM) singlet complex scalar and three SM singlet right-handed neutrinos can embed axion dark matter, neutrino masses and address inflation. We report on an investigation of the inflationary aspects of 2hdSMASH and its subsequent impact on low energy phenomenology. In particular, we identify inflationary directions for which the parameter values required for successful inflation do not violate perturbative unitarity and boundedness-from-below conditions. By analyzing the renormalization-group flow of the parameters we identify the necessary and sufficient constraints for running all parameters perturbatively and maintaining stability from the electroweak to the PLANCK scale. We determine typical benchmark points satisfying theoretical and experimental constraints which can be potentially probed by future colliders.\n\n", "2309.10493": "2023-09-19, **Neutrino Imaging of the Galactic Centre and Millisecond Pulsar Population**, Paul C. W. Lai et.al., [2309.10493v1](http://arxiv.org/abs/2309.10493v1)\n\n In this work, we consider the possible presence of a large population of millisecond pulsars in the Galactic Centre. Their direct detection would be challenging due to severe pulse broadening caused by scattering of radiation. We propose a new method to constrain their population with neutrino imaging of the Galactic Centre. Millisecond pulsars are proposed cosmic-ray accelerators. The high-energy protons they produce will collide with the baryonic matter in the central molecular zone to create charged and neutral pions that decay into neutrinos and $\\gamma$-rays, respectively. The specific neutrino and $\\gamma$-ray fluxes must be below their corresponding observed values, allowing us to put a conservative upper limit on the millisecond pulsar population of N\\_MSP < 10,000 within a galacto-centric radius of 20 pc. This upper limit is sensitive to the proton acceleration efficiency of the pulsars, but is less dependent on the particle injection spectral index and the choice of mass tracers. The population will be better constrained when high resolution neutrino observations of the Galactic Centre become available. The presence of these millisecond pulsars can account for the $\\gamma$-ray excess in the Galactic Centre.\n\n", "2309.10417": "2023-09-19, **Investigating the fluxes and physics potential of LHC neutrino experiments**, Felix Kling et.al., [2309.10417v1](http://arxiv.org/abs/2309.10417v1)\n\n The initiation of a novel neutrino physics program at the Large Hadron Collider (LHC) and the purpose-built Forward Physics Facility (FPF) proposal have motivated studies exploring the discovery potential of these searches. This requires resolving degeneracies between new predictions and uncertainties in modeling neutrino production in the forward kinematic region. The present work investigates a broad selection of existing predictions for the parent hadron spectra at FASER$\\nu$ and the FPF to parameterize expected correlations in the neutrino spectra produced in their decays and to determine the highest achievable precision for their observation based on Fisher information. This allows for setting constraints on various physics processes within and beyond the Standard Model, including neutrino non-standard interactions. We also illustrate how combining multiple neutrino observables could lead to experimental confirmation of the enhanced-strangeness scenario proposed to resolve the cosmic-ray muon puzzle already during the ongoing LHC Run 3.\n\n"}, "dark matter": {"2309.11496": "2023-09-20, **Unveiling dark forces with the Large Scale Structure of the Universe**, Salvatore Bottaro et.al., [2309.11496v1](http://arxiv.org/abs/2309.11496v1)\n\n Cosmology offers opportunities to test Dark Matter independently of its interactions with the Standard Model. We study the imprints of long-range forces acting solely in the dark sector on the distribution of galaxies, the so-called Large Scale Structure (LSS). We derive the strongest constraint on such forces from a combination of Planck and BOSS data. Along the way we consistently develop, for the first time, the Effective Field Theory of LSS in the presence of new dynamics in the dark sector. We forecast that future surveys will improve the current bound by an order of magnitude.\n\n", "2309.11374": "2023-09-20, **Cooperative Spin Amplification**, Minxiang Xu et.al., [2309.11374v1](http://arxiv.org/abs/2309.11374v1)\n\n Quantum amplification is recognized as a key resource for precision measurements. However, most conventional paradigms employ an ensemble of independent particles that usually limit the performance of quantum amplification in gain, spectral linewidth, etc. Here we demonstrate a new signal amplification using cooperative 129Xe nuclear spins embedded within a feedback circuit, where the noble-gas spin coherence time is enhanced by at least one order of magnitude. Using such a technique, magnetic field can be substantially pre-enhanced by more than three orders and is in situ readout with an embedded 87Rb magnetometer. We realize an ultrahigh magnetic sensitivity of 4.0 fT/Hz$^{1/2}$ that surpasses the photon-shot noise and even below the spin-projection noise of the embedded atomic magnetometer, allowing for exciting applications including searches for dark matter with sensitivity well beyond supernova constraints. Our findings extend the physics of quantum amplification to cooperative spin systems and can be generalized to a wide variety of existing sensors, enabling a new class of cooperative quantum sensors.\n\n", "2309.11241": "2023-09-20, **Boosting dark matter searches at muon colliders with Machine Learning: the mono-Higgs channel as a case study**, Mohamed Belfkir et.al., [2309.11241v1](http://arxiv.org/abs/2309.11241v1)\n\n The search for dark-matter (DM) candidates at high-energy colliders is one of the most promising avenues to understand the nature of this elusive component of the universe. Several searches at the Large Hadron Collider (LHC) have strongly constrained a wide range of simplified models. The combination of the bounds from the LHC with direct-detection experiments exclude the most minimal scalar singlet DM model. To address this, Lepton portal DM models are suitable candidates where DM is predominantly produced at lepton colliders since the DM candidate only interacts with the lepton sector through a mediator that carries a lepton number. In this work, we analyse the production of DM pairs in association with a Higgs boson decaying into two bottom quarks at future muon colliders in the framework of the minimal lepton portal DM model. It is found that the usual cut-based analysis methods fail to probe heavy DM masses for both the resolved (where the decay products of the Higgs boson can be resolved as two well-separated small-$R$ jets) and the merged (where the Higgs boson is clustered as one large-$R$ jet). We have then built a search strategy based on Boosted-Decision Trees (BDTs). We have optimised the hyperparameters of the BDT model to both have a high signal-to-background ratio and to avoid overtraining effects. We have found very important enhancements of the signal significance with respect to the cut-based analysis by factors of $8$--$50$ depending on the regime (resolved or merged) and the benchmark points. Using this BDT model on a one-dimensional parameter space scan we found that future muon colliders with $\\sqrt{s}=3$ TeV and ${\\cal L} = 1~{\\rm ab}^{-1}$ can exclude DM masses up to $1$ TeV at the $95\\%$ CL.\n\n", "2309.11129": "2023-09-20, **X-ray - cosmic shear cross-correlations: first detection and constraints on baryonic effects**, Tassia Ferreira et.al., [2309.11129v1](http://arxiv.org/abs/2309.11129v1)\n\n We report a first detection, at very high significance ($25\\sigma$), of the cross-correlation between cosmic shear and the diffuse X-ray background, using data from the Dark Energy Survey and the ROSAT satellite. The X-ray cross-correlation signal is sensitive to the distribution of the surrounding gas in dark matter haloes. This allows us to use our measurements to place constraints on key physical parameters that determine the impact of baryonic effects in the matter power spectrum. In particular, we determine the mass of haloes in which feedback has expelled half of their gas content on average to be $\\log\\_{10}(M\\_c/M\\_\\odot)=13.643^{+0.081}\\_{-0.12}$, and the polytropic index of the gas to be $\\Gamma = 1.231^{+0.015}\\_{-0.011}$. This represents a first step in the direct use of X-ray cross-correlations to obtain improved constraints on cosmology and the physics of the intergalactic gas.\n\n", "2309.11003": "2023-09-20, **Cosmic-ray dark matter confronted by constraints on new light mediators**, Nicole F. Bell et.al., [2309.11003v1](http://arxiv.org/abs/2309.11003v1)\n\n The detectability of light dark matter in direct detection experiments is limited by the small kinetic energy of the recoiling targets. Thus, scenarios where dark matter is boosted to relativistic velocities provide a useful tactic to constrain sub-GeV dark matter particles. Of the possible dark matter boosting mechanisms, cosmic-ray upscattering is an appealing paradigm as it doesn't require any additional assumptions beyond dark matter coupling to nucleons or electrons. However, detectable signals are obtained only with relatively large cross sections which, in turn, can only be realized with large couplings, light mediators or composite dark matter. In this work we consider a general set of light mediators that couple dark matter to hadrons. Using data from Borexino, XENON1T, LZ and Super-K, we show that existing constraints on such mediators preclude appreciable cosmic-ray dark matter upscattering. This finding highlights the limited applicability of cosmic-ray upscattering constraints and suggests they only be used in model-dependent studies.\n\n", "2309.10843": "2023-09-19, **Milky Way White Dwarfs as Sub-GeV to Multi-TeV Dark Matter Detectors**, Javier F. Acevedo et.al., [2309.10843v1](http://arxiv.org/abs/2309.10843v1)\n\n We show that Milky Way white dwarfs are excellent targets for dark matter (DM) detection. Using Fermi and H.E.S.S. Galactic center gamma-ray data, we investigate sensitivity to DM annihilating within white dwarfs into long-lived or boosted mediators and producing detectable gamma rays. Depending on the Galactic DM distribution, we set new constraints on the spin-independent scattering cross section down to $10^{-45}-10^{-41}$ cm$^2$ in the sub-GeV DM mass range, which is multiple orders of magnitude stronger than existing limits. For a generalized NFW DM profile, we find that our white dwarf constraints exceed spin-independent direct detection limits across most of the sub-GeV to multi-TeV DM mass range, achieving sensitivities as low as about $10^{-46}$ cm$^2$. In addition, we improve earlier versions of the DM capture calculation in white dwarfs, by including the low-temperature distribution of nuclei when the white dwarf approaches crystallization. This yields smaller capture rates than previously calculated by a factor of a few up to two orders of magnitude, depending on white dwarf size and the astrophysical system.\n\n", "2309.10839": "2023-09-19, **Anharmonic effects in nuclear recoils from sub-GeV dark matter**, Tongyan Lin et.al., [2309.10839v1](http://arxiv.org/abs/2309.10839v1)\n\n Direct detection experiments are looking for nuclear recoils from scattering of sub-GeV dark matter (DM) in crystals, and have thresholds as low as ~ 10 eV or DM masses of ~ 100 MeV. Future experiments are aiming for even lower thresholds. At such low energies, the free nuclear recoil prescription breaks down, and the relevant final states are phonons in the crystal. Scattering rates into single as well as multiple phonons have already been computed for a harmonic crystal. However, crystals typically exhibit some anharmonicity, which can significantly impact scattering rates in certain kinematic regimes. In this work, we estimate the impact of anharmonic effects on scattering rates for DM in the mass range ~ 1-10 MeV, where the details of multiphonon production are most important. Using a simple model of a nucleus in a bound potential, we find that anharmonicity can modify the scattering rates by up to two orders of magnitude for DM masses of O(MeV). However, such effects are primarily present at high energies where the rates are suppressed, and thus only relevant for very large DM cross sections. We show that anharmonic effects are negligible for masses larger than ~ 10 MeV.\n\n", "2309.10779": "2023-09-19, **Atmospheric Temperature anomalies as manifestation of the dark Universe**, K. Zioutas et.al., [2309.10779v1](http://arxiv.org/abs/2309.10779v1)\n\n We are investigating the possible origin of small-scale anomalies, like the annual stratospheric temperature anomalies. Unexpectedly within known physics, their observed planetary \"dependency\", does not match concurrent solar activity, whose impact on the atmosphere is unequivocal; this points at an additional energy source of exo-solar origin. A viable concept behind such observations is based on possible gravitational focusing by the Sun and its planets towards the Earth of low-speed invisible streaming matter; its influx towards the Earth gets temporally enhanced. Only a somehow \"strongly\" interacting invisible streaming matter with the small upper atmospheric screening can be behind the observed temperature excursions. Ordinary dark matter (DM) candidates like axions or WIMPs, cannot have any noticeable impact. The associated energy deposition is $\\mathcal{O}(\\sim 1000\\, \\mathrm{GeV}/{{\\mathrm{cm}}^2}/\\mathrm{sec})$. The atmosphere has been uninterruptedly monitored for decades. Therefore, the upper atmosphere can serve as a novel (low-threshold) detector for the dark Universe, with built-in spatiotemporal resolution while the solar system gravity acts temporally as a signal amplifier. Interestingly, the anomalous ionosphere shows a relationship with the inner earth activity like earthquakes. Similarly investigating the transient sudden stratospheric warmings within the same reasoning, the nature of the assumed \"invisible streams\" could be deciphered.\n\n", "2309.10754": "2023-09-19, **Impact of a nearby subhalo on the constraint of dark matter annihilation from cosmic ray antiprotons**, Yi Zhao et.al., [2309.10754v1](http://arxiv.org/abs/2309.10754v1)\n\n Numerous simulations indicate that a large number of subhalos should be hosted by the Milky Way. The potential existence of a nearby subhalo could have important implications for our understanding of dark matter (DM) annihilation. In this study, we investigate the hypothetical presence of a nearby subhalo and set the upper limits on the DM annihilation cross section by analyzing the cosmic-ray antiproton spectrum. By presenting the ratios of annihilation cross section limits for scenarios with and without a nearby subhalo, we can quantitatively evaluate the potential impact of the nearby subhalo on the limits of the DM annihilation cross section. The impacts of the concentration model and the subhalo probability distribution have been considered. We explore the antiproton contribution of the potential nearby DM subhalo accounting for the DAMPE $e^\\pm$ spectrum at $\\sim 1.4$ TeV and find that the current AMS-02 antiproton results do not place the constraint on this contribution.\n\n", "2309.10700": "2023-09-19, **Opening the Higgs Portal to Lepton-Flavoured Dark Matter**, Harun Acaroğlu et.al., [2309.10700v1](http://arxiv.org/abs/2309.10700v1)\n\n We study a simplified model of lepton-flavoured complex scalar dark matter coupling to right-handed leptons and the Higgs boson. The model is set up in the Dark Minimal Flavour Violation framework. In contrast to previous studies of similar models we consider the most general case and do not a priori constrain the hierarchy of dark matter masses and couplings in any way. In the first part of the analysis we discuss the impact of Higgs portal interactions and the generalised mass hierarchy on the model's phenomenology. We find that they render new physics masses around the electroweak scale viable, thus qualifying this model to address the $(g-2)\\_\\mu$ puzzle. After reviewing the current situation of the latter, we perform two combined analyses -- one in which $(g-2)\\_\\mu$ allows for significant new physics effects and one in which it does not. We find that while the latter scenario allows for a larger range of new physics scales, both scenarios are equally viable.\n\n", "2309.10458": "2023-09-19, **Origin and characterization of single-electron events in Skipper-CCDs for light dark matter searches**, Mariano Cababie et.al., [2309.10458v1](http://arxiv.org/abs/2309.10458v1)\n\n This manuscript summarizes the work carried out within the SENSEI (Sub-Electron-Noise Skipper-CCD Experimental Instrument) collaboration, an effort focused on the search for light dark matter using Skipper-CCDs. Firstly, it presents the data acquisition and processing protocol developed to establish a selection criteria for events compatible with the dark matter signal. This protocol also enabled the structure and tools used for the study and characterization of phenomena that impact the quality of measurements made in the search for dark matter (measurement of the Fano factor, determination of the Compton background, and characterization of the high-energy surface background), which were carried out during this work. Secondly, it discusses the comprehensive study conducted on the origin of single-electron events in Skipper-CCDs, which allowed for the selection of detector operating parameters and improved the detection sensitivity in the search for dark matter. It is highlighted the characterization of the spatial correlation between single-electron events and high-energy events, among other developed event selection criteria, and the optimization of the output device to reduce sources of luminescence during its operation. As a result of this study, the lowest levels of dark current and spurious charge ever measured in a CCD are reported. Finally, the latest published results from SENSEI are presented. The obtained limits for the scattering of a light mediator are the best reported to date across the entire investigated mass range, while for the heavy mediator, they are the best for masses below 10 MeV. In terms of dark matter absorption, the most restringent limits below 10 eV are reported. These results, achieved with only a very small fraction of the total projected exposure for SENSEI, position Skipper-CCDs as leaders in the search for light dark matter worldwide.\n\n", "2309.10374": "2023-09-19, **An N-body/hydrodynamical simulation study of the merging cluster El Gordo: a compelling case for SIDM ?**, R. Valdarnini et.al., [2309.10374v1](http://arxiv.org/abs/2309.10374v1)\n\n We use a large set N-body/hydrodynamical simulations to study the physical properties of the merging cluster El Gordo. We found that the observed X-ray structures, along with other data, can be fairly matched by simulations with collision velocities 2,000 kms <= V <= 2,500 kms and impact parameters 600 kpc <= P <= 800 kpc. The mass of the primary is constrained to be between 10^{15} M\\_sun and ~ 1.6 10^{15} M\\_sun, in accord with recent lensing-based mass measurements. Moreover, a returning, post-apocenter, scenario is not supported by our head-on simulations. We also consider merger models that incorporate dark matter self-interactions. The simulation results show that the observed spatial offsets between the different mass components are well reproduced in self-interacting dark matter models with an elastic cross-section in the range \\sigma\\_DM/m\\_X ~ 4 -5 cm^2/gr. In addition, the mean relative line-of-sight radial velocity between the two brightest cluster galaxies is found to be of the order of several hundreds of km/s. We argue that these findings provide an unambiguous signature of a dark matter behavior that exhibits collisional properties in a very energetic high-redshift cluster collision. The range of allowed values we found for sigma\\_DM/m\\_X is however inconsistent with present upper limits. To resolve this tension we suggest the possibility that the self-interacting dark matter model used here should be considered as only a low order approximation, and that the underlying physical processes that describe the interaction of dark matter in major cluster mergers are more complex than can be adequately represented by the commonly assumed approach based on scattering of dark matter particles.\n\n", "2309.10364": "2023-09-19, **Is it possible to separate baryonic from dark matter within the $Λ$-CDM formalism?**, A. Borowiec et.al., [2309.10364v1](http://arxiv.org/abs/2309.10364v1)\n\n We found general solutions of matter stress-energy (non-)conservation in scalar-tensor FLRW-type cosmological models by extending the logotropic formalism to the case of non-minimal coupling between the scalar field and new dark fluid candidates. The energy conditions expressed by the generating function are introduced. Next, we investigate the possibility of separating baryonic from dark matter and explain their ratio as a chameleon effect in the presence of non-minimal coupling. To answer the question affirmatively we analyze simple extensions of $\\Lambda$-CDM model by adding a non-minimally coupled scalar field in the Einstein frame. Two scenarios involving either a scalaron (quintessence) or a phantom (ghost) are numerically solved and compared. As a result, it is shown that in both cases LCDM can be reproduced with a high accuracy in the region covered by observations. As expected, in the case of the ghost field Big-Bang scenario is replaced by Big-Bounce.\n\n", "2309.10270": "2023-09-19, **Hybrid SBI or How I Learned to Stop Worrying and Learn the Likelihood**, Chirag Modi et.al., [2309.10270v1](http://arxiv.org/abs/2309.10270v1)\n\n We propose a new framework for the analysis of current and future cosmological surveys, which combines perturbative methods (PT) on large scales with conditional simulation-based implicit inference (SBI) on small scales. This enables modeling of a wide range of statistics across all scales using only small-volume simulations, drastically reducing computational costs, and avoids the assumption of an explicit small-scale likelihood. As a proof-of-principle for this hybrid simulation-based inference (HySBI) approach, we apply it to dark matter density fields and constrain cosmological parameters using both the power spectrum and wavelet coefficients, finding promising results that significantly outperform classical PT methods. We additionally lay out a roadmap for the next steps necessary to implement HySBI on actual survey data, including consideration of bias, systematics, and customized simulations. Our approach provides a realistic way to scale SBI to future survey volumes, avoiding prohibitive computational costs.\n\n"}, "supernova": {"2309.11374": "2023-09-20, **Cooperative Spin Amplification**, Minxiang Xu et.al., [2309.11374v1](http://arxiv.org/abs/2309.11374v1)\n\n Quantum amplification is recognized as a key resource for precision measurements. However, most conventional paradigms employ an ensemble of independent particles that usually limit the performance of quantum amplification in gain, spectral linewidth, etc. Here we demonstrate a new signal amplification using cooperative 129Xe nuclear spins embedded within a feedback circuit, where the noble-gas spin coherence time is enhanced by at least one order of magnitude. Using such a technique, magnetic field can be substantially pre-enhanced by more than three orders and is in situ readout with an embedded 87Rb magnetometer. We realize an ultrahigh magnetic sensitivity of 4.0 fT/Hz$^{1/2}$ that surpasses the photon-shot noise and even below the spin-projection noise of the embedded atomic magnetometer, allowing for exciting applications including searches for dark matter with sensitivity well beyond supernova constraints. Our findings extend the physics of quantum amplification to cooperative spin systems and can be generalized to a wide variety of existing sensors, enabling a new class of cooperative quantum sensors.\n\n", "2309.11334": "2023-09-20, **Constraining the spatial curvature of the local Universe with deep learning**, Liang Liu et.al., [2309.11334v1](http://arxiv.org/abs/2309.11334v1)\n\n We use the distance sum rule (DSR) method to constrain the spatial curvature of the Universe with a large sample of 161 strong gravitational lensing (SGL) systems, whose distances are calibrated from the Pantheon compilation of type Ia supernovae (SNe Ia) using deep learning. To investigate the possible influence of mass model of the lens galaxy on constraining the curvature parameter $\\Omega\\_k$, we consider three different lens models. Results show that a flat Universe is supported in the singular isothermal sphere (SIS) model with the parameter $\\Omega\\_k=0.049^{+0.147}\\_{-0.125}$. While in the power-law (PL) model, a closed Universe is preferred at $\\sim 3\\sigma$ confidence level, with the parameter $\\Omega\\_k=-0.245^{+0.075}\\_{-0.071}$. In extended power-law (EPL) model, the 95$\\%$ confidence level upper limit of $\\Omega\\_k$ is $<0.011$. As for the parameters of the lens models, constrains on the three models indicate that the mass profile of the lens galaxy could not be simply described by the standard SIS model.\n\n", "2309.11320": "2023-09-20, **The Pantheon+ supernovae are consistent with a large-scale isotropic universe**, Li Tang et.al., [2309.11320v1](http://arxiv.org/abs/2309.11320v1)\n\n We investigate the possible anisotropy of the universe using the most up-to-date type Ia supernovae, i.e. the Pantheon+ compilation. We fit the full Pantheon+ data with the dipole-modulated $\\Lambda$CDM model, and find that it is well consistent with a null dipole. We further divide the full sample into several subsamples with different high-redshift cutoff   $z\\_c$. It is shown that the dipole appears at $2\\sigma$ confidence level only if $z\\_c\\leq 0.1$, and in this redshift region the dipole is very stable, almost independent of the specific value of $z\\_c$. For $z\\_c=0.1$, the dipole amplitude is $D=1.0\\_{-0.4}^{+0.4}\\times 10^{-3}$, pointing towards $(l,b)=(334.5\\_{\\ -21.6^{\\circ}}^{\\circ +25.7^{\\circ}},16.0\\_{\\ -16.8^{\\circ}}^{\\circ +27.1^{\\circ}})$, which is about $65^{\\circ}$ away from the CMB dipole. This implies that the full Pantheon+ is consistent with a large-scale isotropic universe, but the low-redshift anisotropy couldn't be purely explained by the peculiar motion of the local universe.\n\n", "2309.11308": "2023-09-20, **Transient events in the near-nuclear regions of AGNs and quasars as the sources of the proper motion imitations**, I. M. Khamitov et.al., [2309.11308v1](http://arxiv.org/abs/2309.11308v1)\n\n We present a sample of SRG/eROSITA X-ray sources located in the eastern Galactic hemisphere (0<l<180 deg), with significant proper motions according to GAIA eDR3 measurements and whose extragalactic nature has been confirmed. The catalog consists of 248 extragalactic sources with spectroscopically measured redshifts. It includes all objects available in the Simbad database and matched to the identified optical component within a radius of 0.5 arcsec. Additionally, the catalog includes 18 sources with the spectral redshift measurements based on observations at the Russian-Turkish 1.5-m telescope RTT-150. The sources of the catalog are AGNs of various types (Sy1, Sy2, LINER), quasars, radio galaxies, and star-forming galaxies. The imitation of significant proper motions can be explained (previously known in astrometry as the VIM effect) by the presence of transient events on the line of sight in the field of view of AGN nuclei and quasars (within the GAIA resolution element). Such astrophysical phenomena may be the supernovae outbursts, tidal destruction events in AGNs with double nuclei, variability of large-mass supergiants, the presence of O-B associations in field of view of variable brightness AGN, etc. A model of flares with a fast rise and exponential decay profile allows to describe the variable positional parameters of most similar sources observed in GAIA. This cross-matching approach of the X-ray source catalogs of the SRG/eROSITA observatory and the optical catalog of the GAIA observatory can be used as an independent technique for detecting transient events in the neighborhood of AGN core (on scales of several hundred parsecs in the picture plane).\n\n", "2309.11162": "2023-09-20, **Exploration of Nuclear Matter Properties and Related Thermodynamical Aspects**, Vishal Parmar et.al., [2309.11162v1](http://arxiv.org/abs/2309.11162v1)\n\n In this study, my main goal is to examine the nuclear matter properties across a wide range of conditions, such as temperature, density, asymmetry, pressure, and magnetic field. Understanding the effect of these factors on nuclear matter is essential, given their relevance in various phenomena such as heavy-ion collisions, neutron stars, and supernovae. However, due to the absence of a fundamental nuclear theory, we must rely on models to describe the nuclear matter. Predicted properties like neutron star mass-radius relationships, tidal deformability, structure, critical points in the nuclear matter phase diagram etc. depend on the chosen model. This dependence arises because key parameters characterizing any nuclear model or equation of state (EoS) are not precisely known. Therefore, it is crucial to investigate how nuclear matter properties behave under various conditions and in relation to different EoS parameters. To accomplish this, I have examined three distinct forms of nuclear matter: infinite nuclear matter, finite nuclei, and neutron stars, using the effective relativistic mean field model (E-RMF).\n\n", "2309.10538": "2023-09-19, **Constraints on the speed of sound in the k-essence model of dark energy**, Bikash R. Dinda et.al., [2309.10538v1](http://arxiv.org/abs/2309.10538v1)\n\n We consider a particular k-essence scalar field model for the late-time cosmic acceleration in which the sound speed, parametrized as $c\\_s$ is constant. We compute the relevant background and perturbation quantities corresponding to the observables like cosmic microwave background, type Ia supernova, cosmic chronometers, baryon acoustic oscillations, and the $f\\sigma\\_8$. We put constraints on the $c\\_s^2$ parameter from these observations along with other parameters. We find lower values of $c\\_s^2$ which are close to zero are tightly constrained. Particularly, we find mean value of $\\log\\_{\\rm 10} (c\\_s^2)$ to be $-0.61$ and $c\\_s^2 \\leq 10^{-3}$ is more than 3$\\sigma$ away from this mean value. This means these observations favor a homogeneous dark energy component compared to the clustering one.\n\n"}}