{"neutrino": {"2510.20821": "2025-10-23, **Efficient analytic approximation for small-scale non-cold relic perturbations**, Nanoom Lee et.al., [2510.20821v1](http://arxiv.org/abs/2510.20821v1)\n\n We develop a highly accurate analytic approximation for small-scale non-cold relic perturbations by solving the collisionless Boltzmann equation in the quasi-stationary regime. The approximation is implemented in CLASSIER (CLASS Integral Equation Revision), a modified version of the Boltzmann solver CLASS that replaces the traditional truncated Boltzmann hierarchy of non cold relic multipoles with a small set of integral equations solved iteratively. Applying it to massive neutrinos yields a factor-of-two reduction in total runtime relative to CLASSIER without the approximation. Compared to standard CLASS runs (with $\\ell\\_{\\rm max}^{\\rm NCDM}=40$ and no late-time massive neutrino fluid approximation) under the same precision setting, CLASSIER with this approximation is faster by a factor of 3-6. The approximation faithfully reproduces the late-time behavior of massive neutrino perturbations and preserves sub-$0.1\\%$ accuracy in the matter power spectrum today up to comoving wavenumber $k=100\\,{\\rm Mpc}^{-1}$. With this approximation, massive-neutrino perturbations are no longer the computational bottleneck on small scales for linear-theory predictions. The approach can be readily extendable to non-standard dark-matter models, and offers prospects for further efficiency gains in high-precision cosmological analyses.\n\n", "2510.20687": "2025-10-23, **Search for neutrino emission from LHAASO observed Microquasar with IceCube 10-year data**, Rong-Lan Li et.al., [2510.20687v1](http://arxiv.org/abs/2510.20687v1)\n\n The Large High Altitude Air Shower Observatory (LHAASO) has detected ultra-high-energy (UHE; E>100 TeV) gamma-ray emission from five microquasars, suggesting their potential as Galactic PeV cosmic-ray accelerators. At these energies, the Klein-Nishima effect strongly suppresses leptonic processes, making neutrinos observation a crucial test for hadronic acceleration. We present a search for neutrino emission from these LHAASO-identified Microquasars using ten years of IceCube muon-track data. No significant neutrino signal was found in either single-source or stacking analyses. Our stacking result further shows that the studied microquasars population can only account for a small fraction of the diffuse neutrino flux along the Galactic Plane. Finally, we demonstrate that new-generation neutrino telescopes, such as HUN, will have the sensitivity to probe harmonic emission from these candidate PeVatrons.\n\n", "2510.20672": "2025-10-23, **An Axial-Vector Leptophilic Fifth Force Sourced by Solar Neutrinos**, Rundong Fang et.al., [2510.20672v1](http://arxiv.org/abs/2510.20672v1)\n\n We investigate long-range, purely leptophilic axial-vector interactions mediated by a light gauge boson $A'$ that couples to charged leptons and, by weak symmetry, to left-handed neutrinos. We analyze two realizations, a minimal effective model with muon-only couplings and an anomaly-free axial $U(1)'$ with inter-generation cancellations. In both cases, the solar neutrino flux acts as an extended current that sources a macroscopic $A'$ field at Earth, with spatial components aligned along the Sun-Earth direction. This field produces a distinctive signature in storage-ring measurements of the muon anomalous magnetic moment, $(g-2)\\_\\mu$, namely a diurnal, sign-changing contribution that is positive during daytime and negative at night, superimposed on a time-independent positive offset. We obtain bounds $g' \\lesssim {O}(10^{-19})$ in both model frameworks for a light, effectively massless mediator. For completeness, we map the solar-neutrino-sourced potential to electron spin-sensor experiments and find $g' \\lesssim {O}(10^{-22})$ in the electron channel.\n\n", "2510.20563": "2025-10-23, **Can a Dehnen-type dark matter halo affect the neutrino flavor oscillations?**, Mirzabek Alloqulov et.al., [2510.20563v1](http://arxiv.org/abs/2510.20563v1)\n\n The gravitational weak lensing of neutrinos in the presence of a Schwarzschild black hole surrounded by a Dehnen-type dark matter halo is investigated. The event horizon structure is explored, and the existence of the BH is studied in two different slices of the parameter space. Additionally, we derive analytic expressions for the oscillation phase and transition probabilities for both radial and non-radial neutrino propagation. Finally, we use a two-flavor toy model, and numerically analyze how the dark matter halo parameters as density and scale radius, affect oscillation probabilities and examine the role of decoherence. The results show that the presence of a dark matter halo modifies the oscillation phase and damping factor, leading to measurable deviations from the standard Schwarzschild BH case. These findings suggest that neutrino oscillations could, in principle, serve as a probe for dark matter distributions around compact astrophysical objects.\n\n", "2510.20086": "2025-10-23, **MG-NECOLA: Fast Neural Emulators for Modified Gravity Cosmologies**, J. Bayron Orjuela-Quintana et.al., [2510.20086v1](http://arxiv.org/abs/2510.20086v1)\n\n Observations of the large-scale structure (LSS) provide a powerful test of gravity on cosmological scales, but high-resolution N-body simulations of modified gravity (MG) are prohibitively expensive. We present MG-NECOLA, a convolutional neural network that enhances fast MG-PICOLA simulations to near-N-body fidelity at a fraction of the cost. MG-NECOLA reproduces QUIJOTE-MG N-body results in the power spectrum and bispectrum with better than 1% accuracy down to non-linear scales ($k \\simeq 1~h~\\mathrm{Mpc}^{-1}$), while reducing computational time by several orders of magnitude. Importantly, although trained only on $f(R)$ models with massless neutrinos, the network generalizes robustly to scenarios with massive neutrinos, preserving accuracy to within 5% at non-linear scales. This combination of precision and robustness establishes MG-NECOLA as a practical emulator for producing large ensembles of high-fidelity simulations, enabling efficient exploration of modified gravity and beyond-$\\Lambda$CDM cosmologies in upcoming surveys.\n\n"}, "dark matter": {"2510.20751": "2025-10-23, **Black Hole-Host Galaxy Correlations with Machine Learning: A Comparative Study of Illustris, TNG, and EAGLE**, Jacob Reinheimer et.al., [2510.20751v1](http://arxiv.org/abs/2510.20751v1)\n\n Supermassive black holes (SMBHs) are known to correlate with many properties of their host galaxies, but we do not fully understand these correlations. The strengths (tightness) of these correlations have also been widely debated. In this work, we explore SMBH-host relations in three state-of-the-art cosmological simulations: Illustris, TNG, and EAGLE. Using a variety of machine learning regressors, we measure the scaling relations between black hole mass ($M\\_{\\rm BH}$) and galaxy properties including stellar velocity dispersion ($\\sigma$), stellar mass ($M\\_{\\star}$), dark matter halo mass ($M\\_{\\rm Halo}$), and the Sersic index. We find that machine learning regressors provide predictive capabilities superior to linear regression in many scaling relations in simulations, and Multi-layer Perceptron (MLP) regressor has the strongest performance. SMBH-host relations have different strengths in different simulations as a result of their sub-grid models. Similar to the observations, the $M\\_{\\rm BH} $-$\\sigma$ relation is a strong correlation in all simulations, but in TNG, the $M\\_{\\rm BH} $-$M\\_{\\star}$ relation is even tighter than $M\\_{\\rm BH} $-$\\sigma$. EAGLE produces the weakest SMBH-host correlations among all simulations. Low mass SMBHs tend to be poorly correlated with their host galaxies, but including them can still help machines better grasp the correlations in Illustris and TNG. Combining galaxy properties that strongly correlate with $M\\_{\\rm BH} $ but poorly correlate with each other can improve MLP's performance. $M\\_{\\rm BH} $ is most accurately predicted when all galaxy properties are included in the training, suggesting that SMBH-host correlations are fundamentally multi-dimensional in these simulations.\n\n", "2510.20715": "2025-10-23, **Iskay2: Signal Extraction of the Kinematic Sunyaev-Zel'dovich Effect Through The Pairwise Estimator. Pipeline and Validation**, Patricio A. Gallardo et.al., [2510.20715v1](http://arxiv.org/abs/2510.20715v1)\n\n The peculiar motions of massive halos probe the distribution of matter in the universe, the gravitational potential, and the history of cosmic structure growth. The kinematic Sunyaev-Zeldovich (kSZ) effect offers a robust observational window into these properties. The pairwise kSZ estimator probes the pairwise momentum of groups of galaxies by cross-correlating cosmic microwave background (CMB) maps with spectroscopic galaxy catalogs, using galaxies to trace the positions of dark matter halos. This note introduces iskay2, an efficient pipeline designed to apply the pairwise kSZ estimator to maps of the CMB and large galaxy catalogs. Pairwise kSZ measurements obtained using this pipeline are compared to previously published results and are shown to be consistent within statistical expectations. This pipeline will enable high-precision measurements of the pairwise kSZ utilizing galaxy catalogs like DESI combined with past, current and next-generation high-resolution CMB experiments such as ACT, SPT and the Simons Observatory.\n\n", "2510.20664": "2025-10-23, **Niebla: an open-source code for modelling the extragalactic background light**, Sara Porras-Bedmar et.al., [2510.20664v1](http://arxiv.org/abs/2510.20664v1)\n\n Extragalactic very high-energy (VHE; $E>100\\,$GeV) gamma rays suffer absorption in interactions with photons of the Extragalactic Background Light (EBL). The EBL is an isotropic diffuse photon field from optical to infrared wavelengths, which is difficult to measure directly due to strong foreground emission. We present niebla, the first open-source code to compute the EBL using a forward-folding approach that accepts fully customizable inputs. This software enables a detailed modelling of the influence of EBL opacities on VHE observations and facilitates the distinction between different dust reemission models. The code models the optical background primarily from stellar emission, by evolving the spectrum of a single stellar population as a function of redshift, considering mean metallicity evolution and star formation rate density. Additional sources to the EBL can be provided by the user. The code already includes optional contributions from, e.g., stripped stars, intra-halo light, or the decay of axion dark matter. The optical emissivity is then absorbed by interstellar dust and reemitted in the infrared regime. We provide multiple prescriptions to model this process, using spectral dust templates or a combination of blackbodies. We provide three EBL models calculated with different dust reemission prescriptions, which have been fitted to various observational data sets. In addition, we showcase the versatility of our model through a simulated observation of the blazar Markarian 501 in a high-flux state with the Large High Altitude Air Shower Observatory array. We find that the simulated VHE spectrum is highly sensitive to the EBL opacity coming from the infrared. Our model will therefore allow the community to distinguish between different dust reemission models and constrain EBL parameters with future observations.\n\n", "2510.20625": "2025-10-23, **Proposal to use accelerated electrons to probe the axion-electron coupling**, Georgios Vacalis et.al., [2510.20625v1](http://arxiv.org/abs/2510.20625v1)\n\n The axion is a hypothetical particle associated with a possible solution to the strong CP problem and is a leading candidate for dark matter. In this paper we investigate the emission of axions by accelerated electrons. We find the emission probability and energy within the WKB approximation for an electron accelerated by an electromagnetic field. As an application, we estimate the number of axions produced by electrons accelerated using two counter-propagating high-intensity lasers and discuss how they would be converted to photons to be detected. We find that, under realistic experimental conditions, competitive model-independent bounds on the coupling between the axion and the electron could be achieved in such an experiment.\n\n", "2510.20453": "2025-10-23, **Symbolic Regression and Differentiable Fits in Beyond the Standard Model Physics**, Shehu AbdusSalam et.al., [2510.20453v1](http://arxiv.org/abs/2510.20453v1)\n\n We demonstrate the efficacy of symbolic regression (SR) to probe models of particle physics Beyond the Standard Model (BSM), by considering the so-called Constrained Minimal Supersymmetric Standard Model (CMSSM). Like many incarnations of BSM physics this model has a number (four) of arbitrary parameters, which determine the experimental signals, and cosmological observables such as the dark matter relic density. We show that analysis of the phenomenology can be greatly accelerated by using symbolic expressions derived for the observables in terms of the input parameters. Here we focus on the Higgs mass, the cold dark matter relic density, and the contribution to the anomalous magnetic moment of the muon. We find that SR can produce remarkably accurate expressions. Using them we make global fits to derive the posterior probability densities of the CMSSM input parameters which are in good agreement with those performed using conventional methods. Moreover, we demonstrate a major advantage of SR which is the ability to make fits using differentiable methods rather than sampling methods. We also compare the method with neural network (NN) regression. SR produces more globally robust results, while NNs require data that is focussed on the promising regions in order to be equally performant.\n\n", "2510.20207": "2025-10-23, **Emergent time and more from wavefunction collapse in general relativity**, Sung-Sik Lee et.al., [2510.20207v1](http://arxiv.org/abs/2510.20207v1)\n\n In this paper, we further develop a recently proposed theory of time based on wavefunction collapse in general relativity. It is based on the postulations that quantum states, which violate the momentum and Hamiltonian constraints, represent instances of time, and stochastic fluctuations of the lapse and shift generate the time evolution under which an initial state gradually collapses toward a diffeomorphism-invariant state. Under the wavefunction collapse, the scale factor monotonically increases, thus acting as a clock. The scalar, vector, and tensor gravitons arise as physical excitations, and the arrow of time for their evolution is set by the initial state. In the long-time limit, the tensor gravitons exhibit emergent unitary dynamics. However, the extra modes are strongly damped due to the non-unitary dynamics that suppress the constraint-violating excitations. The vector mode is uniformly suppressed over all length scales, but the decay rate of the scalar is proportional to its wave vector. This makes the latter a viable candidate for dark matter; excitations with large wavelengths survive over long periods, contributing to long-range interactions, while the fast decay of short-wavelength modes renders them undetectable without sufficient temporal resolution. These are demonstrated for the cosmological constant-dominated universe through semi-classical and adiabatic approximations, which are controlled in the limit of large space dimension.\n\n"}, "supernova": {"2510.20561": "2025-10-23, **Strong Lensing Model and Dust Extinction Maps of the Host Galaxy of Type Ia Supernova H0pe**, A. Galan et.al., [2510.20561v1](http://arxiv.org/abs/2510.20561v1)\n\n Strong gravitational lensing by massive galaxy clusters offers particularly rare opportunities to observe multiple images of distant ($z\\gtrsim2$) Type Ia supernovae (SNe) and resolve the properties of their host galaxies. A recent outstanding example is the Type Ia SN \"H0pe\" ($z=1.78$), discovered in James Webb Space Telescope (JWST) NIRCam images when it was still triply imaged by the galaxy cluster PLCK G165.7+67.0 (G165, $z=0.35$). In this work we build a new strong lensing model of G165, first by using only the position of multiple images of background galaxies. We then increase significantly the number of constraints around the position of SN H0pe by modeling the extended surface brightness of the SN host galaxy. The average uncertainty on mass model parameters is reduced by more than an order of magnitude. We also study the spatial distribution of dust in the arc to estimate the dust extinction at the position of SN H0pe. We find good statistical agreement of the extinction estimate at $\\lesssim1\\sigma$ with three fully independent methods based on spectral energy distribution fitting. Moreover, our extended-image lens model of G165 allows us to map the dust distribution of the host galaxy from the image plane to the source plane. Supernova H0pe exploded in a region with a relatively high extinction of $A\\_V \\approx 0.9\\ {\\rm mag}$ at around $\\sim 1\\ {\\rm kpc}$ from its host center. This work shows that extended image modeling in lensing clusters simultaneously reduces the uncertainty on lens model parameters and enables spatially resolved analyses of lensed transients host galaxies. Such modeling advances are expected to play an important role in future cosmological analyses using strongly lensed SNe.\n\n"}}