{"neutrino": {"2401.04568": "2024-01-09, **Pulsar Kick by the Chiral Anisotropy Conversion**, Kenji Fukushima et.al., [2401.04568v1](http://arxiv.org/abs/2401.04568v1)\n\n We discuss a novel mechanism for the proto-neutron star acceleration assisted by the chiral separation effect which induces an axial vector current in a dense medium. We consider the process of neutrinos scattering off the background axial vector current of electrons. We show that anisotropy of either magnetic field or density in momentum space is essential for nonzero recoil and we call this mechanism the chiral anisotropy conversion. Assuming a strong magnetic field $B \\simeq 10^{12}$ T and anisotropy by $\\sim 10\\%$, we find that the chiral anisotropy conversion can yield the velocity of order of typical pulsar kicks, i.e., $v\\_{\\mathrm{kick}} \\gtrsim 1000$ km/s.\n\n"}, "dark matter": {"2401.04565": "2024-01-09, **Resolving Galactic center GeV excess with MSP-like sources**, Dmitry V. Malyshev et.al., [2401.04565v1](http://arxiv.org/abs/2401.04565v1)\n\n Excess of gamma-rays with a spherical morphology around the Galactic center (GC) observed in the Fermi Large Area Telescope (LAT) data is one of the most intriguing features in the gamma-ray sky. The spherical morphology and the spectral energy distribution with a peak around a few GeV are consistent with emission from annihilation of dark matter particles. Other possible explanations include a distribution of millisecond pulsars (MSPs). One of the caveats of the MSP hypothesis is the relatively small number of associated MSPs near the GC. In this paper we perform a multi-class classification of Fermi-LAT sources using machine learning and determine the contribution from MSP-like sources among unassociated Fermi-LAT sources near the GC. We find that the unassociated MSP-like sources have a spectral energy distribution that is comparable with the GC excess if the contribution from the Fermi bubbles is taken into account. The spatial morphology and the source count distribution are also consistent with expectations for a population of MSPs that can explain the gamma-ray excess. Possible caveats of the contribution from the unassociated MSP-like sources include uncertainties in the diffuse emission model that can affect the number and the properties of the point-like sources detected near the GC and the contribution of the Fermi bubbles.\n\n", "2401.04467": "2024-01-09, **Detecting dark matter with extreme mass-ratio inspirals**, Chao Zhang et.al., [2401.04467v1](http://arxiv.org/abs/2401.04467v1)\n\n Extreme mass ratio inspirals (EMRIs), where a small compact object inspiralls onto a supermassive black hole, are excellent sources for the space-based laser interferometer gravitational wave (GW) detectors. The presence of dark matter surrounding the supermassive black hole will influence the binary orbital evolution and emitted gravitational waveform. By direct observation of GW signals, we assess the detector's capability to detect whether an EMRI is immersed in a dark matter halo and to measure its characteristic spatial scale $a\\_0$ and mass $M\\_{\\rm halo}$. Apart from the GW emission, the dynamical friction and accretion caused by the dark matter halo can also affect the dynamics of an EMRI, leaving detectable signatures in the emitted gravitational signal. We perform a Fisher-matrix error analysis to estimate the errors of parameters $a\\_0$ and $M\\_{\\rm halo}$, as well as their correlation. The results show that the highly correlated parameters $a\\_0$ and $M\\_{\\rm halo}$ deteriorate the detector's ability to measure dark matter even though the dephasing and mismatch between signals with and without dark matter indicate much difference. The effects of the dynamical friction and accretion can break possible degeneracies between parameters $a\\_0$ and $M\\_{\\rm halo}$, thus greatly decreasing the uncertainty by about one order of magnitude.\n\n"}, "supernova": {"2401.04709": "2024-01-09, **The infalling elliptical galaxy M89: The chemical composition of the AGN disturbed hot atmosphere**, Sinancan Kara et.al., [2401.04709v1](http://arxiv.org/abs/2401.04709v1)\n\n The chemical enrichment of X-ray-emitting hot atmospheres has hitherto been primarily studied in galaxy clusters. These studies revealed relative abundances of heavy elements that are remarkably similar to Solar. Here, we present measurements of the metal content of M89 (NGC 4552), an elliptical galaxy infalling into the Virgo cluster with a $\\sim$10 kpc ram-pressure stripped X-ray tail. We take advantage of deep Chandra and XMM-Newton observations, and with particular attention to carefully modelling the spectra, we measure the O/Fe, Ne/Fe, Mg/Fe, Si/Fe and S/Fe ratios. Contrary to previous measurements in galaxy clusters, our results for the hot atmosphere of M89 suggest super-Solar abundance ratios with respect to iron (i.e. $\\alpha$/Fe > 1), similar to its stellar components. Our analysis of the active galactic nucleus (AGN) activity in this system indicates that the AGN-induced outflow could have facilitated the stripping of the original galactic atmosphere, which has been replaced with fresh stellar mass loss material with super-Solar $\\alpha$/Fe abundance ratios. Additionally, we report a new fitting bias in the RGS data of low-temperature plasma. The measured O/Fe ratios are >1$\\sigma$ lower in multi-temperature models than a single temperature fit, leading to discrepancies in the calculations of supernova fractions derived from the metal abundances.\n\n", "2401.04395": "2024-01-09, **Formation of millisecond pulsars with wide orbits**, Bo Wang et.al., [2401.04395v1](http://arxiv.org/abs/2401.04395v1)\n\n Millisecond pulsars (MSPs) are a kind of radio pulsars with short spin periods, playing a key role in many aspects of stellar astrophysics. In recent years, some more MSPs with wide orbits ($>30\\,\\rm d$) have been discovered, but their origin is still highly unclear. In the present work, according to an adiabatic power-law assumption for the mass-transfer process, we carried out a large number of complete binary evolution computations for the formation of MSPs with wide orbits through the iron core-collapse supernova (CCSN) channel, in which a neutron star (NS) originating from a CCSN accretes matter from a red-giant (RG) star and spun up to millisecond periods. We found that this channel can form the observed MSPs with wide orbits in the range of $30-1200\\,{\\rm d}$, in which the WD companions have masses in the range of $0.28-0.55\\,\\rm M\\_{\\odot}$. We also found that almost all the observed MSPs can be reproduced by this channel in the WD companion mass versus orbital period diagram. We estimate that the Galactic numbers of the resulting MSPs from the CCSN channel are in the range of $\\sim 0.9-1.4\\times10^{6}$. Compared with the accretion-induced collapse channel, the CCSN channel provides a dominant way to produce MSPs with wide orbits.\n\n"}}