{"neutrino": {"2402.07761": "2024-02-12, **Decay rate measurements $^{137}$Cs at Jánossy Underground Research Laboratory**, Edit Fenyvesi et.al., [2402.07761v1](http://arxiv.org/abs/2402.07761v1)\n\n The question whether an annual modulation is observable during nuclear decay rate measurements has long been the subject of research. One of the possible explanations for the annual variations would be the effect of solar neutrinos, the flux of which changes in correlation with the Earth-Sun distance. A decay rate measurement with a $^{137}$Cs source and a HPGe detector is currently being conducted 30 meters below the ground at J\\'anossy Underground Research Laboratory (Csilleb\\'erc, Hungary). The laboratory is part of the Vesztergombi High Energy Laboratory (VLAB), one of the TOP 50 research infrastructures in Hungary. From October 2022 to March 2023, data of six months' worth has been collected, and hence this is a new opportunity to check whether the annual variation in decay rate can be observed. The laboratory, the experiment, the data processing method, and the first results are presented in this study.\n\n"}, "dark matter": {"2402.07713": "2024-02-12, **Closed-form expressions for multiscatter Dark Matter capture rates**, Cosmin Ilie et.al., [2402.07713v1](http://arxiv.org/abs/2402.07713v1)\n\n Any astrophysical object can, in principle, serve as a probe of the interaction between Dark Matter and regular, baryonic matter. This method is based on the potential observable consequences annihilations of captured Dark Matter has on the surface temperature of the object itself. In a series of previous papers we developed and validated simple analytic approximations for the total capture rates of Dark Matter (DM) valid in four distinct regions of the DM-nucleon scattering cross section ($\\sigma$) vs. DM particle mass ($m\\_X$) parameter space. In this work we summarize those previous results and extend them significantly, by deriving a completely general, closed form solution for the total capture rate of Dark Matter in the multiscatter regime. Moreover, we demonstrate the existence of a region in the $\\sigma$ vs. $m\\_X$ parameter space where the constraining power of any astrophysical object heated by annihilations of captured DM is lost. This corresponds to a maximal temperature ($T\\_{crit}$) any astrophysical object can have, such that it can still serve as a DM probe. Any object with observed temperature $T\\_{obs}>T\\_{crit}$ loses its DM constraining power. We provide analytic formulae that can be used to estimate $T\\_{crit}$ for any object.\n\n", "2402.07694": "2024-02-12, **Cosmology at the Field Level with Probabilistic Machine Learning**, Adam Rouhiainen et.al., [2402.07694v1](http://arxiv.org/abs/2402.07694v1)\n\n The large-scale structure in cosmology is highly non-Gaussian at late times and small length scales, making it difficult to describe analytically. Parameter inference, data reconstruction, and data generation tasks in cosmology are greatly aided by various machine learning models. In order to retain as much information as possible while solving these problems, this work operates at the field level, rather than at the level of summary statistics. The probability density function of the large-scale structure is learned with normalizing flows, a class of probabilistic generative models. Normalizing flows learn the transformation from a simple base distribution to a more complicated distribution, much like the matter content evolved to its present day complexities from a Gaussian field at early times. While the normalizing flows have accurately modelled 2-dimensional projections of the matter content, we find that denoising diffusion models are well-suited for volumetric data. A super-resolution emulator is developed for cosmological simulation volumes, generating high-resolution baryonic simulation volumes conditional on low-resolution dark matter simulations. The super-resolution emulator is trained to perform outpainting, and can thus upgrade very large cosmological volumes from low-resolution to high-resolution using an iterative outpainting procedure.\n\n", "2402.07623": "2024-02-12, **Fluctuation-dissipation relation in cosmic microwave background**, Atsuhisa Ota et.al., [2402.07623v1](http://arxiv.org/abs/2402.07623v1)\n\n We study the fluctuation-dissipation relation for sound waves in the cosmic microwave background (CMB), employing effective field theory (EFT) for fluctuating hydrodynamics. Treating sound waves as the linear response to thermal radiation, we establish the fluctuation-dissipation relation within a cosmological framework. While dissipation is elucidated in established linear cosmological perturbation theory, the standard Boltzmann theory overlooks the associated noise, possibly contributing to inconsistencies in Lambda Cold Dark Matter ($\\Lambda$CDM) cosmology. This paper employs EFT for fluctuating hydrodynamics in cosmological perturbation theory, deriving sound wave noise. Notably, the long-time limit of the noise spectrum is independent of viscosity details, resembling a Brownian motion bounded in a harmonic potential. The net energy transfer between the sound wave system and the radiation environment reaches a balance within Hubble time, suggesting the thermal equilibrium of the sound waves themselves. The induced density power spectrum is characterized as white noise dependent on the inverse of the entropy density, which is negligibly small on the CMB scale. The energy density of the entire sound wave system scales as $a^{-4}$, akin to radiation. While the numerical factor is not determined in the present calculation, the back reaction of the sound wave system to the background radiation may not be negligible, serving as a potential source for various fitting issues in $\\Lambda$CDM cosmology.\n\n", "2402.07566": "2024-02-12, **The DarkSide-20k experiment**, Andrea Zani et.al., [2402.07566v1](http://arxiv.org/abs/2402.07566v1)\n\n The DarkSide-20k experiment represents the present goal of the Global Argon Dark Matter Collaboration program. Bringing together the experience from previous argon-based detectors, as well as the knowledge gained on large volume membrane cryostats developed within the DUNE program, the community is now building a dual-phase LAr-TPC equipped with SiPM arrays for light readout. The main goal of the experiment is to discover or to extend the current sensitivity limits on the search for dark matter WIMP-like particles. Currently, the experiment has entered the construction phase and the external cryostat is being put in place at Laboratori Nazionali del Gran Sasso (LNGS), Italy. Detector construction will follow, and data taking is expected to start in late 2026. This contribution will introduce the DarkSide detector and goals, and it will report on the ongoing construction of the underground infrastructure at LNGS. Finally, it will concentrate on the current activities on large arrays of silicon light detectors, that are at the base of the construction of the detector light readout system.\n\n", "2402.07362": "2024-02-12, **Exploring Composite Dark Matter with an SU(4) gauge theory with 1 fermion flavor**, Venkitesh Ayyar et.al., [2402.07362v1](http://arxiv.org/abs/2402.07362v1)\n\n Several SU(N) gauge theories have been explored as candidates for producing stable dark matter particles that can explain their relative abundance, while also evading current constraints from direct, indirect and collider searches. In this talk, I will present the confinement and spectral properties of a new model we name \"Hyper Stealth Dark Matter\", which involves an SU(4) gauge theory with 1 quark flavor. The lightest baryon in this theory can be a potential dark matter candidate as it is protected from decay and hence can evade detection with a mass of just a few GeV. Existence of a first order confinement transition would open the possibility of potential detection of gravitational waves from such a transition at future observatories.\n\n"}, "supernova": {"2402.07515": "2024-02-12, **Gravitational Lensing and Clues of $r_{d}$ and $H_{0}$ Tension: Viscous Modified Chaplygin Gas and Variable Modified Chaplygin Gas in Loop Quantum Cosmology**, Rownak Kundu et.al., [2402.07515v1](http://arxiv.org/abs/2402.07515v1)\n\n This paper explores the accelerated cosmic expansion in the late Universe through the investigation of two dark energy models: viscous modified Chaplygin gas (VsMCG) and variable modified Chaplygin gas (VMCG), alongside the $\\Lambda$CDM model. Our goal is to constrain fundamental cosmic parameters in these dark energy models with the $\\Lambda$CDM model using 30 of the latest $H(z)$ measurements from the cosmic chronometers method (CC), including Type Ia Supernovae, Gamma-Ray Bursts (GRB), Quasars, and 24 uncorrelated baryon acoustic oscillations (BAO) measurements from recent galaxy surveys across a redshift range from (0.106 < z < 2.33). Additionally, we include the most recent Hubble constant measurement from Riess in 2022. In the $\\Lambda$CDM, VsMCG, and VMCG frameworks, we determine best-fit parameters for the Hubble parameter ($H\\_{0}$) and sound horizon ($r\\_{d}$). The results reveal significant disparities between ($H\\_{0}$) and ($r\\_{d}$) values using late-time observational measurements, reflecting the widely recognized ($H\\_{0}$) and ($r\\_{d}$) tensions. We also study the gravitational lensing optical depth of the two dark energy models and find that the probability of finding gravitational lenses increases with source redshift $z\\_s$. Joint analysis of VsMCG and VMCG with the $\\Lambda$CDM model shows divergence in the early Universe but indistinguishability at low redshifts. Finally, using the Akaike information criteria approach for model comparison, our analysis indicates that none of the two dark energy models can be dismissed based on the latest observational measurements.\n\n"}}