{"neutrino": {"2305.15211": "2023-05-24, **Bilinear R-parity violating supersymmetry under the light of neutrino oscillation, higgs and flavor data**, Arghya Choudhury et.al., [2305.15211v1](http://arxiv.org/abs/2305.15211v1)\n\n In this work, we explore a well motivated beyond the Standard Model scenario, namely, R-parity violating Supersymmetry, in the context of light neutrino masses and mixing. We assume that the R-parity is only broken by the lepton number violating bilinear term. We try to fit two non-zero neutrino mass square differences and three mixing angle values obtained from the global $\\chi^2$ analysis of neutrino oscillation data. We have also taken into account the updated data of the standard model (SM) Higgs mass and its coupling strengths with other SM particles from LHC Run-II along with low energy flavor violating constraints like rare b-hadron decays. We have used a Markov Chain Monte Carlo (MCMC) analysis to constrain the new physics parameter space. While doing so, we ensure that all the existing collider constraints are duly taken into account. Through our analysis we have derived the most stringent constraints possible till date with existing data on the 9 bilinear R-parity violating parameters along with $\\mu$ and $\\tan\\beta$. We further explore the possibility of explaining the anomalous muon (g - 2) measurement staying within the parameter space allowed by neutrino, Higgs and flavor data while satisfying the collider constraints as well. We find that there still remains a small sub-TeV parameter space where the required excess can be obtained.\n\n", "2305.14931": "2023-05-24, **Search for Majorana neutrinos in same-sign $WW$ scattering events from $pp$ collisions at $\\sqrt{s}=13$ TeV**, ATLAS Collaboration et.al., [2305.14931v1](http://arxiv.org/abs/2305.14931v1)\n\n A search for Majorana neutrinos in same-sign $WW$ scattering events is presented. The analysis uses $\\sqrt{s}= 13$ TeV proton-proton collision data with an integrated luminosity of 140 fb$^{-1}$ recorded during 2015-2018 by the ATLAS detector at the Large Hadron Collider. The analysis targets final states including exactly two same-sign muons and at least two hadronic jets well separated in rapidity. The modelling of the main backgrounds, from Standard Model same-sign $WW$ scattering and $WZ$ production, is constrained with data in dedicated signal-depleted control regions. The distribution of the transverse momentum of the second-hardest muon is used to search for signals originating from a heavy Majorana neutrino with a mass between 50 GeV and 20 TeV. No significant excess is observed over the background expectation. The results are interpreted in a benchmark scenario of the Phenomenological Type-I Seesaw model. In addition, the sensitivity to the Weinberg operator is investigated. Upper limits at the 95% confidence level are placed on the squared muon-neutrino-heavy-neutrino mass-mixing matrix element $\\vert V\\_{\\mu N} \\vert^{2}$ as a function of the heavy Majorana neutrino's mass $m\\_N$, and on the effective $\\mu\\mu$ Majorana neutrino mass $\\|m\\_{\\mu\\mu}\\|$.\n\n", "2305.14427": "2023-05-23, **Predicting the baryon asymmetry with degenerate right-handed neutrinos**, S. Sandner et.al., [2305.14427v1](http://arxiv.org/abs/2305.14427v1)\n\n We consider the generation of a baryon asymmetry in an extension of the Standard Model with two singlet Majorana fermions that are degenerate above the electroweak phase transition. The model can explain neutrino masses as well as the observed matter-antimatter asymmetry, for masses of the heavy singlets below the electroweak scale. The only physical CP violating phases in the model are those in the PMNS mixing matrix, i.e. the Dirac phase and a Majorana phase that enter light neutrino observables. We present an accurate analytic approximation for the baryon asymmetry in terms of CP flavour invariants, and derive the correlations with neutrino observables. We demonstrate that the measurement of CP violation in neutrino oscillations as well as the mixings of the heavy neutral leptons with the electron, muon and tau flavours suffice to pin down the matter-antimatter asymmetry from laboratory measurements.\n\n", "2305.14420": "2023-05-23, **Terrestrial detection of hidden vectors produced by solar nuclear reactions**, Francesco D'Eramo et.al., [2305.14420v1](http://arxiv.org/abs/2305.14420v1)\n\n Solar nuclear reactions can occasionally produce sub-MeV elusive beyond the Standard Model particles that escape the solar interior without further interactions. This study focuses on massive spin-one particles. We construct the general theoretical framework and identify two crucial mixing sources involving the photon, which facilitate communication between the hidden and visible sectors: kinetic mixing with the photon, and plasma-induced mixing due to thermal electron loops. For both cases, we focus on the second stage of the solar proton-proton chain and evaluate the fluxes of monochromatic 5.49 MeV hidden vectors produced by the $p(d, ^3{\\rm He})\\gamma^\\prime$ nuclear reaction. We then investigate their terrestrial detection via Compton-like scatterings and decays. The incoming fluxes are polarized, and we evaluate the cross sections for Compton-like scatterings for transverse and longitudinal vectors. Finally, we apply this framework to a concrete case by investigating the sensitivity of the forthcoming Jiangmen Underground Neutrino Observatory (JUNO) experiment. We find that JUNO will access an uncharted parameter space region of the kinetic mixing scenario when the vector mass exceeds twice the electron mass.\n\n", "2305.14273": "2023-05-23, **Reheating process in the $R^2$ inflationary model with the baryogenesis scenario**, Hyun Jeong et.al., [2305.14273v1](http://arxiv.org/abs/2305.14273v1)\n\n Post-inflationary evolution and (re)heating of the viable inflationary model, the $R^2$ one, is made more realistic by including the leptogenesis scenario into it. For this purpose, right-handed Majorana neutrinos with a large mass are added to the matter sector of the Standard Model to explain the neutrino oscillation experiments and the baryon asymmetry of the Universe. We have found parameters that characterize this model: non-minimal coupling of the Higgs field $\\xi$ and the mass of the right-handed Majorana neutrino $M\\_{N\\_\\alpha}$. We have analyzed the effect of these parameters on the reheating process and the resultant physical quantities: spectral indices and baryon asymmetry.\n\n", "2305.14166": "2023-05-23, **Dark Sectors with Mass Thresholds Face Cosmological Datasets**, Itamar J. Allali et.al., [2305.14166v1](http://arxiv.org/abs/2305.14166v1)\n\n Interacting dark sectors may undergo changes in the number of their relativistic species during the early universe, due to a mass threshold $m$ (similar to changes in the Standard Model bath), and in doing so affect the cosmic history. When such changes occur close to recombination, i.e., for $m\\sim (0.1-10)~\\text{eV}$, the stringent bound on the effective number of neutrino species, $N\\_{\\text{eff}}$, can be relaxed and the value of the Hubble expansion rate $H\\_0$ inferred from Cosmic Microwave Background (CMB) observations raised. We search for such sectors (with and without mass thresholds) in the latest cosmological datasets, including the full-shape (FS) of BOSS DR12 galaxy power spectrum. We perform a detailed analysis, accounting for the choice of prior boundaries and additionally exploring the possible effects of dark sector interactions with (a fraction of) the dark matter. We find $\\Delta N\\_{\\text{eff}}\\leq 0.55\\, (0.46)$ at 95% C.L. with (without) a mass threshold. While a significantly larger Hubble rate is achieved in this scenario, $H\\_0=69.01^{+0.66}\\_{-1.1}$, the overall fit to CMB+FS data does not provide a compelling advantage over the $\\Lambda$CDM model. Furthermore, we find that dark matter interactions with the dark sector do not significantly improve the (matter fluctuations) $S\\_8$ tension with respect to the $\\Lambda$CDM model. Our work provides model-independent constraints on (decoupled) dark sectors with mass thresholds around the eV scale.\n\n", "2305.14140": "2023-05-23, **On the Dirac-Majorana neutrinos distinction in four-body decays**, Juan Manuel Márquez et.al., [2305.14140v1](http://arxiv.org/abs/2305.14140v1)\n\n Motivated by the novel method discussed in arXiv:2106.11785 to differentiate the effects of Dirac and Majorana neutrinos in four-body decays, we propose to analyse radiative leptonic lepton-decays ($\\ell\\to\\ell'\\nu\\bar{\\nu}\\gamma$), as an independent alternative process to study the possible Majorana nature of neutrinos. Following arXiv:2106.11785, the back-to-back kinematic scenario (for the $\\ell'- \\gamma$ and $\\nu-\\bar{\\nu}$ systems, respectively) supposedly avoids the constraint imposed by the \"practical Dirac-Majorana confusion theorem\", as one does not need to fully integrate over neutrino and antineutrino momenta. Our results show that, in this special kinematic configuration, the difference between Dirac and Majorana cases vanishes once the inaccessible neutrino angle is integrated out, which seems to be incompatible with the proposal in arXiv:2106.11785. We work on that and conclude that the discrepancy comes from the kinematic treatment, specifically from the angular integration and clarify these issues with consistency tests. All this applies in absence of non-standard interactions, which can enhance generally the sensitivity to the neutrino nature.\n\n", "2305.13923": "2023-05-23, **Open system approach to Neutrino oscillations in a quantum walk framework**, Himanshu Sahu et.al., [2305.13923v1](http://arxiv.org/abs/2305.13923v1)\n\n Quantum simulation provides a computationally-feasible approach to model and study many problems in chemistry, condensed-matter physics, or high-energy physics where quantum phenomenon define the systems behaviour. In high-energy physics, quite a few possible applications are investigated in the context of gauge theories and their application to dynamic problems, topological problems, high-baryon density configurations, or collective neutrino oscillations. In particular, schemes for simulating neutrino oscillations are proposed using a quantum walk framework. In this study, we approach the problem of simulating neutrino oscillation from the perspective of open quantum systems by treating the position space of quantum walk as environment. We have obtained the recurrence relation for Kraus operator which is used to represent the dynamics of the neutrino flavor change in the form of reduced coin states. We establish a connection between the dynamics of reduced coin state and neutrino phenomenology, enabling one to fix the simulation parameters for a given neutrino experiment and reduces the need for extended position space to simulate neutrino oscillations. We have also studied the behavior of linear entropy as a measure of entanglement between different flavors in the same framework.\n\n", "2305.13837": "2023-05-23, **Electroweak Loop Contributions to the Direct Detection of Wino Dark Matter**, John Ellis et.al., [2305.13837v1](http://arxiv.org/abs/2305.13837v1)\n\n Electroweak loop corrections to the matrix elements for the spin-independent scattering of cold dark matter particles on nuclei are generally small, typically below the uncertainty in the local density of cold dark matter. However, as shown in this paper, there are instances in which the electroweak loop corrections are relatively large, and change significantly the spin-independent dark matter scattering rate. An important example occurs when the dark matter particle is a wino, e.g., in anomaly-mediated supersymmetry breaking (AMSB) and pure gravity mediation (PGM) models. We find that the one-loop electroweak corrections to the spin-independent wino LSP scattering cross section generally interfere constructively with the tree-level contribution for AMSB models with negative Higgsino mixing, $\\mu < 0$, and in PGM-like models for both signs of $\\mu$, lifting the cross section out of the neutrino fog and into a range that is potentially detectable in the next generation of direct searches for cold dark matter scattering.\n\n"}, "dark matter": {"2305.15185": "2023-05-24, **Recent results from continuous gravitational wave searches using data from LIGO/Virgo/KAGRA's third observing run**, Andrew L. Miller et.al., [2305.15185v1](http://arxiv.org/abs/2305.15185v1)\n\n The third observing run of advanced LIGO, Virgo and KAGRA brought unprecedented sensitivity towards a variety of quasi-monochromatic, persistent gravitational-wave signals. Continuous waves allow us to probe not just the existence of canonical asymmetrically rotating neutron stars, but also different forms of dark matter, thus showing the wide-ranging astrophysical implications of using a relatively simple signal model. I will describe the major results from the numerous continuous-wave searches that were performed in O3, both inside and outside the LIGO/Virgo/KAGRA collaborations, and show how impactful to multi-messenger physics that they have been.\n\n", "2305.14446": "2023-05-23, **A New Window into Gravitationally Produced Scalar Dark Matter**, Marcos A. G. Garcia et.al., [2305.14446v1](http://arxiv.org/abs/2305.14446v1)\n\n Conventional scenarios of purely gravitationally produced dark matter with masses below the Hubble parameter at the end of inflation are in tension with Cosmic Microwave Background (CMB) constraints on the isocurvature power spectrum. We explore a more general scenario with a non-minimal coupling between the scalar dark matter field and gravity, which allows for significantly lighter scalar dark matter masses compared to minimal coupling predictions. By imposing relic abundance, isocurvature, Lyman-$\\alpha$, and Big Bang Nucleosynthesis (BBN) constraints, we show the viable parameter space for these models. Our findings demonstrate that the presence of a non-minimal coupling expands the parameter space, yielding a dark matter mass lower bound of $2 \\times 10^{-4} \\, \\rm{eV}$.\n\n", "2305.14305": "2023-05-23, **Observational Constraints on Yukawa Cosmology and Connection with Black Hole Shadows**, Esteban González et.al., [2305.14305v1](http://arxiv.org/abs/2305.14305v1)\n\n This research explores a cosmological model proposed in arXiv:2304.11492 by Jusufi et al., which challenges the existence of dark matter and proposes a connection between dark matter, dark energy, and baryonic matter by altering Newton's law of gravity in large-scale structures. The model is described by a Yukawa-like gravitational potential with the coupling parameter $\\alpha$ and wavelength parameter $\\lambda$. Utilizing observational data from Supernovae Ia and $H(z)$ within a $1\\sigma$ CL, the study determines the best-fit parameters, resulting in $\\lambda=2693\\_{-1262}^{+1191}\\, \\rm Mpc$, $\\alpha=0.416\\_{-0.326}^{+1.137}$, and a graviton mass of approximately $m\\_g \\simeq 10^{-69}$ kg. The research also establishes a direct connection between the dark matter/dark energy density parameters and the angular radius of the black hole shadow of the SgrA and M87 black holes in the low-redshift limit, which is consistent with the findings of the Event Horizon Telescope. This discovery holds significant importance in the paper, as it challenges the conventional understanding of the universe's composition and gravitational forces.\n\n", "2305.14242": "2023-05-23, **Axion Poltergeist**, Keisuke Harigaya et.al., [2305.14242v1](http://arxiv.org/abs/2305.14242v1)\n\n Rotations of axion fields in the early universe can produce dark matter and the matter-antimatter asymmetry of the universe. We point out that the rotation can generate an observable amount of a stochastic gravitational-wave (GW) background. It can be doubly enhanced in a class of models in which the equation of state of the rotations rapidly changes from a non-relativistic matter-like one to a kination-like one by 1) the so-called Poltergeist mechanism and 2) slower redshift of GWs compared to the axion kination fluid. In supersymmetric UV completion, future GW observations can probe the supersymmetry-breaking scale up to $10^7\\,$GeV even if the axion does not directly couple to the Standard Model fields.\n\n", "2305.14101": "2023-05-23, **Impacts of symmetry energy slope on the oscillation frequencies of neutron stars with short-range correlation and admixed dark matter**, Bin Hong et.al., [2305.14101v1](http://arxiv.org/abs/2305.14101v1)\n\n Oscillation modes of compact stars, in general, can serve as a fingerprint in determining the equation of state (EOS) of dense matter. In this study, we examine the impact of symmetry energy slope ($L$) on the oscillation frequencies of neutron stars (NSs) with nucleon-nucleon short range correlation (SRC) and admixed dark matter (DM) for the first time within the relativistic mean-field theory. By adjusting the $L$, we revise the EOS and coupling parameters in light of the SRC and DM effects, and construct the new sets. The results reveal that NSs containing SRC and DM inside are more likely to satisfy the observational constraints, and we find that smaller $L$ exhibits larger fundamental non-radial and radial frequencies, and that the effect on Large Separation (LG) is also mainly concentrated in the low-mass region. Moreover, we update the linear relationship between the non-radial frequency and mean density, and we further give empirical relations between non-radial and radial frequencies and tidal deformability at different $L$ for 1.4$M\\_{\\odot}$ and 2$M\\_{\\odot}$. These findings will enable us to more effectively confine the NS EOSs, in turn, also provide a strategy to place constraints on the $L$.\n\n", "2305.13974": "2023-05-23, **Looking for Traces of Non-minimally Coupled Dark Matter in the X-COP Galaxy Clusters Sample**, Giovanni Gandolfi et.al., [2305.13974v1](http://arxiv.org/abs/2305.13974v1)\n\n We look for possible evidence of a non-minimal coupling (NMC) between dark matter (DM) and gravity using data from the X-COP compilation of galaxy clusters. We consider a theoretically motivated NMC that may dynamically arise from the collective behavior of the coarse-grained DM field (e.g., via Bose-Einstein condensation) with averaging/coherence length $\\L\\_{\\mathrm{nmc}}$. In the Newtonian limit, the NMC modifies the Poisson equation by a term $\\L\\_{\\mathrm{nmc}}^2 \\nabla^2 \\rho$ proportional to the Laplacian of the DM density itself. We show that this term when acting as a perturbation over the standard Navarro-Frenk-White (NFW) profile of cold DM particles, can yield DM halo density profiles capable of correctly fitting galaxy clusters' pressure profiles with an accuracy comparable and in some cases even better than the standard cold DM NFW profile. We also show that the observed relation between the non-minimal coupling length scale and the virial mass found in Gandolfi et al., 2022 for Late Type Galaxies is consistent with the relation we find in the current work, suggesting that the previously determined power-law scaling law holds up to galaxy cluster mass scales.\n\n", "2305.14400": "2023-05-23, **The Reconstruction of Constant Jerk Parameter with $f(R,T)$ Gravity in Bianchi-I spacetime**, Anirudh Pradhan et.al., [2305.14400v1](http://arxiv.org/abs/2305.14400v1)\n\n We have developed a Bianchi I cosmological model of the universe in $f(R,T)$ gravity theory which fit good with the present day scenario of accelerating universe. The model displays transition from deceleration in the past to the acceleration at the present. As in the $\\Lambda$CDM model, we have defined the three energy parameters $\\Omega\\_m$, $\\Omega\\_{\\mu}$ and $\\Omega\\_{\\sigma}$ such that $\\Omega\\_m$ + $\\Omega\\_{\\mu}$ + $\\Omega\\_{\\sigma}$ = 1. The parameter $\\Omega\\_m$ is the matter energy density (baryons + dark matter), $\\Omega\\_{\\mu}$ is the energy density associated with the Ricci scalar $R$ and the trace $T$ of the energy momentum tensor and $\\Omega\\_{\\sigma}$ is the energy density associated with the anisotropy of the universe. We shall call $\\Omega\\_{\\mu}$ dominant over the other two due to its higher value. We find that the $\\Omega\\_{\\mu}$ and the other two in the ratio 3:1. 46 Hubble OHD data set is used to estimate present values of Hubble $H\\_0$, deceleration $q\\_0$ and jerk $j$ parameters. 1$\\sigma$, 2$\\sigma$ and 3$\\sigma$ contour region plots for the estimated values of parameters are presented. 580 SNIa supernova distance modulus data set and 66 pantheon SNIa data which include high red shift data in the range $0\\leq z\\leq 2.36$ have been used to draw error bar plots and likelihood probability curves for distance modulus and apparent magnitude of SNIa supernova's. We have calculated the pressures and densities associated with the two matter densities, viz., $p\\_{\\mu}$, $\\rho\\_{\\mu}$, $p\\_m$ and $\\rho\\_m$, respectively. The present age of the universe as per our model is also evaluated and it is found at par with the present observed values.\n\n", "2305.14399": "2023-05-23, **Type Ia Supernovae Induced by Primordial Black Holes from Dark First-Order Phase Transition**, Pin-Jung Chen et.al., [2305.14399v1](http://arxiv.org/abs/2305.14399v1)\n\n A primordial black hole (PBH) with mass $10^{-15}\\leq M\\_{\\rm PBH}/M\\_{\\odot}\\leq 10^{-10}$ is currently beyond the sensitivity of both microlensing and black hole (BH) evaporation methods. A novel scenario has been proposed: When a PBH with mass $10^{-14}\\leq M\\_{\\rm PBH}/M\\_{\\odot}\\leq 10^{-11}$ transits through a white dwarf (WD) made up of carbon and oxygen, Bondi-Hoyle-Lyttleton (BHL) accretion in a reactive medium creates a shock wave, which generates direct detonation ignition in the WD core and then leads to thermonuclear supernovae (SNe Ia). The aim of this study is to impose constraints on the PBH to dark matter (DM) abundance fraction, $f\\_{\\rm PBH}$, via comparing the SN Ia event rates between PBH hypotheses and observational data. For PBH fraction less than unity, we found the observed event rate prefers PBH mass region, $7.6\\times 10^{-13}\\leq M\\_{\\rm PBH}/M\\_{\\odot}\\leq 6.1\\times 10^{-12}$, under the Navarro-Frenk-White (NFW) profile. Meanwhile, the aforementioned PBH mass and abundance can be efficiently produced via a cosmological first-order phase transition (FOPT) in dark sector which associates with $\\mathcal{O}({\\rm MeV})$ energy scale and thus gives rise to complementary signals of stochastic gravitational waves (GWs) from $10^{-6}$ Hz to $10^{-5}$ Hz peak frequency which can be probed by future $\\mu$Ares GW interferometer.\n\n", "2305.13694": "2023-05-23, **Assessing Mass Loss and Stellar-to-Halo Mass Ratio of Satellite Galaxies: A Galaxy-Galaxy Lensing Approach Utilizing DECaLS DR8 Data**, Chunxiang Wang et.al., [2305.13694v1](http://arxiv.org/abs/2305.13694v1)\n\n The galaxy-galaxy lensing technique allows us to measure the subhalo mass of satellite galaxies, studying their mass loss and evolution within galaxy clusters and providing direct observational validation for theories of galaxy formation. In this study, we use the weak gravitational lensing observations from DECaLS DR8, in combination with the redMaPPer galaxy cluster catalog from SDSS DR8 to accurately measure the dark matter halo mass of satellite galaxies. We confirm a significant increase in the stellar-to-halo mass ratio of satellite galaxies with their halo-centric radius, indicating clear evidence of mass loss due to tidal stripping. Additionally, we find that this mass loss is strongly dependent on the mass of the satellite galaxies, with satellite galaxies above $10^{11}~{\\rm M\\_{\\odot}/h}$ experiencing more pronounced mass loss compared to lower mass satellites, reaching 86\\% at projected halo-centric radius $0.5R\\_{\\rm 200c}$. The average mass loss rate, when not considering halo-centric radius, displays a U-shaped variation with stellar mass, with galaxies of approximately $4\\times10^{10}~{\\rm M\\_{\\odot}/h}$ exhibiting the least mass loss, around 60\\%. We compare our results with state-of-the-art hydrodynamical numerical simulations and find that the satellite galaxy stellar-to-halo mass ratio in the outskirts of galaxy clusters is higher compared to the predictions of the Illustris-TNG project about factor 5. Furthermore, the Illustris-TNG project's numerical simulations did not predict the observed dependence of satellite galaxy mass loss rate on satellite galaxy mass.\n\n", "2305.13692": "2023-05-23, **Evidence for the production of Ar$_2^{*-}$ metastable negative molecular ions in two-phase argon detectors for dark matter searches**, A. Buzulutskov et.al., [2305.13692v1](http://arxiv.org/abs/2305.13692v1)\n\n The recent studies of electroluminescence (EL) properties in two-phase argon detectors for dark matter searches have revealed the presence of unusual delayed pulses in the EL signal in the form of two slow components with time constants of about 5 and 50 $\\mu$s. These components were shown to be present in the charge signal itself, which clearly indicates that drifting electrons are temporarily trapped on two states of metastable negative argon ions which have never been observed before. In this work, using the pressure dependence of the ratio of slow component contributions measured in experiment, it is shown that these states are those of two types of metastable negative molecular ions, $\\mathrm{Ar}\\_2^{*-}(b \\ ^4\\Sigma\\_u^-)$ and $\\mathrm{Ar}\\_2^{*-}(a \\ ^4\\Sigma\\_g^+)$ for the higher and lower energy level respectively.\n\n"}, "supernova": {"2305.15355": "2023-05-24, **Modeling the chemical enrichment history of the Bulge Fossil Fragment Terzan 5**, Donatella Romano et.al., [2305.15355v1](http://arxiv.org/abs/2305.15355v1)\n\n Terzan 5 is a heavily obscured stellar system located in the inner Galaxy. It has been postulated to be a stellar relic, a Bulge Fossil Fragment witnessing the complex history of the assembly of the Milky Way bulge. In this paper, we follow the chemical enrichment of a set of putative progenitors of Terzan 5 to assess whether the chemical properties of this cluster fit within a formation scenario in which it is the remnant of a primordial building block of the bulge. We can explain the metallicity distribution function and the runs of different element-to-iron abundance ratios as functions of [Fe/H] derived from optical-infrared spectroscopy of giant stars in Terzan 5, by assuming that the cluster experienced two major star formation bursts separated by a long quiescent phase. We further predict that the most metal-rich stars in Terzan 5 are moderately He-enhanced and a large spread of He abundances in the cluster, Y = 0.26-0.335. We conclude that current observations fit within a formation scenario in which Terzan 5 originated from a pristine, or slightly metal-enriched, gas clump about one order of magnitude more massive than its present-day mass. Losses of gas and stars played a major role in shaping Terzan 5 the way we see it now. The iron content of the youngest stellar population is better explained if the white dwarfs that give rise to type Ia supernovae (the main Fe factories) sink towards the cluster center, rather than being stripped by the strong tidal forces exerted by the Milky Way in the outer regions.\n\n", "2305.14733": "2023-05-24, **New constraints on the kinematic, relativistic and evolutionary properties of the PSR J1757$-$1854 double neutron star system**, A. D. Cameron et.al., [2305.14733v1](http://arxiv.org/abs/2305.14733v1)\n\n PSR J1757$-$1854 is one of the most relativistic double neutron star binary systems known in our Galaxy, with an orbital period of $P\\_\\text{b}=4.4\\,\\text{hr}$ and an orbital eccentricity of $e=0.61$. As such, it has promised to be an outstanding laboratory for conducting tests of relativistic gravity. We present the results of a 6-yr campaign with the 100-m Green Bank and 64-m Parkes radio telescopes, designed to capitalise on this potential. We identify secular changes in the profile morphology and polarisation of PSR J1757$-$1854, confirming the presence of geodetic precession and allowing the constraint of viewing geometry solutions consistent with General Relativity. We also update PSR J1757$-$1854's timing, including new constraints of the pulsar's proper motion, post-Keplerian parameters and component masses. We conclude that the radiative test of gravity provided by PSR J1757$-$1854 is fundamentally limited to a precision of 0.3 per cent due to the pulsar's unknown distance. A search for pulsations from the companion neutron star is also described, with negative results. We provide an updated evaluation of the system's evolutionary history, finding strong support for a large kick velocity of $w\\ge280\\,\\text{km s}^{-1}$ following the second progenitor supernova. Finally, we reassess PSR J1757$-$1854's potential to provide new relativistic tests of gravity. We conclude that a 3-$\\sigma$ constraint of the change in the projected semi-major axis ($\\dot{x}$) associated with Lense-Thirring precession is expected no earlier than 2031. Meanwhile, we anticipate a 3-$\\sigma$ measurement of the relativistic orbital deformation parameter $\\delta\\_\\theta$ as soon as 2026.\n\n", "2305.14491": "2023-05-23, **GRB 201015A and the nature of low-luminosity soft gamma-ray bursts**, M. Patel et.al., [2305.14491v1](http://arxiv.org/abs/2305.14491v1)\n\n GRB 201015A is a peculiarly low luminosity, spectrally soft gamma-ray burst (GRB), with $T\\_{\\rm 90} = 9.8 \\pm 3.5$ s (time interval of detection of 90\\% of photons from the GRB), and an associated supernova (likely to be type Ic or Ic-BL). GRB 201015A has an isotropic energy $E\\_{\\gamma,\\rm iso} = 1.75 ^{+0.60} \\_{-0.53} \\times 10^{50}$ erg, and photon index $\\Gamma = 3.00 ^{+0.50} \\_{-0.42}$ (15-150 keV). It follows the Amati relation, a correlation between $E\\_{\\gamma,\\rm iso}$ and spectral peak energy $E\\_{\\rm p}$ followed by long GRBs. It appears exceptionally soft based on $\\Gamma$, the hardness ratio of HR = $0.47 \\pm 0.24$, and low-$E\\_{\\rm p}$, so we have compared it to other GRBs sharing these properties. These events can be explained by shock breakout, poorly collimated jets, and off-axis viewing. Follow-up observations of the afterglow taken in the X-ray, optical, and radio, reveal a surprisingly late flattening in the X-ray from $t = (2.61 \\pm 1.27)\\times 10^4$ s to $t = 1.67 ^{+1.14} \\_{-0.65} \\times 10^6$ s. We fit the data to closure relations describing the synchrotron emission, finding the electron spectral index to be $p = 2.42 ^{+0.44} \\_{-0.30}$, and evidence of late-time energy injection with coefficient $q = 0.24 ^{+0.24} \\_{-0.18}$. The jet half opening angle lower limit ($\\theta\\_{j} \\ge 16^{\\circ}$) is inferred from the non-detection of a jet break. The launch of SVOM and Einstein Probe in 2023, should enable detection of more low luminosity events like this, providing a fuller picture of the variety of GRBs.\n\n", "2305.14476": "2023-05-23, **A Transient Overcooling in the Early Universe? Clues from Globular Clusters Formation**, Alvio Renzini et.al., [2305.14476v1](http://arxiv.org/abs/2305.14476v1)\n\n The mere existence of multiple stellar generations in Milky Way globular clusters indicates that each generation was unable to stop star formation, that instead persisted unimpeded for several million years. This evidence argues for an extended stage of star formation within a forming globular cluster, during which stellar feedback was substantially ineffective and the nascent globular cluster was able to accrete processed gas from its surrounding, and efficiently convert it into successive stellar generations. It has been argued that such delayed feedback results from core collapse in most massive stars failing to trigger an energetic supernova explosion, but rather leading directly to black hole formation. Thus, globular clusters offer a concrete phenomenological example for the lack of feedback in young starbursts, an option that has been widely advocated to account for the unexpected abundance of UV-luminous galaxies at z = 9-16, as revealed by JWST observations. The paper is meant to attract attention to this opportunity for a synergic cooperation of globular cluster and high redshift research.\n\n", "2305.14447": "2023-05-23, **Possible detection of the progenitor of the Type II supernova SN2023ixf**, Joanne L. Pledger et.al., [2305.14447v1](http://arxiv.org/abs/2305.14447v1)\n\n Stellar evolution theory predicts multiple pathways to the explosive deaths of stars as supernovae. Locating and characterizing the progenitors of well-studied supernovae is important to constrain the theory, and to justify and design future surveys to improve on progenitor detections. Here we report the serendipitous pre-explosion imaging, by the Hubble Space Telescope, of SN2023ixf, one of the nearest extragalactic supernovae ever discovered, in the galaxy M101. The extremely red color and absolute magnitude M(F814W)=-5.42+/-0.06mag suggest that the progenitor was a red supergiant and comparison with stellar evolutionary isochrones suggests a mass of ~12M\\_Sun.\n\n", "2305.14424": "2023-05-23, **Cloud Atlas: Navigating the Multiphase Landscape of Tempestuous Galactic Winds**, Brent Tan et.al., [2305.14424v1](http://arxiv.org/abs/2305.14424v1)\n\n Galaxies comprise intricate networks of interdependent processes which together govern their evolution. Central among these are the multiplicity of feedback channels, which remain incompletely understood. One outstanding problem is the understanding and modeling of the multiphase nature of galactic winds, which play a crucial role in galaxy formation and evolution. We present the results of three dimensional magnetohydrodynamical tall box interstellar medium patch simulations with clustered supernova driven outflows. Fragmentation of the interstellar medium during superbubble breakout seeds the resulting hot outflow with a population of cool clouds. We focus on analyzing and modeling the origin and properties of these clouds. Their presence induces large scale turbulence, which in turn leads to complex cloud morphologies. Cloud sizes are well described by a power law distribution and mass growth rates can be modelled using turbulent radiative mixing layer theory. Turbulence provides significant pressure support in the clouds, while magnetic fields only play a minor role. We conclude that many of the physical insights and analytic scalings derived from idealized small scale simulations translate well to larger scale, more realistic turbulent magnetized winds, thus paving a path towards their necessary yet challenging inclusion in global-scale galaxy models.\n\n", "2305.14421": "2023-05-23, **Are classification metrics good proxies for SN Ia cosmological constraining power?**, Alex I. Malz et.al., [2305.14421v1](http://arxiv.org/abs/2305.14421v1)\n\n Context: When selecting a classifier to use for a supernova Ia (SN Ia) cosmological analysis, it is common to make decisions based on metrics of classification performance, i.e. contamination within the photometrically classified SN Ia sample, rather than a measure of cosmological constraining power. If the former is an appropriate proxy for the latter, this practice would save those designing an analysis pipeline from the computational expense of a full cosmology forecast. Aims: This study tests the assumption that classification metrics are an appropriate proxy for cosmology metrics. Methods: We emulate photometric SN Ia cosmology samples with controlled contamination rates of individual contaminant classes and evaluate each of them under a set of classification metrics. We then derive cosmological parameter constraints from all samples under two common analysis approaches and quantify the impact of contamination by each contaminant class on the resulting cosmological parameter estimates. Results: We observe that cosmology metrics are sensitive to both the contamination rate and the class of the contaminating population, whereas the classification metrics are insensitive to the latter. Conclusions: We therefore discourage exclusive reliance on classification-based metrics for cosmological analysis design decisions, e.g. classifier choice, and instead recommend optimizing using a metric of cosmological parameter constraining power.\n\n", "2305.14305": "2023-05-23, **Observational Constraints on Yukawa Cosmology and Connection with Black Hole Shadows**, Esteban González et.al., [2305.14305v1](http://arxiv.org/abs/2305.14305v1)\n\n This research explores a cosmological model proposed in arXiv:2304.11492 by Jusufi et al., which challenges the existence of dark matter and proposes a connection between dark matter, dark energy, and baryonic matter by altering Newton's law of gravity in large-scale structures. The model is described by a Yukawa-like gravitational potential with the coupling parameter $\\alpha$ and wavelength parameter $\\lambda$. Utilizing observational data from Supernovae Ia and $H(z)$ within a $1\\sigma$ CL, the study determines the best-fit parameters, resulting in $\\lambda=2693\\_{-1262}^{+1191}\\, \\rm Mpc$, $\\alpha=0.416\\_{-0.326}^{+1.137}$, and a graviton mass of approximately $m\\_g \\simeq 10^{-69}$ kg. The research also establishes a direct connection between the dark matter/dark energy density parameters and the angular radius of the black hole shadow of the SgrA and M87 black holes in the low-redshift limit, which is consistent with the findings of the Event Horizon Telescope. This discovery holds significant importance in the paper, as it challenges the conventional understanding of the universe's composition and gravitational forces.\n\n", "2305.14262": "2023-05-23, **A partially stripped massive star in a Be binary at low metallicity: A missing link towards Be X-ray binaries and double neutron star mergers**, V. Ramachandran et.al., [2305.14262v1](http://arxiv.org/abs/2305.14262v1)\n\n Standard binary evolutionary models predict a significant population of core helium-burning stars that lost their hydrogen-rich envelope after mass transfer via Roche-lobe overflow. However, there is a scarcity of observations of such stripped stars in the intermediate mass regime (~1.5 - 8$ M\\_{\\odot}$), which are thought to be prominent progenitors of SN Ib/c. Especially at low metallicity, a significant fraction of these stars is expected to be only partially stripped, retaining a significant amount of hydrogen on their surfaces. For the first time, we discovered a partially stripped massive star in a binary with a Be-type companion located in the Small Magellanic Cloud (SMC) using a detailed spectroscopic analysis. The stripped-star nature of the primary is revealed by the extreme CNO abundance pattern and very high luminosity-to-mass ratio, which suggest that the primary is likely shell-hydrogen burning. Our target SMCSGS-FS 69 is the most luminous and most massive system among the known stripped star + Be binaries, with Mstripped ~3$ M\\_{\\odot}$ and MBe ~17$ M\\_{\\odot}$. Binary evolutionary tracks suggest an initial mass of Mini $\\gtrsim 12 M\\_{\\odot}$ for the stripped star and predict it to be in a transition phase towards a hot compact He star, which will eventually produce a stripped-envelope supernova. Our target marks the first representative of a so-far missing evolutionary stage in the formation pathway of Be X-ray binaries and double neutron star mergers.\n\n", "2305.13943": "2023-05-23, **Reeling in the Whirlpool: the distance to M 51 clarified by Cepheids and the Type IIP SN 2005cs**, G. Csörnyei et.al., [2305.13943v1](http://arxiv.org/abs/2305.13943v1)\n\n Despite being one of the best-known galaxies, the distance to the Whirlpool Galaxy, M 51, is still debated. Current estimates range from 6.02 to 9.09 Mpc, and different methods yield discrepant results. No Cepheid distance has been published for M 51 to date. We aim to estimate a more reliable distance to M 51 through two independent methods: Cepheid variables and their period-luminosity relation, and an augmented version of the expanding photosphere method (EPM) on the Type IIP SN 2005cs. For the Cepheid variables, we analyse a recently published HST catalogue of stars in M 51. By applying light curve and colour-magnitude diagram-based filtering, we select a high-quality sample of M 51 Cepheids to estimate the distance through the period-luminosity relation. For SN 2005cs, an emulator-based spectral fitting technique is applied, which allows for the fast and reliable estimation of physical parameters of the supernova atmosphere. We augment the established framework of EPM with these spectral models to obtain a precise distance to M 51. The two resulting distance estimates are D\\_Cep = 7.59 +/- 0.30 Mpc and D\\_2005cs = 7.34 +/- 0.39 Mpc using the Cepheid period-luminosity relation and the spectral modelling of SN 2005cs respectively. This is the first published Cepheid distance for this galaxy. Given that these two estimates are completely independent, one may combine them, which yields D\\_M51 = 7.50 +/- 0.24 Mpc (3.2% uncertainty). Our distance estimates are in agreement with most of the results obtained previously for M 51, while being more precise than the earlier counterparts. They are however significantly lower than the TRGB estimates, which are often adopted for the distance to this galaxy. The results highlight the importance of direct cross-checks between independent distance estimates for quantifying systematic uncertainties.\n\n", "2305.13912": "2023-05-23, **3D stellar evolution: hydrodynamic simulations of a complete burning phase in a massive star**, F. Rizzuti et.al., [2305.13912v1](http://arxiv.org/abs/2305.13912v1)\n\n Our knowledge of stellar evolution is driven by one-dimensional (1D) simulations. 1D models, however, are severely limited by uncertainties on the exact behaviour of many multi-dimensional phenomena occurring inside stars, affecting their structure and evolution. Recent advances in computing resources have allowed small sections of a star to be reproduced with multi-D hydrodynamic models, with an unprecedented degree of detail and realism. In this work, we present a set of 3D simulations of a convective neon-burning shell in a 20 M$\\_\\odot$ star run for the first time continuously from its early development through to complete fuel exhaustion, using unaltered input conditions from a 321D-guided 1D stellar model. These simulations help answer some open questions in stellar physics. In particular, they show that convective regions do not grow indefinitely due to entrainment of fresh material, but fuel consumption prevails over entrainment, so when fuel is exhausted convection also starts decaying. Our results show convergence between the multi-D simulations and the new 321D-guided 1D model, concerning the amount of convective boundary mixing to include in stellar models. The size of the convective zones in a star strongly affects its structure and evolution, thus revising their modelling in 1D will have important implications for the life and fate of stars. This will thus affect theoretical predictions related to nucleosynthesis, supernova explosions and compact remnants.\n\n", "2305.14400": "2023-05-23, **The Reconstruction of Constant Jerk Parameter with $f(R,T)$ Gravity in Bianchi-I spacetime**, Anirudh Pradhan et.al., [2305.14400v1](http://arxiv.org/abs/2305.14400v1)\n\n We have developed a Bianchi I cosmological model of the universe in $f(R,T)$ gravity theory which fit good with the present day scenario of accelerating universe. The model displays transition from deceleration in the past to the acceleration at the present. As in the $\\Lambda$CDM model, we have defined the three energy parameters $\\Omega\\_m$, $\\Omega\\_{\\mu}$ and $\\Omega\\_{\\sigma}$ such that $\\Omega\\_m$ + $\\Omega\\_{\\mu}$ + $\\Omega\\_{\\sigma}$ = 1. The parameter $\\Omega\\_m$ is the matter energy density (baryons + dark matter), $\\Omega\\_{\\mu}$ is the energy density associated with the Ricci scalar $R$ and the trace $T$ of the energy momentum tensor and $\\Omega\\_{\\sigma}$ is the energy density associated with the anisotropy of the universe. We shall call $\\Omega\\_{\\mu}$ dominant over the other two due to its higher value. We find that the $\\Omega\\_{\\mu}$ and the other two in the ratio 3:1. 46 Hubble OHD data set is used to estimate present values of Hubble $H\\_0$, deceleration $q\\_0$ and jerk $j$ parameters. 1$\\sigma$, 2$\\sigma$ and 3$\\sigma$ contour region plots for the estimated values of parameters are presented. 580 SNIa supernova distance modulus data set and 66 pantheon SNIa data which include high red shift data in the range $0\\leq z\\leq 2.36$ have been used to draw error bar plots and likelihood probability curves for distance modulus and apparent magnitude of SNIa supernova's. We have calculated the pressures and densities associated with the two matter densities, viz., $p\\_{\\mu}$, $\\rho\\_{\\mu}$, $p\\_m$ and $\\rho\\_m$, respectively. The present age of the universe as per our model is also evaluated and it is found at par with the present observed values.\n\n", "2305.14399": "2023-05-23, **Type Ia Supernovae Induced by Primordial Black Holes from Dark First-Order Phase Transition**, Pin-Jung Chen et.al., [2305.14399v1](http://arxiv.org/abs/2305.14399v1)\n\n A primordial black hole (PBH) with mass $10^{-15}\\leq M\\_{\\rm PBH}/M\\_{\\odot}\\leq 10^{-10}$ is currently beyond the sensitivity of both microlensing and black hole (BH) evaporation methods. A novel scenario has been proposed: When a PBH with mass $10^{-14}\\leq M\\_{\\rm PBH}/M\\_{\\odot}\\leq 10^{-11}$ transits through a white dwarf (WD) made up of carbon and oxygen, Bondi-Hoyle-Lyttleton (BHL) accretion in a reactive medium creates a shock wave, which generates direct detonation ignition in the WD core and then leads to thermonuclear supernovae (SNe Ia). The aim of this study is to impose constraints on the PBH to dark matter (DM) abundance fraction, $f\\_{\\rm PBH}$, via comparing the SN Ia event rates between PBH hypotheses and observational data. For PBH fraction less than unity, we found the observed event rate prefers PBH mass region, $7.6\\times 10^{-13}\\leq M\\_{\\rm PBH}/M\\_{\\odot}\\leq 6.1\\times 10^{-12}$, under the Navarro-Frenk-White (NFW) profile. Meanwhile, the aforementioned PBH mass and abundance can be efficiently produced via a cosmological first-order phase transition (FOPT) in dark sector which associates with $\\mathcal{O}({\\rm MeV})$ energy scale and thus gives rise to complementary signals of stochastic gravitational waves (GWs) from $10^{-6}$ Hz to $10^{-5}$ Hz peak frequency which can be probed by future $\\mu$Ares GW interferometer.\n\n"}}