{"neutrino": {"2311.11968": "2023-11-20, **Neutrino fast flavor oscillations with moments: linear stability analysis and application to neutron star mergers**, Julien Froustey et.al., [2311.11968v1](http://arxiv.org/abs/2311.11968v1)\n\n Providing an accurate modeling of neutrino physics in dense astrophysical environments such as binary neutron star mergers presents a challenge for hydrodynamic simulations. Nevertheless, understanding how flavor transformation can occur and affect the dynamics, the mass ejection, and the nucleosynthesis will need to be achieved in the future. We introduce a study of fast flavor oscillations based on a linear stability analysis using the first angular moments of the neutrino distributions, which are the quantities frequently evolved in computationally expensive, large-scale simulations. Such a method requires generalizing the classical closure relations that appropriately truncate the hierarchy of moment equations to treat quantum flavor coherence. After showing the efficiency of this method on a well-understood test situation, we perform a systematic search of the occurrence of fast flavor instabilities in a neutron star merger simulation. We discuss the successes and shortcomings of moment linear stability analysis, as this framework provides a time-efficient way to design and study better closure prescriptions in the future.\n\n", "2311.11875": "2023-11-20, **Neutrino Oscillations in Finite Time Path Out-of-Equilibrium Thermal Field Theory**, Ivan Dadić et.al., [2311.11875v1](http://arxiv.org/abs/2311.11875v1)\n\n We demonstrate that the Finite-Time-Path Field Theory is an adequate tool for calculating neutrino oscillations. We apply this theory using a mass-mixing Lagrangian which involves the correct Dirac spin and chirality structure and a Pontecorvo-Maki-Nakagawa-Sakata (PMNS)-like mixing matrix. The model is exactly solvable. The Dyson-Schwinger equations transform propagators of the input free (massless) flavor neutrinos into a linear combination of oscillating (massive) neutrinos. The results are consistent with the predictions of the PMNS matrix while allowing for extrapolation to early times.\n\n", "2311.11857": "2023-11-20, **Flipped SU(5): unification, proton decay, fermion masses and gravitational waves**, Stephen F. King et.al., [2311.11857v1](http://arxiv.org/abs/2311.11857v1)\n\n We study supersymmetric (SUSY) flipped $SU(5)\\times U(1)$ unification, focussing on its predictions for proton decay, fermion masses and gravitational waves. We performed a two-loop renormalisation group analysis and showed that the SUSY flipped $SU(5)$ model predicts a high GUT scale $M\\_{\\rm GUT} > 10^{16}$ GeV. We also investigated the restrictions on the $M\\_{B-L}$ scale which is associated with the $U(1)\\_{\\chi}$ breaking scale. We found that the $M\\_{B-L}$ scale can vary in a broad region with negligible or little effect on the value of $M\\_{\\rm GUT}$. Proton decay in this model is induced by dimension-6 operators only. The dimension-5 operator induced by SUSY contribution is suppressed due to the missing partner mechanism. We found that the partial decay width $p \\to \\pi^0 e^+$ is high suppressed, being at least one order of magnitude lower than the future Hyper-K sensitivity. We also studied fermion (including neutrino) masses and mixings which can also influence proton decay. We presented two scenarios of flavour textures to check the consistency of the results with fermion masses and mixing. The $B-L$ gauge breaking leads to the generation of cosmic strings. The $B-L$ scale here is not constrained by gauge coupling unification. If this scale is very close that of GUT breaking, strings can be unstable due to the decay to monopole-antimonople pair. Such metastable strings can be used to explain the NANOGrav signals of stochastic gravitational wave background, which may be interpreted here as resulting from the decay of metastable cosmic strings.\n\n", "2311.11611": "2023-11-20, **$\\boldsymbol{Δ(54)}$ Flavor model for Majorana neutrinos with Inverse Seesaw Mechanism**, Hrishi Bora et.al., [2311.11611v1](http://arxiv.org/abs/2311.11611v1)\n\n The present study entails the augmentation of the $\\Delta$(54) flavor symmetry model by including the ISS mechanism by two Standard Model Higgs particles, achieved by the inclusion of different flavons. The matrices are discussed numerically in the framework of the $\\Delta(54)$ flavor model with the ISS mechanism for Majorana neutrinos. We introduced Vector like (VL) fermions and a Weyl fermion, which are gauge singlets in the Standard Model. We restrict the undesirable terms in our Lagrangian using additional symmetry. Due to the addition of additional flavons, the precise tribimaximal neutrino mixing pattern deviates, resulting in the creation of a non-zero reactor angle $\\theta\\_{13}$. We found that the atmospheric oscillation parameter ($\\theta\\_{23}$) occupies the upper octant under the normal hierarchy situation. We also study the CP violation ($\\delta\\_{CP}$) , Jarlskog invariant parameter ($J$), and Neutrinoless double-beta decay parameter ($m\\_{ee}$) in the parameter space of the normal hierarchy model to see whether they accord with the most recent neutrino observations.\n\n"}, "dark matter": {"2311.11998": "2023-11-20, **The stellar bar - dark matter halo connection in the TNG50 simulations**, Sioree Ansar et.al., [2311.11998v1](http://arxiv.org/abs/2311.11998v1)\n\n Stellar bars in disk galaxies grow by losing angular momentum to their environments, including the Dark Matter (DM) halo, stellar and gas disks, and interacting satellite galaxies. This exchange of angular momentum during galaxy evolution hints at a connection between bar properties and the DM halo spin $\\lambda$ -- the dimensionless form of DM angular momentum. We investigate the connection of halo spin $\\lambda$ and galaxy properties in the presence/absence of stellar bars, using the cosmological magneto-hydrodynamic TNG50 simulations at three redshifts $z\\_r=0, 0.1$ and 1. We estimate the halo spin for barred and unbarred galaxies (bar strength: $0<A\\_2/A\\_0<0.7$) at the central regions of the DM halo close to the galaxy disk and far from the disk, close to halo virial radius. At $z\\_r=0$, strongly barred galaxies ($A\\_2/A\\_0>0.4$) reside in DM halos having low spin and low specific angular momentum, while unbarred and weakly barred galaxies ($A\\_2/A\\_0<0.2$) are hosted in high spin and high specific angular momentum halos. The inverse correlation between bar strength and halo spin is surprising since previous studies show that bars transfer angular momentum to DM halos. However, the bar strength-halo spin connection is more complex at higher redshift ($z\\_r=1$) with higher halo spin for all galaxies than that at $z\\_r=0$. Using galaxy samples across various DM halo mass ranges, we highlight the importance of sample selection in obtaining meaningful results. Investigating the bar--halo connection in further detail is crucial for understanding the impact of bars on galaxy evolution models.\n\n", "2311.11975": "2023-11-20, **Black Hole Phenomenology and Dark Matter Searches**, Francesca Scarcella et.al., [2311.11975v1](http://arxiv.org/abs/2311.11975v1)\n\n Motivated by recent detections of black hole binary systems through gravitational waves, in this thesis we discuss two complementary channels for the observation of Primordial Black Holes (PBHs) with masses between a few and a hundred solar masses. First, we consider the possibility of detecting black holes in the Milky Way through the electromagnetic radiation emitted in the process of gas accretion, separately examining the astrophysical black hole population and an hypothetical primordial one. We employ a state-of-the-art accretion model, able to account for radiative feedback. Our findings suggest that the detection of astrophysical isolated black holes in the vicinity of the galactic center is around the corner. We perform a complete parametric study of the uncertainty associated with this prediction. We then turn to constraining PBH abundance through the same channel, finding that existing bounds can be significantly relaxed when modelling uncertainties are taken into account. The PBH mass function motivated by the Universe's thermal history is considered. In the second part, we turn to gravitational wave observations. The possibility of disentangling the astrophysical background form a possible primordial signal in present data is hampered by large theoretical uncertainties on the properties of both populations. However, third-generation gravitational wave detectors will be able to detect mergers up to the dark ages, where the astrophysical background is expected to be absent. Through mock data generation and analysis, we assess the ability of the Einstein Telescope (ET) to identify a subdominant population of PBHs, disentangling it from the astrophysical one based exclusively on event distance measurements. We find that the ET should be able to detect and constrain the PBH abundance if these constitute at least approximately one part in $10^5$ of the dark matter.\n\n", "2311.11930": "2023-11-20, **Phonon dynamics for light dark matter detection**, Martí Raya-Moreno et.al., [2311.11930v1](http://arxiv.org/abs/2311.11930v1)\n\n The search for low-mass dark matter (DM) goes in parallel with the identification of new detection channels and the development of suitable detectors. Detection of the resulting small energy depositions is challenging: it requires extremely high sensitivity, only achievable by cryogenic thermal detectors, which might be put to the limit. Understanding the processes which can limit performances of these detectors can be thus crucial for evaluating the feasibility of the proposed new detection schemes and to design the detectors and tune their performance. In this paper we focus on a promising detection scheme, the excitation of single optical phonons in polar materials, to evaluate one of the possible limiting factors of cryogenic thermal detectors, i.e. the phonon dynamics in the target/absorber. We present a detailed theoretical analysis, within an entirely ab initio scheme, of the downconversion and propagation processes undergone by optical phonons, created by the interaction of a low-mass DM particle in an Al2O3 target, until they reach the interface with a phonon Al collector. After a preliminary methodological survey that reveals the limitations of any Relaxation Time Approximation based method, we developed a 3D beyond-RTA phonon Monte Carlo that allowed us to introduce the spatial dimension of the device and address questions about impact of target size and scattering position. We analyse also the effect of the phonon energy and wavevector and show that isotopes can, perhaps counterintuitively, result in a larger heat flux by providing transport channels of higher velocities, thus favoring detection. Our results suggest that, though challenging, the direct detection of light DM via athermal phonon generation appears feasible, and that the phonon downconversion followed by quasi-ballistic propagation does not appear to be a major bottleneck in terms of reducing the signal.\n\n", "2311.11840": "2023-11-20, **An implementation of nDGP gravity in Pinocchio**, Yanling Song et.al., [2311.11840v1](http://arxiv.org/abs/2311.11840v1)\n\n In this paper we investigate dark matter structure formation in the normal branch of the Dvali-Gabadadze-Porrati (nDGP) model using the PINOCCHIO algorithm. We first present 2nd order Lagrangian perturbation theory for the nDGP model, which shows that the 1st- and 2nd-order growth functions in nDGP are larger than those in {\\Lambda}CDM. We then examine the dynamics of ellipsoidal collapse in nDGP, which is accelerated compared to {\\Lambda}CDM due to enhanced gravitational interactions. Running the nDGP-PINOCCHIO code with a box size of 512 Mpc/h and 1024*1024*1024 particles, we analyze the statistical properties of the output halo catalogs, including the halo power spectrum and halo mass function. The calibrated PINOCCHIO halo power spectrum agrees with N-body simulations within 5% in the comoving wavenumber range k < 0.3 (h/Mpc) at redshift z = 0. The agreement is extended to smaller scales for higher redshifts. For the cumulative halo mass function, the agreement between N-body and PINOCCHIO is also within the simulation scatter.\n\n", "2311.11713": "2023-11-20, **A two-phase model of galaxy formation: II. The size-mass relation of dynamically hot galaxies**, Yangyao Chen et.al., [2311.11713v1](http://arxiv.org/abs/2311.11713v1)\n\n In Paper-I we developed a two-phase model to connect dynamically hot galaxies (such as ellipticals and bulges) with the formation of self-gravitating, turbulent gas clouds (SGC) associated with the fast assembly of dark matter halos. Here we explore the implications of the model for the size-stellar mass relation of dynamically hot galaxies. Star-forming sub-clouds produced by the fragmentation of the SGC inherit its spatial structure and dynamical hotness, which produces a tight and 'homologous' relation, $r\\_{\\rm f}\\approx\\, 100 r\\_{\\rm bulge}$, between the size of a dynamically hot galaxy ($r\\_{\\rm bulge}$) and that of its host halo assembled in the fast assembly regime ($r\\_{\\rm f}$), independent of redshift and halo mass. This relation is preserved by the 'dry' expansion driven by dynamical heating when a galaxy becomes gas-poor due to inefficient cooling, and is frozen during the slow assembly regime when the bulge stops growing in mass and dynamical heating is no longer effective. The size-stellar mass relation is thus a simple combination of the galaxy-halo homology and the non-linear relation between stellar mass and halo mass. Using a set of halo assembly histories we demonstrate that this model can reproduce all properties in the observed size-mass relation of dynamically hot galaxies, including the flattening of the relation in the low-mass end and the upturn in the very massive end. The predicted evolution of this relation matches observational data currently available to redshift $z \\approx 4$, and can be tested in the future at higher $z$. Our results indicate that the sizes of dynamically hot galaxies are produced by the dissipation and collapse of gas in dark matter halos to establish self-gravitating systems of sub-clouds in which stars form.\n\n", "2311.11660": "2023-11-20, **Axion dark matter (theory & experiment)**, Andreas Ringwald et.al., [2311.11660v1](http://arxiv.org/abs/2311.11660v1)\n\n We review the motivation for the axion as a solution of the strong CP puzzle and as a candidate for cold dark matter. Then we discuss benchmark axion models and present their predictions concerning axion couplings to the Standard Model and axion dark matter abundance. Finally, we give an overview on the discovery potential of current and planned axion experiments, reaching from axion dark matter direct detection, over searches for solar axions, to direct production and detection of axions in the laboratory.\n\n", "2311.11632": "2023-11-20, **Quantum entanglement of ions for light dark matter detection**, Asuka Ito et.al., [2311.11632v1](http://arxiv.org/abs/2311.11632v1)\n\n A detection scheme is explored for light dark matter, such as axion dark matter or dark photon dark matter, using a Paul ion trap system. We first demonstrate that a qubit, constructed from the ground and first excited states of vibrational modes of ions in a Paul trap, can serve as an effective sensor for weak electric fields due to its resonant excitation. As a consequence, a Paul ion trap allows us to search for weak electric fields induced by light dark matter with masses around the neV range. Furthermore, we illustrate that an entangled qubit system involving $N$ ions can enhance the excitation rate by a factor of $N^2$. The sensitivities of the Paul ion trap system to axion-photon coupling and gauge kinetic mixing can reach previously unexplored parameter space.\n\n", "2311.11584": "2023-11-20, **Dark Matter Subhalo Evaporation by Coulomb-like Interaction with Galactic Gas**, Yugen Lin et.al., [2311.11584v1](http://arxiv.org/abs/2311.11584v1)\n\n Coulomb-like interactions typically has a cross section scales with velocity dependence as $\\sigma=\\sigma\\_0 v^{-4}$. The momentum transfer rate between a slightly charged dark matter and ionized particles increases significantly at low velocity, and it produces prominent evaporation effects on small-sized dark matter overdensities. We show that when subhalos encounter the hot gases near the Milky Way's disc, their survival can place stringent limits on Coulomb-like scattering strength. For $M<10^5 M\\_\\odot$ subhalos to survive a kilo-parsec distance from the galactic center, with a dark matter mass in the sub-GeV range, the evaporation limit becomes one order of magnitude stronger than the limits from current cosmic microwave background and baryon acoustic oscillation data. We also interpret our bounds into the electron-recoil direct detection cross section, and show that the evaporation effect can lead to a stronger constraint on Coulomb-like interaction for sub-MeV dark matter in comparison with direct detection experiments.\n\n"}, "supernova": {}}