{"neutrino": {"2310.10394": "2023-10-16, **Nuclear deexcitation simulator for neutrino interactions and nucleon decays of $^{12}\\text{C}$ and $^{16}\\text{O}$ based on TALYS**, Seisho Abe et.al., [2310.10394v1](http://arxiv.org/abs/2310.10394v1)\n\n Nuclear deexcitation associated with neutrino interactions and nucleon decays has a significant impact on a recent key observable for neutrino detectors: neutron multiplicity. However, most existing neutrino Monte Carlo event generators do not consider this process. For a comprehensive prediction of the neutron multiplicity, a nuclear deexcitation simulator based on TALYS named NucDeEx is developed. NucDeEx can be used for neutrino interactions and nucleon decayes for $^{12}\\text{C}$ and $^{16}\\text{O}$. The author provides the NucDeEx codes and sample codes for applying the NucDeex to widely-used neutrino Monte Carlo event generators, NEUT, NuWro, and GENIE.\n\n", "2310.10206": "2023-10-16, **TANAMI: Tracking Active Galactic Nuclei with Austral Milliarcsecond Interferometry. III. First-epoch S band images**, Petra Benke et.al., [2310.10206v1](http://arxiv.org/abs/2310.10206v1)\n\n With the emergence of very high energy astronomy (VHE; E>100 GeV), new open questions were presented to astronomers studying the multi-wavelength emission from blazars. Answers to these open questions, such as the Doppler crisis, and finding the location of the high-energy activity have eluded us thus far. Recently, quasi-simultaneous multi-wavelength monitoring programs have shown considerable success in investigating blazar activity. After the launch of the Fermi Gamma-ray Space Telescope in 2008, such quasi-simultaneous observations across the electromagnetic spectrum became possible. In addition, with very long baseline interferometry (VLBI) observations we can resolve the central parsec region of active galactic nuclei (AGN) and compare morphological changes to the gamma-ray activity to study high-energy emitting blazars. To achieve our goals, we need sensitive, long-term VLBI monitoring of a complete sample of VHE detected AGN. We performed VLBI observations of TeV-detected AGN and high likelihood neutrino associations as of December of 2021 with the Long Baseline Array (LBA) and other southern hemisphere radio telescopes at 2.3 GHz. In this paper we present first light TANAMI S-band images, focusing on the TeV-detected sub-sample of the full TANAMI sample. Apart from these very high energy-detected sources, we also show images of the two flux density calibrators and two additional sources included in the observations. We study the redshift, 0.1-100 GeV photon flux and S-band core brightness temperature distributions of the TeV-detected objects, and find that flat spectrum radio quasars and low synchrotron peaked sources on average show higher brightness temperatures than high-synchrotron-peaked BL Lacs. Sources with bright GeV gamma-ray emission also show higher brightness temperature values than gamma-low sources.\n\n", "2310.10140": "2023-10-16, **Constraining Ultralight Axions with CSST Weak Gravitational Lensing and Galaxy Clustering Photometric Surveys**, Hengjie Lin et.al., [2310.10140v1](http://arxiv.org/abs/2310.10140v1)\n\n Ultralight axion (ULA) can be one of the potential candidates for dark matter. The extremely low mass of the ULA can lead to a de Broglie wavelength around galaxy-size, and result in a suppression of the structure growth at small scales. This allows us to study its properties via galaxy surveys for probing cosmic structure formation. In this work, we forecast the constraint on the ULA particle mass $m\\_{\\text{a}}$ and relative fraction to dark matter $f\\_{\\text{a}} = \\Omega\\_{\\text{a}}/\\Omega\\_{\\text{d}}$ for the forthcoming Stage IV space-based optical survey equipment $\\it{CSST}$ (China Space Station Telescope). We focus on the $\\it{CSST}$ cosmic shear and galaxy clustering photometric surveys, and forecast the measurements of shear, galaxy, and galaxy-galaxy lensing power spectra (i.e. 3$\\times$2pt). The effects of neutrino, baryonic feedback, and uncertainties of intrinsic alignment, shear calibration, galaxy bias, and photometric redshift are also included in the analysis. After performing a joint constraint on all the cosmological and systematical parameters using Markov Chain Monte Carlo (MCMC) technique, we obtain a lower limit of the ULA particle mass $\\text{log}\\_{10}(m\\_{\\text{a}}/\\text{eV}) \\geqslant -22.5$ and an upper limit of the ULA fraction $f\\_{\\text{a}} \\leqslant 0.83$ at 95\\% confidence level, and $\\text{log}\\_{10}(m\\_{\\text{a}}/\\text{eV}) \\geqslant -21.9$ with $f\\_{\\text{a}} \\leqslant 0.77$ when ignoring the baryonic feedback. We find that the CSST photometric surveys can improve the constraint on the ULA mass by about one order of magnitude, compared to the current constraints using the same kind of observational data.\n\n", "2310.10034": "2023-10-16, **$N_{\\rm eff}$ as a new physics probe in the precision era of cosmology**, Yong Du et.al., [2310.10034v1](http://arxiv.org/abs/2310.10034v1)\n\n We perform a global fit to the electroweak vertices and 4-fermion operators of the standard model effective field theory in this work using $N\\_{\\rm eff}$ from cosmological probes, as well as data sets from colliders and low-energy experiments. Assuming flavor universality for both leptons and quarks, we find $N\\_{\\rm eff}$ from CMB-S4/HD can improve the fit for several operators by a factor of a few. Without making any flavor assumption instead, $N\\_{\\rm eff}$ can probe a different direction compared with the well-known flat one presented in the neutrino trident process in the $4\\mu$ sector. Fresh sensitivity to two extra operators in the $\\tau$ sector is also identified at the 10% level. In addition, we find reducing the uncertainty in primordial helium abundance from metal-poor galaxies down below 0.2% could play an important role in deepening our understanding on the free neutron lifetime anomaly.\n\n", "2310.09934": "2023-10-15, **Secular Outflows from Long-Lived Neutron Star Merger Remnants**, David Radice et.al., [2310.09934v1](http://arxiv.org/abs/2310.09934v1)\n\n We study mass ejection from a binary neutron star merger producing a long-lived massive neutron star remnant with general-relativistic neutrino-radiation hydrodynamics simulations. In addition to outflows generated by shocks and tidal torques during and shortly after the merger, we observe the appearance of a wind driven by spiral density waves in the disk. This spiral-wave-driven outflow is predominantly located close to the disk orbital plane and have a broad distribution of electron fractions. At higher latitudes, a high electron-fraction wind is driven by neutrino radiation. The combined nucleosynthesis yields from all the ejecta components is in good agreement with Solar abundance measurements.\n\n", "2310.09855": "2023-10-15, **Long Baseline Neutrino Oscillation Results (T2K and NOvA)**, Son Cao et.al., [2310.09855v1](http://arxiv.org/abs/2310.09855v1)\n\n The well-established neutrino oscillation phenomenon, which confirms neutrinos have mass and the charged and neutral leptons are mixed, has been widely exploited to investigate the physics of this elusive particle. The complete description of neutrino oscillations, which are dictated by two mass-squared splittings, three mixing angles, and one Dirac CP-violation phase, however, has yet to be reached. The ongoing accelerator-based long-baseline neutrino experiments, T2K and NOvA, are critical in completing this picture. Using data and analyses accessible by summer 2023, T2K favors a leptonic CP violation at more than 90\\% C.L. while NOvA shows no preference of this indication. Both experiments weakly opt for the \\emph{normal} neutrino mass ordering and higher octant of the $\\theta\\_{23}$ mixing angle.\n\n"}, "dark matter": {"2310.10646": "2023-10-16, **Exploring spin of ultralight dark matter with gravitational wave detectors**, Yusuke Manita et.al., [2310.10646v1](http://arxiv.org/abs/2310.10646v1)\n\n We propose a novel method for distinguishing the spin of ultralight dark matter (ULDM) using interferometric gravitational wave detectors. ULDM can be a bosonic field of spin-0, 1, or 2, and each induces distinctive signatures in signals. We find that the finite-time traveling effect causes a dominant signal for spin-0 and spin-1 ULDM, while not for spin-2. By using overlap reduction functions (ORF) of multiple detectors, we can differentiate between the spins of ULDM. Furthermore, we point out that the current constraint on the coupling constant of spin-1 ULDM to baryons becomes 30 times weaker when the finite-time light-travel effect on the ORF is taken into account.\n\n", "2310.10421": "2023-10-16, **MHz to TeV expectations from scotogenic WIMP dark matter**, Laura Eisenberger et.al., [2310.10421v1](http://arxiv.org/abs/2310.10421v1)\n\n The indirect search for dark matter is typically restricted to individual photon bands and instruments. In the context of multiwavelength observations, finding a weak signal in large fore- and backgrounds at only one wavelength band is hampered by systematic uncertainties dominating the signal strength. Dark matter particle annihilation is producing Standard Model particles of which the prompt photon emission is searched for in many studies. However, also the secondary emission of charged particles from dark matter annihilation in the TeV range results in comparable or even stronger fluxes in the GHz-GeV range. In this study, we calculate the prompt and secondary emission of a scotogenic WIMP with a mass of $1\\,\\mathrm{TeV}$ in 27 dwarf galaxies of the Milky Way. For the secondary emission, we include Inverse Compton scattering, bremsstrahlung, and synchrotron radiation, which results in a \"triple hump\" structure characteristic for only dark matter and no other astrophysical source. In order to determine the best candidates for multi-instrument analyses, we estimate the diffuse emission component of the Milky Way itself, including its own dark matter halo from the same scotogenic WIMP model. We find signal-to-background ratios of individual sources on the order of $10^{-3}$-$10^{-2}$ across X- to $\\gamma$-rays assuming $J$-factors for the cold dark matter distribution inferred from observations and no additional boosting due to small-scale clumping. We argue that a joint multi-wavelength analysis of all nearby galaxies as well as the extension towards the Cosmic Gamma-ray Background is required to disentangle possible dark matter signals from astrophysical back- and foregrounds.\n\n", "2310.10225": "2023-10-16, **Measuring the Milky Way Vertical Potential with the Phase Snail in a Model Independent Way**, Rui Guo et.al., [2310.10225v1](http://arxiv.org/abs/2310.10225v1)\n\n The vertical phase-space spiral (snail) is a direct sign of dis-equilibrium of Milky Way's disc. Nevertheless, the wrapping of the phase snail contains information of the vertical potential. We propose a novel method to measure the vertical potential utilizing the intersections between the snail and $z$/$V\\_{z}$ axes, for which we know the maximum vertical heights ($Z\\_{max}$) or the maximum vertical velocities ($V\\_{z,max}$). Using a refined linear interpolation method, we directly obtain $(Z\\_{max},\\ \\frac{1}{2}V\\_{z,max}^{2})$ for these snail intersections to constrain the vertical potential profile empirically. Our method is model independent since no assumptions about the snail shape or the vertical potential have been made. Although the snail binned by the guiding center radius ($R\\_{g}$) is more prominent, it traces a vertical potential shallower than that of the snail binned by the same Galactocentric radius ($R$). We apply an empirical method to correct this difference. We measure the snail intersections in several $R\\_{g}$ bins within $7.5< R\\_{g} < 11.0$ kpc for Gaia DR3, and apply the interpolation method to deduce the potential values at several vertical heights. The potential at the snail intersections, as well as the following mass modeling are consistent with the popular Milky Way potentials in the literature. For the $R\\_{g}$-binned phase snail in the Solar neighborhood, the mass modeling indicates a local dark matter density of $\\rho\\_{\\rm dm}= 0.0150\\pm0.0031$ $\\rm M\\_{\\odot}\\,pc^{-3}$, consistent with previous works. Our method could be applied to larger radial ranges in future works, to provide independent and stronger constraints on the Milky Way's potential.\n\n", "2310.10144": "2023-10-16, **Cosmology based on entropy**, Yu. L. Bolotin et.al., [2310.10144v1](http://arxiv.org/abs/2310.10144v1)\n\n At present, there is practically no doubt that general relativity is closely related to gravity. Moreover, after the work of Jacobson, Padmanabhan and others, it became clear that a thermodynamic interpretation of Einstein's relativistic equations is possible. On the other hand, we are witnessing the conceptual problems of the SCM (the problem of the cosmological constant, the problem of coincidences) and many years of futile attempts to directly fix the main components of the model (dark energy and dark matter). The combination of these two factors gave rise to a natural desire, at least at the phenomenological level, to build a cosmological model that represents the synthesis of gravity and thermodynamics and does not include components of an unknown nature. It is this model\\`uentropic cosmology\\`uthat is considered in this review. We have set as our goal, omitting the details that can be found in the references given, to present the conceptual foundations of the model.\n\n", "2310.09910": "2023-10-15, **Till the core collapses: the evolution and properties of self-interacting dark matter subhalos**, Zhichao Carton Zeng et.al., [2310.09910v1](http://arxiv.org/abs/2310.09910v1)\n\n One of the hottest questions in the cosmology of self-interacting dark matter (SIDM) is whether scatterings can induce detectable core-collapse in halos by the present day. Because gravitational tides can accelerate core-collapse, the most promising targets to observe core-collapse are satellite galaxies and subhalo systems. However, simulating small subhalos is computationally intensive, especially when subhalos start to core-collapse. In this work, we present a hierarchical framework for simulating a population of SIDM subhalos, which reduces the computation time to linear order in the total number of subhalos. With this method, we simulate substructure lensing systems with multiple velocity-dependent SIDM models, and show how subhalo evolution depends on the SIDM model, subhalo mass and orbits. We find that an SIDM cross section of $\\gtrsim 200$ cm$^2$/g at velocity scales relevant for subhalos' internal heat transfer is needed for a significant fraction of subhalos to core-collapse in a typical lens system at redshift $z=0.5$, and that core-collapse has unique observable features in lensing. We show quantitatively that core-collapse in subhalos is typically accelerated compared to field halos, except when the SIDM cross section is non-negligible ($\\gtrsim \\mathcal{O}(1)$ cm$^2$/g) at subhalos' orbital velocities, in which case evaporation by the host can delay core-collapse. This suggests that substructure lensing can be used to probe velocity-dependent SIDM models, especially if line-of-sight structures (field halos) can be distinguished from lens-plane subhalos. Intriguingly, we find that core-collapse in subhalos can explain the recently reported ultra-steep density profiles of substructures found by lensing with the \\emph{Hubble Space Telescope}\n\n", "2310.09898": "2023-10-15, **Monochromatic Mass Spectrum of Primordial Black Holes**, Matthew Kleban et.al., [2310.09898v1](http://arxiv.org/abs/2310.09898v1)\n\n During slow-roll inflation, non-perturbative transitions can produce bubbles of metastable vacuum. These bubbles expand exponentially during inflation to super-horizon size, and later collapse into black holes when the expansion of the universe is decelerating. In a broad class of models, the inflationary fine-tuning that gives rise to small density fluctuations causes these bubbles to appear only during a time interval that is short compared to the inflationary Hubble time. As a result, despite the fact that the final mass of the black hole is exponentially sensitive to the moment bubbles form during inflation, the resulting primordial black hole mass spectrum can be nearly monochromatic. If the transition occurs near the middle of inflation, the mass can fall in the \"asteroid\" range 10^17-10^22 g in which all known observations are compatible with black holes comprising 100% of dark matter.\n\n", "2310.09798": "2023-10-15, **Mitigating Cosmological Tensions via Momentum-Coupled Dark Sector Model**, Gang Liu et.al., [2310.09798v1](http://arxiv.org/abs/2310.09798v1)\n\n In this paper, we investigate the momentum coupling between early dark energy (EDE) and cold dark matter to alleviate cosmological tensions. EDE has exhibited promising efficacy in addressing the Hubble tension, but it exacerbates the large-scale structure tension. We consider the interaction between EDE and cold dark matter, introducing a pure momentum exchange between them to alleviate the large-scale structure tension introduced by the EDE model. We find that this coupling model is consistent with the EDE model, yielding a higher value for $H\\_0$, which can resolve the Hubble tension. Additionally, the new model exhibits a suppressive effect on structure growth, contributing to the alleviation of the large-scale structure tension. By utilising the Markov Chain Monte Carlo method and incorporating various cosmological data, the coupling model constrains the best-fit values for $H\\_0$ to be $72.23$ km/s/Mpc and for $S\\_8$ to be 0.8192. Compared to the $\\Lambda$CDM model, the new models have not fully resolved the large-scale structure tension. However, in contrast to the best-fit value of 0.8316 for $S\\_8$ obtained from the EDE model, the new model alleviates the negative impact of the EDE model.\n\n"}, "supernova": {"2310.10589": "2023-10-16, **Delayed Massive-Star Mechanical Feedback at Low Metallicity**, Michelle C. Jecmen et.al., [2310.10589v1](http://arxiv.org/abs/2310.10589v1)\n\n The classical model of massive-star mechanical feedback is based on effects at solar metallicity (Zsun), yet feedback parameters are very different at low metallicity. Metal-poor stellar winds are much weaker, and more massive supernova progenitors likely collapse directly to black holes without exploding. Thus, for ~0.4 Zsun we find reductions in the total integrated mechanical energy and momentum of ~40% and 75%, respectively, compared to values classically expected at solar metallicity. But in particular, these changes effectively delay the onset of mechanical feedback until ages of ~10 Myr. Feedback from high-mass X-ray binaries could slightly increase mechanical luminosity between ages 5-10 Myr, but it is stochastic and unlikely to be significant on this timescale. Stellar dynamical mechanisms remove most massive stars from clusters well before 10 Myr, which would further promote this effect; this process is exacerbated by gas retention implied by weak feedback. Delayed mechanical feedback implies that radiation feedback therefore dominates at early ages, which is consistent with the observed absence of superwinds in some extreme starbursts. This scenario may lead to higher star-formation efficiencies, multiple stellar populations in clusters, and higher Lyman continuum escape. This could explain the giant star-forming complexes in metal-poor galaxies and the small sizes of OB superbubble shells relative to their inferred ages. It could also drive modest effects on galactic chemical evolution, including on oxygen abundances. Thus, delayed low-metallicity mechanical feedback may have broad implications, including for early cosmic epochs.\n\n", "2310.10454": "2023-10-16, **Searching for X-Ray Counterparts of Degree Wide TeV Halos Around Middle-Aged Pulsars with SRG/eROSITA**, A. Khokhriakova et.al., [2310.10454v1](http://arxiv.org/abs/2310.10454v1)\n\n Context. Extended gamma-ray TeV emission (TeV halos) around middle-aged pulsars has been detected. A proposed model to explain these TeV halos is that electrons from a degree-wide Pulsar Wind Nebula (PWN) get up-scattered by cosmic microwave background photons through inverse Compton processes. However, no X-ray degree-wide faint diffuse PWNe have been found around these middle-aged pulsars in previous X-ray observations.   Aims. We have performed a search for degree wide PWNe around Geminga, PSR B0656+14, B0540+23, J0633+0632, and J0631+1036, using data from the first four consecutive Spectrum Roentgen Gamma/eROSITA all-sky surveys. In order to better understand the mechanisms underlying the formation of TeV halos, we investigated the magnetic field strength in the degree wide neighbourhood of those pulsars.   Results. We did not detect degree-wide diffuse emission around Geminga, PSR B0656+14, B0540+23, J0633+0632, and J0631+1036, which can be attributed to being powered by the rotation-powered pulsars. Indeed, a close inspection of the data shows that the pulsars of interest are all embedded in diffuse emission from supernova remnants like the Monogem Ring or the Rosetta Nebula, while PSR B0540+23 is located ~2.5 degrees away from the bright Crab pulsar, which shines out the eROSITA point-spread function up to the position of PSR B0540+23 and thus reduced the sensitivity to search for degree wide bright diffuse X-ray emission strongly.   Conclusions. Despite the non-detection of any degree-wide PWN surrounding the analysed pulsars, we set flux upper limits to provide useful information on magnetic field strength and its spatial distribution around those pulsars, providing additional constraints to the proposed theory for the formation of TeV halos around pulsars.\n\n", "2310.10341": "2023-10-16, **GMRT observations of the radio trail from CXOU J163802.6-471358**, D. A. Green et.al., [2310.10341v1](http://arxiv.org/abs/2310.10341v1)\n\n The X-ray source CXOU J163802.6-471358is thought to be a pulsar wind nebula (PWN), as it shows an extended, $\\approx 40$ arcsec trail from a compact source. Here we present GMRT observations of this source at 330 and 1390 MHz, which reveal a remarkable linear radio trail $\\approx 90$ arcsec in extent. Although the radio trail points back to the supernova remnant (SNR) G338.1+0.4, $\\approx 50$ arcmin from ,CXOU J163802.6-471358 associating it with this remnant would require a very large velocity for the pulsar. There are no known galactic SNRs close to the PWN and radio trail. No pulsar has yet been identified in CXOU J163802.6-471358, but if one could be found, this would allow more quantitative studies of the PWN and radio trail to be made.\n\n", "2310.10066": "2023-10-16, **A search for extragalactic fast optical transients in the Tomo-e Gozen high-cadence survey**, Kakeru Oshikiri et.al., [2310.10066v1](http://arxiv.org/abs/2310.10066v1)\n\n The population of optical transients evolving within a time-scale of a few hours or a day (so-called Fast Optical Transients, FOTs) has recently been debated extensively. In particular, our understanding of extragalactic FOTs and their rates is limited. We present a search for extragalactic FOTs with the Tomo-e Gozen high-cadence survey. Using the data taken from 2019 August to 2022 June, we obtain 113 FOT candidates. Through light curve analysis and cross-matching with other survey data, we find that most of these candidates are in fact supernovae, variable quasars, and Galactic dwarf novae, that were partially observed around their peak brightness. We find no promising candidate of extragalactic FOTs. From this non-detection, we obtain upper limits on the event rate of extragalactic FOTs as a function of their time-scale. For a very luminous event (absolute magnitude M<-26 mag), we obtain the upper limits of 4.4 x 10^{-9} Mpc^{-3} yr^{-1} for a time-scale of 4 h, and 7.4 x 10^{-10} Mpc^{-3} yr^{-1} for a time-scale of 1 d. Thanks to our wide (although shallow) surveying strategy, our data are less affected by the cosmological effects, and thus, give one of the more stringent limits to the event rate of intrinsically luminous transients with a time-scale of < 1 d.\n\n", "2310.10018": "2023-10-16, **Host Galaxies for Four Nearby CHIME/FRB Sources and the Local Universe FRB Host Galaxy Population**, Mohit Bhardwaj et.al., [2310.10018v1](http://arxiv.org/abs/2310.10018v1)\n\n We present the host galaxies of four apparently non-repeating fast radio bursts (FRBs), FRBs 20181223C, 20190418A, 20191220A, and 20190425A, reported in the first Canadian Hydrogen Intensity Mapping Experiment (CHIME/FRB) catalog. Our selection of these FRBs is based on a planned hypothesis testing framework where we search all CHIME/FRB Catalog-1 events that have low extragalactic dispersion measure (< 100 pc cm$^{-3}$), with high Galactic latitude (\\|b\\| > 10$\\deg$) and saved baseband data. We associate the selected FRBs to galaxies with moderate to high star-formation rates located at redshifts between 0.027 and 0.071. We also search for possible multi-messenger counterparts, including persistent compact radio and gravitational wave (GW) sources, and find none. Utilizing the four FRB hosts from this study along with the hosts of 14 published local Universe FRBs (z < 0.1) with robust host association, we conduct an FRB host demographics analysis. We find all 18 local Universe FRB hosts in our sample to be spirals (or late-type galaxies), including the host of FRB 20220509G, which was previously reported to be elliptical. Using this observation, we scrutinize proposed FRB source formation channels and argue that core-collapse supernovae are likely the dominant channel to form FRB progenitors. Moreover, we infer no significant difference in the host properties of repeating and apparently non-repeating FRBs in our local Universe FRB host sample. Finally, we find the burst rates of these four apparently non-repeating FRBs to be consistent with those of the sample of localized repeating FRBs observed by CHIME/FRB. Therefore, we encourage further monitoring of these FRBs with more sensitive radio telescopes.\n\n", "2310.10017": "2023-10-16, **Late-time data require smaller sound horizon at recombination**, Noriaki Kitazawa et.al., [2310.10017v1](http://arxiv.org/abs/2310.10017v1)\n\n The Hubble constant problem is that the values of Hubble constant from the observation of cosmic microwave background assuming the LambdaCDM model disagrees with the values from direct measurements. This problem suggests some new physics beyond the LambdaCDM model. Typically there are two ways of reconciliation: one is the realization of smaller value of sound horizon at recombination, and the other is the modification of the way of expansion of the universe after recombination. In this letter we examine the latter possibility by comparing two typical phenomenological dark energy models with the distance-redshift relation provided by Pantheon catalogue of supernova observations and galaxy surveys by BOSS and eBOSS collaborations. Though these phenomenological dark energy models globally fit observations better than the LambdaCDM model, they are strongly disfavored by the distance-redshift relation as almost the same level as the LambdaCDM model defined by cosmic microwave background observations. The distance-redshift relation strongly suggests some new physics which realize smaller value of sound horizon at recombination.\n\n", "2310.10007": "2023-10-16, **Broadband radio study of the North Polar Spur: Origin of the spectral turnover with insights into the X-ray and Gamma-ray spectra**, Iwashita Ryoji et.al., [2310.10007v1](http://arxiv.org/abs/2310.10007v1)\n\n The North Polar Spur (NPS) is a giant structure that is clearly visible in both radio and X-ray all-sky maps. We analyzed broadband radio observations covering a range between 22 MHz and 70 GHz to systematically analyze the thermal/non-thermal emissions associated with the NPS. We demonstrate that the radio emission of the NPS comprises synchrotron, free-free, and dust emission; however, synchrotron emissions dominate over other emissions, especially at high galactic-latitudes. Moreover, the synchrotron spectra exhibit a power-law behavior with $N(\\gamma)\\propto\\gamma^{-s}$ ($s\\simeq1.8-2.4$) up to a few GHz moderated by a turnover at $\\nu\\_{\\rm brk} \\simeq 1$ GHz, above which the spectral index $s$ decrease by one. Assuming that the turnover is due to the electrons cooled by synchrotron radiation before escaping (or advecting) from the emission region, the magnetic field strength can be estimated to be $B\\sim 8 \\rm\\mu G$ if the NPS is a distant structure that is near the Galactic Center (GC). However, an unreasonably strong $B\\sim 114\\rm\\mu G$ is required if the NPS is near the local supernova remnant (SNR). The corresponding non-thermal energy stored in the NPS is $E\\_{\\rm n/th}\\simeq 4.4\\times 10^{55}$ erg in the GC scenario, whereas $E\\_{\\rm n/th}\\simeq 4.1\\times 10^{52}$ erg is difficult to explain with a single local SNR. We also estimated the gamma-ray emission associated with the NPS through inverse Comptonization of the cosmic microwave background (CMB), which peaks at 100 - 1000 keV with a flux of $\\nu F\\_{\\nu}\\sim 10^{-9}$ $\\rm erg\\,cm^{-2}s^{-1}sr^{-1}$ in the GC model, and may be a good candidate for detection by future X-ray/gamma-ray observatories.\n\n"}}