{"neutrino": {"2411.16356": "2024-11-25, **New parameter region in sterile neutrino searches: a scenario to alleviate cosmological neutrino mass bound and its testability at oscillation experiments**, Toshihiko Ota et.al., [2411.16356v1](http://arxiv.org/abs/2411.16356v1)\n\n Recent high-precision cosmological data tighten the bound to neutrino masses and start rising a tension to the results of lab-experiment measurements, which may hint new physics in the role of neutrinos during the structure formation in the universe. A scenario with massless sterile neutrinos was proposed to alleviate the cosmological bound and recover the concordance in the measurements of neutrino masses. We revisit the scenario and discuss its testability at oscillation experiments. We find that the scenario is viable with a large active-sterile mixing that is testable at oscillation experiments. We present a numerical estimation of the sensitivity reach of the IceCube atmospheric neutrino observation to a sterile neutrino with a mass lighter than active neutrinos for the first time. IceCube shows a good sensitivity to the active-sterile mixing at the mass-square difference with a size of $\\sim 0.1$ eV$^{2}$ in the case of the \\textit{inverted-mass-ordering sterile neutrino}, which is forbidden under the assumption of the standard cosmology but is allowed thanks to the alleviation of the cosmological bound in this scenario.\n\n"}, "dark matter": {"2411.16500": "2024-11-25, **Cosmic Structure Formation in the Non-linear Regime: Beyond Gaussian Statistics and Standard Cosmologies**, Alex Gough et.al., [2411.16500v1](http://arxiv.org/abs/2411.16500v1)\n\n The cosmic large scale structure encodes the formation and evolution of a weblike network of dark matter and galaxies within the Universe. The cosmological information is wrapped up in non-Gaussian statistics requiring characterisation beyond two-point correlations. Accurate modelling of these non-Gaussian statistics and the underlying non-linear dynamics of gravitational collapse are key to extracting maximal information from ongoing and upcoming cosmological surveys.   This thesis centres on questions relating to clustering statistics, dynamics, and fundamental physics: A. How can we efficiently characterise the statistics of the late time matter field? B. How can we capture the non-linear phase-space dynamics of gravitational collapse? C. How do changes to fundamental physics impact those clustering statistics and dynamics?   Specifically we present four aspects addressing these questions: 1. We demonstrate the probability distribution function (PDF) of the matter density can be accurately predicted in modified gravity and dynamical dark energy models, and that it provides good complementarity to standard two-point analyses for detecting these features. 2. We demonstrate the joint PDF of densities in two cells can be used to predict the covariance of the one-point PDF in simple clustering models, providing estimates of the density dependent clustering and super-sample covariance missed in cosmological simulations. 3. We use a wave-based forward model of dark matter to demonstrate its capability to encode the full phase-space dynamics beyond a perfect fluid and determine certain universal scaling features in such models. 4. Using the wave dark matter forward model we analyse one-point statistics to complement existing analytic and numerical approaches in studying fundamentally wavelike dark matter.\n\n", "2411.16455": "2024-11-25, **Detecting clusters and groups of galaxies populating the local Universe in large optical spectroscopic surveys**, I. Marini et.al., [2411.16455v1](http://arxiv.org/abs/2411.16455v1)\n\n Wide-field cosmological surveys provide hundreds of thousands of spectroscopically confirmed galaxy groups and clusters, valuable for tracing baryonic matter distribution. However, controlling systematics in identifying host dark matter halos and estimating their properties is crucial. We evaluate three group detection methods on a simulated dataset replicating the GAMA selection to understand systematics and selection effects. This is key for interpreting data from SDSS, GAMA, DESI, WAVES, and leveraging optical catalogues in the (X-ray) eROSITA era to quantify baryonic mass in galaxy groups. Using a lightcone from the Magneticum hydrodynamical simulation, we simulate a spectroscopic galaxy survey in the local Universe (down to $z<0.2$ and stellar mass completeness $M\\_{\\star}\\geq10^{9.8} M\\_{\\odot}$). We assess completeness and contamination of reconstructed halo catalogues, evaluate membership accuracy, and analyse the halo mass recovery rate of group finders. All three group finders achieve high completeness ($>80\\%$) at group and cluster scales, confirming optical selection's suitability for dense regions. Contamination at low masses ($M\\_{200}<10^{13} M\\_{\\odot}$) arises from interlopers and fragmentation. Membership is at least 70\\% accurate above the group mass scale, but inaccuracies bias halo mass estimates using galaxy velocity dispersion. Alternative proxies, like total stellar luminosity or mass, yield more accurate halo masses. The cumulative luminosity function of galaxy members matches predictions, showing the group finders' accuracy in identifying galaxy populations. These results confirm the reliability and completeness of spectroscopic catalogues produced by state-of-the-art group finders. This supports studies requiring large spectroscopic samples of galaxy groups and clusters, as well as investigations into galaxy evolution across diverse environments.\n\n", "2411.16166": "2024-11-25, **Enhanced Disruption of Axion Minihalos by Multiple Stellar Encounters in the Milky Way**, Ian DSouza et.al., [2411.16166v1](http://arxiv.org/abs/2411.16166v1)\n\n If QCD axion dark matter formed post-inflation, axion miniclusters emerged from isocurvature fluctuations and later merged hierarchically into minihalos. These minihalos, potentially disrupted by stellar encounters in the Milky Way, affect axion detectability. We extend prior analyses by more accurately incorporating multiple stellar encounters and dynamical relaxation timescales, simulating minihalo orbits in the Galactic potential.   Our results show stellar interactions are more destructive than previously estimated, reducing minihalo mass retention at the solar system to ~30%, compared to earlier estimates of ~60%. This enhanced loss arises from cumulative energy injections when relaxation periods between stellar encounters are accounted for.   The altered minihalo mass function implies a larger fraction of axion dark matter occupies inter-minihalo space, potentially increasing the local axion density and improving haloscope detection prospects. This work highlights the significance of detailed modeling of stellar disruptions in shaping the axion dark matter distribution.\n\n", "2411.16114": "2024-11-25, **Diversity of Fuzzy Dark Matter Solitons**, Chen Tan et.al., [2411.16114v1](http://arxiv.org/abs/2411.16114v1)\n\n According to the Schr\\\"odinger-Poisson equations, fuzzy dark matter (FDM) can form a stable equilibrium configuration, the so-called FDM soliton. In principle, given the FDM particle mass, the profile of FDM soliton is fixed. In practice, however, there is a great diversity of structures in the Universe. In this paper, we enumerate some possible causes of such diversity, such as the effects of the gravitoelectric field, the gravitomagnetic field, an extra denser and compact FDM soliton and an ellipsoidal baryon background. And we find that the effects of the gravitomagnetic field are very weak but the effects of the others are considerable.\n\n"}, "supernova": {"2411.16677": "2024-11-25, **A Sound Horizon-Free Measurement of $H_0$ in DESI 2024**, E. A. Zaborowski et.al., [2411.16677v1](http://arxiv.org/abs/2411.16677v1)\n\n The physical size of the sound horizon at recombination is a powerful source of information for early-time measurements of the Hubble constant $H\\_0$, and many proposed solutions to the Hubble tension therefore involve modifications to this scale. In light of this, there has been growing interest in measuring $H\\_0$ independently of the sound horizon. We present the first such measurement to use data from the Dark Energy Spectroscopic Instrument (DESI), jointly analyzing the full-shape galaxy power spectra of DESI luminous red galaxies, emission line galaxies, quasars, and the bright galaxy sample, in a total of six redshift bins. Information from the sound horizon scale is removed from our constraints via a rescaling procedure at the power spectrum level, with our sound horizon-marginalized measurement being driven instead primarily by the matter-radiation equality scale. This measurement is then combined with additional sound horizon-free information from Planck+ACT CMB lensing, uncalibrated type Ia supernovae, and the DESI Lyman-$\\alpha$ forest. We agnostically combine with the DESY5, Pantheon+, and Union3 supernova datasets, with our tightest respective constraints being $H\\_0=66.7^{+1.7}\\_{-1.9},~67.9^{+1.9}\\_{-2.1},$ and $67.8^{+2.0}\\_{-2.2}$ km s-1 Mpc-1. This corresponds to a sub-3% sound horizon-free constraint of the Hubble constant, and is the most precise measurement of its kind to date. Even without including information from the sound horizon, our measurement is still in 2.2-3.0$\\sigma$ tension with SH0ES. Additionally, the consistency between our result and other measurements that do rely on the sound horizon scale provides no evidence for new early-Universe physics (e.g. early dark energy). Future DESI data releases will allow unprecedented measurements of $H\\_0$ and place strong constraints on models that use beyond-$\\Lambda$CDM physics to ameliorate the Hubble tension.\n\n", "2411.16459": "2024-11-25, **Interaction between the Supernova Remnant W44 and the Infrared Dark Cloud G034.77-00.55: shock induced star formation?**, G. Cosentino et.al., [2411.16459v1](http://arxiv.org/abs/2411.16459v1)\n\n How Supernova Remnant (SNR) shocks impact nearby molecular clouds is still poorly observationally constrained. It is unclear if SNRs can positively or negatively affect clouds star formation potential. We have studied the dense gas morphology and kinematics toward the Infrared Dark Cloud (IRDC) G034.77-00.55, shock-interacting with the SNR W44, to identify evidence of early stage star formation induced by the shock. We have used high-angular resolution N2H+(1-0) images across G034.77-00.55, obtained with ALMA. N2H+ is a well known tracer of dense and cold material, optimal to identify gas with the highest potential to harbour star formation. The N2H+ emission is distributed into two elongated structures, one toward the dense ridge at the edge of the source and one toward the inner cloud. Both elongations are spatially associated with well-defined mass-surface density features. The velocities of the gas in the two structures i.e., 38-41 km s-1 and 41-43 km s-1 are consistent with the lowest velocities of the J- and C-type parts of the SNR-driven shock, respectively. A third velocity component is present at 43-45.5 km s-1. The dense gas shows a fragmented morphology with core-like fragments of scales consistent with the Jeans lengths, masses $\\sim$1-20 M$\\_{\\odot}$, densities (n(H$\\_2$)$\\geq$10$^5$ cm$^{-3}$) sufficient to host star formation in free-fall time scales (few 10$^4$ yr) and with virial parameters that hint toward possible collapse. The W44 driven shock may have swept up the encountered material which is now seen as a dense ridge, almost detached from the main cloud, and an elongation within the inner cloud, well constrained in both N2H+ emission and mass surface density. This shock compressed material may have then fragmented into cores that are either in a starless or pre-stellar stage. Additional observations are needed to confirm this scenario and the nature of the cores.\n\n", "2411.16202": "2024-11-25, **Material mixing in pulsar wind nebulae of massive runaway stars**, D. M. -A. Meyer et.al., [2411.16202v1](http://arxiv.org/abs/2411.16202v1)\n\n In this study we quantitatively examine the manner pulsar wind, supernova ejecta and defunct stellar wind materials distribute and melt together into plerions. We performed 2.5D MHD simulations of the entire evolution of their stellar surroundings and different scenarios are explored, whether the star dies as a red supergiant and Wolf Rayet supernova progenitors, and whether it moved with velocity 20 km/s or 40 km/s through the ISM. Within the post explosion, early 10 kyr, the H burning products rich red supergiant wind only mixes by <= 20 per cent, due to its dense circumstellar medium filling the progenitor bow shock trail, still unaffected by the supernova blastwave. Wolf Rayet materials, enhanced in C, N, O elements, distribute circularly for the 35 Mo star moving at 20 km/s and oblongly at higher velocities, mixing efficiently up to 80 per cent. Supernova ejecta, filled with Mg, Si, Ca, Ti and Fe, remain spherical for longer times at 20 km/s but form complex patterns at higher progenitor speeds due to earlier interaction with the bow shock, in which they mix more efficiently. The pulsar wind mixing is more efficient for Wolf Rayet (25 per cent) than red supergiant progenitors (20 per cent). This work reveals that the past evolution of massive stars and their circumstellar environments critically shapes the internal distribution of chemical elements on plerionic supernova remnants, and, therefore, governs the origin of the various emission mechanisms at work therein. This is essential for interpreting multi-frequency observations of atomic and molecular spectral lines, such as in optical, infrared, and soft X rays.\n\n"}}