{"neutrino": {"2401.05278": "2024-01-10, **Inhomogeneous Kinetic Equation for Mixed Neutrinos: Tracing the Missing Energy**, Damiano F. G. Fiorillo et.al., [2401.05278v1](http://arxiv.org/abs/2401.05278v1)\n\n Flavor-dependent neutrino transport is described by a well-known kinetic equation for occupation-number matrices in flavor space. However, as an overlooked theoretical problem, we show that in the inhomogeneous case, neutrino-neutrino refractive energy is not conserved. We derive the missing gradient terms in the fast flavor limit (vanishing neutrino masses), and prove that the missing refractive energy is traded with the huge reservoir of neutrino kinetic energy through gradients of the weak interaction potential. Even small changes of the kinetic energy accommodate the refractive energy gained or lost. Flavor evolution alone is negligibly affected by the new terms.\n\n", "2401.05174": "2024-01-10, **Collider imprints of right handed neutrino magnetic moment operator**, Eung Jin Chun et.al., [2401.05174v1](http://arxiv.org/abs/2401.05174v1)\n\n We consider most general effective Lagrangian up to dimension five, built with Standard Model~(SM) fields and right-handed neutrinos~(RHNs) $N\\_i$. Assuming that the RHNs are present near the electroweak scale, we study the phenomenology of the RHNs and highlight the differences that arise due to the inclusion of dimension five operators. We specifically focus on the production process $e^+e^-/pp\\to N\\_i N\\_j$ which comes from the dimension five magnetic moment operator. We find that this production process followed by the decay chains such as $N\\_i\\to N\\_j\\gamma$, $N\\_i\\to\\nu\\_j\\gamma$ and $N\\_i\\to\\ell^\\pm j j$ leads to striking collider signatures which might help to probe the Majorana nature of neutrinos. We discuss the current collider constraints on this operator, as well as projected limit at future colliders. In addition, we discuss the stellar-cooling bounds applicable to the RHN mass below 0.1 GeV.\n\n"}, "dark matter": {"2401.05327": "2024-01-10, **New dark matter analysis of Milky Way dwarf satellite galaxies with MADHATv2**, Kimberly K. Boddy et.al., [2401.05327v1](http://arxiv.org/abs/2401.05327v1)\n\n We obtain bounds on dark matter annihilation using 14 years of publicly available Fermi-LAT data from a set of 54 dwarf spheroidal galaxies, using spectral information from 16 energy bins. We perform this analysis using our updated and publicly available code MADHATv2, which can be used to test a variety of models for dark matter particle physics and astrophysics in an accessible manner. In particular, we note that including Carina III in the analysis strengthens constraints on $s$-wave annihilation into two-body Standard Model final states by a factor of $\\sim 3$ but broadens the error on the constraint due to the large uncertainty of its $J$-factor. Our findings illustrate the importance of verifying if Carina III is in fact a dwarf spheroidal galaxy and measuring more precisely its $J$-factor. More generally, they highlight the significance of forthcoming discoveries of nearby ultra-faint dwarfs for dark matter indirect detection.\n\n", "2401.05255": "2024-01-10, **diffSph: a Python tool to compute diffuse signals from dwarf spheroidal galaxies**, Martin Vollmann et.al., [2401.05255v1](http://arxiv.org/abs/2401.05255v1)\n\n So far no diffuse emissions in dwarf spheroidal satellites of the Milky Way have ever been observed. Given that dwarf galaxies are predominantly composed of Dark Matter, the discovery of these signals could offer valuable insights into understanding the nature of Dark Matter. We present \"diffSph\", a Python tool which in its present version provides fast predictions of such diffuse signals in radio frequencies. It also features a very comprehensive module for the computation of \"J\" and \"D\" factors that are relevant for indirect Dark Matter detection using gamma rays. Routines are coupled to parton-shower algorithms and Dark Matter halo mass functions from state-of-the-art kinematic fits. This code is also useful for testing generic hypotheses (not necessarily associated with any Dark Matter candidate) about the cosmic-ray electron/positron sources in the dwarf galaxies. The diffSph tool has already been employed in searches for diffuse signals from dwarf spheroidal galaxies using the LOw Frequency ARray (LOFAR).\n\n", "2401.05005": "2024-01-10, **Comprehensive constraints on fermionic dark matter-quark tensor interactions in direct detection experiments**, Jin-Han Liang et.al., [2401.05005v1](http://arxiv.org/abs/2401.05005v1)\n\n Effective field theory (EFT) provides a model-independent framework for interpreting the results of dark matter (DM) direct detection experiments. In this study, we demonstrate that the two fermionic DM-quark tensor operators, $(\\bar{\\chi} i\\sigma^{\\mu\\nu} \\gamma^5 \\chi) (\\bar{q} \\sigma\\_{\\mu\\nu}q)$ and $(\\bar{\\chi} \\sigma^{\\mu\\nu} \\chi) (\\bar{q} \\sigma\\_{\\mu\\nu} q)$, can contribute to the DM electric and magnetic dipole moments via nonperturbative QCD effects, in addition to the well-studied contact DM-nucleon operators. We then investigate the constraints on these two operators by considering both the contact and the dipole contributions using the XENON1T nuclear recoil and Migdal effect data. We also recast other existing bounds on the DM dipole operators, derived from electron and nuclear recoil measurements in various direct detection experiments, as constraints on the two tensor operators. For $m\\_\\chi \\lesssim 1\\,\\rm GeV$, our results significantly extend the reach of constraints on the DM-quark tensor operators to masses as low as $5\\,\\rm MeV$, with the bound exceeding that obtained by the Migdal effect with only contact interactions by an order of magnitude or so. In particular, for the operator $(\\bar{\\chi} \\sigma^{\\mu\\nu}i\\gamma\\_5 \\chi) (\\bar{q} \\sigma\\_{\\mu\\nu}q)$ with DM mass $m\\_\\chi \\gtrsim 10\\,\\rm GeV$, the latest PandaX constraint on the DM electric dipole moment puts more stringent bounds than the previous direct detection limit.\n\n", "2401.04985": "2024-01-10, **Self-interacting dark matter interpretation of Crater II**, Xingyu Zhang et.al., [2401.04985v1](http://arxiv.org/abs/2401.04985v1)\n\n The satellite galaxy Crater II of the Milky Way is extremely cold and exceptionally diffuse. These unusual properties are challenging to understand in the standard model of cold dark matter. We investigate the formation of Crater II in self-interacting dark matter (SIDM), where dark matter particles can scatter and thermalize. We conduct a series of controlled N-body simulations to model the tidal evolution of Crater II, varying the self-interacting cross section, orbit parameters, and initial stellar distribution. Dark matter self-interactions lead to halo core formation and the distribution of stars expands accordingly. A cored SIDM halo also boosts tidal mass loss, allowing for a high orbit. Our simulations show that SIDM halos with a $1~{\\rm kpc}$ core can simultaneously explain the low stellar velocity dispersion and the large half-light radius of Crater II, remaining robust to the initial distribution of stars. For the orbit motivated by the measurements from Gaia Early Data Release 3, the favored self-interacting cross section is approximately $60~{\\rm cm^2/g}$ on the mass scale of Crater II.\n\n", "2401.04931": "2024-01-10, **Possible Dark Matter Signals from White Dwarfs**, Jia-Shu Niu et.al., [2401.04931v1](http://arxiv.org/abs/2401.04931v1)\n\n In our galaxy, the white dwarfs (WDs) will inevitably capture the dark matter (DM) particles streaming through them, if there exist interactions between DM particles and nucleons/electrons. At the same time, these DM particles can also be evaporated by the nucleons/electrons in a WD if they have proper mass. The evaporation of DM particles will lead to a faster cooling evolution than that predicted by stellar evolution theory. In this letter, we ascribe the faster cooling evolution of 3 observed WDs to the capture and evaporation of DM particles, and get possible DM signals as follows: for $F(q) = 1$, $40\\ \\mathrm{MeV}/c^{2} \\lesssim m\\_{\\chi} \\lesssim 70\\ \\mathrm{MeV}/c^{2}$ and $10^{-57} \\mathrm{cm}^{2} \\lesssim \\sigma\\_{\\chi,e} \\lesssim 10^{-55} \\mathrm{cm}^{2}$; for $F(q) = (\\alpha m\\_{e})^{2}/q^{2}$, $30\\ \\mathrm{MeV}/c^{2} \\lesssim m\\_{\\chi} \\lesssim 60\\ \\mathrm{MeV}/c^{2}$ and $10^{-53} \\mathrm{cm}^{2} \\lesssim \\sigma\\_{\\chi,e} \\lesssim 10^{-51} \\mathrm{cm}^{2}$. These results should be cross checked by more novel scenarios in the future.\n\n"}, "supernova": {"2401.05195": "2024-01-10, **Astro+: Design, construction, and scientific exploitation of a large-scale massive star spectroscopic database**, Klaus Rubke et.al., [2401.05195v1](http://arxiv.org/abs/2401.05195v1)\n\n Massive stars condition the evolution of the interstellar medium by the amount of energy released during their lives and especially by their deaths as supernova explosions. The vast amounts of spectroscopic data for massive stars provided by previous and existing instruments on ground-based and space-based telescopes have already saturated our capability to process them by the use of human routines. As a consequence, there is a pressing need for machine-assisted tools to help handle incoming data. To this end, we present the development of a massive star spectroscopic multiwavelength interactive database designed for scientific research and a fully automatic stellar parameter determination tool. Here we show the preliminary results of the application of these tools to optical spectra of O-type stars.\n\n", "2401.05103": "2024-01-10, **Electron-capture supernovae in NS+He star systems and the double neutron star systems**, Yun-Lang Guo et.al., [2401.05103v1](http://arxiv.org/abs/2401.05103v1)\n\n Electron-capture supernovae (EC-SNe) provide an alternative channel for producing neutron stars (NSs). They play an important role in the formation of double NS (DNS) systems and the chemical evolution of galaxies, and contribute to the NS mass distribution in observations. It is generally believed that EC-SNe originate from $e$-captures on $\\rm^{24}Mg$ and $\\rm^{20}Ne$ in the massive degenerate oxygen-neon (ONe) cores with masses close to the Chandrasekhar limit ($M\\_{\\rm Ch}$). However, the origin of EC-SNe is still uncertain. In this paper, we systematically studied the EC-SNe in NS+He star systems by considering the explosive oxygen burning that may occur in the near-$M\\_{\\rm Ch}$ ONe core. We provided the initial parameter spaces for producing EC-SNe in the initial orbital period $-$ initial He star mass (log$P\\_{\\rm orb}^{\\rm i}-M\\_{\\rm He}^{\\rm i}$) diagram, and found that both $M\\_{\\rm He}^{\\rm i}$ and minimum $P\\_{\\rm orb}^{\\rm i}$ for EC-SNe increase with metallicity. Then, by considering NS kicks added to the newborn NS, we investigated the properties of the formed DNS systems after the He star companions collapse into NSs, such as the orbital periods, eccentricities and spin periods of recycle pulsars ($P\\_{\\rm spin}$), etc. The results show that most of the observed DNS systems can be produced by NS kicks of $\\lesssim50\\rm\\,km\\,s^{-1}$. In addition, we found that NSs could accrete more material if the residual H envelope on the He star companions is considered, which can form the mildly recycled pulsars ($P\\_{\\rm spin}\\sim20\\,$ms) in DNS systems.\n\n", "2401.05001": "2024-01-10, **Indication of a fast ejecta fragment in the atomic cloud interacting with the southwestern limb of SN 1006**, R. Giuffrida et.al., [2401.05001v1](http://arxiv.org/abs/2401.05001v1)\n\n Supernova remnants interacting with molecular/atomic clouds are interesting X-ray sources to study broadband nonthermal emission. X-ray line emission in these systems can be produced by different processes, e.g. low energy cosmic rays interacting with the cloud and fast ejecta fragments moving in the cloud. The paper aims at studying the origin of the non-thermal X-ray emission of the southwestern limb of SN 1006 beyond the main shock, in order to distinguish if the emission is due to low energy cosmic rays diffusing in the cloud or to ejecta knots moving into the cloud. We analyzed the X-ray emission of the southwestern limb of SN 1006, where the remnant interacts with an atomic cloud, with three different X-ray telescopes ({NuSTAR, Chandra and XMM-Newton) and performed a combined spectro-imaging analysis of this region. The analysis of the non thermal X-ray emission of the southwestern limb of SN 1006, interacting with an atomic cloud, has shown the detection of an extended X-ray source in the atomic cloud, approximately $2$ pc upstream of the shock front. The source is characterized by a hard continuum (described by a power law with photon index $\\Gamma\\sim1.4$) and by Ne, Si and Fe emission lines. The observed flux suggests that the origin of the X-ray emission is not associated with low energy cosmic rays interacting with the cloud. On the other hand, the spectral properties of the source, together with the detection of an IR counterpart visible with \\textit{Spitzer}-MIPS at 24 $\\mu$m are in good agreement with expectations for a fast ejecta fragment moving within the atomic cloud. We detected X-ray and IR emission from a possible ejecta fragment, with radius approximately 1$\\times10^{17}$ cm, and mass approximately $10^{-3}M\\_\\odot$ at about 2 pc out of the shell of SN 1006, in the interaction region between the southwestern limb of the remnant and the atomic cloud.\n\n", "2401.04944": "2024-01-10, **TREASUREHUNT: Transients and Variability Discovered with HST in the JWST North Ecliptic Pole Time Domain Field**, Rosalia O'Brien et.al., [2401.04944v1](http://arxiv.org/abs/2401.04944v1)\n\n The JWST North Ecliptic Pole (NEP) Time Domain Field (TDF) is a $>$14 arcmin diameter field optimized for multi-wavelength time-domain science with JWST. Its location within JWST's northern continuous viewing zone offers optimal conditions for time-domain studies with JWST, ensuring year-round observability, absence of bright stars, and minimal Zodiacal foreground interference. It has been observed across the electromagnetic spectrum both from the ground and from space, including with the Hubble Space Telescope (HST). As part of HST observations over 3 cycles (the \"TREASUREHUNT\" program), deep images were obtained with ACS/WFC in F435W and F606W that cover almost the entire JWST NEP TDF. Many of the individual pointings of these programs partially overlap, allowing an initial assessment of the potential of this field for time-domain science with HST and JWST. The cumulative area of overlapping pointings is ~88 arcmin$^2$, with time intervals between individual epochs that range between 1 day and 4$+$ years. We present the discovery of 12 transients and ~100 variable sources to a depth of $m\\_{\\rm AB} \\simeq$ 29.5 mag (F606W). The majority of the transients will be supernovae, although at least two are likely quasars. Most variable sources are AGN, where we find ~0.35% (0.04%) of the general $z < 6$ field galaxy population to vary at the 3$\\sigma$ (5$\\sigma$) level. Based on a 5-year timeframe, this translates into a random supernova areal density of up to ~0.07 transients per arcmin$^2$ (~245 deg$^{-2}$) per epoch, and a variable AGN areal density of ~1.4 variables per arcmin$^2$ (~5184 deg$^{-2}$) to these depths.\n\n"}}