{"neutrino": {"2404.15220": "2024-04-23, **Dark Radiation with Baryon Acoustic Oscillations from DESI 2024 and the $H_0$ tension**, Itamar J. Allali et.al., [2404.15220v1](http://arxiv.org/abs/2404.15220v1)\n\n We investigate the presence of extra relativistic degrees of freedom in the early Universe, contributing to the effective number of neutrinos $N\\_\\text{eff}$, as $\\Delta N\\_\\text{eff}\\equiv N\\_\\text{eff}-3.044\\geq 0$, in light of the recent measurements of Baryon Acoustic Oscillations (BAO) by the DESI collaboration. We analyze one-parameter extensions of the $\\Lambda$CDM model where dark radiation (DR) is free streaming or behaves as a perfect fluid, due to self-interactions. We report a significant relaxation of upper bounds on $\\Delta N\\_\\text{eff}$, with respect to previous BAO data from SDSS+6dFGS, when additionally employing Planck data (and supernovae data from Pantheon+), setting $\\Delta N\\_\\text{eff}\\leq 0.39$ ($95\\%$ C.L.) for free streaming DR, and a very mild preference for fluid DR, $\\Delta N\\_\\text{eff} = 0.221^{+0.088}\\_{-0.18}$ ($\\leq 0.46$, $95\\%$ C.L.). Applying constraints from primordial element abundances leads to slightly tighter constraints on $\\Delta N\\_\\text{eff}$, but they are avoided if DR is produced after Big Bang Nucleosynthesis (BBN). For fluid DR we estimate the tension with the SH$\\_0$ES determination of $H\\_0$ to be around $(2.3-2.8)\\sigma$ level, and for free-streaming DR the tension is below $3\\sigma$ if production occurs after BBN. This lesser degree of tension motivates a combination with SH$\\_0$ES in these cases, resulting in a $4.4\\sigma-5\\sigma$ evidence for dark radiation with $\\Delta N\\_\\text{eff}\\simeq 0.6$ and large improvements in $\\chi^2$ over $\\Lambda$CDM, $-18\\lesssim \\Delta \\chi^2\\lesssim -25$.\n\n", "2404.14995": "2024-04-23, **Solar flare observations with the Radio Neutrino Observatory Greenland (RNO-G)**, S. Agarwal et.al., [2404.14995v1](http://arxiv.org/abs/2404.14995v1)\n\n The science program of the Radio Neutrino Observatory-Greenland (RNO-G) extends beyond particle astrophysics to include radioglaciology and, as we show herein, solar physics, as well. Impulsive solar flare observations not only permit direct measurements of light curves, spectral content, and polarization on time scales significantly shorter than most extant dedicated solar observatories, but also offer an extremely useful above-surface calibration source, with pointing precision of order tens of arc-minutes. Using the early RNO-G data from 2022-2023, observed flare characteristics are compared to well-established solar observatories. Also, a number of individual flares are used to highlight angular reconstruction and calibration methods. RNO-G observes signal excesses during solar flares reported by the solar-observing Callisto network and in coincidence with about 60% of the brightest excesses recorded by the SWAVES satellite, when the Sun is above the horizon for RNO-G. In these observed flares, there is significant impulsivity in the time-domain. In addition, the solar flares are used to calibrate the RNO-G absolute pointing on the radio signal arrival direction to sub-degree resolution.\n\n", "2404.14917": "2024-04-23, **Particle Swam Optimization Based Analysis to Unlocking the Neutrino Mass Puzzle using $A_{4}\\times Z_{3}\\times Z_{10}$ Flavor Symmetry**, M. W. Aslam et.al., [2404.14917v1](http://arxiv.org/abs/2404.14917v1)\n\n New research has highlighted a shortfall in the Standard Model (SM) because it predicts neutrinos to have zero mass. However, recent experiments on neutrino oscillation have revealed that the majority of neutrino parameters indeed indicate their significant mass. In response, scientists are increasingly incorporating discrete symmetries alongside continuous ones for better justification of observed patterns of neutrino mixing. In this study, we have examined a model within $A\\_4\\times Z\\_3\\times Z\\_{10}$ symmetry to estimate the neutrino masses using particle swam optimization technique for both mass hierarchy of neutrino. This model employed a hybrid seesaw mechanism, a combination of seesaw mechanism of type-I and type-II, to establish the effective Majorana neutrino mass matrix. After calculating the mass eigenvalues and lepton mixing matrix upto second order perturbation theory in this framework, this study seeks to investigate the scalar potential for vacuum expectation values (VEVs), optimize the parameters, $U\\_{PMNS}$ matrix, neutrino masses: $\\|{m\\_{1}^{\\prime}}^N\\|=0.0292794-0.0435082\\ eV$, $\\|{m\\_{2}^{\\prime}}^N\\|=1.78893\\times 10^{-18}-0.0293509\\ eV$, $\\|{m\\_{3}^{\\prime}}^N\\|=0.0307414-0.0471467\\ eV$, $\\|{m\\_{1}^{\\prime}}^I\\|=0.00982013-0.0453623\\ eV$, $\\|{m\\_{2}^{\\prime}}^I\\_\\|=0.0379702-0.0471197\\ eV$, and $\\|{m\\_{3}^{\\prime}}^I\\|=0.0122063-0.027544\\ eV$, effective neutrino mass parameters: $\\langle {m\\_{ee}} \\rangle^N=(0.170-3.93)\\times10^{-2}\\ eV$, $\\langle {m\\_{\\beta}} \\rangle^N=(0.471-1.39)\\times10^{-2}\\ eV$, $\\langle {m\\_{ee}} \\rangle^I=(1.85-4.55)\\times10^{-2}\\ eV$ and $\\langle {m\\_{\\beta}} \\rangle^I=(2.26-4.56)\\times10^{-2}\\ eV$, are predicted for both mass hierarchy through particle swam optimization (PSO), showing strong agreement with recent experimental findings.\n\n", "2404.14912": "2024-04-23, **Asymmetric self-interacting dark matter with canonical seesaw**, Debasish Borah et.al., [2404.14912v1](http://arxiv.org/abs/2404.14912v1)\n\n We study the possibility of generating dark matter (DM) and baryon asymmetry of the universe (BAU) simultaneously in an asymmetric DM framework which also alleviates the small-scale structure issues of cold DM (CDM). While thermal relic of such self-interacting DM (SIDM) remains under-abundant due to efficient annihilation into light mediators, a non-zero asymmetry in dark sector can lead to survival of the required DM in the universe. The existence of a light mediator leads to the required self-interactions of DM at small scales while keeping DM properties similar to CDM at large scales. It also ensures that the symmetric DM component annihilates away, leaving the asymmetric part, in the spirit of cogenesis. The particle physics implementation is done in canonical seesaw models of light neutrino mass, connecting it to the origin of DM and BAU. In particular, we consider type-I and type-III seesaw origin of neutrino mass for simplicity and minimality of the field content. We show that the desired self-interactions and relic of DM together with BAU while satisfying relevant constraints lead to strict limits on DM mass $\\mathcal{O}(\\rm GeV) \\lesssim M\\_{\\rm DM} \\lesssim460 $ GeV. In spite of being high scale seesaw, the models remain verifiable at different experiments including direct, indirect DM search as well as colliders.\n\n", "2404.14782": "2024-04-23, **Black hole-neutron star binaries**, Matthew D. Duez et.al., [2404.14782v1](http://arxiv.org/abs/2404.14782v1)\n\n The gravitational wave signals of black hole-neutron star (BHNS) binary systems have now been detected, and future detections might be accompanied by electromagnetic counterparts. BHNS mergers involve much of the same physics as binary neutron star mergers: strong gravity, nuclear density matter, neutrino radiation, and magnetic turbulence. They also share with binary neutron star systems the potential for bright electromagnetic signals, especially gamma ray bursts and kilonovae, and the potential to be significant sources of r-process elements. However, BHNS binaries are more asymmetric, and their mergers produce different amounts and arrangements of the various post-merger material components (e.g. disk and dynamical ejecta), together with a more massive black hole; these differences can have interesting consequences. In this chapter, we review the modeling of BHNS mergers and post-merger evolution in numerical relativistic hydrodynamics and magnetohydrodynamics. We attempt to give readers a broad understanding of the answers to the following questions. What are the main considerations that determine the merger outcome? What input physics must (or should) go into a BHNS simulation? What have the most advanced simulations to date learned?\n\n", "2404.14541": "2024-04-22, **Loss of coherence and change in emission physics for radio emission from very inclined cosmic-ray air showers**, Simon Chiche et.al., [2404.14541v1](http://arxiv.org/abs/2404.14541v1)\n\n Next-generation radio experiments such as the Radio Detector of the upgraded Pierre Auger Observatory and the planned GRAND and BEACON arrays target the detection of ultra-high-energy particle air showers arriving at low elevation angles. These inclined cosmic-ray air showers develop higher in the atmosphere than vertical ones, enhancing magnetic deflections of electrons and positrons inside the cascade. We evidence two novel features in their radio emission: a new polarization pattern, consistent with a geo-synchrotron emission model and a coherence loss of the radio emission, both for showers with zenith angle $\\theta \\gtrsim 65^{\\circ}$ and strong enough magnetic field amplitude (typical strength of $B\\sim 50\\, \\rm \\mu T$). Our model is compared with both ZHAireS and CoREAS Monte-Carlo simulations. Our results break the cannonical description of a radio signal made of Askaryan and transverse current emission only, and provide guidelines for the detection and reconstruction strategies of next-generation experiments, including cosmic-ray/neutrino discrimination.\n\n", "2404.14485": "2024-04-22, **Enhanced Muonization by Active-Sterile Neutrino Mixing in Protoneutron Stars**, Anupam Ray et.al., [2404.14485v1](http://arxiv.org/abs/2404.14485v1)\n\n We study $\\nu\\_\\mu$-$\\nu\\_s$ and $\\bar\\nu\\_\\mu$-$\\bar\\nu\\_s$ mixing in the protoneutron star (PNS) created in a core-collapse supernova (CCSN). We point out the importance of the feedback on the general composition of the PNS in addition to the obvious feedback on the $\\nu\\_\\mu$ lepton number. We show that for our adopted mixing parameters $\\delta m^2\\sim 10^2\\,$keV$^2$ and $\\sin^2 2\\theta$ consistent with the current constraints, sterile neutrino production is dominated by the Mikheyev$-$Smirnov$-$Wolfenstein conversion of $\\bar\\nu\\_\\mu$ into $\\bar\\nu\\_s$ and that the subsequent escape of $\\bar\\nu\\_s$ increases the $\\nu\\_\\mu$ lepton number, which in turn enhances muonization of the PNS primarily through $\\nu\\_\\mu+n\\to p+\\mu^-$. We find that this enhancement is amplified by diffusion of the $\\nu\\_e$ and $\\nu\\_\\mu$ lepton numbers. While these results are qualitatively robust, their quantitative effects on the dynamics and active neutrino emission of CCSNe should be evaluated by including $\\nu\\_\\mu$-$\\nu\\_s$ and $\\bar\\nu\\_\\mu$-$\\bar\\nu\\_s$ mixing in the simulations.\n\n", "2404.14264": "2024-04-22, **Two New $μ-τ$ Deviated Neutrino Mass Matrix Textures**, Pralay Chakraborty et.al., [2404.14264v1](http://arxiv.org/abs/2404.14264v1)\n\n We propose two new neutrino mass matrix textures deviating from $\\mu-\\tau$ symmetry and explore their phenomenological implications. Both textures predict $\\theta\\_{23}$ and $\\delta$ within sharp bounds while considering both normal and inverted ordering of neutrino masses. We try to realize these proposed textures within the framework of the seesaw mechanism, in association with the $SU(2)\\_L \\times A\\_4 \\times Z\\_3$ symmetry group.\n\n"}, "dark matter": {"2404.15232": "2024-04-23, **Interacting Dark Energy after DESI Baryon Acoustic Oscillation measurements**, William Giarè et.al., [2404.15232v1](http://arxiv.org/abs/2404.15232v1)\n\n We investigate the implications of the Baryon Acoustic Oscillation measurements released by the Dark Energy Spectroscopic Instrument (DESI) for Interacting Dark Energy (IDE) models characterized by an energy-momentum flow from Dark Matter to Dark Energy. By combining Planck-2018 and DESI data, we observe a preference for interactions exceeding the 95% confidence level, yielding a present-day expansion rate $H\\_0=71.4\\pm1.5$ km/s/Mpc, in agreement with SH0ES. This preference remains robust when including measurements of the expansion rate $H(z)$ obtained from the relative ages of massive, early-time, and passively-evolving galaxies, as well as when considering distance moduli measurements from Type-Ia Supernovae sourced from the Pantheon-plus catalog using the SH0ES Cepheid host distances as calibrators. Overall, high and low redshift data can be equally or better explained within the IDE framework compared to $\\Lambda$CDM, while also yielding higher values of $H\\_0$ in better agreement with the local distance ladder estimate.\n\n", "2404.15038": "2024-04-23, **Confronting Dark Matter Capture Rate with Continuous Gravitational Wave Probe of Local Neutron Stars**, Pooja Bhattacharjee et.al., [2404.15038v1](http://arxiv.org/abs/2404.15038v1)\n\n Continuous gravitational waves (CGWs) from various astrophysical sources are one of the many future probes of upcoming Gravitational Wave (GW) search missions. Neutron stars (NSs) with deformity are one of the leading sources of CGW emissions. In this work, for the first time, a novel attempt to estimate the dark matter (DM) capture rate is performed using CGW as the probe to the local NS population. Competitive bounds on DM capture from the local NS population are reported when compared with DM direct search experiments and other astrophysical observations.\n\n", "2404.14844": "2024-04-23, **Probing bottom-associated production of a TeV scale scalar decaying to a top quark and dark matter at the LHC**, Amandeep Kaur Kalsi et.al., [2404.14844v1](http://arxiv.org/abs/2404.14844v1)\n\n A minimal non-thermal dark matter model that can explain both the existence of dark matter and the baryon asymmetry in the universe is studied. It requires two color-triplet, iso-singlet scalars with $\\mathcal{O}$(TeV) masses and a singlet Majorana fermion with a mass of $\\mathcal{O}$(GeV). The fermion becomes stable and can play the role of the dark matter candidate. We consider the fermion to interact with a top quark via the exchange of QCD-charged scalar fields coupled dominantly to third generation fermions. The signature of a single top quark production associated with a bottom quark and large missing transverse momentum opens up the possibility to search for this type of model at the LHC in a way complementary to existing monotop searches.\n\n", "2404.14516": "2024-04-22, **Instrument Signature Removal and Calibration Products for the Rubin Legacy Survey of Space and Time**, Andrés A. Plazas Malagón et.al., [2404.14516v1](http://arxiv.org/abs/2404.14516v1)\n\n The Vera C. Rubin Legacy Survey of Space and Time (LSST) will conduct an unprecedented optical survey of the southern sky, imaging the entire available sky every few nights for 10 years. To achieve its ambitious science goals of probing dark energy and dark matter, mapping the Milky Way, and exploring the transient optical sky, the systematic errors in the LSST data must be exquisitely controlled. Instrument signature removal (ISR) is a critical early step in LSST data processing to remove inherent camera effects from the raw images and produce accurate representations of the incoming light. This paper describes the current state of the ISR pipelines implemented in the LSST Science Pipelines software. The key steps in ISR are outlined, and the process of generating and verifying the necessary calibration products to carry out ISR is also discussed. Finally, an overview is given of how the Rubin data management system utilizes a data Butler and calibration collections to organize datasets and match images to appropriate calibrations during processing. Precise ISR will be essential to realize the potential of LSST to revolutionize astrophysics.\n\n", "2404.14487": "2024-04-22, **A Strong Gravitational Lens Is Worth a Thousand Dark Matter Halos: Inference on Small-Scale Structure Using Sequential Methods**, Sebastian Wagner-Carena et.al., [2404.14487v1](http://arxiv.org/abs/2404.14487v1)\n\n Strong gravitational lenses are a singular probe of the universe's small-scale structure $\\unicode{x2013}$ they are sensitive to the gravitational effects of low-mass $(<10^{10} M\\_\\odot)$ halos even without a luminous counterpart. Recent strong-lensing analyses of dark matter structure rely on simulation-based inference (SBI). Modern SBI methods, which leverage neural networks as density estimators, have shown promise in extracting the halo-population signal. However, it is unclear whether the constraining power of these models has been limited by the methodology or the information content of the data. In this study, we introduce an accelerator-optimized simulation pipeline that can generate lens images with realistic subhalo populations in a matter of milliseconds. Leveraging this simulator, we identify the main methodological limitation of our fiducial SBI analysis: training set size. We then adopt a sequential neural posterior estimation (SNPE) approach, allowing us to iteratively refine the distribution of simulated training images to better align with the observed data. Using only one-fifth as many mock Hubble Space Telescope (HST) images, SNPE matches the constraints on the low-mass halo population produced by our best non-sequential model. Our experiments suggest that an over three order-of-magnitude increase in training set size and GPU hours would be required to achieve an equivalent result without sequential methods. While the full potential of the existing strong lens sample remains to be explored, the notable improvement in constraining power enabled by our sequential approach highlights that the current constraints are limited primarily by methodology and not the data itself. Moreover, our results emphasize the need to treat training set generation and model optimization as interconnected stages of any cosmological analysis using simulation-based inference techniques.\n\n", "2404.13970": "2024-04-22, **DALI sensitivity to streaming axion dark matter**, Javier De Miguel et.al., [2404.13970v1](http://arxiv.org/abs/2404.13970v1)\n\n Dark matter substructures emerge naturally in a scenario in which the axion angular field acquires propagating degrees of freedom in a post-inflationary Universe. The DALI experiment is a new generation wavy dark matters interferometer currently in prototyping. Although DALI's main objective is to explore the virialized DM in our Galaxy, to a large degree in this article we explore the prospect for detection of fine grained streams made of axions that would enter the Solar System, as suggested by previous work. We find that DALI will have a sensitivity to encounters with these coherent objects that fully spans the window defined by the coupling strength to photons of representative axion models over a stacked bandwidth of two decades in mass.\n\n", "2404.13867": "2024-04-22, **Stochastic waveform estimation at the fundamental quantum limit**, James W. Gardner et.al., [2404.13867v1](http://arxiv.org/abs/2404.13867v1)\n\n Although measuring the deterministic waveform of a weak classical force is a well-studied problem, estimating a random waveform, such as the spectral density of a stochastic signal field, is much less well-understood despite it being a widespread task at the frontier of experimental physics. State-of-the-art precision sensors of random forces must account for the underlying quantum nature of the measurement, but the optimal quantum protocol for interrogating such linear sensors is not known. We derive the fundamental precision limit, the extended channel quantum Cram\\'er-Rao bound, and the optimal protocol that attains it. In the experimentally relevant regime where losses dominate, we prove that non-Gaussian state preparation and measurements are required for optimality. We discuss how this non-Gaussian protocol could improve searches for signatures of quantum gravity, stochastic gravitational waves, and axionic dark matter.\n\n"}, "supernova": {"2404.15232": "2024-04-23, **Interacting Dark Energy after DESI Baryon Acoustic Oscillation measurements**, William Giarè et.al., [2404.15232v1](http://arxiv.org/abs/2404.15232v1)\n\n We investigate the implications of the Baryon Acoustic Oscillation measurements released by the Dark Energy Spectroscopic Instrument (DESI) for Interacting Dark Energy (IDE) models characterized by an energy-momentum flow from Dark Matter to Dark Energy. By combining Planck-2018 and DESI data, we observe a preference for interactions exceeding the 95% confidence level, yielding a present-day expansion rate $H\\_0=71.4\\pm1.5$ km/s/Mpc, in agreement with SH0ES. This preference remains robust when including measurements of the expansion rate $H(z)$ obtained from the relative ages of massive, early-time, and passively-evolving galaxies, as well as when considering distance moduli measurements from Type-Ia Supernovae sourced from the Pantheon-plus catalog using the SH0ES Cepheid host distances as calibrators. Overall, high and low redshift data can be equally or better explained within the IDE framework compared to $\\Lambda$CDM, while also yielding higher values of $H\\_0$ in better agreement with the local distance ladder estimate.\n\n", "2404.15057": "2024-04-23, **Uncovering an Excess of X-ray Point Sources in the Halos of Virgo Late-type Galaxies**, Zhensong Hu et.al., [2404.15057v1](http://arxiv.org/abs/2404.15057v1)\n\n We present a systematic search for extraplanar X-ray point sources around 19 late-type, highly inclined disk galaxies residing in the Virgo cluster, based on archival Chandra observations reaching a source detection sensitivity of $L\\rm(0.5- 8~keV)\\sim10^{38}\\rm~erg~s^{-1}$. Based on the cumulative source surface density distribution as a function of projected vertical distance from the disk mid-plane, we identify a statistically significant ($\\sim3.3\\sigma$) excess of $\\sim20$ X-ray sources within a projected vertical off-disk distance of $0.92'-2.5'$ ($\\sim4.4-12\\ \\mathrm{kpc}$), the presence of which cannot be explained by the bulk stellar content of the individual galaxies, nor by the cosmic X-ray background. On the other hand, there is no significant evidence for an excess of extraplanar X-ray sources in a comparison sample of field late-type edge-on galaxies, for which Chandra observations reaching a similar source detection sensitivity are available. We discuss possible origins for the observed excess, which include low-mass X-ray binaries (LMXBs) associated with globular clusters, supernova-kicked LMXBs, high-mass X-ray binaries born in recent star formation induced by ram pressure stripping of the disk gas, as well as a class of intra-cluster X-ray sources previously identified around early-type member galaxies of Virgo. We find that none of these X-ray populations can naturally dominate the observed extraplanar excess, although supernova-kicked LMXBs and the effect of ram pressure are most likely relevant\n\n", "2404.14843": "2024-04-23, **Planetary nebula morphologies indicate a jet-driven explosion of SN 1987A and other core-collapse supernovae**, Noam Soker et.al., [2404.14843v1](http://arxiv.org/abs/2404.14843v1)\n\n I demonstrate the usage of planetary nebulae (PNe) to infer that a pair of jets shaped the ejecta of the core-collapse supernova (CCSN) SN 1987A. The main structure of the SN 1987A inner ejecta, the keyhole, comprised two low-intensity zones. The northern one has a bright rim on its front, while the southern one has an elongated nozzle. Earlier comparison of the SN 1987A keyhole with bubbles in the galaxy group NGC 5813 led to its identification as a jet-shaped rim-nozzle structure. Here, I present rim-nozzle asymmetry in planetary nebulae (PNe), thought to be shaped by jets, which solidify the claim that jets powered the ejecta of SN 1987A and other CCSNe. This finding for the iconic SN 1987A with its unique properties strengthens the jittering jets explosion mechanism (JJEM) of CCSNe. In a few hundred years, the CCSN 1987A will have a complicated structure with two main symmetry axes, one along the axis of the three circumstellar rings that two opposite 20,000-years pre-explosion jets shaped, and the other along the long axis of the keyhole that was shaped by the main jet pair of the exploding jets of SN 1987A in the frame of the JJEM.\n\n", "2404.14608": "2024-04-22, **When are galactic winds molecular?**, Aditi Vijayan et.al., [2404.14608v1](http://arxiv.org/abs/2404.14608v1)\n\n The molecular phase of supernova-driven outflows originates from the cold, molecular gas in the disc of a star-forming galaxy, and may carry a substantial fraction of the wind mass flux in some galaxies, but it remains poorly understood. Observations of this phase come mostly from very nearby galaxies due its low surface brightness and covering fraction, and simulations often lack the spatial resolution necessary to resolve it. Here we analytically estimate the survivability of this phase in order to understand under what conditions an galactic wind can contain a significant molecular phase. We show that the molecular content of outflows is primarily determined by two dimensionless numbers: a generalised Eddington ratio describing the strength of the outflow and an ionisation parameter-like quantity describing the strength of the radiation field per baryon. We apply this model to a sample of galaxies and show that, while any molecules entrained in the winds of normal star-forming galaxies should be destroyed close to the galactic disc, the outflows of strong starburst should become increasingly dominated by molecules.\n\n", "2404.14341": "2024-04-22, **Quantifying Scalar Field Dynamics with DESI 2024 Y1 BAO measurements**, Kim V. Berghaus et.al., [2404.14341v1](http://arxiv.org/abs/2404.14341v1)\n\n Quintessence scalar fields are a natural candidate for evolving dark energy. Unlike the phenomenological $w\\_0w\\_a$ parameterization of the dark energy equation of state, they cannot accommodate the phantom regime of dark energy $w(z) < -1$, or crossings into the phantom regime. Recent baryon acoustic oscillation (BAO) measurements by the Dark Energy Spectroscopic Instrument (DESI) indicate a preference for evolving dark energy over a cosmological constant, ranging from $2.6\\sigma-3.9\\sigma$ when fitting to $w\\_0w\\_a$, and combining the DESI BAO measurements with other cosmological probes. In this work, we directly fit three simple scalar field models to the DESI BAO data, combined with cosmic microwave background anisotropy measurements and supernova data sets. Quantifying the preference for scalar field dynamics exhibited by the data, we find that $2-4\\%$ of kinetic scalar field energy $\\Omega\\_{\\rm scf,k}$, is preferred over $\\Lambda$CDM at the $95\\%$ confidence level, for a canonical scalar field with a quadratic or linear potential. Fitting to the supernova data sets Pantheon, Pantheon+, DES-Y5, and Union3, we show that the mild tension ($n\\_{\\sigma}< 3.4 $) under $\\Lambda$CDM emerges from a BAO preference for smaller values of fractional mass-energy density $\\Omega\\_m < 0.29$, while all supernova data sets, except for Pantheon, prefer larger values, $\\Omega\\_m > 0.3$. The tension under $\\Lambda$CDM remains noticeable ($n\\_{\\sigma} <2.8$), when replacing two of the DESI BAO measurements redshift bins with effective redshifts $z\\_{\\text{eff}} =0.51$, and $z\\_{\\text{eff}}= 0.706$ with comparable BOSS DR 12 BAO measurements at $z\\_{\\text{eff}} =0.51$, and $z\\_{\\text{eff}}= 0.61$. Canonical scalar fields as dark energy are successful in mitigating that tension.\n\n", "2404.14130": "2024-04-22, **X-shooter spectroscopy of Liller1 giant stars**, D. A. Alvarez Garay et.al., [2404.14130v1](http://arxiv.org/abs/2404.14130v1)\n\n We present the first comprehensive chemical study of a representative sample of 27 luminous red giant branch (RGB) stars belonging to Liller 1, a complex stellar system in the Galactic bulge. This study is based on medium-resolution near-infrared spectra acquired with X-shooter at the Very Large Telescope. We found a subpopulation counting 22 stars with subsolar metallicity ($<$[Fe/H]$>=-0.31\\pm0.02$ and 1$\\sigma$ dispersion of 0.08 dex) and with enhanced [$\\alpha$/Fe], [Al/Fe], and [K/Fe] that likely formed early and quickly from gas that was mainly enriched by type II supernovae, and a metal-rich population counting 5 stars with supersolar metallicity ($<$[Fe/H]$>$=+0.22$\\pm$0.03 and 1$\\sigma$ dispersion of 0.06 dex) and roughly solar-scaled [$\\alpha$/Fe], [Al/Fe], and [K/Fe] that formed at later epochs from gas that was also enriched by type Ia supernovae. Moreover, both subpopulations show enhanced [Na/Fe], as in the bulge field, about solar-scaled [V/Fe], and depletion of [C/Fe] and $^{12}$C/$^{13}$C with respect to the solar values. This indicates that mixing and extra-mixing processes during the RGB evolution also occur at very high metallicities. Notably, no evidence of a Na-O anticorrelation, which is considered the fingerprint of genuine globular clusters, has been found. This challenges any formation scenarios that invoke the accretion of a molecular cloud or an additional stellar system onto a genuine globular cluster. The results of this study underline the strong chemical similarity between Liller 1 and Terzan 5 and support the hypothesis that these complex stellar systems might be fossil fragments of the epoch of Galactic bulge formation.\n\n", "2404.13833": "2024-04-22, **The Self-Consistency of DESI Analysis and Comment on \"Does DESI 2024 Confirm $Λ$CDM?\"**, Deng Wang et.al., [2404.13833v1](http://arxiv.org/abs/2404.13833v1)\n\n We demonstrate that the constraints on the evolution of dark energy implemented by the DESI collaboration may be insufficient or incomplete using their own BAO data. Using large enough prior ranges for the present-day equation of state of dark energy $\\omega\\_0$ and amplitude of dark energy evolution $\\omega\\_a$, we obtain the complete $1\\,\\sigma$ and $2\\,\\sigma$ constraints $\\omega\\_0=1.04^{+0.91+2.00}\\_{-1.00-1.90}$ and $\\omega\\_a=-7.4^{+3.8+6.8}\\_{-3.2-7.3}$ indicating a beyond $2\\,\\sigma$ preference of quintessence-like dark energy today and an evidence of evolving dark energy at beyond $2\\,\\sigma$ CL, respectively. Our results are different from $\\omega\\_0=-0.55^{+0.39}\\_{-0.21}$ and the $2\\,\\sigma$ upper limit $\\omega\\_a<-1.32$ reported by the DESI collaboration \\cite{DESI:2024mwx}. Employing a data combination of cosmic microwave background, DESI BAO and type Ia supernova, we obtain the $1\\,\\sigma$, $2\\,\\sigma$ and $3\\,\\sigma$ constraints $\\omega\\_0=-0.707^{+0.089+0.18+0.24}\\_{-0.089-0.17-0.22}$ and $\\omega\\_a=-1.09^{+0.38+0.67+0.82}\\_{-0.31-0.72-1.00}$, which reveals a $\\sim4\\,\\sigma$ evidence of dynamical dark energy when the redshift $z\\lesssim0.1$. We verify that the BAO data point from luminous red galaxies at the effective redshift $z\\_{\\rm eff}=0.51$ hardly affects the joint constraint from the data combination of cosmic microwave background, DESI BAO and type Ia supernova. We also point out the shortcomings and advantages of the binning method widely used in cosmological analyses.\n\n", "2404.13809": "2024-04-22, **Open Cluster Dynamics under the Influence of Outflow-Ambient Interactions**, Muxin Liu et.al., [2404.13809v1](http://arxiv.org/abs/2404.13809v1)\n\n Outflowing stars impinging upon ambient gas experience accelerations due to the gravitational feedback from the morphology of the interaction betweem the outflow and the ambient gas. Such \"negative dynamical friction\" (NDF), in contrast to the conventional \"dynamical friction\" (DF), is studied for its impact on the dynamics of open clusters immersed in a uniform ambient gas. We modify the $N$-body integration code REBOUND with both NDF and DF implemented according to the outflow conditions of each star in a consistently constructed model open cluster. The evolution of stars is also involved in determining the gas-star interactions throughout their stellar lives. Compared to DF-only and gas-free models with identical initial conditions, the NDF-affected cluster is puffier and evaporates faster, as indicated by various diagnostics, including lower velocity dispersions and larger half-mass and half-light radii. Neutron stars with fast winds are expelled from the cluster due to their intensive NDF effect, even without the \"kicks\" by asymmetric supernovae. Exploration of parameter space confirms that the NDF effect is generally enhanced with higher ambient gas densities, in qualitatively agreement with the expression of acceleration. Outflow-ambient interactions should be considered for the proper interpretation of the evolution of stellar dynamics in clusters.\n\n"}}