{"neutrino": {"2411.14377": "2024-11-21, **The constraining power of the Marked Power Spectrum: an analytical study**, Marco Marinucci et.al., [2411.14377v1](http://arxiv.org/abs/2411.14377v1)\n\n The marked power spectrum - a two-point correlation function of a transformed density field - has emerged as a promising tool for extracting cosmological information from the large-scale structure of the Universe. In this work, we present the first comprehensive analytical study of the marked power spectrum's sensitivity to primordial non-Gaussianity (PNG) of the non-local type. We extend previous effective field theory frameworks to incorporate PNG, developing a complete theoretical model that we validate against the Quijote simulation suite. Through a systematic Fisher analysis, we compare the constraining power of the marked power spectrum against traditional approaches combining the power spectrum and bispectrum (P+B). We explore different choices of mark parameters to evaluate their impact on parameter constraints, particularly focusing on equilateral and orthogonal PNG as well as neutrino masses. Our analysis shows that while marking up underdense regions yields optimal constraints in the low shot-noise regime, the marked power spectrum's performance for discrete tracers with BOSS-like number densities does not surpass that of P+B analysis at mildly non-linear scales ($k \\lesssim 0.25 \\,h/\\text{Mpc}$). However, the marked approach offers several practical advantages, including simpler estimation procedures and potentially more manageable systematic effects. Our theoretical framework reveals how the marked power spectrum incorporates higher-order correlation information through terms resembling tree-level bispectra and power spectrum convolutions. This work establishes a robust foundation for applying marked statistics to future large-volume surveys.\n\n", "2411.14355": "2024-11-21, **Measurement of two-neutrino double electron capture half-life of $^{124}$Xe with PandaX-4T**, PandaX Collaboration et.al., [2411.14355v1](http://arxiv.org/abs/2411.14355v1)\n\n Detailed studies of two-neutrino double electron capture (2$\\nu$DEC) is a crucial step towards searching for the neutrino-less mode to explore the Majorana nature of neutrinos. We have measured precisely the half-life of the 2$\\nu$DEC process in $^{124}$Xe, utilizing a total exposure of 1.73 tonne$\\cdot$year from the commissioning run and the first science run of the PandaX-4T experiment. A time-dependent background model in the $\\mathcal{O}$(10 keV) energy is constructed for the first time in PandaX-4T data. With an unbinned maximum likelihood fit, we determine the half-life of the 2$\\nu$DEC process to be $(1.03\\pm0.15\\_{\\rm stat}\\pm0.06\\_{\\rm sys})\\times 10^{22}$$\\,$yr. Furthermore, we have evaluated the branching ratio for both electrons captured from the $K$ shell ($KK$) to be $(65\\pm5)\\%$, which aligns with the $^{124}$Xe nuclear model calculations within 1.5$\\,$$\\sigma$.\n\n", "2411.14348": "2024-11-21, **Neutrino Flavour Waves Through the Quantum Vacuum: A Theory of Oscillations**, Markku Oksanen et.al., [2411.14348v1](http://arxiv.org/abs/2411.14348v1)\n\n We propose a theory for neutrino oscillations, in which the flavour neutrinos are treated as waves of massless particles propagating in a \"refractive quantum vacuum\" and obeying a relativistically covariant equation of motion. The difference in strength between weak interactions and mass-generating interactions is argued to allow for the production and detection of flavour neutrinos in weak interactions as massless particles. They experience the mass-generating interactions as coherent forward scattering in the Brout-Englert-Higgs vacuum, which induces macroscopically multi-refringent effects. The flavour neutrino wave is then found to have a universal effective refractive mass in vacuum and a unique group velocity for a given energy. The coherence of the wave is manifest throughout and, at every moment of the propagation, the energy of the waves is the same. The standard oscillation probability in vacuum is obtained and the effects of matter are incorporated in a natural way.\n\n", "2411.14234": "2024-11-21, **Steering in Neutrino Oscillations with Non-Standard Interaction**, Lekhashri Konwar et.al., [2411.14234v1](http://arxiv.org/abs/2411.14234v1)\n\n In this study, we analyze the influence of Non-Standard Interaction (NSI) on steering in three-flavor neutrino oscillations, with a focus on the NO$\\nu$A and DUNE experimental setups. DUNE, having a longer baseline, exhibits a more pronounced deviation towards NSI in steering compared to NO$\\nu$A. Within the energy range where DUNE's maximum flux appears, the steering value for DUNE shows a $21\\%$ deviation from the Standard Model (SM) to NSI for normal ordering (NO), while for inverted ordering (IO), the steering value increases by approximately $15\\%$ relative to the SM. We conduct a comparative analysis of nonlocality, steering, and entanglement. Additionally, we express steering in terms of three-flavor neutrino oscillation probabilities and explore the relationship between steering inequality and concurrence.\n\n", "2411.14218": "2024-11-21, **A Comprehensive Hadronic Code Comparison for Active Galactic Nuclei**, Matteo Cerruti et.al., [2411.14218v1](http://arxiv.org/abs/2411.14218v1)\n\n We perform the first dedicated comparison of five hadronic codes (AM$^3$, ATHE$\\nu$A, B13, LeHa-Paris, and LeHaMoC) that have been extensively used in modeling of the spectral energy distribution (SED) of jetted active galactic nuclei. The purpose of this comparison is to identify the sources of systematic errors (e.g., implementation method of proton-photon interactions) and to quantify the expected dispersion in numerical SED models computed with the five codes. The outputs from the codes are first tested in synchrotron self-Compton scenarios that are the simplest blazar emission models used in the literature. We then compare the injection rates and spectra of secondary particles produced in pure hadronic cases with monoenergetic and power-law protons interacting on black-body and power-law photon fields. We finally compare the photon SEDs and the neutrino spectra for realistic proton-synchrotron and leptohadronic blazar models. We find that the codes are in excellent agreement with respect to the spectral shape of the photons and neutrinos. There is a remaining spread in the overall normalization that we quantify, at its maximum, at the level of $\\pm 40\\%$. This value should be used as an additional, conservative, systematic uncertainty term when comparing numerical simulations and observations.\n\n", "2411.14206": "2024-11-21, **Clarity through the Neutrino Fog: Constraining New Forces in Dark Matter Detectors**, Pablo Blanco-Mas et.al., [2411.14206v1](http://arxiv.org/abs/2411.14206v1)\n\n The PANDAX-4T and XENONnT experiments present indications of Coherent Elastic Neutrino Nucleus Scattering (CE$\\nu$NS) from ${}^{8}$B solar neutrinos at 2.6$\\sigma$ and 2.7$\\sigma$, respectively. This constitutes the first observation of the neutrino \"floor\" or \"fog\", an irreducible background that future dark matter searches in terrestrial detectors will have to contend with. Here, we first discuss the contributions from neutrino-electron scattering and from the Migdal effect in the region of interest of these experiments, and we argue that they are non-negligible. Second, we make use of the recent PANDAX-4T and XENONnT data to derive novel constraints on light scalar and vector mediators coupling to neutrinos and quarks. We demonstrate that these experiments already provide world-leading laboratory constraints on new light mediators in some regions of parameter space.\n\n", "2411.14091": "2024-11-21, **Towards a precision calculation of $N_{\\rm eff}$ in the Standard Model IV: Impact of positronium formation**, Marco Drewes et.al., [2411.14091v1](http://arxiv.org/abs/2411.14091v1)\n\n We present in this work the first assessment of the previously unexplored effect of positronium formation on the value of the effective number of neutrino species in the Standard Model, $N\\_{\\mathrm{eff}}^{\\mathrm{SM}}$. We find that the expected impact on $N\\_{\\mathrm{eff}}^{\\mathrm{SM}}$ crucially depends on the temperature at which positronium equilibrates as well as the rate at which this equilibration happens. The dominant factor limiting the formation process is the melting of positronium at high temperatures driven by Debye screening of the electrostatic potential and scatterings with real photons. Using simple physical arguments, we estimate that positronium forms at temperatures around $50-80$ keV. If formation and equilibration were instantaneous, the resulting change in $N\\_{\\mathrm{eff}}^{\\mathrm{SM}}$ would be at most $\\|\\Delta N\\_{\\mathrm{eff}}\\| \\sim 10^{-4}$, comparable to other uncertainties in the current benchmark value for $N\\_{\\mathrm{eff}}^{\\mathrm{SM}}$. A more gradual formation could however yield a larger change, necessitating in turn a more detailed investigation before we can conclusively neglect the effect of positronium formation on $N\\_{\\mathrm{eff}}^{\\mathrm{SM}}$.\n\n", "2411.14051": "2024-11-21, **TeV Window to Grand Unification: Higgs's Light Color Triplet Partner**, Gia Dvali et.al., [2411.14051v1](http://arxiv.org/abs/2411.14051v1)\n\n The color-triplet partner of the Higgs doublet, called a $T$-particle, is a universal feature of Grand Unification. It has been shown some time ago that this particle can be accessible for direct production in collider experiments. In this paper we point out that the $T$-particle represents a simultaneous low-energy probe of baryon number violation as well as of the origin of the neutrino mass, linking the mediation of proton decay with oscillations of the neutron into a sterile neutrino. We point out a triple correlation between its collider signatures, proton decay measurements and the searches for the magnetic resonance disappearance of free neutrons in cold neutron experiments. In this way, the $T$-particle can provide a diversity of correlated experimental windows into Grand Unification.\n\n", "2411.13895": "2024-11-21, **Neutrino mass genesis in Scoto-Inverse Seesaw with Modular $A_4$**, Gourab Pathak et.al., [2411.13895v1](http://arxiv.org/abs/2411.13895v1)\n\n We propose a hybrid scotogenic inverse seesaw framework in which the Majorana mass term is generated at the one-loop level through the inclusion of a singlet fermion. This singlet Majorana fermion also serves as a viable thermal relic dark matter candidate due to its limited interactions with other fields. To construct the model, we adopt an $A\\_4$ flavour symmetry in a modular framework, where the odd modular weight of the fields ensures their stability, and the specific modular weights of the couplings yield distinctive modular forms, leading to various phenomenological consequences. The explicit flavour structure of the mass matrices produces characteristic correlation patterns among the parameters. Furthermore, we examine several testable implications of the model, including neutrinoless double beta decay ($0\\nu\\beta\\beta$), charged lepton flavour violation (cLFV), and direct detection prospects for the dark matter candidate. These features make our model highly testable in upcoming experiments.\n\n"}, "dark matter": {"2411.14392": "2024-11-21, **Convolutional Vision Transformer for Cosmology Parameter Inference**, Yash Gondhalekar et.al., [2411.14392v1](http://arxiv.org/abs/2411.14392v1)\n\n Parameter inference is a crucial task in modern cosmology that requires accurate and fast computational methods to handle the high precision and volume of observational datasets. In this study, we explore a hybrid vision transformer, the Convolution vision Transformer (CvT), which combines the benefits of vision transformers and convolutional neural networks. We use this approach to infer the $\\Omega\\_m$ and $\\sigma\\_8$ cosmological parameters from simulated dark matter and halo fields. Our experiments indicate that the constraints on $\\Omega\\_m$ and $\\sigma\\_8$ obtained using CvT are better than the traditional vision transformer (ViT) and CNN, using either dark matter or halo fields. For CvT, pretraining on dark matter fields proves advantageous for improving constraints using halo fields compared to training a model from the beginning. However, ViT and CNN do not show these benefits. The CvT is more efficient than ViT since, despite having more parameters, it requires a training time similar to that of ViT and has similar inference times. The code is available at \\url{https://github.com/Yash-10/cvt-cosmo-inference/}.\n\n", "2411.14176": "2024-11-21, **Dark universe inspired by the Kaluza-Klein gravity**, Kimet Jusufi et.al., [2411.14176v1](http://arxiv.org/abs/2411.14176v1)\n\n We explore the potential implications of Kaluza-Klein (KK) gravity in unifying the dark sector of the Universe. Through dimensional reduction in KK gravity, the 5D spacetime framework can be reformulated in terms of a 4D spacetime metric, along with additional scalar and vector fields. From the 4D perspective, this suggests the existence of a tower of particle states, including KK gravitons with massive spin-0 and spin-1 states, in addition to the massless spin-2 gravitons of general relativity (GR). By assuming a minimal coupling between the self-interacting scalar field and the gauge field, a \"mass\" term emerges for the spin-1 gravitons. This, in turn, leads to long-range gravitational effects that could modify Newton's law of gravity through Yukawa-type corrections. We draw an analogy with superconductivity theory, where the condensation of a scalar field results in the emergence of massive spin-1 particles producing repulsive forces, along with an increase of the gravitational force due the correction to Newton's constant. Assuming an environment-dependent mass for the spin-1 graviton, near the galactic center the repulsive force from this spin-1 graviton is suppressed by an additional attractive component from Newton's constant corrections, resulting in a Newtonian-like, attraction-dominated effect. In the galaxy's outer regions, the repulsive force fades due to its short range, making dark matter appear only as an effective outcome of the dominant attractive corrections. This approach also explains dark matter's emergence as an apparent effects on cosmological scales while our model is equivalent to the scalar-vector-tensor gravity theory. Finally, we examine the impact of dark matter on the primordial gravitational wave (PGW) spectrum and show that it is sensitive to dark matter effects, providing an opportunity to test this theory through future GW observatories.\n\n", "2411.14128": "2024-11-21, **Exploration of new experimental strategies for the detection of ultralight dark matter : laboratory searches on ground and in space**, Jordan Gué et.al., [2411.14128v1](http://arxiv.org/abs/2411.14128v1)\n\n Ultralight dark matter (ULDM), as a class of low mass (< 1 eV) dark matter (DM) candidates, is a compelling alternative to historically dominant models such as WIMPs and has recently gained significant attention in the scientific community. In this thesis, we study various experimental schemes for the direct detection of ULDM, both on ground and in space. More precisely, we propose a theoretical modeling of current and futuristic experiments, and we derive an estimation of their respective sensitivity. We mainly concentrate on three distinct phenomenologies. The first one is the coupling between a DM U(1) field, known as the dark photon (DP), and electromagnetism, which induces a small electric field oscillating at the DP Compton frequency. We study how to detect this electric field using atoms inside a cavity and through dish antennas. The second main phenomenology considered in this thesis is the oscillation of rest mass and transition frequencies of atoms and test masses. These oscillations could be produced by the non-universal coupling of standard matter with a scalar ULDM candidate (dilaton or axion-like particle). We study how to detect such couplings in classical tests of the universality of free fall (UFF), atom interferometry and using LISA. Finally, we study the effect of vacuum birefringence and dichroism induced by the coupling between axions and photons, and how it could be detected with optical cavities, fibers, and LISA.\n\n", "2411.14063": "2024-11-21, **Probing dark matter halo profiles with multi-band observations of gravitational waves**, Divya Tahelyani et.al., [2411.14063v1](http://arxiv.org/abs/2411.14063v1)\n\n In this paper, we evaluate the potential of multiband gravitational wave observations to constrain the properties of static dark matter spikes around intermediate-mass ratio inspirals. The influence of dark matter on the orbital evolution of the compact binary is incorporated as a correction to the inspiral Newtonian gravitational waveform. We show that the observations from the proposed space-based detector GWSat, sensitive within the deci-Hz frequency band, when combined with that of the third-generation ground-based detectors like the Einstein Telescope and Cosmic Explorer, will produce significantly improved error estimates for all parameters. In particular, our results demonstrate that the joint multiband approach substantially refines the bounds on the dark matter spike parameters-namely, the power-law index and spike density-by factors of approximately $10^6$ and $10^3$, respectively, compared to observations employing only third-generation gravitational wave detectors.\n\n", "2411.14047": "2024-11-21, **Dynamical friction can flip the hierarchical three-body system**, Li Hu et.al., [2411.14047v1](http://arxiv.org/abs/2411.14047v1)\n\n In recent years, the long-term effects of non-linear perturbations were found to be important for the evolution of the hierarchical triple system, which, for the central third body of a larger mass, can significantly suppress the occurrences of orbital flip that changes the sign of angular momentum of inner binary. However, as the third-body mass increases significantly, the ambient dark matter spike becomes much more dense, rendering the effect of dynamical friction non-negligible. In this work, we take the dynamical friction into account for the first time in the hierarchical triple system up to the octupole order and find that the suppressed occurrences of orbital flip could be recovered, making the detection of orbital flip a potential probe of the dark matter via observations of either electromagnetic waves or gravitational waves.\n\n", "2411.13889": "2024-11-21, **The SABRE South Technical Design Report Executive Summary**, E. Barberio et.al., [2411.13889v1](http://arxiv.org/abs/2411.13889v1)\n\n In this Technical Design Report (TDR) we describe the SABRE South detector to be built at the Stawell Underground Physics Laboratory (SUPL). The SABRE South detector is designed to test the long-standing DAMA/LIBRA signal of an annually modulating rate consistent with dark matter by using the same target material. SABRE South uses seven ultra-high purity NaI(Tl) crystals (with a total target mass of either 35 kg or 50 kg), hermetically sealed in copper enclosures that are suspended within a liquid scintillator active veto. High quantum efficiency and low background Hamamatsu R11065 photomultiplier tubes are directly coupled to both ends of the crystal, and enclosed with the crystal in an oxygen free high thermal conductivity copper enclosure. The active veto system consists of 11.6 kL of linear alkylbenzene (LAB) doped with a mixture of fluorophores and contained in a steel vessel, which is instrumented with at least 18 Hamamatsu R5912 photomultipliers. The active veto tags key radiogenic backgrounds intrinsic to the crystals, such as ${^{40}}$K, and is expected to suppress the total background by 27% in the 1-6 keV region of interest. In addition to the liquid scintillator veto, a muon veto is positioned above the detector shielding. This muon veto consists of eight EJ-200 scintillator modules, with Hamamatsu R13089 photomultipliers coupled to both ends. With an expected total background of 0.72 cpd/kg/keV, SABRE South can test the DAMA/LIBRA signal with 5$\\sigma$ discovery or 3$\\sigma$ exclusion after two years of data taking.\n\n", "2411.13871": "2024-11-21, **Charged Fuzzy Dark Matter Black Holes**, Z. Yousaf et.al., [2411.13871v1](http://arxiv.org/abs/2411.13871v1)\n\n We investigate the impact of fuzzy dark matter (FDM) on supermassive black holes (SMBHs) characterized by a spherical charge distribution. This work introduces a new class of spherically symmetric, self-gravitational relativistic charged models for FDM haloes, using the Einasto density model. This study enables the dark matter (DM) to appear as the matter ingredient, which constructs the black hole and extends the non-commutative mini black hole stellar solutions. By considering the charged anisotropic energy-momentum tensor with an equation of state (EoS) $p\\_{r}=-\\rho$, we explore various black hole solutions for different values of the Einasto index and mass parameter. Our approach suggests that the central density of the resulting black hole model mimics the usual de Sitter core. Furthermore, we discuss the possibility of constructing a charged self-gravitational droplet by replacing the above-mentioned EoS with a non-local one. However, under these circumstances, the radial pressure is observed to be negative. Ultimately, we consider various possibilities of constructing DM black holes, featuring intermediate masses that could evolve into galaxies. Consequently, some of these theoretical models have the potential to replace the usual black hole solutions of the galactic core. Simultaneously, these models are physically beneficial for being comprised of the fundamental matter component of the cosmos. Due to the outcomes of this paper, we would be able to study the connection between BH and DM by formulating stable stellar structures featuring fuzzy mass distributions derived from the Einasto distribution of DM halos.\n\n", "2411.13816": "2024-11-21, **Constraints on primordial black holes from the observed number of Icarus-like ultrahigh magnification events**, Hiroki Kawai et.al., [2411.13816v1](http://arxiv.org/abs/2411.13816v1)\n\n Icarus is an individual star observed near the macro-critical curve of the MACS J1149 cluster, with the magnification factor estimated to be an order of thousands. Since microlenses near the macro-critical curve influence the number of such high-magnification events, the observed occurrence of Icarus-like events is expected to provide a useful constraint on the properties of microlenses. We first study the mass and mass fraction of microlenses consistent with the observed number of events assuming a single microlens component with a monochromatic mass function, finding that stars that contribute to the intracluster light (ICL) are consistent at the 95% confidence level. We then consider the contribution of primordial black holes (PBHs), which are one of the alternatives to the standard cold dark matter, as microlenses in addition to ICL stars. The derived parameter space indicates that a large abundance of PBHs with a mass around $1\\ M\\_{\\odot}$ and a fraction of PBHs to the total dark matter of $f\\_{\\rm PBH} \\gtrsim 0.2$ cannot explain the observed number of Icarus-like events and therefore is excluded. The methodology developed in this paper can be used to place tighter constraints on the fraction of PBHs from ongoing and future observations of ultrahigh magnification events.\n\n", "2411.13776": "2024-11-21, **Maximizing Quantum Enhancement in Axion Dark Matter Experiments**, Chao-Lin Kuo et.al., [2411.13776v1](http://arxiv.org/abs/2411.13776v1)\n\n We provide a comprehensive comparison of linear amplifiers and microwave photon-counters in axion dark matter experiments. The study is done assuming a range of realistic operating conditions and detector parameters, over the frequency range between 1--30 GHz. As expected, photon counters are found to be advantageous under low background, at high frequencies ($\\nu>$ 5 GHz), {\\em if} they can be implemented with robust wide-frequency tuning or a very low dark count rate. Additional noteworthy observations emerging from this study include: (1) an expanded applicability of off-resonance photon background reduction, including the single-quadrature state squeezing, for scan rate enhancements; (2) a much broader appeal for operating the haloscope resonators in the over-coupling regime, up to $\\beta\\sim 10$; (3) the need for a detailed investigation into the cryogenic and electromagnetic conditions inside haloscope cavities to lower the photon temperature for future experiments; (4) the necessity to develop a distributed network of coupling ports in high-volume axion haloscopes to utilize these potential gains in the scan rate.\n\n"}, "supernova": {"2411.14209": "2024-11-21, **Aeos: Transport of metals from minihalos following Population III stellar feedback**, Jennifer Mead et.al., [2411.14209v1](http://arxiv.org/abs/2411.14209v1)\n\n We investigate how stellar feedback from the first stars (Population III) distributes metals through the interstellar and intergalactic medium using the star-by-star cosmological hydrodynamics simulation, Aeos. We find that energy injected from the supernovae of the first stars is enough to expel a majority of gas and injected metals beyond the virial radius of halos with mass $M\\_* \\lesssim 10^7$ M$\\_\\odot$, regardless of the number of supernovae. This prevents self-enrichment and results in a non-monotonic increase in metallicity at early times. Most minihalos ($M \\gtrsim 10^5 \\, \\rm M\\_\\odot$) do not retain significant fractions of the yields produced within their virial radii until they have grown to halo masses of $M \\gtrsim 10^7 \\, \\rm M\\_\\odot$. The loss of metals to regions well beyond the virial radius delays the onset of enriched star formation and extends the period that Population III star formation can persist. We also explore the contributions of different nucleosynthetic channels to 10 individual elements. On the timescale of the simulation (lowest redshift $z=14.3$), enrichment is dominated by core-collapse supernovae for all elements, but with a significant contribution from asymptotic giant branch winds to the s-process elements, which are normally thought to only be important at late times. In this work, we establish important mechanisms for early chemical enrichment which allows us to apply Aeos in later epochs to trace the evolution of enrichment during the complete transition from Population III to Population II stars.\n\n"}}