{"neutrino": {"2511.10581": "2025-11-13, **UHECRs Propagation and their Multimessengers: Upper limits and the Impact of the Extragalactic Magnetic Field**, Rodrigo Sasse et.al., [2511.10581v1](http://arxiv.org/abs/2511.10581v1)\n\n The detection of high-energy astrophysical multimessengers establishes a connection between ultra-high-energy cosmic rays (UHECRs) and powerful cosmic accelerators. Interactions of UHECRs with radiation fields and interstellar matter generate very-high-energy (VHE) gamma rays and neutrinos, making them key components in the multimessenger framework. This study examines the cosmogenic gamma-ray and neutrino fluxes resulting from UHECR propagation in starburst galaxies with supernova remnants, with a particular focus on NGC 1068, a well-established high-energy neutrino source. Using extragalactic simulations, we calculate the upper limit on cosmic-ray luminosity, applying upper limits on gamma-ray fluxes derived from observations by H.E.S.S. and MAGIC observatories. Our analysis incorporates the effects of both extragalactic and galactic magnetic fields on particle propagation, constraining the maximum extragalactic magnetic field (EGMF) intensity to $10^{-14}~\\mathrm{G}$ to ensure that at least 90\\% of injected UHECRs successfully reach Earth. The results provide upper limits on gamma-ray and neutrino fluxes, estimates of UHECR luminosity for individual sources, and predictions for the detection capabilities of the Cherenkov Telescope Array Observatory regarding gamma-ray emission from NGC 1068. Combining gamma-ray, neutrino, and UHECR observations reinforces the importance of multimessenger approaches in understanding the nature of high-energy astrophysical sources and their role in cosmic-ray acceleration.\n\n", "2511.10332": "2025-11-13, **Using the Cherenkov Telescope onboard EUSO-SPB2 for Target of Opportunity searches of very high energy neutrino sources**, Tobias Heibges et.al., [2511.10332v1](http://arxiv.org/abs/2511.10332v1)\n\n The Extreme Universe Space Observatory on a Super Pressure Balloon 2 (EUSO-SPB2) mission launched from Wanaka New Zealand on May 13, 2023. The mission ended after 36 h due to a balloon leak that resulted in the payload being lost in the Pacific Ocean. Over the course of the mission, the onboard Cherenkov Telescope (CT) was pointed just below the Earth's limb to search for optical signals from upward-moving extensive air showers that were induced by decaying tau-leptons that were generated by the conversion of $>10$ PeV tau-neutrinos in Earth. Such very-high energy (VHE) neutrinos may be produced in several classes of astrophysical sources that are suspected of possibly accelerating particles to ultra-high energies. In this contribution, we discuss the EUSO-SPB2 Target-of-Opportunity (ToO) campaign to search for VHE neutrino signals coming from astrophysical sources that crossed the CT's field of view ($6.4^\\circ \\times 12.8^\\circ$). We also present a new software tool designed for scheduling observations, the Neutrino Target Scheduler, that we developed to support the ToO campaign. We also calculate upper limits on the neutrino fluences from sources observed during the ToO campaign. Our observations demonstrate the viability of conducting ToO follow-up observations from a near space environment with future balloon missions, such as the pathfinder mission POEMMA-Balloon with Radio.\n\n", "2511.10329": "2025-11-13, **Curious Case of CGRaBS J0211+1051: Observational Evidence of Lepto-Hadronic Origin of High-Energy Emission?**, Sunil Chandra et.al., [2511.10329v1](http://arxiv.org/abs/2511.10329v1)\n\n We present an extensive analysis of the multi-wavelength data of the low-synchrotron-peaked BL Lac object CGRaBS J0211+1051, which has been gathered over more than ten years with many observatories. Two major gamma-ray flares have been observed during the Fermi era: one in January 2011 and other in June 2019. During these events, CGRaBS J0211+1051 was also bright in other energy bands. On the other hand, there are also examples of optical activity that do not exhibit any comparable gamma-ray variability. Here, we study the temporal and spectral characteristics of the object in an attempt to understand the emission mechanisms operating in this source. A peculiar feature in its spectrum is the X-ray domain, which is unusually soft considering its object class. Interestingly, the relatively soft UV and optical spectrum does not extrapolate well to the X-rays. To mimic the observed SEDs during quiescent and flaring periods, we use both a purely leptonic and a hadro-leptonic modeling approach to reproduce four broadband SEDs from various epochs. When taking into account the steep optical-UV spectrum, we find that the hadro-leptonic scenarios better explains the SEDs compared to the purely leptonic model. The hadro-leptonic interpretation of the two gamma-ray flares suggests that CGRaBS J0211+1051 could be both a potential neutrino emitter and TeV-bright (E>10 TeV). Thus, it may offer a unique test bed to check for hadro-leptonic contributions to the multi-messenger emission in blazar jets.\n\n", "2511.10288": "2025-11-13, **Probing thermal leptogenesis and dark matter through primordial gravitational waves from a supercooled universe**, Peter Athron et.al., [2511.10288v1](http://arxiv.org/abs/2511.10288v1)\n\n We explore the cosmological dynamics of a supercooled first-order phase transition in the classically conformal $U(1)\\_{B-L}$ extension of the Standard Model, where radiative symmetry breaking simultaneously generates the right-handed neutrino (RHN) masses, and a strong stochastic gravitational-wave (GW) background. The slow decay of the scalar field into RHNs can induce an early matter-dominated (EMD) era whose duration is sensitive to the RHN mass and gauge coupling $g^\\prime$. This non-standard cosmological phase reshapes the GW spectrum and leaves a distinctive RHN-mass-dependent spectral distortion that correlates with the flavour regime of thermal leptogenesis. Within this framework, one RHN can serve as a dark matter candidate produced nonthermally from scalar decays, while the remaining states generate the baryon asymmetry via thermal leptogenesis. For $g^\\prime=0.5$, we identify such a parameter region, and show that with singlet extensions, even with a smaller gauge coupling, one can realise this mechanism for the three-flavour regime. The resulting GW signals, amplified by supercooling and modified by EMD, provide a unique window to probe the scale and flavour structure of leptogenesis in future high-frequency GW observations.\n\n", "2511.09945": "2025-11-13, **Slow neutrinos: non-linearity and momentum-space emulation**, Amol Upadhye et.al., [2511.09945v1](http://arxiv.org/abs/2511.09945v1)\n\n Recent cosmological bounds on the sum of neutrino masses, M\\_nu = sum m\\_nu, are in tension with laboratory oscillation experiments, making cosmological tests of neutrino free-streaming imperative. In order to study the scale-dependent clustering of massive neutrinos, we develop a fast linear response method, FAST-nu f, applicable to neutrinos and other non-relativistic hot dark matter. Using it as an accurate linear approximation to help us reduce the dynamic range of emulator training data, based upon a non-linear perturbation theory for massive neutrinos, we improve the emulator's accuracy at small M\\_nu and length scales by a factor of two. We significantly sharpen its momentum resolution for the slowest neutrinos, which, despite their small mass fraction, dominate small-scale clustering. Furthermore, we extend the emulator from the degenerate to the normal and inverted mass orderings. Applying this new emulator, Cosmic-Enu-II, to large halos in N-body simulations, we show that non-linear perturbation theory can reproduce the neutrino density profile in the halo outskirts, 2R\\_vir < r < 10R\\_vir , to better than 10%.\n\n"}, "dark matter": {"2511.10620": "2025-11-13, **The Atacama Cosmology Telescope. CMB Lensing from Daytime Data: A First Demonstration**, Irene Abril-Cabezas et.al., [2511.10620v1](http://arxiv.org/abs/2511.10620v1)\n\n We present a cosmic microwave background (CMB) lensing power spectrum analysis using daytime data (11am-11pm UTC) gathered by the Atacama Cosmology Telescope (ACT) over the period 2017-2022 (ACT Data Release 6). This dataset is challenging to analyze because the Sun heats and deforms the telescope mirror, complicating the characterization of the telescope. We perform more than one hundred null and consistency checks to ensure the robustness of our measurement and its compatibility with nighttime observations. We detect the CMB lensing power spectrum at 17$σ$ significance, with an amplitude $A\\_\\textrm{lens} = 1.045 \\pm 0.063$ with respect to the prediction from the best-fit Planck-ACT CMB power spectrum $Λ$CDM cosmology. In combination with the Dark Energy Spectroscopic Instrument (DESI) Baryon Acoustic Oscillation (BAO) data, this corresponds to a constraint on the amplitude of matter fluctuations $σ\\_8 = 0.826 \\pm 0.027$. The analysis presented here is especially relevant for ground-based millimeter-wave CMB experiments, paving the way for future analyses making use of both nighttime and daytime data to place tight constraints on cosmological parameters.\n\n", "2511.10617": "2025-11-13, **Dark Matter from Holography**, Oem Trivedi et.al., [2511.10617v1](http://arxiv.org/abs/2511.10617v1)\n\n Previous studies have examined the holographic principle as a means of producing dark energy. Here we propose instead the possibility of holographic dark matter. In this case, dark matter does not arise in the framework of particle physics but is derived from the infrared cutoff set by the horizon scale. Using the Ricci cutoff, and a universe containing only baryons and radiation, we can account for the dark matter and naturally explain the coincidence between baryonic and nonbaryonic contributions to the density. In the presence of a pre-existing vacuum energy density our model reverses the sign of this density, thus accounting for the fact that certain string theories generically predict a negative vacuum energy, but observations require a positive value.\n\n", "2511.10603": "2025-11-13, **Dark Matter and Baryon Asymmetry from Monopole-Axion Interactions**, Raymond T. Co et.al., [2511.10603v1](http://arxiv.org/abs/2511.10603v1)\n\n We introduce a novel mechanism where the kinetic energy of a rotating axion can be dissipated by the interactions with dark magnetic monopoles. This mechanism leads to a framework where the QCD axion and dark monopoles account for the dark matter density, and the observed baryon asymmetry is generated through the rotating QCD axion via axiogenesis. The monopoles acquire masses from a nonzero axion field, and they can transition between different quantized dyonic levels in the presence of a rotating axion field. The axion kinetic energy is dissipated by the transition, and thus the axion abundance is depleted to the observed dark matter abundance. We predict that the axion decay constant should be below $10^9$ GeV to explain the observed dark matter and baryon densities.\n\n", "2511.10589": "2025-11-13, **A Fast Earth-scattering Formalism for Light Dark Matter with Dark Photon Mediators**, Agustín Lantero-Barreda et.al., [2511.10589v1](http://arxiv.org/abs/2511.10589v1)\n\n While Dark Matter (DM) is typically assumed to interact only very weakly with the particles of the Standard Model, many direct detection experiments are currently exploring regions of parameter space where DM can have a large scattering cross section. In this scenario, DM may scatter in the atmosphere and Earth before reaching the detector, leading to a distortion of the DM flux and a daily modulation of the signal rate as the detector is shielded by more or less of the Earth at different times of day. This modulation is a distinctive signature of strongly-interacting DM and provides a powerful method of discriminating against time-independent backgrounds. However, the calculation of these Earth-scattering effects by Monte Carlo methods is computationally intensive, inhibiting a systematic exploration of the DM parameter space. Here, we present a semi-analytic formalism for calculating Earth-scattering effects, for models of MeV-mass DM which interacts via a dark photon mediator, and release the associated code Verne2. This formalism assumes that DM travels along straight-line trajectories until it scatters and is reflected back along its incoming path, along us to taking into account the affects of both attenuation and reflection in the Earth. We compare this formalism with the results of full Monte Carlo simulations for cross sections within reach of current and future DM-electron scattering searches. We find that Verne2 is accurate to better than 10-30%, making it suitable for performing signal modeling in the search for daily modulation, while reducing the computational cost by a factor of $\\sim10^4$ compared to full Monte Carlo simulations.\n\n", "2511.10582": "2025-11-13, **Co-evolution of baryons and dark matter halos of LYRA dwarf galaxies**, Joaquin Sureda et.al., [2511.10582v1](http://arxiv.org/abs/2511.10582v1)\n\n We use the extremely high-resolution ($m\\_{\\rm bary}=4\\rm{M}\\_\\odot$) LYRA cosmological galaxy formation simulations of six dwarf galaxies with $M\\_{\\rm 200c}\\sim10^9\\rm{M}\\_\\odot$ at $z=0$ to investigate their stellar assembly histories. Based on the age of stars in these galaxies at $z=0$, $40-100\\%$ of their stellar mass was formed by the time of reionization, when star formation (SF) abruptly shuts down. Depending on their halo mass evolution, some of the dwarfs reignite SF post-reionization (rejuvenators), while others remain quenched for the rest of cosmic time (reionization relics). However, the stellar mass of relics can still grow by more than $50\\%$ through mergers post-reionisation. We find clear correlations between metallicity distributions of the galaxies and the fraction of stars formed post-reionization ($f\\_{\\rm post-reio}^\\star$) such that relics have lower median $\\rm [Fe/H]$ with a more prominent low metallicity tail. Moreover, the shape of the galaxies at $z=0$ correlates with their $f\\_{\\rm post-reio}^\\star$, with rejuvenators showing more spherical stellar distribution than relics. This difference arises only post-reionization when rejuvenators become rounder with more SF activity. Similarly, the shape of dark matter (DM) halos in the inner regions display more spherical distributions in rejuvenators than in relics. The shape evolution shows that DM haloes in all galaxy formation simulations become rounder in comparison to their collision-less, DM-only counterparts. However, DM haloes of rejuvenators evolve more significantly. We do not find any correlation between SF activity and formation of shallow DM density cores in these galaxies. These predictions can be tested using upcoming observational data. In particular, our results indicate that the scatter in the mass-metallicity relation in the low mass regime is correlated with SF histories and the shape of galaxies.\n\n", "2511.10490": "2025-11-13, **Toward a Comprehensive Exploration of Flavored Dark Matter Models**, Benedetta Belfatto et.al., [2511.10490v1](http://arxiv.org/abs/2511.10490v1)\n\n We present a comprehensive framework for the study of flavored dark matter models, combining relic density calculations with direct and indirect detection limits, collider constraints, and a global analysis of flavor observables based on SMEFT matching and renormalization-group evolution. The framework applies to scalar or fermionic dark matter, including both self-conjugate and non-self-conjugate cases. As a proof of principle, we analyze two scenarios with Majorana dark matter coupling to right-handed charged leptons and to right-handed down-type quarks, assuming a thermal freeze-out. In the leptophilic case, flavor-violating decays such as $μ\\to e γ$ dominate the constraints, while LHC searches still leave sizable parameter space. For quark couplings, direct detection bounds and meson mixing severely restrict the allowed couplings, favoring hierarchical flavor structures. The toolchain presented in this paper is publicly available on GitHub (https://github.com/lena-ra/Flavored-Dark-Matter).\n\n", "2511.10445": "2025-11-13, **How much can we learn from resolved stellar kinematics of galactic haloes using action-based dynamical models?**, Paula Gherghinescu et.al., [2511.10445v1](http://arxiv.org/abs/2511.10445v1)\n\n Dynamical models are used to study dark matter (DM) in galaxies, how galaxies assemble through mergers, and to test galaxy formation models. Despite its widespread use, there has been no systematic study quantifying how much information can be obtained from just two on-sky positions and line-of-sight velocities, which are typically available for nearby external galaxies. In this work, we introduce axisymmetric, action-based dynamical models that use the positions and velocities of stellar halo stars to jointly constrain the total mass distribution of galaxies and the underlying DM component, as well as the stellar halo phase-space distribution. We rigorously test the method using both idealised equilibrium galaxy mocks and cosmological hydrodynamical simulations from the Auriga suite, systematically assessing how its performance degrades as the available phase-space information is progressively reduced. We further examine the impact of galaxy inclination, modelling assumptions, and methodological systematics on the recovered mass profiles. A crucial development in this work is the improved marginalisation of the model likelihood over missing phase-space dimensions. Our models successfully recover the total and DM mass distributions, as well as the kinematic properties of the stellar tracers, within the derived confidence intervals. However, we find that with limited (3D or 4D) phase-space information, the flattening of the DM halo cannot be constrained with any degree of certainty. Nevertheless, the recovered mass profile is insensitive to the flattening. This finding is independently validated by Schwarzschild modelling tests.\n\n", "2511.10368": "2025-11-13, **Point defects and their dynamic behaviors in silver monolayer intercalated between graphene and SiC**, Van Dong Pham et.al., [2511.10368v1](http://arxiv.org/abs/2511.10368v1)\n\n Point defects or impurities can give rise to sharp local modifications in the structure and electronic properties of two-dimensional metals, serving as an intriguing atomic-level solid-state model for both fundamental and application research. In this work, we investigated atomic-scale defects in a two-dimensional silver monolayer intercalated at the interface between epitaxial graphene and SiC using a scanning tunneling microscope. Distinct dark and bright defects are identified as in-plane vacancies and substitutional impurities within the silver monolayer, each hosting a localized electronic state induced solely by the defect. Remarkably, under excitation of tunneling electrons assisted by a negative bias voltage, the defects can hop inelastically which is reminiscent of the hydrogen switching in the cavity of an organic molecule. The hopping can be reversibly controlled by the scanning tunneling microscope tip, allowing the defects to function as atomic-scale two-level conductance switches. Defect hopping further allows us to gain a deeper understanding of their origins and the relationship between dark and bright defect species. This study constitutes a pathway toward understanding and controlling defects in two-dimensional metals with atomic precision, revealing previously unexplored dynamic behavior with potential applications in nanoelectronics.\n\n", "2511.10317": "2025-11-13, **A Dynamical Scalar Field Model for Dark Energy: Addressing the Hubble Tension and Cosmic Evolution**, Arpit Kottur et.al., [2511.10317v1](http://arxiv.org/abs/2511.10317v1)\n\n We propose a dynamical dark energy model based on a canonical scalar field with a hybrid potential of the form $V(φ) = V\\_{0}e^{-λφ} + V\\_{1}φ^{n}$. We constrain the model's 11-dimensional parameter space using a comprehensive combination of cosmological data, including the Planck 2018 Cosmic Microwave Background (CMB) power spectra, Baryon Acoustic Oscillations (BAO), the Pantheon+ supernova sample, and the matter power spectrum from SDSS. The model provides an excellent fit to the data, with a reduced chi-squared of $χ^2\\_{\\text{red}} = 0.987$, while successfully alleviating the Hubble constant tension. Our analysis yields a Hubble constant of $H\\_0 = 70.0$ km/s/Mpc, reducing the discrepancy between early and late-universe measurements. The data favor a negative power-law index of $n \\approx -0.92$. A model comparison using the Bayesian Information Criterion finds that the standard $Λ$CDM model is still slightly preferred ($Δ\\text{BIC} = 2.178$) due to its fewer parameters. Nevertheless, our results demonstrate that this hybrid potential model is a compelling, physically motivated alternative to a cosmological constant.\n\n", "2511.10086": "2025-11-13, **Trapped and Unstable: Axion-like particle fragmentation at finite temperature**, Nicklas Ramberg et.al., [2511.10086v1](http://arxiv.org/abs/2511.10086v1)\n\n We investigate the emergence of a resonant behavior in axion-trapped misalignment models featuring finite-temperature potential barriers. As the temperature decreases and the field is released from its trapped configuration, inhomogeneities are exponentially amplified through an instability in their equation of motion, leading to the fragmentation of the axion field. We show that this process constitutes a novel source of gravitational waves (GWs), analogous to those generated in zero-temperature axion fragmentation, but with distinct characteristics. We quantify the resulting GW spectrum, identifying the peak frequency and amplitude associated with the inhomogeneous axion dynamics. Our results indicate that the GW signal can be enhanced by up to two orders of magnitude compared to the standard fragmentation scenario, while exhibiting a markedly different spectral shape. The parameter space featuring both strong GW signals and reproducing the correct dark matter abundance is, however, limited.\n\n", "2511.10043": "2025-11-13, **Periodic orbits and observational accretion disk around a Schwarzschild-like black hole surrounded by dark matter halo**, Javokhir Sharipov et.al., [2511.10043v1](http://arxiv.org/abs/2511.10043v1)\n\n In this work, we investigate the dynamics of periodic orbits and the properties of accretion disks around a Schwarzschild-like black hole (BH) immersed in a King-type dark matter (DM) halo. Our analysis focuses on how the presence of the King DM halo influences both the behavior of periodic orbits and the radiative characteristics of the accretion disk. We begin by examining time-like periodic geodesic orbits for various configurations characterized by different energy and angular momentum values, represented by the integers $(z, w, v)$. Furthermore, we explore the effects of the King DM halo on time-like periodic geodesics, marginally bound orbits, and innermost stable circular orbits, thereby providing a deeper understanding of how the DM halo environment modifies the behavior of these stable orbits and timelike particle geodesics. Finally, we analyze the null geodesics and the accretion disk properties by studying their direct and secondary images, redshift distributions, and radiation fluxes as observed at infinity for a range of inclination angles. This approach allows us to gain valuable insights into the spacetime geometry of a Schwarzschild-like BH within the King-type DM halo, its physical and radiative properties in the accretion disk, and the corresponding observational implications.\n\n"}, "supernova": {"2511.10631": "2025-11-13, **A Bayesian Perspective on Evidence for Evolving Dark Energy**, Dily Duan Yi Ong et.al., [2511.10631v1](http://arxiv.org/abs/2511.10631v1)\n\n The DESI collaboration reports a significant preference for a dynamic dark energy model ($w\\_0w\\_a$CDM) over the cosmological constant ($Λ$CDM) when their data are combined with other frontier cosmological probes. We present a direct Bayesian model comparison using nested sampling to compute the Bayesian evidence, revealing a contrasting conclusion: for the key combination of the DESI DR2 BAO and the Planck CMB data, we find the Bayesian evidence modestly favours $Λ$CDM (log-Bayes factor $\\ln B = -0.57{\\scriptstyle\\pm0.26}$), in contrast to the collaboration's 3.1$σ$ frequentist significance in favoring $w\\_0w\\_a$CDM. Extending this analysis to also combine with the DES-Y5 supernova catalogue, our Bayesian analysis reaches a significance of $3.07{\\scriptstyle\\pm0.10}\\,σ$ in favour of $w\\_0w\\_a$CDM. By performing a comprehensive tension analysis, employing five complementary metrics, we pinpoint the origin: a significant ($\\approx 2.95σ$), low-dimensional tension between DESI DR2 and DES-Y5 that is present only within the $Λ$CDM framework. The $w\\_0w\\_a$CDM model is preferred precisely because its additional parameters act to resolve this specific dataset conflict. The convergence of our findings with independent geometric analyses suggests that the preference for dynamic dark energy is primarily driven by the resolution of inter-dataset tensions, warranting a cautious interpretation of its statistical significance.\n\n", "2511.10616": "2025-11-13, **A new multiprobe analysis of modified gravity and evolving dark energy**, Zhiyu Lu et.al., [2511.10616v1](http://arxiv.org/abs/2511.10616v1)\n\n We study the $(w\\_0, \\, w\\_a)$ parametrization of the dark energy (DE) equation of state, with and without the effective field theory of dark energy (EFTofDE) framework to describe the DE perturbations, parametrized here by the braiding parameter $α\\_B$ and the running of the Planck mass $α\\_M$. We combine the EFTofLSS full-shape analysis of the power spectrum and bispectrum of BOSS data with the tomographic angular power spectra $C\\_\\ell^{gg}$, $C\\_\\ell^{κg}$, $C\\_\\ell^{Tg}$ and $C\\_\\ell^{Tκ}$, where $g$, $κ$ and $T$ stand for the DESI luminous red galaxy map, Planck PR4 lensing map and Planck PR4 temperature map, respectively. To analyze these angular power spectra, we go beyond the Limber approximation, allowing us to include large-scales data in $C\\_\\ell^{gg}$. The combination of all these probes with Planck PR4, DESI DR2 BAO and DES Y5 improves the constraint on the 2D posterior distribution of $\\{w\\_0, \\, w\\_a\\}$ by $\\sim 50 \\%$ and increases the preference for evolving dark energy over $Λ$ from $3.8 σ$ to $4.6 σ$. When we remove BAO and supernovae data, we obtain a hint for evolving dark energy at $2.3 σ$. Regarding the EFTofDE parameters, we improve the constraints on $α\\_B$ and $α\\_M$ by $\\sim 40 \\%$ and $50 \\%$ respectively, finding results compatible with general relativity at $\\sim 2 σ$. We show that these constraints do not depend on the choice of the BAO and supernovae likelihoods.\n\n", "2511.10317": "2025-11-13, **A Dynamical Scalar Field Model for Dark Energy: Addressing the Hubble Tension and Cosmic Evolution**, Arpit Kottur et.al., [2511.10317v1](http://arxiv.org/abs/2511.10317v1)\n\n We propose a dynamical dark energy model based on a canonical scalar field with a hybrid potential of the form $V(φ) = V\\_{0}e^{-λφ} + V\\_{1}φ^{n}$. We constrain the model's 11-dimensional parameter space using a comprehensive combination of cosmological data, including the Planck 2018 Cosmic Microwave Background (CMB) power spectra, Baryon Acoustic Oscillations (BAO), the Pantheon+ supernova sample, and the matter power spectrum from SDSS. The model provides an excellent fit to the data, with a reduced chi-squared of $χ^2\\_{\\text{red}} = 0.987$, while successfully alleviating the Hubble constant tension. Our analysis yields a Hubble constant of $H\\_0 = 70.0$ km/s/Mpc, reducing the discrepancy between early and late-universe measurements. The data favor a negative power-law index of $n \\approx -0.92$. A model comparison using the Bayesian Information Criterion finds that the standard $Λ$CDM model is still slightly preferred ($Δ\\text{BIC} = 2.178$) due to its fewer parameters. Nevertheless, our results demonstrate that this hybrid potential model is a compelling, physically motivated alternative to a cosmological constant.\n\n"}}