{"neutrino": {"2502.07724": "2025-02-11, **Contrastive Learning for Robust Representations of Neutrino Data**, Alex Wilkinson et.al., [2502.07724v1](http://arxiv.org/abs/2502.07724v1)\n\n In neutrino physics, analyses often depend on large simulated datasets, making it essential for models to generalise effectively to real-world detector data. Contrastive learning, a well-established technique in deep learning, offers a promising solution to this challenge. By applying controlled data augmentations to simulated data, contrastive learning enables the extraction of robust and transferable features. This improves the ability of models trained on simulations to adapt to real experimental data distributions. In this paper, we investigate the application of contrastive learning methods in the context of neutrino physics. Through a combination of empirical evaluations and theoretical insights, we demonstrate how contrastive learning enhances model performance and adaptability. Additionally, we compare it to other domain adaptation techniques, highlighting the unique advantages of contrastive learning for this field.\n\n", "2502.07673": "2025-02-11, **Fock state probability changes in open quantum systems**, Clare Burrage et.al., [2502.07673v1](http://arxiv.org/abs/2502.07673v1)\n\n Open quantum systems are powerful effective descriptions of quantum systems interacting with their environments. Studying changes of Fock states probabilities can be intricate in this context since the prevailing description of open quantum dynamics is by master equations of the systems' reduced density matrices, which usually requires finding solutions for a set of complicated coupled differential equations. In this article, we show that such problems can be circumvented by employing a recently developed path integral-based method for directly computing reduced density matrices in scalar quantum field theory. For this purpose, we consider a real scalar field $\\phi$ as an open system interacting via a $\\lambda \\chi^2\\phi^2$-term with an environment comprising another real scalar field $\\chi$ that has a finite temperature. In particular, we investigate how the probabilities for observing the vacuum or two-particle states change over time if there were initial correlations of these Fock states. Subsequently, we apply our resulting expressions to a neutrino toy model. We show that, within our model, lighter neutrino masses would lead to a stronger distortion of the observable number of particles due to the interaction with the environment after the initial production process.\n\n", "2502.07301": "2025-02-11, **Wigner-like Parametrization of Canonical Seesaw Models**, Shun Zhou et.al., [2502.07301v1](http://arxiv.org/abs/2502.07301v1)\n\n In this paper, we introduce the Wigner parametrization of unitary matrices and then apply it to the full description of canonical seesaw models, which extend the Standard Model with three right-handed neutrino singlets and account simultaneously for tiny Majorana neutrino masses and the baryon number asymmetry in the Universe. In the Wigner parametrization, the strong hierarchy between the electroweak scale $\\Lambda^{}\\_{\\rm EW} \\approx 10^2~{\\rm GeV}$ and the seesaw scale $\\Lambda^{}\\_{\\rm SS} \\approx 10^{14}~{\\rm GeV}$ is generally captured by three small rotation angles $\\{\\vartheta^{}\\_1, \\vartheta^{}\\_2, \\vartheta^{}\\_3\\} \\approx {\\cal O}(\\Lambda^{}\\_{\\rm EW}/\\Lambda^{}\\_{\\rm SS})$, and all the remaining parameters reside in four $3\\times 3$ unitary matrices. The connection between the Wigner parametrization and those in the literature is also established.\n\n"}, "dark matter": {"2502.07781": "2025-02-11, **Detectability of dark matter subhalo impacts in Milky Way stellar streams**, Junyang Lu et.al., [2502.07781v1](http://arxiv.org/abs/2502.07781v1)\n\n Stellar streams are a promising way to probe the gravitational effects of low-mass dark matter (DM) subhalos. In recent years, there has been a remarkable explosion in the number of stellar streams detected in the Milky Way, and hundreds more may be discovered with future surveys such as LSST. Studies of DM subhalo impacts on streams have so far focused on a few of the thinnest and brightest streams, and it is not known how much information can be gained from the others. In this work, we develop a method to quickly estimate the minimum detectable DM subhalo mass of a given stream, where subhalo mass here refers to the total mass of a Plummer sphere. Our work is based on an analytic model for subhalo impacts on circular streams, which allows us to model streams with a wide range of properties including width, length, distance, and stellar density. We consider several observational scenarios, based on current and future surveys including Gaia, DESI, Via, and LSST. We find that at 95% confidence level, a stream like GD-1 has a minimum detectable subhalo mass of $\\sim 6\\times 10^6~\\mathrm{M}\\_{\\odot}$ in Gaia data and $\\sim 8\\times 10^5~\\mathrm{M}\\_{\\odot}$ with LSST 10 year sensitivity. Applying our results to confirmed Milky Way streams, we rank order them by their sensitivity to DM subhalos and identify promising ones for further study.\n\n", "2502.07714": "2025-02-11, **Statistical selection of high-redshift, neutral-hydrogen-rich, lensed galaxies with the Square Kilometre Array**, Charissa Button et.al., [2502.07714v1](http://arxiv.org/abs/2502.07714v1)\n\n Deep wide spectral line surveys with the Square Kilometre Array (SKA) will expand the cosmic frontiers of neutral atomic hydrogen (HI) in galaxies. However, at cosmologically significant redshifts ($z \\gtrsim 0.5$), detections will typically be spatially unresolved and limited to the highest mass systems. Gravitational lensing could potentially alleviate these limitations, enabling lower mass systems to be studied at higher redshift and spatially resolved dynamical studies of some HI discs. Additionally, lensed HI systems would select foreground dark matter haloes using a different, more extended baryonic tracer compared to other lens surveys. This may result in a wider selected range of foreground dark matter halo properties, such as the concentration parameter. This paper uses the distortion of the observed HI mass function (HIMF) produced by strong gravitational lensing to find a flux density criterion for selecting lensed HI sources in future SKA-Mid spectral line surveys. This selection approach could yield lensed HI source densities in the range of $\\sim 0.1$--$10$ galaxies per square degree out to a redshift of $z \\simeq 3$ covered by SKA-MID Band 1. Although the sample sizes are modest, even with the proposed SKA-Mid surveys, the selection approach is straightforward and should have a 50% efficiency without any additional information, such as low-impact-factor or lower-redshift massive galaxies. The efficiency of selecting high-redshift, neutral-hydrogen-rich, lensed galaxies should then be greatly enhanced by using SKA-MID data in concert with the Vera C. Rubin Large Survey of Space and Time.\n\n", "2502.07613": "2025-02-11, **Signatures of modified gravity from the gravitational Aharonov-Bohm effect**, Kimet Jusufi et.al., [2502.07613v1](http://arxiv.org/abs/2502.07613v1)\n\n To date, no observational confirmation of dark matter particles has been found. In this paper, we put forward an alternative approach to inferring evidence for dark matter through modified gravity, without invoking fundamental dark matter particles. Specifically, we explore the possibility of extracting signatures of Kaluza-Klein gravity through the gravitational Aharonov-Bohm effect. Kaluza-Klein theory has recently been proposed as an alternative to the dark sector, and predicts a tower of particles, including spin-0 and spin-1 gravitons alongside the usual spin-2 gravitons, which can gravitationally couple to matter. We thus analyze a quantum system in free fall around a gravitating body in the presence of a modified Yukawa-like gravitational potential, and determine the gravitational phase induced by the additional degrees of freedom introduced by the Kaluza-Klein model. Our results reveal that, in addition to the usual result from General Relativity, the quantum wave function of the system exhibits an additional effect: a splitting of the energy levels with a new quantum number due to the extra vector gravitational degrees of freedom. The energy splitting difference between general relativity and Kaluza-Klein gravity is found to be of the order of meV for an atomic system and eV for a nuclear system. Similar values also arise in generic modified gravity models and can be feasibly tested in the future. Numerical estimates for the graviton mass are also provided, and potential imprints on gravitational waves are mentioned.\n\n", "2502.07539": "2025-02-11, **Neutralino dark matter in gauge mediation**, Michihisa Takeuchi et.al., [2502.07539v1](http://arxiv.org/abs/2502.07539v1)\n\n We explore the potential of neutralino dark matter within the framework of gauge-mediated supersymmetry (SUSY) breaking. In our models, the lightest neutralino, as the lightest SUSY particle (LSP), is a viable dark matter candidate, assuming a gravitino mass of $\\mathcal{O}(100)~\\mathrm{TeV}$. The models are formulated in five-dimensional space-time, where the SUSY breaking field and the matter fields are placed on separate branes to avoid issues related to flavor and CP violation. Four distinct neutralino dark matter scenarios are studied: bino-wino coannihilation, higgsino dark matter, wino dark matter, and entropy-diluted bino dark matter. For each case, we determine the allowed parameter spaces and evaluate their consistency with existing experimental limits. Additionally, we examine the potential for testing these models through future investigations at the High-Luminosity Large Hadron Collider (HL-LHC) and through dark matter direct detection experiments.\n\n", "2502.07450": "2025-02-11, **Probing Dark Photons through Gravitational Decoupling of Mass-State Oscillations in Interstellar Media**, Zhang Bo et.al., [2502.07450v1](http://arxiv.org/abs/2502.07450v1)\n\n We propose a novel mechanism for photon-dark photon mass state oscillations mediated by gravitational separation during propagation through the interstellar medium. This phenomenon establishes a new avenue for the detection of dark matter. By analyzing gravitational lensing data from quasars, we investigate the sensitivity of this approach to dark photons. Our analysis demonstrates constraints of$\\epsilon<10^-2$ in the dark photon mass range of $10^{-14}eV$. Furthermore, we propose potential applications of this mechanism to astrophysical systems with strong gravitational fields, such as neutron stars and black hole accretion disks.\n\n", "2502.07437": "2025-02-11, **Modified theories of gravity at different curvature scales**, Susobhan Mandal et.al., [2502.07437v1](http://arxiv.org/abs/2502.07437v1)\n\n General Relativity (GR) remains the cornerstone of gravitational physics, providing remarkable success in describing a wide range of astrophysical and cosmological phenomena. However, several challenges underscore the urgent need to explore modified gravity theories. GR struggles to reconcile with quantum mechanics, fails to provide fundamental explanations for dark matter and dark energy, and faces limitations in describing extreme regimes such as black hole singularities and the very early universe. This review provides an organized perspective on modified gravity theories by classifying them based on the principles of GR they preserve or violate. Specifically, we consider three broad categories: (1) metric theories that uphold local Lorentz invariance (LLI) and gauge invariance, (2) theories that break gauge invariance, LLI, or parity, and (3) beyond-metric theories that violate the Einstein's equivalence principle (EEP). This classification highlights the underlying assumptions of GR that these theories challenge or extend, providing a framework for understanding their motivations and implications. The review also discusses the current and upcoming experimental and observational tests of GR, including those probing its foundational principles, such as LLI, gauge invariance, and EEP. For each class of modified theories, we examine their ability to address critical open questions in cosmology and black hole physics. These include their potential to explain the accelerated expansion of the current universe, the nature of dark matter, and deviations in black hole dynamics from GR predictions. This review aims to provide a structured understanding of modified gravity theories and their observational implications in the multimessenger era by focusing on the principles preserved or violated. [abridged]\n\n", "2502.07317": "2025-02-11, **Position reconstruction and surface background model for the PandaX-4T detector**, Zhicheng Qian et.al., [2502.07317v1](http://arxiv.org/abs/2502.07317v1)\n\n We report the position reconstruction methods and surface background model for the PandaX-4T dark matter direct search experiment. This work develops two position reconstruction algorithms: template matching (TM) method and photon acceptance function (PAF) method. Both methods determine the horizontal position of events based on the light pattern of secondary scintillation collected by the light sensors. After a comprehensive evaluation of resolution, uniformity, and robustness, the PAF method was selected for position reconstruction, while the TM method was employed for verification. The PAF method achieves a bulk event resolution of 1.0 mm and a surface event resolution of 4.4 mm for a typical $S2$ signal with a bottom charge of 1500 PE (about 14 keV). The uniformity is around 20\\%. Robustness studies reveal average deviations of 5.1 mm and 8.8 mm for the commissioning run (Run0) and the first science run (Run1), respectively, due to the deactivation of certain PMTs. A data-driven surface background model is developed based on the PAF method. The surface background is estimated to be $0.09 \\pm 0.06$ events for Run0 (0.54 tonne$\\cdot$year) and $0.17 \\pm 0.11$ events for Run1 (1.00 tonne$\\cdot$year).\n\n"}, "supernova": {"2502.07619": "2025-02-11, **The Interaction of a Supernova Remnant with background interstellar turbulence**, Giuseppe Prete et.al., [2502.07619v1](http://arxiv.org/abs/2502.07619v1)\n\n Supernova explosions (SNe) are among the most energetic events in the Universe. After the explosion, the material ejected by the Supernova expands throughout the interstellar medium (ISM) forming what is called Supernova Remnant (SNR). Shocks associated with the expanding SNR are sources of galactic cosmic rays, that can reach energy of the PeV order. In these processes, a key role is played by the magnetic field. It is known that the ISM is turbulent with an observed magnetic field of about a few $\\mu$G, made by the superposition of a uniform and a fluctuating component. During the SNR expansion, the shock interacts with a turbulent environment, leading to a distortion of the shock front and a compression of the medium. In this work, we use the MagnetoHydroDynamics (MHD) PLUTO code to mimic the evolution of the blast wave associated with the SNR. We make a parametric study varying the level of density and magnetic field fluctuations in the interstellar medium, with the aim of understanding the best parameter values able to reproduce real observations. We introduce a novel analysis technique based on two-dimensional autocorrelation function $C({\\ell})$ and the second order structure function $S\\_2(\\ell)$, quantifying the level of anisotropy and the turbulence correlation lengths. By interpolating the autocorrelation function on a polar grid, we extract the power spectra of turbulence at the SNR. Finally, a preliminary comparison with Chandra observations of SN 1006 is also presented.\n\n", "2502.07559": "2025-02-11, **Genetic evolution of a multi-generational population in the context of interstellar space travels -- Part II: Phenotypic effects of gene expression**, Frédéric Marin et.al., [2502.07559v1](http://arxiv.org/abs/2502.07559v1)\n\n In the first paper of this series, we included the effects of population genetics in the agent-based Monte Carlo code HERITAGE under the hypothesis of neutral phenotypic effects. It implied that mutations (genetic changes) had only neutral physical manifestations. We now relax this assumption by including genetic effects of mutation and neo-mutations (from radiations) onto the population's life expectancy, fertility, pregnancy chances and miscarriage rates. When applied to a population aboard a generation ship that travels at sub-light speed towards a distant exoplanet, we demonstrate that natural selection indirectly affects the genetic structure of a population via the contribution of phenotypes, in agreement with past studies in conservation biology. For large starting crews (about 500 individuals), the effect aligns with the neutral hypothesis and the frequency of alleles (for non-sexual chromosomes) is stable over centuries. Results are completely different if the spacecraft shielding, integrated into hull design, fails to efficiently protect the crew from high-energy cosmic rays and showers of secondary particles. We tested different scenarios, in which the level of radiation is either fixed at normal or extreme levels, or changing over time due to, e.g., shield degradation, on-board nuclear incident or the outburst of a supernova situated 50 light-years away.\n\n", "2502.07421": "2025-02-11, **Stereograph: Stereoscopic event reconstruction using graph neural networks applied to CTAO**, Hana Ali Messaoud et.al., [2502.07421v1](http://arxiv.org/abs/2502.07421v1)\n\n The CTAO (Cherenkov Telescope Array Observatory) is an international observatory currently under construction. With more than sixty telescopes, it will eventually be the largest and most sensitive ground-based gamma-ray observatory. CTAO studies the high-energy universe by observing gamma rays emitted by violent phenomena (supernovae, black hole environments, etc.). These gamma rays produce an atmospheric shower when entering the atmosphere, which emits faint blue light, observed by CTAO's highly sensitive cameras. The event reconstruction consists of analyzing the images produced by the telescopes to retrieve the physical properties of the incident particle (mainly direction, energy, and type). A standard method for performing this reconstruction consists of combining traditional image parameter calculations with machine learning algorithms, such as random forests, to estimate the particle's energy and class probability for each telescope. A second step, called stereoscopy, combines these monoscopic reconstructions into a global one using weighted averages. In this work, we explore the possibility of using Graph Neural Networks (GNNs) as a suitable solution for combining information from each telescope. The \"graph\" approach aims to link observations from different telescopes, allowing analysis of the shower from multiple angles and producing a stereoscopic reconstruction of the events. We apply GNNs to CTAO-simulated data from the Northern Hemisphere and show that they are a very promising approach to improving event reconstruction, providing a more performant stereoscopic reconstruction. In particular, we observe better energy and angular resolutions(before event selection) and better separation between gamma photons and protons compared to the Random Forest method.\n\n", "2502.07185": "2025-02-11, **Expansion-history preferences of DESI and external data**, Prakhar Bansal et.al., [2502.07185v1](http://arxiv.org/abs/2502.07185v1)\n\n We explore the origin of the preference of DESI Year-1 baryon acoustic oscillation (BAO) measurements and external data from cosmic microwave background (CMB) and type Ia supernovae (SNIa) that dark energy behavior departs from that expected in the standard cosmological model with vacuum energy ($\\Lambda$CDM). In our analysis, we allow a flexible scaling of the expansion rate with redshift that nevertheless allows reasonably tight constraints on the quantities of interest, and adopt and validate a simple yet accurate compression of the CMB data that allows us to constrain our phenomenological model of the expansion history. We find that data consistently show a preference for a $\\sim$3-5% increase in the expansion rate at $z\\simeq 0.5$ relative to that predicted by the standard $\\Lambda$CDM model, in excellent agreement with results from the less flexible $(w\\_0, w\\_a)$ parameterization which was used in previous analyses. Even though our model allows a departure from the best-fit $\\Lambda$CDM model at zero redshift, we find no evidence for such a signal. We also find no evidence (at greater than 1$\\sigma$ significance) for a departure of the expansion rate from the $\\Lambda$CDM predictions at higher redshifts for any of the data combinations that we consider. Overall, our results strengthen the robustness of the findings using the combination of DESI, CMB, and SNIa data to dark-energy modeling assumptions.\n\n"}}