{"neutrino": {"2510.07236": "2025-10-08, **Texture-zeros in minimal seesaw from non-invertible symmetry fusion rules**, Zheng Jiang et.al., [2510.07236v1](http://arxiv.org/abs/2510.07236v1)\n\n The $Z\\_2$ gauging of $Z\\_N$ symmetry can enforce certain elements of the fermion Yukawa couplings to vanish. We have performed a systematical study of texture zero patterns of lepton mass matrices in the minimal seesaw model, and we present all the possible patterns of the charged lepton Yukawa coupling $Y\\_E$, neutrino Yukawa coupling $Y\\_{\\nu}$, right-handed neutrino mass matrix $M\\_R$ and the light neutrino mass matrix $M\\_{\\nu}$ which can be derived from the $Z\\_2$ gauging of $Z\\_N$ symmetry. The realization of the textures with the maximum number of zeros and the second maximum number of zeros from non-invertible symmetry is studied, and the phenomenological implications in neutrino oscillation are discussed.\n\n", "2510.07107": "2025-10-08, **A two scalar triplets model as common origin for dark matter, neutrino masses, baryon asymmetry and inflation**, Sin Kyu Kang et.al., [2510.07107v1](http://arxiv.org/abs/2510.07107v1)\n\n We propose an extension of the standard model (SM) by two SU(2) triplet scalars and an inert SU(2) doublet. We demonstrate that this setup can simultaneously produce an inflaton and baryon asymmetry in the early universe, provide a dark matter candidate and explain the smallness of neutrino masses. The two triplets are particularly important as they become mediators for the production of dark matter and the generation of lepton asymmetry, as well as contribute an inflaton. The inert doublet results in a dark matter candidate. The required CP-violation for lepton asymmetry is obtained by interference between the triplet mediators that communicate the dark sector to the SM sector. More precisely, the complex Breit-Wigner propagators of the triplets and their mixing, result in an asymmetric production of leptons and antileptons that is boosted before dark matter freeze-out. In this case, simultaneously achieving enough dark matter relic abundance and proper matter-antimatter asymmetry limits the available parameter space of the model. Moreover, the scalar triplets are coupled non-minimally to gravity and give rise to the inflaton. We calculate the inflationary parameters and check that we can obtain predictions consistent with Planck constraints from 2018. We also perform an analysis of the reheating for the inflaton decays/annihilations to relativistic SM particles.\n\n", "2510.06702": "2025-10-08, **State preparation and symmetries**, Ivana Miháliková et.al., [2510.06702v1](http://arxiv.org/abs/2510.06702v1)\n\n We demonstrate the importance of symmetries in Variational Quantum Eigensolver (VQE) algorithms to prepare the ground or specific low-lying states of quantum Hamiltonians. We examine two spin problems, one with random all-to-all couplings inspired by neutrino flavor evolution in supernovae, and the standard Heisenberg spin Hamiltonian on a $4 \\times 3$ lattice. The neutrino Hamiltonian has the total spin $J$ and third component $J\\_{\\rm{z}}$ as its only symmetries. The Heisenberg model has these symmetries plus translational invariance and reflection symmetry.   We demonstrate that the convergence of variational methods is dramatically improved by keeping all symmetries. In both cases a nearly exact solution can be obtained in cases where standard unconstrained variational algorithms fail. Since variational algorithms can use standard Trotter steps as part of the optimization, allowing additional correlations that obey all the symmetries of the Hamiltonian will speed convergence of variational algorithms. This will lead to faster convergence than standard projection algorithms.\n\n", "2510.06665": "2025-10-08, **Doping of a Borexino-like Liquid Scintillator with Tellurium-Diols**, Hans Th. J. Steiger et.al., [2510.06665v1](http://arxiv.org/abs/2510.06665v1)\n\n One of the most promising approaches for future neutrinoless double beta decay searches is to incorporate a candidate isotope into the liquid scintillator of a next-generation neutrino detector. In this study, a sample of the high-performance 1,2,4-Trimethylbenzene-based liquid scintillator from the Borexino detector was loaded with different concentrations of Te-diols. Therefore,a novel and completely water-free synthesis in a non-acidic organic environment at room temperature was used. Key parameters of the loaded samples were analyzed and compared with those of the pure Borexino liquid. Both the emission spectrum and transmission remained nearly unchanged,even at high doping levels. The reduction in light yield was moderate, with approximately 8,400 photons emitted for a 1 MeV energy deposition by an electron at 1$\\%$ tellurium loading. The time profile of the light emission induced by alpha particles was also investigated, revealing that the scintillation response becomes significantly faster with increasing tellurium concentration.\n\n", "2510.06616": "2025-10-08, **Instrumentation of JUNO 3-inch PMTs**, Jilei Xu et.al., [2510.06616v1](http://arxiv.org/abs/2510.06616v1)\n\n Over 25,600 3-inch photomultiplier tubes (PMTs) have been instrumented for the central detector of the Jiangmen Underground Neutrino Observatory. Each PMT is equipped with a high-voltage divider and a frontend cable with waterproof sealing. Groups of sixteen PMTs are connected to the underwater frontend readout electronics via specialized multi-channel waterproof connectors. This paper outlines the design and mass production processes for the high-voltage divider, the cable and connector, as well as the waterproof potting of the PMT bases. The results of the acceptance tests of all the integrated PMTs are also presented.\n\n", "2510.06574": "2025-10-08, **Nuclear and electron scattering by neutrinos and dark matter in condensed systems**, James B. Dent et.al., [2510.06574v1](http://arxiv.org/abs/2510.06574v1)\n\n Low-threshold dark matter detectors, in particular cryogenic detectors based on dielectric materials, are among the best tools for probing sub-GeV dark matter masses. In the coming years detectors of this type will become sensitive to solar neutrino scattering. Previous work has shown that, for dark matter scattering at very low recoil energies, one must include collective excitations of the electrons in the solid. In this work, we have computed the collective excitations due to neutrino scattering on electrons and nuclei. We find the full electron-scattering response at leading order is captured by 5 structure factors and identify the leading component with the electron energy-loss function. Then, using silicon and germanium detectors as an example, we perform a dark matter sensitivity study and compute their respective neutrino floors. Lastly, we show that these detectors are sensitive to unexplored scenarios of beyond-Standard Model neutrino physics, within the exposure required to reach the neutrino floor.\n\n", "2510.06526": "2025-10-07, **A geometrical approach to neutrino oscillation parameters**, Mohammad Ful Hossain Seikh et.al., [2510.06526v1](http://arxiv.org/abs/2510.06526v1)\n\n We propose a geometric hypothesis for neutrino mixing: twice the sum of the three mixing angles equals $180^\\circ$, forming a Euclidean triangle. This condition leads to a predictive relation among the mixing angles and, through trigonometric constraints, enables reconstruction of the mass-squared splittings. The hypothesis offers a phenomenological resolution to the $\\theta\\_{23}$ octant ambiguity, reproduces the known mass hierarchy patterns, and suggests a normalized geometric structure underlying the PMNS mixing. We show that while an order-of-magnitude scale mismatch remains (the absolute splittings are underestimated by $\\sim 10\\times$), the triangle reproduces mixing ratios with notable accuracy, hinting at deeper structural or symmetry-based origins. We emphasize that the triangle relation is advanced as an empirical, phenomenological organizing principle rather than a result derived from a specific underlying symmetry or dynamics. It is testable and falsifiable: current global-fit values already lie close to satisfying the condition, and improved precision will confirm or refute it. We also outline and implement a simple $\\chi^2$ consistency check against global-fit inputs to quantify agreement within present uncertainties.\n\n", "2510.06356": "2025-10-07, **Lepton flavor from a horizontal symmetry in a slice of AdS$_5$**, Leandro Da Rold et.al., [2510.06356v1](http://arxiv.org/abs/2510.06356v1)\n\n We build a model of lepton flavor in a slice of AdS$\\_5$. We add to the 5D SM fields a set of neutrino fields, as well as a horizontal U(1) symmetry and a flavon field, all propagating in the bulk. The electroweak and U(1) symmetries are spontaneously broken by a potential localized on the infrared boundary. We show that in a flavor anarchic scenario, by suitable choice of the 5D masses and the U(1) charges, the masses of the SM leptons and the PMNS matrix can be naturally generated. The neutrino masses are Dirac like, with a normal ordered hierarchical spectrum, $\\Delta m\\_{32}^2\\approx m\\_3^2$, $\\Delta m\\_{21}^2\\approx m\\_2^2\\gg m\\_1^2$, and a suppressed $\\theta\\_{13}$ mixing angle. We find configurations where the charged lepton mixing angles are suppressed by powers of the Cabibbo angle ($\\lambda\\_C$) relative to vanilla anarchic partial compositeness, consequently reducing CP and lepton flavor violation. Specifically, the Wilson coefficient for the electron electromagnetic dipole moment exhibits $\\lambda\\_C^2$ suppression, while those governing $\\mu\\to e\\gamma$ and $\\mu-e$ vector operators are suppressed by $\\lambda\\_C^{3/2}$ compared to the anarchic scenario without U(1) horizontal symmetry.\n\n", "2510.06114": "2025-10-07, **Multiprobe constraints on early and late time dark energy**, Alexander Reeves et.al., [2510.06114v1](http://arxiv.org/abs/2510.06114v1)\n\n We perform a multiprobe analysis combining cosmic microwave background (CMB) data from Planck and the Atacama Cosmology Telescope (ACT), ACT CMB lensing, and large-scale structure (LSS) measurements from the Dark Energy Spectroscopic Instrument (DESI), including DESI Legacy Imaging Survey (LS) galaxies and baryon acoustic oscillations (BAOs). We present the first $5\\times2$pt analysis of ACT DR6 lensing, DESI LS, and Planck ISW. Within $\\Lambda$CDM, this yields $S\\_8 = \\sigma\\_8(\\Omega\\_m/0.3)^{0.5} = 0.819 \\pm 0.016$, in good agreement with primary CMB inferences and provides a sound-horizon-free Hubble constant constraint of $H\\_0 = 70.0 \\pm 4.4$ km s$^{-1}$ Mpc$^{-1}$. Then, combining with CMB primary and BAO, we reconfirm a CMB-BAO discrepancy in the $\\Omega\\_m$-$\\frac{D\\_v}{r\\_d}$ plane, which is heightened when combining BAO with the $5\\times2$pt data vector. We explore two dark-energy extensions that may reconcile this: an early-time modification, early dark energy (EDE), and late-time dynamical dark energy (DDE) parameterized by $w\\_0w\\_a$. For CMB primary+BAO+$5\\times2$pt, we find a $3.3\\sigma$ preference for DDE over $\\Lambda$CDM, while EDE is modestly favoured at $2.3\\sigma$. The models address different shortcomings of $\\Lambda$CDM: DDE relaxes the neutrino mass bound ($M\\_\\nu<0.17$eV vs. $<0.050$eV under $\\Lambda$CDM), making it compatible with neutrino oscillation measurements, while EDE raises the Hubble constant to $H\\_0=70.5\\pm1.2\\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, easing the discrepancy with SH0ES. However, neither model resolves both issues simultaneously. Our analysis indicates that both DDE and EDE remain viable extensions of $\\Lambda$CDM within current uncertainties and demonstrates the capacity of combined probes to place increasingly stringent constraints on cosmological parameters.\n\n", "2510.05880": "2025-10-07, **nCTEQ global analysis of nuclear PDFs**, M. Klasen et.al., [2510.05880v1](http://arxiv.org/abs/2510.05880v1)\n\n We review the series of specific nCTEQ analyses of nuclear parton distribution functions (PDFs) published since 2020 and present preliminary results of a new global analysis. Building on a modern proton baseline without nuclear data and extending the kinematic range, it combines and updates the previous separate analyses that focused on Jefferson Lab neutral-current deep-inelastic scattering (DIS), neutrino DIS and dimuon production, and the currently available CERN LHC data, in particular on W/Z-boson, single inclusive hadron, and heavy-quark production.\n\n", "2510.05841": "2025-10-07, **Gravitational Wave Signatures of Warm Dark Matter in Gauge Extensions of the Standard Model**, Lucia A. Popa et.al., [2510.05841v1](http://arxiv.org/abs/2510.05841v1)\n\n We study the left-right symmetric extension of the Standard Model (LRSM), featuring a TeV-scale right-handed (RH) gauge boson $W\\_R$ and three RH neutrinos. This setup naturally realises the type-II seesaw mechanism for active neutrino masses. We identify the conditions that yield sufficient entropy dilution to reconcile the keV sterile neutrino dark matter energy density with observations while inducing an early matter domination (EMD) phase. These constrain the lightest active neutrino mass to 8.59 x 10^{-10} eV < m\\_{\\nu\\_1} < 5.06 x 10^{-9} eV$. The resulting frequency-dependent suppression of the stochastic gravitational wave (GW) background is set by the mass and lifetime of the heavier RH neutrinos. Computing the signal-to-noise ratio (SNR) for future detectors, we find that a blue-tilted primordial tensor spectrum can boost the GW signal to detectable levels (SNR > 10) in experiments such as LISA, BBO, and DECIGO.\n\n"}, "dark matter": {"2510.07103": "2025-10-08, **Unified Dark Matter and Dark Energy in a model of Non-Canonical Scalar-Tensor Theory**, Nihal Jalal Pullisseri et.al., [2510.07103v1](http://arxiv.org/abs/2510.07103v1)\n\n We consider a model of non-canonical scalar-tensor theory in which the kinetic term in the Brans-Dicke action is replaced by a non-canonical scalar field Lagrangian $\\mathcal{L}(X, \\phi)= \\lambda X^\\alpha \\phi^\\beta - V(\\phi)$ where $X = (1/2) \\partial\\_{\\mu} \\phi \\partial^{\\mu} \\phi$ and $\\alpha$, $\\beta$ and $\\lambda$ are parameters of the model. This can be considered as a simple non-canonical generalization of the Brans-Dicke theory with a potential term which corresponds to a special case of this model with the values of the parameter $\\alpha = 1$, $\\beta = -1$ and $\\lambda = 2w\\_{\\_{BD}}$ where $w\\_{\\_{BD}}$ is the Brans-Dicke parameter. Considering a spatially flat Friedmann-Robertson-Walker Universe with scale factor $a(t)$, it is shown that, in the matter free Universe, the kinetic term $\\lambda X^\\alpha \\phi^\\beta$ can lead to a power law solution $a(t)\\propto t^{n}$ but the maximum possible value of $n$ turns out to be $(1+\\sqrt{3})/4 \\approx 0.683$. When $\\alpha \\geq 18$, this model can lead to a solution $a(t)\\propto t^{2/3}$, thereby mimicking the evolution of scale factor in a cold dark matter dominated epoch with Einstein's General Relativity (GR). With the addition of a linear potential term $V(\\phi) = V\\_{0}\\phi$, it is shown that this model mimics the standard $\\Lambda$CDM model type evolution of the Universe. The larger the value of $\\alpha$, the closer the evolution of $a(t)$ in this model to that in the $\\Lambda$CDM model based on Einstein's GR. The purpose of this paper is to demonstrate that this model with a linear potential can mimic the GR based $\\Lambda$CDM model. However, with an appropriate choice of the potential $V(\\phi)$, this model can provide a unified description of both dark matter and dynamical dark energy, as if it were based on Einstein's GR.\n\n", "2510.06948": "2025-10-08, **When vacuum breaks: a self-consistency test for astrophysical environments in extreme mass ratio inspirals**, Lorenzo Copparoni et.al., [2510.06948v1](http://arxiv.org/abs/2510.06948v1)\n\n Gravitational-wave signals are typically interpreted under the vacuum hypothesis, i.e. assuming negligible influence from the astrophysical environment. This assumption is expected to break down for low-frequency sources such as extreme mass ratio inspirals (EMRIs), which are prime targets for the Laser Interferometer Space Antenna (LISA) and are expected to form, at least in part, in dense environments such as Active Galactic Nuclei or dark-matter spikes/cores. Modeling environmental effects parametrically is challenging due to the large uncertainties in their underlying physics. We propose a non-parametric test for environmental effects in EMRIs, based on assessing the self-consistency of vacuum parameter posteriors inferred from different portions of the signal. Our results demonstrate that this approach can reveal the presence of astrophysical environments, or even deviations from General Relativity, without introducing additional parameters or assumptions about the underlying physics.\n\n", "2510.06921": "2025-10-08, **Dark matter direct search result from InDEx run2 at JUSL**, Susmita Das et.al., [2510.06921v1](http://arxiv.org/abs/2510.06921v1)\n\n The Indian Dark matter search Experiment (InDEx) has been initiated at Jaduguda Underground Science Laboratory (JUSL) to explore the low mass region of dark matter. The detectors used by InDEx are superheated droplet detectors with active liquid C2H2F4. The run1 of InDEx was with 2.47 kg-days of exposure at a threshold of 5.87 keV. In the present work, the run2 of InDEx, the detectors were set at 1.95 keV thresholds with an active liquid mass of 70.4 g. For a runtime of 102.48 days, the experimental results set constraint on spin-independent at 20.4 GeV/c2 and on spin-dependent at 21.0 GeV/c2 WIMP mass respectively. There is a shift of the most sensitive WIMP mass towards the lower region and an improvement of the sensitivity limit over the InDEx run1.\n\n", "2510.06905": "2025-10-08, **The radial acceleration relation at the EDGE of galaxy formation: testing its universality in low-mass dwarf galaxies**, Mariana P. Júlio et.al., [2510.06905v1](http://arxiv.org/abs/2510.06905v1)\n\n A tight correlation between the baryonic and observed acceleration of galaxies has been reported over a wide range of mass ($10^8 < M\\_{\\rm bar}/{\\rm M}\\_\\odot < 10^{11}$) - the Radial Acceleration Relation (RAR). This has been interpreted as evidence that dark matter is actually a manifestation of some modified weak-field gravity theory. In this paper, we study the radially resolved RAR of 12 nearby dwarf galaxies, with baryonic masses in the range $10^4 < M\\_{\\rm bar}/{\\rm M}\\_\\odot < 10^{7.5}$, using a combination of literature data and data from the MUSE-Faint survey. We use stellar line-of-sight velocities and the Jeans modelling code GravSphere to infer the mass distributions of these galaxies, allowing us to compute the RAR. We compare the results with the EDGE simulations of isolated dwarf galaxies with similar stellar masses in a $\\Lambda$CDM cosmology. We find that most of the observed dwarf galaxies lie systematically above the low-mass extrapolation of the RAR. Each galaxy traces a locus in the RAR space that can have a multi-valued observed acceleration for a given baryonic acceleration, while there is significant scatter from galaxy to galaxy. Our results indicate that the RAR does not apply to low-mass dwarf galaxies and that the inferred baryonic acceleration of these dwarfs does not contain enough information, on its own, to derive the observed acceleration. The simulated EDGE dwarfs behave similarly to the real data, lying systematically above the extrapolated RAR. We show that, in the context of modified weak-field gravity theories, these results cannot be explained by differential tidal forces from the Milky Way, nor by the galaxies being far from dynamical equilibrium, since none of the galaxies in our sample seems to experience strong tides. As such, our results provide further evidence for the need for invisible dark matter in the smallest dwarf galaxies.\n\n", "2510.06500": "2025-10-07, **Study of few-electron backgrounds in the LUX-ZEPLIN detector**, D. S. Akerib et.al., [2510.06500v1](http://arxiv.org/abs/2510.06500v1)\n\n The LUX-ZEPLIN (LZ) experiment aims to detect rare interactions between dark matter particles and xenon. Although the detector is designed to be the most sensitive to GeV/$c^2$--TeV/$c^2$ Weakly Interacting Massive Particles (WIMPs), it is also capable of measuring low-energy ionization signals down to a single electron that may be produced by scatters of sub-GeV/$c^2$ dark matter. The major challenge in exploiting this sensitivity is to understand and suppress the ionization background in the few-electron regime. We report a characterization of the delayed electron backgrounds following energy depositions in the LZ detector under different detector conditions. In addition, we quantify the probability for photons to be emitted in coincidence with electron emission from the high voltage grids. We then demonstrate that spontaneous grid electron emission can be identified and rejected with a high efficiency using a coincident photon tag, which provides a tool to improve the sensitivity of future dark matter searches.\n\n", "2510.06375": "2025-10-07, **On planetary orbits, ungravity and entropic gravity**, G. Pérez Cuéllar et.al., [2510.06375v1](http://arxiv.org/abs/2510.06375v1)\n\n In previous works, entropic gravity and ungravity have been considered as possible solutions to the dark energy and dark matter problems. To test the viability of these models, modifications to planetary orbits are calculated for ungravity and different models of entropic gravity. Using the gravitational sector of unparticles, an equation for the contribution to the effect of orbital precession is obtained. We conclude that the estimated values for the ungravity parameters from planetary orbits are inconsistent with the values needed for the cosmological constant. The same ideas are explored for entropic gravity arising from a modified entropy--area relationship.\n\n", "2510.06329": "2025-10-07, **Asymmetries in stellar streams induced by a galactic merger**, Claire Guillaume et.al., [2510.06329v1](http://arxiv.org/abs/2510.06329v1)\n\n Stellar streams are sensitive to perturbations from, e.g., giant molecular clouds, bars and spiral arms, infalling dwarf galaxies, or globular clusters which can imprint gaps, clumps, spurs, and asymmetries in tails. In addition to these effects, the impact of a galactic major merger on a population of stellar streams remains to be explored. Here, we focus on the emergence and longevity of asymmetries between the leading and trailing tails of streams caused by such interactions. We run collisionless N-body simulations of a Milky Way-like galaxy hosting 36 globular cluster streams and merging with a perturber galaxy. We propose a new asymmetry metric to quantify the structural differences between both tails from their respective cumulative density profiles. We find that the over- and under-densities along streams induced by the merger depend on the orbital characteristics of their progenitors. The non-simultaneity of this effect from stream to stream implies that global asymmetry signatures are less prominent than in individual cases. These population-averaged imprints remain detectable over only 2.5 Gyr but asymmetric signatures can persist over much longer periods for individual streams with wide orbits that have been perturbed prior to coalescence. We thus caution that the interpretation of streams' morphology in the context of dark matter mapping is strongly subject to degeneracies and should be performed considering the merger history of the host.\n\n", "2510.06312": "2025-10-07, **New ultralight scalar particles and the mass-radius relation of white dwarfs -- the important role of Sirius B**, Kai Bartnick et.al., [2510.06312v1](http://arxiv.org/abs/2510.06312v1)\n\n We present the equation of state for two classes of new ultralight particles, a scalar field coupling to electrons and a light $\\mathbb{Z}\\_\\mathcal{N}$ QCD axion field coupling to nucleons. Both are potential candidates for dark matter. Using the scalar modified equations of state, we calculate models for white dwarf stars and compare their radii and masses with observed mass-radius data. The comparison results in stringent constraints on the masses of the particles and the coupling parameters. For a wide range of particle masses and coupling parameters, constraints from the white dwarf equation of state surpass existing limits, outperforming also dedicated laboratory searches. The remarkable accuracy of modern white-dwarf mass-radius relation data, exemplified by Sirius B, now allows stringent tests of dense-matter physics and constraints on new particle scenarios.\n\n", "2510.05877": "2025-10-07, **Low-energy threshold demonstration for dark matter searches in TREX-DM with an $^{37}$Ar source produced at CNA HiSPANoS**, J. Castel et.al., [2510.05877v1](http://arxiv.org/abs/2510.05877v1)\n\n We report on the successful implementation of an $^{37}$Ar calibration source in the TREX-DM detector, a high-pressure time projection chamber designed for low-mass dark matter searches. The $^{37}$Ar source was produced through fast neutron activation of CaO powder at the HiSPANoS facility of Centro Nacional de Aceleradores (CNA) in Spain, yielding $O(1)$ kBq of activity. Using a novel combined GEM-Micromegas readout system, we successfully detected both characteristic emissions from $^{37}$Ar decay (2.82 keV and 270 eV) and achieved unprecedented energy threshold performance in TREX-DM, approaching the single-electron ionization energy of argon.\n\n", "2510.06294": "2025-10-07, **Gravitational deflection of charged massive particle around charged galactic wormhole**, Md Khalid Hossain et.al., [2510.06294v1](http://arxiv.org/abs/2510.06294v1)\n\n Recently, we proposed a novel charged wormhole spacetime based on Yoshiaki Sofue's exponential dark matter density profile, referred to as the Charged Galactic Wormhole. Our previous work explored the deflection of light and massive chargeless particles in this spacetime. Building upon this foundation, we now extend our study to investigate the deflection of charged massive particles around the charged galactic wormhole, unveiling new insights and opening several promising avenues for future research. To analyze this phenomenon, we employ two distinct methodologies. The first approach utilizes the Rindler-Ishak method, leveraging the Jacobi metric to compute the particle trajectories with high precision. The second approach adopts the Gauss-Bonnet theorem, providing a geometric and topological perspective of the deflection process. A detailed comparison of the results from these two approaches is presented, highlighting their consistency and differences, along with the physical implications. This work provides deeper insights into the interaction of gravitational and electromagnetic forces around charged galactic wormholes and their influence on particle motion, contributing to the theoretical understanding of such exotic spacetime structures.\n\n", "2510.05682": "2025-10-07, **Constraints on dark matter models from the stellar cores observed in ultra-faint dwarf galaxies: Self-interacting dark matter**, Jorge Sanchez Almeida et.al., [2510.05682v1](http://arxiv.org/abs/2510.05682v1)\n\n It has been proposed that the stellar cores observed in ultra-faint dwarf (UFD) galaxies reflect underlying dark matter (DM) cores that cannot be formed by stellar feedback acting on collisionless cold dark matter (CDM) halos. Assuming this claim is correct, we investigate the constraints that arise if such cores are produced by self-interacting dark matter (SIDM). We derive the range of SIDM cross-sections (sigma/m) required to reproduce the observed core sizes. These can result from halos in either the core-formation phase (low sigma/m) or the core-collapse phase (high sigma/m), yielding a wide allowed range (sim 0.3 -- 200 cm2/g) consistent with values reported in the literature for more massive galaxies. We also construct a simple model relating stellar mass to core radius - two observables likely connected in SIDM. This model reproduces the stellar core sizes and masses in UFDs with sigma/m consistent with those derived above. It also predicts a trend of increasing core radius with stellar mass, in agreement with observations of more massive dwarf galaxies. The model central DM densities match observations when assuming the SIDM profile to originate from an initial CDM halo that follows the mass-concentration relation. Since stellar feedback is insufficient to form cores in these galaxies, UFDs unbiasedly anchor sigma/m at low velocities. If the core-collapse scenario holds (i.e., high sigma/m), UFD halos are thermalized on kpc scales, approximately two orders of magnitude larger than the stellar cores. These large thermalization scales could potentially influence substructure formation in more massive systems.\n\n", "2510.05630": "2025-10-07, **Self-Interacting Sub-GeV Dark Matter with Strong MeV Gamma-ray**, Yu Watanabe et.al., [2510.05630v1](http://arxiv.org/abs/2510.05630v1)\n\n Sub-GeV dark matter (DM) with $s$-channel resonant self-scattering provides a promising framework for addressing small-scale structure problems. However, models that also account for the observed relic abundance through the same resonance are strongly constrained by current $\\gamma$-ray observations, since the associated signals are significantly enhanced. To overcome this limitation, we propose a framework in which the relic abundance and self-scattering are governed independently by two distinct mediators. As a concrete realization, we present a singlet scalar DM model in which self-scattering is mediated by a vector boson associated with a gauged baryon number, while the relic density is determined by forbidden annihilation into dark Higgs bosons that generate the gauge boson mass. By imposing cosmological, experimental, and theoretical constraints, We identify viable parameter regions that reproduce the observed relic density, alleviate small-scale problems, and remain consistent with current bounds. Notably, the model predicts multiple distinctive MeV $\\gamma$-ray signals, a significant fraction of which will be testable with next-generation MeV $\\gamma$-ray telescopes, including the Compton Spectrometer and Imager (COSI).\n\n", "2510.05575": "2025-10-07, **Demagnifying gravitational lenses as probes of dark matter structures and nonminimal couplings to gravity**, Hong-Yi Zhang et.al., [2510.05575v1](http://arxiv.org/abs/2510.05575v1)\n\n Magnification of total image fluxes is typically considered a defining feature of gravitational microlensing. In contrast, I will show that nonminimal couplings to gravity can generate regions of negative gravitational potential curvature, giving rise to the distinctive possibility of demagnification. Such events, appearing as flux troughs in microlensing light curves, provide a direct probe of dark matter structures and, crucially, offer a means to disentangle nonminimal couplings to gravity from other astrophysical and cosmological models.\n\n"}, "supernova": {"2510.07131": "2025-10-08, **CURLING -- II. Improvement on the $H_{0}$ Inference from Pixelized Cluster Strong Lens Modeling**, Yushan Xie et.al., [2510.07131v1](http://arxiv.org/abs/2510.07131v1)\n\n Strongly lensed supernovae (glSNe) provide a powerful, independent method to measure the Hubble constant, $H\\_{0}$, through time delays between their multiple images. The accuracy of this measurement depends critically on both the precision of time delay estimation and the robustness of lens modeling. In many current cluster-scale modeling algorithms, all multiple images used for modeling are simplified as point sources to reduce computational costs. In the first paper of the CURLING program, we demonstrated that such a point-like approximation can introduce significant uncertainties and biases in both magnification reconstruction and cosmological inference. In this study, we explore how such simplifications affect $H\\_0$ measurements from glSNe. We simulate a lensed supernova at $z=1.95$, lensed by a galaxy cluster at $z=0.336$, assuming time delays are measured from LSST-like light curves. The lens model is constructed using JWST-like imaging data, utilizing both Lenstool and a pixelated method developed in CURLING. Under a fiducial cosmology with $H\\_0=70\\rm \\ km \\ s^{-1}\\ Mpc^{-1}$, the Lenstool model yields $H\\_0=69.91^{+6.27}\\_{-5.50}\\rm \\ km\\ s^{-1}\\ Mpc^{-1}$, whereas the pixelated framework improves the precision by over an order of magnitude, $H\\_0=70.39^{+0.82}\\_{-0.60}\\rm \\ km \\ s^{-1}\\ Mpc^{-1}$. Our results indicate that in the next-generation observations (e.g., JWST), uncertainties from lens modeling dominate the error budget for $H\\_0$ inference, emphasizing the importance of incorporating the extended surface brightness of multiple images to fully leverage the potential of glSNe for cosmology.\n\n", "2510.06667": "2025-10-08, **Ionized gas components in low surface brightness galaxy AGC 111629**, Tian-Wen Cao et.al., [2510.06667v1](http://arxiv.org/abs/2510.06667v1)\n\n We present integral field spectroscopy of ionized gas components in AGC 111629, an edge-on low surface brightness galaxy (LSBG) with a stellar mass of 5.7$\\times$10$^{8}$ M$\\_{\\odot}$. AGC 111629 displays an irregular H$\\alpha$ morphology and an arch-like structure in the extraplanar region, which is absent in continuous stellar image. The irregular H$\\alpha$ morphology may be related to a past merger event with its satellite galaxy AGC 748815. A peanut-shaped structure at the center in the integrated [OIII]$\\lambda$5007 map, with a position angle that differs from that of the main stellar disk. This structure exhibits a higher [OIII]$\\lambda$5007/H$\\beta$ flux ratio, a larger equivalent width (EW) of [OIII]$\\lambda$5007, and a lower H$\\alpha$/H$\\beta$ flux radio ($<$ 2.86). Some spaxels associated with the peanut-shaped structure fall within the composite region of the BPT diagram based on [NII]$\\lambda$6583. These features may be associated with the central AGN. Additionally, a sub-peak in the southern disk is clearly visible in the [OIII]$\\lambda$5007 map. An extended region ($\\sim$ 2 kpc) with an extremely low value of H$\\alpha$/H$\\beta$ flux ratio is observed near this sub-peak. We interpret the sub-peak as a superbubble likely driven by supernova explosions in the southern disk. We derive the gas-phase metallicity, 12+log(O/H), using the [NII]$\\lambda$6583/H$\\alpha$ diagnostic and find that AGC 111629 exhibits low central metallicity. This may result from feedback associated with AGN activity and supernova explosions.\n\n", "2510.06310": "2025-10-07, **MUSEQuBES: Physical conditions, origins, and multi-element abundances of the circumgalactic medium of an isolated, star-forming dwarf galaxy at z=0.57**, Sean D. Johnson et.al., [2510.06310v1](http://arxiv.org/abs/2510.06310v1)\n\n In dwarf galaxy models, outflows expel metal-enriched interstellar medium (ISM) into the circumgalactic medium (CGM) to reproduce their observed low metallicities, but measurements of dwarf CGM properties are scarce. We present a study of the CGM of an isolated dwarf at $z=0.5723$ with a stellar mass of $\\approx5\\times10^7\\rm\\,M\\_{\\odot}$ and star-formation rate ($\\approx0.05\\,\\rm M\\_\\odot\\,yr^{-1}$) and ISM metallicity ($\\rm [O/H]\\approx-0.9$) consistent with the star-forming main sequence and mass-metallicity relation. A background quasar sightline with archival UV spectra probes the dwarf's CGM at a projected distance of 28 kpc, corresponding to approximately half of the estimated virial radius. The dwarf's CGM is detected in H I, intermediate metal ions of C III, O III, and O IV, and kinematically broader, highly-ionized O VI, but is undetected in N IV and Ne VIII. Photoionization modeling of the intermediate ions indicates a modest volume-filling factor ($\\sim 6\\%$ along the sightline or $\\sim 2\\%$ globally), and a mass of $\\sim2\\times10^8 {\\rm\\,M\\_\\odot}$, $\\sim4\\times$ higher than the dwarf's stellar mass, but $\\sim10\\times$ less than the highly ionized CGM. The O VI kinematics are comparable to the dwarf's estimated virial velocity, suggesting it is likely associated with cool, photoionized, and volume-filling CGM, with bulk motion or turbulence dominating over thermal pressure. The metallicity inferred for the intermediate ions is $\\rm [O/H]=-0.6$, but with low relative abundances of $\\rm [C/O]=-0.6$ and $\\rm [N/O]<-0.9$. The [N/O] is below levels expected of the dwarf's ISM, but consistent with core-collapse supernova ejecta, suggesting that supernova-enriched gas escaped the dwarf without mixing significantly with ISM enriched in nitrogen from evolved, low-mass stars.\n\n", "2510.06134": "2025-10-07, **Resolving Star Cluster Formation in Galaxy Simulations with Cosmic Ray Feedback**, Brandon Sike et.al., [2510.06134v1](http://arxiv.org/abs/2510.06134v1)\n\n Star clusters host the massive stars responsible for feedback in star-forming galaxies. Stellar feedback shapes the interstellar medium (ISM), affecting the formation of future star clusters. To self-consistently capture the interplay between feedback and star formation, a model must resolve the parsec-scale star formation sites and the multiphase ISM. Additionally, the dynamical impact of cosmic rays (CRs) on star formation rates (SFRs) must also be considered. We present the first simulations of the formation of an ensemble of star clusters with dynamically-coupled CRs, near-individual star particles, and a feedback-regulated ISM. We analyze tallbox simulations performed using the CRISP model in the moving-mesh code AREPO. We apply varied implementations of CR transport under the theory of self-confinement. We find that CRs simultaneously reduce the SFR, the power law slope of the cluster mass function, and the cluster formation efficiency. Each simulation is compatible with observations, and CR feedback tends to move results along observed star cluster relations. We see only modest changes in cluster radius and velocity dispersions, but significant differences in the virial parameters. Ultimately, the primary impact of CRs is to reduce SFRs. Lower SFRs imply fewer supernovae, and consequently a lower turbulent energy budget for gas. Star clusters formed in a CR-regulated ISM have lower velocity dispersions, and are therefore more bound under self-gravity. The effective clustering of SNe is unchanged by CRs. Through this work, we demonstrate the predictive power of the CRISP feedback model, despite this idealized setup.\n\n", "2510.06043": "2025-10-07, **The influence of rotation and metallicity on the explodability of massive stars**, Renyu Luo et.al., [2510.06043v1](http://arxiv.org/abs/2510.06043v1)\n\n During the late stages of massive stellar evolution, failed supernovae (FSN) may form through core-collapse processes. The traditional evaluation criterion $\\xi\\_{2.5}$ $=$ 0.45, primarily established using non-rotating progenitor models, suffers from significant inaccuracies when applied to rotating pre-supernova systems. The effects of metallicity and rotation on the explodability landscapes of massive stars lack robust quantification. We aim to investigate how rotation and metallicity influence the explodability of massive stars. We investigate how rotation and metallicity affect stellar explodability using MESA simulations with initial rotational velocities of $0$, $300$, and $600~\\mathrm{km,s^{-1}}$ at three metallicities ($Z\\_{\\odot}$, $1/10,Z\\_{\\odot}$, $1/50,Z\\_{\\odot}$). Core-collapse phases are simulated with GR1D to determine critical heating efficiencies. Our results yield revised $\\xi\\_{2.5}$ criteria: 0.45 for non-rotating models; 0.48 for $300~\\mathrm{km,s^{-1}}$; 0.47 for $600~\\mathrm{km,s^{-1}}$ at solar metallicity; and 0.59 for low-metallicity models. Chemically homogeneous evolution in rapidly rotating low-metallicity stars significantly raises the compactness limit for successful explosions and narrows the zero-age main sequence mass range for failed supernovae. Rotation substantially affects the explodability of low-metallicity massive stars, underscoring the importance of incorporating rotational effects in models of core-collapse supernova progenitors.\n\n", "2510.05712": "2025-10-07, **Abundance Pattern Fitting with Bayesian Inference: Constraining First Stars' Properties and Their Explosion Mechanism with Extremely Metal-poor Stars**, Ruizheng Jiang et.al., [2510.05712v1](http://arxiv.org/abs/2510.05712v1)\n\n The abundance patterns of extremely metal-poor stars preserve a fossil record of the Universe's earliest chemical enrichment by the supernova explosions from the evolution of first generation of stars, also referred to as Population III (or Pop III). By applying Bayesian inference to the analysis of abundance patterns of these ancient stars, this study presents a systematic investigation into the properties and explosion mechanism of Pop III stars. We apply NLTE corrections to enhance the reliability of abundance measurements, which significantly reduces the discrepancies in abundances between observations and theoretical yields for odd-Z elements, such as Na and Al. Our Bayesian framework also enables the incorporation of explodability and effectively mitigates biases introduced by varying resolutions across different supernova model grids. In addition to confirming a top-heavy ($\\alpha=0.54$) initial mass function for massive Pop III stars, we derive a robust mass--energy relation ($E\\propto M^2$) of the first supernovae. These findings demonstrate that stellar abundance analysis provides a powerful and independent approach for probing early supernova physics and the fundamental nature of the first stars.\n\n", "2510.05579": "2025-10-07, **Luminosity distance dispersion in Swiss-cheese cosmology as a function of the hole size distribution**, Thippayawis Cheunchitra et.al., [2510.05579v1](http://arxiv.org/abs/2510.05579v1)\n\n The luminosity distance-redshift ($D\\_{\\rm L}$--$z$) relation derived from Type Ia supernovae (SNe Ia) yields evidence for a nonzero cosmological constant. SNe Ia analyses typically fit to the functional form $D\\_{\\rm L}(z)$ derived theoretically from the homogeneous and isotropic Friedmann-Lemaitre-Robertson-Walker (FLRW) metric. Yet, the metric in the epoch relevant to SNe Ia measurements deviates slightly from FLRW due to gravitational clumping of mass into large-scale structures like filaments and voids, whose sizes span many orders of magnitude. The small deviation is modeled typically by scalar perturbations to the FLRW metric. Each line of sight to a SNe Ia passes through a random sequence of structures, so $D\\_{\\rm L}$ differs stochastically from one line of sight to the next. Here, we calculate the $D\\_{\\rm L}$ dispersion in an exact Lemaitre-Tolman-Bondi Swiss-cheese universe with a power-law hole size distribution, as a function of the lower cut-off $R\\_{\\rm min}$ and logarithmic slope $\\gamma$. We find that the standard deviation of $D\\_{\\rm L}$ scales as $\\sigma\\_{D\\_{\\rm L}} \\propto z^{2.25\\pm0.01} (R\\_{\\rm min}/24\\pm1\\,{\\rm Mpc})^{(0.157\\pm0.003)\\left[\\gamma - (1.16\\pm0.02)\\right]}$ for redshifts in the range $0.5 \\lesssim z \\lesssim 2.1$. The scaling shows that the $D\\_{\\rm L}$ dispersion is dominated by a few large voids rather than the many small voids.\n\n"}}