{"neutrino": {"2309.02400": "2023-09-05, **Majorana neutrinos in the triple gauge boson coupling $ZZZ^*$**, Héctor Novales-Sánchez et.al., [2309.02400v1](http://arxiv.org/abs/2309.02400v1)\n\n Confirmed by the measurement of neutrino oscillations, neutrino mass is recognized as a genuine manifestation of physics beyond the Standard Model, while its originating mechanism remains a mystery. Moreover, the proper field-theory description of neutrinos, whether they are Majorana or Dirac type, must be linked to such a mechanism. The present work addresses the calculation, estimation, and analysis of one-loop contributions from virtual Majorana neutrinos, light and heavy as well, to the neutral gauge boson coupling $ZZZ$, which participates in $Z$-boson pair production from $e^+e^-$ collisions. This task is carried out in the framework defined by a seesaw variant in which light neutrinos remain massless at tree level, then becoming massive radiatively. The $ZZZ^*$ coupling, with $Z^*$ an off-shell $Z$ boson, is defined by two form factors, namely, $f\\_4$, characterizing CP-odd effects, and $f\\_5$, which is CP-even. Constraints from the Large Hadron Collider on both these quantities are currently ${\\cal O}(10^{-4})$. Our calculation yields CP-nonpreserving contributions to $ZZZ$, which are absent in the framework of the sole Standard Model. Our estimations show that the $f\\_4$ contribution might be as large as ${\\cal O}(10^{-7})$ for heavy-neutrino masses $\\sim1\\,{\\rm TeV}$. CP-even contributions $f\\_5$ are also generated, which are, in general, larger than their CP-odd counterparts. We estimate them to be as large as ${\\cal O}(10^{-4})$ at a center-of-mass energy of $500\\,{\\rm GeV}$, in $e^+e^-$ collisions.\n\n", "2309.02275": "2023-09-05, **Multi-messenger signatures of delayed choked jets in tidal disruption events**, Mainak Mukhopadhyay et.al., [2309.02275v1](http://arxiv.org/abs/2309.02275v1)\n\n Recent radio observations and coincident neutrino detections suggest that some tidal disruption events (TDEs) exhibit late-time activities, relative to the optical emission peak, and these may be due to delayed outflows launched from the central supermassive black hole. We investigate the possibility that jets launched with a time delay of days to months, interact with a debris that may expand outwards. We discuss the effects of the time delay and expansion velocity on the outcomes of jet breakout and collimation. We find that a jet with an isotropic-equivalent luminosity of $\\lesssim 5 \\times 10^{45}\\,{\\rm erg/s}$ is likely to be choked for a delay time of $\\sim 3$ months. We also study the observational signatures of such delayed choked jets. The jet-debris interaction preceding the breakout would lead to particle acceleration and the resulting synchrotron emission can be detected by current and near-future radio, optical and X-ray telescopes, and the expanding jet-driven debris could explain late-time radio emission. We discuss high-energy neutrino production in delayed choked jets, and the time delay can significantly alleviate the difficulty of the hidden jet scenario in explaining neutrino coincidences.\n\n", "2309.02103": "2023-09-05, **Testing Lorentz invariance violation using cosmogenic neutrinos**, M. A. Reyes et.al., [2309.02103v1](http://arxiv.org/abs/2309.02103v1)\n\n Secondary messengers such as neutrinos and photons are expected to be produced in interactions of ultra-high-energy cosmic rays (UHECRs) with extragalactic background photons. Their propagation could be altered by the effects of Lorentz invariance violation. In this work, we have developed an extension of the SimProp code that includes some Lorentz-violating scenarios affecting the propagation of neutrinos. We present the corresponding expected cosmogenic neutrino fluxes for three different astrophysical scenarios for the production of UHECRs. These results can be used to put constraints on the scale of Lorentz violation in the neutrino sector.\n\n", "2309.01887": "2023-09-05, **The acrylic vessel for JSNS$^{2}$-II neutrino target**, C. D. Shin et.al., [2309.01887v1](http://arxiv.org/abs/2309.01887v1)\n\n The JSNS$^{2}$ (J-PARC Sterile Neutrino Search at J-PARC Spallation Neutron Source) is an experiment designed for the search for sterile neutrinos. The experiment is currently at the stage of the second phase named JSNS$^{2}$-II with two detectors at near and far locations from the neutrino source. One of the key components of the experiment is an acrylic vessel, that is used for the target volume for the detection of the anti-neutrinos. The specifications, design, and measured properties of the acrylic vessel are described.\n\n", "2309.01864": "2023-09-04, **Far-from-equilibrium bulk-viscous transport coefficients in neutron star mergers**, Yumu Yang et.al., [2309.01864v1](http://arxiv.org/abs/2309.01864v1)\n\n We investigate the weak-interaction-driven bulk-viscous transport properties of $npe$ matter in the neutrino transparent regime. Previous works assumed that the induced bulk viscosity correction to pressure, near beta equilibrium, is linear in deviations from the equilibrium charge fraction. We show that this is not always true for (some) realistic equations of state at densities between one and three times saturation density. This nonlinear nature of the perturbation around equilibrium motivates a far-from-beta-equilibrium description of bulk-viscous transport in neutron star mergers, which can be precisely achieved using a new Israel-Stewart formulation with resummed bulk and relaxation time transport coefficients. The computation of these transport coefficients depends on out-of-beta-equilibrium pressure corrections, which can be computed for a given equation of state. We calculate these coefficients for equations of state that satisfy the latest constraints from multi-messenger observations from LIGO/VIRGO and NICER. We show that varying the nuclear symmetry energy $J$ and its slope $L$ can significantly affect the transport coefficients and the nonlinear behavior of the out-of-equilibrium pressure corrections. Therefore, having better constraints on $J$ and $L$ will directly impact our understanding of bulk-viscous processes in neutron star mergers.\n\n", "2309.01756": "2023-09-04, **Search for Lorentz-violation through sidereal effect at NOνA Experiment**, Shashank Mishra et.al., [2309.01756v1](http://arxiv.org/abs/2309.01756v1)\n\n Long-baseline neutrino oscillation experiments offer a unique laboratory to test the fundamental Lorentz symmetry, which is heart of both the standard model of particle and general relativity theory. Deviations from the standard neutrino oscillation or the sidereal modulation in neutrino events will smoking-gun experimental signature of Lorentz and CPT violation. In this study, we investigate the impact of the sidereal effect on standard neutrino oscillation measurements within the context of the NO{\\nu}A experiment.   Additionally, we assess the sensitivity of the NO{\\nu}A experiment to detect Lorentz-violating interactions, taking into account the sidereal effect. Furthermore, we highlight potential of the NO{\\nu}A experiment to set the new constraints on anisotropic Lorentz-violating parameters.\n\n", "2309.01378": "2023-09-04, **Solving the Naturalness Problem with Feeble Coupled Sectors**, J. Lorenzo Diaz-Cruz et.al., [2309.01378v1](http://arxiv.org/abs/2309.01378v1)\n\n The discovery of a light Higgs boson means that whatever form new physics takes, it should keep stable the Higgs mass. Besides the well-known solutions to the naturalness problem (Supersymmetry, Conformal symmetry, Compositeness, etc), models that include heavy particles with feeble couplings to the Standard Model (SM) can be considered natural, since the corrections to the Higgs mass remains of the order of the electroweak (EW) scale. This solution can be used for model building too, with realizations that include the see-saw mechanism for neutrino masses and FIMP dark matter models, but it also holds for generic sectors that have Planck-suppressed couplings with the SM. One can also incorporate this solution within the SMEFT framework; the corresponding higher-dimensional operators induce small corrections to both the Higgs mass and its self-coupling, a prediction that can be tested at a future Higgs factory. We present a natural extension of the SMEFT that describes corrections to the SM, while also including a Feeble Coupled Sector aimed to account for the dark cosmos, with predictions for new signals that can be tested too.\n\n"}, "dark matter": {"2309.02330": "2023-09-05, **The viability of low-mass subhaloes as targets for gamma-ray dark matter searches**, Alejandra Aguirre-Santaella et.al., [2309.02330v1](http://arxiv.org/abs/2309.02330v1)\n\n In this work, we investigate the discovery potential of low-mass Galactic dark matter (DM) subhaloes for indirect searches of DM. We use data from the Via Lactea II (VL-II) N-body cosmological simulation, which resolves subhaloes down to $\\mathcal{O}(10^4)$ solar masses and it is thus ideal for this purpose. First, we characterize the abundance, distribution and structural properties of the VL-II subhalo population in terms of both subhalo masses and maximum circular velocities. Then, we repopulate the original simulation with millions of subhaloes of masses down to about five orders of magnitude below the minimum VL-II subhalo mass (more than one order of magnitude in velocities). We compute subhalo DM annihilation astrophysical \"J-factors\" and angular sizes for the entire subhalo population, by placing the Earth at a random position but at the right galactocentric distance in the simulation. Thousands of these realizations are generated in order to obtain statistically meaningful results. We find that some nearby low-mass Galactic subhaloes, not massive enough to retain stars or gas, may indeed yield DM annihilation fluxes comparable to those expected from other, more massive and acknowledgeable DM targets like dwarf satellite galaxies. Typical angular sizes are of the order of the degree, thus subhaloes potentially appearing as extended sources in gamma-ray telescopes, depending on instrument angular resolution and sensitivity. Our work shows that low-mass Galactic subhaloes with no visible counterparts are expected to play a relevant role in current and future indirect DM search searches and should indeed be considered as excellent DM targets.\n\n", "2309.02170": "2023-09-05, **Cosmological Constraints on Thermal Friction of Axion Dark Matter**, Gang Liu et.al., [2309.02170v1](http://arxiv.org/abs/2309.02170v1)\n\n In this paper, we investigate the process in which axion dark matter undergoes thermal friction, resulting in energy injection into dark radiation, with the aim of mitigating the Hubble tension and large-scale structure tension. In the early universe, this scenario led to a rapid increase in the energy density of dark radiation; in the late universe, the evolution of axion dark matter is similar to that of cold dark matter, with this scenario resembling decaying dark matter and serving to ease the large-scale structure tension. We employ cosmological observational data, including cosmic microwave background (CMB), baryon acoustic oscillation (BAO), supernova data (SNIa), $H\\_0$ measurement from SH0ES, and $S\\_8$ from the Dark Energy Survey Year-3 (DES), to study and analyze this model. Our results indicate that the thermal friction model offers partial alleviation of the large-scale structure tension, while its contribution on alleviating Hubble tension can be ignored. The new model constrained by the complete dataset yields the value of $S\\_8$ is $0.795\\pm 0.011$ at 68\\% confidence level, while the $\\Lambda$CDM model yields a result of $0.8023\\pm 0.0085$. In addition, when constrained solely by CMB, BAO, and SNIa data, the $\\Lambda$CDM model exhibits a smaller $\\chi^2\\_\\mathrm{tot}$ statistical value. However, upon incorporating SH0ES and DES data, the new model exhibits a lower $\\chi^2\\_\\mathrm{tot}$ value, with a difference of -2.60 compared to the $\\Lambda$CDM model.\n\n", "2309.02075": "2023-09-05, **CHEX-MATE: A non-parametric deep learning technique to deproject and deconvolve galaxy cluster X-ray temperature profiles**, A. Iqbal et.al., [2309.02075v1](http://arxiv.org/abs/2309.02075v1)\n\n Temperature profiles of the hot galaxy cluster intracluster medium (ICM) have a complex non-linear structure that traditional parametric modelling may fail to fully approximate. For this study, we made use of neural networks, for the first time, to construct a data-driven non-parametric model of ICM temperature profiles. A new deconvolution algorithm was then introduced to uncover the true (3D) temperature profiles from the observed projected (2D) temperature profiles. An auto-encoder-inspired neural network was first trained by learning a non-linear interpolatory scheme to build the underlying model of 3D temperature profiles in the radial range of [0.02-2] R$\\_{500}$, using a sparse set of hydrodynamical simulations from the THREE HUNDRED PROJECT. A deconvolution algorithm using a learning-based regularisation scheme was then developed. The model was tested using high and low resolution input temperature profiles, such as those expected from simulations and observations, respectively. We find that the proposed deconvolution and deprojection algorithm is robust with respect to the quality of the data, the morphology of the cluster, and the deprojection scheme used. The algorithm can recover unbiased 3D radial temperature profiles with a precision of around 5\\% over most of the fitting range. We apply the method to the first sample of temperature profiles obtained with XMM{\\it -Newton} for the CHEX-MATE project and compared it to parametric deprojection and deconvolution techniques. Our work sets the stage for future studies that focus on the deconvolution of the thermal profiles (temperature, density, pressure) of the ICM and the dark matter profiles in galaxy clusters, using deep learning techniques in conjunction with X-ray, Sunyaev Zel'Dovich (SZ) and optical datasets.\n\n", "2309.02051": "2023-09-05, **Atomic diffraction from single-photon transitions in gravity and Standard-Model extensions**, Alexander Bott et.al., [2309.02051v1](http://arxiv.org/abs/2309.02051v1)\n\n Single-photon transitions are one of the key technologies for designing and operating very-long-baseline atom interferometers tailored for terrestrial gravitational-wave and dark-matter detection. Since such setups aim at the detection of relativistic and beyond-Standard-Model physics, the analysis of interferometric phases as well as of atomic diffraction must be performed to this precision and including these effects. In contrast, most treatments focused on idealized diffraction so far. Here, we study single-photon transitions, both magnetically-induced and direct ones, in gravity and Standard-Model extensions modeling dark matter as well as Einstein-equivalence-principle violations. We take into account relativistic effects like the coupling of internal to center-of-mass degrees of freedom, induced by the mass defect, as well as the gravitational redshift of the diffracting light pulse. To this end, we also include chirping of the light pulse required by terrestrial setups, as well as its associated modified momentum transfer for single-photon transitions.\n\n", "2309.01979": "2023-09-05, **Dark Matter Velocity Distributions: Comparing Numerical Simulations to Analytic Results**, Katharena Christy et.al., [2309.01979v1](http://arxiv.org/abs/2309.01979v1)\n\n We test the consistency of dark matter velocity distributions obtained from dark matter-only numerical simulations with analytic predictions, using the publicly available Via Lactea 2 dataset as an example. We find that, well inside the scale radius, the velocity distribution obtained from numerical simulation is consistent with a function of a single integral of motion -- the energy -- and moreover is consistent with the result obtained from Eddington inversion. This indicates that the assumptions underlying the analytic result, namely, spherical symmetry, isotropy, and a static potential, are sufficiently accurate to govern the coarse properties of the velocity distribution in the inner regions of the halo. We discuss implications for the behavior of the high-velocity tail of the distribution, which can dominate dark matter annihilation from a $p$- or $d$-wave state.\n\n", "2309.01883": "2023-09-05, **Constraining scotogenic dark matter and primordial black holes using gravitational waves**, Teruyuki Kitabayashi et.al., [2309.01883v1](http://arxiv.org/abs/2309.01883v1)\n\n The lightest $Z\\_2$ odd particle in the scotogenic model, referred to as scotogenic dark matter (DM), is a widely studied candidate for DM. This scotogenic DM is generated through well-known thermal processes as well as via the evaporation of primordial black holes (PBHs). Recent reports suggested that the curvature fluctuations of PBHs during an epoch dominated by these entities in the early universe can serve as the source of so-called induced gravitational waves (GWs). In this study, we demonstrate that stringent constraints on the mass of scotogenic DM and PBHs can be obtained through the detection of induced GWs using future detectors.\n\n", "2309.01843": "2023-09-04, **Projected sensitivity of the CDEX-50 experiment**, X. P. Geng et.al., [2309.01843v1](http://arxiv.org/abs/2309.01843v1)\n\n CDEX-50 is a next-generation project of the China Dark Matter Experiment (CDEX) that aims to search for dark matter using a 50-kg germanium detector array. This paper comprises a thorough summary of the CDEX-50 experiment, including an investigation of potential background sources and the development of a background model. Based on the baseline model, the projected sensitivity of weakly interacting massive particle (WIMP) is also presented. The expected background level within the energy region of interest, set to 2--2.5 keVee, is $\\sim$0.01 counts keVee$^{-1}$ kg$^{-1}$ day$^{-1}$. At 90\\% confidence level, the expected sensitivity to spin-independent WIMP-nucleon couplings is estimated to reach a cross-section of 5.3 $\\times$ 10$^{-45}$ cm$^{2}$ for a WIMP mass of 5 GeV/c$^{2}$ with an exposure objective of 150 kg$\\cdot$year and an analysis threshold of 160 eVee. This science goal will correspond to the most sensitive results for WIMPs with a mass of 2.2--8 GeV/c$^{2}$.\n\n", "2309.01767": "2023-09-04, **On Coherence in Bragg-Primakoff Axion Photoconversion**, Adrian Thompson et.al., [2309.01767v1](http://arxiv.org/abs/2309.01767v1)\n\n Axions and axion-like pseudoscalar particles with dimension-5 couplings to photons exhibit coherent Bragg-Primakoff scattering with ordered crystals at keV energy scales. This provides for a natural detection technique in searches for axions produce in the Sun's interior. I will motivate the utility of dark matter direct detection experiments in searching for solar axions, emphasizing the role crystal-based detector technologies. I present an updated theoretical treatment of the Bragg-Primakoff photoconversion process for keV pseudoscalars, and address simultaneously the effects of absorption of final state photons in crystals on the loss of coherence, which can lead to large suppressive corrections to the event rate sensitivity for this detection technique. However, I also show that the Borrmann effect of anomalous absorption significantly lifts the suppression. This phenomenon is studied in Ge, NaI, and CsI crystal experiments and its impact on the the projected sensitivities of SuperCDMS, LEGEND, and SABRE to the solar axion parameter space. Lastly, I investigate the future reach of multi-ton scale crystal detectors and discuss strategies to maximize the discovery potential of experimental efforts in this vein.\n\n", "2309.01742": "2023-09-04, **Shaping the unseen: the influence of baryons and environment on low-mass, high-redshift dark matter haloes in the SIEGE simulations**, R. Pascale et.al., [2309.01742v1](http://arxiv.org/abs/2309.01742v1)\n\n We use zoom-in, hydrodynamical, cosmological $N$-body simulations tracing the formation of the first stellar clumps from the SImulating the Environments where Globular clusters Emerged (SIEGE) project, to study key structural properties of dark matter haloes when the Universe was only $0.92$ Gyr old. The very high-resolution (maximum physical resolution 0.3 h$^{-1}$ pc at $z=6.14$, smallest dark-matter particle mass $164\\,M\\_{\\odot}$) allows us to reach the very low mass end of the stellar-to-halo mass relation ($M\\_{\\rm vir}=10^{7.5-9.5}\\,M\\_{\\odot}$) to study the processes that mould dark matter haloes during the first stages of structure formation. We investigate the role of baryonic cooling and stellar feedback, modeled from individual stars, in shaping haloes, and of environmental effects as accretion of dark matter along cosmic filaments and mergers. We find that the onset of star formation (typically for $\\log M\\_{\\rm vir}/M\\_{\\odot}\\simeq7.6$) causes the inner cusp in the haloes density profile to flatten into a core with constant density and size proportionally to the halo virial mass. Even at these mass scales, we confirm that baryons make haloes that have formed stars rounder in the central regions than haloes that have not formed stars yet, with median minor-to-major $\\langle q \\rangle$ and intermediate-to-major $\\langle s \\rangle$ axes 0.66 and 0.84, respectively. Our morphological analysis shows that, at $z=6.14$, haloes are largely prolate in the outer parts, with the major axis aligned along filaments of the cosmic web or towards smaller sub-haloes, with the degree of elongation having no significant dependence on the halo mass.\n\n", "2309.01739": "2023-09-04, **A New Mechanism for Primordial Black Hole Formation from QCD Axion**, Shuailiang Ge et.al., [2309.01739v1](http://arxiv.org/abs/2309.01739v1)\n\n We present a novel mechanism for the primordial black hole (PBH) production within the QCD axion framework. We take the case where the Peccei-Quinn symmetry breaks during inflation, resulting in a $N\\_{\\rm DW}=1$ string-wall network that re-enters horizon sufficiently late. Therefore, closed axion domain walls naturally arising in the network are sufficiently large to collapse into PBHs. Our numerical simulation shows that $0.8\\%$ of the total wall area is in the form of closed walls. Notably, this fraction is independent of any axion parameters, as its determination is firmly grounded in the principles of percolation theory. In addition, the relic abundance of dark matter is accounted for by free axions from the collapse of open walls bounded by strings. This framework yields a calculated PBH fraction of dark matter as 0.0256. The PBHs uniformly share the same mass, which spans from about $10^{-10}$ to $10^{-1}$ solar masses, corresponding to the classical QCD axion mass window $10^{-5}-10^{-2}$ eV and the re-entering horizon temperature $300-1$ MeV. Intriguingly, PBHs in this mechanism can naturally account for the gravitational-lensing events observed by the OGLE collaboration.\n\n", "2309.01710": "2023-09-04, **Barless flocculent galaxies: a dynamic puzzle**, Daria Zakharova et.al., [2309.01710v1](http://arxiv.org/abs/2309.01710v1)\n\n We draw attention to the bright galaxies that do not show a bar in their structure but have a flocculent spiral structure. Using the THINGS' and HERACLES' kinematic data for four barless galaxies (NGC~2841, NGC~3512, NGC~5055, NGC~7331) we built their mass models including dark halos. We concluded that the fraction of the dark matter does not exceed 50\\% within the optical radii of the galaxies. This is too little to explain the lack of a bar in these galaxies. In an attempt to understand the featureless structure of these galaxies we constructed several $N$-body models with an initially reduced content of dark matter. We concluded that, in addition to the low mass of the dark halo, the decisive factor that leads to a barless disc is the start from an initially unstable state. An isolated dynamically cold disc (with the Toomre parameter $Q < 0.5$) settled into rotational equilibrium passes trough the short stage of violent instability with fragmentation and formation of stellar clumps. After that, it evolves passively and ends up with a featureless structure. We assume that the barless flocculent galaxies studied in the present work may be descendants of galaxies at high redshifts with rotation curves which are consistent with the high mass fraction of baryons relative to the total dark matter halo.\n\n", "2309.01443": "2023-09-04, **The Three Hundred : contrasting clusters galaxy density in hydrodynamical and dark matter simulations**, A. Jiménez Muñoz et.al., [2309.01443v1](http://arxiv.org/abs/2309.01443v1)\n\n Cluster number counts will be a key cosmological probe in the next decade thanks to the Euclid satellite mission. For this purpose, cluster detection algorithm performance, which are sensitive to the spatial distribution of the cluster galaxy members and their luminosity function, need to be accurately characterized. Using The Three Hundred hydrodynamical and dark matter only simulations we study a complete sample of massive clusters beyond 7 (5) $\\times$ 10$^{14}$ M$\\_{\\odot}$ at redshift 0 (1) on a $(1.48 \\ \\mathrm{Gpc})^3$ volume. We find that the mass resolution of the current hydrodynamical simulations (1.5 $\\times$ 10$^9$ M$\\_{\\odot}$) is not enough to characterize the luminosity function of the sample in the perspective of Euclid data. Nevertheless, these simulations are still useful to characterize the spatial distribution of the cluster substructures assuming a common relative mass threshold for the different flavours and resolutions. By comparing with the dark matter only version of these simulations, we demonstrate that baryonic physics preserves significantly low mass subhalos (galaxies) as have also been observed in previous studies with less statistics. Furthermore, by comparing the hydro simulations with higher resolution dark matter only simulations of the same objects and taking the same limit in subhalo mass we find significantly more cuspy galaxy density profiles towards the center of the clusters, where the low mass substructures would tend to concentrate. We conclude that using dark matter only simulation may lead to some biases on the spatial distribution and density of galaxy cluster members. Based on the preliminary analysis of few high resolution hydro simulations we conclude that a mass resolution of 1.8 $\\times$ 10$^8$ h$^{-1}$ M$\\_{\\odot}$ will be needed for The Three Hundred simulations to approach the expected magnitude limits for the Euclid survey.\n\n"}, "supernova": {"2309.02415": "2023-09-05, **A Photon Burst Clears the Earliest Dusty Galaxies: Modelling Dust in High-redshift Galaxies from ALMA to JWST**, Daichi Tsuna et.al., [2309.02415v1](http://arxiv.org/abs/2309.02415v1)\n\n The generation and evolution of dust in galaxies are important tracers for star formation, and can characterize the rest-frame ultraviolet to infrared emission from the galaxies. In particular understanding dust in high-redshift galaxies are important for observational cosmology, as they would be necessary to extract information on star formation in the early universe. We update the public semi-analytical model A-SLOTH (Ancient Stars and Local Observables by Tracing Halos) to model the evolution of dust, focusing on high-redshift star-forming galaxies with stellar masses of $\\sim 10^8$--$10^{10}M\\_\\odot$ observed by ALMA ($z\\approx 7$) and JWST ($z\\approx 11$). We find that these galaxies should qualitatively differ in their star formation properties; while the samples in ALMA are explained by dust growth in normal star-forming galaxies, the lack of dust in the samples by JWST requires dust ejection by radiation pressure due to recent highly efficient star-formation within a few 10 Myr, with order 100 times higher efficiency than normal galaxies calibrated by A-SLOTH. Depending on where the JWST galaxies locate on the luminosity function, their bursty star formation histories inferred from our model can have impacts for rates of star formation, supernova explosion, stellar feedback, and detectability of dusty, mature galaxies in the very early universe.\n\n", "2309.02368": "2023-09-05, **SU(3) Parity Doubling in Cold Neutron Star Matter**, Eduardo S. Fraga et.al., [2309.02368v1](http://arxiv.org/abs/2309.02368v1)\n\n We present a phenomenological model to investigate the chiral phase transition characterized by parity doubling in dense, beta equilibrated, cold matter. Our model incorporates effective interactions constrained by SU(3) relations and considers baryonic degrees of freedom. By constraining the model with astrophysical data and nuclear matter properties, we find a first-order phase transition within realistic values of the slope parameter L. The inclusion of the baryon octet and negative parity partners, along with a chiral-invariant mass $m\\_{0}$, allows for a non-massless chiral symmetric phase. Through exploration of parameter space, we identify parameter sets satisfying mass and radius constraints without requiring a partonic phase. The appearance of the parity partner of the nucleon, the N(1535) resonance, suppresses strangeness, pushing hyperonization to higher densities. We observe a mild first-order phase transition to the chirally restored phase, governed by $m\\_{0}$. Our calculations of surface tension highlight its strong dependence on $m\\_{0}$. The existence of mixed phases is ruled out since they become energetically too costly. We compare stars with metastable and stable cores using both branches of the equation of state. Despite limited lifespans due to low surface tension values, phase conversion and star contraction could impact neutron stars with masses around 1.3 solar masses or more. We discuss some applications of this model in its non-zero temperatures generalization and scenarios beyond beta equilibrium that can provide insights into core-collapse supernovae, proto-neutron star evolution, and neutron star mergers. Core-collapse supernovae dynamics, influenced by chiral symmetry restoration and exotic hadronic states, affect explosion mechanisms and nucleosynthesis.\n\n", "2309.02263": "2023-09-05, **Evolved Pulsar Wind Nebulae**, Barbara Olmi et.al., [2309.02263v1](http://arxiv.org/abs/2309.02263v1)\n\n Based on the expected population of core collapse supernova remnants and the huge number of detected pulsars in the Galaxy, still representing only a fraction of the real population, pulsar wind nebulae are likely to constitute one of the largest classes of {extended} Galactic sources in many energy bands. For simple evolutionary reasons, the majority of the population is made of evolved systems, whose detection and identification are complicated by their reduced luminosity, the possible lack of X-ray emission (that fades progressively away with the age of the pulsar), and by their modified morphology with respect to young systems. Nevertheless they have gained renewed attention in recent years, following the detection of misaligned X-ray tails protruding from an increasing number of nebulae created by fast moving pulsars, and of extended TeV halos surrounding aged systems. Both these features are clear signs of an efficient escape of particles, with energy close to the maximum acceleration limit of the pulsar. Here we discuss the properties of those evolved systems and what we have understood about the process of particle escape, and the formation of observed features.\n\n", "2309.02239": "2023-09-05, **The role of supernovae inside AGN jets in UHECR acceleration**, Valenti Bosch-Ramon et.al., [2309.02239v1](http://arxiv.org/abs/2309.02239v1)\n\n Jets of active galactic nuclei are potential accelerators of ultra high-energy cosmic rays. Supernovae can occur inside these jets and contribute to cosmic ray acceleration, particularly of heavy nuclei, but that contribution has been hardly investigated so far. We carried out a first dedicated exploration of the role of supernovae inside extragalactic jets in the production of ultra high-energy cosmic rays. We characterized the energy budget of supernova-jet interactions, and the maximum possible energies of the particles accelerated in those events, likely dominated by heavy nuclei. This allowed us to assess whether these interactions can be potential acceleration sites of ultra high-energy cosmic rays, or at least of their seeds. For that, we estimated the cosmic ray luminosity for different galaxy types, and compared the injection rate of cosmic ray seeds into the jet with that due to galactic cosmic ray entrainment. Since the supernova is fueled for a long time by the luminosity of the jet, the energy of a supernova-jet interaction can be several orders of magnitude greater than that of an isolated supernova. Thus, despite the low rate of supernovae expected to occur in the jet, they could still provide more seeds for accelerating ultra high-energy particles than cosmic ray entrainment from the host galaxy. Moreover, these interactions can create sufficiently efficient accelerators to be a source of cosmic rays with energies $\\gtrsim 10$~EeV. Supernova-jet interactions can contribute significantly to the production of ultra high-energy cosmic rays, either directly by accelerating these particles themselves or indirectly by providing pre-accelerated seeds.\n\n", "2309.02170": "2023-09-05, **Cosmological Constraints on Thermal Friction of Axion Dark Matter**, Gang Liu et.al., [2309.02170v1](http://arxiv.org/abs/2309.02170v1)\n\n In this paper, we investigate the process in which axion dark matter undergoes thermal friction, resulting in energy injection into dark radiation, with the aim of mitigating the Hubble tension and large-scale structure tension. In the early universe, this scenario led to a rapid increase in the energy density of dark radiation; in the late universe, the evolution of axion dark matter is similar to that of cold dark matter, with this scenario resembling decaying dark matter and serving to ease the large-scale structure tension. We employ cosmological observational data, including cosmic microwave background (CMB), baryon acoustic oscillation (BAO), supernova data (SNIa), $H\\_0$ measurement from SH0ES, and $S\\_8$ from the Dark Energy Survey Year-3 (DES), to study and analyze this model. Our results indicate that the thermal friction model offers partial alleviation of the large-scale structure tension, while its contribution on alleviating Hubble tension can be ignored. The new model constrained by the complete dataset yields the value of $S\\_8$ is $0.795\\pm 0.011$ at 68\\% confidence level, while the $\\Lambda$CDM model yields a result of $0.8023\\pm 0.0085$. In addition, when constrained solely by CMB, BAO, and SNIa data, the $\\Lambda$CDM model exhibits a smaller $\\chi^2\\_\\mathrm{tot}$ statistical value. However, upon incorporating SH0ES and DES data, the new model exhibits a lower $\\chi^2\\_\\mathrm{tot}$ value, with a difference of -2.60 compared to the $\\Lambda$CDM model.\n\n", "2309.02161": "2023-09-05, **Supernova-like explosion of massive rotating stars from disks surrounding a black hole**, Sho Fujibayashi et.al., [2309.02161v1](http://arxiv.org/abs/2309.02161v1)\n\n We perform a new general-relativistic viscous-radiation hydrodynamics simulation for supernova-like explosion associated with stellar core collapse of rotating massive stars to a system of a black hole and a massive torus paying particular attention to large-mass progenitor stars with the zero-age main-sequence mass of $M\\_\\mathrm{ZAMS}=$20, 35, and 45$M\\_\\odot$ of Ref.~\\cite{Aguilera-Dena2020oct}. Assuming that a black hole is formed in a short timescale after the onset of the stellar collapse, the new simulations are started from initial data of a spinning black hole and infalling matter that self-consistently satisfy the constraint equations of general relativity. It is found that with a reasonable size of the viscous parameter, the supernova-like explosion is driven by the viscous heating effect in the torus around the black hole irrespective of the progenitor mass. The typical explosion energy and ejecta mass for the large-mass cases ($M\\_\\mathrm{ZAMS}=35$ and $45M\\_\\odot$) are $\\sim 10^{52}$ erg and $\\sim 5M\\_\\odot$, respectively, with $^{56}$Ni mass larger than $0.15M\\_\\odot$. These are consistent with the observational data of stripped-envelope and high-energy supernovae such as broad-lined type Ic supernovae. This indicates that rotating stellar collapses of massive stars to a black hole surrounded by a massive torus can be a central engine for high-energy supernovae. By artificially varying the angular velocity of the initial data, we explore the dependence of the explosion energy and ejecta mass on the initial angular momentum and find that the large explosion energy $\\sim 10^{52}$ erg and large $^{56}$Ni mass $\\geq 0.15M\\_\\odot$ are possible only when a large-mass compact torus with mass $\\gtrsim 1M\\_\\odot$ is formed.\n\n", "2309.02030": "2023-09-05, **Matched filtering for gravitational wave detection without template bank driven by deep learning template prediction model bank**, CunLiang Ma et.al., [2309.02030v1](http://arxiv.org/abs/2309.02030v1)\n\n The existing matched filtering method for gravitational wave (GW) search relies on a template bank. The computational efficiency of this method scales with the size of the templates within the bank. Higher-order modes and eccentricity will play an important role when third-generation detectors operate in the future. In this case, traditional GW search methods will hit computational limits. To speed up the computational efficiency of GW search, we propose the utilization of a deep learning (DL) model bank as a substitute for the template bank. This model bank predicts the latent templates embedded in the strain data. Combining an envelope extraction network and an astrophysical origin discrimination network, we realize a novel GW search framework. The framework can predict the GW signal's matched filtering signal-to-noise ratio (SNR). Unlike the end-to-end DL-based GW search method, our statistical SNR holds greater physical interpretability than the $p\\_{score}$ metric. Moreover, the intermediate results generated by our approach, including the predicted template, offer valuable assistance in subsequent GW data processing tasks such as parameter estimation and source localization. Compared to the traditional matched filtering method, the proposed method can realize real-time analysis. The minor improvements in the future, the proposed method may expand to other scopes of GW search, such as GW emitted by the supernova explosion.\n\n", "2309.01998": "2023-09-05, **Circumstellar Material Ejected Violently by A Massive Star Immediately before its Death**, Jujia Zhang et.al., [2309.01998v1](http://arxiv.org/abs/2309.01998v1)\n\n Type II supernovae represent the most common stellar explosions in the Universe, for which the final stage evolution of their hydrogen-rich massive progenitors towards core-collapse explosion are elusive. The recent explosion of SN 2023ixf in a very nearby galaxy, Messier 101, provides a rare opportunity to explore this longstanding issue. With the timely high-cadence flash spectra taken within 1-5 days after the explosion, we can put stringent constraints on the properties of the surrounding circumstellar material around this supernova. Based on the rapid fading of the narrow emission lines and luminosity/profile of $\\rm H\\alpha$ emission at very early times, we estimate that the progenitor of SN 2023ixf lost material at a mass-loss rate $\\dot{\\rm M} \\approx 6 \\times 10^{-4}\\, \\rm M\\_{\\odot}\\,yr^{-1}$ over the last 2-3 years before explosion. This close-by material, moving at a velocity $v\\_{\\rm w} \\approx 55\\rm \\, km\\,s^{-1}$, accumulates a compact CSM shell at the radius smaller than $7 \\times 10^{14}$ cm from the progenitor. Given the high mass-loss rate and relatively large wind velocity presented here, together with the pre-explosion observations made about two decades ago, the progenitor of SN 2023ixf could be a short-lived yellow hypergiant that evolved from a red supergiant shortly before the explosion.\n\n", "2309.01879": "2023-09-05, **Magnetic structures and turbulence in SN 1006 revealed with imaging X-ray polarimetry**, Ping Zhou et.al., [2309.01879v1](http://arxiv.org/abs/2309.01879v1)\n\n Young supernova remnants (SNRs) strongly modify surrounding magnetic fields, which in turn play an essential role in accelerating cosmic rays (CRs). X-ray polarization measurements probe magnetic field morphology and turbulence at the immediate acceleration site. We report the X-ray polarization distribution in the northeastern shell of SN1006 from a 1 Ms observation with the Imaging X-ray Polarimetry Explorer (IXPE). We found an average polarization degree of $22.4\\pm 3.5\\%$ and an average polarization angle of $-45.4\\pm 4.5^\\circ$ (measured on the plane of the sky from north to east). The X-ray polarization angle distribution reveals that the magnetic fields immediately behind the shock in the northeastern shell of SN 1006 are nearly parallel to the shock normal or radially distributed, similar to that in the radio observations, and consistent with the quasi-parallel CR acceleration scenario. The X-ray emission is marginally more polarized than that in the radio band. The X-ray polarization degree of SN 1006 is much larger than that in Cas A and Tycho, together with the relatively tenuous and smooth ambient medium of the remnant, favoring that CR-induced instabilities set the turbulence in SN 1006 and CR acceleration is environment-dependent.\n\n", "2309.01802": "2023-09-04, **Sensitivity of Simulations of Double Detonation Type Ia Supernova to Integration Methodology**, Michael Zingale et.al., [2309.01802v1](http://arxiv.org/abs/2309.01802v1)\n\n We study the coupling of hydrodynamics and reactions in simulations of the double detonation model for Type Ia supernovae. When assessing the convergence of simulations, the focus is usually on spatial resolution; however, the method of coupling the physics together as well as the tolerances used in integrating a reaction network also play an important role. In this paper, we explore how the choices made in both coupling and integrating the reaction portion of a simulation (operator / Strang splitting vs.\\ the simplified spectral deferred corrections method we introduced previously) influences the accuracy, efficiency, and the nucleosynthesis of simulations of double detonations. We find no need to limit reaction rates or reduce the simulation timestep to the reaction timescale. The entire simulation methodology used here is GPU-accelerated and made freely available as part of the Castro simulation code.\n\n", "2309.01768": "2023-09-04, **Detection of optical emission from the supernova remnant G7.7-3.7**, V. Domček et.al., [2309.01768v1](http://arxiv.org/abs/2309.01768v1)\n\n We present the first optical study of the supernova remnant (SNR) G7.7-3.7, with the aim of determining its evolutionary phase since it has been suggested to be the remnant of SN 386 AD. We obtained narrow-band images in the filters H$\\alpha$ + [NII], H$\\beta$, [OIII], [SII] that revealed faint optical emission in the southern region of the SNR consisting of two filaments elongated in the east-west direction aligned with the X-ray emitting region of the remnant. The filaments were seen in H$\\alpha$ + [NII], [OIII] images and marginally in the [SII] images, with a non-detection in H$\\beta$. Long-slit spectroscopy of three regions along one filament revealed large ratios of [SII] / H$\\alpha$ = (1.6-2.5), consistent with that expected for a shock-heated SNR. The [SII] doublet ratio observed in two of the regions implies an upper limit for the electron density of the gas, with estimates falling below 400 cm$^{-3}$ and 600 cm$^{-3}$ in the respective areas. We discuss potential physical mechanisms that formed the observed optical filaments and we suggest that most likely they resulted by a collision of the SNR with a dense circumstellar shell lying at the southern region of the remnant.\n\n", "2309.01621": "2023-09-04, **A fresh perspective on the 3-D dynamics of Tycho's supernova remnant: ejecta asymmetries in X-rays**, Leila Godinaud et.al., [2309.01621v1](http://arxiv.org/abs/2309.01621v1)\n\n 450 years after the explosion of the Type Ia SN1572, the dynamics of the Tycho supernova remnant can give us keys to understand the explosion mechanism and the interaction of the remnant with the interstellar medium. To probe the asymmetries and the evolution of the SNR, we track the ejecta dynamics using new methods applied to the deep X-ray observations available in the Chandra space telescope archive. For the line of sight velocity measurement Vz, we use the Doppler effect focused on the bright Si line in the 1.6-2.1 keV band. Using the component separation tool General Morphological Component Analysis (GMCA), we successfully disentangle the red and blueshifted Si ejecta emission. This allows us to reconstruct a map of the peak energy of the Si line with a total coverage of the SNR at a 2'' resolution and a proxy of the velocity in the line of sight. For the proper motions in the plane of the sky Vxy, we develop a new method, named Poisson Optical Flow, to measure the displacement of 2D features between the observations of 2003 and 2009. The result is a field of 1700 velocity vectors covering the entire SNR. These exhaustive 3D velocity measurements reveal the complex and patchy dynamics of the SNR. At the large-scale, an asymmetry with the North being dominantly blueshifted and the South redshifted is observed. The proper motion vector field Vxy highlights different dynamics between the East and the West parts of the SNR. The eastern velocity field is more disturbed by external inhomogeneities and the South-East ejecta knot. In particular, a slow-down is observed in the North-East which could be due to the interaction with higher densities as seen in other wavelengths. The vector field is also used to backtrace the center of the explosion which is then compared with potential stellar progenitors distances from the latest Gaia DR3, leaving only stars B and E as possible candidates.\n\n", "2309.01533": "2023-09-04, **Light clusters in the liquid proto-neutron star inner crust**, H. Dinh Thi et.al., [2309.01533v1](http://arxiv.org/abs/2309.01533v1)\n\n Being born hot from core-collapse supernova, the crust of the proto-neutron star is expected to be made of a Coulomb liquid and composed of an ensemble of different nuclear species. In this work, we study the beta-equilibrated proto-neutron-star crust in the liquid phase in a self-consistent multi-component approach, employing a compressible liquid-drop description of the ions including the ion centre-of-mass motion. Particular care is also devoted to the calculation of the rearrangement term, thus ensuring thermodynamic consistency. We compare the results of the multi-component plasma calculations with those obtained within a one-component (single-nucleus) approach, showing that important differences arise between the predictions of the two treatments. In particular, the abundances of helium clusters become important using a complete multi-component plasma approach, and eventually dominate the whole distribution at higher temperature in the crust.\n\n", "2309.01500": "2023-09-04, **Unique chemical composition of the very metal-poor star LAMOST J1645+4357**, Wako Aoki et.al., [2309.01500v1](http://arxiv.org/abs/2309.01500v1)\n\n We report on the chemical composition of the very metal-poor ([Fe/H]=-2.9) star LAMOST J1645+4357 that is identified to be a red giant having peculiar abundance ratios by Li et al. (2022). The standard abundance analysis is carried out for this object and the well studied metal-poor star HD~122563 that has similar atmospheric parameters. LAMOST J1645+4357 has a remarkable abundance set, highlighted by these features: (1) Nitrogen is significantly enhanced ([N/Fe]=+1.4) and the total abundance of C and N is also very high ([(C+N)/Fe]=+0.9); (2) alpha-elements are over-abundant with respect to iron as generally found in very metal-poor stars; (3) Ti, Sc, Co and Zn are significantly deficient; (4) Cr and Mn are enhanced compared to most of very metal-poor stars; (5) Sr and Ba are deficient and the Sr/Ba ratio ([Sr/Ba]=-1.0) is significantly lower than the value expected for the r-process. The overall abundance pattern of this object from C to Zn is well reproduced by a faint supernova model assuming spherical explosion, except for the excess of Cr and Mn which requires enhancement of incomplete Si burning or small contributions of a type Ia supernova or a pair-instability supernova. There remains, however, a question why the abundance pattern of this star is so unique among very metal-poor stars.\n\n", "2309.01389": "2023-09-04, **The Dusty and Extremely Red Progenitor of the Type II Supernova 2023ixf in Messier 101**, Danfeng Xiang et.al., [2309.01389v1](http://arxiv.org/abs/2309.01389v1)\n\n Stars with initial masses in the range of 8-25 solar masses are thought to end their lives as hydrogen-rich supernova (SNe II). Based on the pre-explosion images of Hubble Space Telescope (\\textit{HST}) and \\textit{Spitzer} Space Telescope, we place tight constraints on the progenitor candidate of type IIP SN 2023ixf in Messier 101. Fitting of the spectral energy distribution (SED) of its progenitor with dusty stellar spectral models results in an estimation of the effective temperature as 3090 K, making it the coolest SN progenitor ever discovered. The luminosity is estimated as log($L/$L$\\_{\\odot}$)$\\sim4.8$, consistent with a red supergiant (RSG) star with an initial mass of 12$^{+2}\\_{-1}$ M$\\_{\\odot}$. The derived mass loss rate (6-9$\\times10^{-6}$ M$\\_{\\odot}$ yr$^{-1}$) is much lower than that inferred from the flash spectroscopy of the SN, suggesting that the progenitor experienced a sudden increase in mass loss when approaching the final explosion. In the mid-infrared color diagram, the progenitor star is found to show a significant deviation from the range of regular RSGs, but is close to some extreme RSGs and super asymptotic giant branch (sAGB) stars. Thus, SN 2023ixf may belong to a rare subclass of electron-captured supernova for an origin of sAGB progenitor.\n\n", "2309.01375": "2023-09-04, **An analytical late-Universe approach to the weaving of modern cosmology**, Fabrizio Cogato et.al., [2309.01375v1](http://arxiv.org/abs/2309.01375v1)\n\n Combining cosmological probes has consolidated the standard cosmological model with percent precision, but some tensions have recently emerged when certain parameters are estimated from the local or primordial Universe. Whether this is due to hidden systematics or it points towards new physics is still under debate, however, it is crucial to study as many probes as possible to cross-check the results with independent methods and provide additional pieces of information to the cosmological puzzle. In this work, by combining several late-Universe probes sampling the redshift range $0<z<10$, namely, Type Ia SuperNovae, Baryon Acoustic Oscillations, Cosmic Chronometers and Gamma-Ray Bursts, we aim to derive cosmological constraints independently of local or early-Universe anchors. To test the standard cosmological model and its various extensions, considering an evolving Dark Energy Equation of State and the curvature as a free parameter, we analyse each probe individually and all their possible permutations. Assuming a flat $\\Lambda$CDM model, the full combination of probes provides $H\\_0=67.2^{+3.4}\\_{-3.2}$ km s$^{-1}$ Mpc$^{-1}$ and $\\Omega\\_m=0.325\\pm0.015$ ($68\\%$ C.L.). Considering a flat $w$CDM model, we measure $w\\_0=-0.91^{+0.07}\\_{-0.08}$ ($68\\%$ C.L.), while by relaxing the flatness assumption ($\\Lambda$CDM model, $95\\%$ C.L.) we obtain $\\Omega\\_k=0.125^{+0.167}\\_{-0.165}$. Finally, we analytically characterize the degeneracy directions and the relative orientation of the probes' contours. By calculating the Figure--of--Merit, we quantify the synergies among independent methods, estimate the constraining power of each probe and identify which provides the best contribution to the inference process. Pending the new cosmological surveys, this study confirms the exigency for new emerging cosmological probes in the landscape of modern cosmology.\n\n"}}