{"neutrino": {"2402.08459": "2024-02-13, **The SRG-eROSITA All-Sky Survey : Constraints on f(R) Gravity from Cluster Abundance**, E. Artis et.al., [2402.08459v1](http://arxiv.org/abs/2402.08459v1)\n\n The evolution of the cluster mass function traces the growth of the linear density perturbations and can be utilized for constraining the parameters of cosmological and alternative gravity models. In this context, we present new constraints on potential deviations from general relativity by investigating the Hu-Sawicki parametrization of the f(R) gravity with the first SRG-eROSITA All-Sky Survey (eRASS1) cluster catalog in the Western Galactic Hemisphere in combination with the overlapping Dark Energy Survey Year 3, KiloDegree Survey and Hyper Supreme Camera data for weak lensing mass calibration. For the first time, we present constraints obtained from cluster abundances only. When we consider massless neutrinos, we find a strict upper limit of log \\|fR0\\| < -4.31 at 95% confidence level. Massive neutrinos suppress structure growth at small scales, and thus have the opposite effect of f(R) gravity. We consequently investigate the joint fit of the mass of the neutrinos with the modified gravity parameter. We obtain log \\|fR0\\| < -4.12 jointly with \\sum m\\_\\nu < 0.44 e.V. at 95% confidence level, tighter than the limits in the literature utilizing cluster counts only. At log \\|fR0\\|= - 6, the number of clusters is not significantly changed by the theory.   Consequently, we do not find any statistical deviation from general relativity from the study of eRASS1 cluster abundance. Deeper surveys with eROSITA, increasing the number of detected clusters, will further improve constraints on log \\|fR0\\| and investigate alternative gravity theories.\n\n", "2402.08458": "2024-02-13, **The SRG/eROSITA All-Sky Survey: Cosmology Constraints from Cluster Abundances in the Western Galactic Hemisphere**, V. Ghirardini et.al., [2402.08458v1](http://arxiv.org/abs/2402.08458v1)\n\n The cluster mass function traces the growth of linear density perturbations and provides valuable insights into the growth of structures, the nature of dark matter, and the cosmological parameters governing the Universe. The primary science goal of eROSITA, on board the {\\it Spectrum Roentgen Gamma (SRG)} mission, launched in 2019, is to constrain cosmology through the evolution of cluster mass function. In this paper, we present the cosmological constraints obtained from 5259 clusters of galaxies detected over an area of 12791~deg$^2$ in the Western Galactic Hemisphere of the eROSITA's first All-Sky Survey (eRASS1). The common footprint region between the eROSITA Survey and DES, KiDS, and HSC surveys is used for calibration of the scaling between X-ray count rate and their total mass through measurements of their weak gravitational lensing signal. eRASS1 cluster abundances constrain the $\\Lambda$CDM parameters, which are the energy density of the total matter to $\\Omega\\_{\\mathrm{m}}=0.29^{+0.01}\\_{-0.02}$, and the normalization of the density fluctuations to $\\sigma\\_8=0.88\\pm0.02$ and their combination yields $S\\_8=\\sigma\\_8 (\\Omega\\_\\mathrm{m} / 0.3)^{0.5}=0.86\\pm0.01$, consistent and at a similar precision with the state-of-the-art CMB measurements. eRASS1 cosmological experiment places a most stringent upper limit on the summed masses of left-handed light neutrinos to $\\sum m\\_\\nu< 0.22\\mathrm{~eV}$ (95\\% confidence interval). Combining eRASS1 cluster abundance measurements with CMB and ground-based neutrino oscillation experiments, we measure the summed neutrino masses to be $\\sum m\\_\\nu=0.08\\_{-0.02}^{+0.03}\\mathrm{~eV}$ or $\\sum m\\_\\nu=0.12\\_{-0.01}^{+0.03}\\mathrm{~eV}$ depending on the mass hierarchy scenario for neutrino eigenstates. eRASS1 cluster abundances significantly improve the constraints on the dark energy equation of state parameter to $w=-1.12\\pm0.12$. (ABRIDGED)\n\n", "2402.08363": "2024-02-13, **Astronomy potential of KM3NeT/ARCA**, T. van Eeden et.al., [2402.08363v1](http://arxiv.org/abs/2402.08363v1)\n\n The KM3NeT/ARCA neutrino detector is currently under construction at 3500 m depth offshore Capo Passero, Sicily, in the Mediterranean Sea. The main science objectives are the detection of high-energy cosmic neutrinos and the discovery of their sources. Simulations were conducted for the full KM3NeT/ARCA detector, instrumenting a volume of 1 km$^3$, to estimate the sensitivity and discovery potential to point-like neutrino sources and an all-sky diffuse neutrino flux. This paper covers the reconstruction of track- and shower-like signatures, as well as the criteria employed for neutrino event selection. By leveraging both the track and shower observation channels, the KM3NeT/ARCA detector demonstrates the capability to detect the diffuse astrophysical neutrino flux within half a year of operation, achieving a 5$\\sigma$ statistical significance. With an angular resolution below 0.1$^\\circ$ for tracks and under 2$^\\circ$ for showers, the sensitivity to point-like neutrino sources surpasses existing observed limits across the entire sky.\n\n"}, "dark matter": {"2402.08652": "2024-02-13, **Dark matter as the trigger of flavor changing neutral current decays of the top quark**, Adil Jueid et.al., [2402.08652v1](http://arxiv.org/abs/2402.08652v1)\n\n We suggest a simplified model that simultaneously addresses the dark-matter problem and give rise to top quark flavor changing neutral current (FCNC) interactions at the one-loop order. The model consists of two extra $SU(2)\\_L$ gauge singlets: a colored mediator of spin zero ($S$) and a right-handed fermion ($\\chi$) both are odd under an ad-hoc $Z\\_2$ symmetry. The right-handed fermion plays the role of the dark-matter candidate. In this model, the presence of the two dark sector particles generates one-loop induced FCNC decays of the top quark into light quarks and bosons such as the gluon, the photon, the $Z$-boson or the Higgs boson. As a case study, we analyze the top quark FCNC decays into light quarks ($u$ or $c$) and a $Z$ or Higgs bosons. We then study the reliable solutions to the dark-matter problem by estimating the regions in the parameter space that are consistent with the \\textsc{Planck} measurement of the dark-matter relic density. We also revisit the bounds from the searches of dark matter in events with at least one high-$p\\_T$ jet and large missing transverse energy at the Large Hadron Collider (LHC). We then define four benchmark points that are consistent with the existing constraints from collider experiments and cosmology. We finally estimate, for these benchmark scenarios, the rates of a broad range of channels that can be used to probe the connection between the top FCNC transitions and dark matter both at the HL-LHC and a future $100$ TeV collider.\n\n", "2402.08460": "2024-02-13, **The SRG/eROSITA All-Sky Survey: Tracing the Large-Scale Structure with a clustering study of galaxy clusters**, R. Seppi et.al., [2402.08460v1](http://arxiv.org/abs/2402.08460v1)\n\n The spatial distribution of galaxy clusters provides a reliable tracer of the large-scale distribution of matter in the Universe. The clustering signal depends on intrinsic cluster properties and cosmological parameters. The ability of eROSITA onboard Spectrum-Roentgen-Gamma (SRG) to discover galaxy clusters allows probing the association of extended X-ray emission to dark matter haloes. We aim to measure the projected two-point correlation function to study the occupation of dark matter halos by clusters and groups detected by the first eROSITA all-sky survey (eRASS1). We create five volume-limited samples probing clusters with different redshift and X-ray luminosity. We interpret the correlation function with halo occupation distribution (HOD) and halo abundance matching (HAM) models. We simultaneously fit cosmological parameters and halo bias of a flux-limited sample of 6493 clusters with purity > 96%. Results. We obtain a detailed view of the halo occupation for eRASS1 clusters. The fainter population at low redshift (S0: LX = 4.63E43 erg/s, 0.1 < z < 0.2) is the least biased compared to dark matter, with b = 2.95 $\\pm$ 0.21. The brightest clusters up to higher redshift (S4: LX = 1.77E44 erg/s , 0.1 < z < 0.6) exhibit a higher bias b = 4.34 $\\pm$ 0.62. Satellite groups are rare, with a satellite fraction < 14.9% (8.1) for the S0 (S4) sample. We combine the HOD prediction with a HAM procedure to constrain the scaling relation between LX and mass in a new way and find a scatter of 0.36. We obtain cosmological constraints for the physical cold dark matter density 0.12+0.03-0.02 and an average halo bias b = 3.63+1.02-0.85. We model the clustering of galaxy clusters with a HOD approach for the first time, paving the way for future studies combining eROSITA with 4MOST, SDSS, Euclid, Rubin, and DESI to unravel the cluster distribution in the Universe.\n\n", "2402.08163": "2024-02-13, **A Search for Magnetized Quark Nuggets (MQNs), a Candidate for Dark Matter, Accumulating in Iron Ore**, J. Pace VanDevender et.al., [2402.08163v1](http://arxiv.org/abs/2402.08163v1)\n\n A search has been carried out for Magnetized Quark Nuggets (MQNs) accumulating in iron ore over geologic time. MQNs, which are theoretically consistent with the Standard Models of Physics and of Cosmology, have been suggested as dark-matter candidates. Indirect evidence of MQNs has been previously inferred from observations of magnetars and of non-meteorite impact craters. It is shown in this paper that MQNs can accumulate in taconite (iron ore) and be transferred into ferromagnetic rod-mill liners during processing of the ore. When the liners are recycled to make fresh steel, they are heated to higher than the Curie temperature so that their ferromagnetic properties are destroyed. The MQNs would then be released and fall into the ferromagnetic furnace bottom where they would be trapped. Three such furnace bottoms have been magnetically scanned to search for the magnetic anomalies consistent with trapped MQNs. The observed magnetic anomalies are equivalent to an accumulation rate of ~1 kg of MQNs per 1.2 x $10^8$ kg of taconite ore processed. The results are consistent with MQNs but there could be other, unknown explanations. We propose an experiment and calculations to definitively test the MQN hypothesis for dark matter.\n\n", "2402.08149": "2024-02-13, **Constraints on Dark Matter-Dark Energy Scattering from ACT DR6 CMB Lensing**, Alex Laguë et.al., [2402.08149v1](http://arxiv.org/abs/2402.08149v1)\n\n The predicted present-day amplitude of matter fluctuations based on cosmic microwave background (CMB) anisotropy data has sometimes been found discrepant with more direct measurements of late-time structure. This has motivated many extensions to the standard cosmological model, including kinetic interactions between dark matter and dark energy that introduce a drag force slowing the growth of structure at late times. Exploring this scenario, we develop a model for quasi-linear scales in the matter power spectrum by calculating the critical overdensity in the presence of this interaction and a varying dark energy equation of state. We explicitly avoid modeling or interpretation of data on non-linear scales in this model (such as use of $\\Lambda$CDM-calibrated priors), which would require numerical simulations. We find that the presence of the drag force hinders halo formation, thus increasing the deviation from $\\Lambda$CDM in the mildly non-linear regime. We use CMB lensing observations from the sixth data release of the Atacama Cosmology Telescope up to $L=1250$ (in combination with Planck, Sloan Digital Sky Survey, and 6dFGS data) to derive the strongest constraints to date on the amplitude of the drag term, finding the dimensionless interaction strength $\\Gamma\\_\\mathrm{DMDE}/(H\\_0\\rho\\_\\mathrm{c})<0.831\\; (2.81)$ at the 68\\% (95\\%) confidence level. The inclusion of non-linear corrections improves our constraints by about 35\\% compared to linear theory. Our results do not exclude the best-fit values of $\\Gamma\\_\\mathrm{DMDE}$ found in previous studies using information from galaxy weak lensing, though we find no statistical preference for the dark matter-dark energy kinetic interactions over $\\Lambda$CDM. We implement our model in a publicly available fork of the Boltzmann code CLASS at https://github.com/fmccarthy/Class\\_DMDE.\n\n"}, "supernova": {}}