{"neutrino": {"2510.11467": "2025-10-13, **Proton-rich production of lanthanides: the νi process**, Xilu Wang et.al., [2510.11467v1](http://arxiv.org/abs/2510.11467v1)\n\n The astrophysical origin of the lanthanides is an open question in nuclear astrophysics. Besides the widely studied $s$, $i$, and $r$ processes in moderately-to-strongly neutron-rich environments, an intriguing alternative site for lanthanide production could in fact be robustly $\\textit{proton-rich}$ matter outflows from core-collapse supernovae under specific conditions -- in particular, high-entropy winds with enhanced neutrino luminosity and fast dynamical timescales. In this environment, excess protons present after charged particle reactions have ceased can continue to be converted to neutrons by (anti-)neutrino interactions, producing a neutron capture reaction flow up to A~200. This scenario, christened the $\\nu i$ process in a recent paper, has previously been discussed as a possibility. Here, we examine the prospects for $\\nu i$ process through the lens of stellar abundance patterns, bolometric lightcurves, and galactic chemical evolution models, with a particular focus on hypernovae as candidate sites. We identify specific lanthanide signatures for which the $\\nu i$ process can provide a credible alternative to $r$/$i$ processes.\n\n", "2510.11030": "2025-10-13, **Resonant W and Z Boson Production in FSRQ Jets: Implications for Diffuse Neutrino Fluxes**, J. -H. Ha et.al., [2510.11030v1](http://arxiv.org/abs/2510.11030v1)\n\n Blazars, particularly Flat Spectrum Radio Quasars (FSRQs), are well-known for their ability to accelerate a substantial population of electrons and positrons, as inferred from multiwavelength radiation observations. Therefore, these astrophysical objects are promising candidates for studying high-energy electron--positron interactions, such as the production of $W^{\\pm}$ and $Z$ bosons. In this work, we explore the implications of electron--positron annihilation processes in the jet environments of FSRQs, focusing on the resonant production of electroweak bosons and their potential contribution to the diffuse neutrino flux. By modeling the electron distribution in the jet of the FSRQ 3C~279 during a flaring state, we calculate the reaction rates for $W^{\\pm}$ and $Z$ bosons and estimate the resulting diffuse fluxes from the cosmological population of FSRQs.We incorporate the FSRQ luminosity function and its redshift evolution to account for the population distribution across cosmic time, finding that the differential flux contribution exhibits a pronounced peak at redshift $z \\sim 1$. While the expected fluxes remain well below the detection thresholds of current neutrino observatories such as IceCube, KM3NeT, or Baikal-GVD, the expected flux from the $Z$ boson production could account for approximately $10^{-3}$ of the total diffuse astrophysical neutrino flux. These results provide a theoretical benchmark for the role of Standard Model electroweak processes in extreme astrophysical environments and emphasize the interplay between particle physics and astrophysics, illustrating that even rare high-energy interactions can leave a subtle but quantifiable imprint on the diffuse astrophysical neutrinos.\n\n"}, "dark matter": {"2510.11700": "2025-10-13, **Revisiting the limits on dark matter annihilation cross-section and decay lifetime in light of electron and positron fluxes**, Nagisa Hiroshima et.al., [2510.11700v1](http://arxiv.org/abs/2510.11700v1)\n\n We revisit the upper bound on the annihilation cross-section, $\\langle\\sigma v\\rangle$ of a stable dark matter (DM) of mass $5\\times10^2-10^{14}$ GeV by considering five different channels: $W^+W^-$, $b\\bar{b}$, $\\mu^+\\mu^-$, $\\tau^+\\tau^-$, and $e^+e^-$. We use the observed electron and positron fluxes from CALET, DAMPE, HESS, positron flux from AMS-02, and gamma-ray flux from HAWC, GRAPES-3, CASA-MIA to constrain the annihilation cross-section. We also consider unstable DM of mass $10^3-10^{16}$~GeV decaying to $W^+W^-$, $b\\bar{b}$, $\\mu^+\\mu^-$, $\\tau^+\\tau^-$, and $e^+e^-$ and derive the corresponding lower bound on the DM lifetime, $\\tau\\_{\\rm DM}$. We find that the latest data from CALET gives a stringent constraint on $\\langle\\sigma v\\rangle$ in the low DM mass regime. For a typical DM mass of 1 TeV, we show that $\\langle\\sigma v\\rangle\\_{{\\rm DM~DM}\\rightarrow\\mu^+\\mu^-}\\gtrsim\\mathcal{O}(10^{-24})~\\rm cm^3/s$ is disfavored. On the other hand in the low mass regime, the AMS-02 gives a much stringent limit on the DM lifetime, excluding $\\tau\\_{\\rm DM\\rightarrow\\mu^+\\mu^-}\\lesssim\\mathcal{O}(10^{27})$ s for a 1 TeV mass of DM. In the high mass regime, typically $M\\_{\\rm DM}\\gtrsim\\mathcal{O}(10^5)$ GeV, HAWC and CASA-MIA give the strongest constraints on $\\langle\\sigma v\\rangle$ and $\\tau\\_{\\rm DM}$.\n\n", "2510.11644": "2025-10-13, **Applying Normalizing Flows for spin correlations reconstruction in associated top-quark pair and dark matter production**, E. Abasov et.al., [2510.11644v1](http://arxiv.org/abs/2510.11644v1)\n\n We apply a unified machine-learning framework based on Normalizing Flows (NFs) for the event-by-event reconstruction of invisible momenta and the subsequent evaluation of spin-sensitive observables in top-quark pair and dark-matter (DM) associated production processes. Building on recent studies in single-top + DM topologies, we extend the research to $t\\bar{t}$ + DM final states. Inputs to our networks combine low-level four-momenta and missing transverse energy with high-level kinematic and angular variables. We compare a baseline multilayer perceptron (MLP) regressor, an autoregressive flow, and the conditional $\\nu$-Flows model -- trained to learn the full conditional density. In these final states all the models perform well and demonstrate high reconstruction quality in independent regions split by $m\\_{t\\bar{t}}$ for validation purposes. We highlight the potential of this approach to be extended to three- and four-top-quark production.\n\n", "2510.11635": "2025-10-13, **Hints of Dark Matter Spikes in Low-mass X-ray Binaries: a critical assessment**, Francesca Scarcella et.al., [2510.11635v1](http://arxiv.org/abs/2510.11635v1)\n\n Three black-hole low-mass X-ray binaries (LMXBs) in the Milky Way show rates of period decay which cannot be easily explained by standard mechanisms. Recently, it has been claimed that the anomalous period decays in two of these systems may be explained by dynamical friction due to very high dark matter (DM) densities around the black holes. We critically assess these claims by performing $N$-body simulations of binaries embedded in dense DM ``spikes\". We simulate the previously-studied systems XTE J1118+480 and A0620--00, as well as studying the third binary Nova Muscae 1991 for the first time in this context. These simulations show that feedback on the DM distribution plays a crucial role and we rule out previously-claimed shallow DM spikes. We set lower limits on the steepness $\\gamma$ of DM density profiles required to explain the period decay in these LMXBs, requiring $\\gamma \\gtrsim 2.15-2.20$ in XTE J1118+480 and A0620--00 and $\\gamma \\gtrsim 2.3$ in Nova Muscae 1991. Improved modeling of the long-term evolution of binaries embedded in DM spikes may allow us to exclude even larger densities in future.\n\n", "2510.11629": "2025-10-13, **From Primordial Stars to Early Galaxies: A Semi-Analytic Model Calibrated with Aeos and Renaissance**, Ryan Hazlett et.al., [2510.11629v1](http://arxiv.org/abs/2510.11629v1)\n\n We present an extension of our semi-analytic model that follows the formation of Population III stars and their metal-enriched descendants, incorporating dark matter halo merger trees from cosmological $N$-body simulations and feedback from reionization. Our extended model is calibrated using two complementary cosmological hydrodynamical simulations: Aeos, which resolves individual Population III and II stars to $z\\sim14.6$, and Renaissance, which is lower resolution but follows large-scale metal-enriched star formation to $z \\sim 11$. With a combined calibration, we capture small-scale physics of primordial star formation over a large range in halo mass. We find good agreement between our calibrated model and Aeos, reproducing the evolution in number of star-forming halos and total stellar mass. Achieving this agreement requires increasing the normalization of, flattening the redshift dependence of, and adding scatter to the commonly used critical mass threshold $M\\_{\\mathrm{crit}}$. Our treatment of the delay between Pop III stellar death and subsequent Pop II star formation emphasizes the need to account for halos that have yet to transition to Pop II, since incomplete sampling of this delay in simulations limits physically motivated calibrations. Finally, we apply our model to larger-volume dark matter only simulations and predict $\\sim10$ active Pop III sources at $z = 10$ lie within the area strongly lensed by galaxy cluster MACS J0416 with a magnification exceeding $\\mu > 30$. These results demonstrate that semi-analytic approaches, when calibrated to hydrodynamical simulations, can provide accurate, computationally efficient predictions for the earliest stages of cosmic star formation.\n\n", "2510.11611": "2025-10-13, **Primordial Black Holes from Primordial Voids**, Cristian Joana et.al., [2510.11611v1](http://arxiv.org/abs/2510.11611v1)\n\n Primordial black holes (PBHs) are a compelling dark matter candidate and a unique probe of small-scale cosmological fluctuations. Their formation is usually attributed to large positive curvature perturbations, which collapse upon Hubble re-entry during radiation domination. In this work we investigate instead the role of negative curvature perturbations, corresponding to the growth of primordial void (PV) like regions. Using numerical relativity simulations, we show that sufficiently deep PV can undergo a nonlinear rebounce at the center, generating an effective overdensity that eventually collapses into a PBH. We determine the critical threshold for this process for a variety of equations of state, and demonstrate that the resulting black holes obey a scaling relation analogous to the standard overdensity case. These results establish primordial voids as a novel channel for PBH formation and highlight their potential impact on PBH abundances and cosmological signatures.\n\n", "2510.11569": "2025-10-13, **Note on Kaniadakis Holographic Dark Energy**, A. Sheykhi et.al., [2510.11569v1](http://arxiv.org/abs/2510.11569v1)\n\n It is well-known that any modification to the entropy expression not only change the energy density of the holographic dark energy, but also modifies the cosmological field equations through thermodynamics-gravity correspondence. Here we revisit the Kaniadakis holographic dark energy (KHDE) in the background of the modified Kaniadakis cosmology by incorporating the effects of Kaniadakis entropy into the Friedmann equations. We choose the Hubble radius, $L=H^{-1}$, as system's IR cutoff and determine the cosmological implications of this model. We first consider a dark energy (DE) dominated universe and reveal that this model mimics the cosmological constant with $w\\_{DE}=-1$. This implies that the theoretical origin of the cosmological constant, $\\Lambda$, may be understood through KHDE in the context of Kaniadakis cosmology. Remarkably, we observe that in the absence of interaction between DE and dark matter (DM), and in contrast to HDE in standard cosmology, our model can explain the current acceleration of the cosmic expansion for the Hubble radius as IR cutoff. When the interaction between DE and DM is taken into account, we see that the total equation of state parameter (EoS), $w\\_{tot}=p\\_{tot}/\\rho\\_{tot}$ can cross the phantom line at the present time. We also analyze the squared speed of sound, $v\\_s^2$, for this model and find out that $(v\\_s^2<0)$ for interacting KHDE. Investigating the statefinder, confirms the distinction between KHDE and $\\Lambda$CDM model. It is seen that the statefinder diagram move away from the point of $\\left\\lbrace r,s\\right\\rbrace= \\left\\lbrace 1,0\\right\\rbrace$ with increasing the interaction parameter.\n\n", "2510.11363": "2025-10-13, **Updated constraints on interacting dark energy: A comprehensive analysis using multiple CMB probes, DESI DR2, and supernovae observations**, Tian-Nuo Li et.al., [2510.11363v1](http://arxiv.org/abs/2510.11363v1)\n\n Recent DESI baryon acoustic oscillation (BAO) measurements, combined with Planck cosmic microwave background (CMB) data and DESY5 type Ia supernova (SN) data, indicate a significant deviation from $\\Lambda$CDM, which seems to suggest that this deviation can be explained by an interaction between dark energy and dark matter. In this work, we perform a comprehensive analysis by utilizing the latest DESI DR2 BAO data in conjunction with CMB data from ACT, SPT, Planck, and WMAP, along with SN data from PantheonPlus and DESY5. We consider four interacting dark energy (IDE) models with different forms of the interaction term $Q$. Our analysis indicates that CMB experiments other than Planck enhance the evidence for an interaction in the IDE models with $Q \\propto \\rho\\_{\\rm de}$. In particular, when using the SPT+DESI+DESY5 data, the IDE model with $Q = \\beta H\\_0 \\rho\\_{\\rm de}$ gives $\\beta = -0.4170 \\pm 0.1220$, with a deviation from zero reaching $3.4\\sigma$ level. When replacing DESY5 with PantheonPlus, this deviation weakens to $2.1\\sigma$ level, but remains relatively significant. Furthermore, the Bayes factors of the IDE model with $Q = \\beta H\\_0 \\rho\\_{\\rm de}$ are positive in all cases, providing a moderate-to-strong preference over $\\Lambda$CDM. Overall, our comprehensive analysis clearly suggests that the IDE models with $Q \\propto \\rho\\_{\\rm de}$ (especially, $Q = \\beta H\\_0 \\rho\\_{\\rm de}$) provide strong evidence supporting the existence of interaction and are more preferred by the current cosmological data.\n\n", "2510.11006": "2025-10-13, **Three Birds with One Stone: Core-Collapsed SIDM Halos as the Common Origin of Dense Perturbers in Lenses, Streams, and Satellites**, Hai-Bo Yu et.al., [2510.11006v1](http://arxiv.org/abs/2510.11006v1)\n\n We show that core-collapsed self-interacting dark matter halos of mass $\\sim 10^6\\,{M\\_\\odot}$, originally simulated to explain the dense perturber of the GD-1 stellar stream, also reproduce the structural properties inferred for the dense perturber detected in the strong lensing system JVAS B1938+666 from radio observations. Furthermore, these halos are sufficiently compact and dense to gravitationally capture field stars in satellite galaxies of the Milky Way, providing a natural explanation for the origin of Fornax 6, a stellar cluster in the Fornax dwarf spheroidal galaxy. Our results demonstrate that observations of halos with similar masses but residing in different cosmic environments offer a powerful and complementary probe of self-interacting dark matter.\n\n", "2510.10900": "2025-10-13, **Topological Landscapes of the BSM Higgs Sector**, Jyotiranjan Beuria et.al., [2510.10900v1](http://arxiv.org/abs/2510.10900v1)\n\n We explore the structure of the parameter space in the Singlet Scalar Dark Matter (SSDM) model and the Next-to-Two Higgs Doublet Model (N2HDM) with $\\tan\\beta = 5$ and $\\tan\\beta = 45$. Parameter points are classified as allowed or excluded based on compatibility with the Higgs observation constraints. Using a combined framework of Topological Data Analysis (TDA), Uniform Manifold Approximation and Projection (UMAP), and Linear Discriminant Analysis (LDA), we characterize the global geometry and topology of these high-dimensional landscapes. Our findings reveal that the SSDM and the N2HDM Type~I model exhibit finely tuned islands of collider viability. In the case of N2HDM Type~I, we also find that increasing $\\tan\\beta$ leads to greater topological fragmentation and higher Betti number persistence, indicating enhanced structural complexity. In contrast, the given choice of parameters excludes the entire N2HDM Type II parameter space based on current Higgs measurements. The topological properties serve as important quantitative descriptors for the phenomenological viability of the BSM frameworks. We leverage the above mentioned topological features to train machine learning models for faster characterization of the BSM Higgs sector into allowed and excluded parameter regions.\n\n", "2510.10845": "2025-10-12, **HI terminal velocity curves -- Lessons learned from N-body/hydrodynamic `surrogate' models of the Milky Way**, Hillary Davis et.al., [2510.10845v1](http://arxiv.org/abs/2510.10845v1)\n\n The development of an N-body/hydrodynamic `surrogate' model of the Milky Way (MW) - a model that resembles the MW in several key aspects after many Gyrs of evolution - would be extremely beneficial for Galactic Archaeology. Here we present four new `surrogate' models, all built with the Nexus framework. The simulations contain stars, dark matter and gas. Our most sophisticated model allows gas to evolve thermodynamically, and includes star formation, metal production, and stellar feedback. The other three models in this work have an isothermal gas disc. We examine these new simulations in the context of cold gas observations of the Galaxy. Our focus is the so-called `HI terminal velocity curve' - a heliocentric measurement of the maximum Vlos as a function of Galactic longitude, which dates back to the early days of radio astronomy. It is a powerful approach to indirectly estimating the gas dynamics because it does not require knowledge about the distance to individual gas clouds, which is difficult to estimate. A comparison of the terminal velocities and recovered rotation curve values in the simulations against observations suggests that our models are in need of further refinement. The gravitational torques associated with our synthetic bars are too strong, driving excessive streaming motion in the inner gas disc. This causes the simulated terminal velocity curves in the Galactic Quadrant I and IV to deviate substantially from each other, unlike what is seen in observed HI terminal velocities of the MW. We suggest possible ways forward for future models.\n\n", "2510.10757": "2025-10-12, **First galaxy ultraviolet luminosity function limits on dark matter-proton scattering**, Hovav Lazare et.al., [2510.10757v1](http://arxiv.org/abs/2510.10757v1)\n\n Scattering between dark matter (DM) and protons leads to suppressed small-scale fluctuations, with implications for a variety of cosmological observables. In this work, we search for evidence of DM-proton scattering with an interaction cross section $\\sigma\\!=\\!\\sigma\\_0 (\\frac{v}{c})^n$ for $n=0,2$ and $4$, corresponding e.g. to velocity-independent contact interactions from heavy mediators, velocity-dependent pseudoscalar-mediated scattering, and higher-order dipole interactions, respectively, using high-redshift ($z \\sim4-10$) ultraviolet galaxy luminosity functions (UVLFs) observed by Hubble Space Telescope (HST). We employ an adjusted implementation of GALLUMI combined with the modified Boltzmann solver CLASS DMeff that accounts for interacting DM, and incorporate UVLF data from both blank and lensed HST fields, alongside Planck CMB data and the Pantheon supernova catalog in a Bayesian analysis framework to set constraints on $\\sigma\\_0$. Our results show that including lensed UVLF data, which probe fainter galaxies than the blank HST fields and thus smaller scales, leads to a substantial improvement in the constraints on $\\sigma\\_0$ for $n>0$, surpassing existing bounds from Milky-Way (MW) satellite abundance and CMB anisotropies. For $m\\_{\\chi} = 1\\,\\rm MeV $, for example, we set the upper bounds at $8.3\\times 10^{-26} \\, \\rm cm^2$ for $n=2$ and $1.2\\times 10^{-22} \\, \\rm cm^2$ for $n=4$. For $n=0$, our bound is within an order of magnitude of those from the Lyman-$\\alpha$ forest and MW satellites.\n\n", "2510.10708": "2025-10-12, **Multimodal axion emissions from Abelian-Higgs cosmic strings**, Naoya Kitajima et.al., [2510.10708v1](http://arxiv.org/abs/2510.10708v1)\n\n We show that axions can be produced from Abelian-Higgs cosmic strings due to the axion-gauge coupling. The strong magnetic field is confined in the string, and the electric field is induced around the moving string, allowing axion productions from the dynamics of cosmic strings. Our numerical analysis on the string collision shows that a sizable number of axions can be produced at the reconnection, and further emissions occur from moving kinks afterward. Furthermore, the simulation on the string network shows multimodal axion emissions in the sense that axions are produced in both the low-energy and high-energy regimes. The former can contribute to the cold dark matter and the latter can be regarded as dark radiation. We found that the axion with sub-GeV mass can explain the current relic dark matter abundance and simultaneously predicts a sizable amount of dark radiation which can be probed by future observations.\n\n", "2510.10641": "2025-10-12, **Scattering of non-relativistic finite-size particles and puffy dark matter direct detection**, Wu-Long Xu et.al., [2510.10641v1](http://arxiv.org/abs/2510.10641v1)\n\n In this work we consider the scattering between non-relativistic particles with different finite sizes. We first calculate their interaction potential and apply the partial wave method to obtain their scattering cross section. Our findings show that the particle size can significantly affect the scattering between non-relativistic particles. Then we apply such a study to direct detection of puffy dark matter. We find that the finite size of the target nucleus may introduce non-perturbative effects that differ from the scenario of point-like dark matter. For large-size dark matter particles, this non-perturbative regime in the dark matter nucleus scattering cross section effectively disappears; while for small values of the size-to-range ratio in the scattering process, a significant non-perturbative regime can maintain. Finally, for the direct detection of nugget-type puffy dark matter with a small number of constituent particles, we find that the stability conditions for the formation of bound-state dark matter can provide constraints on the dark matter nucleus scattering cross section.\n\n"}, "supernova": {"2510.11719": "2025-10-13, **BayeSN-TD: Time Delay and $H_0$ Estimation for Lensed SN H0pe**, M. Grayling et.al., [2510.11719v1](http://arxiv.org/abs/2510.11719v1)\n\n We present BayeSN-TD, an enhanced implementation of the probabilistic type Ia supernova (SN Ia) BayeSN SED model, designed for fitting multiply-imaged, gravitationally lensed type Ia supernovae (glSNe Ia). BayeSN-TD fits for magnifications and time-delays across multiple images while marginalising over an achromatic, Gaussian process-based treatment of microlensing, to allow for time-dependent deviations from a typical SN Ia SED caused by gravitational lensing by stars in the lensing system. BayeSN-TD is able to robustly infer time delays and produce well-calibrated uncertainties, even when applied to simulations based on a different SED model and incorporating chromatic microlensing, strongly validating its suitability for time-delay cosmography. We then apply BayeSN-TD to publicly available photometry of the glSN Ia SN H0pe, inferring time delays between images BA and BC of $\\Delta T\\_{BA}=121.9^{+9.5}\\_{-7.5}$ days and $\\Delta T\\_{BC}=63.2^{+3.2}\\_{-3.3}$ days along with absolute magnifications $\\beta$ for each image, $\\beta\\_A = 2.38^{+0.72}\\_{-0.54}$, $\\beta\\_B=5.27^{+1.25}\\_{-1.02}$ and $\\beta\\_C=3.93^{+1.00}\\_{-0.75}$. Combining our constraints on time-delays and magnifications with existing lens models of this system, we infer $H\\_0=69.3^{+12.6}\\_{-7.8}$ km s$^{-1}$ Mpc$^{-1}$, consistent with previous analysis of this system; incorporating additional constraints based on spectroscopy yields $H\\_0=66.8^{+13.4}\\_{-5.4}$ km s$^{-1}$ Mpc$^{-1}$. While this is not yet precise enough to draw a meaningful conclusion with regard to the `Hubble tension', upcoming analysis of SN H0pe with more accurate photometry enabled by template images, and other glSNe, will provide stronger constraints on $H\\_0$; BayeSN-TD will be a valuable tool for these analyses.\n\n", "2510.11594": "2025-10-13, **Precise boron abundance in a sample of metal-poor stars from far-ultraviolet lines**, Monique Spite et.al., [2510.11594v1](http://arxiv.org/abs/2510.11594v1)\n\n The light elements beryllium (Be; $Z=4$) and boron (B; $Z=5$) are mainly produced by spallation reactions between cosmic rays and carbon (C; $Z=6$), nitrogen (N; $Z=7$), and oxygen (O; $Z=8$) nuclei. Only traces of Be or B would have been produced in the Big Bang, but there could be a contribution from the $\\nu$-process in type II supernovae. Their abundances at very low metallicities have been debated in the literature, with the aim of   understanding their origin.   Our aim is to derive the boron abundance in a sample of metal-poor stars based for the first time on observations with the   STIS spectrograph on board the Hubble Space Telescope, using clean B lines measured in space ultraviolet.   We identified a measurable line of B I at 2089.6 A.   In our sample of metal-poor warm stars, this line is practically free from blending lines,   and for this reason the precision of the presently derived boron abundances is unprecedented.   We find that in the interval -2.6<[Fe/H]<-1.0, the slope of the relation A(B) versus [Fe/H] is significantly larger than 1, and thus steeper than that obtained with Be abundances. As a consequence, we find in this interval of metallicity a B/Be ratio that slightly increases with [Fe/H].   Since at [Fe/H]=-1 the abundance of B is already close to the solar abundance, there should be a break in the B enrichment at a metallicity of about [Fe/H]=-1.\n\n", "2510.11555": "2025-10-13, **Probing cosmic curvature with Alcock-Paczynski data**, Yungui Gong et.al., [2510.11555v1](http://arxiv.org/abs/2510.11555v1)\n\n The Alcock-Paczynski (AP) parameter $F\\_{AP}$ is independent of the sound horizon $r\\_d$, making the Dark Energy Spectroscopic Instrument (DESI) baryon acoustic oscillation (BAO) AP measurements particularly well suited for cosmological applications. We propose a novel null test of cosmic curvature tailored to DESI BAO data that combines $F\\_{AP}$ with the ratios $D\\_V'/D\\_V$ or $D\\_M'/D\\_M$. This null test can also be performed using a joint dataset of DESI BAO and type Ia supernova (SNe Ia) observations. Additionally, we use the test to assess the internal consistency and mutual compatibility of these datasets. We find that the data are compatible. Although the results show that a spatially flat universe is inconsistent with the data at low redshift $z\\lesssim 0.5$, we cannot draw the conclusion that the observational data prefers $\\Omega\\_k\\neq 0$ because there is no observational data in that region.\n\n", "2510.11363": "2025-10-13, **Updated constraints on interacting dark energy: A comprehensive analysis using multiple CMB probes, DESI DR2, and supernovae observations**, Tian-Nuo Li et.al., [2510.11363v1](http://arxiv.org/abs/2510.11363v1)\n\n Recent DESI baryon acoustic oscillation (BAO) measurements, combined with Planck cosmic microwave background (CMB) data and DESY5 type Ia supernova (SN) data, indicate a significant deviation from $\\Lambda$CDM, which seems to suggest that this deviation can be explained by an interaction between dark energy and dark matter. In this work, we perform a comprehensive analysis by utilizing the latest DESI DR2 BAO data in conjunction with CMB data from ACT, SPT, Planck, and WMAP, along with SN data from PantheonPlus and DESY5. We consider four interacting dark energy (IDE) models with different forms of the interaction term $Q$. Our analysis indicates that CMB experiments other than Planck enhance the evidence for an interaction in the IDE models with $Q \\propto \\rho\\_{\\rm de}$. In particular, when using the SPT+DESI+DESY5 data, the IDE model with $Q = \\beta H\\_0 \\rho\\_{\\rm de}$ gives $\\beta = -0.4170 \\pm 0.1220$, with a deviation from zero reaching $3.4\\sigma$ level. When replacing DESY5 with PantheonPlus, this deviation weakens to $2.1\\sigma$ level, but remains relatively significant. Furthermore, the Bayes factors of the IDE model with $Q = \\beta H\\_0 \\rho\\_{\\rm de}$ are positive in all cases, providing a moderate-to-strong preference over $\\Lambda$CDM. Overall, our comprehensive analysis clearly suggests that the IDE models with $Q \\propto \\rho\\_{\\rm de}$ (especially, $Q = \\beta H\\_0 \\rho\\_{\\rm de}$) provide strong evidence supporting the existence of interaction and are more preferred by the current cosmological data.\n\n", "2510.10757": "2025-10-12, **First galaxy ultraviolet luminosity function limits on dark matter-proton scattering**, Hovav Lazare et.al., [2510.10757v1](http://arxiv.org/abs/2510.10757v1)\n\n Scattering between dark matter (DM) and protons leads to suppressed small-scale fluctuations, with implications for a variety of cosmological observables. In this work, we search for evidence of DM-proton scattering with an interaction cross section $\\sigma\\!=\\!\\sigma\\_0 (\\frac{v}{c})^n$ for $n=0,2$ and $4$, corresponding e.g. to velocity-independent contact interactions from heavy mediators, velocity-dependent pseudoscalar-mediated scattering, and higher-order dipole interactions, respectively, using high-redshift ($z \\sim4-10$) ultraviolet galaxy luminosity functions (UVLFs) observed by Hubble Space Telescope (HST). We employ an adjusted implementation of GALLUMI combined with the modified Boltzmann solver CLASS DMeff that accounts for interacting DM, and incorporate UVLF data from both blank and lensed HST fields, alongside Planck CMB data and the Pantheon supernova catalog in a Bayesian analysis framework to set constraints on $\\sigma\\_0$. Our results show that including lensed UVLF data, which probe fainter galaxies than the blank HST fields and thus smaller scales, leads to a substantial improvement in the constraints on $\\sigma\\_0$ for $n>0$, surpassing existing bounds from Milky-Way (MW) satellite abundance and CMB anisotropies. For $m\\_{\\chi} = 1\\,\\rm MeV $, for example, we set the upper bounds at $8.3\\times 10^{-26} \\, \\rm cm^2$ for $n=2$ and $1.2\\times 10^{-22} \\, \\rm cm^2$ for $n=4$. For $n=0$, our bound is within an order of magnitude of those from the Lyman-$\\alpha$ forest and MW satellites.\n\n"}}