{"neutrino": {"2303.08104": "2023-03-14, **Tau Polarization and Correlated Decays in Neutrino Experiments**, Joshua Isaacson et.al., [2303.08104v1](http://arxiv.org/abs/2303.08104v1)\n\n We present the first fully differential predictions for tau neutrino scattering in the energy region relevant to the DUNE experiment, including all spin correlations and all tau lepton decay channels. The calculation is performed using a generic interface between the neutrino event generator Achilles and the publicly available, general-purpose collider event simulation framework Sherpa.\n\n", "2303.07980": "2023-03-14, **Primordial black hole formation during the QCD phase transition: threshold, mass distribution and abundance**, Ilia Musco et.al., [2303.07980v1](http://arxiv.org/abs/2303.07980v1)\n\n Primordial black hole (PBH) formation during cosmic phase transitions and annihilation periods, such as the QCD transition or the $e^+e^-$-annihilation, is known to be particularly efficient due to a softening of the equation of state. We present a detailed numerical study of PBH formation during the QCD epoch in order to derive an accurate PBH mass function. We also briefly consider PBH formation during the $e^+e^-$-annihilation epoch. Our investigation confirms that, for nearly scale-invariant spectra, PBH abundances on the QCD scale are enhanced by a factor $\\sim 10^3$ compared to a purely radiation dominated Universe. For a power spectrum producing an (almost) scale-invariant PBH mass function outside of the transition, we find a peak mass of $M\\_{\\rm pbh}\\approx 1.9 M\\_{\\odot}$ of which a fraction $f\\approx 1.5\\times 10^{-2}$ of the PBHs have a mass of $M\\_{\\rm pbh} > 10 M\\_{\\odot}$, possibly contributing to the LIGO-Virgo black hole merger detections. We point out that the physics of PBH formation during the $e^+e^-$-annihilation epoch is more complex as it is very close to the epoch of neutrino decoupling. We argue that neutrinos free-streaming out of overdense regions may actually hinder PBH formation.\n\n", "2303.07209": "2023-03-13, **An $SU(5)\\times U(1)^\\prime$ SUSY GUT with a \"vector-like chiral\" fourth family to fit all low energy data, including the muon $g-2$**, Harshal Kulkarni et.al., [2303.07209v1](http://arxiv.org/abs/2303.07209v1)\n\n An additional generation of quarks and leptons and their SUSY counterparts, which are vector-like under the Standard Model gauge group but are chiral with respect to the new U(1)$\\_{3-4}$ gauge symmetry, are added to the Minimal Supersymmetric Standard Model (MSSM). We show that this model is a GUT and unifies the three SM gauge couplings and also the additional U(1)$\\_{3-4}$ coupling at a GUT scale of $\\approx 5 \\times 10^{16}$ GeV and explains the experimentally observed deviation of the muon $g-2$. We also fit the quark flavor changing processes consistent with the latest experimental data and look at the effect of the new particles on the $W$ boson mass without obviously conflicting with the observed masses of particles, CKM matrix elements, neutrino mixing angles, their mass differences, and the lepton-flavor violating bounds. This model predicts sparticle masses less than 25 TeV, with a gluino mass $\\approx 2.3 - 3$ TeV consistent with constraints, and one of the neutralinos as the LSP with a mass of $\\approx 480 - 580$ GeV, which is a potential dark matter candidate. The model is string theory motivated and predicts the VL quarks, leptons, a massive $Z'$ and two Dirac neutrinos at the TeV scale and the branching ratios of $\\mu \\longrightarrow e \\gamma$, $\\tau \\longrightarrow \\mu \\gamma$ and $\\tau \\longrightarrow 3\\mu$ with BR($\\mu \\longrightarrow e \\gamma$) within reach of future experiments.\n\n", "2303.07094": "2023-03-13, **Probing generalized neutrino interactions with DUNE Near Detector**, Pantelis Melas et.al., [2303.07094v1](http://arxiv.org/abs/2303.07094v1)\n\n We explore the prospects of constraining general non standard interactions involving light mediators through elastic neutrino-electron scattering events at the DUNE Near Detector (ND). We furthermore consider the special cases of light vector mediators in motivated models such as $U(1)\\_{B-L}$, $U(1)\\_{L\\_\\mu - L\\_\\tau}$, $E\\_6$ and left-right symmetry. The present analysis is based on detailed Monte Carlo simulations of the expected DUNE-ND signal taking into account detector resolution effects, realistic backgrounds as well as On-Axis and Off-Axis neutrino spectra. We show that the high intensity neutrino beam available at Fermilab can place competitive constraints surpassing those of low-energy neutrino searches and direct detection dark matter experiments.\n\n"}, "dark matter": {"2303.07978": "2023-03-14, **Measurement of the Compton scattering in germanium with a p-type point-contact germanium detector for dark matter detection**, J. W. Hu et.al., [2303.07978v1](http://arxiv.org/abs/2303.07978v1)\n\n Low-energy background through Compton scattering from the ambient $\\gamma$ rays can be contaminated in direct dark matter search experiments. In this paper, we report comparable measurements on low-energy spectra via Compton scattering from several $\\gamma$-ray sources with a p-type point-contact germanium detector. The spectra between 500 eV and 18 keV have been measured and analyzed. Moreover, the features of the electron binding effect, particularly at the edges of the K- and L-shells in the germanium atom, were observed with different gamma sources and were consistent with the models in the Geant4 simulation. An empirical background model is proposed that provides insights into understanding the low-energy background in germanium for direct dark matter experiments.\n\n", "2303.07688": "2023-03-14, **Observational constraint on axion dark matter in the realistic halo profile with gravitational waves**, Takuya Tsutsui et.al., [2303.07688v1](http://arxiv.org/abs/2303.07688v1)\n\n Axions are considered as a candidate of dark matter. The axions form coherent clouds which delay and amplify gravitational waves (GWs) at a resonant frequency. That is, the coherent axion clouds produce secondary GWs following a primary wave. All GWs from compact binary mergers detected so far propagate in the Milky Way halo composed of dark matter so that such GWs are followed by the secondary GWs. Since the properties of the secondary GWs depend on the axion mass and coupling with the parity violating sector of gravity, we can search for a characteristic signal produced by axions. In our previous study, we have developed a search method optimized for the axion signals, and obtained about ten times stronger constraint on the coupling than the previous best one for the axion mass range, $[1.7 \\times 10^{-13},\\,8.5 \\times 10^{-12}]\\,\\mathrm{eV}$. However, in our previous search, we assume that dark matter is homogeneously distributed in the Milky Way halo, which is unrealistic. In this paper, we extend the dark matter profile to a more realistic one called the core NFW profile, and find that the constraint in our previous study is robust to the dark matter profile.\n\n", "2303.07661": "2023-03-14, **Gravitational wave hints black hole remnants as dark matter**, Guillem Domènech et.al., [2303.07661v1](http://arxiv.org/abs/2303.07661v1)\n\n The end state of Hawking evaporation of a black hole is uncertain. Some candidate quantum gravity theories, such as loop quantum gravity and asymptotic safe gravity, hint towards Planck sized remnants. If so, the Universe might be filled with remnants of tiny primordial black holes, which formed with mass $M<10^9\\,{\\rm g}$. A unique scenario is the case of $M\\sim 5\\times10^5\\,{\\rm g}$, where tiny primordial black holes reheat the universe by Hawking evaporation and their remnants dominate the dark matter. Here, we point out that this scenario leads to a cosmological gravitational wave signal at frequencies $\\sim 100{\\rm Hz}$. Finding such a particular gravitational wave signature with, e.g. the Einstein Telescope, would suggest black hole remnants as dark matter.\n\n", "2303.07473": "2023-03-13, **Invertible mapping between fields in CAMELS**, Sambatra Andrianomena et.al., [2303.07473v1](http://arxiv.org/abs/2303.07473v1)\n\n We build a bijective mapping between different physical fields from hydrodynamic CAMELS simulations. We train a CycleGAN on three different setups: translating dark matter to neutral hydrogen (Mcdm-HI), mapping between dark matter and magnetic fields magnitude (Mcdm-B), and finally predicting magnetic fields magnitude from neutral hydrogen (HI-B). We assess the performance of the models using various summary statistics, such as the probability distribution function (PDF) of the pixel values and 2D power spectrum ($P(k)$). Results suggest that in all setups, the model is capable of predicting the target field from the source field and vice versa, and the predicted maps exhibit statistical properties which are consistent with those of the target maps. This is indicated by the fact that the mean and standard deviation of the PDF of maps from the test set is in good agreement with those of the generated maps. The mean and variance of $P(k)$ of the real maps agree well with those of generated ones. The consistency tests on the model suggest that the source field can be recovered reasonably well by a forward mapping (source to target) followed by a backward mapping (target to source). This is demonstrated by the agreement between the statistical properties of the source images and those of the recovered ones.\n\n", "2303.07426": "2023-03-13, **CMB and Lyman-$α$ constraints on dark matter decays to photons**, Francesco Capozzi et.al., [2303.07426v1](http://arxiv.org/abs/2303.07426v1)\n\n Dark matter energy injection in the early universe modifies both the ionization history and the temperature of the intergalactic medium. In this work, we improve the CMB bounds on sub-keV dark matter and extend previous bounds from Lyman-$\\alpha$ observations to the same mass range, resulting in new and competitive constraints on axion-like particles (ALPs) decaying into two photons. The limits depend on the underlying reionization history, here accounted self-consistently by our modified version of the publicly available {\\tt DarkHistory} and {\\tt CLASS} codes. Future measurements such as the ones from the CMB-S4 experiment may play a crucial, leading role in the search for this type of light dark matter candidates\n\n", "2303.07372": "2023-03-13, **Dark matter from hot big bang black holes**, Avi Friedlander et.al., [2303.07372v1](http://arxiv.org/abs/2303.07372v1)\n\n If the temperature of the hot thermal plasma in the Early Universe was within a few orders of magnitude of the Planck scale $M\\_{\\rm Pl}$, then the hoop conjecture predicts the formation of microscopic black holes from particle collisions in the plasma. Although these evaporated instantly, they would have left behind a relic abundance of all stable degrees of freedom which couple to gravity. Here we show that, upon minimal assumptions of a high reheat temperature and semiclassical black hole dynamics, this process could have produced the relic abundance of dark matter observed today for a particle mass anywhere in the range of $100~\\mathrm{keV} \\lesssim m\\_{dm} < M\\_{\\rm Pl}$. The production mechanism does not rely on any additional assumptions about non-gravitational dark matter-Standard Model interaction.\n\n", "2303.07370": "2023-03-13, **Exotic energy injection in the early universe II: CMB spectral distortions and constraints on light dark matter**, Hongwan Liu et.al., [2303.07370v1](http://arxiv.org/abs/2303.07370v1)\n\n We calculate the post-recombination contribution to the Cosmic Microwave Background (CMB) spectral distortion due to general exotic energy injections, including dark matter (DM) decaying or annihilating to Standard Model particles. Upon subtracting the background distortion that would be present even without such energy injections, we find residual distortions that are still potentially large enough to be detectable by future experiments such as PIXIE. The distortions also have a high-energy spectral feature that is a unique signature of the injection of high-energy particles. We present a calculation of the global ionization history in the presence of decaying dark matter with sub-keV masses, and also show that previous calculations of the global ionization history in the presence of energy injection are not significantly modified by these additional spectral distortions. Our improved treatment of low-energy electrons allows us to extend calculations of the CMB anisotropy constraints for decaying DM down to arbitrarily low masses. We also recast these bounds as constraints on the coupling of axion-like particles to photons.\n\n", "2303.07366": "2023-03-13, **Exotic energy injection in the early universe I: a novel treatment for low-energy electrons and photons**, Hongwan Liu et.al., [2303.07366v1](http://arxiv.org/abs/2303.07366v1)\n\n Decaying or annihilating dark matter and other exotic energy injections can modify the spectrum of the universe's photon bath, resulting in e.g. new contributions to spectral distortions of the cosmic microwave background blackbody spectrum and modifications to the temperature and ionization history of the universe. Here, we present an improved version of the $\\texttt{DarkHistory}$ code, which is now capable of consistently calculating the spectrum of low-energy photons by properly treating the interactions of these photons with the levels of hydrogen atoms. Other changes to the code include a more detailed treatment of energy deposition by low-energy electrons, and spectral distortions from heating of the intergalactic medium. All of the improvements we have made to $\\texttt{DarkHistory}$ are publicly available.\n\n", "2303.07362": "2023-03-13, **Fast and accurate AMS-02 antiproton likelihoods for global dark matter fits**, Sowmiya Balan et.al., [2303.07362v1](http://arxiv.org/abs/2303.07362v1)\n\n The antiproton flux measurements from AMS-02 offer valuable information about the nature of dark matter, but their interpretation is complicated by large uncertainties in the modeling of cosmic ray propagation. In this work we present a novel framework to efficiently marginalise over propagation uncertainties in order to obtain robust AMS-02 likelihoods for arbitrary dark matter models. The three central ingredients of this framework are: the neural emulator DarkRayNet, which provides highly flexible predictions of the antiproton flux; the likelihood calculator pbarlike, which performs the marginalisation, taking into account the effects of solar modulation and correlations in AMS-02 data; and the global fitting framework GAMBIT, which allows for the combination of the resulting likelihood with a wide range of dark matter observables. We illustrate our approach by providing updated constraints on the annihilation cross section of WIMP dark matter into bottom quarks and by performing a state-of-the-art global fit of the scalar singlet dark matter model, including also recent results from direct detection and the LHC.\n\n", "2303.07359": "2023-03-13, **Isocurvature Constraints on Scalar Dark Matter Production from the Inflaton**, Marcos A. G. Garcia et.al., [2303.07359v1](http://arxiv.org/abs/2303.07359v1)\n\n We investigate the production of a spectator scalar dark matter field that is directly coupled to the inflaton during inflation and reheating. We consider two specific inflationary potentials, namely the Starobinsky and T-model of inflation, which satisfy the constraints on the scalar tilt, $n\\_s$, and tensor-to-scalar ratio, $r$, measured by the Planck satellite. Excitation of light scalar dark matter during inflation may result in large isocurvature perturbations, which can be avoided by inducing a sizable effective dark matter mass during the inflationary phase. For purely gravitational production, the Planck isocurvature constraints require the dark matter mass to be larger than the Hubble scale at horizon exit, with $m\\_{\\chi} \\gtrsim 0.5H\\_*$. For small bare dark matter masses $m\\_{\\chi} \\ll H\\_*$, these constraints translate into a lower bound on the dark matter coupling to the inflaton. We argue that these constraints can applied to a wide class of single-field slow-roll inflation models. We also derive isocurvature, dark matter abundance, and Lyman-$\\alpha$ constraints on the direct coupling and bare dark matter mass.\n\n", "2303.07076": "2023-03-13, **Gamma-Ray Bursts, Quasars, Baryonic Acoustic Oscillations, and Supernovae Ia: new statistical insights and cosmological constraints**, G. Bargiacchi et.al., [2303.07076v1](http://arxiv.org/abs/2303.07076v1)\n\n The recent $\\sim 4 \\, \\sigma$ Hubble constant, $H\\_{0}$, tension is observed between the value of $H\\_{0}$ from the Cosmic Microwave Background (CMB) and Type Ia Supernovae (SNe Ia). It is a decade since this tension is excruciating the modern astrophysical community. To shed light on this problem is key to consider probes at intermediate redshifts between SNe Ia and CMB and reduce the uncertainty on $H\\_0$. Toward these goals, we fill the redshift gap by employing Gamma-Ray Bursts (GRBs) and Quasars (QSOs), reaching $z=9.4$ and $z=7.6$, respectively, combined with Baryonic Acoustic Oscillations (BAO) and SNe Ia. To this end, we employ the ``Dainotti GRB 3D relation\" among the rest-frame end time of the X-ray plateau emission, its corresponding luminosity, and the peak prompt luminosity, and the ``Risaliti-Lusso\" QSO relation between ultraviolet and X-ray luminosities. We inquire the commonly adopted Gaussianity assumption on GRBs, QSOs, and BAO. With the joint sample, we fit the flat $\\Lambda$ Cold Dark Matter model with both the Gaussian and the newly discovered likelihoods. We also investigate the impact of the calibration assumed for \\textit{Pantheon} and \\textit{Pantheon +} SNe Ia on this analysis. Remarkably, we show that only GRBs fulfill the Gaussianity assumption. We achieve small uncertainties on the matter density parameter $\\Omega\\_M$ and $H\\_0$. We find $H\\_0$ values compatible within 2 $\\sigma$ with the one from the Tip of the Red Giant Branch. Finally, we show that the cosmological results are heavily biased against the arbitrary calibration choice for SNe Ia.\n\n", "2303.06866": "2023-03-13, **Using the Star Forming Main Sequence To Explore Quiescent Galaxies Across Cosmic Time**, Tyler Houston et.al., [2303.06866v1](http://arxiv.org/abs/2303.06866v1)\n\n In this letter, we explore the quiescent lives of central galaxies using the SAGE galaxy model and Uchuu dark matter simulation. We ask three questions: (1) How much of a galaxy's life is spent in quiescence? (2) How often do galaxies transition off the main sequence? (3) What is the typical duration of a quiescent phase? We find low and high-mass galaxies spend the highest fraction of their lives in quiescence: 45 \\pm 19% for log10(Mstar) < 9.0 (3.68 \\pm 1.80 Gyr) and 26 \\pm 25% for log10(Mstar) > 11.5 (3.46 \\pm 3.30 Gyr), falling to 7 \\pm 13% for galaxies in-between (0.82 \\pm 1.57 Gyr). Low mass galaxies move in and out of quiescence frequently, 2.8 \\pm 1.3 times on average, though only for short periods, 1.49 \\pm 1.04 Gyr. This can be traced to the influence of supernova feedback on their quite stochastic evolution. Galaxies of higher mass have fewer quiescent periods, ~0.7 \\pm 0.9, and their length increases with mass, peaking at 1.97 \\pm 2.27 Gyr. However, our high-mass population comprises star-forming and quiescent galaxies with diverging evolutionary paths, so the actual time may be even longer. These high-mass trends are driven by radio mode feedback from supermassive black holes, which, once active, tend to remain active for extended periods.\n\n"}, "supernova": {"2303.07974": "2023-03-14, **Thermal effects in hot and dilute homogeneous asymmetric nuclear matter**, Vishal Parmar et.al., [2303.07974v1](http://arxiv.org/abs/2303.07974v1)\n\n We present a comprehensive analysis of hot and dilute isospin-asymmetric nuclear matter employing the temperature-dependent effective-relativistic mean-field theory (E-RMF). The E-RMF is applied to study the effect of $\\delta$ and $\\omega-\\rho$ meson cross-coupling on the thermal properties of asymmetric nuclear matter using two recently developed IOPB-I and G3 parameter sets. These sets are known to reproduce the nuclear matter properties in agreement with various experimental and observational constraints. We consider the nuclear matter to be homogeneous and study the equation of state (EoS) for densities, temperature and asymmetry which are relevant for astrophysical simulations such as supernovae explosion. The effect of temperature is investigated in reference to the density-dependent free symmetry energy and its higher-order derivatives using the well known parabolic approximation. The larger value of $\\lambda\\_\\omega$ cross-coupling in G3 in addition to the $\\delta$ meson coupling in G3 smoothen the free symmetry energy. Thermal effects on various state variables are examined at fixed temperature and isospin asymmetry by separating their T=0 and the finite-T expressions. The thermal effects are mainly governed by effective mass with larger effective mass estimating larger thermal contribution. The effect of temperature on isothermal and isentropic incompressibility is discussed which is in harmony with various available microscopic calculations. The liquid-gas phase transition properties are examined in asymmetric matter with two conserved charges in the context of different slope parameter and comparable symmetry energy in IOPB-I and G3 set. The spinodal instability, binodal curve and critical properties are found to be influenced by the slope parameter $L\\_{sym}$.\n\n", "2303.07721": "2023-03-14, **Photometry and spectroscopy of the Type Icn supernova 2021ckj: The diverse properties of the ejecta and circumstellar matter of Type Icn SNe**, T. Nagao et.al., [2303.07721v1](http://arxiv.org/abs/2303.07721v1)\n\n We present photometric and spectroscopic observations of the Type Icn supernova (SN) 2021ckj. Spectral modeling of SN 2021ckj reveals that its composition is dominated by oxygen, carbon and iron group elements, and the photospheric velocity at peak is ~10000 km/s. From the light curve (LC) modeling applied to SNe 2021ckj, 2019hgp, and 2021csp, we find that the ejecta and CSM properties of Type Icn SNe are diverse. SNe 2021ckj and 2021csp likely have two ejecta components (an aspherical high-energy component and a spherical standard-energy component) with a roughly spherical CSM, while SN 2019hgp can be explained by a spherical ejecta-CSM interaction alone. The ejecta of SNe 2021ckj and 2021csp have larger energy per ejecta mass than the ejecta of SN 2019hgp. The density distribution of the CSM is similar in these three SNe, and is comparable to those of Type Ibn SNe. This may imply that the mass-loss mechanism is common between Type Icn (and also Type Ibn) SNe. The CSM masses of SN 2021ckj and SN 2021csp are higher than that of SN 2019hgp, although all these values are within the diversity seen in Type Ibn SNe. The early spectrum of SN 2021ckj shows narrow emission lines from C II and C III, without a clear absorption component, in contrast with that observed in SN 2021csp. The similarity of the emission components of these lines implies that the emitting regions of SNe 2021ckj and 2021csp have similar ionization states, and thus suggests that they have similar properties of the ejecta and CSM, which is inferred also from the LC modeling. Taking into account the difference in the strength of the absorption features, this heterogeneity may be attributed to viewing angle effects in otherwise common aspherical ejecta.\n\n", "2303.07318": "2023-03-13, **The Masses of Supernova Remnant Progenitors in M33**, Brad Koplitz et.al., [2303.07318v1](http://arxiv.org/abs/2303.07318v1)\n\n Using resolved optical stellar photometry from the Panchromatic Hubble Andromeda Treasury Triangulum Extended Region (PHATTER) survey, we measured the star formation history (SFH) near the position of 85 supernova remnants (SNRs) in M33. We constrained the progenitor masses for 60 of these SNRs, finding the remaining 25 remnants had no local SF in the last 56 Myr consistent with core-collapse SNe (CCSNe), making them potential Type Ia candidates. We then infer a progenitor mass distribution from the age distribution, assuming single star evolution. We find that the progenitor mass distribution is consistent with being drawn from a power-law with an index of $-2.9^{+1.2}\\_{-1.0}$. Additionally, we infer a minimum progenitor mass of $7.1^{+0.1}\\_{-0.2}$ $M\\_{\\odot}$ from this sample, consistent with several previous studies, providing further evidence that stars with ages older than the lifetimes of single 8 $M\\_{\\odot}$ stars are producing supernovae.\n\n", "2303.07076": "2023-03-13, **Gamma-Ray Bursts, Quasars, Baryonic Acoustic Oscillations, and Supernovae Ia: new statistical insights and cosmological constraints**, G. Bargiacchi et.al., [2303.07076v1](http://arxiv.org/abs/2303.07076v1)\n\n The recent $\\sim 4 \\, \\sigma$ Hubble constant, $H\\_{0}$, tension is observed between the value of $H\\_{0}$ from the Cosmic Microwave Background (CMB) and Type Ia Supernovae (SNe Ia). It is a decade since this tension is excruciating the modern astrophysical community. To shed light on this problem is key to consider probes at intermediate redshifts between SNe Ia and CMB and reduce the uncertainty on $H\\_0$. Toward these goals, we fill the redshift gap by employing Gamma-Ray Bursts (GRBs) and Quasars (QSOs), reaching $z=9.4$ and $z=7.6$, respectively, combined with Baryonic Acoustic Oscillations (BAO) and SNe Ia. To this end, we employ the ``Dainotti GRB 3D relation\" among the rest-frame end time of the X-ray plateau emission, its corresponding luminosity, and the peak prompt luminosity, and the ``Risaliti-Lusso\" QSO relation between ultraviolet and X-ray luminosities. We inquire the commonly adopted Gaussianity assumption on GRBs, QSOs, and BAO. With the joint sample, we fit the flat $\\Lambda$ Cold Dark Matter model with both the Gaussian and the newly discovered likelihoods. We also investigate the impact of the calibration assumed for \\textit{Pantheon} and \\textit{Pantheon +} SNe Ia on this analysis. Remarkably, we show that only GRBs fulfill the Gaussianity assumption. We achieve small uncertainties on the matter density parameter $\\Omega\\_M$ and $H\\_0$. We find $H\\_0$ values compatible within 2 $\\sigma$ with the one from the Tip of the Red Giant Branch. Finally, we show that the cosmological results are heavily biased against the arbitrary calibration choice for SNe Ia.\n\n", "2303.06974": "2023-03-13, **Reduced uncertainties up to 43\\% on the Hubble constant and the matter density with the SNe Ia with a new statistical analysis**, Maria Giovanna Dainotti et.al., [2303.06974v1](http://arxiv.org/abs/2303.06974v1)\n\n Type Ia Supernovae (SNe Ia) are considered the most reliable \\textit{standard candles} and they have played an invaluable role in cosmology since the discovery of the Universe's accelerated expansion. During the last decades, the SNe Ia samples have been improved in number, redshift coverage, calibration methodology, and systematics treatment. These efforts led to the most recent \\textit{``Pantheon\"} (2018) and \\textit{``Pantheon +\"} (2022) releases, which enable to constrain cosmological parameters more precisely than previous samples. In this era of precision cosmology, the community strives to find new ways to reduce uncertainties on cosmological parameters. To this end, we start our investigation even from the likelihood assumption of Gaussianity, implicitly used in this domain. Indeed, the usual practise involves constraining parameters through a Gaussian distance moduli likelihood. This method relies on the implicit assumption that the difference between the distance moduli measured and the ones expected from the cosmological model is Gaussianly distributed. In this work, we test this hypothesis for both the \\textit{Pantheon} and \\textit{Pantheon +} releases. We find that in both cases this requirement is not fulfilled and the actual underlying distributions are a logistic and a Student's t distribution for the \\textit{Pantheon} and \\textit{Pantheon +} data, respectively. When we apply these new likelihoods fitting a flat $\\Lambda$CDM model, we significantly reduce the uncertainties on $\\Omega\\_M$ and $H\\_0$ of $\\sim 40 \\%$. This boosts the SNe Ia power in constraining cosmological parameters, thus representing a huge step forward to shed light on the current debated tensions in cosmology.\n\n", "2303.06961": "2023-03-13, **Observational constraints on non-minimally coupled curvature-matter models of gravity from the analysis of Pantheon data**, Biswajit Jana et.al., [2303.06961v1](http://arxiv.org/abs/2303.06961v1)\n\n We considered non-minimally coupled curvature-matter models of gravity in a FRW universe filled with perfect fluid and investigated its cosmological implications in the light of Pantheon compilation of 1048 Supernovae Ia data points along with 54 data points from Observed Hubble Data. The non-minimal curvature-matter coupling has been introduced by adding a term $\\int \\left[\\lambda R^n \\mathcal{L}\\_m\\right] \\sqrt{-g}d^4x$ to the usual action for Einstein gravity involving the Einstein Hilbert action and minimally coupled matter action. We investigate the observational constraints on the non-minimal models by choosing two different kinds of parametrization of fluid-pressure profiles using a dimensionless parameter $k$. The interplay of the three parameters $\\lambda,n,k$ plays a pivotal role in testing the consistency of non-minimally coupled fluid-curvature scenarios with the observed data. We found there exist large domains in the ($\\lambda,n,k$)-parameter space for which models with non-minimal curvature-matter mixing stand as viable cosmological models reproducing the observed features of late-time cosmic evolution. We also commented on the possibility of `gravitationally induced particle creation' in the context of SNe Ia data.\n\n", "2303.06909": "2023-03-13, **Deciphering the unusual stellar progenitor of GRB~210704A**, R. L. Becerra et.al., [2303.06909v1](http://arxiv.org/abs/2303.06909v1)\n\n GRB~210704A is a burst of intermediate duration ($T\\_{90} \\sim 1-4$~s) followed by a fading afterglow and an optical excess that peaked about 7 days after the explosion. Its properties, and in particular those of the excess, do not easily fit into the well established classification scheme of GRBs as being long or short, leaving the nature of its progenitor uncertain. We present multi-wavelength observations of the GRB and its counterpart, observed up to 160 days after the burst. In order to decipher the nature of the progenitor system, we present a detailed analysis of the GRB high-energy properties (duration, spectral lag, and Amati correlation), its environment, and late-time optical excess. We discuss three possible scenarios: a neutron star merger, a collapsing massive star, and an atypical explosion possibly hosted in a cluster of galaxies. We find that traditional kilonova and supernova models do not match well the properties of the optical excess, leaving us with the intriguing suggestion that this event was an exotic high-energy merger.\n\n", "2303.06866": "2023-03-13, **Using the Star Forming Main Sequence To Explore Quiescent Galaxies Across Cosmic Time**, Tyler Houston et.al., [2303.06866v1](http://arxiv.org/abs/2303.06866v1)\n\n In this letter, we explore the quiescent lives of central galaxies using the SAGE galaxy model and Uchuu dark matter simulation. We ask three questions: (1) How much of a galaxy's life is spent in quiescence? (2) How often do galaxies transition off the main sequence? (3) What is the typical duration of a quiescent phase? We find low and high-mass galaxies spend the highest fraction of their lives in quiescence: 45 \\pm 19% for log10(Mstar) < 9.0 (3.68 \\pm 1.80 Gyr) and 26 \\pm 25% for log10(Mstar) > 11.5 (3.46 \\pm 3.30 Gyr), falling to 7 \\pm 13% for galaxies in-between (0.82 \\pm 1.57 Gyr). Low mass galaxies move in and out of quiescence frequently, 2.8 \\pm 1.3 times on average, though only for short periods, 1.49 \\pm 1.04 Gyr. This can be traced to the influence of supernova feedback on their quite stochastic evolution. Galaxies of higher mass have fewer quiescent periods, ~0.7 \\pm 0.9, and their length increases with mass, peaking at 1.97 \\pm 2.27 Gyr. However, our high-mass population comprises star-forming and quiescent galaxies with diverging evolutionary paths, so the actual time may be even longer. These high-mass trends are driven by radio mode feedback from supermassive black holes, which, once active, tend to remain active for extended periods.\n\n"}}