{"neutrino": {"2404.16822": "2024-04-25, **Cosmological probes of Dark Radiation from Neutrino Mixing**, Itamar J. Allali et.al., [2404.16822v1](http://arxiv.org/abs/2404.16822v1)\n\n Models of stepped dark radiation have recently been found to have an important impact on the anisotropies of the cosmic microwave background, aiding in easing the Hubble tension. In this work, we study models with a sector of dark radiation with a step in its abundance, which thermalizes after big bang nucleosynthesis by mixing with the standard model neutrinos. For this, we extend an earlier work which has focused on the background evolution only until the dark sector thermalizes by deriving the full background and perturbation equations of the model and implementing them in an Einstein-Boltzmann solving code. We expound on the behavior of this model, discussing the wide range of parameters that result in interesting and viable cosmologies that dynamically generate dark radiation during a range of epochs. We find that for the strongly self-coupled regime, there is no large cosmological impact for a tight prior on the mass, whereas larger mass ranges allow a smooth interpolation between a behavior close to the $\\Lambda$CDM cosmological standard model and close to an additional component of strongly self-interacting dark radiation. In the weakly self-coupled regime we find that we can accommodate a parameter space relevant for the neutrino anomalies as well as one relevant to easing the Hubble tension.\n\n", "2404.16805": "2024-04-25, **Accelerated inference on accelerated cosmic expansion: New constraints on axion-like early dark energy with DESI BAO and ACT DR6 CMB lensing**, Frank J. Qu et.al., [2404.16805v1](http://arxiv.org/abs/2404.16805v1)\n\n The early dark energy (EDE) extension to $\\Lambda$CDM has been proposed as a candidate scenario to resolve the \"Hubble tension\". We present new constraints on the EDE model by incorporating new data from the Dark Energy Spectroscopic Instrument (DESI) Baryon Acoustic Oscillation (BAO) survey and CMB lensing measurements from the Atacama Cosmology Telescope (ACT) DR6 and \\textit{Planck} NPIPE data. We do not find evidence for EDE. The maximum fractional contribution of EDE to the total energy density is $f\\_\\mathrm{EDE}< 0.091 \\; (95\\% \\; \\mathrm{CL} )$ from our baseline combination of \\textit{Planck} CMB, CMB lensing, and DESI BAO. Our strongest constraints on EDE come from the combination of \\textit{Planck} CMB and CMB lensing alone, yielding $f\\_\\mathrm{EDE}< 0.070 \\; (95\\% \\; \\mathrm{CL} )$. We also explore extensions of $\\Lambda$CDM beyond the EDE parameters by treating the total neutrino mass as a free parameter, finding $\\sum m\\_\\nu < 0.096 \\,\\, {\\rm eV} \\; (95\\% \\; \\mathrm{CL} )$ and $f\\_\\mathrm{EDE}< 0.087 \\; (95\\% \\; \\mathrm{CL} )$. For the first time in EDE analyses, we perform Bayesian parameter estimation using neural network emulators of cosmological observables, which are on the order of a hundred times faster than full Boltzmann solutions.\n\n", "2404.16740": "2024-04-25, **Calculable neutrino Dirac mass matrix and one-loop $\\bar θ$ in the minimal left-right symmetric model**, Gang Li et.al., [2404.16740v1](http://arxiv.org/abs/2404.16740v1)\n\n We revisit the contribution to the strong CP parameter $\\bar \\theta$ from leptonic CP violation at one-loop level in the minimal left-right symmetric model in the case of parity as the left-right symmetry. The Hermitian neutrino Dirac mass matrix $M\\_D$ can be calculated using the light and heavy neutrino masses and mixings. We propose a parameterization of the right-handed neutrino mixing matrix $V\\_R$ and construct the heavy neutrino mass that maintains the Hermiticity of $M\\_D$. We further apply it to evaluate the one-loop $\\bar\\theta$, denoted as $\\bar \\theta\\_{loop}$, as a function of the sterile neutrino masses for explicit examples of $V\\_R$. By requiring the magnitude of $\\bar \\theta\\_{loop}\\lesssim 10^{-10}$, we derive the upper limits on the sterile neutrino masses, which are within reach of direct searches at the Large Hadron Collider and neutrinoless double beta decay experiments. Furthermore, our parameterization is applicable to other phenomenological studies.\n\n", "2404.16690": "2024-04-25, **Neutrino many-body flavor evolution: the full Hamiltonian**, Vincenzo Cirigliano et.al., [2404.16690v1](http://arxiv.org/abs/2404.16690v1)\n\n We study neutrino flavor evolution in the quantum many-body approach using the full neutrino-neutrino Hamiltonian, including the usually neglected terms that mediate non-forward scattering processes. Working in the occupation number representation with plane waves as single-particle states, we explore the time evolution of simple initial states with up to $N=10$ neutrinos. We discuss the time evolution of the Loschmidt echo, one body flavor and kinetic observables, and the one-body entanglement entropy. For the small systems considered, we observe `thermalization' of both flavor and momentum degrees of freedom on comparable time scales, with results converging towards expectation values computed within a microcanonical ensemble. We also observe that the inclusion of non-forward processes generates a faster flavor evolution compared to the one induced by the truncated (forward) Hamiltonian.\n\n", "2404.16626": "2024-04-25, **Understanding small neutrino mass and its implication**, Hsiang-nan Li et.al., [2404.16626v1](http://arxiv.org/abs/2404.16626v1)\n\n We have derived previously the relations between the neutrino masses and mixing angles in a dispersive analysis on the mixing of neutral leptonic states. The only involved assumption is that the electroweak symmetry of the Standard Model (SM) is restored at a high energy scale in some new physics scenario, which diminishes the box diagrams responsible for the mixing. Here we include corrections to the analysis up to three loops, arising from exchanges of additional neutral and charged scalars in the electroweak symmetric phase. The solution to the dispersion relation for the $\\mu^-e^+$-$\\mu^+e^-$ mixing generates a typical neutrino mass $m\\_\\nu\\sim O(1)$ eV in the SM unambiguously. The solution also favors the normal ordering of the neutrino masses over the inverted one, and links the large electroweak symmetry restoration, i.e., new physics scale to the small neutrino mass.\n\n", "2404.15990": "2024-04-24, **A mechanism relating the fermionic mass hierarchy to the flavor mixing**, Jin-Lei Yang et.al., [2404.15990v1](http://arxiv.org/abs/2404.15990v1)\n\n Considering the hierarchical structure of fermionic masses and the fermionic flavor mixing puzzles in the Standard Model, we propose to relate them by the see-saw mechanism, i.e. only the third generation of quarks and charged leptons achieve the masses at the tree level, the first two generations achieves masses through the mixings with the third generation, and the neutrinos achieve tiny Majorana masses by the so-called Type-I see-saw mechanism. This new picture at the fermion sector can explain simultaneously the flavor mixing puzzle and mass hierarchy puzzle in the SM. In addition, a flavor-dependent model (FDM) is proposed to realize the new mechanism, and observing the top quark rare decay processes $t\\to ch$, $t\\to uh$ and the lepton flavor violation processes $\\mu\\to3e,\\;\\tau\\to3e,\\;\\mu\\to3\\mu$ is effective to test the proposed FDM.\n\n", "2404.15944": "2024-04-24, **Neutrinos from LHAASO Sources**, Ke Fang et.al., [2404.15944v1](http://arxiv.org/abs/2404.15944v1)\n\n We briefly review the main results of the IceCube Neutrino Observatory one decade after the discovery of cosmic neutrinos. We emphasize the importance of multimessenger observations, most prominently for the discovery of neutrinos from our own Galaxy. We model the flux from the Galactic plane produced by Galactic cosmic rays interacting with the interstellar medium and discuss the perspectives of understanding the TeV-PeV emission of the Galactic plane by combining multimessenger observations. We draw attention to the interesting fact that the neutrino flux from the Galaxy is not a dominant feature of the neutrino sky, unlike the case in any other wavelength of light. Finally, we review the attempts to identify PeVatrons by confronting the neutrino and gamma-ray emission of Galactic sources, including those observed by LHAASO. We end with a discussion of searches for neutrinos from LHAASO's extragalactic transient source gamma-ray burst 221009A.\n\n"}, "dark matter": {"2404.16815": "2024-04-25, **Quantum effects on the evaporation of PBHs: contributions to dark matter**, Md Riajul Haque et.al., [2404.16815v1](http://arxiv.org/abs/2404.16815v1)\n\n We compute the relic abundance of dark matter in the presence of Primordial Black Holes (PBHs) beyond the semiclassical approximation. We take into account the quantum corrections due to the memory burden effect, which is assumed to suppress the black hole evaporation rate by the inverse power of its own entropy. Such quantum effect significantly enhances the lifetime, rendering the possibility of PBH mass $\\lesssim 10^{9}$ g being the sole dark matter (DM) candidate. However, Nature can not rule out the existence of fundamental particles such as DM. We, therefore, include the possibility of populating the dark sector by the decay of PBHs to those fundamental particles, adding the contribution to stable PBH whose lifetime is extended due to the quantum corrections. Depending on the strength of the burden effect, we show that a wide range of parameter space opens up in the initial PBH mass and fundamental dark matter mass plane that respects the correct relic abundance.\n\n", "2404.16673": "2024-04-25, **Illuminating Black Hole Shadow with Dark Matter Annihilation**, Yifan Chen et.al., [2404.16673v1](http://arxiv.org/abs/2404.16673v1)\n\n The Event Horizon Telescope (EHT) has revolutionized our ability to study black holes by providing unprecedented spatial resolution and unveiling horizon-scale details. With advancements leading to the next-generation EHT, there is potential to probe even deeper into the black hole's dark region, especially the inner shadow characterized by low-intensity foreground emissions from the jet, thanks to a significant enhancement in dynamic range by two orders of magnitude. We demonstrate how such enhanced observations could transform supermassive black holes into powerful probes for detecting annihilating dark matter, which can form a dense profile in the vicinity of supermassive black holes, by examining the morphology of the black hole image.\n\n", "2404.16509": "2024-04-25, **Gauged Q-ball dark matter through a cosmological first-order phase transition**, Siyu Jiang et.al., [2404.16509v1](http://arxiv.org/abs/2404.16509v1)\n\n As a new type of dynamical dark matter mechanism, we discuss the stability of the gauged Q-ball dark matter and its production mechanism through a cosmological first-order phase transition. This work delves into the study of gauged Q-ball dark matter generated during the cosmic phase transition. We demonstrate detailed discussions on the stability of gauged Q-balls to rigorously constrain their charge and mass ranges. Additionally, employing analytic approximations and the mapping method, we provide qualitative insights of gauged Q-ball. We establish an upper limit on the gauge coupling constant and give the relic density of stable gauged Q-ball dark matter formed during a first-order phase transition. Furthermore, we discuss potential observational signatures or constraints of gauged Q-ball dark matter, including astronomical observations and gravitational wave signals.\n\n", "2404.16401": "2024-04-25, **Model independent approach for calculating galaxy rotation curves for low $S/N$ MaNGA galaxies**, Sangwoo Park et.al., [2404.16401v1](http://arxiv.org/abs/2404.16401v1)\n\n Internal kinematics of galaxies, traced through the stellar rotation curve or two dimensional velocity map, carry important information on galactic structure and dark matter. With upcoming surveys, the velocity map may play a key role in the development of kinematic lensing as an astrophysical probe. We improve techniques for extracting velocity information from integral field spectroscopy at low signal-to-noise ($S/N$), without a template, and demonstrate substantial advantages over the standard Penalized PiXel-Fitting method (pPXF) approach. We note that Robust rotation curves can be derived down to $S/N\\approx 2$ using our method.\n\n", "2404.16272": "2024-04-25, **Heavy Dark Matter in White Dwarfs: Multiple-Scattering Capture and Thermalization**, Nicole F. Bell et.al., [2404.16272v1](http://arxiv.org/abs/2404.16272v1)\n\n We present an improved treatment for the scattering of heavy dark matter from the ion constituents of a white dwarf. In the heavy dark matter regime, multiple collisions are required for the dark matter to become gravitationally captured. Our treatment incorporates all relevant physical effects including the dark matter trajectories, nuclear form factors, and radial profiles for the white dwarf escape velocity and target number densities. Our capture rates differ by orders of magnitude from previous estimates, which have typically used approximations developed for dark matter scattering in the Earth. We also compute the time for the dark matter to thermalize in the center of the white dwarf, including in-medium effects such as phonon emission and absorption from the ionic lattice in the case where the star has a crystallized core. We find much shorter thermalization timescales than previously estimated, especially if the white dwarf core has crystallized. We illustrate the importance of our improved approach by determining the cross section required for accumulated asymmetric dark matter to self-gravitate.\n\n", "2404.16247": "2024-04-24, **Confronting the Diversity Problem: The Limits of Galaxy Rotation Curves as a tool to Understand Dark Matter Profiles**, Isabel S. Sands et.al., [2404.16247v1](http://arxiv.org/abs/2404.16247v1)\n\n While galaxy rotation curves provide one of the most powerful methods for measuring dark matter profiles in the inner regions of rotation-supported galaxies, at the dwarf scale there are factors that can complicate this analysis. Given the expectation of a universal profile in dark matter-only simulations, the diversity of observed rotation curves has become an often-discussed issue in Lambda Cold Dark Matter cosmology on galactic scales. We analyze a suite of Feedback in Realistic Environments (FIRE) simulations of $10^{10}-10^{12}$ $M\\_\\odot$ halos with standard cold dark matter, and compare the true circular velocity to rotation curve reconstructions. We find that, for galaxies with well-ordered gaseous disks, the measured rotation curve may deviate from true circular velocity by at most 10% within the radius of the disk. However, non-equilibrium behavior, non-circular motions, and non-thermal and non-kinetic stresses may cause much larger discrepancies of 50% or more. Most rotation curve reconstructions underestimate the true circular velocity, while some reconstructions transiently over-estimate it in the central few kiloparsecs due to dynamical phenomena. We further demonstrate that the features that contribute to these failures are not always visibly obvious in HI observations. If such dwarf galaxies are included in galaxy catalogs, they may give rise to the appearance of \"artificial\" rotation curve diversity that does not reflect the true variation in underlying dark matter profiles.\n\n", "2404.16184": "2024-04-24, **Offset of M54 from the Sagittarius Dwarf Spheroidal Galaxy**, Zhaozhou An et.al., [2404.16184v1](http://arxiv.org/abs/2404.16184v1)\n\n We present results from simultaneous modeling of 2D (projected along the line of sight) position, proper motion and line-of-sight velocity for \\textit{Gaia}- and APOGEE-observed stars near the centre of the Sagittarius (Sgr) dwarf spheroidal galaxy. We use a mixture model that allows for independent sub-populations contributed by the Sgr galaxy, its nuclear star cluster M54, and the Milky Way foreground. We find an offset of $0.295\\pm 0.029$ degrees between the inferred centroids of Sgr and M54, corresponding to a (projected) physical separation of $0.135\\pm 0.013$ kpc. The detected offset might plausibly be driven by unmodelled asymmetry in Sgr's stellar configuration; however, standard criteria for model selection favour our symmetric model over an alternative that allows for bilateral asymmetry. We infer an offset between the proper motion centres of Sgr and M54 of $[\\Delta\\mu\\_{\\alpha}\\cos\\delta,\\Delta\\mu\\_{\\delta}]=[4.9, -19.7] \\pm [6.8, 6.2]$ $\\mu$as yr$^{-1}$, with magnitude similar to the covariance expected due to spatially-correlated systematic error. We infer an offset of $4.1\\pm 1.2$ km s$^{-1}$ in line-of-sight velocity. Using inferred values for the systemic positions and motions of Sgr and M54 as initial conditions, we calculate the recent orbital history of a simplified Sgr/M54 system, which we demonstrate to be sensitive to any line-of-sight distance offset between M54 and Sgr, and to the distribution of dark matter within Sgr.\n\n", "2404.16110": "2024-04-24, **Satellite group infall into the Milky Way: exploring the Crater-Leo case with new HST proper motions**, Mariana P. Júlio et.al., [2404.16110v1](http://arxiv.org/abs/2404.16110v1)\n\n Context. Within $\\Lambda$ Cold Dark Matter ($\\Lambda$CDM) simulations, Milky Way-like galaxies accrete some of their satellite galaxies in groups of 3-5 members rather than individually. It was also suggested that this might be the reason behind the origin of satellite planes. Objects accreted in groups are expected to share similar specific total energy and angular momentum, and also identical orbital planes and directions. Aims. Looking at observations of Milky Way satellites, the dwarf galaxies Leo II, IV, V, Crater II, and the star cluster Crater 1 were proposed to be a vestige of group infall. The suggested \"Crater-Leo group\" shows a coherent distance gradient and all these objects align along a great circle on the sky. We use proper motion data to investigate whether the phase-space distribution of the members of the proposed group are indeed consistent with group infall. Methods. To further investigate this possibility, we use Gaia Data Release 3 (DR3) and new Hubble Space Telescope (HST) proper motions, $(\\mu\\_{\\alpha*}, \\mu\\_\\delta) = (-0.1921 \\pm 0.0514, -0.0686 \\pm 0.0523)$ mas yr$^{-1}$ for Leo IV and $(\\mu\\_{\\alpha*}, \\mu\\_\\delta) = (0.1186 \\pm 0.1943, -0.1183 \\pm 0.1704)$ mas yr$^{-1}$ for Leo V, to derive accurate orbital properties for the proposed group objects. In addition, we explore other possible members of this putative association. Results. Leo II, Leo IV, and Crater 1 show orbital properties consistent with those we predict from assuming group infall. However, our results suggest that Crater II was not accreted with the rest of the objects. If confirmed with increasingly accurate proper motions in the future, the Crater-Leo objects appear to constitute the first identified case of a cosmologically expected, typical group infall event, as opposed to the highly hierarchical Magellanic Cloud system.\n\n", "2404.16090": "2024-04-24, **Resonant Reheating**, Basabendu Barman et.al., [2404.16090v1](http://arxiv.org/abs/2404.16090v1)\n\n We investigate a novel reheating scenario proceeding through $s$-channel inflaton annihilation, mediated by a massive scalar. If the inflaton $\\phi$ oscillates around the minimum of a monomial potential $\\propto \\phi^{n}$, we reveal the emergence of resonance phenomena originating from the dynamic evolution of the inflaton mass for $n>2$. Consequently, a resonance appears in both the radiation and the temperature evolution during the reheating process. By solving the coupled Boltzmann equations, we present solutions for radiation and temperature. We find non-trivial temperature characteristics during reheating, depending on the value of $n$ and the masses of the inflaton and mediator. Some phenomenological aspects of the model are explored. As a concrete example, we show that the same mediator participates in the genesis of dark matter, modifying the standard freeze-in dynamics. In addition, we demonstrate that the resonant reheating scenario could be tested by next-generation low- and high-frequency gravitational wave detectors.\n\n", "2404.16086": "2024-04-24, **Probing conversion-driven freeze-out at the LHC**, Jan Heisig et.al., [2404.16086v1](http://arxiv.org/abs/2404.16086v1)\n\n Conversion-driven freeze-out is an appealing mechanism to explain the observed relic density while naturally accommodating the null-results from direct and indirect detection due to a very weak dark matter coupling. Interestingly, the scenario predicts long-lived particles decaying into dark matter with lifetimes favorably coinciding with the range that can be resolved at the LHC. However, the small mass splitting between the long-lived particle and dark matter renders the decay products soft, challenging current search strategies. We consider four different classes of searches covering the entire range of lifetimes: heavy stable charge particles, disappearing tracks, displaced vertices, and missing energy searches. We discuss the applicability of these searches to conversion-driven freeze-out and derive current constraints highlighting their complementarity. For the displaced vertices search, we demonstrate how a slight modification of the current analysis significantly improves its sensitivity to the scenario.\n\n", "2404.15998": "2024-04-24, **Reissner-Nordström black holes surrounded by perfect fluid dark matter: testing the viability of weak gravity conjecture and weak cosmic censorship conjecture simultaneously**, Jafar Sadeghi et.al., [2404.15998v1](http://arxiv.org/abs/2404.15998v1)\n\n A possible violation of the weak gravity conjecture (WGC) by cosmic censorship is one of the major challenges in the field of general relativity. However, in this paper, we explore the possibility of reconciling the WGC and the WCCC by considering Reissner-Nordstr\\\"om (R-N) black holes embedded in perfect fluid dark matter (PFDM) in asymptotically flat spacetimes. These two conjectures are seemingly unrelated, but a recent proposal suggested that they are connected surprisingly. In particular, We argue a promising class of valid counterexamples to the WCCC in the four-dimensional Einstein-Maxwell theory, considering a charged black hole when WGC is present. We demonstrate that by imposing certain constraints on the parameters of the metric, the WGC and the WCCC can be compatible. Furthermore, we investigate the properties of the charged black hole in the presence of PFDM for $Q > M$ and present some intriguing figures to test the validity of the WGC and the WCCC simultaneously. When PFDM is absent ($\\gamma=0$), the RN black hole either has two event horizons if $Q^2/M^2\\leq 1$ or none if $Q^2/M^2> 1$. The second scenario results in a naked singularity, which contradicts the WCCC. But when PFDM is present ($\\gamma\\neq 0$), the RN black hole has event horizons with regard to Q and M. This implies that the singularity is always covered, and the WGC and the WCCC are fulfilled. Furthermore, we demonstrate that there is a critical value of $\\gamma$, called $\\gamma\\_{ext}$, that makes the RN black hole extremal when $\\gamma=\\gamma\\_{ext}$. In this situation, the black hole has an event horizon, and the WGC and the WCCC are still fulfilled. We infer that PFDM can make the WGC and the WCCC compatible with the RN black hole and that the WGC and the WCCC agree with each other when PFDM is present.\n\n", "2404.15987": "2024-04-24, **NLO thermal corrections to dark matter annihilation cross sections: a novel approach**, Prabhat Butola et.al., [2404.15987v1](http://arxiv.org/abs/2404.15987v1)\n\n The dark matter relic density has been increasingly accurately measured by successive generations of experiments. The Boltzmann equation determines the yields using the dark matter annihilation cross section as one of the inputs; the accurate computation of the latter including thermal contributions thus assumes importance. We report here the next-to-leading order (NLO) thermal corrections to the cross sections for (Majorana) dark matter annihilation to standard model fermions: $\\chi \\chi \\to f \\overline{f}$, via charged scalars. We use a novel approach, utilising the technique of Grammer and Yennie, extended to thermal field theories, where the cancellation of soft infra-red divergences occurs naturally. We present the NLO thermal cross sections in full detail for both the relativistic case as well as in the non-relativistic limit. Our independent calculation verifies earlier results where the leading contribution at order ${\\cal{O}}(T^2)$ was shown to be proportional to the square of the fermion mass in the non-relativistic limit, just as at leading order. We find that the ${\\cal{O}}(T^4)$ contributions have the same dependence on the fermion mass as well.\n\n", "2404.15981": "2024-04-24, **Weak Cosmic Censorship and Weak Gravity Conjectures in CFT Thermodynamics**, Jafar Sadeghi et.al., [2404.15981v1](http://arxiv.org/abs/2404.15981v1)\n\n In this paper, we explore the intriguing interplay between fundamental theoretical physics concepts within the context of charged black holes. Specifically, we focus on the consistency of the weak gravity conjecture (WGC) and weak cosmic censorship conjecture (WCCC) in the thermodynamics of conformal field theory (CFT), and restricted phase space (RPS) for AdS Reissner-Nordstr$\\\"o$m black holes with a perfect fluid dark matter (RN-PFDM). The WGC ensures that gravity remains the weakest force in the system. Meanwhile, the WCCC addresses the cosmic censorship problem by preventing the violation of fundamental physical laws near the black hole singularity. First, we analyze the RN black hole's free energy in both spaces, revealing a distinctive swallowtail pattern indicative of a first-order phase transition when certain free parameter conditions are met. We explore the WGC across different phase spaces, emphasizing the need for certain conditions in EPST, RPST, and CFT. We demonstrate that PFDM $( \\gamma )$ and the radius of AdS ($l$) have a vital role in proving the satisfaction of the WGC. Also, these values have a linear relation with the range compatibility of WGC. The range of compatibility for WGC in RPST and EPST is the same while for CFT, this range is larger than EPST, and RPST. It means somehow the WGC and CFT are more consistent. The WCCC was examined at the critical juncture, confirming its validity with $( f(M\\_c, Q\\_c, r\\_c) = 0 )$. We conclude that the WGC is supported at the critical point of black holes, and the WCCC is also maintained, demonstrating the robustness of these conjectures within the critical ranges of black hole parameters.\n\n", "2404.15977": "2024-04-24, **Kinetic Model for Dark Energy -- Dark Matter Interaction: Scenario for the Hubble Tension**, Giovanni Montani et.al., [2404.15977v1](http://arxiv.org/abs/2404.15977v1)\n\n We analyze a model for Dark Energy - Dark Matter interaction, based on a decaying process of the former constituents into the latter ones. The dynamical equations are constructed following a kinetic formulation, which separates the interacting fluctuations from equilibrium distribution of the both the species. The emerging dynamical picture consists of coupled equations, which are specialized in the case of a Dark Energy equation of state parameter: we deal with a modified Lambda Cold Dark Matter model, which is investigated versus a possible interpretation of the Hubble tension. We compare our model with data corresponding to 6 points of the expansion rate from Type Ia Supernovae. We show that, the proposed model suitably fits data according to a value of the Hubble constant compatible with the SHOES Collaboration measurement. The tension is solved because, essentially for redshift greater than one, the correction to the Lambda Cold Dark Matter model vanishes and its presence does not affect the Planck measurements.\n\n", "2404.15931": "2024-04-24, **Probing Hidden Leptonic Scalar Portals using the NA64 Experiment at CERN**, A. Ponten et.al., [2404.15931v1](http://arxiv.org/abs/2404.15931v1)\n\n In this study, we demonstrate the potential of the NA64 experiment at CERN SPS to search for New Physics processes involving $e\\rightarrow\\mu$ transitions after the collision of 100 GeV electrons with target nuclei. A new Dark Sector leptonic portal in which a scalar boson $\\varphi$ could be produced in the lepton-flavor-changing bremsstrahlung-like reaction, $eN\\rightarrow \\mu N\\varphi$, is used as benchmark process. In this work, we develop a realistic Monte Carlo simulation of the NA64 experimental setup implementing the differential and total production cross-section computed at exact tree-level and applying the Weisz\\\"{a}cker-Williams phase space approximation. Using this framework, we investigate the main background sources and calculate the expected sensitivity of the experiment. The results indicate that with minor setup optimization, NA64 can probe a large fraction of the available parameter space compatible with the muon $g-2$ anomaly and the Dark Matter relic predictions in the context of a new Dark Sector leptonic portal with $10^{11}$ EOT. This result paves the way to the exploration of lepton-flavour-changing transitions in NA64.\n\n", "2404.15930": "2024-04-24, **Constraints on dark matter models involving an $s$-channel mediator with the ATLAS detector in $pp$ collisions at $\\sqrt{s} = 13$ TeV**, ATLAS Collaboration et.al., [2404.15930v1](http://arxiv.org/abs/2404.15930v1)\n\n This paper reports a summary of searches for a fermionic dark matter candidate in the context of theoretical models characterised by a mediator particle exchange in the $s$-channel. The data sample considered consists of $pp$ collisions delivered by the Large Hadron Collider during its Run 2 at a centre-of-mass energy of $\\sqrt{s} = 13$ TeV and recorded by the ATLAS detector, corresponding to up to 140 $fb^{-1}$. The interpretations of the results are based on simplified models where the new mediator particles can be spin-0, with scalar or pseudo-scalar couplings to fermions, or spin-1, with vector or axial-vector couplings to fermions. Exclusion limits are obtained from various searches characterised by final states with resonant production of Standard Model particles, or production of Standard Model particles in association with large missing transverse momentum.\n\n", "2404.15926": "2024-04-24, **Microwave Technologies in Experiments for Detection of Dark Matter Axions**, Jose R. Navarro-Madrid et.al., [2404.15926v1](http://arxiv.org/abs/2404.15926v1)\n\n This article reviews different microwave technologies used in dark matter axion detection experiments with resonant cavities. The general concepts of the experiment are presented and ways to optimize the design parameters of microwave resonators are discussed. Additionally, different frequency tuning systems are described. Finally, research lines where microwave engineering can contribute to this kind of axion detection are presented.\n\n", "2404.15809": "2024-04-24, **Dark matter and space-time symmetry restoration**, Joao Magueijo et.al., [2404.15809v1](http://arxiv.org/abs/2404.15809v1)\n\n We examine local physics in the presence of global variables: variables associated with the whole of the spacelike surfaces of a foliation. These could be the (pseudo-)constants of nature and their conjugate times, but our statements are more general. Interactions between the local and the global (for example, dependence of the local action on global times dual to constants) degrades full space-time diffeomorphism invariance down to spatial diffeomorphism invariance, and so an extra degree of freedom appears. When these presumably primordial global interactions switch off, the local action recovers full invariance and so the usual two gravitons, but a legacy matter component is left over, bearing the extra degree of freedom. Under the assumption that the preferred foliation is geodesic, this component behaves like dark matter, except that 3 of its 4 local degrees of freedom are frozen, forcing its rest frame to coincide with the preferred foliation. The non-frozen degree of freedom (the number density of the effective fluid) is the survivor of the extra \"graviton\" present in the initial theory, and keeps memory of all the past global interactions that took place in a given location in the preferred foliation. Such \"painted-on\" dark matter is best distinguished from the conventional one in situations where the preferred frame would be preposterous if all 4 degrees of freedom of dark matter were available. We provide one example: an outflowing halo of legacy matter with exact escape speed at each point and a very specific profile, surrounding a condensed structure made of normal matter.\n\n", "2404.15741": "2024-04-24, **First measurement of Gallium Arsenide as a low-temperature calorimeter**, D. L. Helis et.al., [2404.15741v1](http://arxiv.org/abs/2404.15741v1)\n\n In this paper, we present the first measurement of a Gallium Arsenide crystal working as low-temperature calorimeter for direct Dark Matter (DM) searches within the DAREDEVIL (DARk-mattEr DEVIces for Low energy detection) project. In the quest for direct dark matter detection, innovative approaches to lower the detection thershold and explore the sub-GeV mass DM range, have gained high relevance in the last decade. This study presents the pioneering use of Gallium Arsenide (GaAs) as a low-temperature calorimeter for probing the dark matter-electron interaction channel. Our experimental setup features a GaAs crystal at ultralow temperature of 15 mK, coupled with a Neutron Transmutation Doped (NTD) thermal sensor for precise energy estimation. This configuration is the first step towards the detection of single electrons scattered by dark matter particles within the GaAs crystal, to significantly improve the sensitivity to low-mass dark matter candidates.\n\n"}, "supernova": {"2404.16570": "2024-04-25, **STELLA lightcurves of energetic pair instability supernovae in the context of SN2018ibb**, Chris Nagele et.al., [2404.16570v1](http://arxiv.org/abs/2404.16570v1)\n\n SN2018ibb is a recently observed hydrogen poor super-luminous supernova which appears to be powered by the decay of $30\\;\\rm{M\\_\\odot}$ of radioactive nickel. This supernova has been suggested to show hybrid signatures of a pair instability supernova and an interacting supernova. In a previous paper, we found that rotating, metal enriched pair instability supernova progenitors appeared to check both of these boxes. In this paper, we model the lightcurves of the pair instability supernovae using STELLA. We find that the STELLA models can explain the overall shape of the bolometric lightcurve of SN2018ibb, though not specific morphological features such as the luminosity peak or the bump at roughly three hundred days after the peak. We also estimate the contribution from interaction, and find that with relatively low wind velocities, the circum-stellar medium originating from the stellar winds is consistent with the evidence for interaction in the spectra. The observed values of the photosphere velocity in the hundred days after peak luminosity are similar to the STELLA models, but the deceleration is lower. This leads to the biggest inconsistency which is the black body temperature of SN2018ibb being much hotter than any of the STELLA models. We note that this high temperature (and the flat velocity) may be difficult to reconcile with the long rise time of SN2018ibb, but nevertheless conclude that if it is accurate, this discrepancy represents a challenge for SN2018ibb being a robust PISN candidate. This result is noteworthy given the lack of other scenarios for this supernova.\n\n", "2404.16261": "2024-04-25, **Reconstructing Cosmic History: JWST-Extended Mapping of the Hubble Flow from z$ \\sim $0 to z$ \\sim$7.5 with HII Galaxies**, Ricardo Chávez et.al., [2404.16261v1](http://arxiv.org/abs/2404.16261v1)\n\n Over twenty years ago, Type Ia Supernovae (SNIa) [arXiv:astro-ph/9805201, arXiv:astro-ph/9812133] observations revealed an accelerating Universe expansion, suggesting a significant dark energy presence, often modelled as a cosmological constant, $\\Lambda$. Despite its pivotal role in cosmology, the standard $\\Lambda$CDM model remains largely underexplored in the redshift range between distant SNIa and the Cosmic Microwave Background (CMB). This study harnesses the James Webb Space Telescope's advanced capabilities to extend the Hubble flow mapping across an unprecedented redshift range, from $z \\approx 0$ to $z \\approx 7.5$. Utilising a dataset of 231 HII galaxies and extragalactic HII regions, we employ the $\\text{L}-\\sigma$ relation, correlating the luminosity of Balmer lines with their velocity dispersion, to define a competitive technique for measuring cosmic distances. This approach maps the Universe's expansion over more than 12 billion years, covering 95\\% of its age. Our analysis, using Bayesian inference, constrains the parameter space $\\lbrace h, \\Omega\\_m, w\\_0\\rbrace = \\lbrace 0.731\\pm0.039, 0.302^{+0.12}\\_{-0.069}, -1.01^{+0.52}\\_{-0.29}\\rbrace $ (statistical) for a flat Universe. These results provide new insights into cosmic evolution and suggest uniformity in the photo-kinematical properties of young massive ionizing clusters in giant HII regions and HII galaxies across most of the Universe's history.\n\n", "2404.16102": "2024-04-24, **A Cepheid systematics-free test of $H_0$ to $\\lesssim2.5\\%$ accuracy using SH0ES photometry**, Doron Kushnir et.al., [2404.16102v1](http://arxiv.org/abs/2404.16102v1)\n\n The recent SH0ES determination of the Hubble constant, $H\\_0=73.04\\pm1.04$ km/s/Mpc, deviates significantly by $\\approx5\\sigma$ from the \\textit{Planck} value, stimulating discussions on cosmological model extensions. To minimize statistical uncertainty and mitigate sensitivity to systematic errors in any single anchor distance determination, SH0ES combines Cepheids from various observations, including those from Type Ia supernova (SNe Ia) host galaxies, NGC 4258, and closer galaxies (MW, LMC, SMC, and M31), although this mixed sample may introduce unknown or subtle systematic errors due to comparing distant and closer Cepheids. To address this, we propose a subset excluding Cepheids from the closer galaxies, retaining only the NGC 4258 water megamasers as a single anchor, circumventing potential systematic errors associated with observational methods and reduction techniques. Focusing solely on these Cepheids yields competitive statistical errors, approximately $2.5\\%$, sufficient to identify a $\\approx3\\sigma$ tension with the \\textit{Planck} $H\\_0$ value. Our approach offers an opportunity to utilize optical photometry with systematic uncertainty smaller than the statistical uncertainty, potentially achieving higher precision than NIR photometry, given the lower optical background. However, currently the optical photometry sample's fidelity does not match that of NIR photometry. The significant Hubble tension obtained is unrelated to Cepheids and we discuss other options.\n\n", "2404.15977": "2024-04-24, **Kinetic Model for Dark Energy -- Dark Matter Interaction: Scenario for the Hubble Tension**, Giovanni Montani et.al., [2404.15977v1](http://arxiv.org/abs/2404.15977v1)\n\n We analyze a model for Dark Energy - Dark Matter interaction, based on a decaying process of the former constituents into the latter ones. The dynamical equations are constructed following a kinetic formulation, which separates the interacting fluctuations from equilibrium distribution of the both the species. The emerging dynamical picture consists of coupled equations, which are specialized in the case of a Dark Energy equation of state parameter: we deal with a modified Lambda Cold Dark Matter model, which is investigated versus a possible interpretation of the Hubble tension. We compare our model with data corresponding to 6 points of the expansion rate from Type Ia Supernovae. We show that, the proposed model suitably fits data according to a value of the Hubble constant compatible with the SHOES Collaboration measurement. The tension is solved because, essentially for redshift greater than one, the correction to the Lambda Cold Dark Matter model vanishes and its presence does not affect the Planck measurements.\n\n", "2404.15953": "2024-04-24, **Population synthesis of Galactic pulsars with machine learning**, Michele Ronchi et.al., [2404.15953v1](http://arxiv.org/abs/2404.15953v1)\n\n This thesis work represents the first efforts to combine population synthesis studies of the Galactic isolated neutron stars with deep-learning techniques with the aim of better understanding neutron-star birth properties and evolution. In particular, we develop a flexible population-synthesis framework to model the dynamical and magneto-rotational evolution of neutron stars, their emission in radio and their detection with radio telescopes. We first study the feasibility of using deep neural networks to infer the dynamical properties at birth and then explore a simulation-based inference approach to predict the birth magnetic-field and spin-period distributions and the late-time magnetic-field decay for the observed radio pulsar population. Our results for the birth magneto-rotational properties agree with the findings of previous works while we constrain the late-time evolution of the magnetic field in neutron stars for the first time. Moreover, this thesis also studies possible scenarios to explain the puzzling nature of recently discovered periodic radio sources with very long periods of the order of thousands of seconds. In particular, by assuming a neutron-star origin, we study the spin-period evolution of a newborn neutron star interacting with a supernova fallback disk and find that the combination of strong, magnetar-like magnetic fields and moderate accretion rates can lead to very large spin periods on timescales of ten thousands of years. Moreover, we perform population synthesis studies to assess the possibility for these sources to be either neutron stars or magnetic white dwarfs emitting coherently through magnetic dipolar losses. These discoveries have opened up a new perspective on the neutron-star population and have started to question our current understanding of how coherent radio emission is produced in pulsar magnetospheres.\n\n", "2404.15913": "2024-04-24, **Constraints on Cosmological Models from Quasars Calibrated with Type Ia Supernova by a Gaussian Process**, Haixiang Zhang et.al., [2404.15913v1](http://arxiv.org/abs/2404.15913v1)\n\n In this paper, we use quasars calibrated from type Ia supernova (SN Ia) to constrain cosmological models. We consider three different X-ray luminosity ($L\\_{X}$) - ultraviolet luminosity ($L\\_{UV}$) relations of quasars, i.e., the standard $L\\_{X}$-$L\\_{UV}$ relation and two redshift-evolutionary relations (Type I and Type II) respectively constructed from copula and considering a redshift correction to the luminosity of quasars. Only in the case of the Type I relation, quasars can always provide effective constraints on the $\\Lambda$CDM model. Furthermore, we show that, when the observational Hubble data (OHD) are added, the constraints on the absolute magnitude $M$ of SN Ia and the Hubble constant $H\\_0$ can be obtained. In the $\\Lambda$CDM model, the OHD measurements plus quasars with the Type I relation yields $M$ =$-19.321^{+0.085}\\_{-0.076}$, which is in good agreement with the measurement from SH0ES ($M=-19.253\\pm{0.027}$), and $H\\_0$ = $70.80\\pm3.6~\\mathrm{km~s^{-1}Mpc^{-1}}$, falling between the measurements from SH0ES and the Planck cosmic microwave background radiation data.\n\n"}}