{"neutrino": {"2402.14719": "2024-02-22, **The cosmological constant and scale hierarchies with emergent gauge symmetries**, Steven D. Bass et.al., [2402.14719v1](http://arxiv.org/abs/2402.14719v1)\n\n Motivated by the stability of the electroweak Higgs vacuum we consider the possibility that the Standard Model might work up to large scales between about $10^{10}$ GeV and close to the Planck scale. A plausible scenario is an emergent Standard Model with gauge symmetries originating in some topological like phase transition deep in the ultraviolet. In this case the cosmological constant scale and neutrino masses should be of similar size, suppressed by factor of the large scale of emergence. The key physics involves a subtle interplay of Poincar\\'e invariance, mass generation and renormalisation group invariance. The Higgs mass would be environmentally selected in connection with vacuum stability. Consequences for dark matter scenarios are discussed.\n\n", "2402.14491": "2024-02-22, **Search for long-lived particles decaying to final states with a pair of muons in proton-proton collisions at $\\sqrt{s}$ = 13.6 TeV**, CMS Collaboration et.al., [2402.14491v1](http://arxiv.org/abs/2402.14491v1)\n\n An inclusive search for long-lived exotic particles (LLPs) decaying to final states with a pair of muons is presented. The search uses data corresponding to an integrated luminosity of 36.6 fb$^{-1}$ collected by the CMS experiment from the proton-proton collisions at $\\sqrt{s}$ = 13.6 TeV in 2022, the first year of Run 3 of the CERN LHC. The experimental signature is a pair of oppositely charged muons originating from a common vertex spatially separated from the proton-proton interaction point by distances ranging from several hundred $\\mu$m to several meters. The sensitivity of the search benefits from new triggers for displaced dimuons developed for Run 3. The results are interpreted in the framework of the hidden Abelian Higgs model, in which the Higgs boson decays to a pair of long-lived dark photons, and of an $R$-parity violating supersymmetry model, in which long-lived neutralinos decay to a pair of muons and a neutrino. The limits set on these models are the most stringent to date in wide regions of lifetimes for LLPs with masses larger than 10 GeV.\n\n", "2402.14441": "2024-02-22, **Leptogenesis consequences of TM1 mixing and μ-τreflection symmetry in minimal seesaw model with pseudo-Dirac right-handed neutrinos**, Zhen-hua Zhao et.al., [2402.14441v1](http://arxiv.org/abs/2402.14441v1)\n\n In this paper we have studied the realizations of the popular TM1 neutrino mixing and neutrino \\mu-\\tau reflection symmetry (which are well motivated from the neutrino oscillation data and lead to interesting phenomenological consequences) in the minimal seesaw model with a Dirac pair of right-handed neutrinos (with equal masses but opposite parities), and their consequences for leptogenesis. In order to realize the low-scale resonant leptogenesis scenario, we have considered two possible ways of generating the tiny mass splitting between the two right-handed neutrinos: one way is to modify their Majorana mass matrix to a form as shown in Eq.(25); the other way is to consider the renormalization-group corrections for their masses. For the \\mu-\\tau reflection symmetry, in order for leptogenesis to work, we have further considered the flavor-dependent conversion efficiencies from the lepton asymmetry to the baryon asymmetry during the sphaleron processes, and its breaking via the renormalization-group corrections.\n\n", "2402.14333": "2024-02-22, **Two-dimensional models of core-collapse supernova explosions assisted by heavy sterile neutrinos**, Kanji Mori et.al., [2402.14333v1](http://arxiv.org/abs/2402.14333v1)\n\n Core-collapse supernovae can be a copious source of sterile neutrinos, hypothetical particles that mix with active neutrinos. We develop two-dimensional stellar core-collapse models that incorporate the mixing between tau neutrinos and heavy sterile neutrinos -- those with the mass of 150--200 MeV -- to investigate signatures of sterile neutrinos in supernova observables. We find that the decay channel of a sterile neutrino into a pion and a tau neutrino can enhance the explosion energy and the synthesized nickel mass. Although the inclusion of sterile neutrinos considered in this study slightly reduce the neutrino and gravitational-wave signals, we find that they are still detectable for a Galactic event. Furthermore, we point out that if sterile neutrinos are as massive as ~200 MeV, they produce high-energy tau antineutrinos with energies of ~80 MeV, the detection of which can be a smoking signature of the sterile neutrinos and where Hyper-Kamiokande should play a pivotal role.\n\n"}, "dark matter": {"2402.14339": "2024-02-22, **Can Early Dark Energy be Probed by the High-Redshift Galaxy Abundance?**, Weiyang Liu et.al., [2402.14339v1](http://arxiv.org/abs/2402.14339v1)\n\n The Hubble tension and $\\sigma\\_{8}$ tension are two of the major issues of the standard $\\Lambda$ Cold Dark Matter ($\\Lambda$CDM) model. The analysis of the Cosmic Microwave Background (CMB) data acquired by the Atacama Cosmology Telescope (ACT) and the large-scale ($\\ell\\lesssim1300$) Planck Telescope manifest their preference for the Early Dark Energy (EDE) theory, which was set to alleviate the Hubble tension by decreasing the sound horizon $r\\_{s}$, and gives $H\\_{0} \\approx 72 \\ km \\ s^{-1} \\ Mpc^{-1}$. However, the EDE model is commonly questioned for exacerbating the $\\sigma\\_8$ tension on top of the $\\Lambda$CDM model, and its lack of preference from the late-time matter power spectrum observations, e.g., Baryon Oscillation Spectroscopic Survey (BOSS). In light of the current obscurities, we inspect if the high redshift galaxy abundance, i.e., Stellar Mass Function/Density (SMF/SMD) and Luminosity Function (LF), can independently probe the EDE model and ameliorate the challenges it encounters. Our result shows that the EDE model produces more observable galaxies than $\\Lambda$CDM at $z>8$. The LF and SMD, in particular, are consistent with the recent unexpectedly high results observed by the James Webb Space Telescope (JWST), which may posit another observational hint of EDE. This result also implies an efficient suppression mechanism of the galaxy formation rate that leads to the conversion between EDE- and $\\Lambda$CDM-like Universe around $z\\sim7-10$, and that $\\sigma\\_{8}$ tension could be more of a tension of galaxy evolution than cosmology, hence diminishing its impact on EDE or $\\Lambda$CDM theory.\n\n", "2402.14262": "2024-02-22, **Color-flavor locked strange stars with a mirror-dark-matter core and the observations of compact stars**, S. -H. Yang et.al., [2402.14262v1](http://arxiv.org/abs/2402.14262v1)\n\n We investigate the structure and the tidal deformability of the color-flavor locked strange stars with a mirror-dark-matter core. Assuming the stars in the GW170817 event have a mirror-dark-matter core, the observations of the central compact object within the supernova remnant HESS J1731-347 and the compact objects in the GW190814 and GW170817 events could be explained simultaneously with a pairing gap much smaller than 200 MeV, while a pairing gap larger than about 200 MeV must be employed without the consideration of a mirror-dark-matter core. More importantly, we find that for the case of the quartic coefficient $a\\_{4}< 0.589$, if the mirror-dark-matter core in the compact stars of GW170817 is large enough (e.g., the mass fraction of the mirror-dark-matter core is larger than 22.8% for $a\\_{4}= 0.55$), the minimum allowed value of the pairing gap could be less than 46.5 MeV (i.e., one half of the value of the strange quark mass which is taken as 93 MeV in this paper), which leads to the result that all astrophysical observations mentioned above could be satisfied without violating the conformal bound or the recently proposed positive trace anomally bound.\n\n", "2402.14223": "2024-02-22, **Interacting light thermal-relic dark matter: self-consistent cosmological bounds**, Rui An et.al., [2402.14223v1](http://arxiv.org/abs/2402.14223v1)\n\n We analyze cosmic microwave background (CMB) data to constrain the mass and interaction strengths of thermally-produced dark matter (DM) in a self-consistent manner, simultaneously taking into account the cosmological effects of its mass and interactions. The presence of a light thermal-relic particle contributes non-negligibly to the radiation density during Big Bang Nucleosynthesis (BBN), altering the light-element yields, as well as the the effective number of relativistic particle species. On the other hand, DM interactions with the Standard Model can affect distribution of matter in later universe. Both mass and interactions alter CMB anisotropy on sub-degree scales. To understand and quantify the interplay of these effects, we consider elastic DM-baryon scattering with a momentum-transfer cross section that scales as a power law of the relative velocity between the scattering particles. In the range of thermal-relic DM masses relevant for BBN ($\\lesssim$ 20 MeV), we find that the reconstruction of the DM mass and the scattering cross section from the CMB data features strong degeneracies; modeling the two effects simultaneously increases the sensitivity of the CMB measurements to both fundamental properties of DM. Additionally, we study the effects of late-time residual annihilation of a light thermal relic and provide improved CMB constraints on the DM mass and annihilation cross section. To examine degeneracy between DM mass, cross section for elastic scattering with baryons, and annihilation cross section, we consider a specific case of DM with an electric and magnetic dipole moments. We present new, self-consistent cosmological bounds for this model and discuss implications for future searches.\n\n", "2402.14218": "2024-02-22, **Velocity Dispersions of Quiescent Galaxies in IllustirisTNG**, Jubee Sohn et.al., [2402.14218v1](http://arxiv.org/abs/2402.14218v1)\n\n We examine the central stellar velocity dispersion of subhalos based on IllustrisTNG cosmological hydrodynamic simulations. The central velocity dispersion is a fundamental observable that links galaxies with their dark matter subhalos. We carefully explore simulated stellar velocity dispersions derived with different definitions to assess possible systematics. We explore the impact of variation in the identification of member stellar particles, the viewing axes, the velocity dispersion computation technique, and simulation resolution. None of these issues impact the velocity dispersion significantly; any systematic uncertainties are smaller than the random error. We examine the stellar mass-velocity dispersion relation as an observational test of the simulations. At fixed stellar mass, the observed velocity dispersions significantly exceed the simulation results. This discrepancy is an interesting benchmark for the IllustrisTNG simulations because the simulations are not explicitly tuned to match this relation. We demonstrate that the stellar velocity dispersion provides measures of the dark matter velocity dispersion and the dark matter subhalo mass.\n\n", "2402.14199": "2024-02-22, **Center-of-mass recoil effects on the annihilation and formation of dark matter bound pairs**, Simone Biondini et.al., [2402.14199v1](http://arxiv.org/abs/2402.14199v1)\n\n For a quantitative investigation on the time evolution of heavy thermal dark matter at and after thermal freeze-out, near-threshold processes need to be taken into account which have a large impact on the observed dark matter relic abundance. In this conference paper, we study the recoil effect of heavy dark matter pairs in a thermal bath and compute the annihilation cross section and the decay width as well as the bound-state formation cross section of dark matter fermion-antifermion pairs in the laboratory frame within the framework of potential non-relativistic effective field theories at finite temperature. For the considered hierarchy of energy scales, we highlight the effect of the recoil corrections to the thermal rates.\n\n"}, "supernova": {"2402.14637": "2024-02-22, **Upper Limits of $^{44}$Ti Decay Emission in Four Nearby Thermonuclear Supernova Remnants**, Jianbin Weng et.al., [2402.14637v1](http://arxiv.org/abs/2402.14637v1)\n\n To identify progenitors and investigate evidence of He burning, we searched for decay radiation of freshly synthesized $^{44}$Ti in four young nearby thermonuclear supernova remnants: Kepler, SN 1885, G1.9+0.3 and SN 1006, by analysing the up-to-date NuSTAR archival data. No apparent flux excess from the 68 and 78 keV line emissions accompanying decay was detected above the power law continuum applied for the remnants and the absorbed stray light. By comparing the inferred upper limits of the line flux and the initial $^{44}$Ti masses with a wide variety of supernova nucleosynthesis models, we placed constraints on the supernova progenitors. We derived the first NuSTAR line flux upper limit for Kepler and ruled out most of the double-detonation scenarios with a thick He layer under low density. We estimated, for the first time, the upper limit for SN 1885, which is high because of the large distance yet still remains consistent with the He shell detonation. The new flux and mass limit of G1.9+0.3 derived from a longer total exposure is lower than the results from previous studies and evidently excludes explosive burning of He-rich matter. The relatively advanced age and the large spatial extent of SN 1006 have prevented meaningful constraints.\n\n", "2402.14262": "2024-02-22, **Color-flavor locked strange stars with a mirror-dark-matter core and the observations of compact stars**, S. -H. Yang et.al., [2402.14262v1](http://arxiv.org/abs/2402.14262v1)\n\n We investigate the structure and the tidal deformability of the color-flavor locked strange stars with a mirror-dark-matter core. Assuming the stars in the GW170817 event have a mirror-dark-matter core, the observations of the central compact object within the supernova remnant HESS J1731-347 and the compact objects in the GW190814 and GW170817 events could be explained simultaneously with a pairing gap much smaller than 200 MeV, while a pairing gap larger than about 200 MeV must be employed without the consideration of a mirror-dark-matter core. More importantly, we find that for the case of the quartic coefficient $a\\_{4}< 0.589$, if the mirror-dark-matter core in the compact stars of GW170817 is large enough (e.g., the mass fraction of the mirror-dark-matter core is larger than 22.8% for $a\\_{4}= 0.55$), the minimum allowed value of the pairing gap could be less than 46.5 MeV (i.e., one half of the value of the strange quark mass which is taken as 93 MeV in this paper), which leads to the result that all astrophysical observations mentioned above could be satisfied without violating the conformal bound or the recently proposed positive trace anomally bound.\n\n"}}