{"neutrino": {"2408.03931": "2024-08-07, **Superfluid quantum criticality and the thermal evolution of neutron stars**, Hao-Fu Zhu et.al., [2408.03931v1](http://arxiv.org/abs/2408.03931v1)\n\n The neutron star starts to cool down shortly after its birth by emitting neutrinos. When it is cold enough, the Cooper pairs of neutrons are formed, which triggers a superfluid transition. Previous works on neutron superfluidity are focused on the finite-temperature transition. Little attention is paid to the potentially important quantum critical phenomena associated with superfluidity. Here, we provide the first theoretical analysis of superfluid quantum criticality, concentrating on its impact on neutron star cooling. Extensive calculations found that superfluidity occurs within a finite range of nuclear density $\\rho$. The density serves as a non-thermal parameter for superfluid quantum phase transition. In a broad quantum critical region, there is a strong coupling between the gapless neutrons and the quantum critical fluctuations of superfluid order parameter. We handle this coupling by using perturbation theory and renormalization group method, and show that it leads to non-Fermi liquid behavior, which yields a logarithmic $T\\ln(1/T)$ correction to the Fermi-liquid specific heat $c\\_{n}\\propto T$ and also markedly alters the neutrino emissivity. Quantum critical phenomena emerge at a time much earlier than the onset of superfluidity and persist throughout almost the entire life of a neutron star. At a low $T$, such phenomena coexist with superfluidity in the neutron star interior, yet occupying different layers. We include superfluid quantum criticality into the theoretical description of neutron star cooling and find that it obviously prolongs the thermal relaxation time. By varying the strength of superfluid fluctuations and other quantities, we obtain an excellent fit to the observed cooling data of a variety of neutron stars. Our results indicate the existence of an intriguing correlation between superfluid quantum criticality and the thermal evolution of neutron stars.\n\n", "2408.03760": "2024-08-07, **Feasibility of a directional solar neutrino measurement with the CYGNO/INITIUM experiment**, Samuele Torelli et.al., [2408.03760v1](http://arxiv.org/abs/2408.03760v1)\n\n Over the past five decades, solar neutrino research has been pivotal in driving significant scientific advancements, enriching our comprehension of both neutrino characteristics and solar processes. Despite numerous experiments dedicated to solar neutrino detection, a segment of the lower pp spectrum remains unexplored, while the precision of measurements from the CNO cycle remains insufficient to resolve the solar abundance problem determined by the discrepancy between the data gathered from helioseismology and the forecasts generated by stellar interior models for the Sun. The CYGNO/INITIUM experiment aims to deploy a large 30 m3 directional detector for rare event searches focusing on Dark Matter. Recently, in the CYGNUS collaboration, there has been consideration for employing these time projection chamber technology in solar neutrino directional detection trough neutrino-electron elastic scattering. This is due to their potential to conduct low-threshold, high-precision measurements with spectroscopic neutrino energy reconstruction on an event-by-event basis driven by the kinematic. However, so far, no experiments have been investigated on the feasibility of this measurement using actual detector performances and background levels. Such a detector already with a volume of O(10) m3 could perform an observation of solar neutrino from the pp chain with an unprecedented low threshold, while with larger volumes it could measure the CNO cycle eventually solving the solar metallicity problem.\n\n", "2408.03493": "2024-08-07, **Effect of neutrino electromagnetic properties on the quasielastic neutral-current neutrino-nucleus scattering**, K. S. Kim et.al., [2408.03493v1](http://arxiv.org/abs/2408.03493v1)\n\n In the quasielastic region, we investigate the effect of neutrino electromagnetic properties constrained from the recent experiments on the electroweak neutral current reaction process of the neutrino-$^{12}$C scattering. For a relativistic description of the nuclear dynamics, we employ the relativistic mean-field model, which has been proven to describe the data nicely in the quasielastic region. In the present work, we analyze the influence beyond the Standard Model by considering the neutrino magnetic and electric dipole form factors and charge radius on the neutrino electroweak interactions within $^{12}$C. To this end, we use the values of the neutrino charge radius and the magnetic moment at the squared four momentum transfer $Q^2=0$ obtained from the recent experiments and calculate the neutrino differential cross section of the neutrino-$^{12}$C scattering. We find that the effect of the charge radius and the electric dipole form factor is very small, but the role of the magnetic dipole form factor is sensitive to $Q^2$ and becomes sizable at small momentum transfer.\n\n", "2408.03383": "2024-08-06, **Heavy Neutral Lepton searches at an ICARUS-like detector using NuMI beam**, Animesh Chatterjee et.al., [2408.03383v1](http://arxiv.org/abs/2408.03383v1)\n\n The discovery of non-zero neutrino masses points to the likely existence of multiple SM neutral fermions. When such states are heavy enough that they cannot be produced in oscillations, they are referred to as Heavy Neutral Leptons (HNLs). In minimal models, the HNL production and decay are controlled by SM interactions and the mixing between HNLs and the active neutrino and typically result in relatively long lifetimes if the masses are in the MeV-GeV range. We have studied the physics case and technical feasibility for a dedicated HNL search using the NuMI beam at an ICARUS-like detector. Our analysis conclusively demonstrates that the constraints on the mixing of the HNL as a function of its mass for an ICARUS-like detector with NuMI beam are highly competitive with the limits obtained from present experiments.\n\n", "2408.03373": "2024-08-06, **Neutrinoless $ββ$ decay nuclear matrix elements complete up to N$^2$LO in heavy nuclei**, Daniel Castillo et.al., [2408.03373v1](http://arxiv.org/abs/2408.03373v1)\n\n We evaluate all nuclear matrix elements (NMEs) up to next-to-next-to leading order (N$^2$LO) in chiral effective field theory ($\\chi$EFT) for the neutrinoless double-beta ($0\\nu\\beta\\beta$) decay of the nuclei most relevant for experiments, including $^{76}$Ge, $^{100}$Mo, and $^{136}$Xe. We use the proton-neutron quasiparticle random-phase approximation (pnQRPA) and the nuclear shell model to calculate the N$^2$LO NMEs from very low-momentum (ultrasoft) neutrinos and from loop diagrams usually neglected in $0\\nu\\beta\\beta$ studies. Our results indicate that, separately, the new N$^2$LO NMEs can have up to a $15\\%$ impact on the total NME, but cancellations lead to an overall N$^2$LO contribution centered around $-5\\%$ for the shell model and $+10\\%$ for the pnQRPA, with sizable uncertainties due to the short-range nature of the loop NMEs. The sign discrepancy between many-body methods is common to all studied nuclei and points to the different behaviour of the intermediate states of the $0\\nu\\beta\\beta$ decay. In addition, our results support the $\\chi$EFT prediction that the ultrasoft NME is closely related to contributions usually referred to as ``beyond the closure approximation''.\n\n", "2408.03368": "2024-08-06, **Evolving massive stars to core collapse with GENEC: Extension of equation of state, opacities and effective nuclear network**, Adam Griffiths et.al., [2408.03368v1](http://arxiv.org/abs/2408.03368v1)\n\n Stars with initial mass above roughly 8 solar masses will evolve to form a core made of iron group elements at which point no further exothermic nuclear reactions between charged nuclei may prevent the core collapse. Electron captures, neutrino losses, and the photo-disintegration of heavy nuclei trigger the collapse of these stars. Models at the brink of core collapse are produced using stellar evolution codes and these pre-collapse models may be used in the study of the subsequent dynamical evolution (including their explosion as supernovae and the formation of compact remnants such as neutron stars or black holes). We upgrade the physical ingredients employed by the GENeva stellar Evolution Code, GENEC, so that it may cover the regime of high temperatures and high densities required to produce progenitors of core-collapse. We have improved GENEC in three directions, equation of state, the nuclear reaction network and the radiative and conductive opacities adapted for the computation of the advanced phases of evolution. We produce a small grid of pre-supernova models of stars with zero-age main sequence masses of 15, 20 and 25 solar masses at solar and less than half solar metallicities. The results are compared with analogous models produced with the MESA code. The global properties of our new models, particularly of their inner cores, are comparable to models computed with MESA and pre-existing progenitors in the literature. Between codes the exact shell structure varies impacting explosion predictions. Using GENEC with state-of-the-art physics, we have produced massive stellar progenitors prior to collapse. These progenitors are suitable for follow-up studies, including the dynamical collapse and supernova phases. Larger grids of supernova progenitors are now feasible, with potential for further dynamical evolution.\n\n", "2408.03364": "2024-08-06, **Long-lived particle phenomenology in one-loop neutrino mass models with dark matter**, Carolina Arbeláez et.al., [2408.03364v1](http://arxiv.org/abs/2408.03364v1)\n\n Neutrino masses and dark matter (DM) might have a common origin. The scotogenic model can be considered the proto-type model realizing this idea, but many other variants exist. In this paper we explore the phenomemology of a particular DM neutrino mass model, containing a triplet scalar. We calculate the relic density and check for constraints from direct detection experiments. The parameter space of the model, allowed by these constraints, contains typically a long-lived or quasi-stable doubly charged scalar, that can be searched for at the LHC. We reinterpret existing searches to derive limits on the masses of the scalars of the model and estimate future sensitivities in the high-luminosity phase of the LHC. The searches we discuss can serve to constrain also many other 1-loop neutrino mass models.\n\n", "2408.02877": "2024-08-06, **First Measurement of Solar $^8$B Neutrinos via Coherent Elastic Neutrino-Nucleus Scattering with XENONnT**, E. Aprile et.al., [2408.02877v1](http://arxiv.org/abs/2408.02877v1)\n\n We present the first measurement of nuclear recoils from solar $^8$B neutrinos via coherent elastic neutrino-nucleus scattering with the XENONnT dark matter experiment. The central detector of XENONnT is a low-background, two-phase time projection chamber with a 5.9\\,t sensitive liquid xenon target. A blind analysis with an exposure of 3.51\\,t$\\times$y resulted in 37 observed events above 0.5\\,keV, with ($26.4^{+1.4}\\_{-1.3}$) events expected from backgrounds. The background-only hypothesis is rejected with a statistical significance of 2.73\\,$\\sigma$. The measured $^8$B solar neutrino flux of $(4.7\\_{-2.3}^{+3.6})\\times 10^6\\,\\mathrm{cm}^{-2}\\mathrm{s}^{-1}$ is consistent with results from dedicated solar neutrino experiments. The measured neutrino flux-weighted CE$\\nu$NS cross-section on Xe of $(1.1^{+0.8}\\_{-0.5})\\times10^{-39}\\,\\mathrm{cm}^2$ is consistent with the Standard Model prediction. This is the first direct measurement of nuclear recoils from solar neutrinos with a dark matter detector.\n\n"}, "dark matter": {"2408.03861": "2024-08-07, **A tunable photonic band gap resonator for axion dark matter searches**, Samantha M. Lewis et.al., [2408.03861v1](http://arxiv.org/abs/2408.03861v1)\n\n Axions are a well-motivated dark matter candidate particle. Haloscopes aim to detect axions in the galactic halo by measuring the photon signal resulting from axions interacting with a strong magnetic field. Existing haloscopes are primarily targeting axion masses which produce microwave-range photons and rely on microwave resonators to enhance the signal power. Only a limited subset of resonator modes are useful for this process, and current cylindrical-style cavities suffer from mode mixing and crowding from other fundamental modes. The majority of these modes can be eliminated by using photonic band gap (PBG) resonators. The band gap behavior of these structures allows for a resonator with mode selectivity based on frequency. We present results from the first tunable PBG resonator, a proof-of-concept design with a footprint compatible with axion haloscopes. We have thoroughly characterized the tuning range of two versions of the structure and report the successful confinement of the operating TM$\\_{010}$ mode and the elimination of all TE modes within the tuning range.\n\n", "2408.03793": "2024-08-07, **Violations of energy conservation in Horava-Lifshitz gravity: a new ingredient in the dark matter puzzle**, Paolo M Bassani et.al., [2408.03793v1](http://arxiv.org/abs/2408.03793v1)\n\n We investigate the interplay between Horava-Lifshitz (HL) gravity and more general theories where the local Hamiltonian constraint is lost, for example due to the time variability of the Lagrangian (e.g. via its parameters) where time is defined on a foliation according to a prescription mimicking Lambda and 4-volume time in unimodualr gravity. In one direction we subject the multitude of parameters in HL to this variability game, mimicking RG flow in a cosmological setting. In the opposite direction, we examine the evolution on the left-over Hamiltonian should the HL algebra of constraints be still applicable, rather than the algebra of General Relativity being restored. Within the projectable theory, the non-vanishing Hamiltonian can be reinterpreted as a pressureless fluid. Unlike in theories with similar variability based on GR, violations of stress-energy tensor conservation persist, and these are computed here for the full class of projectable HL models. The phenomenological implications are examined: remarkably the driven solutions resulting from these energy conservation violations have the correct profiles to flatten the galactic rotation curves in a toy model. Unfortunately this interesting remark does not survive closer scrutiny: neither is the driven solution an attractor, nor does it have the right sign for acceptable values of the HL parameter, certainly for the simplest terms examined. Yet, in this paper we have established a new ingredient in the dark matter mystery, the possibility of energy conservation violation.\n\n", "2408.03780": "2024-08-07, **Feasibility of dark matter admixed neutron star based on recent observational constraints**, Prashant Thakur et.al., [2408.03780v1](http://arxiv.org/abs/2408.03780v1)\n\n The equation of state (EOS) for neutron stars is modeled using the Relativistic Mean Field (RMF) approach with a mesonic nonlinear (NL) interaction, a modified sigma cut potential (NL-$\\sigma$ cut), and the influences of dark matter in the NL (NL DM). Using a Bayesian analysis framework, we evaluate the plausibility and impact of each scenario. Experimental constraints on the general properties of finite nuclei and heavy ion collisions, along with astrophysical observational data on neutron star radii and tidal deformation, have been taken into account. It was shown that all models, including the PREX-II data, were less favored, indicating that this experimental data seemed to be in tension with the other constraints included in the inference procedure, and were incompatible with chiral effective field theoretical calculations of pure neutron matter. Considering the models with no PREX-II constraints, we find the model NL-$\\sigma$ cut with the largest Bayes evidence, indicating that the constraints considered favor the stiffening of the EOS at large densities. Conversely, the neutron star with a dark matter component is the least favorable case in light of recent observational constraints, among different scenarios considered here. The $f$ and $p$ modes were calculated within the Cowling approximation, and it can be seen that $f$ modes are sensitive to the EOS. An analysis of the slopes of the mass-radius curves and $f$-mode mass curves has indicated that these quantities may help distinguish the different scenarios.We also analyzed the impact of new PSR J0437-4715 measurements on neutron star mass-radius estimates, noting a $\\sim$ 0.2 km reduction in the 90\\% CI upper boundary across all models and a significant Bayes evidence decrease, indicating potential conflicts with previous data or the necessity for more adaptable models.\n\n", "2408.03759": "2024-08-07, **Deep Inelastic Scattering in the Capture of Dark Matter by Neutron Stars**, Liangliang Su et.al., [2408.03759v1](http://arxiv.org/abs/2408.03759v1)\n\n Due to the dense environment, neutron stars (NSs) can serve as an ideal laboratory for studying the interactions between dark matter (DM) and ordinary matter. In the process of DM capture, deep inelastic scattering may dominate over elastic scattering, especially for the DM with a large momentum transfer. In this work, we calculate DM-nucleon deep inelastic scattering via a vector mediator and estimate its contribution to the capture rate. Using the surface temperature of the NSs, we derive the exclusion limits for the DM-nucleon scattering cross section in the mass range, $1~{\\rm GeV}<m\\_{\\chi}< 10^{5}~{\\rm GeV}$. We find the bounds for DM with the mass $\\gtrsim$ 1 GeV can be changed several times after including the deep inelastic scattering contribution.\n\n", "2408.03656": "2024-08-07, **Exploring the Singlino-dominated Thermal Neutralino Dark Matter in the $Z_3$ invariant NMSSM**, Amit Adhikary et.al., [2408.03656v1](http://arxiv.org/abs/2408.03656v1)\n\n We examine the parameter space of the Next to Minimal Supersymmetric Standard Model (NMSSM) with Singlino-dominated neutralino $\\widetilde\\chi\\_1^0$ as the lightest supersymmetric particle (LSP). Our study focuses on identifying the regions within this parameter space that produce a thermal relic abundance of $\\widetilde\\chi\\_1^0$ smaller than the observed cold dark matter relic density while remaining consistent with constraints from LEP measurements, low-energy experiments, Higgs measurements, LHC data, and dark matter direct detection experiments. We identify the dominant annihilation modes of the LSP neutralino across varying LSP mass ranges $\\sim \\mathcal{O}(1)-\\mathcal{O}(10^{3})~$GeV. Furthermore, we conduct a benchmark study to assess the production rates of triple-boson final states emerging from direct electroweakino pair production at the LHC. Drawing insights from these findings, we perform a detailed collider analysis to explore the future potential of probing the triple-boson final states involving a light Higgs boson at the high-luminosity LHC (HL-LHC).\n\n", "2408.03444": "2024-08-06, **Superconducting Resonator Development for the Axion Dark Matter eXperiment**, Thomas Braine et.al., [2408.03444v1](http://arxiv.org/abs/2408.03444v1)\n\n The Axion Dark Matter eXperiment (ADMX) is the first axion haloscope search to reach DFSZ sensitivity in any mass range for the QCD axion. The QCD axion is a well-motivated dark matter candidate that additionally solves the strong CP problem in nuclear physics. A haloscope has three necessary components; a very strong external magnet, a high Q cavity resonator embedded in this field, and an ultra-sensitive RF read-out system. This dissertation mainly reports on the future development of the resonators for ADMX, specifically superconducting RF (SRF) cavities. It starts with an overview of axions, haloscopes, and the current ADMX experiment, followed by the work done at Lawrence Livermore National Laboratory (LLNL) on SRF cavities, and finally the preliminary results of the ADMX \"hybrid\" superconducting-copper Sidecar cavity in run 1D.\n\n", "2408.03375": "2024-08-06, **The active role of co-evolving haloes in stellar bar formation**, Matthew Frosst et.al., [2408.03375v1](http://arxiv.org/abs/2408.03375v1)\n\n We use idealised N-body simulations of equilibrium discs in live and static haloes to study how dark matter co-evolution impacts the assembly of stellar particles into a bar and the halo response. Initial conditions correspond to a marginally unstable disc according to commonly used disc stability criteria, and are evolved for the equivalent of about 150 disc dynamical times (10Gyr). An extensive convergence study ensures accurate modelling of the bar formation process. Live haloes lead to the formation of a strong bar, but the same disc remains unbarred when evolved in a static halo. Neither seeded disc instabilities, nor longer (60Gyr) simulations result in the formation of a bar when the halo is static. When the live halo is replaced with a static analogue at later times the previously robust bar slowly dissipates, suggesting: (1) the co-evolution of the disc and halo is critical for the assembly and long-term survival of bars in marginally unstable discs; and (2) global disc stability criteria must be modified for discs in the presence of live haloes. In our live halo runs, a \"dark bar\" grows synchronously with the stellar bar. Processes that inhibit the transfer of angular momentum between the halo and disc may stabilise a galaxy against bar formation, and can lead to the dissolution of the bar itself. This raises further questions about the puzzling stability of observed discs that are marginally unstable, but unbarred.\n\n", "2408.03370": "2024-08-06, **Adiabatic Conversion of ALPs into Dark Photon Dark Matter**, Edward Broadberry et.al., [2408.03370v1](http://arxiv.org/abs/2408.03370v1)\n\n We introduce a mechanism by which a misaligned ALP can be dynamically converted into a dark photon in the presence of a background magnetic field. An abundance of non-relativistic ALPs will convert to dark photons with momentum of order the inhomogeneities in the background field; therefore a highly homogeneous field will produce non-relativistic dark photons without relying on any redshifting of their momenta. Taking hidden sector magnetic fields produced by a first order phase transition, the mechanism can reproduce the relic abundance of dark matter for a wide range of dark photon masses down to $10^{-13}$ eV.\n\n", "2408.03363": "2024-08-06, **Proper Time Observables of General Gravitational Perturbations in Laser Interferometry-based Gravitational Wave Detectors**, Vincent S. H. Lee et.al., [2408.03363v1](http://arxiv.org/abs/2408.03363v1)\n\n We present an explicitly gauge-invariant observable of {\\em any} general gravitational perturbation, $h\\_{\\mu\\nu}$ (\\textit{not} necessarily due to gravitational waves (GWs)), in a laser interferometry-based GW detector, identifying the signature as the proper time elapsed of the beamsplitter observer, between two events: when a photon passes through the beamsplitter, and when the same photon returns to the beamsplitter after traveling through the interferometer arm and reflecting off the far mirror. Our formalism applies to simple Michelson interferometers and can be generalized to more advanced setups. We demonstrate that the proper time observable for a plane GW is equivalent to the detector strain commonly used by the GW community, though now the common framework can be easily generalized for other types of signals, such as dark matter clumps or spacetime fluctuations from quantum gravity. We provide a simple recipe for computing the proper time observable for a general metric perturbation in linearized gravity and explicitly show that it is invariant under diffeomorphisms of the perturbation, as any physical observable should be.\n\n", "2408.03276": "2024-08-06, **Minding the gap: testing natural anomaly-mediated SUSY breaking at high luminosity LHC**, Howard Baer et.al., [2408.03276v1](http://arxiv.org/abs/2408.03276v1)\n\n While the minimal anomaly-mediated SUSY breaking model (mAMSB) seems ruled out by constraints on Higgs mass, naturalness and wino dark matter, a slightly generalized version dubbed natural AMSB (nAMSB) remains both viable and compelling. Like mAMSB, nAMSB features winos as the lightest gauginos, but unlike mAMSB, nAMSB allows a small mu parameter so that higgsinos are the lightest of electroweakinos (EWinos). nAMSB spectra depend on the input value of gravitino mass m\\_{3/2}, where the lower range of m\\_{3/2} is excluded by LHC gluino pair searches while a higher m\\_{3/2} band is excluded by LHC limits on wino pair production followed by boosted hadronic wino decays. A remaining intermediate gap in m\\_{3/2} values remains allowed by present LHC searches, but appears to be completely explorable by high luminosity ugrades of LHC (HL-LHC). We explore a variety of compelling discovery channels that may allow one to close the intermediate gap in m\\_{3/2} values: 1. same-sign diboson +MET (SSdB) production arising from wino pair production, leading to same-sign dileptons plus MET, 2. trilepton production arising from wino pair production and 3. soft dilepton plus jet events from higgsino pair production, 4. top-squark pair production. From our signal-to-background analysis along a nAMSB model line, we expect HL-LHC to either discover or rule out the nAMSB model with 3000 fb^{-1} of integrated luminosity.\n\n", "2408.03128": "2024-08-06, **Evolution of Star Cluster Within Galaxy using Self-consistent Hybrid Hydro/N-body Simulation**, Yongseok Jo et.al., [2408.03128v1](http://arxiv.org/abs/2408.03128v1)\n\n We introduce a GPU-accelerated hybrid hydro/N-body code (Enzo-N) designed to address the challenges of concurrently simulating star clusters and their parent galaxies. This task has been exceedingly challenging, primarily due to the considerable computational time required, which stems from the substantial scale difference between galaxies (~ 0.1 Mpc) and star clusters (~ pc). Yet, this significant scale separation means that particles within star clusters perceive those outside the star cluster in a semi-stationary state. By leveraging this aspect, we integrate the direct N-body code (Nbody6++GPU) into the cosmological (magneto-)hydrodynamic code (Enzo) through the utilization of the semi-stationary background acceleration approximation. We solve the dynamics of particles within star clusters using the direct N-body solver with regularization for few-body interactions, while evolving particles outside -- dark matter, gas, and stars -- using the particle-mesh gravity solver and hydrodynamic methods. We demonstrate that Enzo-N successfully simulates the co-evolution of star clusters and their parent galaxies, capturing phenomena such as core collapse of the star cluster and tidal stripping due to galactic tides. This comprehensive framework opens up new possibilities for studying the evolution of star clusters within galaxies, offering insights that were previously inaccessible.\n\n", "2408.03036": "2024-08-06, **Modeling and measuring the anisotropic halo 3-point correlation function: a coordinated study**, Antonio Farina et.al., [2408.03036v1](http://arxiv.org/abs/2408.03036v1)\n\n Ongoing spectroscopic galaxy surveys like DESI (arXiv:1611.00037, arXiv:1611.00036) and Euclid (arXiv:2405.13491) will cover unprecedented volumes with a number of objects large enough to effectively probe clustering anisotropies through higher-order statistics. In this work, we present an original and efficient implementation of both a model for the multipole moments of the anisotropic 3-point correlation function (3PCF) and for their estimator. To assess the adequacy of our model, we have predicted the anisotropic 3PCF for a set of dark matter halos at redshift $z = 1$ and compared our prediction with the 3PCF measurement obtained by applying our estimator to a suite of 298 N-body + 3000 approximate mock halo catalogs at the same redshift. The use of the anisotropic component of the 3PCF effectively breaks the degeneracy between the growth rate $f$ and the linear bias $b\\_1$, allowing us to obtain unbiased estimates for both parameters from a Euclid-like survey. A joint, full anisotropic, 2 and 3-point correlation analysis would also allow us to measure the clustering amplitude $\\sigma\\_8$ along with $f$ and $b\\_1$ with a precision of approximately 17%, and to effectively constrain all galaxy biasing parameters of the model. However, these results largely exploit information from the isotropic part of the 3PCF signal. The addition of the anisotropic multipoles tightens parameter estimates by just 5% at most. We argue that this modest improvement likely reflects the use of a simplified cosmological model with relatively few free parameters. The 3PCF anisotropic multipoles will prove useful in reducing the impact of projection effects that affect high-dimensional cosmological analyses. To support this conjecture, we provide an example in which an additional source of anisotropy, the Alcock-Paczynski effect, is added to the system.\n\n", "2408.03004": "2024-08-06, **Reconciling Cosmological Tensions with Inelastic Dark Matter and Dark Radiation in a $\\boldsymbol{U(1)_D}$ Framework**, Wonsub Cho et.al., [2408.03004v1](http://arxiv.org/abs/2408.03004v1)\n\n We propose a novel and comprehensive particle physics framework that addresses multiple cosmological tensions observed in recent measurements of the Hubble parameter, $S\\_8$, and Lyman-$\\alpha$ forest data. Our model, termed `{\\bf SIDR+$\\boldsymbol{z\\_t}$}' (Self Interacting Dark Radiation with transition redshift), is based on an inelastic dark matter (IDM) scenario coupled with dark radiation, governed by a $U(1)\\_D$ gauge symmetry. This framework naturally incorporates cold dark matter (DM), SIDR, and the interactions between these components. The fluid-like behavior of the dark radiation component, effectively mitigates both the Hubble and $S\\_8$ tensions by suppressing free-streaming effects. Simultaneously, the interacting DM-DR system attenuates the matter power spectrum at small scales, potentially reconciling discrepancies in Lyman-$\\alpha$ (Ly-$\\alpha$) observations. The inelastic nature of DM provides a distinct temperature dependence for the DM-DR interaction rate determined by the mass-splitting between the inelastic dark fermions which is crucial for resolving the Ly-$\\alpha$ discrepancies. We present a cosmologically consistent analysis of the model by solving the relevant Boltzmann equations to obtain the energy density and number density evolution of different species of the model. The DR undergoes two ``steps\" of increased energy density when the heavier dark species freeze out and become non-relativistic, transferring their entropy to the dark radiation and enhancing $\\Delta N{\\rm eff}$. The analysis showcases the model's potential to uphold the Big Bang Nucleosynthesis (BBN) prediction of $\\Delta N\\_{\\rm eff}$ but dominantly producing additional contributions prior to recombination, while simultaneously achieving correct relic density of DM though an hybrid of freeze-in and non-thermal production.\n\n"}, "supernova": {"2408.03916": "2024-08-07, **Building spectral templates and reconstructing parameters for core collapse supernovae with CASTOR**, Andrea Simongini et.al., [2408.03916v1](http://arxiv.org/abs/2408.03916v1)\n\n The future of time-domain optical astronomy relies on the development of techniques and software capable of handling a rising amount of data and gradually complementing, or replacing if necessary, real observations. Next generation surveys, like the Large Synoptic Survey Telescope (LSST), will open the door to the new era of optical astrophysics, creating, at the same time, a deficiency in spectroscopic data necessary to confirm the nature of each event and to fully recover the parametric space. In this framework, we developed Core collApse Supernovae parameTers estimatOR (CASTOR), a novel software for data analysis. CASTOR combines Gaussian Process and other Machine Learning techniques to build time-series templates of synthetic spectra and to estimate parameters of core collapse supernovae for which only multi-band photometry is available. Techniques to build templates are fully data driven and non-parametric through empirical and robust models, and rely on the direct comparison with a training set of 111 core collapse supernovae from the literature. Furthermore, CASTOR employees the real photometric data and the reconstructed synthetic spectra of an event to estimate parameters that belong to the supernova ejecta, to the stellar progenitor and to the event itself, in a rapid and user-friendly framework. In this work we provide a demonstration of how CASTOR works, studying available data from SN2015ap and comparing our results with those available in literature.\n\n", "2408.03902": "2024-08-07, **HOLISMOKES -- XIV. Time-delay and differential dust extinction determination with lensed type II supernova color curves**, J. Grupa et.al., [2408.03902v1](http://arxiv.org/abs/2408.03902v1)\n\n The Hubble tension is one of the most relevant unsolved problems in cosmology today. Strongly gravitationally lensed transient objects, such as strongly lensed supernovae, are an independent and competitive probe that can be used to determine the Hubble constant. In this context, the time delay between different images of lensed supernovae is a key ingredient. We present a method, to retrieve time delays and the amount of differential dust extinction between multiple images of lensed type IIP supernovae through their color curves, which display a kink in the time evolution. With multiple realistic mock color curves based on an observed unlensed supernova from the Carnegie Supernova Project, we demonstrate that we can retrieve the time delay with uncertainties of $\\pm$1.0 days for light curves with 2-day cadence and 35% missing data due to weather losses. The differential dust extinction is more susceptible to uncertainties, because it depends on imposing the correct extinction law. Further we also investigate the kink structure in the color curves for different rest-frame wavelength bands, particularly rest-frame UV light curves from SWIFT, finding sufficiently strong kinks for our method to work for typical lensed SN redshifts that would redshift the kink feature to optical wavelengths. With the upcoming Rubin Observatory Legacy Survey of Space and Time, hundreds of strongly lensed supernovae will be detected and our new method for lensed SN IIP is readily applicable to provide delays.\n\n", "2408.03875": "2024-08-07, **Effects of a local physics change on the SH0ES determination of $H_0$**, Ruchika et.al., [2408.03875v1](http://arxiv.org/abs/2408.03875v1)\n\n The Hubble tension, a significant discrepancy between the Hubble constant ($H\\_0$) values derived from early-time (Cosmic Microwave Background and Baryon Acoustic Oscillations) and late-time (Cepheid-calibrated Type Ia Supernovae) measurements, remains a major challenge in cosmology. Traditional attempts to resolve this tension have struggled to maintain consistency with dynamical and geometrical probes at redshifts $0.01 < z \\lesssim 2.5$. We explore a novel model introducing new degrees of freedom in local physical laws affecting calibrators like Cepheids and Type Ia Supernovae within a distance of $d \\lesssim 50$ Mpc ($z \\lesssim 0.01$). Specifically, we incorporate a gravitational transition causing a change in the gravitational constant ($G$) at a specific distance, affecting the Cepheid Period-Luminosity Relation (PLR) and the absolute magnitude of SNe Ia. We verify the inverse scaling of SN luminosity $L$ with Chandrasekhar Mass $M\\_C$ in a changed $G$ scenario as predicted using a semi-analytical model in a recent theoretical study \\cite{Wright2018}. Fixing $\\Delta G/G \\approx 0.04$, our model naturally resolves the Hubble tension, yielding a best-fit $H\\_0$ value consistent with the Planck measurement, even without using Planck data. This approach suggests a potential resolution to the Hubble tension by aligning $H\\_0$ with high-redshift CMB measurements.\n\n", "2408.03749": "2024-08-07, **Suppression of the type Ia supernova host galaxy step in the outer regions of galaxies**, M. Toy et.al., [2408.03749v1](http://arxiv.org/abs/2408.03749v1)\n\n Using 1533 type Ia supernovae (SNe Ia) from the five-year sample of the Dark Energy Survey (DES), we investigate the effects of projected galactocentric separation between the SNe and their host galaxies on their light curves and standardization. We show, for the first time, that the difference in SN Ia post-standardization brightnesses between high and low-mass hosts reduces from $0.078\\pm0.011$ mag in the full sample to $0.036 \\pm 0.018$ mag for SNe Ia located in the outer regions of their host galaxies, while increasing to $0.100 \\pm 0.014$ mag for SNe in the inner regions. In these inner regions, the step can be reduced (but not removed) using a model where the $R\\_V$ of dust along the line-of-sight to the SN changes as a function of galaxy properties. To explain the remaining difference, we use the distributions of the SN Ia stretch parameter to test whether the inferred age of SN progenitors are more varied in the inner regions of galaxies. We find that the proportion of high-stretch SNe Ia in red (older) environments is more prominent in outer regions and that the outer regions stretch distributions are overall more homogeneous compared to inner regions, but conclude that this effect cannot explain the reduction in significance of any Hubble residual step in outer regions. We conclude that the standardized distances of SNe Ia located in the outer regions of galaxies are less affected by their global host galaxy properties than those in the inner regions.\n\n", "2408.03731": "2024-08-07, **The $R$-Process Alliance: Fifth Data Release from the Search for $R$-Process-Enhanced Metal-poor Stars in the Galactic Halo with the GTC**, Avrajit Bandyopadhyay et.al., [2408.03731v1](http://arxiv.org/abs/2408.03731v1)\n\n Understanding the abundance pattern of metal-poor stars and the production of heavy elements through various nucleosynthesis processes offers crucial insights into the chemical evolution of the Milky Way, revealing primary sites and major sources of rapid neutron-capture process ($r$-process) material in the Universe. In this fifth data release from the $R$-Process Alliance, we present the detailed chemical abundances of 41 faint (down to V = 15.8) and extremely metal-poor (down to [Fe/H] = -3.3) halo stars selected from the $R$-Process Alliance (RPA). We obtained high-resolution spectra for these objects with the HORuS spectrograph on the Gran Telescopio Canarias. We measure the abundances of light, alpha, Fe-peak, and neutron-capture elements. We report the discovery of five CEMP, one limited-$r$, three $r$-I, and four $r$-II stars, and six Mg-poor stars. We also identify one star of a possible globular cluster origin at an extremely low metallicity at [Fe/H] = -3.0. This adds to the growing evidence of a lower limit metallicity floor for globular cluster abundances. We use the abundances of Fe-peak elements and the alpha-elements to investigate the contributions from different nucleosynthesis channels in the progenitor supernovae. We find the distribution of [Mg/Eu] as a function of [Fe/H] to have different enrichment levels, indicating different possible pathways and sites of their production. We also reveal differences in the trends of the neutron-capture element abundances of Sr, Ba, and Eu of various r-I and r-II stars from the RPA data releases, which provide constraints on their nucleosynthesis sites and subsequent evolution.\n\n", "2408.03725": "2024-08-07, **Two novel $f(Q)$ models**, Xianfu Su et.al., [2408.03725v1](http://arxiv.org/abs/2408.03725v1)\n\n We propose two novel models in the framework of $f(Q)$ gravity to explain our accelerated universe, namely the exponential $f(Q)\\_{EXP}$ model and the hyperbolic tangent $f(Q)\\_{HT}$ model. The current cosmological electromagnetic observations including the cosmic microwave background anisotropies (CMB), the baryon acoustic oscillations(BAO), the type Ia supernovae (SN) and the direct measurements of H(z), combined with the simulated gravitational-wave data are used to constrain the $f(Q)$ models. We find that the Hubble tension can be significantly alleviated to $1.40\\sigma$ level in the $f(Q)\\_{EXP}$ model. The fitting $\\chi^2$ of the $f(Q)\\_{HT}$ model is $9.75\\sigma$ poorer than that of the $f(Q)\\_{EXP}$ model, implying the $f(Q)\\_{HT}$ model would be excluded by future gravitational-wave observation.\n\n", "2408.03660": "2024-08-07, **An improved Tully-Fisher estimate of $H_0$**, Paula Boubel et.al., [2408.03660v1](http://arxiv.org/abs/2408.03660v1)\n\n We propose an improved comprehensive method for determining the Hubble constant ($H\\_0$) using the Tully-Fisher relation. By fitting a peculiar velocity model in conjunction with the Tully-Fisher relation, all available data can be used to derive self-consistent Tully-Fisher parameters. In comparison to previous approaches, our method offers several improvements: it can be readily generalised to different forms of the Tully-Fisher relation and its intrinsic scatter; it uses a peculiar velocity model to predict distances more accurately; it can account for all selection effects; it uses the entire dataset to fit the Tully-Fisher relation; and it is fully self-consistent. The Tully-Fisher relation zero-point is calibrated using the subset of galaxies with distances from absolute distance indicators. We demonstrate this method on the Cosmicflows-4 catalogue $i$-band and $W1$-band Tully-Fisher samples and show that the uncertainties from fitting the Tully-Fisher relation amount to only 0.2 km s$^{-1}$Mpc$^{-1}$. Using all available absolute distance calibrators, we obtain $H\\_0=73.3$ $\\pm$ 2.1 (stat) $\\pm$ 3.5 (sys) km s$^{-1}$Mpc$^{-1}$, where the statistical uncertainty is dominated by the small number of galaxies with absolute distance estimates. The substantial systematic uncertainty reflects inconsistencies between various zero-point calibrations of the Cepheid period-luminosity relation, the tip of the red giant branch standard candle, and the Type Ia supernova standard candle. However, given a reliable set of absolute distance calibrators, our method promises enhanced precision in $H\\_0$ measurements from large new Tully-Fisher samples such as the WALLABY survey.\n\n", "2408.03474": "2024-08-06, **The Chicago-Carnegie Hubble Program: The JWST J-region Asymptotic Giant Branch (JAGB) Extragalactic Distance Scale**, Abigail J. Lee et.al., [2408.03474v1](http://arxiv.org/abs/2408.03474v1)\n\n The J-region asymptotic giant branch (JAGB) method is a new standard candle based on the constant luminosities of carbon-rich asymptotic giant branch stars in the J band. The JAGB method is independent of the Cepheid and TRGB distance indicators. Therefore, we can leverage it to both cross-check Cepheid and TRGB distances for systematic errors and use it to measure an independent local Hubble constant. The JAGB method also boasts a number of advantages in measuring distances relative to the TRGB and Cepheids, several of which are especially amplified when combined with JWST's revolutionary resolving power. First, JAGB stars are 1 mag brighter in the NIR than the TRGB, and can be discovered from single-epoch NIR photometry unlike Cepheids which require congruent optical imaging in at least 12 epochs. Thus, JAGB stars can be used to measure significantly farther distances than both the TRGB stars and Cepheids using the same amount of observing time. Further advantages include: JAGB stars are easily identified solely via their colors and magnitudes, dust extinction is reduced in near-infrared observations, and JAGB stars are ubiquitous in all galaxies with intermediate-age populations. In this paper, we present a novel algorithm that identifies the optimal location in a galaxy for applying the JAGB method, so as to minimize effects from crowding. We then deploy this algorithm in JWST NIRCam imaging of seven SN Ia host galaxies to measure their JAGB distances, undertaking a completely blind analysis. The zero-point of this JAGB distance scale is set in the water mega-maser galaxy NGC 4258. In our CCHP overview paper Freedman et al. (2024), we apply the JAGB distances measured in this paper to the Carnegie Supernova Program (CSP) SNe Ia sample, measuring a Hubble constant of H0 = 67.96 +/- 1.85 (stat) km/s/Mpc.\n\n", "2408.03417": "2024-08-06, **Teleparallel Gravity and Quintessence: The Role of Nonminimal Boundary Couplings**, S. A. Kadam et.al., [2408.03417v1](http://arxiv.org/abs/2408.03417v1)\n\n In this paper, we have outlined the development of an autonomous dynamical system within a general scalar-tensor gravity framework. This framework encompasses the overall structure of the non-minimally coupled scalar field functions for both the torsion scalar ($T$) and the boundary term ($B$). We have examined three well-motivated forms of potential functions and constrained the model parameters through dynamical system analysis. This analysis has played a crucial role in identifying cosmologically viable models. We have analysed the behaviour of dynamical parameters such as equation-of-state parameters for dark energy and the total, as well as all the standard density parameters for radiation, matter, and dark energy to assess their compatibility with current observational data. The phase space diagrams are presented to support the stability conditions of the corresponding critical points. The Universe is apparent in its late-time cosmic acceleration phase via the dark energy-dominated critical points. Additionally, we compare our findings with the most prevailing $\\Lambda$CDM model. The outcomes are further inspected using the cosmological data sets of Supernovae Ia and the Hubble rate H(z).\n\n", "2408.03321": "2024-08-06, **Chasing cosmic inflation: constraints for inflationary models and reheating insights**, Mario Ballardini et.al., [2408.03321v1](http://arxiv.org/abs/2408.03321v1)\n\n We investigate the impact of different choice of prior's range for the reheating epoch on cosmic inflation parameter inference in light of cosmic microwave background (CMB) anisotropy measurements from the Planck 2018 legacy release in combination with BICEP/Keck Array 2018 data and additional late-time cosmological observations such as uncalibrated Type Ia Supernovae from the Pantheon catalogue, baryon acoustic oscillations and redshift space distortions from SDSS/BOSS/eBOSS. Here, we explore in particular the implications for the combination of reheating and inflationary-model parameter space considering $R+R^2$ inflation and a broad class of $\\alpha$-attractor and D-brane models. These inflationary models completely cover the $n\\_s$-$r$ parameter space allowed by Planck and BICEP/Keck data and represent good targets for future CMB and large-scale structure experiments. We perform a Bayesian model comparison of inflationary models, taking into account the reheating uncertainties.\n\n", "2408.03229": "2024-08-06, **Quintessential early dark energy**, Sk. Sohail et.al., [2408.03229v1](http://arxiv.org/abs/2408.03229v1)\n\n In this paper, we introduce a unified model of early and late dark energy. We call it {\\it quintessential early dark energy} model in which early and late dark energy are explained by a single scalar field. In other words two different energy scales are related by a single scalar field potential. To achieve this we introduce the modified steep exponential potential. This potential has a hilltop nature during the early time which consists of a flat region followed by a steep region. This nature of the potential plays a crucial role in achieving early dark energy solution. During recent time, the potential can almost mimic the cosmological constant which can result into late time acceleration. We also constrain and compare the models for steep exponential, modified steep exponential, axionlike and power law potentials by using the available background cosmological data from CMB, BAO (including DESI DR1 2024), supernovae (Pantheon$+$, DESY5 and Union3) and Hubble parameter measurements. The maximum improvement we get in the present value of Hubble parameter compared to the standard $\\Lambda$CDM model is for the axionlike potential. For other potentials the constraints are similar to the $\\Lambda$CDM model.\n\n", "2408.03048": "2024-08-06, **Exploring the range of impacts of helium in the spectra of double detonation models for Type Ia supernovae**, F. P. Callan et.al., [2408.03048v1](http://arxiv.org/abs/2408.03048v1)\n\n In the double detonation scenario the ignition of a surface He detonation on a sub-Chandrasekhar mass white dwarf leads to a secondary core detonation. Double detonation models have shown promise for explaining Type Ia supernovae (SNe Ia) with a variety of luminosities. A key feature of such models is unburnt He in the ejecta, which can show significant variation in both its mass and velocity distribution. Many previous radiative transfer simulations for double detonation models have neglected treatment of non-thermal ionization and excitation, preventing them from robustly assessing whether He spectral features are expected to form. We present a non local thermodynamic equilibrium radiative transfer simulation, including treatment for non-thermal electrons, for a double detonation model with a modest mass of He (${\\sim}$0.04 M${\\odot}$) ejected at reasonably low velocities (${\\sim}$12000$\\,\\mathrm{km}\\,\\mathrm{s}^{-1}$). Despite our simulation predicting no clear optical He features, a strong and persistent He I 10830$\\,\\r{A}$ absorption feature forms that is significantly blended with the spectral contribution of Mg II 10927$\\,\\r{A}$. For some normal SNe Ia the Mg feature shows an extended blue wing, previously attributed to C I, however the simulated He feature shows its strongest absorption at wavelengths consistent with this wing. We therefore suggest this extended wing is instead a spectral signature of He. The He feature predicted by this particular model is too strong and persistent to be consistent with normal SNe Ia, however, this motivates further work to use this observable signature to test the parameter space for double detonation models.\n\n", "2408.03042": "2024-08-06, **A unified transition mechanism from shock to detonation waves**, Hao Yan et.al., [2408.03042v1](http://arxiv.org/abs/2408.03042v1)\n\n The transition of shock-to-detonation is of great significance for the investigation of supernova formation, disaster prevention and supersonic propulsion technology. In this paper, the influence Equation of shock-to-detonation transition is summarized for the oblique detonation problem from aerodynamic analysis. The Equation integrates the effects of parameters such as chemical reaction, shock intensity and wall conditions, which quantitatively explains the physical mechanism of shock-to-detonation transition in the form of mathematical expression. Comparison with numerical simulation results as well as their gradients verified the reliability of the influence Equation. Further, the influence Equation can also be used to predict the critical conditions for the transition from shock to detonation transition form. In addition to oblique detonation, the influence Equation is compatible with the deflagration-to-detonation problem for normal detonation, which shows a wide applicability.\n\n", "2408.03038": "2024-08-06, **A new code for low-resolution spectral identification of white dwarf binary candidates**, Genghao Liu et.al., [2408.03038v1](http://arxiv.org/abs/2408.03038v1)\n\n Close white dwarf binaries (CWDBs) are considered to be progenitors of several exotic astronomical phenomena (e.g., type Ia supernovae, cataclysmic variables). These violent events are broadly used in studies of general relativity and cosmology. However, obtaining precise stellar parameter measurements for both components of CWDBs is a challenging task given their low luminosities, swift time variation, and complex orbits. High-resolution spectra (R$> 20 000$) are preferred but expensive, resulting in a sample size that is insufficient for robust population study. To release the full potential of the less expensive low-resolution spectroscopic surveys, and thus greatly expand the CWDB sample size, it is necessary to develop a robust pipeline for spectra decomposition and analysis. We used an artificial neural network (ANN) to build spectrum generators for DA/DB white dwarfs and main-sequence stars. The best-fit stellar parameters were obtained by finding the least $\\chi^2$ solution to these feature lines and the continuum simultaneously. We demonstrate the reliability of our code with two well-studied CWDBs, WD 1534+503 and PG 1224+309. We also estimate the stellar parameters of 14 newly identified CWDB candidates, most of which are fitted with double component models for the first time. Our estimates agree with previous results for the common stars and follow the statistical distribution in the literature. The application of our code to a large volume of white dwarf binary candidates will offer important statistic samples to stellar evolution studies and future gravitational wave monitoring.\n\n"}}