{"neutrino": {"2311.03315": "2023-11-06, **Gravitational memory signal from neutrino self-interactions in supernova**, Soumya Bhattacharya et.al., [2311.03315v1](http://arxiv.org/abs/2311.03315v1)\n\n Neutrinos with large self-interactions, arising from exchange of light scalars or vectors with mass $M\\_\\phi\\simeq 10{\\rm MeV}$, can play a useful role in cosmology for structure formation and solving the Hubble tension. It has been proposed that large self-interactions of neutrinos may change the observed properties of supernova like the neutrino luminosity or the duration of the neutrino burst. In this paper, we study the gravitational wave memory signal arising from supernova neutrinos. Our results reveal that memory signal for self-interacting neutrinos are weaker than free-streaming neutrinos in the high frequency range. Implications for detecting and differentiating between such signals for planned space-borne detectors, DECIGO and BBO, are also discussed.\n\n", "2311.03291": "2023-11-06, **DISCO-DJ I: a differentiable Einstein-Boltzmann solver for cosmology**, Oliver Hahn et.al., [2311.03291v1](http://arxiv.org/abs/2311.03291v1)\n\n We present the Einstein-Boltzmann module of the DISCO-DJ (DIfferentiable Simulations for COsmology - Done with JAX) software package. This module implements a fully differentiable solver for the linearised cosmological Einstein-Boltzmann equations in the JAX framework, and allows computing Jacobian matrices of all solver output with respect to all input parameters using automatic differentiation. This implies that along with the solution for a given set of parameters, the tangent hyperplane in parameter space is known as well, which is a key ingredient for cosmological inference and forecasting problems as well as for many other applications. We discuss our implementation and demonstrate that our solver agrees at the per-mille level with the existing non-differentiable solvers CAMB and CLASS, including massive neutrinos and a dark energy fluid with parameterised equation of state. We illustrate the dependence of various summary statistics in large-scale structure cosmology on model parameters using the differentiable solver, and finally demonstrate how it can be easily used for Fisher forecasting. Since the implementation is significantly shorter and more modular than existing solvers, it is easy to extend our solver to include additional physics, such as additional dark energy models, modified gravity, or other non-standard physics.\n\n"}, "dark matter": {"2311.03168": "2023-11-06, **Euclid Preparation. TBD. Impact of magnification on spectroscopic galaxy clustering**, Euclid Collaboration et.al., [2311.03168v1](http://arxiv.org/abs/2311.03168v1)\n\n In this paper we investigate the impact of lensing magnification on the analysis of Euclid's spectroscopic survey, using the multipoles of the 2-point correlation function for galaxy clustering. We determine the impact of lensing magnification on cosmological constraints, and the expected shift in the best-fit parameters if magnification is ignored. We consider two cosmological analyses: i) a full-shape analysis based on the $\\Lambda$CDM model and its extension $w\\_0w\\_a$CDM and ii) a model-independent analysis that measures the growth rate of structure in each redshift bin. We adopt two complementary approaches in our forecast: the Fisher matrix formalism and the Markov chain Monte Carlo method. The fiducial values of the local count slope (or magnification bias), which regulates the amplitude of the lensing magnification, have been estimated from the Euclid Flagship simulations. We use linear perturbation theory and model the 2-point correlation function with the public code coffe. For a $\\Lambda$CDM model, we find that the estimation of cosmological parameters is biased at the level of 0.4-0.7 standard deviations, while for a $w\\_0w\\_a$CDM dynamical dark energy model, lensing magnification has a somewhat smaller impact, with shifts below 0.5 standard deviations. In a model-independent analysis aiming to measure the growth rate of structure, we find that the estimation of the growth rate is biased by up to $1.2$ standard deviations in the highest redshift bin. As a result, lensing magnification cannot be neglected in the spectroscopic survey, especially if we want to determine the growth factor, one of the most promising ways to test general relativity with Euclid. We also find that, by including lensing magnification with a simple template, this shift can be almost entirely eliminated with minimal computational overhead.\n\n", "2311.03161": "2023-11-06, **17O enrichment of CaWO4 crystals for spin-dependent DM search**, Angelina Kinast et.al., [2311.03161v1](http://arxiv.org/abs/2311.03161v1)\n\n For many years, various experiments have attempted to shed light on the nature of dark matter (DM). This work investigates the possibility of using CaWO4 crystals for the direct search of spin-dependent DM interactions using the isotope 17O with a nuclear spin of 5/2. Due to the low natural abundance of 0.038%, an enrichment of the CaWO4 crystals with 17O is developed during the crystal production process at the Technical University of Munich. Three CaWO4 crystals were enriched, and their 17O content was measured by nuclear magnetic resonance spectroscopy at the University of Leipzig. This paper presents the concept and first results of the 17O enrichment and discusses the possibility of using enriched crystals to increase the sensitivity for the spin-dependent DM search with CRESST.\n\n", "2311.02973": "2023-11-06, **Constraining (anti)nuclei measurements relevant for astrophysics with ALICE**, Chiara Pinto et.al., [2311.02973v1](http://arxiv.org/abs/2311.02973v1)\n\n Antinuclei can be produced in space either by collisions of high-energy cosmic rays with the interstellar medium or from the annihilation of dark matter particles stemming into standard model particles. High-energy hadronic collisions at accelerators create a suitable environment for producing light (anti)nuclei. Hence, studying the production of (anti)nuclei in pp collisions at the LHC can provide crucial insights into the production mechanisms of nuclear states in our Universe. Recent measurements of the production of (anti)nuclei in and out of jets, and as a function of rapidity in pp collisions at \\mbox{$\\sqrt{s}$ = 13 TeV} have been carried out with ALICE. The latter allow for the extrapolation of the nuclear production models at forward rapidity, region of interest for indirect searches of dark matter. Recent results on the annihilation cross-section of antinuclei are also discussed in the context of astrophysical measurements of cosmic ray flux. Such information is essential to study the different sources of antinuclei in our Universe and to interpret any future measurement of antinuclei in space.\n\n", "2311.02866": "2023-11-06, **Quantifying the tension between cosmological models and JWST red candidate massive galaxies**, Junchao Wang et.al., [2311.02866v1](http://arxiv.org/abs/2311.02866v1)\n\n We develop a Python tool to estimate the tail distribution of the number of dark matter halos beyond a mass threshold and in a given volume in a light-cone. The code is based on the extended Press-Schechter model and is computationally efficient, typically taking a few seconds on a personal laptop for a given set of cosmological parameters. The high efficiency of the code allows a quick estimation of the tension between cosmological models and the red candidate massive galaxies released by the James Webb Space Telescope, as well as scanning the theory space with the Markov Chain Monte Carlo method. As an example application, we use the tool to study the cosmological implication of the candidate galaxies presented in Labb\\'e et al. (2023). The standard $\\Lambda$ cold dark matter ($\\Lambda$CDM) model is well consistent with the data if the star formation efficiency can reach $\\sim 0.3$ at high redshift. For a low star formation efficiency $\\epsilon \\sim 0.1$, $\\Lambda$CDM model is disfavored at $\\sim 2\\sigma$-$3\\sigma$ confidence level.\n\n", "2311.02828": "2023-11-06, **Electroweak baryogenesis, dark matter, and dark CP-symmetry**, Jinghong Ma et.al., [2311.02828v1](http://arxiv.org/abs/2311.02828v1)\n\n With the motivation of explaining the dark matter and achieving the electroweak baryogenesis via the spontaneous CP-violation at high temperature, we propose a complex singlet scalar ($S=\\frac{\\chi+i\\eta\\_s}{\\sqrt{2}}$) extension of the two-Higgs-doublet model respecting a discrete dark CP-symmetry: $S\\to -S^*$. The dark CP-symmetry guarantees $\\chi$ to be a dark matter candidate on one hand and on the other hand allows $\\eta\\_s$ to have mixings with the pseudoscalars of the Higgs doublet fields, which play key roles in generating the CP-violation sources needed by the electroweak baryogenesis at high temperature. The universe undergoes multi-step phase transitions, including a strongly first-order electroweak phase transition during which the baryon number is produced. At the present temperature, the observed vacuum is produced and the CP-symmetry is restored so that the stringent electric dipole moment experimental bounds are satisfied. Considering relevant constraints, we study the simple scenario of $m\\_{\\chi}$ around the Higgs resonance region, and find that the dark matter relic abundance and the baryon asymmetry can be simultaneously explained. Finally, we briefly discuss the gravitational wave signatures at future space-based detectors and the LHC signatures.\n\n"}, "supernova": {"2311.03286": "2023-11-06, **Jet - counter-jet asymmetry in the jittering jets explosion mechanism of supernovae**, Noam Soker et.al., [2311.03286v1](http://arxiv.org/abs/2311.03286v1)\n\n I identify a point-symmetric morphology composed of three pairs of ears (small lobes) in the X-ray images of the core-collapse supernova remnant (CCSNR) N63A and argue that this morphology supports the jittering jets explosion mechanism (JJEM). The opposite two ears in each of the three pairs of SNR N63A are not equal to each other as one is larger than the other. From the morphology of SNR N63A, I infer that this asymmetry is due to asymmetrical opposite jets at launching. Namely, the newly born neutron star that launches the jets that explode the star, does it in many cases with one jet more powerful than its counter-jet. I propose that this asymmetry results from that the accretion disk that launches the jets has no time to fully relax during a jet-launching episode. This implies that if the disk is born with two unequal sides as expected in the JJEM, then during a large fraction, or even all, of the jet-launching episode the two sides remain unequal. I also show that the magnetic reconnection timescale, which is about the timescale for the magnetic field to relax, is not much shorter than the jet-launching episode, therefore the two sides of the accretion disk might have a different magnetic structure. The unequal sides of the accretion disk launch two opposite jets with different energy from each other.\n\n"}}