{"neutrino": {"2507.01962": "2025-07-02, **Sub-keV dark matter can strongly ionize molecular clouds**, Pedro De la Torre Luque et.al., [2507.01962v1](http://arxiv.org/abs/2507.01962v1)\n\n We show that the ionization of dense molecular clouds can be used to set strong constraints on dark matter models producing UV/X-ray photons in their annihilation or decay. We place robust and competitive constraints on various dark matter models, such as axion-like particles, scalars and sterile neutrinos, for masses between $\\sim30$~eV and $10$~keV, and project forecasts to illustrate the potential of this target. We discuss how these constraints can be significantly improved by considering a more refined sample of molecular clouds near the Galactic Center and above the Galactic plane, a detailed modeling of the cosmic-ray ionization contribution and, potentially, a more refined analysis of the gas density in clouds through dust extinction maps. Thus, ionization of molecular clouds emerges as one of the most powerful tools for probing sub-keV dark matter.\n\n", "2507.01895": "2025-07-02, **$E_6$ Unification of Freeze-In Dark Matter and Leptogenesis**, Adeela Afzal et.al., [2507.01895v1](http://arxiv.org/abs/2507.01895v1)\n\n We investigate the possibility of \\emph{freeze-in} dark matter production and baryogenesis in an $E\\_6$ extension of the Standard Model, featuring a residual $U(1)\\_{\\psi'}$ gauge symmetry. This symmetry arises from a linear combination of $U(1)\\chi$ and $U(1)\\_{\\psi}$, both of which are subgroups of the $E\\_6$. The spontaneous breaking of $U(1)\\_{\\psi'}$ symmetry governs the dynamics of a singlet fermion, which naturally serves as a freeze-in dark matter candidate. The dark matter mass arises from dimension-five operators, and a discrete symmetry ensures their stability. We show that freeze-in production from scalar decay can yield the correct relic abundance for dark matter masses between few MeV to a few hundred GeV. Simultaneously, heavy right-handed neutrinos generate light neutrino masses via the type-I seesaw and produce the observed baryon asymmetry via leptogenesis.\n\n", "2507.01893": "2025-07-02, **Measurement of the diffuse astrophysical neutrino flux over six seasons using cascade events from the Baikal-GVD expanding telescope**, Baikal-GVD Collaboration et.al., [2507.01893v1](http://arxiv.org/abs/2507.01893v1)\n\n We present an updated measurement of the diffuse astrophysical neutrino flux using Baikal-GVD cascade data collected between April 2018 to March 2024. In this period, the detector grew from 15% to 55% of its baseline cubic kilometer configuration. The diffuse astrophysical neutrino flux is detected with a statistical significance of 5.1 $\\sigma$. Assuming a single power law model of the astrophysical neutrino flux with identical contribution from each neutrino flavor, the following best-fit parameter values are found: the spectral index $\\gamma\\_{astro}$ = 2.64$^{+0.09}\\_{-0.11}$ and the flux normalization $\\phi\\_{astro}$ = 4.42$^{+2.31}\\_{-1.29}\\times10^{-18} \\text{GeV}^{-1}\\text{cm}^{-2}\\text{s}^{-1}\\text{sr}^{-1}$ per one flavor at 100 TeV. These results are broadly consistent with IceCube measurements.\n\n", "2507.01863": "2025-07-02, **$Λ_b \\to Λ^{(\\ast)}ν\\barν$ decays and the recent Belle-II $B^+\\to K^+ν\\barν$ data**, Diganta Das et.al., [2507.01863v1](http://arxiv.org/abs/2507.01863v1)\n\n The Belle-II experiment has recently reported the first measurement of $B^+ \\to K^+ \\nu\\bar{\\nu}$ decay which exceeds the Standard Model prediction by approximately 2.7$\\sigma$. The deviation may indicate the presence of new physics beyond the Standard Model in the $b\\to s\\nu\\bar{\\nu}$ sector. Under this assumption, we study the hadronic $\\Lambda\\_b \\to \\Lambda(\\to p\\pi)\\nu\\bar{\\nu}$ and $\\Lambda\\_b \\to \\Lambda^\\ast(\\to N\\!\\bar{K})\\nu\\bar{\\nu}$ decays within both the Standard Model and beyond. We work in a low energy effective field theory framework with additional light right-handed neutrinos. We calculate the differential branching ratios of these decay modes and explore the implications of the Belle-II results through various observables.\n\n", "2507.01848": "2025-07-02, **Neutrino mass tension or suppressed growth rate of matter perturbations?**, William Giarè et.al., [2507.01848v1](http://arxiv.org/abs/2507.01848v1)\n\n Assuming a minimal $\\Lambda$CDM cosmology with three massive neutrinos, the joint analysis of Planck cosmic microwave background data, DESI baryon acoustic oscillations, and distance moduli measurements of Type Ia supernovae from the Pantheon+ sample sets an upper bound on the total neutrino mass, $\\sum m\\_\\nu \\lesssim 0.06$-$0.07$ eV, that lies barely above the lower limit from oscillation experiments. These constraints are mainly driven by mild differences in the inferred values of the matter density parameter across different probes that can be alleviated by introducing additional background-level degrees of freedom (e.g., by dynamical dark energy models). However, in this work we explore an alternative possibility. Since both $\\Omega\\_\\mathrm{m}$ and massive neutrinos critically influence the growth of cosmic structures, we test whether the neutrino mass tension may originate from the way matter clusters, rather than from a breakdown of the $\\Lambda$CDM expansion history. To this end, we introduce the growth index $\\gamma$, which characterizes the rate at which matter perturbations grow. Deviations from the standard $\\Lambda$CDM value ($\\gamma \\simeq 0.55$) can capture a broad class of models, including non-minimal dark sector physics and modified gravity. We show that allowing $\\gamma$ to vary significantly relaxes the neutrino mass bounds to $\\sum m\\_\\nu \\lesssim 0.13$-$0.2$ eV, removing any tension with terrestrial constraints without altering the inferred value of $\\Omega\\_\\mathrm{m}$. However, this comes at the cost of departing from standard growth predictions: to have $\\sum m\\_\\nu \\gtrsim 0.06$ eV one needs $\\gamma > 0.55$, and we find a consistent preference for $\\gamma > 0.55$ at the level of $\\sim 2\\sigma$. This preference increases to $\\sim 2.5$-$3\\sigma$ when a physically motivated prior $\\sum m\\_\\nu \\ge 0.06$ eV from oscillation experiments is imposed.\n\n", "2507.01815": "2025-07-02, **Ge-based Quantum Sensors for Low-Energy Physics**, D. -M. Mei et.al., [2507.01815v1](http://arxiv.org/abs/2507.01815v1)\n\n We present \\textbf{GeQuLEP} (Germanium-based Quantum Sensors for Low-Energy Physics), a conceptual design for an advanced quantum sensing platform integrating high-purity germanium (Ge) crystals with engineered phononic crystal cavities. At cryogenic temperatures, these cavities naturally host dipole-bound states, effectively forming quantum dots coupled to radio-frequency quantum point contact (RF-QPC) readout systems. This innovative coupling approach promises ultra-sensitive phonon-mediated charge detection through phonon-induced charge displacement. GeQuLEP is specifically designed to achieve exceptionally low detection thresholds, theoretically enabling single primary phonon sensitivity with anticipated energy depositions as low as \\textbf{0.00745~eV}. This unprecedented sensitivity, if realized experimentally, would provide unique access to searches for low-mass dark matter down to the keV/$c^2$ mass range via nuclear and electronic recoils. Additionally, GeQuLEP aims to facilitate the real-time detection of solar \\textit{pp} neutrinos through coherent elastic neutrino--nucleus scattering (CE$\\nu$NS). By combining phonon-based quantum transduction with quantum-classical hybrid readout schemes, the GeQuLEP architecture represents a scalable, contact-free phonon spectroscopy design that could significantly advance the capabilities of ultra-low-energy rare-event detection at the quantum limit.\n\n", "2507.01675": "2025-07-02, **Extending the sensitivity of heavy sterile neutrino searches with solar neutrino experiments**, Yutao Zhu et.al., [2507.01675v1](http://arxiv.org/abs/2507.01675v1)\n\n A sensitivity study of the search for heavy sterile neutrinos ($\\nu\\_H$) in the MeV mass range using solar neutrino experiments is presented. $\\nu\\_H$, with masses ranging from a few MeV up to 15 MeV, can be produced in the Sun through $^8$B decay and subsequently decay into $\\nu\\_e e^+ e^-$. Its flux and lifetime strongly depend on the mixing parameter $\\|U\\_{eH}\\|^2$ and mass $m\\_{\\nu\\_H}$. The $\\nu\\_H$ signal can be detected via its decay products, either the $e^+e^-$ pair or $\\nu\\_e$, depending on whether $\\nu\\_H$ decays inside or outside the detector. Expected signal yields for both detection methods (detecting $e^+e^-$ or $\\nu\\_e$ signal) are presented across the full $\\|U\\_{eH}\\|^2$ and $m\\_{\\nu\\_H}$ parameter space. These two methods are found to be complementary in different regions of the $\\|U\\_{eH}\\|^2$ and $m\\_{\\nu\\_H}$ phase space. By combining both approaches, we anticipate observing at least a handful of signal events across most of the parameter space of $10^{-6} < \\|U\\_{eH}\\|^2 < 1$ and 2 MeV $< m\\_{\\nu\\_H} < $ 14 MeV, assuming a 500-ton solar neutrino experiment operating for one year. Key variables, such as the energy spectra of $\\nu\\_e$ or $e^+e^-$ and the $\\nu\\_e$ solar angle, are also discussed to help distinguish signal from major backgrounds, such as solar neutrino events.\n\n", "2507.01505": "2025-07-02, **Numerical treatment of annual modulation of relic neutrinos**, Fabian Zimmer et.al., [2507.01505v1](http://arxiv.org/abs/2507.01505v1)\n\n We present a numerical treatment of the annual modulation of relic neutrinos due to the Sun's gravitational influence. Extending our previously developed N-1-body simulation framework from Milky Way scales to solar system dynamics, we model how cosmic neutrino background densities might vary throughout Earth's orbital cycle. We validate our numerical approach against analytical expectations from previous studies that assumed idealized relic neutrino populations. Our results suggest that the prior gravitational history of neutrinos traversing asymmetric dark matter distributions can affect annual modulation patterns. While our simulations reproduce modulation amplitudes similar to analytical predictions for heavier neutrinos, we find that the amplitude can vary considerably depending on the specific morphology of dark matter halos. These findings highlight the importance of incorporating realistic structure formation effects when predicting potential observational relic neutrino signatures.\n\n", "2507.01480": "2025-07-02, **A Factorized Mass Structure of Fermions and Its Fit**, Qingfeng Cao et.al., [2507.01480v1](http://arxiv.org/abs/2507.01480v1)\n\n The structure of the mass matrix, a challenging problem in the Standard Model, is closely related to flavor phenomenology and the understanding of the Yukawa interaction. We derive a factorized mass structure based on observed fermion mass hierarchies, investigating the role of $SO(2)^f$ family symmetry in explaining the approximate degeneracy of light quark generations and its connection to flavor mixing. Our calculation includes the slightest modification from the lightest fermions by $\\mathcal{O}(h^2)$ hierarchy corrections. Using this model-independent framework, we systematically analyze all mass patterns and perform comprehensive fits to both quark CKM and lepton PMNS mixing data with extended normal-ordered Dirac neutrinos. The results demonstrate this framework's capacity to unify flavor phenomena while simultaneously providing new insights into the fundamental nature of Yukawa interactions.\n\n", "2507.01153": "2025-07-01, **A Frequentist Simulation-Based Inference Treatment of Sterile Neutrino Global Fits**, Joshua Villarreal et.al., [2507.01153v1](http://arxiv.org/abs/2507.01153v1)\n\n A critical challenge in particle physics is combining results from diverse experimental setups that measure the same physical quantity to enhance precision and statistical power, a process known as a global fit. Global fits of sterile neutrino searches, hunts for additional neutrino oscillation frequencies and amplitudes, present an intriguing case study. In such a scenario, the key assumptions underlying Wilks' theorem, a cornerstone of most classic frequentist analyses, do not hold. The method of Feldman and Cousins, a trials-based approach which does not assume Wilks' theorem, becomes computationally prohibitive for complex or intractable likelihoods. To bypass this limitation, we borrow a technique from simulation-based inference (SBI) to estimate likelihood ratios for use in building trials-based confidence intervals, speeding up test statistic evaluations by a factor $>10^4$ per grid point, resulting in a faster, but approximate, frequentist fitting framework. Applied to a subset of sterile neutrino search data involving the disappearance of muon-flavor (anti)neutrinos, our method leverages machine learning to compute frequentist confidence intervals while significantly reducing computational expense. In addition, the SBI-based approach holds additional value by recognizing underlying systematic uncertainties that the Wilks approach does not. Thus, our method allows for more robust machine learning-based analyses critical to performing accurate but computationally feasible global fits. This allows, for the first time, a global fit to sterile neutrino data without assuming Wilks' theorem. While we demonstrate the utility of such a technique studying sterile neutrino searches, it is applicable to both single-experiment and global fits of all kinds.\n\n", "2507.01130": "2025-07-01, **New avenues for the neutrino dipole portal exploration at the energy frontier**, Natascia Vignaroli et.al., [2507.01130v1](http://arxiv.org/abs/2507.01130v1)\n\n We present a comprehensive and gauge-invariant study of the neutrino dipole portal at the energy frontier. Assuming negligible active-sterile mixing, we analyze sterile neutrino production via dimension-6 dipole operators coupling to the electroweak field strengths. The analysis incorporates, for the first time, both single- and double-gauge-boson effective interactions. We investigate novel collider signatures at the HL-LHC, the FCC-hh -- studied here in this context for the first time -- and a 10 TeV muon collider. Particular emphasis is placed on electroweak boson-initiated processes, which dominate in the high-mass regime above $\\sim$1 TeV. At the muon collider, these VBF-like topologies enable production even when the dipole couples to non-muonic flavors, offering a unique and sensitive probe for different flavor scenarios. We derive sensitivity projections for various theoretical benchmarks, reaching dipole couplings down to $d\\_{\\gamma}\\sim 6\\times10^{-7}$ GeV$^{-1}$ at FCC-hh and $d\\_{\\gamma}\\sim 2\\times10^{-7}$ GeV$^{-1}$ at the muon collider.\n\n", "2507.01100": "2025-07-01, **The Effect of the Collisional Flavor Instability on Core-Collapse Supernova Models**, Tianshu Wang et.al., [2507.01100v1](http://arxiv.org/abs/2507.01100v1)\n\n We explore the effects of the neutrino collisional flavor instability (CFI) based on 1D and 2D core-collapse supernova (CCSN) simulations done using the sophisticated radiation-hydrodynamic code F{\\sc ornax}. We compare the growth rates of homogeneous CFI {(hCFI)} modes calculated by numerically solving the multi-group dispersion relation to those calculated using the monochromatic approximation. We find that the widely-used monochromatic approximation {leads to incorrect growth rates} when applied in multi-group scenarios. {As opposed to the $\\sim10^5$ s$^{-1}$ values given by the monochromatic approximation,} the actual growth rates of non-resonance multi-group {hCFI} are at most $\\sim$200 s$^{-1}$ in all our models and they are too slow to affect CCSN outcomes. We adopt a BGK flavor conversion scheme in the simulations to include the effects of resonance-like {hCFI}. We find that the CCSN dynamics and neutrino emission properties are only weakly influenced, and the intrinsic stochasticity due to convection and neutrino-driven turbulence can naturally lead to comparable effects. Hence, our analysis of the non-resonance and resonance-like {hCFI} into CCSN simulations suggests that the effects of neutrino flavor conversion triggered by {hCFI} modes are in general small.\n\n", "2507.01094": "2025-07-01, **Heavy element nucleosynthesis in rotating proto-magnetar winds**, Tejas Prasanna et.al., [2507.01094v1](http://arxiv.org/abs/2507.01094v1)\n\n The astrophysical origin of elements synthesized through the rapid neutron capture process ($r-$process) is a long standing mystery. The hot and dense environments of core-collapse supernovae have been suggested as potential $r-$process sites, particularly the neutrino-driven wind from the newly-born protoneutron star (PNS). Wind models that neglect the potential effects of strong magnetic fields and/or rapid rotation of the PNS typically fail to achieve the necessary conditions for production of the third $r-$process peak, but robustly produce a limited or weak $r-$process for neutron-rich winds. Axisymmetric magnetohydrodynamic simulations of rotating and non-rotating PNS winds with magnetar-strength fields reveal that high entropy material is quasi-periodically ejected from the equatorial closed zone of the PNS magnetosphere. Here, we post-process tracer particle trajectories from these simulations using a nuclear reaction network in order to explore the resulting nucleosynthesis across a range of PNS magnetic field strengths, rotation rates, and neutrino luminosities (cooling phase after core-bounce). We find that a robust $r-$process up to and beyond the third peak is generic to magnetar birth, even for magnetic fields as weak as $\\sim 5\\times 10^{14}$ G. Depending on the distribution of magnetic field strengths and rotation at birth, we estimate that magnetized PNS winds could account for $\\sim 5-100\\%$ of the Galactic $r-$process inventory, extending up to the third peak. The robust $r-$process in our calculations is accompanied by overproduction of elements with mass number $\\rm A\\lesssim 120$ compared to the Solar abundances. We also find that $^{92}\\rm Mo$ (a $p-$isotope) is produced in significant quantities in neutron-rich winds.\n\n", "2507.01088": "2025-07-01, **Supermassive black holes and their surroundings: MeV signatures**, Tullia Sbarrato et.al., [2507.01088v1](http://arxiv.org/abs/2507.01088v1)\n\n The gravitational potential of supermassive black holes is so powerful that it triggers some of the most intense phenomena in the Universe. Accretion onto these objects and relativistic jet emission from their vicinity are observable across a wide range of frequencies and throughout cosmic history. However, despite this wealth of data, many aspects of their underlying mechanisms remain elusive. Investigating this phenomena across all frequencies is crucial, yet some energy windows are still poorly explored. One such window is the MeV energy range: many key signatures related to the emission from the SMBH environment - both in quiescent and active phases - are expected to lie between one and several hundreds MeV. In this work, we explore some of the open questions regarding the behavior and emission processes in the surroundings of SMBHs, and how these questions might be approached. From the elusive nature of Fermi bubbles around our Galactic Centre, to the origin of high-energy neutrinos in the nuclei and jets of Active Galactic Nuclei, to the nature and emission mechanisms of the most powerful blazars, the MeV window stands out as a crucial key to understanding SMBH physics.\n\n", "2507.01000": "2025-07-01, **New Constraints on Neutrino-Dark Matter Interactions: A Comprehensive Analysis**, P. S. Bhupal Dev et.al., [2507.01000v1](http://arxiv.org/abs/2507.01000v1)\n\n We present a comprehensive analysis of the interactions of neutrinos with the dark sector within the simplified model framework. We first derive the exact analytic formulas for the differential scattering cross sections of neutrinos with scalar, fermion, and vector dark matter (DM) for light dark sector models with mediators of different types. We then implement the full catalog of constraints on the parameter space of the neutrino-DM and neutrino-mediator couplings and masses, including cosmological and astrophysical bounds coming from Big Bang Nucleosynthesis, Cosmic Microwave Background, DM and neutrino self-interactions, DM collisional damping, and astrophysical neutrino sources, as well as laboratory constraints from 3-body meson decays and invisible $Z$ decays. We find that most of the benchmarks in the DM mass-coupling plane adopted in previous studies to get an observable neutrino-DM interaction effect are actually ruled out by a combination of the above-mentioned constraints, especially the laboratory ones which are robust against astrophysical uncertainties and independent of the cosmological history. To illustrate the consequences of our new results, we take the galactic supernova neutrinos in the MeV energy range as a concrete example and highlight the difficulties in finding any observable effect of neutrino-DM interactions. Finally, we identify new benchmark points potentially promising for future observational prospects of the attenuation of the galactic supernova neutrino flux and comment on their implications for the detection prospects in future large-volume neutrino experiments such as JUNO, Hyper-K, and DUNE. We also comment on the ultraviolet-embedding of the effective neutrino-DM couplings.\n\n", "2507.00921": "2025-07-01, **Measurement of charged-current muon neutrino-argon interactions without pions in the final state using the MicroBooNE detector**, MicroBooNE collaboration et.al., [2507.00921v1](http://arxiv.org/abs/2507.00921v1)\n\n We report a new measurement of flux-integrated differential cross sections for charged-current (CC) muon neutrino interactions with argon nuclei that produce no final state pions $(\\nu\\_\\mu\\mathrm{CC}0\\pi)$. These interactions are of particular importance as a topologically defined signal dominated by quasielastic-like interactions. This measurement was performed with the MicroBooNE liquid argon time projection chamber detector located at the Fermilab Booster Neutrino Beam (BNB), and uses an exposure of $1.3\\times10^{21}$ protons on target collected between 2015 and 2020. The results are presented in terms of single and double-differential cross sections as a function of the final state muon momentum and angle. The data are compared with widely-used neutrino event generators. We find good agreement with the single-differential measurements, while only a subset of generators are also able to adequately describe the data in double-differential distributions. This work facilitates comparison with Cherenkov detector measurements, including those located at the BNB.\n\n", "2507.00799": "2025-07-01, **Synthesis of high-strength, radiopure, electroformed copper-based alloys for rare-event searches: A materials design perspective**, Dimitra Spathara et.al., [2507.00799v1](http://arxiv.org/abs/2507.00799v1)\n\n Rare-event searches are key to unveiling the constituents of dark matter and to understanding the nature of neutrinos. These endeavors demand detectors with exceptionally low levels of radioactivity, leading to breakthroughs in related techniques. In this context, additive-free electroformed copper has emerged as the material of choice thanks to its excellent radiopurity, favorable physical properties, and affordable cost. However, its high ductility and limited mechanical strength pose challenges for its use in detectors. Recently, electroformed copper-chromium alloys have been proposed, with early investigations suggesting that small chromium admixtures lead to enhanced strength while maintaining radiopurity.   Electroformed copper-based alloys are investigated from a materials design perspective to address current challenges and optimize the processing of materials. Modeling tools based on computational thermodynamics are used to predict material properties following thermal processing. In addition to chromium, the use of titanium as an additional alloying component for superior mechanical strength is explored. The findings suggest a path towards the design of high-performance, radiopure copper-based alloys suitable for next-generation rare-event experiments, while minimizing lengthy and expensive trial-and-error approaches. The impact on future experiments is exemplified through the case of the DarkSPHERE and XLZD experiments.\n\n", "2507.00757": "2025-07-01, **Attributing the point symmetric structure of core-collapse supernova remnant N132D to the jittering jets explosion mechanism**, Noam Soker et.al., [2507.00757v1](http://arxiv.org/abs/2507.00757v1)\n\n I identified a point-symmetric morphology in the core-collapse supernova (CCSN) remnant (CCSNR) N132D, composed of two symmetry axes: the short symmetry axis extending from the northwest ear and through the center of the iron-rich emission on the other side, and the second along the long dimension of N132D and coincides with the extension of the central oxygen-rich gas to the northeast. Namely, the point-symmetry of the outer zones of CCSNR N132D correlates with that of the oxygen-rich gas near the center. The surrounding gas cannot shape the inner oxygen-rich material, implying that the point-symmetric morphology is a property of the explosion mechanism, as predicted by the jittering jets explosion mechanism (JJEM). The oxygen-rich material is known to be in a torus. According to the JJEM, an energetic pair of opposite jets, more or less perpendicular to the plane of the torus, has shaped the torus; this pair is along the short symmetry axis. Another energetic pair, perpendicular to the first one, shaped the elongated, large-scale structure of CCSNR N132D. I discuss how the JJEM accounts for two perpendicular pairs of jets and the unequal jets in each pair. CCSNR N132D is the fifteenth CCSNR with an identified point-symmetric morphology attributed to the JJEM. Because the neutrino-driven mechanism cannot explain such morphologies, this study further strengthens the claim that the JJEM is the primary explosion mechanism of CCSNe.\n\n", "2507.00548": "2025-07-01, **A waveform and time digitization mainboard prototype for TRIDENT neutrino experiment**, Guangping Zhang et.al., [2507.00548v1](http://arxiv.org/abs/2507.00548v1)\n\n TRIDENT experiment is a planned neutrino observatory at West Pacific Ocean to search for astrophysical neutrinos. The final full-scale detector array is expected to have about 1000 strings, each of which consists of 20 hybrid digital optical modules. Each module will contain a number of photomultiplier tubes (PMTs) and silicon photomultipliers to detect Cherenkov lights. In this paper, we present a custom designed digitization mainboard for the TRIDENT experiment. It includes PMT waveform digitization at a sampling rate of 125 MS/s using commercial analog-to-digital converters, and time digitization using time-to-digital converters implemented in a Field Programmable Gate Array (FPGA). We present its design and the first performances.\n\n"}, "dark matter": {"2507.01956": "2025-07-02, **Universal lower bound on the axion decay constant from free streaming effects**, Keisuke Harigaya et.al., [2507.01956v1](http://arxiv.org/abs/2507.01956v1)\n\n We show that enhancement of the axion relic abundance compared to the standard misalignment contribution generically leads to the production of nonzero momentum axion modes, resulting in warm dark matter behavior and enhanced isocurvature perturbations. It leads to universal constraints on the axion parameter space that are independent of detailed model assumptions and cosmological history. For models enhancing relic abundance with gradient axion modes, observations of the Lyman-$\\alpha$ forest impose a lower bound on the axion decay constant, $f\\_a \\gtrsim 10^{15} {\\rm GeV}\\,(10^{-18}{\\rm eV}/m\\_a)$, from the free-streaming effect. For models relying on the delay of coherent axion oscillations, we obtain a slightly weaker bound, $f\\_a \\gtrsim 10^{14} {\\rm GeV}\\,(10^{-18}{\\rm eV}/m\\_a)$. We make relatively conservative choices to establish these universal bounds but also provide scaling parameters that can be calibrated for stronger constraints in concrete models and updated as observations improve.\n\n", "2507.01822": "2025-07-02, **Kinetic Fragmentation of the QCD Axion on the Lattice**, Matteo Fasiello et.al., [2507.01822v1](http://arxiv.org/abs/2507.01822v1)\n\n Kinetic misalignment, one of the most compelling scenarios for the non-thermal generation of axion dark matter, is generally accompanied by axion fragmentation, a process in which the energy of the axion condensate is transferred to its perturbations. The dynamics of fragmentation, at least in the context of dark matter production, have so far been studied semi-analytically using perturbation theory. In this work, we present the first classical lattice simulation of kinetic axion fragmentation in the context of dark matter production, focusing on parameters relevant to the QCD axion. Our findings indicate that the non-perturbative dynamics captured by the lattice lead to a significantly broader spectrum of axion fluctuations, with a sustained transfer of energy to mildly relativistic modes and with smaller occupation numbers compared to the linear approximation. As a consequence, the final dark matter abundance is typically O(1) lower than in the linear approximation, which is itself O(1) lower than the zero-mode-only prediction. This broadening and suppression of the spectrum could have a significant impact on axion mini-halo formation, one of the main experimental handles on kinetic fragmentation.\n\n", "2507.01814": "2025-07-02, **Where are all the dark galaxies? Predicting galaxy/halo locations from their bright neighbors**, Alice Chen et.al., [2507.01814v1](http://arxiv.org/abs/2507.01814v1)\n\n Astronomical objects in our universe that are too faint to be directly detectable exist and are important - an obvious example being dark matter. The same can also apply to very faint baryonic objects, such as low luminosity dwarf galaxies and gravitationally compact objects (e.g., rogue planets, white dwarfs, neutron stars, black holes, dark sirens). While they are very difficult to observe directly, they have locations that are highly important when studying astrophysical phenomena. Here, we use a machine learning algorithm known as symbolic regression to model the probability of a dark object's existence as a function of their separation distances to their closest two ``bright\" (directly observable) neighbors, and the distances of these bright objects to each other. An advantage of this algorithm is that it is interpretable by humans and can be used to make reproducible predictions. Galaxies with masses above $10^9 M\\_{\\odot}$ and halos above $10^{12} M\\_{\\odot} $ are the objects that we separate into ``bright\" and ``dark\" to be used in our analysis. We find that it is possible to predict the density of dark objects using an analytic expression that depends on their distances to their closest bright neighbors in Illustris-TNG galaxy formation simulations, which is significantly better than the (linear) scale-dependent biasing prediction for $k \\sim 1.0~ h$Mpc$^{-1}$ (and potentially beyond, if allowed by the resolution). This could potentially open the avenue for finding dark objects based on their vicinity to directly observable bright sources and make future surveys more targeted and efficient.\n\n", "2507.01686": "2025-07-02, **Tidal Suppression of Fuzzy Dark Matter Heating in Milky Way Satellite Galaxies**, Yu-Ming Yang et.al., [2507.01686v1](http://arxiv.org/abs/2507.01686v1)\n\n Many previous studies have imposed stringent constraints on the particle mass of fuzzy dark matter (FDM) by analyzing observations of Galactic satellite galaxies, which show no significant evidence of the heating effect predicted by FDM. However, these analyses have generally neglected the tidal influence of the Milky Way, which can substantially suppress the FDM-induced heating in satellites. This oversight arises from computational challenges of accurately capturing the tidal effects in FDM simulations. In this study, we present a novel simulation framework that, for the first time, enables the simulation of an FDM-stellar system within an observationally motivated gravitational potential of the Milky Way. This framework incorporates the diverse Galactic components, including the gravitational influence of the Large Magellanic Cloud. Using the Fornax dwarf galaxy as a case study, we demonstrate that tidal effects significantly alleviate the tension between observational data and the predicted heating effect for an FDM particle mass of $m\\_a\\sim 10^{-22}$ eV.\n\n", "2507.01626": "2025-07-02, **Luminosity Function of Galaxies in Voids: A Modification Inspired by Excursion Set Theory**, Zeynab Ashurikisomi et.al., [2507.01626v1](http://arxiv.org/abs/2507.01626v1)\n\n In the standard picture of cosmology, the galaxies reside in dark matter (DM) halos. DM halos are distributed in the cosmic web in different environments. The luminosity of the galaxies in different environments can be used as a probe to assess a cosmological model. This study focuses on the properties of galaxies in void regions, where halos typically do not experience extreme conditions. By examining the galaxy luminosity function, we aim to understand the dependence of galaxy properties on their environment and redshift so that later, we could use this as a tool to evaluate cosmological models. We employ the Excursion Set Theory to incorporate parameters related to the number density of DM halos into the luminosity function. Using the Galaxy and Mass Assembly (GAMA) survey and 2dFGRS datasets, we fit our theoretical models to observational data, examining the environmental and redshift dependence of the galaxy luminosity function. Our results indicate that we model the galaxy luminosity function in voids effectively by considering the linear density contrast of the environment and the growth function $D(z)$ for redshift dependence. This study provides a model for the environmental dependence of galaxy luminosity function that offers an improvement in the $\\chi ^2$ parameter compared to the previously proposed model in \\cite{mcnaught2014galaxy}. Both BIC and AIC tests support the superiority of this model for the void region.\n\n", "2507.01421": "2025-07-02, **Primordial Black Holes as Coma Cluster Dark Matter and the Unresolved γ-Ray Background**, Jeremy Mould et.al., [2507.01421v1](http://arxiv.org/abs/2507.01421v1)\n\n If 0.1% of the dark matter in the Coma cluster is constituted by primordial black holes (PBHs) with masses ranging from 10^-19 to 10^-17 solar masses, then the observed GeV {\\gamma}-ray emission from the cluster could potentially be attributed to Hawking radiation. The emitted spectrum is inversely proportional to the black hole's mass, meaning lighter PBHs radiate at higher energies, potentially falling within the GeV range. If 0.1% of the Coma cluster's dark matter is PBH in this mass range, a fit to the cluster's GeV emission is obtained. We then investigate the potential for constraining evaporating PBHs through cross-correlations between the Unresolved Gamma-Ray Background and weak gravitational lensing. Utilizing 12 years of Fermi-LAT observations and weak lensing measurements from the Dark Energy Survey Year 3, we assess whether such correlations can reveal a PBH {\\gamma}-ray component. While a statistically significant correlation between the UGRB and large-scale structure has been observed, this signal is consistent with emission from clustered astrophysical sources such as blazars. Attributing a measurable fraction of the UGRB to PBH evaporation would require unrealistically large PBH abundances. We also draw attention to a cluster of Coma-like X-ray clusters, designated Draco X, observed at a redshift of z = 0.12. These systems, characterized by their significant X-ray emission from hot, diffuse intracluster gas, represent massive gravitationally bound structures. The existence and properties of such clusters at these redshifts provide crucial cosmological probes, offering insights into the formation and evolution of large-scale structure and the underlying cosmological parameters. Further investigation of Draco X and similar high-redshift clusters would yield additional constraints on large scale structure.\n\n", "2507.01386": "2025-07-02, **Cosmology and Source Redshift Constraints from Galaxy Clustering and Tomographic Weak Lensing with HSC Y3 and SDSS using the Point-Mass Correction Model**, Tianqing Zhang et.al., [2507.01386v1](http://arxiv.org/abs/2507.01386v1)\n\n The combination of galaxy clustering and weak lensing is a powerful probe of the cosmology model. We present a joint analysis of galaxy clustering and weak lensing cosmology using SDSS data as the tracer of dark matter (lens sample) and the HSC Y3 dataset as source galaxies. The analysis divides HSC Y3 galaxies into four tomographic bins for both galaxy-galaxy lensing and cosmic shear measurements, and employs a point-mass correction model to utilize galaxy-galaxy lensing signals down to 2$h^{-1}$Mpc, extending up to 70$h^{-1}$Mpc. These strategies enhance the signal-to-noise ratio of the galaxy-galaxy lensing data vector. Using a flat $\\Lambda$CDM model, we find $S\\_8 = 0.780^{+0.029}\\_{-0.030}$, and using a $w$CDM model, we obtain $S\\_8 = 0.756^{+0.038}\\_{-0.036}$ with $w = -1.176^{+0.310}\\_{-0.346}$. We apply uninformative priors on the redshift mean-shift parameters for the third and fourth tomographic bins. Leveraging the self-calibration power of tomographic weak lensing, we measure $\\Delta z\\_3 = -0.112^{+0.046}\\_{-0.049}$ and $\\Delta z\\_4 = -0.185^{+0.071}\\_{-0.081}$, in agreement with previous HSC Y3 results. This demonstrates that weak lensing self-calibration can achieve redshift constraints comparable to other methods such as photometric and clustering redshift calibration.\n\n", "2507.01190": "2025-07-01, **Flux of Extragalactic Dark Matter in Direct Detection Experiments**, Shokhruz Kakharov et.al., [2507.01190v1](http://arxiv.org/abs/2507.01190v1)\n\n We calculate the contribution of extragalactic dark matter to the local dark matter density and flux in the Milky Way. By analyzing the Galactic escape velocity as a function of direction, we establish the criterion for separating dark matter particles bound to the Milky Way and those originating from the Local Group environment. Our analysis reveals that approximately 25% of dark matter particles in the Solar neighborhood have an extragalactic origin, contributing nearly 38% of the total mass flux. The directional dependence of this extragalactic component shows significant anisotropy across the sky, with implications for direct detection experiments. We provide quantitative predictions for detection rates and signatures that could help identify the extragalactic dark matter component in current and future experiments.\n\n", "2507.01158": "2025-07-01, **Star formation drivers across the M33 disk**, Edvige Corbelli et.al., [2507.01158v1](http://arxiv.org/abs/2507.01158v1)\n\n We investigate the star formation process across the disk of M33 using a multiwavelength dataset and disk dynamics. We computed numerically equilibrium values of gas densities and scale heights across the disk, taking into account dark matter and testing several analytic approximations that are often used to estimate these variables and the hydrostatic pressure. Orthogonal regressions and hierarchical Bayesian models, as well as random forest (RF) analyses, were used to establish the fundamental relations at physical scales from 160~pc to 1~kpc. The gas pressure, is the main driver of the star formation rate (SFR) surface density throughout the whole star-forming disk of M33. High-pressure regions enhance the atomic-to-molecular gas conversion, with the molecular hydrogen mass surface density being tightly correlated to pressure and a uniform scaling law throughout the M33 disk. The relation between pressure and SFR surface density differs, showing a change in slope from the inner to the outer disk. Scaling laws do not depend on the physical scale and brings out an intrinsic scatter linked to variations in the efficiency and relative age of the molecular gas-to-stars conversion. In the inner disk, where spiral arms are present and the stellar surface density dominates gravity, the pressure and SFR surface densidy establish an almost linear correlation with a smaller dispersion than that of the molecular gas -- SFR surface density relation. In the atomic gas-dominated outer disk, the SFR density has a steeper dependence on pressure, which we propose could be the result of an increasing fraction of diffuse molecular gas that does not form stars.\n\n", "2507.00968": "2025-07-01, **The $Spin(4)$ gauge theory of space, time, gravitation, matter and dark matter**, Tomi Koivisto et.al., [2507.00968v1](http://arxiv.org/abs/2507.00968v1)\n\n A novel gauge-theoretic framework for spacetime and gravitation is proposed, in which a {\\it Cartan khronon} field dynamically breaks the symmetry between space and time, enabling the emergence of temporality within a fundamentally Euclidean setting. Based on a $Spin(4)$ gauge structure, the theory provides a real-valued formulation of chiral spacetime, wherein the effects typically attributed to dark matter could instead be explained by the dynamics of gravitation. New results are presented with implications for a broad range of phenomena, including cosmology, large-scale structure, gravitational waves, black holes, and potential signatures accessible to laboratory experiments. By avoiding the pitfalls of complexification and reinterpreting chiral spacetime geometry through a real, dynamical, and gauge-theoretic lens, the {\\it Cartan khronon} theory offers a fresh and compelling framework for revisiting the foundations of spacetime and gravitation.\n\n", "2507.00925": "2025-07-01, **Connecting t-channel Dark Matter Models to the Standard Model Effective Field Theory**, Simone Biondini et.al., [2507.00925v1](http://arxiv.org/abs/2507.00925v1)\n\n We investigate the connection between simplified dark matter models featuring a $t$-channel scalar mediator and the Standard Model Effective Field Theory (SMEFT). We focus on scenarios with fermionic dark matter interacting with leptons, under the assumption of Minimal Flavor Violation. The dimension-six SMEFT Wilson coefficients are computed in the Warsaw basis at one loop, with the aid of Matchete. Assuming a compressed mass spectrum for the dark matter and the mediator, we incorporate coannihilations, Sommerfeld enhancement, and bound-state effects in the relic density calculation. We then analyze the interplay between the dark matter energy density, global SMEFT fits, and direct detection constraints. Our results show that SMEFT bounds, though loop-suppressed, can meaningfully constrain the parameter space for $m\\_\\chi \\gtrsim 0.5$ TeV and $\\mathcal{O}(1)$ portal couplings.\n\n", "2507.00870": "2025-07-01, **The Evolution of Pop III.1 Protostars Powered by Dark Matter Annihilation. I. Fiducial model and first results**, Devesh Nandal et.al., [2507.00870v1](http://arxiv.org/abs/2507.00870v1)\n\n The existence of billion-solar-mass quasars at redshifts $z \\gtrsim 7$ poses a formidable challenge to theories of black hole formation, requiring pathways for the rapid growth of massive seeds. Population III.1 stars, forming in pristine, dense dark matter (DM) minihalos, are compelling progenitors. This study presents a suite of stellar evolution models for accreting Pop III.1 protostars, calculated with the \\textsc{GENEC} code. We systematically explore a wide parameter space, spanning ambient WIMP densities of $\\rho\\_\\chi \\sim 10^{12}\\mbox{-}10^{16}\\,\\mathrm{GeV\\,cm^{-3}}$ and gas accretion rates of $10^{-3}\\mbox{-}10^{-1}\\,M\\_\\odot\\,\\mathrm{yr^{-1}}$, to quantify the effects of DM annihilation. A central finding is that for a protostar to grow to supermassive scales ($\\gtrsim 10^5 \\, M\\_{\\odot}$), the ambient DM density in the immediate vicinity of the star must exceed a critical threshold of $\\rho\\_{\\chi} \\gtrsim 5 \\times 10^{14} \\, \\text{GeV cm}^{-3}$. The energy injected by WIMP annihilation inflates the protostar, lowering its surface temperature, which suppresses the ionizing feedback that would otherwise halt accretion and significantly delays the onset of hydrogen fusion. This heating also governs the star's final fate: in dense halos ($\\rho\\_\\chi \\gtrsim 10^{15}\\,\\mathrm{GeV\\,cm^{-3}}$), stars remain stable against general relativistic instability beyond $10^6 \\, M\\_{\\odot}$, whereas at lower densities ($\\rho\\_\\chi \\lesssim 10^{13}\\,\\mathrm{GeV\\,cm^{-3}}$), they collapse at masses of $\\sim 5 \\times 10^5 \\, M\\_{\\odot}$. Once the DM fuel is exhausted and core burning commences, the protostar contracts and its ionising photon output can reach very high levels $\\sim 10^{53} s^{-1}$. These distinct evolutionary phases offer clear observational signatures for the JWST, providing a robust, physically-grounded pathway for forming heavy black hole seeds in the early universe.\n\n", "2507.00784": "2025-07-01, **Dark photon dark matter constraints and a tentative signal at the TASEH experiment**, Yuan-Hann Chang et.al., [2507.00784v1](http://arxiv.org/abs/2507.00784v1)\n\n The dark photon is a well motivated candidate for the dark matter which comprises most of the mass of our visible Universe, leading to worldwide experimental and observational efforts towards its discovery. A primary tool in this search is the cavity haloscope, which facilitates resonantly enhanced conversion to photons from both dark photons and axions. In this context, limits from axion search experiments are often directly converted into dark photon constraints, without re-analyzing the original data. However, this rescaling may not fully capture all of the relevant physics due to various reasons. By re-examining data taken by the Taiwan Axion Search Experiment with Haloscope (TASEH) experiment, we derive a world-leading constraint on the dark photon parameter space, excluding $\\|\\epsilon\\|\\gtrsim2\\times10^{-14}$ in the $19.46 - 19.84\\,\\mu$eV mass range, which exceeds the naive `rescaling limit' by roughly one order of magnitude. In this data, we also identify a tentative signal with a local significance of 4.7$\\sigma$, previously disregarded due to an axion-specific veto, corresponding to a dark photon with mass $m\\_X \\simeq 19.5\\,\\mu$eV ($f\\_X\\simeq 4.71$ GHz) and kinetic mixing $\\epsilon \\simeq 2.2\\times10^{-15}$.\n\n", "2507.00770": "2025-07-01, **Microlensing of dark matter models in the Milky Way**, Bichu Li et.al., [2507.00770v1](http://arxiv.org/abs/2507.00770v1)\n\n We investigate constraints on the abundance of primordial black holes (PBHs) as dark matter (DM) candidates using five years of microlensing data from the OGLE survey. While the majority of OGLE's $\\sim 2000$ microlensing events are well-explained by stellar populations such as brown dwarfs, main-sequence stars, and compact remnants, a subset of six ultrashort-timescale events ($t\\_E \\sim 0.1 - 0.3$ days) may signal the presence of PBHs. Building upon prior work that adopted the Navarro-Frenk-White (NFW) DM profile, we examine how alternative DM halo models -- specifically the Einasto and Burkert profiles -- affect microlensing predictions and the constraints on PBH abundance. We computed differential microlensing event rates for both profiles, using the main-sequence star rate as an observational benchmark. Our results show that neither the Einasto nor Burkert profiles reproduce the distribution of main-sequence star events, yet both allow for viable explanations of the ultrashort-timescale events with PBH masses $M\\_{\\mathrm{PBH}} \\sim 10^{-5} M\\_\\odot$. Using a Poisson likelihood analysis under the null hypothesis that no PBH is observed in OGLE dataset, we derive 95\\% C.L. upper bounds on $f\\_{\\mathrm{PBH}}$, finding that the constraints are significantly relaxed under the Einasto and Burkert profiles compared to the NFW case. These results underscore the sensitivity of PBH constraints to the assumed DM halo structure and highlight the importance of accurately modeling the inner Galactic density profile to robustly assess PBH dark matter scenarios.\n\n", "2507.00705": "2025-07-01, **Ultralight fuzzy dark matter review**, Andrew Eberhardt et.al., [2507.00705v1](http://arxiv.org/abs/2507.00705v1)\n\n Ultralight dark matter refers to the lightest potential dark matter candidates. We will focus on the mass range that has been studied using astrophysical and cosmological observations, corresponding to a mass $10^{-24} \\, \\mathrm{eV} \\lesssim m \\lesssim 10^{-18} \\, \\mathrm{eV}$. We will discuss the motivations for this mass range. The most studied model in this range corresponds to a minimally coupled, single, classical, spin-0 field comprising all dark matter. However, the work exploring extensions of this model (for example, higher spin, self-coupled, multiple field, and mixed models) will be one of the focuses of this review. The phenomenology associated with ultralight dark matter is rich and includes linear effects on the primordial power spectrum, core structures forming at the center of halos, nonlinear effects resulting in heating of stellar distributions, and non-relativistic effects relating to pulsar signals and black hole superradiance, to name a few. This set of effects has been studied using an equally extensive set of numerical tools. We will summarize the most common ones and discuss their applications and limitations. Ultralight dark matter also has a wide variety of observational constraints, including halo mass functions, the Lyman-alpha forest, halo density profiles, stellar dynamics, and black hole spins. We will review them focusing on the observations made, the method of study, and the major systematics. We will end with a discussion of the current status of the field and future work needed.\n\n", "2507.00607": "2025-07-01, **Head-on collisions of fuzzy/cold dark matter subhalos**, Hyeonmo Koo et.al., [2507.00607v1](http://arxiv.org/abs/2507.00607v1)\n\n We perform head-on collision simulations of compact dark matter subhalos using distinct numerical methods for fuzzy dark matter (FDM) and cold dark matter (CDM) models. For FDM, we solve the Schr\\\"odinger-Poisson equations with a pseudospectral solver, while for CDM, we utilize a smoothed particle hydrodynamics N-body code. Our results show that velocity decrease of subhalos is significantly greater in FDM model than in CDM, particularly at lower initial velocities, attributed to gravitational cooling-a unique mechanism of stabilizing in FDM with dissipating kinetic energy. This stark contrast in energy dissipation between two DM models suggests that FDM may offer valuable insights into understanding the dynamic behaviors of DM during galaxy cluster collisions, such as those observed in the Bullet cluster and Abell 520. These findings strongly suggest that FDM is not only capable of explaining these complex astrophysical phenomena but also serves as a compelling alternative to the traditional CDM model, offering resolutions to longstanding discrepancies in DM behavior.\n\n", "2507.01070": "2025-07-01, **Interacting Barrow holographic dark energy model in the presence of radiation and matter**, Gopinath Guin et.al., [2507.01070v1](http://arxiv.org/abs/2507.01070v1)\n\n We have studied the effect of radiation in the interacting barrow holographic dark energy model for a non-flat universe. For both open and closed universes, we have obtained the evolution equation for the density parameters for dark energy, dark matter and radiation for a specific kind of interaction among the seven possible linear interactions; the analysis with the remaining six interactions will be updated soon in this manuscript. We have then numerically solved those coupled differential equations to show their behaviour with the redshift parameter. We have also found different epochs corresponding to dark energy-dark matter, dark energy-radiation and dark matter-radiation crossings. We have also obtained various observational constraints for our interacting Barrow holographic dark matter model using the Cosmic chronometer data and BAO data. In the upcoming version of the manuscript, we will add the observational constraints of our model using Pantheon data, also several calculations of other interaction scenarios will be added.\n\n", "2507.00478": "2025-07-01, **Hints of noncold dark matter? Observational constraints on barotropic dark matter with a constant equation of state parameter**, Yan-Hong Yao et.al., [2507.00478v1](http://arxiv.org/abs/2507.00478v1)\n\n This study investigates the potential of a cosmological model termed $\\Lambda w$DM, in which a cosmological constant play the role of dark energy and dark matter is barotropic and has a constant equation of state parameter ($w\\_{\\rm dm}$), to address the $S\\_8$ tension between early- and late- universe observations. By incorporating the latest cosmological datasets -- including Planck Cosmic Microwave Background (CMB), Baryon Acoustic Oscillation (BAO), Ia supernovae (SNe Ia), Redshift Space Distortions (RSD), and weak lensing (WL) -- we constrain the $\\Lambda w$DM compared to $\\Lambda$CDM. Our analysis reveals a marginal preference for a non-zero $w\\_{\\rm dm}=2.7^{+2.0}\\_{-1.9}\\times10^{-7}$( at 95\\% confidence level) when combining CMB, SDSS BAO, SNe Ia, RSD, and WL data, and a marginal preference for a non-zero $w\\_{\\rm dm} = 2.29^{+1.9}\\_{-2.0} \\times 10^{-7}$( at 95\\% confidence level) when combining CMB, DESI Y1 BAO, SNe Ia, RSD, and WL data. In addition, we find that, compared to $\\Lambda$CDM, $\\Lambda w$DM can alleviate the $S\\_8$ tension from $>3\\sigma$ to $<1\\sigma$. Furthermore, we find that, for CMB+SDSS+PP+RSD+WL datasets, the $\\Lambda w$DM model is close to being positively preferred over the $\\Lambda$CDM model.\n\n", "2507.00410": "2025-07-01, **The Density Profile of Dynamical Halos**, Tristen Shields et.al., [2507.00410v1](http://arxiv.org/abs/2507.00410v1)\n\n Among the most fundamental properties of a dark matter halo is its density profile. Motivated by the recent proposal by Garc\\'ia et al. [R. Garc\\'ia et. al., MNRAS 521, 2464 (2023)] to define a dynamical halo as the collection of orbiting particles in a gravitationally bound structure, we characterize the mean and scatter of the orbiting profile of dynamical halos as a function of their orbiting mass. We demonstrate that the orbiting profile of individual halos at fixed mass depends on a single dynamical variable -- the halo radius $r\\_{\\rm h}$ -- which characterizes the spatial extent of the profile. The scatter in halo radius at fixed orbiting mass is $\\approx 16\\%$. Only a small fraction of this scatter arises due to differences in halo formation time, with late-forming halos being more compact (smaller halo radii). Accounting for this additional correlation results in an $\\approx 11\\%$ scatter in halo radius at fixed mass and halo formation time.\n\n", "2507.00351": "2025-07-01, **Dark from light (DfL): Inferring halo properties from luminous tracers with machine learning trained on cosmological simulations. I. Method, proof of concept & preliminary testing**, Asa F. L. Bluck et.al., [2507.00351v1](http://arxiv.org/abs/2507.00351v1)\n\n We present Dark from Light (DfL) - a novel method to infer the dark sector in wide-field galaxy surveys, leveraging a machine learning approach trained on contemporary cosmological simulations. The aim of this algorithm is to provide a fast, straightforward, and accurate route to estimating dark matter halo masses and group membership in wide-field spectroscopic galaxy surveys. This approach requires a highly limited number of input parameters and yields full probability distribution functions for the output halo masses. To achieve this, we train a series of Random Forest (RF) regression models on the IllustrisTNG and EAGLE simulations at z=0-3, which provide model-dependent mappings from luminous tracers to dark matter halo properties. We incorporate the individual regression models into a virial group-finding algorithm (DfL), which outputs halo properties for observational-like input data. We test the method at z=0-2 for both the EAGLE and IllustrisTNG models, as well as in a cross-validation mode. We demonstrate that known halo masses can be recovered with a mean systematic bias of $\\langle b \\rangle = \\pm 0.10\\,$dex (resulting from simulation choice), a mean statistical uncertainty of $\\langle \\sigma \\rangle = 0.12 \\,$dex across epochs, and a central - (core) satellite classification accuracy of 96%. We establish that this approach yields superior halo mass recovery to standard abundance matching applied to groups identified through a friends-of-friends algorithm. Additionally, we compare the outputs of DfL to observational constraints on the $M\\_* - M\\_{\\rm Halo}$ relation from strong gravitational lensing at $z \\sim 0$, demonstrating the promise of this novel approach. Finally, we systematically quantify how DfL performs on observational-like input data with varying stellar mass uncertainty and spectroscopic incompleteness, enabling robust error calibration.\n\n", "2507.00344": "2025-07-01, **Earth-Scattering Induced Modulation in Low-Threshold Dark Matter Experiments**, Xavier Bertou et.al., [2507.00344v1](http://arxiv.org/abs/2507.00344v1)\n\n Dark matter particles with sufficiently large interactions with ordinary matter can scatter in the Earth before reaching and scattering in a detector. This induces a modulation in the signal rate with a period of one sidereal day. We calculate this modulation for sub-GeV dark matter particles that interact either with a heavy or an ultralight dark-photon mediator and investigate the resulting signal in low-threshold detectors consisting of silicon, xenon, or argon targets. The scattering in the Earth is dominated by dark matter scatters off nuclei, while the signal in the detector is easiest to observe from dark matter scattering off electrons. We investigate the properties of the modulation signal and provide projections of the sensitivity of future experiments. We find that a search for a modulation signal can probe new regions of parameter space near the energy thresholds of current experiments, where the data are typically dominated by backgrounds.\n\n"}, "supernova": {"2507.01508": "2025-07-02, **Duration and properties of the embedded phase of star formation in 37 nearby galaxies from PHANGS-JWST**, Lise Ramambason et.al., [2507.01508v1](http://arxiv.org/abs/2507.01508v1)\n\n Light reprocessed by dust grains emitting in the infrared allows the study of the physics at play in dusty, embedded regions, where ultraviolet and optical wavelengths are attenuated. Infrared telescopes such as JWST have made it possible to study the earliest feedback phases, when stars are shielded by cocoons of gas and dust. This phase is crucial for unravelling the effects of feedback from young stars, leading to their emergence and the dispersal of their host molecular clouds. Here we show that the transition from the embedded to the exposed phase of star formation is short (< 4 Myr) and sometimes almost absent (< 1 Myr), across a sample of 37 nearby star-forming galaxies, covering a wide range of morphologies from massive barred spirals to irregular dwarfs. The short duration of the dust-clearing timescales suggests a predominant role of pre-supernova feedback mechanisms in revealing newborn stars, confirming previous results on smaller samples and allowing, for the first time, a statistical analysis of their dependencies. We find that the timescales associated with mid-infrared emission at 21 {\\mu}m, tracing a dust-embedded feedback phase, are controlled by a complex interplay between giant molecular cloud properties (masses and velocity dispersions) and galaxy morphology. We report relatively longer durations of the embedded phase of star formation in barred spiral galaxies, while this phase is significantly reduced in low-mass irregular dwarf galaxies. We discuss tentative trends with gas-phase metallicity, which may favor faster cloud dispersal at low metallicities.\n\n", "2507.01495": "2025-07-02, **The environment of TeV halo progenitors**, Lioni-Moana Bourguinat et.al., [2507.01495v1](http://arxiv.org/abs/2507.01495v1)\n\n TeV halos are extended very-high-energy gamma-ray sources found around some middle-aged pulsars. The emission spanning several tens of parsecs suggests an efficient confinement of the ultra-relativistic lepton pairs produced by pulsars in their vicinity. The physical mechanism responsible for this suppressed transport has not yet been identified. In some scenarios, pair confinement may be linked to the medium the pulsars are located in. We aim at understanding which type of medium pulsars are probing over their lifetime. We developed a model for the environment probed by moving pulsars, from their birth in core-collapse explosions, where they receive a natal kick, until their entry into the interstellar medium. The model involves: (i) a Monte-Carlo sampling of the properties of the massive-star progenitors of pulsars; (ii) a calculation of the structure of the surrounding medium shaped by these progenitors, for the two cases of isolated stars and star clusters; (iii) a computation of the evolution of supernova remnants in these parent environments. Ultimately, from a distribution of neutron star kick velocities, we assess in which medium pulsars are located as a function of time. We first derive the statistical properties of a fully synthetic Galactic population, and then apply the model to a selection of known pulsars to assess the likely nature of their environment. We show that pulsars escape into the ISM at around 200 kyr, significantly later than the values most commonly used in the literature. The majority of known pulsars with a confirmed TeV halo have high probabilities of still being in their parent environment, which suggests that efficient pair confinement is connected to the region influenced by progenitor stars. In order to test this idea, we provide the probability of still residing in the parent environment for a list of known pulsars.\n\n", "2507.01331": "2025-07-02, **Supernova Remnants with M dwarf surviving companions**, Kuo-Chuan Pan et.al., [2507.01331v1](http://arxiv.org/abs/2507.01331v1)\n\n We study the possibility that Type Ia supernovae might be produced by binary systems where the companion of the exploding white dwarf is an M-dwarf star. Such companion would appear as a runaway star, retaining its pre-explosion orbital velocity along with a kick imparted by the supernova ejecta. It might be rapidly rotating, from being tidally locked with the white dwarf prior to explosion in a very close binary. For this study, we perform a series of multidimensional hydrodynamic simulations to investigate the interaction between M-dwarf companions and SN ejecta, followed by post-impact stellar evolution modeling using the MESA code. Our initial models in the 3D simulations had high spin angular momenta and the effects of magnetic braking have been included. They very significantly reduce the final rotation.   A surviving companion candidate, MV-G272, has recently been discovered in the supernova remnant G272.2-3.2, which is an 8.9$\\sigma$ proper motion outlier, although being slowly rotating. Our results show that the properties of this companion (luminosity, effective temperature, surface gravity) can be reproduced by our post-impact M-dwarf models. The slow rotation, which is a common characteristic with several proposed hypervelocity SN companions, can be explained by magnetic braking during the post-impact evolution, thus supporting the possibility that the MV-G272 star is the surviving companion of the Type Ia supernova now found as G272.2-3.2 SNR.\n\n", "2507.01086": "2025-07-01, **A Mid-Thirties Crisis: Dissecting the Properties of Gravitational Wave Sources Near the 35 Solar Mass Peak**, Soumendra Kishore Roy et.al., [2507.01086v1](http://arxiv.org/abs/2507.01086v1)\n\n One striking feature of binary black hole (BBH) mergers observed in the first decade of gravitational-wave astronomy is an excess of events with component masses around $35\\,\\mathrm{M}\\_{\\odot}$. Multiple formation channels have been proposed to explain this excess. To distinguish among these channels, it is essential to examine their predicted population-level distributions across additional parameters. In this work, we focus on BBH mergers near the $35\\,\\mathrm{M}\\_{\\odot}$ peak and infer the population distributions of primary mass ($m\\_1$), mass ratio ($q$), effective spin ($\\chi\\_{\\rm eff}$), and redshift ($z$). We observe a gradual increase in the merger rate with $m\\_1$, rising by a factor of $3$ from $20\\,\\mathrm{M}\\_{\\odot}$ to a peak around $34\\,\\mathrm{M}\\_{\\odot}$, followed by a sharp, order-of-magnitude decline by $50\\,\\mathrm{M}\\_{\\odot}$. This population also shows a weak preference for equal-mass mergers and has a $\\chi\\_{\\rm eff}$ distribution skewed toward positive values, with a median of zero excluded at approximately $90\\%$ confidence. We find no significant $q-\\chi\\_{\\rm eff}$ correlation in the $35\\, \\mathrm{M}\\_{\\odot}$ peak population, suggesting that lower-mass systems ($m\\_1<20\\,\\mathrm{M}\\_{\\odot}$) likely drive the $q-\\chi\\_{\\rm eff}$ anti-correlation observed in the full BBH merger catalog. The redshift evolution of the merger rate is consistent with the cosmic star formation rate. We compare our findings with predictions from a wide range of formation channels. We find that common variants of the pair-instability supernova scenario, as well as hierarchical merger models, are incompatible with the observed features of the $35\\,\\mathrm{M}\\_{\\odot}$ population. Ultimately, none of the formation channels we consider can explain all or even most of the features observed in this population. The ''mid-thirties'' of black hole mergers are in crisis.\n\n", "2507.01084": "2025-07-01, **Proper Motion of the Neutron Star in the Supernova Remnant G18.9-1.1**, Tyler Holland-Ashford et.al., [2507.01084v1](http://arxiv.org/abs/2507.01084v1)\n\n In this paper, we present the first direct measurement of the proper motion of the neutron star (NS) in the supernova remnant (SNR) G18.9-1.1 using a 15-year Chandra baseline. After correcting the observations' astrometric solutions using reference Gaia stars' positions, we measure a total proper motion of 24.7 $\\pm$ 6.8 mas yr$^{-1}$ at an angle of $336^\\circ \\pm$ 16$^\\circ$ east of north. Using the distance estimates from literature of 2.1 kpc and 3.8 kpc, this proper motion corresponds to Galactic rotation-corrected transverse velocities of 264d$\\_{2.1}$ $\\pm$ 79 km s$^{-1}$ and 474d$\\_{3.8}$ $\\pm$ 129 km s$^{-1}$, respectively. Our power ratio method analysis of SNR ejecta slightly favors the higher velocity, as multipole moments calculated from the back-evolved center using the farther distance are more consistent with values from other CCSNRs. The NS's motion is directly opposite the motion of bulk ejecta in G18.9$-$1.1, providing yet more evidence that NS kicks are generated via a conservation of momentum-like process between the NS and the ejecta, as has been observed in other SNRs.\n\n", "2507.00946": "2025-07-01, **A binary origin of ultra-long period radio pulsars**, Ying-Han Mao et.al., [2507.00946v1](http://arxiv.org/abs/2507.00946v1)\n\n We propose a possible binary evolution model for the formation of ultra-long period pulsars (ULPPs). The model involves two key stages: first, a neutron star (NS) in wide binaries undergoes an effective spin-down phase through wind-fed accretion from its massive stellar companion; second, the supernova explosion of the companion leads to the disruption of the binary system, and produces two isolated compact stars. One of the them is the first-born, slowly rotating NSs, and our binary and spin evolution calculations show that the spin periods range from $\\lesssim 0.1$ s to $\\gtrsim 10^8$ s. This offers a possible formation channel for some of the long-period radio transients. We estimate that the formation rate of such systems in the Milky Way is approximately about $10^{-6}$ $\\rm yr^{-1}$.\n\n", "2507.00835": "2025-07-01, **Probing Generalized Emergent Dark Energy with DESI DR2**, Vipin kumar Sharma et.al., [2507.00835v1](http://arxiv.org/abs/2507.00835v1)\n\n As an update on the initial findings of DESI, the new results provide the first hint of potential deviations from a cosmological constant ($w=-1$), which, if confirmed with significance $>5\\sigma$, will falsify the $\\Lambda$CDM model. We consider a novel generalised form of an emergent dark energy model and confront this through various data sets (Baryon Acoustic Oscillation (BAO) data from Dark Energy Spectroscopic Instrument Data Release (DESI DR2), Type Ia Supernovae (SNe Ia) compilation, and Cosmic Microwave Background (CMB) distance priors) and simultaneously constrain the dark energy (DE) equation of state and energy density $f\\_{DE}(z)$. The results for the joint posteriors of cosmological parameters and the reconstructed dark energy EoS $w(z)$ with the energy density $f\\_{DE}(z)$ for various combinations of data sets are discussed, which favors quintessence nature. Specifically, $w(0) = -0.820$ with DESI DR2 + CMB, $-0.845$ with DESI DR2 + CMB + PP$^+$, $-0.828$ with DESI DR2 + CMB + Union3, and $-0.804$ with DESI DR2 + CMB + DESY5. We adopted a novel method to probe shifts in the generalized emergent dark energy (GEDE) parameter ($\\Delta$) by mapping 2D marginalized posterior distributions in the $\\Delta-\\Omega\\_{m0}$ plane. Our analysis consistently reveals a preference for negative $\\Delta$ across multiple combinations of observational datasets. Incorporating these values into the matter power spectrum further supports the GEDE framework's viability. We quantify the model's performance using the Bayes factor.\n\n", "2507.00478": "2025-07-01, **Hints of noncold dark matter? Observational constraints on barotropic dark matter with a constant equation of state parameter**, Yan-Hong Yao et.al., [2507.00478v1](http://arxiv.org/abs/2507.00478v1)\n\n This study investigates the potential of a cosmological model termed $\\Lambda w$DM, in which a cosmological constant play the role of dark energy and dark matter is barotropic and has a constant equation of state parameter ($w\\_{\\rm dm}$), to address the $S\\_8$ tension between early- and late- universe observations. By incorporating the latest cosmological datasets -- including Planck Cosmic Microwave Background (CMB), Baryon Acoustic Oscillation (BAO), Ia supernovae (SNe Ia), Redshift Space Distortions (RSD), and weak lensing (WL) -- we constrain the $\\Lambda w$DM compared to $\\Lambda$CDM. Our analysis reveals a marginal preference for a non-zero $w\\_{\\rm dm}=2.7^{+2.0}\\_{-1.9}\\times10^{-7}$( at 95\\% confidence level) when combining CMB, SDSS BAO, SNe Ia, RSD, and WL data, and a marginal preference for a non-zero $w\\_{\\rm dm} = 2.29^{+1.9}\\_{-2.0} \\times 10^{-7}$( at 95\\% confidence level) when combining CMB, DESI Y1 BAO, SNe Ia, RSD, and WL data. In addition, we find that, compared to $\\Lambda$CDM, $\\Lambda w$DM can alleviate the $S\\_8$ tension from $>3\\sigma$ to $<1\\sigma$. Furthermore, we find that, for CMB+SDSS+PP+RSD+WL datasets, the $\\Lambda w$DM model is close to being positively preferred over the $\\Lambda$CDM model.\n\n"}}