{"neutrino": {"2509.03441": "2025-09-03, **Boomerang mechanism explaining the excess radio background**, Bhupal Dev et.al., [2509.03441v1](http://arxiv.org/abs/2509.03441v1)\n\n We propose a {\\em boomerang mechanism} for the explanation of the excess radio background detected by ARCADE. In an early stage, at a temperature $T \\sim 100\\,{\\rm keV}$, a fraction of relic neutrinos is resonantly converted into dark neutrinos by mixing induced by a pre-existing lepton asymmetry. Dark neutrinos decay much later into a dark photon, mixed with photon, and a dark fermion, with a lifetime longer than the age of the Universe, as required by a solution to the excess radio background. This scenario circumvents the upper bound on the neutrino magnetic moment but still implies a testable lower bound.\n\n", "2509.03423": "2025-09-03, **Improved limit on the effective electron neutrino mass with the ECHo-1k experiment**, Fabienne Adam et.al., [2509.03423v1](http://arxiv.org/abs/2509.03423v1)\n\n The effective electron neutrino mass can be determined by analyzing the endpoint region of the $^{163}$Ho electron capture spectrum, provided a measurement with high energy resolution and high statistics using calorimetric techniques. Here, the Electron Capture in $^{163}$Ho collaboration, ECHo, presents an analysis of the most precise $^{163}$Ho spectrum currently available, obtained with the ECHo-1k experiment and comprising about 200 million events. A very low background rate of $B=9.1(1.3)\\times 10^{-6}$ /eV/pixel/day was achieved allowing for a reliable analysis of the endpoint region. The derived endpoint energy $Q = 2862(4)$ eV is in excellent agreement with the one independently determined via Penning-trap mass spectrometry of $Q=2863.2(6)$ eV [1]. The upper limit of the effective electron neutrino mass is improved by almost a factor 2 compared to the lowest current value [2], reaching $m\\_{\\nu\\_\\mathrm{e}} < 15 $ eV/c${^2}$ (90\\% credible interval).\n\n", "2509.03227": "2025-09-03, **Two-sector leptogenesis in a two-Higgs-doublet model with spontaneous CP violation**, Debashree Priyadarsini Das et.al., [2509.03227v1](http://arxiv.org/abs/2509.03227v1)\n\n The extension of the Standard Model (SM) field content with one inert Higgs doublet (IHD) and three right-handed neutrinos (RHNs) is a well-motivated approach. The key advantages of the model include the appearance of a weakly interacting massive particle (WIMP) like dark matter (DM) candidate from the neutral component of the IHD, along with the plausible explanation of the sub-eV mass range of SM neutrinos via the radiative seesaw mechanism. Additionally, the decay of RHNs can contextualize the baryon asymmetry of the universe via leptogenesis and is intricately connected to CP violation. Also, given the ongoing searches for light scalars at various experimental facilities, the extended Higgs sector of the model continues to be at the forefront. However, this scotogenic framework encounters a deficiency in providing the observed amount of relic density for a particular mass range $\\sim (80 - 500) $ GeV of its DM candidate, hence requiring further augmentation. Also, the WIMP scenarios have not yet resulted in conclusive hints at the direct detection experiments. In this context, our work is based on further extension of the above Scotogenic model by a dark sector. Additionally, considering the cosmic coincidence aspect, we operate within the framework of two-sector leptogenesis. To have a predictive flavor structure in the visible sector, we impose $A\\_4$ symmetry. Also, we adhere to spontaneous CP violation via complex vacuum expectation value of the falvon field, leading to a situation where there is only one CP-violating phase as a common connection between the visible and dark sectors. In our analysis, we find for the lightest RHN mass $\\sim 10^{10}$ GeV, our results are in good agreement with the observational ratio of relic densities, i.e., $\\Omega\\_{\\rm DM}/\\Omega\\_{\\rm b} \\sim 5$ for a few GeV range of mass of the dark sector DM candidate.\n\n", "2509.03089": "2025-09-03, **Wave-particle duality and entanglement in neutrino oscillation**, Rajrupa Benerjee et.al., [2509.03089v1](http://arxiv.org/abs/2509.03089v1)\n\n We analyze neutrino oscillations from the perspective of quantum complementarity by extending the familiar wave-particle duality into a exact triality relation among visibility, predictability, and entanglement. Using a density-matrix approach, we construct explicit measures of these quantities in both two- and three-flavor frameworks and show that they satisfy an exact conservation-like identity throughout oscillation evolution. In this picture, visibility corresponds to interference strength, predictability to flavor imbalance, and entanglement to the reduction of purity due to flavor correlations. We demonstrate that neutrino oscillations naturally exhibit regimes of maximal entanglement, vanishing coherence, and entanglement monogamy constraining flavor correlations. Our results establish that long-baseline neutrino oscillations realize the triality relation in an energy-dependent way, with T2K probing vacuum-like coherence entanglement balance and DUNE revealing the decisive role of matter e ects in redistributing the quantum information budget.\n\n", "2509.02988": "2025-09-03, **A Study on the Triggering of Nucleonic Direct Urca Processes in Neutron Stars of Specific Masses and Their Hyperon Dependence**, Yan Xu et.al., [2509.02988v1](http://arxiv.org/abs/2509.02988v1)\n\n This work aims to analyze how hyperons affect neutrino radiation properties in nucleonic direct URCA processes, expecting to provide useful references for finding evidence of the existence of hyperons in astronomical observations. This analysis is carried out using the GM1 and NL3 parameter sets under the SU(6) and SU(3) flavor symmetries in the relativistic mean field theory framework. Combined with the inferred mass and radius values of PSRs J1231-1411, J0030+0451, and J0740+6620, our results show that nucleonic direct Urca processes are absent in PSR J1231-1411 due to momentum conservation violation. In hyperon-containing PSR J0030+0451 (NL3 parameter set), the nucleonic direct Urca processes involving $e^{-}$/ $\\mu^{-}$ would occur. A large inferred mass span induces hyperon fraction variations, affecting neutrino emissivity. If the inferred mass of PSR J0030+0451 exceeds approximately 1.8 $M\\_{\\odot}$, the neutrino luminosity of the nucleonic direct Urca processes under the SU(3) flavor symmetry remains nearly the same as that in npe$\\mu$ matter, without depending on hyperons. However, it exhibits an obvious hyperon dependence under the SU(6) spin-flavor symmetry. For hyperon-containing J0740+6620, the nucleonic direct Urca processes under the SU(3) flavor symmetry in GM1 parameter set predicts faster neutrino luminosity decline with hyperonic fraction than npe$\\mu$ matter, and under the SU(6) spin-flavor symmetry in NL3 parameter set it shows monotonic decreasing trend. The research shows that hyperonic fraction significantly affect the neutrino radiation properties of the nucleonic direct URCA processes in neutron stars. Different-mass pulsars (e.g., PSRs J1231-1411, J0030+0451, J0740+6620) exhibit the distinct nucleonic direct URCA processes behaviors, dependent on inferred masses/radii, parameter sets, and theoretical models.\n\n", "2509.02711": "2025-09-02, **Constraining axial non-standard neutrino interactions with MINOS and MINOS+**, S. Abbaslu et.al., [2509.02711v1](http://arxiv.org/abs/2509.02711v1)\n\n We show that the neutral current data of the MINOS and MINOS+ experiments can provide information on the axial neutral current non-standard interactions of neutrinos with the $u$ and $d$ quarks; {\\it i.e.,} on $\\epsilon\\_{\\alpha \\beta}^{Aq}$. We derive bounds on the $ee$, $e\\tau$ and $\\tau \\tau$ components of these couplings and show that the MINOS(+) bounds on $\\epsilon^{Aq}\\_{e\\tau}$ and $\\epsilon^{Aq}\\_{\\tau\\tau}$ are currently the world leading ones. The bound on the isospin singlet case, $\\epsilon^{Au}\\_{\\tau\\tau}=\\epsilon^{Ad}\\_{\\tau\\tau}$ is of particular interest because while this isospin singlet NSI is theoretically motivated, it was practically unconstrained before these results.\n\n", "2509.02652": "2025-09-02, **Neutrino masses from an alternative approach to the seesaw mechanism**, M. A. De Andrade et.al., [2509.02652v1](http://arxiv.org/abs/2509.02652v1)\n\n An alternative approach to obtaining neutrino masses, distinct from the traditional seesaw mechanism, is proposed. This method relies on the simultaneous diagonalization of matrices derived from a twisted Lagrangian density of the neutrino matter sector. This approach avoids the need for introducing heavy Majorana neutrinos, thereby reducing the number of free parameters in the Standard Model (SM). We present numerical results for neutrino masses that align with experimental data, and we introduce a new parameter, $\\alpha\\_\\nu$, to fine-tune the mass differences $\\Delta m^2\\_{21}$ and $\\Delta m^2\\_{31}$. The proposed framework connects the neutrino mass generation mechanism to the known masses of quarks and charged leptons, providing an unified perspective on the matter sector of the Standard Model.\n\n", "2509.02321": "2025-09-02, **Neutrino phenomenology in a Standard Model extension with $\\mathbf{T^\\prime\\times Z_{10} \\times Z_2}$ symmetry**, V. V. Vien et.al., [2509.02321v1](http://arxiv.org/abs/2509.02321v1)\n\n We construct a Standard Model (SM) extension with $T^\\prime\\times Z\\_{10} \\times Z\\_2$ symmetry for generating the expected neutrino mass matrix with the relation $(M\\_\\nu)\\_{13}=(M\\_\\nu)\\_{31}=-\\frac{1}{2}(M\\_\\nu)\\_{22}$ via the contributions of the Type-I seesaw and Weinberg-type operators. The proposed model possesses viable parameters capable of predicting the neutrino oscillation parameters being in good agreement with recent constraints. Our analysis reveals the predicted regions for the physical quantities, given as follows. The two mass squared splittings are $\\Delta m\\_{21}^2\\in (69.450, 81.380)\\, \\mathrm{meV}^2$ and $\\Delta m\\_{31}^2\\in (2.544, 2.554)10^3\\,\\mathrm{meV}^2$ for normal ordering (NO) while $\\Delta m\\_{21}^2\\in (69.460, 81.390)\\, \\mathrm{meV}^2$ and $\\Delta m\\_{31}^2\\in (-2.461, -2.454)10^3\\,\\mathrm{meV}^2$ for inverted ordering (IO). The lightest neutrino mass is $m\\_{\\ell}\\in (34.500, 34.600)$ meV for NO and $m\\_{\\ell}\\in(35.21,\\, 35.32)$ meV for IO. The sum of neutrino mass is $\\sum m\\_\\nu \\in (131.300,\\, 131.400)$ meV for NO and $\\sum m\\_\\nu \\in (157.500,\\, 157.700)$ meV for IO. The Dirac CP phase is $\\delta\\_{CP}\\in (347.00, 348.00)^\\circ$ for NO and $\\delta\\_{CP}\\simeq 284.50^\\circ$ for IO, two Majorana phases are $\\alpha\\in (1.677, 1.915)^\\circ$ for NO and $\\beta\\in (2.036, 2.324)^\\circ$ for NO while $\\alpha\\in (358.100, 358.100)^\\circ$ and $\\beta\\in (1.123, 1.132)^\\circ$ for IO. Finally, the effective mass mass is $m\\_{\\mathrm{ee}}\\in (35.340, 35.430)$ meV for NO and $m\\_{\\mathrm{ee}}\\in (58.870, 58.950)$ meV for IO. Based on these results, the Yukawa-like couplings are estimated, which can naturally explain the charged - lepton as well as neutrino mass hierarchies.\n\n", "2509.02041": "2025-09-02, **Characterization of SiPMs at 40 K for neutrino coherent detection based on pure CsI**, Tao Liu et.al., [2509.02041v1](http://arxiv.org/abs/2509.02041v1)\n\n Silicon photomultiplier (SiPM), as the core photoelectric sensor for coherent neutrino detection in low-temperature pure CsI, its working performance directly determines the measurement accuracy of the scintillator light yield. Our previous research has fully demonstrated the performance of pure CsI at liquid nitrogen temperature. More intriguingly, its performance is expected to be even better at 40 K. However, the performance characteristics of SiPM in the 40 K temperature range still remain to be explored. In this study, a self-developed adjustable temperature control system ranging from 30 K to 293 K was built to investigate the key performance parameters of SiPM at different temperatures, such as single photoelectron spectrum, gain, breakdown voltage, dark count rate, after-pulse, internal crosstalk, and single photoelectron resolution. Special emphasis was placed on examining the key performance parameters of SiPM in the 40 K temperature range to evaluate its feasibility for light yield measurement in this temperature range. The results show that this study obtained the parameter variation trends and optimal working conditions of 3 types of SiPM at different temperatures, thereby improving the sensitivity of the detector. This research provides important technical support for low-temperature detection in neutrino physics experiments.\n\n", "2509.02035": "2025-09-02, **Signature of Majorana neutrinos in equal-sign W-production by lepton scattering**, J. W. van Holten et.al., [2509.02035v1](http://arxiv.org/abs/2509.02035v1)\n\n The question whether standard-model neutrinos are Dirac or Majorana particles is presently undecided. In principle it could be decided in favor of a Majorana signature if same-sign charged lepton scattering would be observed to produce $W$-boson pairs, which is a lepton-number violating process. The cross section of this scattering process is computed; depending on the initial state the result gives access to different components of the mass matrix. It could also shed light on physics beyond the standard model.\n\n"}, "dark matter": {"2509.03507": "2025-09-03, **Influence of Perfect Fluid Dark Matter on Shadow Observables of Yang-Mills modified charged black holes**, Md Sabir Ali et.al., [2509.03507v1](http://arxiv.org/abs/2509.03507v1)\n\n We investigate the influence of perfect fluid dark matter (PFDM) on Yang--Mills--inspired charged black holes, with a particular focus on the resulting modifications to key black hole observables. By embedding a PFDM term into the spacetime geometry, we examine the alterations in shadow morphology, photon geodesics, and the associated energy emission spectra. Our analysis reveals that PFDM induces notable deviations in the shadow size, shape, and circularity, and significantly impacts the stability of circular orbits. Furthermore, the energy emission rate exhibits a strong dependence on both the Yang--Mills charge and the dark matter distribution. These results indicate that environmental effects arising from dark matter can imprint observable signatures on black hole shadows and radiation processes, offering a potential pathway to constrain dark matter models and probe non-Kerr geometries with forthcoming high-precision observations such as those from the Event Horizon Telescope and next-generation interferometers.\n\n", "2509.03388": "2025-09-03, **Probing Heavy Dark Matter in Red Giants**, Sougata Ganguly et.al., [2509.03388v1](http://arxiv.org/abs/2509.03388v1)\n\n Red giants (RGs) provide a promising astrophysical environment for capturing dark matter (DM) via elastic scattering with stellar nuclei. Captured DM particles migrate toward the helium-rich core and accumulate into a compact configuration. As the DM population grows, it can become self-gravitating and undergo gravitational collapse, leading to adiabatic contraction through interactions with the ambient medium. The resulting energy release, through elastic scattering and, where relevant, DM annihilation during collapse, locally heats the stellar core and can trigger helium ignition earlier than that predicted by standard stellar evolution. We analyze the conditions under which DM-induced heating leads to runaway helium burning and identify the critical DM mass required for ignition. Imposing the observational constraint that helium ignition must not occur before the observed luminosity at the tip of the RG branch, we translate these conditions into bounds on DM properties. Remarkably, we find that RGs are sensitive to DM, particularly with masses around $10^{11} \\,{\\rm GeV}$ and spin-independent scattering cross sections near $10^{-37}\\,{\\rm cm}^2$, which is comparable to the reach of current terrestrial direct detection experiments.\n\n", "2509.03283": "2025-09-03, **A two-phase model of galaxy formation: IV. Seeding and growing supermassive black holes in dark matter halos**, Yangyao Chen et.al., [2509.03283v1](http://arxiv.org/abs/2509.03283v1)\n\n We present a theoretical framework for seeding and growing supermassive black holes (SMBHs) in dark-matter halos along their assembly histories. Seeds are bred out of Pop-III stars formed during the first collapse of pristine gas in mini-halos that have reached the ${\\rm H}\\_2$-cooling limit, modulated by UV radiation from star formation and dynamical heating from fast halo assembly. Such breeding persists until the enrichment of the intergalactic medium (IGM) enables Pop-II stars to form. Post-seeding growth of black holes (BHs) is driven by distinct channels, starting with episodic super-Eddington accretion associated with nuclear bursts induced by global disturbances of galaxies, followed by sustained sub-Eddington accretion via capturing sub-clouds formed in self-gravitating gas clouds (SGCs) in halos of fast assembly, and ending with merger-dominated, quiescent growth. We implement the model in subhalo merger trees to build a coherent framework to follow the SMBH-galaxy-halo co-evolution over their full lives in the full structure hierarchy. BH seeds are bred with a broad mass spectrum of $M\\_{\\rm BH} = 10$--$10^5\\,{\\rm M}\\_\\odot$ at $z \\approx 20$--$30$ in mini-halos with masses of $10^5$--$10^8\\,{\\rm M}\\_\\odot$. Nuclear bursts provide the key condition for seeds to grow into SMBHs. The $M\\_{\\rm BH}$-$M\\_*$ relation is a multi-piece, redshift-dependent function shaped by the interplay among different growth channels. Our model predictions are broadly consistent with existing observations; especially, a population of BHs reminiscent of `little red dots' (LRDs) discovered by JWST naturally results from the seeding and growing processes. Potential future tests of the model are discussed.\n\n", "2509.03272": "2025-09-03, **Amplified capture rate of dark matter in compact binaries and constraints on bosonic dark matter from GW170817**, János Takátsy et.al., [2509.03272v1](http://arxiv.org/abs/2509.03272v1)\n\n The accretion of dark matter (DM) onto compact objects and the potential gravitational collapse of neutron stars due to this accretion has become a promising indirect probe of DM properties, complementing terrestrial experiments. We show that the accretion flux of DM on stellar objects is amplified in binary systems due to the complex gravitational interaction of said particles with the binary. We perform few-body Monte Carlo simulations to show that this amplification factor is $\\sim4-5$ for circular binaries, small DM velocity dispersions and mass ratios $q\\gtrsim0.3$. We use this factor to improve previous constraints on the scattering cross section of non-annihilating bosonic DM with baryonic matter, and derive upper bounds on this cross section from the observation of the binary NS merger associated with GW170817. We also show that the maximally accretable mass fraction of DM by binary NSs is $\\lesssim10^{-3}$, even for extreme DM densities only possible in DM spikes, due to the dynamical friction exerted by the ambient DM.\n\n", "2509.03184": "2025-09-03, **Tidally induced bar-like galaxies in simulated clusters**, Ewa L. Lokas et.al., [2509.03184v1](http://arxiv.org/abs/2509.03184v1)\n\n One of the scenarios for bar formation in galaxies involves their interaction with a more massive companion. The stellar component is then transformed from a disk into a bar-like prolate spheroid. I investigated a subsample of 77 bar-like galaxies tidally induced in the cluster environment, selected among the previously studied sample of bar-like galaxies from the IllustrisTNG simulations. I present six clear, convincing examples of bar-like galaxies formed after an interaction with a progenitor of a massive brightest cluster galaxy (BCG) and describe the properties of their bars. For the whole sample, the time of bar formation is strongly correlated with and typically slightly greater than the time of the pericenter passage. All galaxies are strongly stripped of dark matter and gas, and their rotation is similarly diminished. A larger pericenter distance typically requires a higher host mass in order to transform the galaxy, but the interactions show no preference for prograde configurations. The final strength of the bars does not correlate with the amount of tidal stripping experienced because of the variety of initial properties of the progenitors and the subsequent evolution over the next pericenter passages. In spite of difficulties in the interpretation of some cases involving mergers and multiple interactions, the results confirm in the cosmological context the reality of tidal bar formation in cluster environments previously studied using controlled simulations.\n\n", "2509.03167": "2025-09-03, **The slow evolution of dark matter halos from cusp to core naturally produces extended stellar core-like distributions**, Jorge Sanchez Almeida et.al., [2509.03167v1](http://arxiv.org/abs/2509.03167v1)\n\n Motivated by the observation of extended stellar cores in dark matter (DM) dominated dwarf galaxies, this study investigates a simple mechanism by which stellar cores can form as a result of DM halo expansion. Several non-CDM models predict that the DM distribution thermalizes over time, transforming initially cuspy halos into cores. This transformation weakens the gravitational potential, allowing the stellar component to expand and form diffuse, core-like structures. Using analytical models and adiabatic invariants, we examine stellar systems with purely tangential, purely radial, and isotropic orbits evolving under a slowly changing potential. Across a wide range of initial and final conditions, we find that stellar cores form relatively easily, though their properties depend sensitively on these conditions. Orbit types preserve their nature during the DM halo expansion: tangential and radial orbits remain so, while isotropic orbits remain nearly isotropic in the central regions. Systems with circular orbits develop stellar cores when the initial stellar density logarithmic slope lies between -0.5 and -1.2, whereas radial systems do not form cores. Isotropic systems behave similarly to tangential ones, producing cores that are isotropic in the center but develop increasing radial anisotropy outward; the anisotropy parameter \"beta\" grows from sim 0.07 at the core radius to sim 0.5 at three core radii. The theoretical and observational literature suggests initial DM profiles with steep slopes and stellar distributions that are shallower and isotropic at the center. Given these conditions, the mechanism predicts stellar cores with radii at least 40 % that of the DM core and inner logarithmic slopes shallower than 0.6.\n\n", "2509.03165": "2025-09-03, **PatchNet: A hierarchical approach for neural field-level inference from Quijote Simulations**, Anirban Bairagi et.al., [2509.03165v1](http://arxiv.org/abs/2509.03165v1)\n\n \\textit{What is the cosmological information content of a cubic Gigaparsec of dark matter? } Extracting cosmological information from the non-linear matter distribution has high potential to tighten parameter constraints in the era of next-generation surveys such as Euclid, DESI, and the Vera Rubin Observatory. Traditional approaches relying on summary statistics like the power spectrum and bispectrum, though analytically tractable, fail to capture the full non-Gaussian and non-linear structure of the density field. Simulation-Based Inference (SBI) provides a powerful alternative by learning directly from forward-modeled simulations. In this work, we apply SBI to the \\textit{Quijote} dark matter simulations and introduce a hierarchical method that integrates small-scale information from field sub-volumes or \\textit{patches} with large-scale statistics such as power spectrum and bispectrum. This hybrid strategy is efficient both computationally and in terms of the amount of training data required. It overcomes the memory limitations associated with full-field training. We show that our approach enhances Fisher information relative to analytical summaries and matches that of a very different approach (wavelet-based statistics), providing evidence that we are estimating the full information content of the dark matter density field at the resolution of $\\sim 7.8~\\mathrm{Mpc}/h$.\n\n", "2509.03027": "2025-09-03, **A MUltiwavelength Study of ELAN Environments (AMUSE$^2$): The Impact of Dense Environment on Massive Dusty Star-Forming Galaxies at Cosmic Noon**, Yu-Jan Wang et.al., [2509.03027v1](http://arxiv.org/abs/2509.03027v1)\n\n To understand how massive galaxies are influenced by their surroundings, we present new ALMA and NOEMA observations as part of A MUltiwavelength Study of ELAN Environments (AMUSE$^2$). These observations target submillimeter sources discovered in single-dish surveys around nine quasars hosting Ly$\\alpha$ nebulae at $z=2\\sim3$, including two Enormous Ly$\\alpha$ nebulae (ELANe). Through detection of mid-$J$ CO lines, we confirm physical associations of 15 SMGs, which are located outside the expected virial radii of the central dark-matter halos hosting the quasars. We find $73^{+29}\\_{-21}\\%$ of SMGs have line profiles better described by double Gaussian models, with a median peak-to-peak separation of 350 $\\pm$ 25 km/s, suggesting rotating disks or interacting pairs. Modified blackbody fits of the far-infrared photometry yield a median $\\beta$ of 2.0 $\\pm$ 0.2 and $T\\_{dust}$ of 34 $\\pm$ 3 K. Overall, SMGs outside quasar halos share similar physical properties with those in the field, but combining data from other studies reveals depleted gas fractions within quasar halos. This suggests that dense environments significantly impact massive star-forming galaxies only within halo scales at cosmic noon. Additionally, spatial analyses of 15 SMGs indicate they trace large-scale structures, possibly filamentary or elongated pancake-like, with a scale height of 2-5\\,cMpc. Our measured distributions and densities of star-formation rates align with models, though likely represent lower limits.\n\n", "2509.02945": "2025-09-03, **Observational challenges to holographic and Ricci dark energy paradigms: Insights from ACT DR6 and DESI DR2**, Peng-Ju Wu et.al., [2509.02945v1](http://arxiv.org/abs/2509.02945v1)\n\n Recent studies suggest that dark energy may be dynamical rather than being a mere cosmological constant $\\Lambda$. In this work, we examine the viability of two physically well-motivated dynamical dark energy models -- holographic dark energy (HDE) and Ricci dark energy (RDE) -- by confronting them with the latest observational data, including ACT cosmic microwave background anisotropies, DESI baryon acoustic oscillations, and DESY5 supernovae. Our analysis reveals a fundamental tension between early- and late-universe constraints within both frameworks: ACT favors a quintom scenario where the dark energy equation of state (EoS) evolves from $w>-1$ at early times to $w<-1$ at late times, while DESI+DESY5 exhibits a distinct preference for quintessence where $w>-1$ across cosmic evolution. The joint analysis yields constraints that align more closely with the ACT preference. Critically, the canonical RDE model fails to provide a coherent description of cosmic evolution, as it manifests severe tensions (even exceeding $10\\sigma$ significance) between early- and late-universe parameter reconstructions. Based on the combined data, Bayesian evidence decisively disfavors both HDE and RDE models relative to the $\\Lambda$ cold dark matter model, with ACT providing decisive disfavor and DESI+DESY5 yielding moderate disfavor. Our results show that the HDE and RDE models remain excluded by the new data, reinforcing earlier conclusions drawn from previous datasets.\n\n", "2509.02821": "2025-09-02, **Searching for Dark Pions with the MoEDAL-MAPP Detector at the LHC**, Shafakat Arifeen et.al., [2509.02821v1](http://arxiv.org/abs/2509.02821v1)\n\n We investigate the potential for detecting pion-like dark matter within the framework of a Strongly Interacting Massive Particle (SIMP) model using the MoEDAL Apparatus for Penetrating Particles (MAPP) at the LHC. The model, motivated by Chiral Perturbation Theory, features milli-charged dark pions that couple to Standard Model particles via kinetic mixing with a dark photon. Production channels considered include Drell--Yan pair production and photon fusion via the Wess--Zumino--Witten term, the latter providing a distinctive three-body final state signature. Cross-sections are computed using MadGraph and WHIZARD for a range of dark pion masses, decay constants, and dark $Z$ boson masses. Sensitivity projections for MAPP-1 during the High-Luminosity LHC phase are presented under a background-free assumption, showing competitive reach into previously unexplored parameter space for milli-charged dark pseudoscalars. These results highlight the complementary role of MoEDAL-MAPP in probing dark sector models and motivate further detector-level simulations to refine exclusion limits.\n\n", "2509.02781": "2025-09-02, **Updated bounds on ultra-light dark matter from the tiniest galaxies**, Simon May et.al., [2509.02781v1](http://arxiv.org/abs/2509.02781v1)\n\n The particle mass of dark matter (DM) was previously constrained using kinematics of ultra-faint dwarf galaxies to $m > 3 \\times 10^{-19}\\,\\mathrm{eV}$. This constraint, which excludes the \"fuzzy\" range of ultra-light dark matter from comprising all of the DM, relies on an estimate of the heating rate from fuzzy dark matter (FDM) wave interference using linear perturbation theory. Here, we compare the results of this perturbative calculation to full Schr\\\"odinger-Poisson simulations of the evolution of star particles in FDM halos. This comparison confirms theoretical expectations that FDM heating is stronger in fully nonlinear simulations due to the formation of a dense central soliton whose fluctuations enhance gravitational perturbations, and that bounds on the DM particle mass using this perturbative method are indeed conservative. We also show that these bounds are not affected by possible tidal stripping, since for dwarf satellites like Segue 1, the tidal radius is much larger than the observed size of the galaxy. We further show that the constraints on the mass cannot be evaded by invoking DM self-interactions, due to constraints on the self-interaction from large-scale structure. Lastly, we show that if the recently discovered system Ursa Major III/UNIONS I is a galaxy, the observed properties of this object strengthen the lower bound on the DM mass by over an order of magnitude, to $m > 8 \\times 10^{-18}\\,\\mathrm{eV}$, at 95% confidence. This constraint could further be strengthened considerably by more precise measurements of the size and velocity dispersion of this and other similar galaxies, and by using full Schr\\\"odinger-Poisson simulations.\n\n", "2509.02744": "2025-09-02, **Exploring Fermionic Dark Matter in the Presence of Scalar Leptoquarks**, Shyamashish Dey et.al., [2509.02744v1](http://arxiv.org/abs/2509.02744v1)\n\n We study an extension of the vector-like lepton dark matter model by introducing scalar leptoquarks that modify the properties of the vector-like lepton dark matter candidate, helping it evade stringent direct detection constraints. In the minimal setup, the neutral component of a pure $SU(2)$ doublet vector-like lepton fails to simultaneously account for the observed relic abundance while remaining consistent with current direct detection limits. We show that the addition of the scalar leptoquarks can induce corrections to the mass of the vector-like lepton dark matter, splitting it into two non-degenerate pseudo-Dirac states. This mass splitting can help evade the direct detection bounds naturally. In addition, the extended setup also opens up a larger parameter space of the model that can accommodate the correct relic density.\n\n", "2509.02728": "2025-09-02, **Saturation of Chaos Bound in a Phenomenological Rotating Black Hole--Effective Matter System at Low-Temperature Limit**, Reza Pourkhodabakhshi et.al., [2509.02728v1](http://arxiv.org/abs/2509.02728v1)\n\n We study the chaotic behavior of a phenomenological system of rotating black holes (BHs) surrounded by radiation, dust, and dark matter as effective matter fluids. We show that the chaos bound is saturated -- but never violated -- when the density parameter $k \\rightarrow 1$, which corresponds to a high dark matter concentration in the halo. This saturation is independent of radiation and dust density, occurring in the low-temperature regime where the BH's surface gravity and Hawking temperature decrease. Our results suggest that rotating BHs subjected to a phenomenological representation of a more realistic matter environment can scramble information as efficiently as allowed by physical laws in this limit. This work links quantum chaos research with phenomenological BH-matter configurations, providing a motivation for studies of chaos in astrophysical BHs.\n\n", "2509.02700": "2025-09-02, **Hierarchical assembly impedes the inference of stellar mass growth histories for individual galaxies**, R. K. Cochrane et.al., [2509.02700v1](http://arxiv.org/abs/2509.02700v1)\n\n Some massive, quiescent galaxies at z>3 appear to contain considerable numbers of old stars (forming at z>7). Works inferring the star formation histories of at least one such galaxy observed with JWST have suggested that the assembly of so much stellar mass so early may challenge the well-established Cold Dark Matter (CDM) cosmological framework, or else indicate extraordinarily high past star formation efficiencies. However, these studies implicitly assume that all the stars in place at the epoch of observation assembled in-situ, i.e. in a single galaxy. In hierarchical models like CDM, massive galaxies assemble following successive mergers of smaller galaxies. Thus, inferences of the growth of stellar mass using the ages of stars within a descendant massive galaxy will be biased. In this paper, I use the TNG100 simulation to quantify this bias across a range of descendant galaxy masses and redshifts, for inferences made for different past epochs. I demonstrate that the assumption of in-situ stellar mass assembly can lead to significant biases in inferred stellar mass histories, with historic (i.e. looking back from the epoch of observation) stellar masses overestimated by over an order of magnitude in some cases. The bias increases with increasing halo mass, for inferences made further from the epoch of observation, and with decreasing descendant galaxy redshift. I derive corrections that can be applied to inferred stellar mass histories for more robust comparisons with dark matter halo mass functions at high redshift.\n\n", "2509.02694": "2025-09-02, **Self-similar kinetics for gravitational Bose-Einstein condensation**, A. S. Dmitriev et.al., [2509.02694v1](http://arxiv.org/abs/2509.02694v1)\n\n We study an overpopulated gas of gravitationally interacting bosons surrounding a droplet of Bose-Einstein condensate - Bose star. We argue that kinetic evolution of this gas approaches with time a self-similar attractor solution to the kinetic equation. If the scale symmetry of the equation is broken by external conditions, the attractor solution exists, remains approximately self-similar, but has slowly drifting scaling dimension. The latter new regime of adiabatic self-similarity can determine growth of dark matter Bose stars in cosmological models.\n\n", "2509.02678": "2025-09-02, **Resonant Scattering of Boosted Dark Matter**, Joshua Berger et.al., [2509.02678v1](http://arxiv.org/abs/2509.02678v1)\n\n We develop a simulation within GENIE of the excitation of baryonic resonances by boosted dark matter. This work completes the simulation of all scattering modes for dark matter entering a detector at relativistic speeds. At some boosts, resonant scattering can contribute over 30% to the scattering rate. This channel offers a potentially powerful probe of the isospin structure of dark matter interactions via the relative prominence of the isospin-changing $\\Delta$ resonance. We study the estimated sensitivity of large volume detectors such as DUNE, Hyper-Kamiokande, and JUNO to all dark matter scattering modes and demonstrate the expected improvement in sensitivity when resonant scattering is included.\n\n", "2509.02672": "2025-09-02, **Baryonic Ecosystem IN Galaxies (BEINGMgII) -- III. Cool gas reservoirs at $0.3 \\le z \\le 1.6$ in the Dark Energy Survey**, Reena Chaudhary et.al., [2509.02672v1](http://arxiv.org/abs/2509.02672v1)\n\n We investigate the origin of intervening cool MgII absorption detected in the spectra of background quasars and the nature of associated galaxies across a broad redshift range of $0.3 \\le z \\le 1.6$. Using nebular [O II] $\\lambda\\lambda$3727,3729 emission lines identified in DESI fiber spectra centered on quasar, we detect 377 galaxies at a typical detection rate of $\\sim$0.45% at $z \\lesssim 1$, which increases with MgII equivalent width ($W\\_{2796}$). A significant fraction (74%) of these galaxies are associated with strong absorbers with $W\\_{2796} \\ge$ 2\\r{A}. These absorbers trace galaxies spanning stellar masses of $\\rm 8.4 \\le \\log(M\\_{\\star}/M\\_{\\odot}) \\le 11.6$ and star formation rates (SFRs) of $\\rm -1.2 \\le log(SFR~[M\\_{\\odot}yr^{-1}]) \\le 2.7$, located at projected galactocentric distances of 4-24 kpc. We find the average MgII absorber strength increases from 2.1\\r{A} to 2.9\\r{A} between redshifts $z \\sim$ 0.4 and 1.2, indicating evolution in the cool gas content of galaxy halos. The relatively constant absorber strength with galactocentric distance implies a clumpy structure of cool gas in the circumgalactic medium (CGM). Further, we find a positive correlation between $W\\_{2796}$ versus $M\\_\\star$, and SFR, suggesting that the distribution of metal-enriched cool gas in the CGM is closely tied to the properties of the host galaxies. The redshift evolution of gas-phase metallicity suggests that strong MgII absorbers trace the general population of star-forming galaxies. The velocity dispersion of the cool gas increases with halo mass, and the wide range of line of sight velocity offset (-389 to 364 $\\rm km\\ s^{-1}$) between the galaxy systemic velocity and absorbers highlights the dynamical nature of CGM. However, the majority of this gas remains gravitationally bound to the dark matter halos, consistent with a picture of gas recycling via galactic fountains.\n\n", "2509.02660": "2025-09-02, **Detecting the hidden population of low-mass haloes in strong lenses**, Conor M. O'Riordan et.al., [2509.02660v1](http://arxiv.org/abs/2509.02660v1)\n\n A generic prediction of particle dark matter theories is that a large population of dark matter substructures should reside inside the host haloes of galaxies. In gravitational imaging, strong gravitational lens observations are used to detect individual objects from this population, if they are large enough to perturb the strongly lensed images. We show here that low-mass haloes, below the individually detectable mass limit, have a detectable effect on the lensed images when in large numbers, which is the case in cold dark matter (CDM). We find that, in CDM, this population causes an excess of 40 per cent in the number of detected subhaloes for HST-like strong lens observations. We propose a pseudo-mass function to describe this population, and fit for its parameters from the detection data. We find that it mostly consists of objects two orders of magnitude in mass below the detection limit of individual objects. We show that including this modification, so that the effect of the population is correctly predicted, can dramatically improve the available constraints on dark matter from strong lens observations. We repeat our experiments using models that contain varying amounts of angular structure in the lens galaxy. We find that these multipole perturbations are strongly degenerate with the population signal, to an even greater extent than with individual subhaloes. This further highlights the need for better understanding of the angular mass structure of lens galaxies, so that the maximum information can be extracted from strong lens observations for dark matter inference.\n\n", "2509.02546": "2025-09-02, **Chemodynamics of BoötesI with $S^{5}$: Revised Velocity Gradient, Dark Matter Density, and Galactic Chemical Evolution Constraints**, Nathan R. Sandford et.al., [2509.02546v1](http://arxiv.org/abs/2509.02546v1)\n\n We combine new spectroscopic observations of the ultra faint dwarf galaxy (UFD) Bo\\\"otes I (Boo I) from the Southern Stellar Stream Spectroscopic Survey ($S^{5}$) with $\\sim$15 years of archival spectroscopic data to create the largest sample of stellar kinematics and metallicities to date in any Milky Way UFD. Our combined sample includes 148 members extending out to $\\sim$7 half-light radii ($r\\_h$), including 24 newly confirmed members, 18 binary candidates, 15 RR Lyrae stars, and 92 [Fe/H] measurements. Using this larger and more spatially extended sample, we provide updated constraints on Boo I's systemic properties, including its radial population gradients. Properly accounting for perspective rotation effects in a UFD for the first time, we detect a $4\\sigma$ line-of-sight velocity gradient of $1.2\\pm0.3$ km s$^{-1}$ $r\\_h^{-1}$ aligned along Boo I's orbit and discuss its potential tidal origins. We also infer a metallicity gradient of $-0.10\\pm0.02$ dex $r\\_h^{-1}$ in agreement with previous studies. Using an axisymmetric Jeans model, we provide updated constraints on Boo I's dark matter density profile, which weakly favor a cusped ($\\gamma=1.0^{+0.5}\\_{-0.6}$) dark matter profile. Lastly, we re-analyze Boo I's metallicity distribution function with a one-zone galactic chemical evolution model and place new constraints on its rapid, inefficient star formation and strong galactic outflows.\n\n", "2509.02325": "2025-09-02, **Role of density profile of sub-GeV dark matter in the properties of dark matter admixed quark stars with Bayesian analysis of dark-NJL model**, Debashree Sen et.al., [2509.02325v1](http://arxiv.org/abs/2509.02325v1)\n\n We investigate the structural and oscillation properties of dark matter (DM) admixed strange quark stars (DMSQSs). The strange quark matter (SQM) is described with the well-known Nambu-Jona-Lasino (NJL) model and the self-interacting fermionic DM is included in a systematic manner. The self-interaction of DM is of four-Fermi type and the overall DM density is considered as a function of the baryon density of SQM with two free parameters ($\\alpha$, $\\rho\\_{sc}$). This work is the first to consider four-Fermi interactions between fermionic DM and SQM in DMSQSs. Certain experiments like LZ, XENON, DarkSide, CRESST, and LHC have almost ruled out the possibility of contact interaction between SQM and massive DM (in GeV order). Recently, the quest for sub-GeV DM has garnered significant attention. We show that recent astrophysical constraints on the structural properties of compact stars also do not support the presence of massive DM in DMSQSs. On the other hand, we find sub-GeV DM to successfully concur with such observational constraints. We also calculate the fundamental $f$-mode frequency ($f\\_f$) of the DMSQSs, which shows universality with compactness, mean density, and tidal deformability. Further, we investigate the prospect of detection of $f\\_f$ with respect to the projected sensitivity of upcoming gravitational wave detectors like aLIGO, A+, Cosmic Explorer, and Einstein Telescope. In our DMSQS model, the three free parameters are $\\alpha$, $\\rho\\_{sc}$, and the ratio of repulsive to attractive interaction in SQM ($G\\_V/G\\_S$), which are optimized by Bayesian analysis in light of various recent astrophysical data.\n\n", "2509.02301": "2025-09-02, **A congruous approach with realistic cross section towards limiting sub-GeV dark matter from LUX-ZEPLIN**, Atanu Guha et.al., [2509.02301v1](http://arxiv.org/abs/2509.02301v1)\n\n We present constraints on sub-GeV dark matter (DM) through the mechanism of being boosted by cosmic rays (CRs). We utilize the nuclear recoil data from the LUX-ZEPLIN (LZ) experiment for this purpose. Without the mechanism of boosted dark matter (BDM), sub-GeV DM particles are cold enough to produce detectable nuclear recoil in the LZ experiment above the detector threshold. We choose to work with the leading components of cosmic rays to take into account the boost due to them towards the cold DM. In the present discussion we worked on models consisting of a Dirac fermion $\\chi$ with a new $U(1)'$ gauge symmetry and DM particles have non-zero coupling to the nucleons as per the model parameters. Specific examples of the energy dependence of the scattering cross section have been invoked through the secluded dark photon model and $U(1)\\_{B-L}$ model. Additionally, we present the upper bound on the interaction cross section due to the Earth shielding effect in the light of a systematic analysis of the energy loss by the BDM while traveling to the underground detector through the Earth's crust.\n\n", "2509.02193": "2025-09-02, **Primordial black holes in the main lensing galaxy of FBQ 0951+2635**, Daniel Isla et.al., [2509.02193v1](http://arxiv.org/abs/2509.02193v1)\n\n Although dark matter in galaxies may consist of elementary particles different from those that make up ordinary matter and that would be smoothly distributed (still undetected), the so-called primordial black holes (PBHs) formed soon after the initial Big Bang are also candidates to account for a certain fraction of mass in galaxies. In this paper, we focused on the main lensing galaxy ($z$ = 0.260) of the doubly imaged gravitationally lensed quasar FBQ 0951+2635 ($z$ = 1.246) for probing possible PBH populations. Assuming that the mass of the galaxy is due to smoothly distributed matter (SDM), stars, and PBHs, the 16-yr observed microlensing variability was compared in detail with simulated microlensing signals generated by 90 different physical scenarios. Among other details, the simulated signals were sampled as the observed one, and the observed variability in its entirety and over the long term were used separately for comparison. While none of the scenarios considered can reproduce the overall observed signal, the observed long-term variability favours a small mass fraction in PBHs with a mass of the order of the mean stellar mass. Furthermore, it is possible to obtain strong constraints on the galaxy mass fraction in Jupiter-mass PBHs, provided that a reverberation-based measurement of the source size is available and relatively small. To constrain the mass fraction in $\\sim$10 $\\rm{M\\_{\\odot}}$ PBHs, light curves five times longer are probably required.\n\n", "2509.02122": "2025-09-02, **Gravitational waves induced by matter isocurvature in general cosmologies**, Guillem Domènech et.al., [2509.02122v1](http://arxiv.org/abs/2509.02122v1)\n\n The expansion history and content of the Universe between the end of inflation and the onset of Big Bang Nucleosynthesis is mostly unknown. In this paper, we study gravitational waves (GWs) induced by matter isocurvature fluctuations in a generic perfect fluid background as a novel probe of the physics of the very early Universe. We analytically compute the induced GW kernel and analyze the spectral GW energy density for a sharply peaked isocurvature power spectrum. We show that the spectral shape of the GW signal is sensitive to the equation of state parameter $w$ of the perfect fluid dominating the early Universe after inflation. We find that the GW amplitude is enhanced for a soft equation of state. Our framework can be applied to dark matter isocurvature and models leading to early matter-dominated eras, such as primordial black holes and cosmological solitons.\n\n", "2509.02016": "2025-09-02, **A bar stability criterion distinguishing between modified gravity and dark matter in galaxies**, Tahere Kashfi et.al., [2509.02016v1](http://arxiv.org/abs/2509.02016v1)\n\n This paper presents a study on the distinguishability of dark matter and Modified Newtonian Dynamics (MOND) at galactic scales based on the stability criterion proposed by Efstathiou, Lake, and Negroponte (ELN criterion). First, we test the statistical validity of this stability criterion against the presence of bars within the SPARC and CALIFA databases, successfully identifying $\\sim 70\\%$ of barred galaxies. Then, we employ a series of N-body galaxy simulations to exhibit a direct observable difference between the dark matter and MOND theoretical frameworks, at least in gas-poor galaxies. We present N-body models that satisfy the stability requirement of the ELN criterion, and so are stable against bar formation in the presence of a dark matter halo, and that do actually exhibit bar instabilities in MOND. On the other hand, the question of how to inhibit bar formation in gas-poor galaxies in MOND is posed, and requires a detailed investigation of the external field effect.\n\n", "2509.01860": "2025-09-02, **Does the high-energy AMS-02 positron flux originate from the dark matter density spikes around nearby black holes?**, Man Ho Chan et.al., [2509.01860v1](http://arxiv.org/abs/2509.01860v1)\n\n Recent measurements made by the Alpha Magnetic Spectrometer (AMS) have detected accurate positron flux for energy range 1-1000 GeV. The energy spectrum can be best described by two source terms: the low-energy background diffusion term and an unknown high-energy source term. In this article, we discuss the possibility of the emission of positrons originating from dark matter annihilation in two nearby black hole X-ray binaries A0620-00 and XTE J1118+480. We show that the dark matter density spikes around these two black holes can best produce the observed AMS-02 high-energy positron flux due to dark matter annihilation with rest mass $m\\_{\\rm DM} \\approx 8000$ GeV via the $W^+W^-$ annihilation channel. This initiates a new proposal to account for the unknown high-energy source term in the AMS-02 positron spectrum.\n\n"}, "supernova": {"2509.03101": "2025-09-03, **The role of peculiar velocity uncertainties in standard siren cosmology**, Chris Blake et.al., [2509.03101v1](http://arxiv.org/abs/2509.03101v1)\n\n Local distance indicators such as standard sirens, in combination with spectroscopic redshift measurements of their host galaxies, allow us to estimate the present-day expansion rate of the Universe parameterised by Hubble's constant, H\\_0. However, these observed redshifts are systematically modified by the effect of galaxy peculiar velocities. Although these velocities may be estimated from the local density field by the process of velocity-field reconstruction, the intrinsic errors and covariance in these estimates contribute to the error in the H\\_0 determination. In this paper we demonstrate how the impact of peculiar velocities can be propagated into H\\_0 measurements from local distance indicators with observed redshifts, incorporating the full covariance of the velocity field induced by bulk flows. We apply our methods to cosmological simulations, testing the importance of this effect in the context of future analyses of gravitational wave sources with electromagnetic counterparts used as bright sirens. We conclude that H\\_0 errors may be increased by up to a factor of 2 in comparison with neglecting peculiar velocity covariance, with the highest impacts expected for sources at nearby distances or with small distance errors. Our analytical methods may also be applied to other local distance indicators, such as Type Ia supernovae.\n\n", "2509.02945": "2025-09-03, **Observational challenges to holographic and Ricci dark energy paradigms: Insights from ACT DR6 and DESI DR2**, Peng-Ju Wu et.al., [2509.02945v1](http://arxiv.org/abs/2509.02945v1)\n\n Recent studies suggest that dark energy may be dynamical rather than being a mere cosmological constant $\\Lambda$. In this work, we examine the viability of two physically well-motivated dynamical dark energy models -- holographic dark energy (HDE) and Ricci dark energy (RDE) -- by confronting them with the latest observational data, including ACT cosmic microwave background anisotropies, DESI baryon acoustic oscillations, and DESY5 supernovae. Our analysis reveals a fundamental tension between early- and late-universe constraints within both frameworks: ACT favors a quintom scenario where the dark energy equation of state (EoS) evolves from $w>-1$ at early times to $w<-1$ at late times, while DESI+DESY5 exhibits a distinct preference for quintessence where $w>-1$ across cosmic evolution. The joint analysis yields constraints that align more closely with the ACT preference. Critically, the canonical RDE model fails to provide a coherent description of cosmic evolution, as it manifests severe tensions (even exceeding $10\\sigma$ significance) between early- and late-universe parameter reconstructions. Based on the combined data, Bayesian evidence decisively disfavors both HDE and RDE models relative to the $\\Lambda$ cold dark matter model, with ACT providing decisive disfavor and DESI+DESY5 yielding moderate disfavor. Our results show that the HDE and RDE models remain excluded by the new data, reinforcing earlier conclusions drawn from previous datasets.\n\n", "2509.02687": "2025-09-02, **ZTF SN Ia DR2 follow-up: Exploring the origin of the Type Ia supernova host galaxy step through Si II velocities**, U. Burgaz et.al., [2509.02687v1](http://arxiv.org/abs/2509.02687v1)\n\n The relationship between Type Ia supernovae (SNe Ia) and their host galaxy stellar masses is well documented. In particular, Hubble residuals display a luminosity shift based on host mass, known as the mass step, which is often used as an extra correction in the standardisation of SN Ia luminosities. Here we investigate Hubble residuals and the mass step in the context of Si II $\\lambda 6355$ velocities, using 277 near-peak SNe Ia from ZTF DR2. We divide the sample into high-velocity (HV) and normal-velocity (NV) SNe Ia, separated at 12,000 km/s, resulting in 70 HV and 207 NV objects. We then examine links between Si II $\\lambda$6355 velocities, light-curve stretch $x\\_{1}$, colour $c$, and host properties to explore potential environmental and/or progenitor-related effects. Although we only find a marginal difference between the Hubble residuals of HV and NV SNe Ia, the NV mass step is $0.149 \\pm 0.024$ mag ($6.3\\sigma$), while HV SNe Ia show $0.046 \\pm 0.041$ mag ($1.1\\sigma$), consistent with zero. The NV-HV mass-step difference is $\\sim 2.2\\sigma$. The clearest subtype difference is seen in central regions ($d\\_{DLR} < 1$), where NV SNe Ia show a strong mass step but HV SNe Ia none, yielding a $3.1-3.6\\sigma$ difference. A host-colour step appears for both: NV $0.142 \\pm 0.024$ mag ($5.9\\sigma$) and HV $0.158 \\pm 0.042$ mag ($3.8\\sigma$). Overall, NV and HV colour steps are consistent. HV SNe Ia show modest ($\\sim 2.5$-$3\\sigma$) steps in outer regions ($d\\_{DLR} > 1$), while NV SNe show stronger environmental trends. Thus, NV SNe Ia appear more environmentally sensitive, especially in central, likely metal-rich and older regions, while HV SNe Ia show weaker, subset-dependent trends, and applying a universal mass-step correction could introduce biases. Refined classifications or environment-dependent factors may improve future cosmological analyses beyond standard $x\\_{1}$ and $c$ cuts.\n\n", "2509.02667": "2025-09-02, **Probing Thin Winds in Massive OB Stars of the SMC with JWST/NIRSPEC Br-alpha Spectroscopy**, Miriam Garcia et.al., [2509.02667v1](http://arxiv.org/abs/2509.02667v1)\n\n Mass loss is a key physical process in the evolution of massive stars, the impact of which propagates into galactic evolution, population synthesis models, the interpretation of high-redshift galaxies, and explosive events such as supernovae. However, there are currently substantial uncertainties in the low-metallicity, low-luminosity thin wind regime where classical diagnostics (H-alpha and ultraviolet, UV, P Cygni profiles) yield wind momenta that are 1 to 2 orders of magnitude below prescriptions implemented by default in most evolutionary models. Here, we present spectra of the mass-loss diagnostic line Br-alpha in 15 OB-type stars in the Small Magellanic Cloud obtained using the Near Infrared Spectrograph on the James Webb Space Telescope. The line profile morphology, recovered by virtue of the outstanding signal-to-noise ratio of the data and the avoidance of regions with nebular emission, is consistent with predictions based on previous mass-loss rate estimates from optical and UV spectroscopy. Moreover, an initial spectroscopic analysis of sources covering the thin wind regime confirms the low mass-loss rates, indicates a change of slope in the wind-momentum-luminosity relation in this regime with respect to high-luminosity objects, and strengthens the abovementioned discrepancies with commonly used wind-momentum prescriptions.\n\n", "2509.02566": "2025-09-02, **Is feedback-free star formation possible?**, A. Ferrara et.al., [2509.02566v1](http://arxiv.org/abs/2509.02566v1)\n\n It has been suggested that, if the free-fall time of star-forming clouds is shorter than the lifetime ($\\approx 3 $ Myr) of massive stars exploding as supernovae (SN), a large fraction of the cloud gas can be converted into stars during an allegedly `feedback-free' phase. Here, we show that radiation pressure from Ly$\\alpha$ photons produced in the pre-SN phase can instead erase feedback-free conditions, and severely limit the star formation efficiency (SFE). We find that, for a constant star formation rate, all clouds with gas surface density $(37-1.7 \\times 10^5)\\ M\\_\\odot\\ \\rm pc^{-2}$ have $\\epsilon\\_* < 0.08$. Higher SFE values can only be reached if Ly$\\alpha$-driven shells fragment and form stars. While advanced RHD simulations are required to establish the importance of this effect, adopting an optimistic guess, we find that the SFE increases with cloud surface density, rising from $\\epsilon\\_*=0.023$ at $\\Sigma\\_g = 37\\ M\\_\\odot\\ \\mathrm{pc^{-2}}$ to $\\epsilon\\_*=0.27$ at $\\Sigma\\_g = 1.7 \\times 10^5\\ M\\_\\odot\\ \\mathrm{pc^{-2}}$. Given the optimistic assumptions adopted, these numbers should be regarded as upper limits. We conclude that Ly$\\alpha$ radiation pressure strongly limits the SFE, even at solar metallicities, erasing the possibility that a feedback-free star formation mode with $\\epsilon\\_* \\gtrsim 0.4$ exists in the pre-SN phase. This conclusion remains valid even when other effects such as dust destruction of Ly$\\alpha$ photons, presence of HII regions, velocity gradients, atomic recoil, and turbulence are considered.\n\n", "2509.02422": "2025-09-02, **Was SNR 0509-67.5 the result of a double detonation?**, Soham Mandal et.al., [2509.02422v1](http://arxiv.org/abs/2509.02422v1)\n\n Type Ia supernovae (SNe) occur when a white dwarf (WD) is disrupted by runaway thermonuclear burning. The nature and observable signatures of the mechanism triggering the explosion are still debated. In this work, we study how supernova remnants (SNRs) are impacted by the `double detonation' explosion mechanism, or a helium shell detonation in a sub-Chandrasekhar WD followed by a core detonation. We evolve double detonation SN models to the remnant phase (up to several centuries) and measure the size of substructures formed in the SNR as a result of turbulent activity. We compare our results to small-scale substructures seen in high-resolution optical observations of the SNR 0509-67.5. Substructures dominated by iron in that SNR are observed to be about $40\\%$ larger than those dominated by sulfur. This has been shown to be a definitive signature of the explosion of a sub-Chandrasekhar WD by Mandal et al. Comparisons against our suite of SNR models with a range of core and shell masses suggest that the specific substructure sizes in SNR 0509-67.5 are most consistent with the double detonation explosion of a WD with a carbon-oxygen core mass and a helium shell mass of $1M\\_{\\odot}$ and $>0.05M\\_{\\odot}$, respectively.\n\n", "2509.02254": "2025-09-02, **A High Incidence of Mid-infrared Variability in Local Ultraluminous Infrared Galaxies**, Shun Hatano et.al., [2509.02254v1](http://arxiv.org/abs/2509.02254v1)\n\n We explore mid-infrared (MIR) variability in local ultraluminous infrared galaxies (ULIRGs; infrared luminsoity $L\\_{\\rm IR}>10^{12}\\ L\\_\\odot$) utilizing the $\\sim$11 years of photometry from the NEOWISE multi-epoch catalog of {\\it Wide-field Infrared Survey Explorer} ({\\it WISE}). We identify 30 variable ULIRGs with statistically significant MIR variability. The variability is observed on timescales of a few years, implying that the MIR-emitting regions are compact ($\\lesssim 1$ pc). The difference between maximum and minimum $W2$ (4.6 ${\\rm \\mu}$m) band luminosity ($\\Delta L\\_{\\rm W2}$) of the 30 variable ULIRGs range from $\\Delta L\\_{W2}$ = $7\\times10^{42}$ to $5\\times 10^{44}$ erg s$^{-1}$. The $\\Delta L\\_{W2}$ of 25 variable ULIRGs out of 30 are greater than $\\Delta L\\_{W2}$ = $1\\times10^{43}$ erg s$^{-1}$, surpassing the MIR luminosity {range} observed in known supernovae (SNe; $L\\_{\\rm 3.6\\ {\\rm \\mu m}}$ and $L\\_{\\rm 4.5\\ {\\rm \\mu m}}$ < 10$^{42.3}$ erg s$^{-1}$). Therefore, the MIR variabilities in these 25 ULIRGs are most likely driven by tidal disruption events (TDEs) or intrinsic changes in their active galactic nuclei (AGN) torus emission. Our sample includes hard X-ray detected AGNs (e.g., UGC 05101) and previously reported TDE candidates (IRAS F01004-2237, IRAS 05189-2524). All 25 also exhibit at least one AGN signature(s) besides the MIR variability, suggesting that even if the MIR variability originates from TDEs, the black holes responsible are likely AGNs. Our results suggest that MIR variability is an effective tool for detecting buried AGNs and highlights the intense nuclear activity in ULIRGs.\n\n", "2509.01933": "2025-09-02, **The survey of DA double white dwarf candidates based on DESI EDR**, Ziyue Jiang et.al., [2509.01933v1](http://arxiv.org/abs/2509.01933v1)\n\n Mergers of double white dwarfs are considered significant potential progenitors of type Ia supernovae. Although there is no direct observational evidence to definitively determine the formation pathways of SNe Ia, studying the physical properties of DWDs provides valuable insights into their evolutionary processes, interaction modes, and merger mechanisms, which are essential for understanding the explosion mechanisms of SNe Ia. This study aims to identify DWD candidates through spectroscopic radial velocity measurements and analyze their physical properties based on DESI EDR. We crossmatched DESI EDR with the Gaia EDR3 to select DA. We measured the spectroscopic RV using the cross-correlation function and assessed the significance of RV variability using a chi-squared-based variability method. Spectroscopic Teff and log g were derived by fitting the hydrogen Balmer lines, with 3D convection corrections applied. Orbital periods and semi-amplitudes were obtained through a Lomb-Scargle analysis of the RV time series. We interpolated WD cooling models and applied Monte Carlo simulations to calculate masses, cooling ages, radii, and their associated uncertainties. We also analyzed their photometric and spectral energy distribution properties to derive photometric temperatures and radii, which were then compared with the corresponding spectroscopic parameters. We identified 33 DA DWD candidates with significant RV variability, including 28 new discoveries. Among them, we found an extremely low-mass DWD candidate and a potential triple system. For these candidates, we measured key physical parameters including Teff, log g, mass, and radius, and estimated the orbital periods based on the available data. Of these, 17 candidates exhibit relatively clear periodic RV variability in the current data, and we report their best-fitting periods and RV semi-amplitudes.\n\n", "2509.01881": "2025-09-02, **One latent to fit them all: a unified representation of baryonic feedback on matter distribution**, Shurui Lin et.al., [2509.01881v1](http://arxiv.org/abs/2509.01881v1)\n\n Accurate and parsimonious quantification of baryonic feedback on matter distribution is of crucial importance for understanding both cosmology and galaxy formation from observational data. This is, however, challenging given the large discrepancy among different models of galaxy formation simulations, and their distinct subgrid physics parameterizations. Using 5,072 simulations from 4 different models covering broad ranges in their parameter spaces, we find a unified 2D latent representation. Compared to the simulations and other phenomenological models, our representation is independent of both time and cosmology, much lower-dimensional, and disentangled in its impacts on the matter power spectra. The common latent space facilitates the comparison of parameter spaces of different models and is readily interpretable by correlation with each. The two latent dimensions provide a complementary representation of baryonic effects, linking black hole and supernova feedback to distinct and interpretable impacts on the matter power spectrum. Our approach enables developing robust and economical analytic models for optimal gain of physical information from data, and is generalizable to other fields with significant modeling uncertainty.\n\n"}}