{"neutrino": {"2305.04916": "2023-05-08, **Neutrino many-body correlations**, Lucas Johns et.al., [2305.04916v1](http://arxiv.org/abs/2305.04916v1)\n\n This paper responds to suggestions that the standard approach to collective neutrino oscillations leaves out potentially important quantum many-body correlations. Arguments in favor of this idea have been based on calculations that, on close scrutiny, offer no evidence either way. Inadequacies of the usual quantum-kinetic formalism are not currently supported by the literature.\n\n", "2305.04795": "2023-05-08, **Non-thermal emissions from a head-tail radio galaxy in 3D magnetohydrodynamic simulations**, Takumi Ohmura et.al., [2305.04795v1](http://arxiv.org/abs/2305.04795v1)\n\n We present magnetohydrodynamic simulations of a jet-wind interaction in a galaxy cluster and the radio to gamma-ray and the neutrino emissions from this \"head-tail galaxy\". Our simulation follows the evolution of cosmic-ray (CR) particle spectra with energy losses and the stochastic turbulence acceleration. We find that the reacceleration is essential to explain the observed radio properties of head-tail galaxies, in which the radio flux and spectral index do not drastically change. Our models suggest that hard X-ray emissions can be detected around the head-tail galaxy in the Perseus cluster by the hard X-ray satellites, such as FORCE, and it will potentially constrain the acceleration efficiency. We also explore the origin of the collimated synchrotron threads, which are found in some head-tail galaxies by recent high-quality radio observations. Thin and elongated flux tubes, connecting the two tails, are formed by strong backflows at an early phase. We find that these threads advect with the wind for over 300 Myr without disrupting. The radio flux from the flux tubes is much lower than the typical observed flux. An efficient CR diffusion process along the flux tubes, however, may solve this discrepancy.\n\n", "2305.04681": "2023-05-08, **Minimal model inspired by family number and dark matter**, Duong Van Loi et.al., [2305.04681v1](http://arxiv.org/abs/2305.04681v1)\n\n We consider a gauge symmetry extension of the standard model given by $SU(3)\\_C\\otimes SU(2)\\_L\\otimes U(1)\\_X\\otimes U(1)\\_N\\otimes Z\\_2$ with minimal particle content, where $X$ and $N$ are family dependent but determining the hypercharge as $Y=X+N$, while $Z\\_2$ is an exact discrete symmetry. In our scenario, $X$ (while $N$ is followed by $X-Y$) and $Z\\_2$ charge assignments are inspired by the number of fermion families and the stability of dark matter, as observed, respectively. We examine the mass spectra of fermions, scalars, and gauge bosons, as well as their interactions, in presence of a kinetic mixing term between $U(1)\\_{X,N}$ gauge fields. We discuss in detail the phenomenology of the new gauge boson and the right-handed neutrino dark matter stabilized by $Z\\_2$ conservation. We obtain parameter spaces simultaneously satisfying the recent CDF $W$-boson mass, electroweak precision measurements, particle colliders, as well as dark matter observables, if the kinetic mixing parameter is not necessarily small.\n\n"}, "dark matter": {"2305.04924": "2023-05-08, **Primordial black holes from strong first-order phase transitions**, Marek Lewicki et.al., [2305.04924v1](http://arxiv.org/abs/2305.04924v1)\n\n We study the formation of primordial black holes (PBHs) in strongly supercooled first-order phase transitions. The mechanism is based on the presence of remnants dominated by the false vacuum that scale slower with the expansion of the Universe than their surroundings where this energy was already converted into radiation. We compute the PBH formation from these remnants including the contribution from the false vacuum and the bubble walls, by estimating the collapse using the hoop conjecture and by considering both regions collapsing immediately when entering the horizon and sub-horizon regions that collapse as their compactness grows. We show that for exponential bubble nucleation rate, $\\Gamma \\propto e^{\\beta t}$, the primordial black hole formation implies $\\beta/H \\gtrsim 3.8$, where $H$ denotes the Hubble rate, if the potential energy of the false vacuum is $\\Delta V \\lesssim (10^{12} {\\rm GeV})^4$, as otherwise a too large abundance of long-lived PBHs forms. The observed dark matter abundance can be formed in asteroid mass PBHs if $\\beta/H \\simeq 3.8$ and $10^5 {\\rm GeV} \\lesssim \\Delta V^{1/4} \\lesssim 10^8 {\\rm GeV}$. Finally, we consider also the effect of the second order correction to the exponential nucleation rate showing that the PBH abundance is mainly determined by the average radius of the true vacuum bubbles.\n\n", "2305.04690": "2023-05-08, **Exploring light dark matter with the Migdal effect in hydrogen-doped liquid xenon**, Nicole F. Bell et.al., [2305.04690v1](http://arxiv.org/abs/2305.04690v1)\n\n An ongoing challenge in dark matter direct detection is to improve the sensitivity to light dark matter in the MeV--GeV mass range. One proposal is to dope a liquid noble-element direct detection experiment with a lighter element such as hydrogen. This has the advantage of enabling larger recoil energies compared to scattering on a heavy target, while leveraging existing detector technologies. Direct detection experiments can also extend their reach to lower masses by exploiting the Migdal effect, where a nuclear recoil leads to electronic ionisation or excitation. In this work we combine these ideas to study the sensitivity of a hydrogen-doped LZ experiment (HydroX), and a future large-scale experiment such as XLZD. We find that HydroX could have sensitivity to dark matter masses as low as 5~MeV for both spin-independent and spin-dependent scattering, with XLZD extending that reach to lower cross sections. Notably, this technique substantially enhances the sensitivity of direct detection to spin-dependent proton scattering, well beyond the reach of any current experiments.\n\n", "2305.04520": "2023-05-08, **Minkowski Functionals of the Large-Scale Structure as a Powerful Tool to Constrain the Modified Gravity**, Aoxiang Jiang et.al., [2305.04520v1](http://arxiv.org/abs/2305.04520v1)\n\n Modifications in the law of gravity can leave signatures on the large-scale structure, especially on the non-linear and quasi-linear scales. In this work, we propose that the four Minkowski functionals (MFs), which fully encapsulate the morphological information of the large-scale structure, are a powerful tool to constrain modified gravity(MG). With the assistance of N-body simulations, we quantify the MFs' constraining power on the Hu-Sawicki $f(R)$ gravity model by the Fisher matrix technique. The cosmic variance from the finite simulation volume is discussed. By measuring the MFs from the density field of dark matter with different smoothing scales and at different redshifts, we systematically evaluate how much information can be extracted from the MFs in these situations, and try to combine them to improve the constraint. Furthermore, we study the MG signatures imprinted in the MFs of the large-scale structures (LSS) when the biased tracer -- dark matter halo -- is used. And find the response to the fifth force is different from the matter. We also study how the constraints on modified gravity parameters change when using biased tracers of LSS. We expect that the MFs of LSS can provide us with a stringent constraint on modified gravity in the near future.\n\n", "2305.04382": "2023-05-07, **KURVS: The outer rotation curve shapes and dark matter fractions of $z \\sim 1.5 $ star-forming galaxies**, Annagrazia Puglisi et.al., [2305.04382v1](http://arxiv.org/abs/2305.04382v1)\n\n We present first results from the KMOS Ultra-deep Rotation Velocity Survey (KURVS), aimed at studying the outer rotation curves shape and dark matter content of 22 star-forming galaxies at $z\\sim1.5$. These galaxies represent `typical' star-forming discs at $z \\sim 1.5$, being located within the star-forming main sequence and stellar mass-size relation with stellar masses $9.5\\leqslant$log$(M\\_{\\star}/\\mathrm{M\\_{\\odot}})\\leqslant11.5$. We extract individual rotation curves out to 4 times the effective radius, on average, or $\\sim 10-15$ kpc. Most rotation curves are flat or rising between three- and six-disc scale radii. Only three objects with dispersion-dominated dynamics ($v\\_{\\rm rot}/\\sigma\\_0\\sim0.2$) have declining outer rotation curves at more than 5$\\sigma$ significance. After accounting for seeing and pressure support, the nine rotation-dominated discs with $v\\_{\\rm rot}/\\sigma\\_0\\geqslant1.5$ have average dark matter fractions of $50 \\pm 20\\%$ at the effective radius, similar to local discs. Together with previous observations of star-forming galaxies at cosmic noon, our measurements suggest a trend of declining dark matter fraction with increasing stellar mass and stellar mass surface density at the effective radius. Simulated EAGLE galaxies are in quantitative agreement with observations up to log$(M\\_{\\star}R\\_{\\rm eff}^{-2}/\\mathrm{M\\_{\\odot}kpc^{-2}}) \\sim 9.2$, and over-predict the dark matter fraction of galaxies with higher mass surface densities by a factor of $\\sim 3$. We conclude that the dynamics of typical rotationally-supported discs at $z \\sim 1.5$ is dominated by dark matter from effective radius scales, in broad agreement with cosmological models. The tension with observations at high stellar mass surface density suggests that the prescriptions for baryonic processes occurring in the most massive galaxies (such as bulge growth and quenching) need to be reassessed.\n\n", "2305.04308": "2023-05-07, **Faint Galaxy Number Counts in the Durhamand SDSS Catalogues**, John Herbert Marr et.al., [2305.04308v1](http://arxiv.org/abs/2305.04308v1)\n\n Galaxy number counts in the $K$-, $H$-, $I$-, $R$-, $B$- and $U$-bands from the Durham Extragalactic Astronomy and Cosmology catalogue could be well-fitted over their whole range using luminosity function (LF) parameters derived from the SDSS at the bright region and required only modest luminosity evolution with the steepening of the LF slope ($\\alpha$), except for a sudden steep increase in the $B$-band and a less steep increase in the $U$-band at faint magnitudes that required a starburst evolutionary model to account for the excess faint number counts. A cosmological model treating Hubble expansion as an Einstein curvature required less correction at faint magnitudes than a standard $\\Lambda$CDM model, without requiring dark matter or dark energy. Data from DR17 of the SDSS in the $g$, $i$, $r$, $u$ and $z$ bands over two areas of the sky centred on the North Galactic Cap (NGC) and above the South Galactic Cap (SGC), with areas of 5954 and 859 sq. deg., respectively, and a combined count of 622,121 galaxies, were used to construct bright galaxy number counts and galaxy redshift/density plots within the limits of redshift $\\leq0.4$ and mag $\\leq20$. Their comparative densities confirmed an extensive void in the Southern sky with a deficit of 26\\% out to a redshift $z$$\\leq$0.15. Although not included in the number count data set because of its incompleteness at fainter magnitudes, extending the SDSS redshift-number count survey to fainter and more distant galaxies with redshift $\\leq1.20$ showed a secondary peak in the number counts with many QSOs, bright X-ray and radio sources, and evolving irregular galaxies with rapid star formation rates. This sub-population at redshifts of 0.45--0.65 may account for the excess counts observed in the $B$-band.\n\n"}, "supernova": {"2305.04753": "2023-05-08, **Evolution of radioactive elements in the LMC: predictions for future gamma-ray surveys**, Arianna Vasini et.al., [2305.04753v1](http://arxiv.org/abs/2305.04753v1)\n\n Short-lived radionuclides, such as 26Al and 60Fe, are tracers of star formation. Therefore, their abundances can unravel the recent star formation history of the host galaxy. In view of future gamma-ray surveys, we predict the masses and fluxes of these two elements in the Large Magellanic Cloud (LMC) using new chemical evolution models. Our best model reproduces the abundance patterns of alpha/Fe ratios, the gas mass, the average metallicity, the present time supernova and nova rates observed in LMC. We show three main results: i) the best model for the LMC suggests a star formation rate very mild at the beginning with a recent burst, and a Salpeter-like initial mass function. ii) The predicted mass of 26Al is 0.33 M\\_Sun, 2/3 produced by massive stars and 1/3 by novae. iii) The predicted mass of 60Fe is 0.44 M\\_Sun, entirely produced by massive stars. This result suggests a larger fraction of 60Fe, at variance with the Milky Way. The explanation for this lies in the adopted initial mass function, that for the LMC contains more massive stars than for the Milky Way. These predictions can be useful for the COSI-SMEX mission planned for launch in 2027. The expected gamma-ray line fluxes for the 1.809 MeV line of 26Al and the 1.173 and 1.332 MeV lines of 60Fe are in the range of (0.2-2.7)x10^-6 ph cm^-2 s^-1 and (0.7-2.8)x10^-7 ph cm^-2 s^-1, respectively. This new instrument could have the sensitivity to detect the upper end of the predicted 1.8 MeV flux within its nominal two-year mission.\n\n", "2305.04484": "2023-05-08, **Near-Infrared Spectroscopy of Dense Ejecta Knots in the Outer Eastern Area of the Cassiopeia A Supernova Remnant**, Bon-Chul Koo et.al., [2305.04484v1](http://arxiv.org/abs/2305.04484v1)\n\n The Cassiopeia A supernova remnant has a complex structure, manifesting the multidimensional nature of core-collapse supernova explosions. To further understand this, we carried out near-infrared multi-object spectroscopy on the ejecta knots located in the \"northeastern (NE) jet\" and the \"Fe K plume\" regions, which are two distinct features in the outer eastern area of the remnant. Our study reveals that the knots exhibit varying ratios of [S II] 1.03 $\\mu$m, [P II] 1.189 $\\mu$m, and [Fe II] 1.257 $\\mu$m lines depending on their locations within the remnant, suggesting regional differences in elemental composition. Notably, the knots in the NE jet are mostly 'S-rich' with weak or no [P II] lines, implying that they originated below the explosive Ne burning layer, consistent with the results of previous studies. We detected no ejecta knots exhibiting only [Fe II] lines in the NE jet area that are expected in the jet-driven SN explosion model. Instead, we discovered a dozen 'Fe-rich' knots in the Fe K plume area. We propose that they are dense knots produced by a complete Si burning with $\\alpha$-rich freezeout in the innermost region of the progenitor and ejected with the diffuse X-ray emitting Fe ejecta but decoupled after crossing the reverse shock. In addition to these metal-rich ejecta knots, several knots emitting only He I 1.083 $\\mu$m lines were detected, and their origin remains unclear. We also detected three extended H emission features of circumstellar or interstellar origin in this area and discuss its association with the supernova remnant.\n\n"}}