{"neutrino": {"2405.14826": "2024-05-23, **New limits on neutrino decay from high-energy astrophysical neutrinos**, Victor B. Valera et.al., [2405.14826v1](http://arxiv.org/abs/2405.14826v1)\n\n Since neutrinos have mass differences, they could decay into one another. But their lifetimes are likely long, even when shortened by new physics, so decay likely impacts neutrinos only during long trips. This makes high-energy astrophysical neutrinos, traveling for up to billions of light-years, sensitive probes of decay. However, their sensitivity must be tempered by reality. We derive from them thorough bounds on the neutrino lifetimes accounting for critical astrophysical unknowns and the nuances of neutrino detection. Using the diffuse neutrino flux, we disfavor lifetimes $\\tau \\lesssim 20$-450 s $(m/{\\rm eV})$, based on present IceCube data, and forecast factor-of-10 improvements by upcoming detectors. Using, for the first time, neutrinos from the active galaxy NGC 1068, extant unknowns preclude placing lifetime bounds today, but upcoming detectors could disfavor $\\tau \\sim 100$-5000 s $(m/{\\rm eV})$.\n\n", "2405.14764": "2024-05-23, **Multi-Messenger Emission Characteristics of Blazars**, Ronald Gamble Jr et.al., [2405.14764v1](http://arxiv.org/abs/2405.14764v1)\n\n Multi-Messenger observations and theory of astrophysical objects is fast becoming a critical research area in the astrophysics scientific community. In particular, point-like objects like that of BL Lac, flat spectrum radio quasars (FSRQ), and blazar candidates of uncertain type (BCU) are of distinct interest among those who look at the synchrotron, Compton, neutrino, and cosmic ray emissions sourced from compact objects. Notably, there is also much interest in the correlation between multi-frequency observations of blazars and neutrino surveys on source demographics. In this review we look at such multi-frequency and multi-physics correlations of the radio, X-ray, and $\\gamma$-ray fluxes of different classes of blazars from a collection of survey catalogues. This multi-physics survey of blazars shows that there are characteristic cross-correlations in the spectra of blazars when considering their multi-frequency and multi-messenger emission. Accompanying this will be a review of cosmic ray and neutrino emissions from blazars and their characteristics.\n\n", "2405.14332": "2024-05-23, **Thermal Wash-in Leptogenesis via Heavy Higgs Decay**, Kyohei Mukaida et.al., [2405.14332v1](http://arxiv.org/abs/2405.14332v1)\n\n We present a conceptually simple model to generate asymmetries that are not directly related to baryon nor lepton charges. The model employs a three-Higgs doublet framework, wherein the other two Higgs fields are significantly heavier than the Standard Model (SM) Higgs field. The decay of these heavier Higgs fields generates asymmetry for approximately conserved charges in the Standard Model at a high temperature. These asymmetries will be converted into baryon/lepton asymmetry through $B-L$ violating interactions associated with right-handed neutrinos via the wash-in mechanism.\n\n"}, "dark matter": {"2405.14799": "2024-05-23, **Exploring modified Kaniadakis entropy: MOND theory and the Bekenstein bound conjecture**, Gabriella V. Ambrósio et.al., [2405.14799v1](http://arxiv.org/abs/2405.14799v1)\n\n We examine the potential of Kaniadakis entropy to describe black hole entropy, proposing a modified version accounting for black hole thermodynamics. Additionally, we discuss the Modified Newtonian Dynamics (MOND) theory, a modification of Newton's second law aimed at explaining galaxy rotation curves without resorting to dark matter. Furthermore, we consider the Bekenstein bound conjecture, which imposes an upper limit on the entropy of confined quantum systems. We analyze this conjecture in the context of a modified Kaniadakis entropy and find that it holds for typical values of $\\kappa$, as evidenced by our numerical investigation and displaying a figure. Our exploration underscores the potential of modified Kaniadakis statistics in understanding diverse physical phenomena, from gravitational systems to quantum mechanics, offering a promising direction for future research at the intersection of statistical mechanics and other important areas of physics as well.\n\n", "2405.14732": "2024-05-23, **The Data Acquisition System of the LZ Dark Matter Detector: FADR**, J. Aalbers et.al., [2405.14732v1](http://arxiv.org/abs/2405.14732v1)\n\n The Data Acquisition System (DAQ) for the LUX-ZEPLIN (LZ) dark matter detector is described. The signals from 745 PMTs, distributed across three subsystems, are sampled with 100-MHz 32-channel digitizers (DDC-32s). A basic waveform analysis is carried out on the on-board Field Programmable Gate Arrays (FPGAs) to extract information about the observed scintillation and electroluminescence signals. This information is used to determine if the digitized waveforms should be preserved for offline analysis.   The system is designed around the Kintex-7 FPGA. In addition to digitizing the PMT signals and providing basic event selection in real time, the flexibility provided by the use of FPGAs allows us to monitor the performance of the detector and the DAQ in parallel to normal data acquisition.   The hardware and software/firmware of this FPGA-based Architecture for Data acquisition and Realtime monitoring (FADR) are discussed and performance measurements are described.\n\n", "2405.14638": "2024-05-23, **Screened Scalar Fields in the Laboratory and the Solar System**, Hauke Fischer et.al., [2405.14638v1](http://arxiv.org/abs/2405.14638v1)\n\n The last few decades have provided abundant evidence for physics beyond the two standard models of particle physics and cosmology. As is now known, the by far largest part of our universe's matter/energy content lies in the `dark' and consists of dark energy and dark matter. Despite intensive efforts on the experimental as well as the theoretical side, the origins of both are still completely unknown. Screened scalar fields have been hypothesized as potential candidates for dark energy or dark matter. Among these, some of the most prominent models are the chameleon, symmetron, and environment-dependent dilaton. In this article, we present a summary containing the most recent experimental constraints on the parameters of these three models. For this, experimental results have been employed from the qBOUNCE collaboration, neutron interferometry, and Lunar Laser Ranging (LLR), among others. In addition, constraints are forecast for the Casimir And Non Newtonian force EXperiment (CANNEX). Combining these results with previous ones, this article collects the most up-to-date constraints on the three considered screened scalar field models.\n\n", "2405.14610": "2024-05-23, **Flavored Dark Matter: Freeze-out Scenarios and LHC Signatures**, Jan Heisig et.al., [2405.14610v1](http://arxiv.org/abs/2405.14610v1)\n\n We present the phenomenology of a simplified dark matter model within the dark minimal flavor violation framework, extending the standard model with a Majorana fermion flavor triplet and colored scalar mediator. We explore the allowed parameter space considering constraints from flavor observables, direct and indirect dark matter detection, and the relic density measurement. Our analysis reveals previously unexplored scenarios such as conversion-driven freeze-out within the model. We study limits from the LHC and discuss new signatures of the model, highlighting its richer phenomenology compared to single flavor dark matter.\n\n", "2405.14309": "2024-05-23, **Gamma-ray Signal from $Z_{N\\geq 3}$ Dark Matter-Companion Models**, Jun Guo et.al., [2405.14309v1](http://arxiv.org/abs/2405.14309v1)\n\n In Ref.~\\cite{Guo:2021rre}, we proposed to replace the final dark matter (DM) particle in the semi-annihilation mode $\\rm DM+DM\\to antiDM+Higgs~boson$ with its $Z\\_{N\\geq 3}$ companion, thus reducing DM number density without DM-nucleon scattering. In this work, we study the indirect detection signals from DM annihilation, the Higgs boson pair with one of them from the companion decay being on- or off- shell, depending on the DM-companion mass splitting. We generate the photon spectrum by using PYTHIA8 and study the properties of the spectrum, to find that the hard part of the spectrum in our model is mainly shaped by the direct Higgs boson and thus does not differ much from that of the conventional semi-annihilation mode. Using the Fermi-LAT data of white dwarfs, we derive the current limit of the DM annihilation cross section for ${\\rm DM+DM\\to companion^*+Higgs~ boson}$, and for the relatively light DM, it reaches the typical thermal cross section. However, for the TeV scale DM, we have to rely on the Cherenkov Telescope Array, which is able to rule out the whole parameter space except for the coannihilation region.\n\n", "2405.14163": "2024-05-23, **Flavino Dark Matter in a Non-Abelian Discrete Flavor Model**, Takaaki Nomura et.al., [2405.14163v1](http://arxiv.org/abs/2405.14163v1)\n\n We study a relic density of the flavino dark matter in modified Altarelli and Feruglio $A\\_4$ model which is respecting the $SU(2)\\_L\\times A\\_4\\times Z\\_3\\times U(1)\\_R$ symmetry. We calculate the Lagrangian from the superpotential in the model. In estimating relic density, we consider the relevant interactions from the Lagrangian that realize the vacuum expectation value alignments and charged lepton masses where we assume that the supersymmetry breaking effects are small for flavon sector. As a result, we find the degenerate masses between the lightest ``flavon'' and ``flavino'', and only two parameters in the potential determines the relic density. Then allowed parameter space of these parameters are estimated from relic density calculation taking a constraint from lepton flavor violation into account. We also briefly discuss other dark matter physics such as direct detection, indirect detection and collider search.\n\n"}, "supernova": {"2405.14663": "2024-05-23, **WTP19aalnxx: Discovery of a bright mid-infrared transient in the emerging class of low luminosity supernovae revealed by delayed circumstellar interaction**, Charlotte Myers et.al., [2405.14663v1](http://arxiv.org/abs/2405.14663v1)\n\n While core-collapse supernovae (SNe) often show early and consistent signs of circumstellar (CSM) interaction, some exhibit delayed signatures due to interaction with distant material around the progenitor star. Here we present the discovery in NEOWISE data of WTP19aalnxx, a luminous mid-infrared (IR) transient in the outskirts of the galaxy KUG 0022-007 at $\\approx 190$ Mpc. First detected in 2018, WTP19aalnxx reaches a peak absolute (Vega) magnitude of $\\approx-22$ at $4.6 \\, \\mu$m in $\\approx3$ yr, comparable to the most luminous interacting SNe. Archival data reveal a $\\gtrsim 5\\times$ fainter optical counterpart detected since 2015, while follow-up near-IR observations in 2022 reveal an extremely red ($Ks-W2 \\approx 3.7$ mag) active transient. Deep optical spectroscopy confirm strong CSM interaction signatures via intermediate-width Balmer emission lines and coronal metal lines. Modeling the broadband spectral energy distribution, we estimate the presence of $\\gtrsim 10^{-2}$ M$\\_\\odot$ of warm dust, likely formed in the shock interaction region. Together with the lack of nebular Fe emission, we suggest that WTP19aalnxx is a missed, low (optical) luminosity SN in an emerging family of core-collapse SNe distinguished by their CSM-interaction-powered mid-IR emission that outshines the optical bands. Investigating the Zwicky Transient Facility sample of SNe in NEOWISE data, we find $17$ core-collapse SNe ($\\gtrsim 3$% in a volume-limited sample) without early signs of CSM interaction that exhibit delayed IR brightening, suggestive of dense CSM shells at $\\lesssim 10^{17}$cm. We suggest that synoptic IR surveys offer a new route to revealing late-time CSM interaction and the prevalence of intense terminal mass loss in massive stars.\n\n", "2405.14357": "2024-05-23, **Cosmological Constraints on Long Gamma-Ray Bursts from Fermi observations**, Huifeng Wang et.al., [2405.14357v1](http://arxiv.org/abs/2405.14357v1)\n\n In this paper, we compile a \\emph{Fermi} sample of the \\emph{long} GRBs from \\emph{Fermi} observations with 15 years of the Fermi-GBM catalogue with identified redshift, in which the GOLD sample contains 123 long GRBs at $z\\le5.6$ and the FULL sample contains 151 long GRBs with redshifts at $z\\le8.2$. The Amati relation (the $E\\_{\\rm p,i}$-$E\\_{\\rm iso}$ correlation) are calibrated at $z<1.4$ by a Gaussian Process from the latest observational Hubble data (OHD) with the cosmic chronometers method to obtain GRBs at high-redshift $z\\ge1.4$ which can be used to constrain cosmological models via the Markov chain Monte Carlo (MCMC) method. With the cosmology-independent GRBs with the GOLD sample at $z\\ge1.4$ and the Pantheon sample of type Ia supernovae (SNe Ia) at $0.01<z\\leq2.3$, we obtain $\\Omega\\_{\\rm m} = 0.354\\pm0.018, H\\_0 = 73.05\\pm0.002$ for the flat $\\Lambda$CDM model; $w\\_0 = -1.22^{+0.18}\\_{-0.15}$ for the flat $w$CDM model; and $w\\_{a} = -1.12^{+0.45}\\_{-0.83}$ for the flat Chevallier-Polarski-Linder model at the 1$\\sigma$ confidence level. Our results with the GOLD and FULL sample are almost identical, which are more stringent than the previous results with GRBs.\n\n"}}