{"neutrino": {"2311.05564": "2023-11-09, **Gravitational wave emission from metastable current-carrying strings in $E_6$**, Adeela Afzal et.al., [2311.05564v1](http://arxiv.org/abs/2311.05564v1)\n\n We discuss $E\\_6$ based extensions of the Standard Model (SM) containing two varieties of superheavy metastable cosmic strings (CSs) that respectively have neutral and electrically charged current carriers. We employ an extended version of the velocity-dependent one-scale (VOS) model, recently discussed by some authors, to estimate the gravitational wave (GW) spectrum emitted by metastable strings with a dimensionless string tension $G \\mu \\approx 10^{-6}$ that carry a right-handed neutrino (RHN) current. We find that with a low to moderate amount of current, the spectrum is compatible with the LIGO O3 run and also consistent at the 1$\\sigma$ level with the recent PTA signals.\n\n", "2311.05456": "2023-11-09, **PIII Project Overview and Status**, R. Stanek et.al., [2311.05456v1](http://arxiv.org/abs/2311.05456v1)\n\n The Proton Improvement Plan II (PIP-II) project is an essential upgrade to Fermilab's particle accelerator complex to enable the world's most intense neutrino beam for LBNF/DUNE and a broad particle physics program for many decades to come. PIP-II will deliver 1.2 MW of proton beam power from the Main Injector, upgradeable to multi-MW capability. The central element of PIP-II is an 800 MeV superconducting radio frequency (SRF) linac, which comprises a room temperature front end followed by an SRF section. The SRF section consists of five different flavors of cavities/cryomodules, including Half Wave Resonators (HWR), Single Spoke and elliptical resonators operating at, or above, state-of-the-art parameters. The first two PIP-II cryomodules, Half Wave Resonator (HWR) and Single Spoke Resonator 1 (SSR1) were installed in the PIP-II Injector Test facility (PIP2IT) and have accelerated beam to above 17 MeV. PIP-II is the first U.S. accelerator project that will be constructed with significant contributions from international partners, including India, Italy, France, United Kingdom and Poland. The project was baselined in April 2022, and the construction phase is underway.\n\n", "2311.05320": "2023-11-09, **Dual-phase xenon time projection chambers for rare-event searches**, Laura Baudis et.al., [2311.05320v1](http://arxiv.org/abs/2311.05320v1)\n\n In the past decade, dual-phase xenon time projection chambers (Xe-TPCs) have emerged as some of the most powerful detectors in the fields of astroparticle physics and rare-event searches. Developed primarily towards the direct detection of dark matter particles, experiments presently operating deep underground have reached target masses at the multi-tonne scale, energy thresholds around 1\\,keV and radioactivity-induced background rates similar to those from solar neutrinos. These unique properties, together with demonstrated stable operation over several years, allow for the exploration of new territory via high-sensitivity searches for a plethora of ultra-rare interactions. These include searches for particle dark matter, for second order weak decays, and the observation of astrophysical neutrinos. We first review some properties of xenon as a radiation detection medium and the operation principles of dual-phase Xe-TPCs together with their energy calibration and resolution. We then discuss the status of currently running experiments and of proposed next-generation projects, describing some of the technological challenges. We end by looking at their sensitivity to dark matter candidates, to second order weak decays and to solar and supernova neutrinos. Experiments based on dual-phase Xe-TPCs are difficult, and, like all good experiments, they are constantly pushed to their limits. Together with many other endeavours in astroparticle physics and cosmology they will continue to push at the borders of the unknown, hopefully to reveal profound new knowledge about our cosmos.\n\n", "2311.05224": "2023-11-09, **Measurement of the $D^{*}$ longitudinal polarization in $B^0\\to D^{*-}τ^{+}ν_τ$ decays**, LHCb collaboration et.al., [2311.05224v1](http://arxiv.org/abs/2311.05224v1)\n\n The longitudinal polarization fraction of the $D^{*}$ meson is measured in $B^0\\to D^{*-}\\tau^{+}\\nu\\_{\\tau}$ decays, where the $\\tau$ lepton decays to three charged pions and a neutrino, using proton-proton collision data collected by the LHCb experiment at center-of-mass energies of 7, 8 and 13 TeV and corresponding to an integrated luminosity of 5 fb$^{-1}$. The $D^{*}$ polarization fraction $F\\_{L}^{D^{*}}$ is measured in two $q^{2}$ regions, below and above 7 GeV$^{2}/c^{4}$, where $q^{2}$ is defined as the squared invariant mass of the $\\tau\\nu\\_{\\tau}$ system. The $F\\_{L}^{D^{*}}$ values are measured to be $0.51 \\pm 0.07 \\pm 0.03$ and $0.35 \\pm 0.08 \\pm 0.02$ for the lower and higher $q^{2}$ regions, respectively. The first uncertainties are statistical and the second systematic. The average value over the whole $q^{2}$ range is: $$F\\_{L}^{D^{*}} = 0.43 \\pm 0.06 \\pm 0.03.$$ These results are compatible with the Standard Model predictions.\n\n", "2311.05105": "2023-11-09, **Atmospheric neutrino oscillation analysis with neutron tagging and an expanded fiducial volume in Super-Kamiokande I-V**, Super-Kamiokande Collaboration et.al., [2311.05105v1](http://arxiv.org/abs/2311.05105v1)\n\n We present a measurement of neutrino oscillation parameters with the Super-Kamiokande detector using atmospheric neutrinos from the complete pure-water SK I-V (April 1996-July 2020) data set, including events from an expanded fiducial volume. The data set corresponds to 6511.3 live days and an exposure of 484.2 kiloton-years. Measurements of the neutrino oscillation parameters $\\Delta m^2\\_{32}$, $\\sin^2\\theta\\_{23}$, $\\sin^2 \\theta\\_{13}$, $\\delta\\_{CP}$, and the preference for the neutrino mass ordering are presented with atmospheric neutrino data alone, and with constraints on $\\sin^2 \\theta\\_{13}$ from reactor neutrino experiments. Our analysis including constraints on $\\sin^2 \\theta\\_{13}$ favors the normal mass ordering at the 92.3% level.\n\n", "2311.05080": "2023-11-09, **Characterization of the Hamamatsu 8-inch R14688-100 PMT**, Tanner Kaptanoglu et.al., [2311.05080v1](http://arxiv.org/abs/2311.05080v1)\n\n Large-scale optical neutrino and dark-matter detectors rely on large-area photomultiplier tubes (PMTs) for cost-effective light detection. The new R14688-100 8-inch PMT developed by Hamamatsu provides state-of-the-art timing resolution of around 1 ns (FWHM), which can help improve vertex reconstruction and enable Cherenkov and scintillation light separation in scintillation-based detectors. This PMT also provides excellent charge resolution, allowing for precision photoelectron counting and improved energy reconstruction. The Eos experiment is the first large-scale optical detector to utilize these PMTs. In this manuscript we present a characterization of the R14688-100 single photoelectron response, such as the transit-time spreads, the dark-rates, and the afterpulsing. The single photoelectron response measurements are performed for the 206 PMTs that will be used in Eos.\n\n"}, "dark matter": {"2311.05476": "2023-11-09, **A Spectroscopic Search for Optical Emission Lines from Dark Matter Decay**, Hanyue Wang et.al., [2311.05476v1](http://arxiv.org/abs/2311.05476v1)\n\n We search for narrow-line optical emission from dark matter decay by stacking dark-sky spectra from the Dark Energy Spectroscopic Instrument (DESI) at the redshift of nearby galaxies from DESI's Bright Galaxy and Luminous Red Galaxy samples. Our search uses regions separated by 5 to 20 arcsecond from the centers of the galaxies, corresponding to an impact parameter of approximately $50\\,\\rm kpc$. No unidentified spectral line shows up in the search, and we place a line flux limit of $10^{-19}\\,\\rm{ergs}/\\rm{s}/\\rm{cm}^{2}/\\rm{arcsec}^{2}$ on emissions in the optical band ($3000\\lesssim\\lambda\\lesssim9000 \\,\\mathring{\\rm A}$), which corresponds to $34$ in AB magnitude in a normal broadband detection. This detection limit suggests that the line surface brightness contributed from all dark matter along the line of sight is two orders of magnitude lower than the measured extragalactic background light (EBL), which rules out the possibility that narrow optical-line emission from dark matter decay is a major source of the EBL.\n\n", "2311.05439": "2023-11-09, **Final Results of Search for New Milky Way Satellites in the Hyper Suprime-Cam Subaru Strategic Program Survey: Discovery of Two More Candidates**, Daisuke Homma et.al., [2311.05439v1](http://arxiv.org/abs/2311.05439v1)\n\n We present the final results of our search for new Milky Way (MW) satellites using the data from the Hyper Suprime-Cam (HSC) Subaru Strategic Program (SSP) survey over $\\sim 1,140$ deg$^2$. In addition to three candidates that we already reported, we have identified two new MW satellite candidates in the constellation of Sextans at a heliocentric distance of $D\\_{\\odot} \\simeq 126$kpc, and Virgo at $D\\_{\\odot} \\simeq 151$kpc, named Sextans II and Virgo III, respectively. Their luminosities (Sext II:$M\\_V\\simeq-3.9$mag; Vir III:$M\\_V\\simeq-2.7$mag) and half-light radii (Sext II:$r\\_h\\simeq154$ pc; Vir III:$r\\_h\\simeq 44$ pc) place them in the region of size-luminosity space of ultra-faint dwarf galaxies (UFDs). Including four previously known satellites, there are a total of nine satellites in the HSC-SSP footprint. This discovery rate of UFDs is much higher than that predicted from the recent models for the expected population of MW satellites in the framework of cold dark matter models, thereby suggesting that we encounter a too many satellites problem. Possible solutions to settle this tension are also discussed.\n\n", "2311.05393": "2023-11-09, **Merging Hierarchical Triple Black Hole Systems with Intermediate-mass Black Holes in Population III Star Clusters**, Shuai Liu et.al., [2311.05393v1](http://arxiv.org/abs/2311.05393v1)\n\n Theoretical predictions suggest that very massive stars have the potential to form through multiple collisions and eventually evolve into intermediate-mass black holes (IMBHs) within Population III star clusters that are embedded in mini dark matter haloes. In this study, we investigate the long-term evolution of Population III star clusters, including models with a primordial binary fraction of $f\\_{\\rm b}=0$ and 1, using the $N$-body simulation code \\textsc{petar}. We comprehensively examine the phenomenon of hierarchical triple black holes in the clusters, specifically focusing on the merging of their inner binary black holes (BBHs), with post-Newtonian correction, by using the \\textsc{tsunami} code. Our findings suggest a high likelihood of the inner BBHs containing IMBHs with masses on the order of $\\mathcal{O}(100)M\\_{\\odot}$, and as a result, their merger rate could be up to $0.1{\\rm Gpc}^{-3}{\\rm yr}^{-3}$. In the model with $f\\_{\\rm b}=0$, the evolution of these merging inner BBHs is predominantly driven by their gravitational wave radiation at an early time, but their evolutionary dynamics are dominated by the interaction between them and tertiary BHs in the case with $f\\_{\\rm b}=1$. The orbital eccentricities of some merging inner BBHs oscillate over time periodically, known as the Kozai-Lidov oscillation, due to dynamical perturbations. Furthermore, the merging inner BBHs tend to have highly eccentric orbits at low frequency range, some of them with low redshift would be detected by LISA/TianQin. In the higher frequency range, the merging inner BBHs across a wider redshift range would be detected by DECIGO/ET/CE/LIGO/KAGRA.\n\n", "2311.05366": "2023-11-09, **Cosmic mysteries and the hydrogen 21-cm line: bridging the gap with lunar observations**, Anastasia Fialkov et.al., [2311.05366v1](http://arxiv.org/abs/2311.05366v1)\n\n The hydrogen 21-cm signal is predicted to be the richest probe of the young Universe including eras known as the cosmic Dark Ages, the Cosmic Dawn when the first star and black hole formed, and the Epoch of Reionization. This signal holds the key to deciphering processes that take place at the early stages of cosmic history. In this opinion piece, we discuss the potential scientific merit of lunar observations of the 21-cm signal and their advantages over more affordable terrestrial efforts. The moon is a prime location for radio cosmology which will enable precision observations of the low-frequency radio sky. The uniqueness of such observations is that they will provide an unparalleled opportunity to test cosmology and the nature of dark matter using the Dark Ages 21-cm signal. No less enticing is the opportunity to obtain a much clearer picture of Cosmic Dawn than what is achievable from the ground, which will allow us to probe properties of the first stars and black holes.\n\n", "2311.05324": "2023-11-09, **Breaking the baryon-dark matter degeneracy in a model-independent way through the Sunyaev-Zeldovich effect**, Anna Chiara Alfano et.al., [2311.05324v1](http://arxiv.org/abs/2311.05324v1)\n\n We propose a model-independent \\textit{B\\'ezier parametric interpolation} to alleviate the degeneracy between baryonic and dark matter abundances by means of intermediate-redshift data. To do so, we first interpolate the observational Hubble data to extract cosmic bounds over the (reduced) Hubble constant, $h\\_0$, and interpolate the angular diameter distances, $D(z)$, of the galaxy clusters, inferred from the Sunyaev-Zeldovich effect, constraining the spatial curvature, $\\Omega\\_k$. Through the so-determined Hubble points and $D(z)$, we interpolate uncorrelated data of baryonic acoustic oscillations bounding the baryon ($\\omega\\_b = h^2\\_0\\Omega\\_b$) and total matter ($\\omega\\_m = h^2\\_0\\Omega\\_m$) densities, reinforcing the constraints on $h\\_0$ and $\\Omega\\_k$ with the same technique. Instead of pursuing the usual treatment to fix $\\omega\\_b$ via the value obtained from the cosmic microwave background to remove the matter sector degeneracy, we here interpolate the acoustic parameter from correlated baryonic acoustic oscillations. The results of our Monte Carlo--Markov chain simulations turn out to agree at $1$--$\\sigma$ confidence level with the flat $\\Lambda$CDM model. While our findings are roughly suitable at $1$--$\\sigma$ with its non-flat extension too, the Hubble constant appears in tension up to the $2$--$\\sigma$ confidence level. Accordingly, we also reanalyze the Hubble tension with our treatment and find our expectations slightly match local constraints.\n\n", "2311.05318": "2023-11-09, **Dark Dimension and Decaying Dark Matter Gravitons**, Georges Obied et.al., [2311.05318v1](http://arxiv.org/abs/2311.05318v1)\n\n We explore the cosmology of the Dark Dimension scenario taking into account perturbations in the linear regime. In the context of the Dark Dimension scenario, a natural candidate for dark matter in our universe is the excitations of a tower of massive spin-2 KK gravitons. These dark gravitons are produced in the early universe and decay to lighter KK gravitons during the course of cosmological evolution. The decay causes the average dark matter mass to decrease as the universe evolves. In addition, the kinetic energy liberated in each decay leads to a kick velocity for the dark matter particles leading to a suppression of structure formation. Using current CMB (Planck), BAO and cosmic shear (KiDS-1000) data, we put a bound on the dark matter kick velocity today $v\\_\\mathrm{today} \\leq 2.2 \\times 10^{-4} c$ at 95\\% CL. This leads to rather specific regions of parameter space for the dark dimension scenario. The combination of the experimental bounds from cosmology, astrophysics and table-top experiments lead to the range $l\\_5\\sim 1- 10 \\, \\mu m$ for the size of the Dark Dimension. The Dark Dimension scenario is found to be remarkably consistent with current observations and provides signatures that are within reach of near-future experiments.\n\n", "2311.05280": "2023-11-09, **Hybrid model of condensate and particle Dark Matter: linear perturbations in the hydrodynamic limit**, Nick P. Proukakis et.al., [2311.05280v1](http://arxiv.org/abs/2311.05280v1)\n\n We analyse perturbations of self-interacting, scalar field dark matter that contains modes both in a coherent condensate state and an incoherent particle-like state. Starting from the coupled equations for the condensate, the particles and their mutual gravitational potential, first derived from first principles in earlier work by the authors, we derive a hydrodynamic limit of two coupled fluids and study their linearized density perturbations in an expanding universe. We find that away from the condensate-only or particle-only limits, and for certain ranges of the parameters, such self-interacting mixtures can significantly enhance the density power spectrum above the standard linear $\\Lambda$CDM value at localised wavenumbers, even pushing structure formation into the non-linear regime earlier than expected in $\\Lambda$CDM for these scales. We also note that such mixtures can lead to degeneracies between models with different boson masses and self-coupling strengths, in particular between self-coupled models and non-coupled Fuzzy Dark Matter made up of heavier bosons. These findings open up the possibility of a richer phenomenology in scalar field dark matter models and could further inform efforts to place observational limits on their parameters.\n\n", "2311.05217": "2023-11-09, **Super-Resolution Emulation of Large Cosmological Fields with a 3D Conditional Diffusion Model**, Adam Rouhiainen et.al., [2311.05217v1](http://arxiv.org/abs/2311.05217v1)\n\n High-resolution (HR) simulations in cosmology, in particular when including baryons, can take millions of CPU hours. On the other hand, low-resolution (LR) dark matter simulations of the same cosmological volume use minimal computing resources. We develop a denoising diffusion super-resolution emulator for large cosmological simulation volumes. Our approach is based on the image-to-image Palette diffusion model, which we modify to 3 dimensions. Our super-resolution emulator is trained to perform outpainting, and can thus upgrade very large cosmological volumes from LR to HR using an iterative outpainting procedure. As an application, we generate a simulation box with 8 times the volume of the Illustris TNG300 training data, constructed with over 9000 outpainting iterations, and quantify its accuracy using various summary statistics.\n\n", "2311.05125": "2023-11-09, **Effects of Electroweak Symmetry Breaking on Axion Like Particles as Dark Matter**, Soumen Kumar Manna et.al., [2311.05125v1](http://arxiv.org/abs/2311.05125v1)\n\n Axion like particles (ALPs), the pseudo Nambu-Goldstone bosons associated to the spontaneous breaking of global symmetry, have emerged as promising dark matter candidates. Conventionally, in the context of misalignment mechanism, the non-thermally produced ALPs happen to stay frozen due to Hubble friction initially and at a later stage, they begin to oscillate (before matter-radiation equality) at characteristic frequencies defined by their masses and behaving like cold dark matter. In this work, we study the influence of electroweak symmetry breaking (EWSB), through a higher order Higgs portal interaction, on the evolution of ALPs. Such an interaction is found to contribute partially to the ALP's mass during EWSB, thereby modifying oscillation frequencies during EWSB as well as impacting upon the existing correlation between the scale of symmetry breaking and their masses. The novelty of the work lies in broadening the relic satisfied parameter space so as to probe it in near future via a wide range of experiments.\n\n"}, "supernova": {"2311.05612": "2023-11-09, **Modeling the Evolution from Massive Stars to Supernovae and Supernova Remnants**, Salvatore Orlando et.al., [2311.05612v1](http://arxiv.org/abs/2311.05612v1)\n\n The study of core-collapse supernova remnants (SNRs) presents a fascinating puzzle, with intricate morphologies and a non-uniform distribution of stellar debris. Particularly, young remnants (aged less than 5000 years) hold immense value as they can offer crucial insights into the inner processes of the supernova (SN) engine, revealing details about nucleosynthetic yields and large-scale asymmetries arising from the early stages of the explosion. Furthermore, these remnants also bear characteristics that may reflect the nature of their progenitor stars and the interactions between the remnants and the surrounding circumstellar medium (CSM), shaped by the progenitor's mass-loss history. Hence, investigating the connection between young SNRs, parent SNe, and progenitor massive stars can be of paramount importance to delve into the physics of SN engines, and to investigate the final stages of massive star evolution and the elusive mechanisms governing their mass loss. In this contribution, I review recent advances in modeling the path from massive stars to SNe and SNRs achieved by our team. The focus is on investigating the links between the observed physical and chemical properties of SNRs and their progenitor stars and SN explosions. The unraveling of this connection offers us the opportunity to probe the physics of core-collapse SN explosions and the final stages of evolution of massive stars.\n\n", "2311.05510": "2023-11-09, **Evaluating a Sigmoid Dark Energy Model to Explain the Hubble Tension**, Sergio Torres-Arzayus et.al., [2311.05510v1](http://arxiv.org/abs/2311.05510v1)\n\n In this study we analyze Type Ia supernovae (SNe Ia) data sourced from the Pantheon+ compilation to investigate late-time physics effects influencing the expansion history, $H(z)$, at redshifts $(z < 2)$. Our focus centers on a time-varying dark energy (DE) model that introduces a rapid transition in the equation of state, at a specific redshift, $z\\_a$, from the baseline, $\\Lambda = -1$, value to the present value, $w\\_0$, through the implementation of a sigmoid function. The constraints obtained for the DE sigmoid phenomenological parametrization have broad applicability for dynamic DE models that invoke late-time physics. Our analysis indicates that the sigmoid model provides a slightly better, though not statistically significant, fit to the SNe Pantheon+ data compared to the standard LCDM alone. The fit results, assuming a flat geometry and maintaining $\\Omega\\_m$ constant at the 2018-Planck value of $0.3153$, are as follows: $H\\_0 = 73.3^{+0.2}\\_{-0.6}$ km s$^{-1}$ Mpc$^{-1}$, $w\\_{0} = -0.95^{+0.15}\\_{-0.02}$, $z\\_a = 0.8 \\pm 0.46$. The errors represent statistical uncertainties only. The available SN dataset lacks sufficient statistical power to distinguish between the baseline LCDM and the alternative sigmoid models. A feature of interest offered by the sigmoid model is that it identifies a specific redshift, $z\\_a = 0.8$, where a potential transition in the equation of state could have occurred. The sigmoid model does not favor a DE in the phantom region ($w\\_0 < -1$). Further constraints to the dynamic DE model have been obtained using CMB data to compute the distance to the last scattering surface. While the sigmoid DE model does not completely resolve the $H\\_0$ tension, it offers a transition mechanism that can still play a role alongside other potential solutions.\n\n"}}