{"neutrino": {"2502.02576": "2025-02-04, **Neutrino Induced Charged Current Coherent Pion Production for Constraining the Muon Neutrino Flux at DUNE**, Mun Jung Jung et.al., [2502.02576v1](http://arxiv.org/abs/2502.02576v1)\n\n We study neutrino induced charge current coherent pion production ($\\nu\\_\\mu\\text{CC-Coh}\\pi$) as a tool for constraining the neutrino flux at the Deep Underground Neutrino Experiment (DUNE). The neutrino energy and flavor in the process can be directly reconstructed from the outgoing particles, making it especially useful to specifically constrain the muon neutrino component of the total flux. The cross section of this process can be obtained using the Adler relation with the $\\pi$-Ar elastic scattering cross section, taken either from external data or, as we explore, from a simultaneous measurement in the DUNE near detector. We develop a procedure that leverages $\\nu\\_\\mu\\text{CC-Coh}\\pi$ events to fit for the neutrino flux while simultaneously accounting for relevant effects in the cross section. We project that this method has the statistical power to constrain the uncertainty on the normalization of the flux at its peak to a few percent. This study demonstrates the potential utility of a $\\nu\\_\\mu\\text{CC-Coh}\\pi$ flux constraint, though further work will be needed to determine the range of validity and precision of the Adler relation upon which it relies, as well as to measure the $\\pi$-Ar elastic scattering cross section to the requisite precision. We discuss the experimental and phenomenological developments necessary to unlock the $\\nu\\_\\mu\\text{CC-Coh}\\pi$ process as a \"standard candle'' for neutrino experiments.\n\n", "2502.02502": "2025-02-04, **Developing techniques for Simulation of SU(3) Quantum Field Theories on State-of-the-Art Quantum Devices**, Ivan Chernyshev et.al., [2502.02502v1](http://arxiv.org/abs/2502.02502v1)\n\n Quantum computing has long been an experimental technology with the potential to simulate, at scale, phenomena which on classical devices would be too expensive to simulate at any but the smallest scales. Over the last several years, however, it has entered the NISQ era, where the number of qubits are sufficient for quantum advantage but substantial noise on hardware stands in the way of this achievement. This thesis details NISQ device-centered improvements to techniques of quantum simulation of the out-of-equilbrium real-time dynamics of lattice quantum chromodynamics (LQCD) and of dense 3-flavor neutrino systems on digital quantum devices.   The first project concerning LQCD is a comparison of methods for implementing the variational quantum eigensolver (VQE) that initializes the ground state of an SU(3) plaquette-chain. The thesis then pivots to a 1+1D lattice of quarks interacting with an SU(3) gauge-field. A VQE-based state-preparation for the vacua and a Trotterized time-evolution circuit is designed and applied to the problems of simulating beta and neutrinoless double beta decay. Finally, these circuits are adapted to a version useable on quantum devices with nearest-neighbor connectivity with minimal overhead, with an eye towards utilizing the higher qubit count of such devices for hadron dynamics and scattering.   This thesis covers two projects that concern dense 3-flavor neutrino systems. The first details design and testing of Trotterized time-evolution circuits on state-of-the-art quantum devices. The second, motivated by the Gottesman-Knill theorem's result that deviation from stabilizer states (\"magic\") is necessary for a problem to exhibit quantum advantage, details results with implications for the Standard Model in general that the 3 flavor ultradense neutrino systems with the highest, most-persistent magic are those that start with neutrinos in all 3 flavors.\n\n", "2502.02166": "2025-02-04, **Probing New Physics with Multi-Messenger Astronomy**, P. S. Bhupal Dev et.al., [2502.02166v1](http://arxiv.org/abs/2502.02166v1)\n\n The burgeoning field of multi-messenger astronomy is poised to revolutionize our understanding of the most enigmatic astrophysical phenomena in the Universe. At the same time, it has opened a new window of opportunity to probe various particle physics phenomena. This is illustrated here with a few example new physics scenarios, namely, decaying heavy dark matter, pseudo-Dirac neutrinos and light dark sector physics, for which new constraints are derived using recent multi-messenger observations.\n\n", "2502.01963": "2025-02-04, **A search for extremely-high-energy neutrinos and first constraints on the ultra-high-energy cosmic-ray proton fraction with IceCube**, IceCube Collaboration et.al., [2502.01963v1](http://arxiv.org/abs/2502.01963v1)\n\n We present a search for the diffuse extremely-high-energy neutrino flux using $12.6$ years of IceCube data. The non-observation of neutrinos with energies well above $10 \\, \\mathrm{PeV}$ constrains the all-flavor neutrino flux at $10^{18} \\, \\mathrm{eV}$ to a level of $E^2 \\Phi\\_{\\nu\\_e + \\nu\\_\\mu + \\nu\\_\\tau} \\simeq 10^{-8} \\, \\mathrm{GeV} \\, \\mathrm{cm}^{-2} \\, \\mathrm{s}^{-1} \\, \\mathrm{sr}^{-1}$, the most stringent limit to date. Using this data, we constrain the proton fraction of ultra-high-energy cosmic rays (UHECRs) above $\\simeq 30 \\, \\mathrm{EeV}$ to be $\\lesssim 70\\,$% (at $90\\,$% CL) if the cosmological evolution of the sources is comparable to or stronger than the star formation rate. This result complements direct air-shower measurements by being insensitive to uncertainties associated with hadronic interaction models. It is the first such result to disfavor the ``proton-only\" hypothesis for UHECRs using neutrino data.\n\n"}, "dark matter": {"2502.02574": "2025-02-04, **Probing large-scale structures with the 2-point function and the power spectrum: insights into cosmic clustering evolution**, Camila Franco et.al., [2502.02574v1](http://arxiv.org/abs/2502.02574v1)\n\n Understanding the large-scale structure of the Universe requires analysis of cosmic clustering and its evolution over time. In this work, we investigate the clustering properties of SDSS blue galaxies, which are excellent tracers of dark matter, along two distinct epochs of the Universe, utilizing estimators like the 2-point angular correlation function (2PACF), the angular power spectra, among others. Considering a model-independent approach, we perform analyses in two disjoint redshift shells, $0 \\leq z < 0.06$ and $0.06 \\leq z < 0.12$, to investigate the distribution of large cosmic structures. Using Bayesian inference methods, we constrain the parameter that quantifies the galaxy clustering in the 2PACF, enabling us to perform comparisons among different regions on the sky and between different epochs in the Universe regarding the gravitational action on matter structures. Our analyses complement previous efforts to map large-scale structures in the Local Universe. In addition, this study reveals differences regarding the clustering of large cosmic structures comparing two epochs of the Universe, analyses done with diverse estimators. Results reveal, clearly, distinct evolutionary signatures between the two redshift shells. Moreover, we had the opportunity to test the concordance cosmological model under extreme conditions in the highly non-linear Local Universe, computing the amplitude of the angular power spectrum at very small scales. Ultimately, all our analyses serve as a set of consistency tests of the concordance cosmological model, the $\\Lambda$CDM.\n\n", "2502.02571": "2025-02-04, **Primordial Sharp Features through the Nonlinear Regime of Structure Formation**, Clément Stahl et.al., [2502.02571v1](http://arxiv.org/abs/2502.02571v1)\n\n Sudden violations of the slow-roll regime during inflation, a natural prediction of many UV-complete inflationary models, give rise to sharp features in the primordial power spectrum. At large scales, these features provide a unique window into the physics of inflation, with constraints primarily derived from Cosmic Microwave Background observations of linearly evolved primordial fluctuations. However, on smaller scales, it is less clear whether primordial features would survive the late-time nonlinear cosmological evolution, as they are expected to be washed out by mode coupling. In this paper, we run dedicated N-body simulations to tackle this question. We demonstrate that, while oscillatory-like patterns are erased over time by nonlinearities, signatures of primordial sharp features can persist through the nonlinear regime of structure formation. Those take the form of a localised power enhancement or decrease in the matter power spectrum, whose amplitude and position can in principle be used to recover the scale of the primordial feature, and an oscillatory pattern in the halo mass function. While these findings highlight the power for constraining inflationary physics at small scales, they also show the challenges posed by potential degeneracies with other physical processes relevant in the nonlinear regime of structure formation such as non-cold dark matter candidates. Our results open new avenues for probing inflationary physics in large scale structures and galactic physics and emphasise the need for refined theoretical tools to robustly constrain primordial features.\n\n", "2502.02426": "2025-02-04, **Testing the Equivalence Principle on Cosmological Scales Using Peculiar Acceleration Power Spectrum**, Guoyuan Lu et.al., [2502.02426v1](http://arxiv.org/abs/2502.02426v1)\n\n While the (weak) Equivalence Principle (EP) has been rigorously tested within the solar system, its validity on cosmological scales, particularly in the context of dark matter and dark energy, remains uncertain. In this study, we propose a novel method to test EP on cosmological scales by measuring the peculiar acceleration power spectrum of galaxies using the redshift drift technique. We develop an EP estimator, $E\\_{\\rm ep}$, to evaluate the consistency of the peculiar acceleration power spectrum across different tracers. By calculating the ratio of the peculiar acceleration power spectra of tracers, the ensemble average of $E\\_{\\rm ep}$ is expected to be unity if EP holds on cosmological scales for these tracers. We validate this estimator using N-body simulations, focusing on four redshift bins with $z\\leq 1.5$ and scales of $k$ in the range of $0.007$ and $0.32$ $h/\\rm Mpc$. By measuring $E\\_{\\rm ep}$ using i) different samples of dark matter particle mock data and ii) low-mass and high-mass halo mock data, we find that the measured $E\\_{\\rm ep}$ values are consistent with unity within the $2\\sigma$ level, supporting the validity of $E\\_{\\rm ep}$ on the linear cosmological scales. Taking advantage of advanced observing capabilities, such as next-generation facilities that extend beyond the Square Kilometer Array, the proposed method offers a promising approach for future cosmological tests of EP.\n\n", "2502.02420": "2025-02-04, **Constraints on minimally and conformally coupled ultralight dark matter with the EPTA**, Clemente Smarra et.al., [2502.02420v1](http://arxiv.org/abs/2502.02420v1)\n\n Millisecond pulsars are extremely stable natural timekeepers. Pulsar Timing Array experiments, tracking subtle changes in the pulsars' rotation periods, can shed light on the presence of ultralight particles in our Galaxy. In this conference paper, we start by reviewing the most conservative scenario, in which ultralight particles interact only gravitationally. In this setting, we show that Pulsar Timing Arrays are able to constrain the presence of ultralight fields up to a few tenths of the observed dark matter abundance. Then, we consider conformally coupled ultralight candidates, demonstrating that the constraints on the universal scalar coupling of the field to Standard Model particles improve on existing bounds by several orders of magnitude, in the relevant mass range analyzed by Pulsar Timing Arrays. The discussion presented here is based on [1,2].\n\n", "2502.02398": "2025-02-04, **The Spectrum of Global Axion Strings**, Mathieu Kaltschmidt et.al., [2502.02398v1](http://arxiv.org/abs/2502.02398v1)\n\n The post-inflationary Peccei-Quinn (PQ) symmetry breaking scenario provides a unique opportunity to pinpoint the QCD axion dark matter mass, which is a crucial input for laboratory experiments that are designed for probing specific mass ranges. Predicting their mass requires a precise knowledge of how axions are produced from the decay of topological defects in the early Universe that are inevitably formed. In this contribution, we present recent results on the analysis of the spectrum of axions radiated from global strings based on large scale numerical simulations of the cosmological evolution of the PQ field on a static lattice. We highlight several systematic effects that have been overlooked in previous works, such as the dependence on the initial conditions, contaminations due to oscillations in the spectrum, and discretisation effects; some of which could explain the discrepancy in the current literature. Taking these uncertainties into account and performing the extrapolation to cosmologically relevant string tensions, we find that the dark matter mass is predicted to be in the range of $95\\,\\mu\\text{eV} \\lesssim m\\_a \\lesssim 450 \\, \\mu\\text{eV}$, which will be probed by some of the next generation direct detection experiments.\n\n", "2502.02381": "2025-02-04, **Search for a diffuse flux of photons with energies above tens of PeV at the Pierre Auger Observatory**, The Pierre Auger Collaboration et.al., [2502.02381v1](http://arxiv.org/abs/2502.02381v1)\n\n Diffuse photons of energy above 0.1 PeV, produced through the interactions between cosmic rays and either interstellar matter or background radiation fields, are powerful tracers of the distribution of cosmic rays in the Galaxy. Furthermore, the measurement of a diffuse photon flux would be an important probe to test models of super-heavy dark matter decaying into gamma-rays. In this work, we search for a diffuse photon flux in the energy range between 50 PeV and 200 PeV using data from the Pierre Auger Observatory. For the first time, we combine the air-shower measurements from a 2 km$^2$ surface array consisting of 19 water-Cherenkov surface detectors, spaced at 433 m, with the muon measurements from an array of buried scintillators placed in the same area. Using 15 months of data, collected while the array was still under construction, we derive upper limits to the integral photon flux ranging from 13.3 to 13.8 km$^{-2}$ sr$^{-1}$ yr$^{-1}$ above tens of PeV. We extend the Pierre Auger Observatory photon search program towards lower energies, covering more than three decades of cosmic-ray energy. This work lays the foundation for future diffuse photon searches: with the data from the next 10 years of operation of the Observatory, this limit is expected to improve by a factor of $\\sim$20.\n\n", "2502.02294": "2025-02-04, **Differentiable Cosmological Hydrodynamics for Field-Level Inference and High Dimensional Parameter Constraints**, Benjamin Horowitz et.al., [2502.02294v1](http://arxiv.org/abs/2502.02294v1)\n\n Hydrodynamical simulations are the most accurate way to model structure formation in the universe, but they often involve a large number of astrophysical parameters modeling subgrid physics, in addition to cosmological parameters. This results in a high-dimensional space that is difficult to jointly constrain using traditional statistical methods due to prohibitive computational costs. To address this, we present a fully differentiable approach for cosmological hydrodynamical simulations and a proof-of-concept implementation, diffhydro. By back-propagating through an upwind finite volume scheme for solving the Euler Equations jointly with a dark matter particle-mesh method for Poisson equation, we are able to efficiently evaluate derivatives of the output baryonic fields with respect to input density and model parameters. Importantly, we demonstrate how to differentiate through stochastically sampled discrete random variables, which frequently appear in subgrid models. We use this framework to rapidly sample sub-grid physics and cosmological parameters as well as perform field level inference of initial conditions using high dimensional optimization techniques. Our code is implemented in JAX (python), allowing easy code development and GPU acceleration.\n\n", "2502.02282": "2025-02-04, **Elucidating the Dark Energy and Dark Matter Phenomena Within the Scale-Invariant Vacuum (SIV) Paradigm**, Vesselin G. Gueorguiev et.al., [2502.02282v1](http://arxiv.org/abs/2502.02282v1)\n\n The enigmatic phenomenon of dark energy (DE) is regarded as the elusive entity driving the accelerated expansion of our Universe. A plausible candidate for DE is the non-zero Einstein Cosmological Constant $\\Lambda\\_{E}$ manifested as a constant energy density of the vacuum, yet it seemingly defies gravitational effects. In this work, we interpret the non-zero $\\Lambda\\_{E}$ through the lens of scale-invariant cosmology. We revisit the conformal scale factor $\\lambda$ and its defining equations within the Scale-Invariant Vacuum (SIV) paradigm. Furthermore, we address the profound problem of the missing mass across galactic and extragalactic scales by deriving an MOND-like relation, $g \\sim \\sqrt{a\\_0\\,g\\_N}$, within the SIV context. Remarkably, the values obtained for $\\Lambda\\_{E}$ and the MOND fundamental acceleration, $a\\_0$, align with observed magnitudes, specifically, $a\\_0 \\approx 10^{-10} \\, \\mathrm{m} \\, \\mathrm{s}^{-2}$ and $\\Lambda\\_{E} \\approx 1.8 \\times 10^{-52} \\, \\mathrm{m}^{-2}$. Moreover, we propose a novel early dark energy term, $\\tilde{T}\\_{\\mu\\nu} \\sim \\kappa H$, within the SIV paradigm, which holds potential relevance for addressing the Hubble tension.   Keywords: cosmology; theory; dark energy; dark matter; MOND; Weyl integrable geometry.\n\n", "2502.02256": "2025-02-04, **A Fuzzy Axiverse from String Theory**, Andreas Schachner et.al., [2502.02256v1](http://arxiv.org/abs/2502.02256v1)\n\n In this talk, I showcase models for fuzzy axion dark matter within the framework of type IIB string theory, focusing on axions originating from the Ramond-Ramond four-form in compactifications on Calabi-Yau orientifold hypersurfaces. These models are amenable to cosmological tests if a substantial relic abundance of fuzzy dark matter is produced. I present a topologically exhaustive ensemble of more than 350{,}000 Calabi-Yau compactifications with up to seven axions together with a systematic analysis of the misalignment production of fuzzy dark matter. The resulting dark matter composition is generally a mixture of fuzzy axions and heavier axions, including the QCD axion. Dark photons frequently emerge due to the orientifold projection. I will also comment on applications of optimisation strategies based on automatic differentiation for exploring the string axiverse. This talk is partially based on arXiv:2412.12012.\n\n", "2502.01895": "2025-02-04, **Turbulent gas-rich discs at high redshift: origin of thick stellar discs through 3D 'baryon sloshing'**, Joss Bland-Hawthorn et.al., [2502.01895v1](http://arxiv.org/abs/2502.01895v1)\n\n In response to recent observations from JWST and ALMA, we explore a new class of dynamically self-consistent models using our AGAMA/Ramses hydrodynamic N-body framework (Nexus) that mimics a plausible progenitor of the Milky Way over a wide range of disc gas fractions ($f\\_{\\rm gas} = 0-100\\%$). The high gas surface densities encourage vigorous star formation, which in turn couples with the gas to drive turbulence. We show that this coupling through momentum recoil drives 'baryon sloshing,' i.e. a random walk of the baryonic potential minimum with respect to the centre of the total gravitational potential, $\\Phi\\_{\\rm tot}$. The amplitude of the bulk motion depends on the strength of the feedback, which in turn is directly associated with $f\\_{\\rm gas}$. At its most extreme, when gas is the sole contributor to the disc potential ($f\\_{\\rm gas}=100$%), the amplitude of the walk can reach up to $R\\approx 5$ kpc and $\\vert z\\vert \\approx 1$ kpc within $\\Phi\\_{\\rm tot}(R,\\phi,z)$. Consistent with observations, the disc dominates over dark matter ($f\\_{\\rm disc}\\gtrsim 50$%) within $R\\_s=2.2 R\\_{\\rm disc}$, where $R\\_{\\rm disc}$ is the exponential disc scale length. For a lower $f\\_{\\rm disc}$ and/or $f\\_{\\rm gas}$, the 3D sloshing amplitude and velocity are reduced. The combination of strong feedback (which unbinds the disc) and sloshing leads to the newly formed stars being dynamically heated and settling to a more spatially extended disc population. The 3D heating process is isotropic but its effects are more noticeable in $\\vert z\\vert$ due to the initial dynamical coldness of the star-forming disc. Such a disc has enhanced [$\\alpha$/Fe] stellar abundances and a vertical (but no radial) gradient in stellar age and metallicity, both consistent with the Milky Way's thick stellar disc. Contrary to earlier claims, star formation in a stationary turbulent disc does $not$ produce thick stellar discs.\n\n"}, "supernova": {"2502.02411": "2025-02-04, **Mixing neutron star material into the jets in the common envelope jets supernova r-process scenario**, Noam Soker et.al., [2502.02411v1](http://arxiv.org/abs/2502.02411v1)\n\n I find that the accretion disk around the neutron star (NS) that enters the core of a massive evolved star in the frame of the common-envelope jets supernova (CEJSN) r-process scenario can penetrate the crust of the NS, mix neutron-rich crust material into the disk, and enrich the jets that the disk launches with the neutron-rich material. As the NS accretes at high rates from the core inside which it revolves, it forms an accretion disk with high density. In the CEJSN r-process scenario, the very high density in the accretion disk results in low electron fraction gas, enabling the r-process. Jets carry the r-process elements out. The new claim in this study is that the high-density accretion disk destroys part of the NS crust and entrains this mass. The Kelvin-Helmholtz instability mixes material from the deeper crust. The total neutron-rich mass that the disk mixes and the jets carry can be up to ~0.01Mo. Enriching the accretion disk with neutron-rich material ensures a low electron fraction as required by the r-process nucleosynthesis and the ejection of massive r-process ejecta, ~0.01-0.03Mo. I strengthen the CEJSN r-process scenario but do not claim it is the main r-process site. I only claim that two or more r-process sites contribute to r-process nucleosynthesis.\n\n", "2502.02080": "2025-02-04, **Insight into the physical processes that shape the metallicity profiles in galaxies**, Brian Tapia-Contreras et.al., [2502.02080v1](http://arxiv.org/abs/2502.02080v1)\n\n The distribution of chemical elements in the star-forming regions can store information on the chemical enrichment history of the galaxies. Negative metallicity gradients are expected in galaxies forming inside-out. However, observations show that the metallicity profiles can be broken. We aim to study the diversity of metallicity profiles that can arise in the current cosmological context and compare them with available observations. We also seek to identify the physical processes responsible for breaks in metallicity profiles by using two galaxies as case studies. We analyze central galaxies from the cosmological simulations of the CIELO project, within the stellar mass range [$10^{8.5}$, $10^{10.5}$] M$\\_\\odot$ at $z=0$. A new algorithm, DB-A, was developed to fit multiple power laws to the metallicity profiles, enabling a flexible assessment of metallicity gradients in various galactic regions. The simulations include detailed modeling of gas, metal-dependent cooling, star formation, and supernova feedback. At $z=0$, we find diverse profile shapes, including inner and outer drops and rises, with some galaxies exhibiting double breaks. Gradient values align with observations. A temporal analysis of Local Group analogs shows inner and outer breaks occurring at all cosmic times, with outer breaks being more frequent. Metallicity gradients show high variability at high redshift, transitioning to mild evolution at lower redshift. Most inner breaks show central oxygen enhancement, linked to gas accretion and star formation. Inner drops result from disrupted gas due to feedback-driven outflows. Outer breaks with high metallicities arise from re-accreted material, extended star formation, and CGM-driven gas mixing. Outer drops are common at high redshift, linked to metal-poor gas accretion from cold flows. We highlight the complex interplay of these processes which often act together.\n\n", "2502.02077": "2025-02-04, **Self-consistent scenario for jet and stellar explosion in collapsar: General relativistic magnetohydrodynamics simulation with dynamo**, Masaru Shibata et.al., [2502.02077v1](http://arxiv.org/abs/2502.02077v1)\n\n A resistive magnetohydrodynamics simulation with a dynamo term is performed for modeling the collapsar in full general relativity. As an initial condition, a spinning black hole and infalling stellar matter are modeled based on a stellar evolution result, superimposing a weak toroidal magnetic field. After the growth of a massive torus around the black hole, the magnetic field is amplified in it, developing poloidal fields via dynamo. In an early stage of the torus growth, magnetic fluxes that fall to the vicinity of the central black hole are swallowed by the black hole and global poloidal magnetic fields that can be the source of the Blandford-Znajek mechanism are not developed. However, in a later stage in which the ram pressure of the infalling matter becomes weak, the magnetic field amplified by the black hole spin via the winding becomes large enough to expel the infalling matter by the magnetic pressure, and subsequently, a global poloidal magnetic field that penetrates the black hole is established, launching a jet along the spin axis by the Blandford-Znajek mechanism with the luminosity suitable for explaining typical long gamma-ray bursts. Together with the jet launch, the effectively viscous effect in the inner region of the torus and the magnetocentrifugal effect drive the stellar explosion with the explosion energy comparable to typical or powerful supernovae. We also find large amounts of synthesized $^{56}$Ni and Zn associated with the stellar explosion. In the presence of jet launching, $r$-process elements are weakly synthesized. The numerical results of the explosion energy, ejecta mass, and $^{56}$Ni mass are in a good agreement with those for observed broad-lined type Ic supernovae. Our result illustrates a self-consistent scenario for the gamma-ray-burst-associated broad-lined type Ic supernovae.\n\n"}}