{"neutrino": {"2312.04399": "2023-12-07, **Resonant leptogenesis in minimal inverse seesaw ISS(2,2) model**, Bikash Thapa et.al., [2312.04399v1](http://arxiv.org/abs/2312.04399v1)\n\n We investigate the parameter space of the minimal inverse seesaw ISS(2,2) model for successful leptogenesis. The framework of ISS(2, 2) is realized by augmenting the Standard Model with two right-handed and two Standard Model singlet neutrinos. The decay of the heavy sterile states which is essentially an admixture of the right-handed and SM singlet neutrino states produces the baryon asymmetry of the universe. In this predictive model of leptogenesis, we study resonant leptogenesis where the mass splitting between the heavy sterile states is naturally achieved. We review the possibility of generating the observed baryon asymmetry of the universe via leptogenesis where the CP violation comes solely from the low-energy CP phases. In addition, we study the effect of texture zero in the Dirac mass matrix on the parameter space of the model for successful resonant leptogenesis.\n\n", "2312.04388": "2023-12-07, **Cosmological domain walls from the breaking of $\\mathbf{S_4}$ flavor symmetry**, Adil Jueid et.al., [2312.04388v1](http://arxiv.org/abs/2312.04388v1)\n\n In this work, we delve into the often-overlooked cosmological implications of spontaneous breaking of non-Abelian discrete groups, specifically focusing on the formation of domain walls in the case of $S\\_{4}$ flavor symmetry. In particular, we investigate three interesting breaking patterns of the $S\\_4$ group and study the structure of the domain walls in the broken phase for three possible residual symmetries. The presentation of domain walls in the case of multiple vacua is usually complicated, which therefore implies that most of the analyzes only approximate their presentation. Here, we propose a subtle way to represent the $S\\_{4}$ domain wall networks by presenting the vacua in each breaking pattern as vectors with their components corresponding to their coordinates in the flavon space. Then, through the properties of the obtained vectors, we find that the domain wall networks can be represented by Platonic or Archimedean solids where the vertices represent the degenerate vacua while the edges correspond to the domain walls that separate them. As an illustration, we propose a type-II seesaw model that is based on the $S\\_{4}$ flavor symmetry, and study its phenomenological implications on the neutrino sector. To solve the domain wall problem within this toy model, we consider an approach based on high-dimensional effective operators induced by gravity that explicitly break the structure of the induced vacua favoring one vacuum over the others.\n\n", "2312.04303": "2023-12-07, **The neutrino fog for dark matter-electron scattering experiments**, Ben Carew et.al., [2312.04303v1](http://arxiv.org/abs/2312.04303v1)\n\n The search for sub-GeV dark matter via scattering on electrons has ramped up in the last few years. Like in the case of dark matter scattering on nuclei, electron-recoil-based searches also face an ultimate background in the form of neutrinos. The so-called \"neutrino fog'' refers to the range of open dark-matter parameter space where the background of neutrinos can potentially prevent a conclusive discovery claim of a dark matter signal from being made. In this study, we map the neutrino fog for a range of electron recoil experiments based on silicon, germanium, xenon and argon targets. In analogy to the nuclear recoil case, we also calculate the \"edge'' to the neutrino fog, which can be used as a visual guide to where neutrinos become an important background -- this boundary excludes some parts of the key theory milestones used to motivate these experiments.\n\n", "2312.04278": "2023-12-07, **Measuring neutrino mass and asymmetry with matter pairwise velocities**, Wangzheng Zhang et.al., [2312.04278v1](http://arxiv.org/abs/2312.04278v1)\n\n Neutrinos are believed to be the most abundant fermions in the Universe, but their masses are unknown, except for being non-zero but much smaller than other fermions. Cosmological relic neutrinos could also have non-zero chemical potentials (or asymmetries). We develop a fast neutrino-involved N-body simulation code to include both neutrino mass and asymmetry effects. Using it, we investigate the neutrino effects on the matter pairwise velocity, which itself is an interesting probe of cosmology. We find that for light-halo ($[10^{11},10^{13}]\\ M\\_\\odot$) mean pairwise velocity, in the transition range ($[4,15]\\ \\mathrm{Mpc}$), the effects of neutrino masses overwhelm the effects of neutrino asymmetries, while in the two-halo-group range ($[25,50]\\ \\mathrm{Mpc}$), for both light and heavy haloes ($[10^{13},10^{15}]\\ M\\_\\odot$), the effects of neutrino asymmetries dominate, making it possible to disentangle the two effects. We provide fitting formulae to quantify the effects of neutrino mass and asymmetry on halo-halo pairwise velocities.\n\n"}, "dark matter": {"2312.04320": "2023-12-07, **Resolving \"dirty\" effects around black holes by decoupling the Teukolsky equation**, Ye Jiang et.al., [2312.04320v1](http://arxiv.org/abs/2312.04320v1)\n\n Detecting the environment around the supermassive black holes and tests of general relativity are important applications of extreme-mass-ratio inspirals (EMRIs). There is still a challenge to efficiently describe various \"dirty\" impacts on the inspirals like dark matter, gas, dipole radiation, electromagnetic interaction, and so on. In this Letter, we find the inherent linearity of the asymptotic solution of the inhomogeneous Teukolsky equation. Based on this property, we completely decouple the factors of the perturber and the background spacetime in the energy fluxes and waveforms. With the new decoupling form, the waveforms of EMRIs with non-geodesic motion in Kerr spacetime can be calculated conveniently. This will help to resolve the environment (including gas, field, dark matter, electromagnetic interaction, etc.) around the supermassive black holes and test general relativity.\n\n", "2312.04202": "2023-12-07, **Probing levitodynamics with multi-stochastic forces and the simple applications on the dark matter detection in optical levitation experiment**, Xi Cheng et.al., [2312.04202v1](http://arxiv.org/abs/2312.04202v1)\n\n If the terrestrial environment is permeated by dark matter, the levitation experiences damping forces and fluctuations attributed to dark matter. This paper investigates levitodynamics with multiple stochastic forces, including thermal drag, photon recoil, feedback, etc., assuming that all of these forces adhere to the fluctuation-dissipation theorem. The ratio of total damping to the stochastic damping coefficient distinguishes the levitodynamics from cases involving only one single stochastic force. The heating and cooling processes are formulated to determine the limits of temperature change. All sources of stochastic forces are comprehensively examined, revealing that dark matter collisions cannot be treated analogously to fluid dynamics. Additionally, a meticulous analysis is presented, elucidating the intricate relationship between the fundamental transfer cross-section and the macroscopic transfer cross-section. While the dark damping coefficient is suppressed by the mass of the levitated particle, scattering can be coherently enhanced based on the scale of the component microscopic particle, the atomic form factor, and the static structure factor. Hence, dark damping holds the potential to provide valuable insights into the detection of the macroscopic strength of fundamental particles. We propose experimental procedures for levitation and employ linear estimation to extract the dark damping coefficient. Utilizing current levitation results, we demonstrate that the fundamental transfer cross section of dark matter can be of the order $\\sigma^{\\rm D}\\_{T}\\lsim {\\cal O}(10^{-26})\\rm cm^2$.\n\n", "2312.04085": "2023-12-07, **Impact of primordial black holes on the formation of the first stars and galaxies**, Boyuan Liu et.al., [2312.04085v1](http://arxiv.org/abs/2312.04085v1)\n\n Recent gravitational wave (GW) observations of binary black hole (BH) mergers and the stochastic GW background have triggered renewed interest in primordial black holes (PBHs) in the stellar-mass ($\\sim 10 - 100\\ \\rm M\\_\\odot$) and supermassive regimes ($\\sim 10^7 - 10^{11}\\ \\rm M\\_\\odot$). Although only a small fraction ($\\lesssim 1\\%$) of dark matter (DM) in the form of PBHs is required to explain such observations, these PBHs may play important roles in early structure/star/galaxy formation. In this chapter, we combine semi-analytical analysis and cosmological simulations to explore the possible impact of PBHs on the formation of the first stars and galaxies, taking into account two (competing) effects of PBHs: acceleration of structure formation and gas heating by BH accretion feedback. We find that the impact of stellar-mass PBHs (allowed by existing observational constraints) on primordial star formation is likely minor, although they do alter the properties of the first star-forming halos/clouds and can potentially trigger the formation of massive BHs, while supermassive PBHs serve as seeds of massive structures that can explain the apparent overabundance of massive galaxies in recent observations. Our tentative models and results call for future studies with improved modeling of the interactions between PBHs, particle DM, and baryons to better understand the impact of PBHs on early star/galaxy/structure formation and their imprints in high-redshift observations.\n\n", "2312.04040": "2023-12-07, **Merging history of massive galaxies at 3<z<6**, Kemeng Li et.al., [2312.04040v1](http://arxiv.org/abs/2312.04040v1)\n\n The observational data of high redshift galaxies become increasingly abundant, especially since the operation of the James Webb Space Telescope (JWST), which allows us to verify and optimize the galaxy formation model at high redshifts. In this work, we investigate the merging history of massive galaxies at $3 < z < 6$ using a well-developed semi-analytic galaxy formation catalogue. We find that the major merger rate increases with redshift up to 3 and then flattens. The fraction of wet mergers, during which the sum of the cold gas mass is higher than the sum of the stellar mass in two merging galaxies, also increases from $\\sim$ 34\\% at $z = 0$ to 96\\% at $z = 3$. Interestingly, almost all major mergers are wet at $z > 3$ . This can be attributed to the high fraction ($> 50\\%$) of cold gas at $z > 3$. In addition, we study some special systems of massive merging galaxies at $3 < z < 6$, including the massive gas-rich major merging systems and extreme dense proto-clusters, and investigate the supermassive black hole-dark matter halo mass relation and dual AGNs. We find that the galaxy formation model reproduces the incidence of those observed massive galaxies, but fails to reproduce the relation between the supermassive black hole mass and the dark matter halo mass at $z \\sim 6$. The latter requires more careful estimates of the supermassive black hole masses observationally. Otherwise, it could suggest modifications of the modeling of the supermassive black hole growth at high redshifts.\n\n", "2312.04017": "2023-12-07, **Oscillations of Ultralight Dark Photon into Gravitational Waves**, Wei Chao et.al., [2312.04017v1](http://arxiv.org/abs/2312.04017v1)\n\n The discovery of gravitational waves (GWs) opens a new window for exploring the physics of the early universe. Identifying the source of GWs and their spectra today turn out to be the important tasks so as to assist the experimental detection of stochastic GWs. In this paper, we investigate the oscillations of the ultralight dark photon (ULDP) into GWs in the dark halo. Assuming dark matter is composed of the ULDP and there are primordial dark magnetic fields (PDMFs) arising from the axion inflation and/or the dark phase transition, then the ULDP can oscillate into the GW when it passes through an environment of PDMFs. We derive the local energy density of GWs in the galaxy cluster induced by the instaneous oscillation of ULDP in the PDMFs. These stochastic local GWs exhibit a pulse-like spectrum, with frequency depending on the mass of the ULDP, and can be detected in Pulsar Timing Arrays (PTAs) or future space-based interferometers. We also find that the low-frequency GW signal observed by the NANOGrav collaboration and other PTA experiments can be explained by the oscillation of the ULDP in the PDMFs in the early universe.\n\n", "2312.04007": "2023-12-07, **Restoring cosmological concordance with axion-like early dark energy and dark matter characterized by a constant equation of state?**, Yan-Hong Yao et.al., [2312.04007v1](http://arxiv.org/abs/2312.04007v1)\n\n The Hubble tension persists as a challenge in cosmology. Even early dark energy (EDE) models, initially considered the most promising for alleviating the Hubble tension, fall short of addressing the issue without exacerbating other tensions, such as the $S\\_8$ tension. Considering that a negative dark matter (DM) equation of state (EoS) parameter is conducive to reduce the value of $\\sigma\\_8$ parameter, in this paper, we extend the axion-like EDE model in this paper by replacing the cold dark matter (CDM) with DM characterized by a constant EoS $w\\_{\\rm dm}$ (referred as WDM hereafter). We then impose constraints on this axion-like EDE extension model, along with three other models: the axion-like EDE model, $\\Lambda$WDM, and $\\Lambda$CDM. These constraints are derived from a comprehensive analysis incorporating data from the Planck 2018 cosmic microwave background (CMB), baryon acoustic oscillations (BAO), the Pantheon compilation, as well as a prior on $H\\_0$ (i.e., $H\\_0=73.04\\pm1.04$, based on the latest local measurement by Riess et al.) and a Gaussianized prior on $S\\_8$ (i.e., $S\\_8=0.766\\pm0.017$, determined through the joint analysis of KID1000+BOSS+2dLenS). We find that although the new model maintains the ability to alleviate the Hubble tension to $\\sim$ 1.4$\\sigma$, it still exacerbate the $S\\_8$ tension to a level similar to that of the axion-like EDE model.\n\n"}, "supernova": {"2312.04426": "2023-12-07, **SN2023ixf in Messier 101: the twilight years of the progenitor as seen by Pan-STARRS**, Conor L. Ransome et.al., [2312.04426v1](http://arxiv.org/abs/2312.04426v1)\n\n The nearby type II supernova, SN2023ixf in M101 exhibits signatures of early-time interaction with circumstellar material in the first week post-explosion. This material may be the consequence of prior mass loss suffered by the progenitor which possibly manifested in the form of a detectable pre-supernova outburst. We present an analysis of the long-baseline pre-explosion photometric data in $g$, $w$, $r$, $i$, $z$ and $y$ filters from Pan-STARRS as part of the Young Supernova Experiment, spanning $\\sim$5,000 days. We find no significant detections in the Pan-STARRS pre-explosion light curve. We train a multilayer perceptron neural network to classify pre-supernova outbursts. We find no evidence of eruptive pre-supernova activity to a limiting absolute magnitude of $-7$. The limiting magnitudes from the full set of $gwrizy$ (average absolute magnitude $\\approx$-8) data are consistent with previous pre-explosion studies. We use deep photometry from the literature to constrain the progenitor of SN2023ixf, finding that these data are consistent with a dusty red supergiant (RSG) progenitor with luminosity $\\log\\left(L/L\\_\\odot\\right)$$\\approx$5.12 and temperature $\\approx$3950K, corresponding to a mass of 14-20 M$\\_\\odot$\n\n", "2312.04277": "2023-12-07, **The physical properties of T Pyx as measured by MUSE I. The geometrical distribution of the ejecta and the distance to the remnant**, L. Izzo et.al., [2312.04277v1](http://arxiv.org/abs/2312.04277v1)\n\n T Pyx is one of the most enigmatic recurrent novae, and it has been proposed as a potential Galactic type-Ia supernova progenitor. Using spatially-resolved data obtained with MUSE, we characterized the geometrical distribution of the material expelled in previous outbursts surrounding the white dwarf progenitor. We used a 3D model for the ejecta to determine the geometric distribution of the extended remnant. We have also calculated the nebular parallax distance ($d = 3.55 \\pm 0.77$ kpc) based on the measured velocity and spatial shift of the 2011 bipolar ejecta. These findings confirm previous results, including data from the GAIA mission. The remnant of T Pyx can be described by a two-component model, consisting of a tilted ring at $i = 63.7$ deg, relative to its normal vector and by fast bipolar ejecta perpendicular to the plane of the equatorial ring. We find an upper limit for the bipolar outflow ejected mass in 2011 of the bipolar outflow of $M\\_{ej,b} < (3.0 \\pm 1.0) \\times 10^{-6}$ M$\\_{\\odot}$, which is lower than previous estimates given in the literature. However, only a detailed physical study of the equatorial component could provide an accurate estimate of the total ejecta of the last outburst, a fundamental step to understand if T Pyx will end its life as a type-Ia supernova.\n\n", "2312.03973": "2023-12-07, **Physical Models for the Astrophysical Population of Black Holes: Application to the Bump in the Mass Distribution of Gravitational Wave Sources**, Jacob Golomb et.al., [2312.03973v1](http://arxiv.org/abs/2312.03973v1)\n\n Gravitational wave observations of binary black holes have revealed unexpected structure in the black hole mass distribution. Previous studies of the mass distribution employ physically-motivated phenomenological models and infer the parameters that directly control the features of the mass distribution that are allowed in their model, associating the constraints on those parameters with their physical motivations. In this work, we take an alternative approach in which we introduce a model parameterizing the underlying stellar and core-collapse physics and obtaining the remnant black hole distribution as a derived byproduct. In doing so, we directly constrain the stellar physics necessary to explain the astrophysical distribution of black hole properties under a given model. We apply this approach to modeling the mapping between stellar core mass and remnant black hole mass, including the effects of mass loss due to the pulsational pair instability supernova (PPISN) process, which has been proposed as an explanation for the observed excess of black holes at $\\sim 35 M\\_\\odot$. Placing constraints on the nuclear reaction rates necessary to explain the PPISN parameters, we conclude that the peak observed at $\\sim 35 M\\_\\odot$ is highly unlikely to be a signature from the PPISN process. This procedure can be applied to modeling any physical process that underlies the astrophysical mass distribution. Allowing the parameters of the core-remnant mass relationship to evolve with redshift permits correlated and physically reasonable changes in the location, shape, and amplitude of features in the mass function. We find that the current data are consistent with no redshift evolution in the core-remnant mass relationship, but ultimately place only weak constraints on the change of these parameters.\n\n"}}