{"neutrino": {"2402.19417": "2024-02-29, **Neutrino zeromodes on electroweak strings in light of topological insulators**, Minoru Eto et.al., [2402.19417v1](http://arxiv.org/abs/2402.19417v1)\n\n We examine neutrino zeromode solutions on the electroweak $Z$-string and their effect on the stability of the string in the standard model and its extensions. We propose using topological invariants constructed from the momentum (and real) space topology of Green's functions, often used for investigating edge modes in condensed matter physics. We analyze the standard model and then examine type-I and type-II extensions of the neutrino sector as well as their hybrid. Based on this analysis, we also comment on proposals in the literature to stabilize the $Z$-string.\n\n", "2402.19393": "2024-02-29, **New Physics with PeV Astrophysical Neutrino Beams**, Ibrahim Safa et.al., [2402.19393v1](http://arxiv.org/abs/2402.19393v1)\n\n Astrophysical neutrinos allow us to access energies and baselines that cannot be reached by human-made accelerators, offering unique probes of new physics phenomena. This thesis aims to address the challenges currently facing searches for Beyond Standard Model (BSM) physics in the high-energy universe using astrophysical neutrinos, particularly in the contexts of flavor measurements and connections with dark matter.\n\n", "2402.19314": "2024-02-29, **Sources of high-energy astrophysical neutrinos**, Walter Winter et.al., [2402.19314v1](http://arxiv.org/abs/2402.19314v1)\n\n We discuss recent results in neutrino astronomy and their implications for the cosmic-ray acceleration in relativistic outflows, such as in Active Galactic Nuclei (AGN) jets, Gamma-Ray Bursts (GRBs), and Tidal Disruption Events (TDEs). We especially focus on challenges at the interface to particle acceleration which can be inferred from the multi-messenger context, such as the paradigm that the sources power the Ultra-High-Energy Cosmic Rays (UHECRs). We demonstrate that both AGN blazars (in the context of neutrino observations) and GRBs (as UHECR sources in the context of neutrino-non-observations) point towards acceleration spectra harder than $E^{-2}$, or relatively high minimal cosmic-ray injection energies, to meet the respective energy budget requirements. We furthermore speculate that neutrino flares in AGN blazars may be related to super-Eddington accretion flares, or that GRBs are powered by significantly higher kinetic energies than typically assumed in electromagnetic models. For internal shock models, the UHECR paradigm for GRBs can only be maintained in the light of neutrino stacking limits in multi-zone models. While relativistic outflows in TDEs have become recently interesting per se and models for the neutrino emission from jetted TDEs exist, a direct connection between TDE jets pointing in our direction and astrophysical neutrinos has not been identified yet.\n\n", "2402.19306": "2024-02-29, **New Pathways in Neutrino Physics via Quantum-Encoded Data Analysis**, Jeffrey Lazar et.al., [2402.19306v1](http://arxiv.org/abs/2402.19306v1)\n\n Ever-increasing amount of data is produced by particle detectors in their quest to unveil the laws of Nature. The large data rate requires the use of specialized triggers that promptly reduce the data rate to a manageable level; however, in doing so, unexpected new phenomena may escape detection. Additionally, the large data rate is increasingly difficult to analyze effectively, which has led to a recent revolution on machine learning techniques. Here, we present a methodology based on recent quantum compression techniques that has the capacity to store exponentially more amount of information than classically available methods. To demonstrate this, we encode the full neutrino telescope event information using parity observables in an IBM quantum processor using 8 qubits. Then we show that we can recover the information stored on the quantum computer with a fidelity of 84%. Finally, we illustrate the use of our protocol by performing a classification task that separates electron-neutrino events to muon-neutrinos events in a neutrino telescope. This new capability would eventually allow us to solve the street light effect in particle physics, where we only record signatures of particles with which we are familiar.\n\n", "2402.19281": "2024-02-29, **First simultaneous measurement of differential muon-neutrino charged-current cross sections on argon for final states with and without protons using MicroBooNE data**, MicroBooNE collaboration et.al., [2402.19281v1](http://arxiv.org/abs/2402.19281v1)\n\n We report the first double-differential neutrino-argon cross section measurement made simultaneously for final states with and without protons for the inclusive muon neutrino charged-current interaction channel. The proton kinematics of this channel are further explored with a differential cross section measurement as a function of the leading proton's kinetic energy that extends across the detection threshold. These measurements utilize data collected using the MicroBooNE detector from 6.4$\\times10^{20}$ protons on target from the Fermilab Booster Neutrino Beam with a mean neutrino energy of $\\sim$0.8 GeV. Extensive data-driven model validation utilizing the conditional constraint formalism is employed. This motivates enlarging the uncertainties with an empirical reweighting approach to minimize the possibility of extracting biased cross section results. The extracted nominal flux-averaged cross sections are compared to widely used event generator predictions revealing severe mismodeling of final states without protons for muon neutrino charged-current interactions, possibly from insufficient treatment of final state interactions. These measurements provide a wealth of new information useful for improving event generators which will enhance the sensitivity of precision measurements in neutrino experiments.\n\n", "2402.19252": "2024-02-29, **Fast neutrino flavor conversions in a supernova: emergence, evolution, and effects**, Zewei Xiong et.al., [2402.19252v1](http://arxiv.org/abs/2402.19252v1)\n\n Fast flavor conversions (FFCs) of neutrinos, which can occur in core-collapse supernovae (CCSNe), are multiangle effects. They depend on the angular distribution of the neutrino's electron lepton number (ELN). In this work, we present a comprehensive study of the FFCs by solving the multienergy and multiangle quantum kinetic equations with an extended set of collisional weak processes based on a static and spherically symmetric CCSN matter background profile. We investigate the emergence and evolution of FFCs in models featuring different ELN angular distributions, considering scenarios with two and three neutrino flavors. The spectrogram method is utilized to illustrate the small-scale spatial structure, and we show that this structure of neutrino flavor coherence and number densities in the nonlinear regime is qualitatively consistent with the dispersion relation analysis. On the coarse-grained level, we find that different asymptotic states can be achieved following the FFCs depending on the locations and shapes of the ELN distributions, despite sharing a common feature of the elimination of the ELN angular crossing. While equilibration among different neutrino flavors may be achieved immediately after the prompt FFCs, it is not a general outcome of the asymptotic state, as subsequent feedback effects from collisional neutrino-matter interactions come into play, particularly for cases where FFCs occur inside the neutrinosphere. The impacts of FFCs and the feedback effect on the net neutrino heating rates, the equilibrium electron fraction of CCSN matter, and the free-streaming neutrino energy spectra are quantitatively assessed. Other aspects including the impact of the vacuum term and the coexistence with other type of flavor instabilities are also discussed.\n\n", "2402.19224": "2024-02-29, **Minimal SU(5) theory on the edge: the importance of being effective**, Goran Senjanović et.al., [2402.19224v1](http://arxiv.org/abs/2402.19224v1)\n\n It is well known that the minimal renormalizable $SU(5)$ grand unified theory is ruled out: it predicts same masses of down quarks and charged leptons, the gauge couplings do not unify and neutrinos are massless. We show here that all this can be cured simultaneously by the addition of higher-dimensional effective operators. However, the theory lives on the edge since the unification scale turns out as low as roughly $10^{14}\\,$GeV, threatening proton longevity. If the lower bound on the proton lifetime was to be increased by an order of magnitude, the usual desert in energies between the weak and unification scales would be populated. We also revisit two minimal extensions of this theory that offer a dynamical seesaw origin of neutrino mass, and discuss the resulting consequences.\n\n", "2402.19216": "2024-02-29, **Inclusive cross section measurements in final states with and without protons for charged-current $ν_μ$-Ar scattering in MicroBooNE**, MicroBooNE collaboration et.al., [2402.19216v1](http://arxiv.org/abs/2402.19216v1)\n\n A detailed understanding of inclusive muon neutrino charged-current interactions on argon is crucial to the study of neutrino oscillations in current and future experiments using liquid argon time projection chambers. To that end, we report a comprehensive set of differential cross section measurements for this channel that simultaneously probe the leptonic and hadronic systems by dividing the channel into final states with and without protons. Measurements of the proton kinematics and proton multiplicity of the final state are also presented. For these measurements, we utilize data collected with the MicroBooNE detector from 6.4$\\times10^{20}$ protons on target from the Fermilab Booster Neutrino Beam at a mean neutrino energy of approximately 0.8 GeV. We present in detail the cross section extraction procedure, including the unfolding, and model validation that uses data to model comparisons and the conditional constraint formalism to detect mismodeling that may introduce biases to extracted cross sections that are larger than their uncertainties. The validation exposes insufficiencies in the overall model, motivating the inclusion of an additional data-driven reweighting systematic to ensure the accuracy of the unfolding. The extracted results are compared to a number of event generators and their performance is discussed with a focus on the regions of phase-space that indicate the greatest need for modeling improvements.\n\n", "2402.19178": "2024-02-29, **Study of Long Range Force in P2SO and T2HKK**, Priya Mishra et.al., [2402.19178v1](http://arxiv.org/abs/2402.19178v1)\n\n In this paper we have studied the sensitivity of the future long-baseline neutrino experiments P2SO and T2HKK to the long-range force (LRF). In the context of these two experiments, our aim is to study: (i) the capability to put bounds on the LRF parameters, (ii) effect of LRF in the measurement of standard oscillation parameters and (iii) capability to constrain the mass of the new gauge boson and the value of new coupling constant, that gives rise to LRF due to matter density in Sun. In our study, we find that among the different neutrino experiments, the best bound on the LRF parameters including mass of the new gauge boson and the value of new coupling constant will come from the P2SO experiment. Our study also shows that LRF has non-trivial effect on the determination of the standard neutrino oscillation parameters except the precision of $\\Delta m^2\\_{31}$. For this parameter, the precision remains unaltered in the presence of LRF for both these experiments.\n\n", "2402.18906": "2024-02-29, **Neutrino Mixing and Resonant Leptogenesis in Inverse Seesaw and Δ(54) Flavor Symmetry**, Hrishi Bora et.al., [2402.18906v1](http://arxiv.org/abs/2402.18906v1)\n\n The current work involves augmenting the $\\Delta(54)$ discrete flavor model by incorporating two Standard Model Higgs particles into the Inverse Seesaw mechanism. We introduced Weyl fermions and Vector like fermions, which are gauge singlets in the Standard Model and produces Majorana mass terms in our lagrangian. The resulting mass matrix deviates from the tribimaximal neutrino mixing pattern producing a non-zero reactor angle ($\\theta\\_{13}$) . We have determined the effective Majorana neutrino mass, which is the parameter of relevance in neutrinoless double beta decay investigations, using the model's limited six-dimensional parameter space. We additionally investigate the possibility of baryogenesis in the proposed framework via resonant leptogenesis. We have the non-zero value for resonantly enhanced CP asymmetry originating from the decay of right-handed neutrinos at the TeV scale, accounting for flavor effects. The evolution of lepton asymmetry is systematically analyzed by numerically solving a set of Boltzmann equations, leading to the determination of the baryon asymmetry with a magnitude of $ \\lvert \\eta\\_B \\rvert \\approx 6 \\times 10^{-10}$. This outcome is achieved by selecting specific values for the right-handed neutrino mass $M\\_1 = 10$ TeV and mass splitting, $d \\approx 10^{-8}$.\n\n", "2402.18894": "2024-02-29, **Searches for beyond-standard-model physics with astroparticle physics instruments**, Markus Ackermann et.al., [2402.18894v1](http://arxiv.org/abs/2402.18894v1)\n\n Many instruments for astroparticle physics are primarily geared towards multi-messenger astrophysics, to study the origin of cosmic rays (CR) and to understand high-energy astrophysical processes. Since these instruments observe the Universe at extreme energies and in kinematic ranges not accessible at accelerators these experiments provide also unique and complementary opportunities to search for particles and physics beyond the standard model of particle physics. In particular, the reach of IceCube, Fermi and KATRIN to search for and constrain Dark Matter, Axions, heavy Big Bang relics, sterile neutrinos and Lorentz Invariance Violation (LIV) will be discussed. The contents of this article are based on material presented at the Humboldt-Kolleg \"Clues to a mysterious Universe - exploring the interface of particle, gravity and quantum physics\" in June 2022.\n\n", "2402.18841": "2024-02-29, **Perturbed $f(R)$ gravity coupled with neutrinos: exploring cosmological implications**, Muhammad Yarahmadi et.al., [2402.18841v1](http://arxiv.org/abs/2402.18841v1)\n\n We conduct a thorough examination of cosmological parameters within the context of $f(R)$ gravity coupled with neutrinos, leveraging a diverse array of observational datasets, including Cosmic Microwave Background (CMB), Cosmic Chronometers (CC), Baryon Acoustic Oscillations (BAO), and Pantheon supernova data. Our analysis unveils compelling constraints on pivotal parameters such as the sum of neutrino masses ($\\sum m\\_{\\nu}$), the interaction strength parameter ($\\Gamma$), sound speed ($c\\_s$), Jean's wavenumbers ($k\\_J$), redshift of non-relativistic matter ($z\\_{\\rm nr}$), and the redshift of the Deceleration-Acceleration phase transition ($z\\_{\\rm DA}$). The incorporation of neutrinos within the $f(R)$ gravity framework emerges as a key factor significantly influencing cosmic evolution, intricately shaping the formation of large-scale structures and the dynamics of cosmic expansion. Additionally, a detailed analysis of bulk flow direction and amplitude across various redshifts provides valuable insights into the nature of large-scale structures. A notable aspect of our model is the nuanced integration of $f(R)$ gravity theory with neutrinos, representing a distinctive approach to unraveling cosmological phenomena. This framework, unlike previous models, explicitly considers the impact of neutrinos on gravitational interactions, the formation of large-scale structures, and the overarching dynamics of cosmic expansion within the $f(R)$ gravity paradigm. Furthermore, our study addresses the Hubble tension problem by comparing $H\\_0$ measurements within our model, offering a potential avenue for reconciling discrepancies. Our findings not only align with existing research but also contribute novel perspectives to our understanding of dark energy, gravitational interactions, and the intricate challenges posed by the Hubble tension.\n\n"}, "dark matter": {"2402.19468": "2024-02-29, **Gravitational wave constraints on planetary-mass primordial black holes using LIGO O3a data**, Andrew L. Miller et.al., [2402.19468v1](http://arxiv.org/abs/2402.19468v1)\n\n Gravitational waves from sub-solar mass inspiraling compact objects would provide smoking-gun evidence for primordial black holes (PBHs). We perform the first search for inspiraling planetary-mass PBHs, both in equal-mass or asymmetric mass ratio binaries, using data from the first half of the LIGO-Virgo-KAGRA third observing run. We do not find any significant candidates, but determine the maximum luminosity distance reachable with our search to be of $O(0.1-100)$ kpc, and corresponding model-independent upper limits on the merger rate densities to be $O(10^{3}-10^{-7})$ kpc$^{-3}$yr$^{-1}$ for systems with chirp masses $O(10^{-4}-10^{-2})M\\_\\odot$, respectively. Furthermore, we interpret these rate densities as arising from PBH binaries, and thereby constrain the fraction of dark matter that these objects could compose. For equal-mass PBH binaries, we find $f\\_\\text{PBH}<$ [1, 0.04] for $m\\_\\text{PBH}\\in [2\\times 10^{-3},10^{-2}]M\\_\\odot$, respectively. For asymmetric mass-ratio binaries, where $m\\_1=2.5M\\_\\odot$ and $m\\_2\\ll m\\_1$, we constrain the mass function $f(m\\_2)<1$ for $m\\_2\\in [1.5\\times10^{-5},2\\times10^{-4}]M\\_\\odot$, assuming $f\\_\\text{PBH}=0.1$ and $f(m\\_1)\\sim 1$. Our results constitute the first gravitational-wave constraints on planetary-mass PBHs in both equal-mass and highly asymmetric mass-ratio systems, provide a computationally efficient alternative to matched filtering in this mass regime, and complement microlensing experiments to probe the existence of these objects. The data necessary to produce the upper limit plots has also been released on Zenodo.\n\n", "2402.19459": "2024-02-29, **Anomalous contribution to galactic rotation curves due to stochastic spacetime**, Jonathan Oppenheim et.al., [2402.19459v1](http://arxiv.org/abs/2402.19459v1)\n\n We consider a proposed alternative to quantum gravity, in which the spacetime metric is treated as classical, even while matter fields remain quantum. Consistency of the theory necessarily requires that the metric evolve stochastically. Here, we show that this stochastic behaviour leads to a modification of general relativity at low accelerations.   In the low acceleration regime, the variance in the acceleration produced by the gravitational field is high in comparison to that produced by the Newtonian potential, and acts as an entropic force, causing a deviation from Einstein's theory of general relativity. We show that in this \"diffusion regime\", the entropic force acts from a gravitational point of view, as if it were a contribution to the matter distribution.   We compute how this modifies the expectation value of the metric via the path integral formalism, and find that an entropic force driven by a stochastic cosmological constant can explain galactic rotation curves without needing to evoke dark matter. We caution that a greater understanding of this effect is needed before conclusions can be drawn, most likely through numerical simulations, and provide a template for computing the deviation from general relativity which serves as an experimental signature of the Brownian motion of spacetime.\n\n", "2402.19362": "2024-02-29, **Dark energy and dark matter configurations for wormholes and solitionic hierarchies of nonmetric Ricci flows and $F(R,T,Q,T_{m})$ gravity**, Laurenţiu Bubuianu et.al., [2402.19362v1](http://arxiv.org/abs/2402.19362v1)\n\n We extend the anholonomic frame and connection deformation method, AFCDM, for constructing exact and parametric solutions in general relativity, GR, to geometric flow models and modified gravity theories, MGTs, with nontrivial torsion and nonmetricity fields. Following abstract geometric or variational methods, we can derive corresponding systems of nonmetric gravitational and matter field equations which consist of very sophisticated systems of coupled nonlinear PDEs. Using nonholonomic frames with dyadic spacetime splitting and applying the AFCDM, we prove that such systems of PDEs can be decoupled and integrated in general forms for generic off-diagonal metric structures and generalized affine connections. We generate new classes of quasi-stationary solutions (which do not depend on time like coordinates) and study the physical properties of some physically important examples. Such exact or parametric solutions are determined by nonmetric solitonic distributions and/or ellipsoidal deformations of wormhole hole configurations. It is not possible to describe the thermodynamic properties of such solutions in the framework of the Bekenstein-Hawking paradigm because such metrics do not involve, in general, certain horizons, duality, or holographic configurations. Nevertheless, we can always elaborate on associated Grigori Perelman thermodynamic models elaborated for nonmetric geometric flows. In explicit form, applying the AFCDM, we construct and study the physical implications of new classes of traversable wormhole solutions describing solitonic deformation and dissipation of non-Riemannian geometric objects. Such models with nontrivial gravitational off-diagonal vacuum are important for elaborating models of dark energy and dark matter involving wormhole configurations and solitonic-type structure formation.\n\n", "2402.19238": "2024-02-29, **Bosonic dark matter dynamics in hybrid neutron stars**, Zakary Buras-Stubbs et.al., [2402.19238v1](http://arxiv.org/abs/2402.19238v1)\n\n This research studies the intricate interplay between dark and baryonic matter within hybrid neutron stars enriched by anisotropic bosonic dark matter halos. Our modelling, guided by the equation of state with a free parameter, reveals diverse mass-radius correlations for these astronomical objects. A pivotal result is the influence of dark matter characteristics - whether condensed or dispersed - on the observable attributes of neutron stars based on their masses. Our investigation into anisotropic models, which offer a notably authentic representation of dark matter anisotropy, reveals a unique low-density core halo profile, distinguishing it from alternative approaches. Insights gleaned from galactic clusters have further refined our understanding of the bosonic dark matter paradigm. Observational constraints derived from the dynamics of galaxy clusters have been fundamental in defining the dark matter particle mass to lie between 0.05 GeV and 0.5 GeV and the scattering length to range from 0.9 fm to 3 fm. Using terrestrial Bose-Einstein condensate experiments, we have narrowed down the properties of bosonic dark matter, especially in the often overlooked 3 to 30 GeV mass range. Our findings fortify the understanding of dark and baryonic matter synergies in hybrid neutron stars, establishing a robust foundation for future astrophysical pursuits.\n\n", "2402.19208": "2024-02-29, **Deciphering the Belle II data on $B\\to K ν\\barν$ decay in the (dark) SMEFT with minimal flavour violation**, Biao-Feng Hou et.al., [2402.19208v1](http://arxiv.org/abs/2402.19208v1)\n\n Recently, the Belle II collaboration announced the first measurement of $\\mathcal B(B^+\\to K^+\\nu\\bar\\nu)$, which is found to be about $2.7\\sigma$ higher than the SM prediction. We decipher the data with two new physics scenarios: the underlying $b\\to s \\nu\\bar\\nu$ transition is, besides the SM contribution, further affected by heavy new mediators that are much heavier than the electroweak scale, or amended by an additional decay channel with undetected light final states like dark matter or axion-like particles. These two scenarios can be most conveniently analyzed in the SMEFT and the dark SMEFT (DSMEFT) framework, respectively. We consider the flavour structures of the resulting effective operators to be either generic or satisfy the minimal flavour violation (MFV) hypothesis, both for the quark and lepton sectors. In the first scenario, once the MFV assumption is made, only one SM-like low-energy effective operator induced by the SMEFT dim-6 operators can account for the Belle II excess, the parameter space of which is, however, excluded by the Belle upper bound on $\\mathcal B(B^0\\to K^{* 0}\\nu\\bar\\nu)$. In the second scenario, it is found that the Belle II excess can be accommodated by 22 of the DSMEFT operators involving one or two scalar, fermionic, or vector dark matters as well as axion-like particles. These operators also receive dominant constraints from the $B^0\\to K^{*0}+\\rm inv$ and $B\\_s\\to\\rm inv$ decays. Once the MFV hypothesis is assumed, the number of viable operators is reduced to 14, and the $B^+\\to\\pi^+ +\\rm inv$ and $K^+\\to\\pi^+ +\\rm inv$ decays start to put further constraints. Within the parameter space allowed by all the current experimental data, the $q^2$ distributions of the $B\\to K^{(*)}+\\rm inv$ decays are studied for each viable operator. In addition, the future prospects at Belle II, CEPC and FCC-ee are also discussed for some of these FCNC processes.\n\n", "2402.19063": "2024-02-29, **Search for Axion dark matter with the QUAX-LNF tunable haloscope**, A. Rettaroli et.al., [2402.19063v1](http://arxiv.org/abs/2402.19063v1)\n\n We report the first experimental results obtained with the new haloscope of the QUAX experiment located at Laboratori Nazionali di Frascati of INFN (LNF). The haloscope is composed of a OFHC Cu resonant cavity cooled down to about 30 mK and immersed in a magnetic field of 8 T. The cavity frequency was varied in a 6 MHz range between 8.831496 and 8.83803 GHz. This corresponds to a previously unprobed mass range between 36.52413 and 36.5511 $\\mu$eV. We don't observe any excess in the power spectrum and set limits on the axion-photon coupling in this mass range down to $g\\_{a\\gamma\\gamma} < 0.861 \\times 10^{-13}$ GeV$^{-1}$ with the confidence level set at $90\\%$.\n\n", "2402.18882": "2024-02-29, **Exploring the evolution of structure growth in the universe with field-fluid interactions through dynamical stability analysis**, Anirban Chatterjee et.al., [2402.18882v1](http://arxiv.org/abs/2402.18882v1)\n\n We investigate an interacting quintessence dark energy - dark matter scenario and its impact on structure formation by analyzing the evolution of scalar perturbations. The interaction is introduced by incorporating a non-zero source term into the continuity equations of the two sectors (with opposite signs), modeled as $\\bar{Q}\\_0 \\equiv \\alpha\\bar{\\rho}\\_{\\rm m}(H + \\kappa\\dot{\\phi})$. The coupling parameter $\\alpha$ and the parameter $\\lambda$ involved in quintessence potential $V(\\phi) = V\\_0e^{-\\lambda\\kappa\\phi}$, play crucial roles in governing the dynamics of evolution examined within the present framework. The cosmic evolution, within this context, is depicted as a first-order autonomous system of equations involving appropriately chosen dynamical variables. We analyzed the associated stability characteristics and growth rate of perturbations and obtained domains in the ($\\alpha-\\lambda$) parameter space for which fixed points can exhibit stable and non-phantom accelerating solutions. Depending on its magnitude, the coupling parameter $\\alpha$ has the potential to change the characteristics of certain critical points, altering them from attractors to repellers. This model effectively captures the evolutionary features of the universe across its various phases at both the background and perturbation levels. The issue of cosmic coincidence can also be addressed within the framework of this model. We also observed that for a moderate strength of coupling, the growth rate of matter perturbation extends into the distant future.\n\n", "2402.18880": "2024-02-29, **Weak Lensing Constraints on Dark Matter-Baryon Interactions with $N$-Body Simulations and Machine Learning**, Chi Zhang et.al., [2402.18880v1](http://arxiv.org/abs/2402.18880v1)\n\n We investigate the elastic scattering cross section between dark matter and protons using the DES Year 3 weak lensing data. This scattering induces a dark acoustic oscillation structure in the matter power spectra. To address non-linear effects at low redshift, we utilize principal component analysis alongside a limited set of $N$-body simulations, improving the reliability of our matter power spectrum prediction. We further perform a robust Markov Chain Monte Carlo analysis to derive the upper bounds on the DM-proton elastic scattering cross-section, assuming different velocity dependencies. Our results, presented as the first Frequentist upper limits, are compared with the ones obtained by Bayesian approach. Compared with the upper limits derived from the Planck cosmic microwave background data, our findings from DES Year 3 data exhibit improvements of up to a factor of five. In addition, we forecast the future sensitivities of the China Space Station Telescope, the upcoming capabilities of this telescope could improve the current limits by approximately one order of magnitude.\n\n"}, "supernova": {"2402.19260": "2024-02-29, **Modeling the Progenitor Stars of Observed IIP Supernovae**, Kai-An You et.al., [2402.19260v1](http://arxiv.org/abs/2402.19260v1)\n\n The luminosity of Type IIP supernovae (SNe IIP) primarily arises from the recombination of hydrogen ionized by the explosion shock and the radioactive decay of \\Co. However, the physical connections between SNe IIP and their progenitor stars remain unclear. This paper presents a comprehensive grid of stellar evolution models and their corresponding supernova light curves (LCs) to investigate the physical properties of observed SNe IIP. The study employs the one-dimensional stellar evolution code, \\texttt{MESA}. Our models consider the effects of stellar metallicity, mass, and rotation in the evolution of massive stars, as well as explosion energy and \\Ni\\ production in modeling supernovae. To elucidate the observed LCs of SNe IIP and to probe their progenitor stars, we fit the observed SNe IIP with our multi-color LCs and discuss their physical origins. Furthermore, we investigate the impact of stellar parameters on LCs. Factors such as the progenitor star's mass, rotation, metallicity, explosion energy, and \\Ni\\ production influence the light curve's shape and duration. We find that higher-mass stars exhibit longer plateaus due to increased photon diffusion time caused by massive ejecta, impacting the duration of the light curve. Rapid rotation affects internal stellar structures, enhancing convective mixing and mass loss, potentially affecting the plateau's brightness and duration. Higher metallicity leads to increased opacity, altering energy transport and luminosity. Higher explosion energy results in brighter but shorter plateaus due to faster ejecta. \\Ni\\ production affects late-time luminosity and plateau duration, with larger masses leading to slower declines.\n\n", "2402.19100": "2024-02-29, **Bayesian distances for quantifying tensions in cosmological inference and the surprise statistic**, Benedikt Schosser et.al., [2402.19100v1](http://arxiv.org/abs/2402.19100v1)\n\n Tensions between cosmological parameters derived through different channels can be a genuine signature of new physics that $\\Lambda$CDM as the standard model is not able to reproduce, in particular in the missing consistency between parameter estimates from measurements the early and late Universe. Or, they could be caused by yet to be understood systematics in the measurements as a more mundane explanation. Commonly, cosmological tensions are stated in terms of mismatches of the posterior parameter distributions, often assuming Gaussian statistics. More importantly, though, would be a quantification if two data sets are consistent to each other before combining them into a joint measurement, ideally isolating hints at individual data points that have a strong influence in generating the tension. For this purpose, we start with statistical divergences applied to posterior distributions following from different data sets and develop the theory of a Fisher metric between two data sets, in analogy to the Fisher metric for different parameter choices. As a topical example, we consider the tension in the Hubble-Lema\\^itre constant $H\\_0$ from supernova and measurements of the cosmic microwave background, derive a ranking of data points in order of their influence on the tension on $H\\_0$. For this particular example, we compute Bayesian distance measures and show that in the light of CMB data, supernovae are commonly too bright, whereas the low-$\\ell$ CMB spectrum is too high, in agreement with intuition about the parameter sensitivity.\n\n", "2402.19005": "2024-02-29, **Multidimensional Radiation Hydrodynamics Simulations of Supernova 1987A Shock Breakout**, Wun-Yi Chen et.al., [2402.19005v1](http://arxiv.org/abs/2402.19005v1)\n\n Shock breakout is the first electromagnetic signal from supernovae (SNe), which contains important information on the explosion energy and the size and chemical composition of the progenitor star. This paper presents the first two-dimensional (2D) multi-wavelength radiation hydrodynamics simulations of SN 1987A shock breakout by using the $\\texttt{CASTRO}$ code with the opacity table, $\\texttt{OPAL}$, considering eight photon groups from infrared to X-ray. To investigate the impact of the pre-supernova environment of SN 1987A, we consider possible three cases of circumstellar medium (CSM) environments: only a steady wind; an eruptive mass loss; and the existence of a companion star. In sum, the resulting breakout light curve has an hour duration and its peak luminosity of $\\sim 6\\times 10^{46} \\mathrm{erg}\\,\\mathrm{s}^{-1}$ following efficient post-breakout X-ray cooling of $\\sim 3.5$ mag hour$^{-1}$. The dominant band transits to UV after around 3 hours of shock breakout and its luminosity has a decay rate of $\\sim 1.5$ mag hour$^{-1}$ that agrees well with the observed shock breakout tail. The detailed features of breakout emission are sensitive to the pre-explosion environment. Our 2D simulations also demonstrate the importance of post-breakout mixing and its impacts on shock dynamics and radiation emission. The mixing driven by the shock breakout may lead to a global asymmetry of SN ejecta and affect its later supernova remnant formation.\n\n", "2402.18967": "2024-02-29, **Cosmological transition epoch from gamma-ray burst correlations**, Anna Chiara Alfano et.al., [2402.18967v1](http://arxiv.org/abs/2402.18967v1)\n\n The redshift $z\\_t$ and the jerk parameter $j\\_t$ of the transition epoch are constrained by using two model-independent approaches involving the direct expansion of the Hubble rate and the expansion of the deceleration parameter around $z=z\\_t$. To extend our analysis to high-redshifts, we employ the \\emph{Amati}, \\emph{Combo}, \\emph{Yonetoku} and \\emph{Dainotti} gamma-ray burst correlations. The \\textit{circularity problem} is prevented by calibrating these correlations through the B\\'ezier interpolation of the updated observational Hubble data. Each gamma-ray burst data set is jointly fit with type Ia supernovae and baryonic acoustic oscillations through a Monte Carlo analysis, based on the Metropolis-Hastings algorithm, to obtain $z\\_t$, $j\\_t$ and the correlation parameters. The overall results are compatible with the concordance model with some exceptions. We also focus on the behaviors of the dark energy, verifying its compatibility with a cosmological constant, and the matter density $\\Omega\\_m$ and compare them with the expectations of the concordance paradigm.\n\n"}}