{"neutrino": {"2510.24612": "2025-10-28, **Precise tracking spectroscopy of beta-gamma cascade in nuclear decay**, PandaX Collaboration et.al., [2510.24612v1](http://arxiv.org/abs/2510.24612v1)\n\n Nuclear $\\beta$ decay, a sensitive probe of nuclear structure and weak interactions, has become a precision test bed for physics beyond the Standard Model (BSM), driven by recent advances in spectroscopic techniques. Here we introduce tracking spectroscopy of $\\beta$-$\\gamma$ cascades, a method that reconstructs decay vertices while simultaneously detecting $\\beta$ particles and all associated de-excitation energies. Using the PandaX-4T detector operated as a tracking spectrometer, we obtain a precise and unbiased decay scheme of $^{214}$Pb, a key background isotope in searches for dark matter and Majorana neutrinos. For the first time, transitions of $^{214}$Pb to both the ground and excited states of $^{214}$Bi are measured concurrently, revealing discrepancies in branching ratios of up to 4.7$\\sigma$ relative to previous evaluations. Combined with state-of-the-art theoretical spectral shape calculations, these results establish a new benchmark for background modeling in rare-event searches and highlight the potential of tracking spectroscopy as a versatile tool for fundamental physics and nuclear applications.\n\n", "2510.24560": "2025-10-28, **XRISM constraints on unidentified X-ray emission lines, including the 3.5 keV line, in the stacked spectrum of ten galaxy clusters**, XRISM Collaboration et.al., [2510.24560v1](http://arxiv.org/abs/2510.24560v1)\n\n We stack 3.75 Megaseconds of early XRISM Resolve observations of ten galaxy clusters to search for unidentified spectral lines in the $E=$ 2.5-15 keV band (rest frame), including the $E=3.5$ keV line reported in earlier, low spectral resolution studies of cluster samples. Such an emission line may originate from the decay of the sterile neutrino, a warm dark matter (DM) candidate. No unidentified lines are detected in our stacked cluster spectrum, with the $3\\sigma$ upper limit on the $m\\_{\\rm s}\\sim$ 7.1 keV DM particle decay rate (which corresponds to a $E=3.55$ keV emission line) of $\\Gamma \\sim 1.0 \\times 10^{-27}$ s$^{-1}$. This upper limit is 3-4 times lower than the one derived by Hitomi Collaboration et al. (2017) from the Perseus observation, but still 5 times higher than the XMM-Newton detection reported by Bulbul et al. (2014) in the stacked cluster sample. XRISM Resolve, with its high spectral resolution but a small field of view, may reach the sensitivity needed to test the XMM-Newton cluster sample detection by combining several years worth of future cluster observations.\n\n", "2510.24516": "2025-10-28, **Multi-messenger constraints on transient accelerators of ultra-high energy cosmic rays**, Antonio Condorelli et.al., [2510.24516v1](http://arxiv.org/abs/2510.24516v1)\n\n The origin of ultra-high-energy cosmic rays (UHECRs) remains an open questions in astrophysics. We explore two primary scenarios for the distribution of UHECR sources, assuming that their production rate follows either the cosmic star-formation-rate or stellar-mass density. By jointly fitting the UHECR energy spectrum and mass composition measured by the Pierre Auger Observatory above the ankle (10^{18.7} eV), we derive constraints on the acceleration mechanisms, source energetics, and elemental abundances at escape. Using these constraints, we generate sky maps above 40 EeV based on a catalog of over 400,000 galaxies out to 350 Mpc, providing a near-infrared flux-limited sample that maps the two stellar-activity tracers across the full sky. A crucial factor in understanding UHECR propagation is the influence of large-scale cosmic structures, particularly galaxy clusters, the largest gravitationally bound systems in the Universe, which are filled with magnetized diffuse plasma. Intermittent sources hosted in galaxies within such structures, coupled with cosmic magnetic fields, shape the observed UHECR arrival directions and provide insights into the burst rate of the sources. We show that these environments can significantly impact UHECR transport, making them particularly opaque to heavy nuclei. Additionally, we compute the expected secondary neutrino and photon fluxes from UHECR interactions in these environments and compare them with current experimental limits, constraining the maximum energy that particles can achieve. Finally, we assess the compatibility of these constraints with astrophysical candidates, identifying long gamma-ray bursts as the most promising sources.\n\n", "2510.24395": "2025-10-28, **Optimising Underwater Neutrino Telescopes for All-Flavour Point Source Sensitivity**, Iwan Morton-Blake et.al., [2510.24395v1](http://arxiv.org/abs/2510.24395v1)\n\n High-energy neutrino astronomy has advanced rapidly in recent years, with IceCube, KM3NeT, and Baikal-GVD establishing a diffuse astrophysical flux and pointing to promising source candidates. These achievements mark the transition from first detections to detailed source studies, motivating next-generation detectors with larger volumes, improved angular resolution, and full neutrino-flavour sensitivity. We present a performance study of large underwater neutrino telescopes, taking the proposed TRIDENT array in the South China Sea as a case study, with a focus on comparing the performance of various detector configurations against the TRIDENT baseline design. Both track-like events primarily from muon neutrinos, which provide precise directional information, and cascade events from all flavours, which offer superior energy resolution, diffuse-source sensitivity, and all-sky flavour coverage, are included to achieve a balanced performance across source types. The time to discover potential astrophysical sources with both track- and cascade-like events is used as the figure of merit to compare a variety of detector design choices. Our results show that, for a fixed number of optical modules, simply enlarging the instrumented volume does not inherently lead to improved performance, while taller strings can provide modest gains across all detector channels, within engineering constraints. Distributing dense clusters of strings over a large volume is found to generally worsen discovery potential compared to the baseline layout. Finally, the optical properties of the sea-water emerge as the key factor dictating the optimisation of detector layout, highlighting the need for in-situ measurements and early deployment of optical modules to guide the final array configuration.\n\n", "2510.24196": "2025-10-28, **Design and characterization of a photo-sensor system for the RELICS experiment**, Jijun Yang et.al., [2510.24196v1](http://arxiv.org/abs/2510.24196v1)\n\n We present the design and characterization of a photo-sensor system for the RELICS experiment in this paper. A dynamic readout base for photomultiplier tubes (PMTs) is designed to address saturation from an intense cosmic muon background in the RELICS experiment. The system employs dual readout from the anode and the seventh dynode to extend the linear response range of PMTs. Particularly, our characterization and measurement on Hamamatsu R8520-406 PMTs confirm stable operation under positive high voltage, extending linear response range over an order of magnitude beyond anode saturation. A model of saturation recovery was developed to evaluate the influence of cosmic muon signals in the RELICS experiment. The results demonstrate that the dynamic readout enables high-sensitivity detection of coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) signal at the surface level, and detection of MeV-scale interactions.\n\n", "2510.24167": "2025-10-28, **Vortex Creep Heating in Neutron Star Cooling: New Insights into Thermal Evolution of Heavy Neutron Stars**, Yoonhak Nam et.al., [2510.24167v1](http://arxiv.org/abs/2510.24167v1)\n\n Neutron stars provide unique laboratories for probing physics of dense nuclear matter under extreme conditions. Their thermal and luminosity evolution reflects key internal properties such as the equation of state (EoS), nucleon superfluidity and superconductivity, envelope composition, and magnetic field, and so on. Recent observations [\\textit{e.g.}, V. Abramkin \\textit{et al.,} ApJ \\textbf{924}, 128 (2022)] have revealed unexpectedly warm old neutron stars, which cannot be explained by standard neutrino-photon cooling models. The failure of the standard cooling models implies the presence of additional internal heating mechanism. Building on the previous study [M. Fujiwara \\textit{et al}., JCAP \\textbf{03}, 051 (2024)], which proposed vortex creep heating (VCH) from the frictional motion of superfluid vortices as a viable mechanism, we extend the cooling framework to include both VCH and direct Urca (DUrca) processes. These are implemented in our code to explore their combined impact, particularly for massive neutron stars where DUrca operates. By varying rotational parameters ($P$, $\\dot{P}$, $P\\_0$), EoS models (APR, BSk24), pairing gaps, and envelope compositions, we examine how heating-cooling interplay shapes the temperature evolution. Our results show that VCH can substantially mitigate the rapid cooling driven by DUrca, offering new evolutionary pathways for massive neutron stars.\n\n", "2510.23917": "2025-10-27, **Testing common approximations of neutrino fast flavor conversion**, Erick Urquilla et.al., [2510.23917v1](http://arxiv.org/abs/2510.23917v1)\n\n A new chapter is opening in the theory of core-collapse supernovae and neutron star mergers as simulations of these events begin to incorporate fast flavor conversion (FFC) and other forms of neutrino flavor mixing. Using numerical experiments, we show that the approximations of FFC that have been implemented so far are limited by at least two of three factors: (1) approximating continuous evolution as a discrete sequence of instabilities, (2) using spatially homogeneous asymptotic states, and (3) assuming that FFC must be accompanied by instability. The factors we identify in this work will be important considerations as the research area progresses from initial exploratory studies to more quantitatively precise assessments.\n\n", "2510.23771": "2025-10-27, **WIMP Shadows: Phenomenology of Secluded Dark Matter in Three Minimal BSM Scenarios**, Mattia Di Mauro et.al., [2510.23771v1](http://arxiv.org/abs/2510.23771v1)\n\n We present a comprehensive study of secluded dark matter (DM) $\\chi$, where the relic abundance is set by annihilations into lighter dark mediators $\\phi$ that couple only feebly to the Standard Model (SM). In contrast to canonical WIMPs, which are now strongly constrained by direct and indirect searches, secluded models still achieve the observed relic abundance via thermal freeze-out into hidden-sector mediators, while predicting highly suppressed present-day signals. We analyze three minimal models: (i) a $U(1)\\_X$ gauge boson ($A'$) with kinetic mixing; (ii) a scalar DM candidate $S$ with a scalar mediator $K$ that has a trilinear vertex; and (iii) a Dirac fermion $\\chi$ whose mass arises from a Higgs-mixed singlet $H\\_p$. For each model we derive annihilation and scattering rates in both WIMP-like and secluded regimes, and solve the Boltzmann equations: a single-species equation for the WIMP case and a coupled $\\chi$-$\\phi$ system for the secluded case to account for possible early departure of the mediator from thermal equilibrium with the SM bath. In this regard, we provide explicit lower limits on the portal coupling $\\epsilon$ required to keep the mediator in thermal equilibrium with the SM bath and to ensure mediator decay before BBN. We show that for portal couplings $\\epsilon \\ll 10^{-3}$ the relic density is dominantly controlled by DM annihilation into mediator pairs, while spin-independent scattering lies well below current limits and remains viable even for future experiments approaching the irreducible neutrino background floor. Indirect constraints are typically weak due to $p$-wave suppression, off-resonance $s$-channels, and cascade spectra controlled by $\\epsilon^2$. Finally, we highlight the most promising collider tests, which remain sensitive despite tiny portal couplings.\n\n", "2510.23760": "2025-10-27, **Quantum field theory treatment of oscillations of Dirac neutrinos in external fields**, Maxim Dvornikov et.al., [2510.23760v1](http://arxiv.org/abs/2510.23760v1)\n\n We study neutrino oscillations in external fields using the approach based on the quantum field theory (QFT). Neutrinos are virtual particles in this formalism. Neutrino mass eigenstates are supposed to be Dirac fermions. We consider two cases of external fields: the neutrino electroweak interaction with background matter and the interaction with an external magnetic field owing to the presence of the transition magnetic moment. The formalism used involves the dressed propagators of mass eigenstates in external fields. In the matter case, finding of these propagators for Dirac neutrinos has certain difficulties compared to the Majorana particles considered previously. These difficulties are overcome by regularizing the effective potential of the neutrino interaction with matter. The QFT formalism application to the spin-flavor precession also encounters certain peculiarities in the Dirac case compared to the Majorana one. They are related to the observability of right polarized Dirac neutrinos. We derive the matrix elements and the probabilities for Dirac neutrinos interacting with both types of external fields. In case of the spin-flavor precession, we obtain the small QFT contribution to the probabilities in addition to the prediction of the quantum mechanical approach.\n\n", "2510.23713": "2025-10-27, **Glimpsing Physics of Nano-Hz Gravitational Waves in Neutrinos from Core-Collapse Supernovae**, Hooman Davoudiasl et.al., [2510.23713v1](http://arxiv.org/abs/2510.23713v1)\n\n The growing evidence for nano-hertz gravitational waves, from NANOGrav and other observations, may be pointing to a cosmological first-order phase transition at temperatures of $\\mathcal{O}(10-100)\\;\\mathrm{MeV}$. Such an interpretation requires dynamics beyond the Standard Model in this energy range. If so, it may well be the case that core-collapse supernova explosions would recreate the first-order phase transition leaving a unique imprint on the spectrum of neutrinos emitted in the initial few seconds. This scenario is also suggestive of a low-mass seesaw mechanism to explain neutrino masses. We outline the prospects for future observations of Galactic supernovae to uncover the signals of this scenario, which could get further confirmation with additional pulsar timing array data establishing the primordial origin of the observed nano-hertz gravitational waves.\n\n", "2510.23712": "2025-10-27, **Delayed Charged Lepton Yukawa Equilibration and Thermal Leptogenesis**, Rishav Roshan et.al., [2510.23712v1](http://arxiv.org/abs/2510.23712v1)\n\n While most studies of the minimal type-I seesaw neglect the heaviest decoupled right-handed neutrino, assuming negligible contributions to neutrino masses and leptogenesis, we demonstrate that its cosmological role can be significant. When long-lived, this particle substantially modifies the charged lepton Yukawa equilibration temperature in the early universe, necessitating reassessment of lepton flavor effects in thermal leptogenesis and potentially shifting flavor regime boundaries. We identify experimental probes through neutrino oscillation measurements and gravitational wave observations.\n\n", "2510.23703": "2025-10-27, **Anarchic neutrinos from flavor deconstruction: phenomenology of the lepton sector**, Gino Isidori et.al., [2510.23703v1](http://arxiv.org/abs/2510.23703v1)\n\n We investigate the neutrino sector in the framework of flavor deconstruction with an inverse-seesaw realization. This setup naturally links the hierarchical charged-fermion masses to the anarchic pattern of light-neutrino mixing. We determine the viable parameter space consistent with oscillation data and study the phenomenology of heavy neutral leptons (HNL) and lepton-flavor-violating (LFV) processes. Current bounds from direct HNL searches and LFV decays constrain the right-handed neutrino scale to a few TeV, while future $\\mu \\to e$ experiments will probe most of the region with $\\Lambda \\lesssim 10~\\text{TeV}$. Among possible realizations, models deconstructing $\\mathrm{SU}(2)\\_\\mathrm{L} \\times \\mathrm{U}(1)\\_\\mathrm{B-L}$ or $\\mathrm{SU}(2)\\_\\mathrm{L} \\times \\mathrm{U}(1)\\_\\mathrm{R} \\times \\mathrm{U}(1)\\_\\mathrm{B-L}$ are those allowing the lowest deconstruction scale.\n\n", "2510.23370": "2025-10-27, **Production of Hyperons, Charmed Baryons, and Hadronic Molecule Candidates in Neutrino-Proton Reaction**, Kai-sa Qiao et.al., [2510.23370v1](http://arxiv.org/abs/2510.23370v1)\n\n We investigate the production of hyperons, charmed baryons, and potential hadronic molecular states in neutrino-proton ($\\bar{\\nu}\\_\\mu p$) reaction, a process characterized by a particularly clean final state. Employing effective Lagrangians, chiral perturbation theory, and a hadronic molecular model, we perform theoretical calculations for several relevant channels, including those leading to the formation of the hadronic molecular candidate $(\\bar{D}N)$. Our results indicate that future neutrino facilities could serve as a complementary platform for exploring exotic baryonic states and provide valuable insights into the dynamics of strong interactions in the strange and charm sectors.\n\n", "2510.23287": "2025-10-27, **Can KM3-230213A be compatible with a cosmogenic origin?**, The KM3NeT collaboration et.al., [2510.23287v1](http://arxiv.org/abs/2510.23287v1)\n\n On the 13th February 2023 the KM3NeT/ARCA telescope observed a track-like event compatible with a ultra-high-energy muon with an estimated energy of 120 PeV, produced by a neutrino with an even higher energy, making it the most energetic neutrino event ever detected. The reported equivalent flux suggest the possible existence of a new diffuse component. A diffuse cosmogenic flux is expected to originate from the interactions of ultra-high-energy cosmic rays with ambient photon and matter fields. Here we show that this component can be compatible with the reported flux level only integrating the cosmogenic emission, at least up to redshift ~$z = 6 $ and assuming a subdominant fraction of protons in the ultra-high-energy cosmic-ray flux, thus placing constraints on known cosmic accelerators. These conditions impose constraints on known cosmic accelerators and open a window into an unexplored region of the Universe at this energy scale.\n\n", "2510.22966": "2025-10-27, **Effective Theory for Light Portal Dark Matter Detection**, Qing Chen et.al., [2510.22966v1](http://arxiv.org/abs/2510.22966v1)\n\n We develop a general framework for the computation of light portal dark matter direct detection, incorporating a consistent treatment of finite momentum transfer. In this framework, dark matter interacts with Standard Model matter through a light mediator, which simultaneously serves as the force carrier for dark matter self-interaction, potentially with a distinct coupling strength. The corresponding effective theory relevant for detecting this class of dark matter is systematically constructed. Our analysis focuses on light (semi)relativistic dark matter, which may originate from cosmic-ray boosting and can be probed in high threshold experiments such as large-volume neutrino detectors. In this context, the nucleon matrix elements of the effective operators at finite momentum transfer are required, made available through recent advances in lattice QCD and related nonperturbative methods. The relativistic Fermi gas model is used to convert the nucleon-level momentum transfer to the nuclear level, thereby incorporating nuclear effects pertinent to heavy target experiments. To demonstrate the utility of the framework, we present ultraviolet-complete examples featuring spin-1 and spin-2 portal dark matter. For these models, we compute the differential cross sections with respect to momentum transfer, adopting parameter choices that address the so-called core-cusp problem in astrophysical observations via dark matter self-interactions.\n\n", "2510.22962": "2025-10-27, **Axion in the minimal SO(10) GUT**, Takeshi Fukuyama et.al., [2510.22962v1](http://arxiv.org/abs/2510.22962v1)\n\n The QCD axion is investigated within the minimal supersymmetric SO(10) grand unified theory, where the Yukawa sector involves Higgs multiplets ${\\bf 10}$ and $\\overline{{\\bf 126}}$. The relative phase between the VEVs of $({\\bf 10,1,3})\\subset\\overline{{\\bf 126}}$ and $({\\bf \\overline{10},1,3})\\subset{\\bf 126}$ under ${\\rm SU}(4)\\_C\\times{\\rm SU}(2)\\_L\\times{\\rm SU}(2)\\_R$ is identified with the axion. The Peccei-Quinn and $B-L$ symmetry breaking scales coincide through $\\|\\langle\\Delta\\_R\\rangle\\|=\\|\\langle\\overline{\\Delta}\\_R\\rangle\\|$. The scalar partner of the lightest right-handed neutrino plays the role of the inflaton, realizing hybrid inflation consistent with the observed CMB density fluctuations. After inflation, both fields acquire VEVs, and the domain-wall problem is resolved through the Lazarides-Shafi mechanism, which naturally restricts the model to three generations.\n\n", "2510.22914": "2025-10-27, **Constraint on the physical origin of GRB prompt emission via its non-detected diffuse neutrino emission**, Yang-Dong-Jun Ou et.al., [2510.22914v1](http://arxiv.org/abs/2510.22914v1)\n\n The physical origin of prompt emission in gamma-ray bursts (GRBs) remains an open question since it has been studied more than half a century. Three alternative models (i.e. dissipative photosphere, internal shock, and ICMART) have been proposed to interpret the observations of GRB prompt emission, but none of them can fully interpret all of the observational data collected so far. The question is that what is the fraction of these three theoretical models in the prompt emission of GRB, respectively. In this paper, we propose to utilize an innovative method, and constrain the fraction of GRB prompt emission models via its non-detected diffuse neutrinos. By adopting two methods (e.g., summing up the individual GRB contributions and assumed luminosity functions of GRB) to calculate diffuse neutrino flux of GRBs for given the benchmark parameters of $\\Gamma=300$ and $\\varepsilon\\_{p} \\text{/} \\varepsilon\\_{e}=10$, both approaches indicate that most GRBs should be originated from the ICMART model. Moreover, we find that the fractions of the dissipative photosphere model, the internal shock model, and the ICMART model are constrained to be [0, $0.5\\%$], [0, $1.1\\%$], and [$98.9\\%$, 1], respectively for the method of summing up the individual GRB contributions. For the method of luminosity functions, the fractions of above three models are constrained to be [0, $6.1\\%$], [0, $8.2\\%$], and [$91.8\\%$, 1], respectively. However, such fractions of different models are also dependent on the parameters of $\\Gamma$ and $\\varepsilon\\_{p} \\text{/} \\varepsilon\\_{e}$.\n\n"}, "dark matter": {"2510.24651": "2025-10-28, **Higgs Inflation: Particle Factory**, Tammi Chowdhury et.al., [2510.24651v1](http://arxiv.org/abs/2510.24651v1)\n\n We study cosmological gravitational particle production (CGPP) in Higgs inflation, wherein the inflaton is a scalar field with quartic self-coupling $\\lambda$ and a nonminimal coupling to gravity $\\xi$, and which may, but need not be, the Higgs boson of the Standard Model (SM). We find an explosive particle production peaked on a characteristic comoving wavenumber $k\\sim \\xi^{2/3} a H$ with a peak occupation number that scales with $\\xi$. This new peak in production can easily dominate over the conventional (minimally coupled inflation) CGPP even for modest values of $\\xi$. The results apply for a wide range of $\\xi$, e.g., as low as $\\xi=10$, which can be realized for the Standard Model Higgs given suitable RG flow of the quartic coupling. We discuss implications for late time relics such as dark matter.\n\n", "2510.24565": "2025-10-28, **Black Hole Cold Brew: Fermi Degeneracy Pressure**, Wei-Xiang Feng et.al., [2510.24565v1](http://arxiv.org/abs/2510.24565v1)\n\n We investigate the dynamical instability of a self-gravitating thermal system in the quantum regime, where Fermi degeneracy pressure becomes significant. Using a truncated Fermi-Dirac distribution and solving the Tolman-Oppenheimer-Volkoff equation, we identify marginally stable configurations following Chandrasekhar's criterion. While Fermi pressure stabilizes a system against gravitational collapse in Newtonian gravity, in general relativity it can instead drive the instability, enabling collapse even at low temperatures. We discuss implications for the formation of massive black holes in the early Universe through the gravothermal collapse of dark matter.\n\n", "2510.24418": "2025-10-28, **ASTAROTH: A Novel Detector for Dark Matter Direct Detection Using Cryogenic SiPMs**, Edoardo Martinenghi et.al., [2510.24418v1](http://arxiv.org/abs/2510.24418v1)\n\n The DAMA experiment's long-standing claim of dark matter detection remains a key open issue in astroparticle physics. Independent verification requires NaI(Tl)-based detectors with enhanced low-energy sensitivity. Current detectors rely on photomultiplier tubes (PMTs) which features limited detection efficiency, intrinsic radioactivity, and high noise at keV energies. ASTAROTH is an R&D project that developed a proof of concept NaI(Tl) detector where siliconphotomultipliers (SiPMs) have been used instead of PMTs, offering higher photon detection efficiency, negligible radioactivity, and, most of all, a reduction of two orders of magnitude in the dark noise. The setup includes a custom cryostat operating at approximately 80 K. We report the first characterization of an approximately 360 g NaI(Tl) crystal coupled to a 5 x 5 cm SiPM matrix, yielding 4.5 photoelectrons\\keV after crosstalk correction. This promising result demonstrates the feasibility of SiPM-based readout for NaI(Tl) and paves the way for future large-scale dark matter experiments.\n\n", "2510.24371": "2025-10-28, **Modified Gravity with Nonminimal Curvature-Matter Couplings: A Framework for Gravitationally Induced Particle Creation**, Francisco S. N. Lobo et.al., [2510.24371v1](http://arxiv.org/abs/2510.24371v1)\n\n Modified gravity theories with a nonminimal coupling between curvature and matter offer a compelling alternative to dark energy and dark matter by introducing an explicit interaction between matter and curvature invariants. Two of the main consequences of such an interaction are the emergence of an additional force and the non-conservation of the energy--momentum tensor, which can be interpreted as an energy exchange between matter and geometry. By adopting this interpretation, one can then take advantage of many different approaches in order to investigate the phenomenon of gravitationally induced particle creation. One of these approaches relies on the so-called irreversible thermodynamics of open systems formalism. By considering the scalar--tensor formulation of one of these theories, we derive the corresponding particle creation rate, creation pressure, and entropy production, demonstrating that irreversible particle creation can drive a late-time de Sitter acceleration through a negative creation pressure, providing a natural alternative to the cosmological constant. Furthermore, we demonstrate that the generalized second law of thermodynamics holds: the total entropy, from both the apparent horizon and enclosed matter, increases monotonically and saturates in the de Sitter phase, imposing constraints on the allowed particle production dynamics. Furthermore, we present brief reviews of other theoretical descriptions of matter creation processes. Specifically, we consider approaches based on the Boltzmann equation and quantum-based aspects and discuss the generalization of the Klein--Gordon equation, as well as the problem of its quantization in time-varying gravitational fields.\n\n", "2510.24114": "2025-10-28, **A Viable New Model for Dark Matter**, X. G. Wang et.al., [2510.24114v1](http://arxiv.org/abs/2510.24114v1)\n\n We present a new model of the dark sector involving Dirac fermion dark matter, with axial coupling to a dark photon which provides a portal to Standard Model particles. In the non-relativistic limit, this implies that the dominant effective operator relevant to direct detection is ${\\cal O}\\_8$. The resulting event rate for direct detection is suppressed by either the dark matter velocity or the momentum transfer. In this scenario there are much wider regions of the dark parameter space that are consistent with all of the existing constraints associated with thermal relic density, direct detection and collider searches.\n\n", "2510.24090": "2025-10-28, **Tritiated methane reduction in the PandaX-4T experiment via purge and cryogenic distillation processes**, Shuaijie Li et.al., [2510.24090v1](http://arxiv.org/abs/2510.24090v1)\n\n Tritium from tritiated methane (CH$\\_3$T) calibration is a significant impurity that restricts the sensitivity of the PandaX-4T dark matter detection experiment in the low-energy region. The CH$\\_3$T removal is essential for PandaX-4T and other liquid xenon dark matter direct detection experiments, as CH$\\_3$T serves as a critical component for low-energy calibration. To eliminate CH$\\_3$T, the xenon in the detector is suitably recuperated, leaving 1.8 bar of xenon gas inside, and the detector is flushed with heated xenon gas. Concurrently, leveraging the lower boiling point of methane relative to xenon, the PandaX-4T cryogenic distillation system is effectively utilized to extract CH$\\_3$T from xenon after optimizing the operational parameters. Following the commissioning run, 5.7 tons of xenon are purified via the distillation method. Recent data indicate that the CH$\\_3$T concentration reduces from $3.6\\times10^{-24}$ mol/mol to $5.9\\times10^{-25}$ mol/mol, demonstrating that gas purging and distillation are effective in removing CH$\\_3$T, even at concentrations on the order of $10^{-24}$ mol/mol.\n\n", "2510.23838": "2025-10-27, **Imperfect dark matter with higher derivatives**, Mohammad Ali Gorji et.al., [2510.23838v1](http://arxiv.org/abs/2510.23838v1)\n\n We introduce a higher-derivative action for dark matter whose energy-momentum tensor describes an imperfect fluid with nonzero pressure, energy flux, and anisotropic stress. In the limit where the higher-derivative couplings are switched off, the energy-momentum tensor reduces to pressureless dust. A systematic derivation follows from extending the singular conformal transformation used in the mimetic dark matter scenario to include higher-derivative terms while the resulting action is general and does not rely on the mimetic framework. On a homogeneous cosmological background, the dynamics coincides with that of pressureless dust, while in the presence of inhomogeneities the higher-derivative terms generate nonzero acceleration and vorticity, making it possible to avoid the formation of caustic singularities even if the strong energy condition satisfies. In particular, within the mimetic realization these terms resolve the usual caustic pathology of mimetic dark matter.\n\n", "2510.23808": "2025-10-27, **Towards theory constraints on ultralight dark matter from quantum gravity**, Gabriel Assant et.al., [2510.23808v1](http://arxiv.org/abs/2510.23808v1)\n\n Ultralight scalar dark matter may couple to the Standard Model through dimension-five operators that contain the field-strength tensors of the gauge interactions. Recent progress in nuclear clocks is projected to increase the sensitivity to such couplings by several orders of magnitude. Future experimental constraints may even have Planck-scale sensitivity, calling for a study of such couplings in a framework that includes quantum gravity. We take a first step towards providing the theoretical constraints on such couplings that arise in asymptotically safe gravity. We find evidence that such couplings vanish in asymptotically safe gravity and are also not generated in a perturbative quantum-gravity regime that describes quantum gravity as an effective field theory.\n\n", "2510.23768": "2025-10-27, **Galactic Alchemy: Deep Learning Map-to-Map Translation in Hydrodynamical Simulations**, Philipp Denzel et.al., [2510.23768v1](http://arxiv.org/abs/2510.23768v1)\n\n We present the first systematic study of multi-domain map-to-map translation in galaxy formation simulations, leveraging deep generative models to predict diverse galactic properties. Using high-resolution magneto-hydrodynamical simulation data, we compare conditional generative adversarial networks and diffusion models under unified preprocessing and evaluation, optimizing architectures and attention mechanisms for physical fidelity on galactic scales. Our approach jointly addresses seven astrophysical domains - including dark matter, gas, neutral hydrogen, stellar mass, temperature, and magnetic field strength - while introducing physics-aware evaluation metrics that quantify structural realism beyond standard computer vision measures. We demonstrate that translation difficulty correlates with physical coupling, achieving near-perfect fidelity for mappings from gas to dark matter and mappings involving astro-chemical components such as total gas to HI content, while identifying fundamental challenges in weakly constrained tasks such as gas to stellar mass mappings. Our results establish GAN-based models as competitive counterparts to state-of-the-art diffusion approaches at a fraction of the computational cost (in training and inference), paving the way for scalable, physics-aware generative frameworks for forward modelling and observational reconstruction in the SKA era.\n\n", "2510.23705": "2025-10-27, **Gravothermal collapse of self-interacting dark-matter halos with anisotropic velocity distributions**, Marc Kamionkowski et.al., [2510.23705v1](http://arxiv.org/abs/2510.23705v1)\n\n Self-gravitating galactic halos composed of self-interacting dark matter exhibit the formation of a highly dense core at the galactic center--a gravothermal collapse. Analytic models to describe this evolution have been developed and calibrated to numerical simulations initialized with isotropic particle velocity distributions, an assumption not necessarily warranted by the theory of halo formation. Here we study the dependence of the timescale for gravothermal collapse on the velocity distribution. To do so, we consider self-consistent initial conditions for halos with the same density distribution but with different velocity distributions. We consider models with constant anisotropy and with an anisotropy that increases with radius. The velocity distributions that we explore have collapse times that differ from that assuming isotropic distributions by more than a factor of two. We argue that these variations may depend on the global changes in velocity-dispersion profiles in these anisotropic models and not just on the degree of anisotropy.\n\n", "2510.23696": "2025-10-27, **Sub-GeV dark matter and multi-decay signatures from dark showers at beam-dump experiments**, Elias Bernreuther et.al., [2510.23696v1](http://arxiv.org/abs/2510.23696v1)\n\n In models of strongly-interacting dark sectors, the production of dark quarks at accelerators can give rise to dark showers with multiple dark mesons in the final state. If some of these dark mesons are sufficiently light and long-lived, they can be detected with searches for displaced vertices at beam-dump experiments and electron-positron colliders. In this work we focus on the case that dark quark production proceeds via effective operators, while the dark sector analogue of the $\\rho^0$ meson can decay via kinetic mixing. We evaluate current constraints from NA62 and BaBar as well as sensitivity projections for SHiP and Belle II. We find that there exists a sizable parameter region where SHiP may detect several displaced vertices in a single event and thus obtain valuable information about the structure of the dark sector.\n\n", "2510.23549": "2025-10-27, **Cosmic Vine: High abundance of massive galaxies and dark matter halos in a forming cluster at z=3.44**, Nikolaj B. Sillassen et.al., [2510.23549v1](http://arxiv.org/abs/2510.23549v1)\n\n The Cosmic Vine is a massive protocluster at z=3.44 in the JWST CEERS field, offering an ideal laboratory for studying the early phases of cluster formation. Using the data from the DAWN JWST Archive, we conduct a comprehensive study on the large-scale structure, stellar mass function (SMF), quiescent members, and dark matter halos in the Cosmic Vine. First, we spectroscopically confirm 136 galaxies in the Vine at z=3.44, and an additional 47 galaxies belonging to a diffuse foreground structure at z=3.34 which we dub the Leaf. We identify four subgroups comprising the Cosmic Vine and two subgroups within the Leaf. Second, we identified 11 quiescent members with log(M*/Msun)=9.5-11.0, the largest sample of quiescent galaxies in overdense environments at z>3, which gives an enhanced quiescent galaxy number density 2x10^(-4)cMpc^(-3) that is three times above the field level at log(M*/Msun) > 10. Notably, these quiescent members form a tight red sequence on the color-magnitude diagram, making it one of the earliest red sequences known to date. Third, by constructing the SMFs for both star-forming and quiescent members, we find that both SMFs are top-heavy, with a significantly enhanced quiescent fraction at log(M*/Msun)>10.5 compared to field counterparts. The stellar mass-size analysis reveals that star-forming members are more compact at higher masses than their field counterparts. Finally, we estimate a halo mass of log(Mh/Msun)=13.2+-0.3 for the protocluster core, and log(Mh/Msun)=11.9-12.4 for satellite subgroups. The phase-space analysis indicates that three subgroups are likely infalling to the core. This work reveals a high abundance of massive galaxies and dark matter halos in a forming cluster, demonstrating the accelerated assembly of massive galaxies in massive halos when the Universe was less than 2 billion years old.\n\n", "2510.23481": "2025-10-27, **Dynamical friction shear and rotation in Chaplygin cosmology**, A. Del Popolo et.al., [2510.23481v1](http://arxiv.org/abs/2510.23481v1)\n\n In this study, we build upon the findings of Del Popolo et al. (2013) by further analyzing the influence of dynamical friction on the evolution of cosmological perturbations within the framework of the spherical collapse model (SCM) in a Universe dominated by generalized Chaplygin gas (GCG). Specifically, we investigate how dynamical friction alters the growth rate of density perturbations, the effective sound speed, the equation-of-state parameter www, and the evolution of the cosmic expansion rate. Our results demonstrate that dynamical friction significantly delays the collapse process compared to the standard SCM. Accurate computation of these parameters is crucial for obtaining consistent results and reliable physical interpretations when employing the GCG model. Furthermore, our analysis confirms that the suppression of perturbation growth due to dynamical friction is considerably more pronounced than that caused by shear and rotation, as previously indicated by Del Popolo et al. (2013). This enhanced suppression effectively addresses the instability issues, such as oscillations or exponential divergences in the dark-matter power spectrum, highlighted in linear perturbation studies, such as those by Sandvik et al. (2004).\n\n", "2510.23388": "2025-10-27, **Pseudo-Nambu-Goldstone Dark Matter in Flux Compactification**, Kento Akamatsu et.al., [2510.23388v1](http://arxiv.org/abs/2510.23388v1)\n\n We study a six-dimensional U(1)$\\_\\chi$ gauge theory compactified on a magnetized torus, where the zero mode of the extra-dimensional gauge field (a Wilson-line (WL) scalar field) plays the role of a pseudo-Nambu-Goldstone (pNG) dark matter (DM) candidate. The pNG DM is naturally included by construction without introducing an additional scalar field. We show that the leading spin-independent DM-nucleus amplitude is suppressed by momentum transfer in our model as expected from the pNG DM model. This suppression allows the model to evade the current severe direct-detection bounds while achieving the observed thermal relic abundance in well-defined regions of parameter space.\n\n", "2510.23311": "2025-10-27, **The role of supercluster filaments in shaping galaxy clusters**, Raúl Baier-Soto et.al., [2510.23311v1](http://arxiv.org/abs/2510.23311v1)\n\n In a hierarchical $\\Lambda$CDM Universe, cosmic filaments serve as the primary channels for matter accretion into galaxy clusters, influencing the shape of their dark matter halos. We investigate whether the elongation of galaxy clusters correlates with the orientation of surrounding filaments, providing the first observational test of this relationship in large supercluster regions. We identified and characterized cosmic filaments in two dimensions within the two superclusters that are part of the low-redshift sub-survey of the Chilean Cluster Galaxy Evolution Survey (CHANCES): the Shapley supercluster and the Horologium-Reticulum supercluster. We analyzed the alignment between filament directions -- traced by galaxy distributions -- and the triaxiality of cluster gravitational potentials -- traced by X-ray emission- using publicly available optical and X-ray data. We have found that most (82%) of the X-ray clusters are associated with and interconnected by the optically detected filaments. The clusters-filaments alignment analysis shows that the elongation of most clusters is well aligned with nearby filaments, providing observational confirmation of theoretical predictions, with the alignment progressively reducing at larger cluster-centric distances ($> 1.6 r\\_{200}$). Overall, our results support the notion that filaments are the main source of galaxy accretion at redshift below 0.1 and additionally provide evidence that matter accretion through filaments shapes the gravitational potential of galaxy clusters. We propose this measurement as a simple observational proxy to determine the direction of accretion in clusters, which is key to understanding both galaxy evolution and the merger history of galaxy clusters.\n\n", "2510.23229": "2025-10-27, **Validation of field cage and cathode for low radioactivity operation with the CYGNO experiment**, F. D. Amaro et.al., [2510.23229v1](http://arxiv.org/abs/2510.23229v1)\n\n Dark matter, which is considered to account for approximately the 27% of the Universe's energy-mass content, remains an open issue in modern particle physics along with its composition. The CYGNO Experiment aims to exploit an innovative approach applied to the direct detection search of low energy nuclear recoils possibly induced by cold particle-like dark matter candidates. CYGNO employs a directional detector based on a Time Projection Chamber (TPC) filled with a He:CF$\\_{4}$ gas mixture and equipped with an optical readout. Currently, the CYGNO Collaboration is constructing the detector demonstrator, CYGNO-04, in Hall F at Laboratori Nazionali del Gran Sasso (LNGS). This 0.4 m$^3$ detector has the goal of proving the scalability of the technology and assessing the physics and radiopurity capabilities. Given the low radioactivity requirements, especially in internal components such as field cage and cathode, the reduction of material while keeping the correct electrical behavior is paramount. In this paper, we present the validation of several internal components, mainly focusing on the field cage material and support structure. The tests included geometrical asymmetries in the electric field response, collection efficiency as well as measurement of known physical quantities. A preferred configuration is found with a structure based on Nylon material which supports a PET or Kapton sheet with copper strips deposited on.\n\n", "2510.23168": "2025-10-27, **Recasting and Forecasting Dark Matter Limits Without Raw Data: A Generalized Algorithm for Gamma-Ray Telescopes**, Giacomo D'Amico et.al., [2510.23168v1](http://arxiv.org/abs/2510.23168v1)\n\n We present a novel method for both forecasting and recasting upper limits (ULs) on dark matter (DM) annihilation cross sections, $\\left< \\sigma v \\right>^{UL}$, or decay lifetime $\\tau^{LL}$ . The forecasting method relies solely on the instrument response functions (IRFs) to predict ULs for a given observational setup, without the need for full analysis pipelines. The recasting procedure uses published ULs to reinterpret constraints for alternative DM models or channels. We demonstrate its utility across a range of canonical annihilation channels, including $b\\bar{b}$, $W^+W^-$, $\\tau^+\\tau^-$, and $\\mu^+\\mu^-$, and apply it to several major gamma-ray experiments, including MAGIC, \\textit{Fermi}-LAT, and CTAO. Notably, we develop a recasting approach that remains effective even when the IRF is unavailable by extracting generalized IRF-dependent coefficients from benchmark channels. We apply this method to reinterpret ULs derived from standard spectra (e.g., PPPC4DMID) in terms of more recent DM scenarios, including a Higgsino-like model with mixed final states and spectra generated with the CosmiXs model. Extensive Monte Carlo simulations and direct comparison with published results confirm the robustness and accuracy of our method, with discrepancies remaining within statistical uncertainties. The algorithm is generally applicable to any scenario where the expected signal model is parametric, offering a powerful tool for reinterpreting existing gamma-ray limits and efficiently exploring the DM parameter space in current and future indirect detection experiments.\n\n", "2510.23001": "2025-10-27, **Search for Invisible Decay Modes in Nuclear Gamma Cascades of a ${}^{46}$Sc Source Using a CsI (Tl) Detector**, Sharada Sahoo et.al., [2510.23001v1](http://arxiv.org/abs/2510.23001v1)\n\n Dark matter remains one of the most compelling open questions in modern physics, motivating extensive searches for new light, weakly coupled particles beyond the Standard Model. Numerous experiments have probed a variety of dark matter candidates using diverse detector technologies, yet large regions of parameter space remain unexplored. In this work, we present a novel high-statistics search for invisible decay modes in nuclear $\\gamma$ cascades, employing approximately 100~kg of CsI(Tl) scintillators at Texas A\\&M University. The key feature of this experiment is the use of a high-activity ${}^{46}$Sc radioactive source combined with a \"missing gamma\" technique, in which the absence of a photon in a well-identified cascade serves as a signature of new physics. Unlike appearance--disappearance experiments, this approach requires only a single photon conversion into a dark-sector particle, thereby enabling sensitivity to weaker couplings. With approximately 1000~hours of data collected using the current setup, no statistically significant excess was observed, consistent with existing constraints on dark-sector candidates such as axions and axion-like particles (ALPs), dark scalars, and dark photons in the sub-MeV mass range. This result highlights the sensitivity of the missing-gamma technique and motivates the development of a larger-scale detector with improved systematic control to extend dark-sector searches into previously unexplored regions of parameter space.\n\n"}, "supernova": {"2510.24620": "2025-10-28, **AT2025ulz and S250818k: Investigating early time observations of a subsolar mass gravitational-wave binary neutron star merger candidate**, Xander J. Hall et.al., [2510.24620v1](http://arxiv.org/abs/2510.24620v1)\n\n Over the past LIGO--Virgo--KAGRA (LVK) observing runs, it has become increasingly clear that identifying the next electromagnetic counterparts to gravitational-wave (GW) neutron star mergers will likely be more challenging compared to the case of GW170817. The rarity of these GW events, and their electromagnetic counterparts, motivates rapid searches of any candidate binary neutron star (BNS) merger detected by the LVK. We present our extensive photometric and spectroscopic campaign of the candidate counterpart AT2025ulz to the low-significance GW event S250818k, which had a ${\\sim} 29\\%$ probability of being a BNS merger. We demonstrate that during the first five days, the luminosity and color evolution of AT2025ulz are consistent with both kilonova and shock cooling models, although a Bayesian model comparison shows preference for the shock cooling model, underscoring the ambiguity inherent to early data obtained over only a few days. Continued monitoring beyond this window reveals a rise and color evolution incompatible with kilonova models and instead consistent with a supernova. This event emphasizes the difficulty in identifying the electromagnetic counterparts to BNS mergers and the significant allotment of observing time necessary to robustly differentiate kilonovae from impostors.\n\n", "2510.24346": "2025-10-28, **Detailed Abundance Determination of Metal-Poor Stars with X-Shooter I. Unusual Chemistry in Halo Stars**, B. D. C. Lowe et.al., [2510.24346v1](http://arxiv.org/abs/2510.24346v1)\n\n We present a detailed chemical analysis study of 16 candidate metal-poor stars, previously identified with 2dF+AAOmega, using X-Shooter spectra and the Korg 1D LTE spectral synthesis code. We generally confirm the earlier metallicity estimates and reveal four EMP ([Fe/H] $< -3$) stars in the current sample. Two of these stars, including the most metal-poor at [Fe/H] = $-3.83 \\pm 0.07$, are kinematically associated with the GSE accretion event, increasing the number of known GSE stars with [Fe/H] $< -3.5$ to eight. From the X-Shooter spectra we also determine abundances for 16 elements, with the element-to-iron abundance ratios generally consistent with high-resolution studies of Galactic halo stars. Within the sample, we identify three peculiar stars: the first is a GSE nitrogen enhanced metal poor (NEMP; [N/Fe] $= 1.62 \\pm 0.10$ and [C/Fe] $= 0.27 \\pm 0.08$) star with unusually high Na ([Na/Fe] $= 2.28 \\pm 0.07$) and Li (A(Li)$\\_{\\rm 3DNLTE} = 1.90 \\pm 0.08$) abundances, but which lacks any enhancement in [Al/Fe] or [Mg/Fe]. The second is a halo r-II star significantly enhanced in Sr ([Sr/Ba] $= 0.37 \\pm 0.08$), suggesting mixture of r-process and s-process enrichment, uncommon for r-II stars. Whilst the third is a halo star very depleted in N ([N/Fe] $< -1.13$), with low C ([C/Fe] $= -0.36 \\pm 0.08$) and otherwise 'normal' [X/Fe] abundances, suggesting enrichment with Type II supernova that proceeds enrichment from massive AGB stars. This study reveals the substantial degree of chemical diversity in the stellar populations which assembled the early Milky Way.\n\n", "2510.24123": "2025-10-28, **Decadal brightening in the northeastern non-thermal filament of Cassiopeia A**, Nao Kominato et.al., [2510.24123v1](http://arxiv.org/abs/2510.24123v1)\n\n We present the decadal brightening of non-thermal emission flux in the northeastern filament of the young supernova remnant Cassiopeia A (Cas A), which highlights dynamic processes in the forward shock. This filament, characterized by the highest particle acceleration rate among Cas A's outer shells, offers an exceptional opportunity to investigate underlying astrophysical mechanisms. Since 2000, the non-thermal flux has increased by several tens of percent before plateauing, while the spectral shape has remained largely unchanged. Over the past two decades, the filament's morphology has evolved significantly, splitting into two distinct sections. Detailed analysis reveals contrasting behaviors: one section shows a flux increase followed by saturation, while the other maintains a steady flux. These differences likely arise from nonlinear effects, including magnetohydrodynamic interactions influenced by magnetic field orientation, interactions with surrounding material, and complex fluid dynamics associated with young supernova remnants. The localized evolution of this filament, captured with high spatial resolution, provides critical insights into the temporal dynamics of non-thermal particles and the generation of cosmic rays from asymmetric supernova explosions.\n\n", "2510.24089": "2025-10-28, **No Evidence for a Dynamically Evolving Dark Energy Scenario: Tomographic Alcock-Paczyński Test with Redshift-Space Correlation Function II**, Fuyu Dong et.al., [2510.24089v1](http://arxiv.org/abs/2510.24089v1)\n\n We apply an extended Alcock-Paczy\\'nski (AP) test to the Sloan Digital Sky Survey data to constrain the dark energy models with the Chevallier-Polarski-Linder (CPL) parametrization of the dark energy equation of state. The extended AP test method uses the full shape of redshift-space two-point correlation funcion(CF) as the standard shape in order to measure the expansion history of the universe. We calibrate the standard shape by using the cosmology-dependent nonlinear evolution of the CF shape in the Multiverse simulations. Further validation of the method and calibration of possible systematics are performed based on mock samples from the Horizon Run 4 simulation. Using the AP test alone, we constrain the flat CDM plus CPL-type dark energy model (flat $w^{\\rm CPL}$CDM) to have $\\Omega\\_m=0.289\\_{-0.029}^{+0.031}$, $w\\_0=-0.798\\_{-0.102}^{+0.192}$ and $w\\_a=-0.165\\_{-0.945}^{+0.610}$. The result does not show evidence for a dynamically evolving dark energy model. When combined with other results from the low-redshift universe, such as the PantheonPlus supernova compilation and DESI BAO data, the constraint on $w\\_a$ becomes $w\\_a=-0.124\\_{-0.368}^{+0.334}$, which is still consistent with zero.\n\n", "2510.23829": "2025-10-27, **Constraining the gravitational-wave emission of core-collapse supernovae with ground-based detectors**, Jingwang Diao et.al., [2510.23829v1](http://arxiv.org/abs/2510.23829v1)\n\n A gravitational-wave background (GWB) arising from the superposition of numerous unresolved gravitational-wave signals has yet to be detected. Potential contributing sources to such a background include compact binary coalescences (CBCs) and core-collapse supernovae (CCSNe). In this work, we place upper limits on the gravitational-wave energy emitted by CCSNe using cross-correlation measurements made with Advanced LIGO and Advanced Virgo detectors during their third observing run (O3). Specifically, we obtain a $95\\%$ credibility upper limit of $0.01~ {M\\_\\odot c^2}$ while accounting for the contribution from CBC sources to a GWB. This result improves on previous constraint obtained from initial LIGO data by approximately two orders of magnitude. We also explore the detection prospects of third-generation ground-based detectors such as the Einstein Telescope and Cosmic Explorer for both individual CCSNe events and the GWB. Our results show that single events are likely to be detected prior to the GWB.\n\n", "2510.23747": "2025-10-27, **Unlocking the radio-gamma spectrum of the pulsar wind nebula around PSR J1124-5916 in SNR G292.0+1.8**, A. Lemière et.al., [2510.23747v1](http://arxiv.org/abs/2510.23747v1)\n\n We present the first detection of GeV $\\gamma$-ray emission potentially associated with the pulsar wind nebula (PWN) hosted by the young core-collapse supernova remnant G292.0+1.8, based on a detailed time-resolved analysis of \\textit{Fermi}-LAT data. By isolating the unpulsed component from the dominant magnetospheric radiation of PSR~J1124$-$5916, we successfully disentangle a candidate nebular emission in the GeV range, characterise its morphology and extract its spectrum. This identification places G292.0+1.8 among the few systems in which the pulsar and PWN contributions have been spectrally resolved at high energies, offering new insight into their respective emission mechanisms. We characterise the $\\gamma$-ray spectrum of the pulsar and model the broadband spectral energy distribution (SED) of the PWN using radio, X-ray, and GeV data. The emission is well described by a single electron population with two spectral breaks: one intrinsic to the injection spectrum and another produced by synchrotron cooling in a magnetic field of $\\sim$15~$\\mu$G. Notably, the inferred magnetic field and the low TeV flux of the nebula resemble those of 3C~58, suggesting that similar low-field environments can arise in young PWNe. The high-energy portion of the SED is now tightly constrained by our GeV detection and existing TeV upper limits. Compared to our model, earlier predictions tend to underpredict the $\\gamma$-ray flux, while others that succeed in reproducing the GeV component often overpredict the TeV emission. This mismatch underscores the challenges in modelling particle acceleration and radiation processes in young PWNe and establishes G292.0+1.8 as a valuable benchmark for testing and refining such models.\n\n", "2510.23732": "2025-10-27, **ZTF25abjmnps (AT2025ulz) and S250818k: A Candidate Superkilonova from a Sub-threshold Sub-Solar Gravitational Wave Trigger**, Mansi M. Kasliwal et.al., [2510.23732v1](http://arxiv.org/abs/2510.23732v1)\n\n On August 18, 2025, the LIGO-Virgo-KAGRA collaboration reported gravitational waves from a sub-threshold binary neutron star merger. If astrophysical, this event would have a surprisingly low chirp mass, suggesting that at least one neutron star was below a solar mass. The Zwicky Transient Facility mapped the coarse localization and discovered a transient, ZTF25abjmnps (AT2025ulz), that was spatially and temporally coincident with the gravitational wave trigger. The first week of follow-up suggested properties reminiscent of a GW170817-like kilonova. Subsequent follow-up suggests properties most similar to a young, stripped-envelope, Type IIb supernova. Although we cannot statistically rule out chance coincidence, we undertake due diligence analysis to explore the possible association between ZTF25abjmnps and S250818k. Theoretical models have been proposed wherein sub-solar neutron star(s) may form (and subsequently merge) via accretion disk fragmentation or core fission inside a core-collapse supernova i.e. a ``superkilonova\". Here, we qualitatively discuss our multi-wavelength dataset in the context of the superkilonova picture. Future higher significance gravitational wave detections of sub-solar neutron star mergers with extensive electromagnetic follow-up would conclusively resolve this tantalizing multi-messenger association.\n\n", "2510.23728": "2025-10-27, **AT2025ulz and S250818k: Deep X-ray and radio limits on off-axis afterglow emission and prospects for future discovery**, Brendan O'Connor et.al., [2510.23728v1](http://arxiv.org/abs/2510.23728v1)\n\n The first joint electromagentic (EM) and gravitational wave (GW) detection, known as GW170817, marked a critical juncture in our collective understanding of compact object mergers. However, it has now been 8 years since this discovery, and the search for a second EM-GW detection has yielded no robust discoveries. Recently, on August 18, 2025, the LIGO-Virgo-KAGRA collaboration reported a low-significance (high false alarm rate) binary neutron star merger candidate S250818k. Rapid optical follow-up revealed a single optical candidate AT2025ulz ($z=0.08484$) that initially appeared consistent with kilonova emission. We quickly initiated a set of observations with \\textit{Swift}, \\textit{XMM-Newton}, \\textit{Chandra}, and the Very Large Array to search for non-thermal afterglow emission. Our deep X-ray and radio search rules out that the optical rebrightening of AT2025ulz is related to the afterglow onset, reinforcing its classification as a stripped-envelope supernova (SN 2025ulz). We derive constraints on the afterglow parameters for a hypothetical binary neutron star merger at the distance of AT2025ulz ($\\approx 400$ Mpc) based on our X-ray and radio limits. We conclude that our observational campaign could exclude a GW170817-like afterglow out to viewing angles of $\\theta\\_\\textrm{v}\\approx 12.5$ degrees. We briefly discuss the prospects for the future discovery of off-axis afterglows.\n\n", "2510.23724": "2025-10-27, **Continuous gravitational waves from magnetized white dwarfs: Quantifying the detection plausibility by LISA**, Mayusree Das et.al., [2510.23724v1](http://arxiv.org/abs/2510.23724v1)\n\n White dwarfs (WDs) are frequently observed to have strong magnetic fields up to $10^9$ G and expected to have a possible internal field as high as $\\sim 10^{14}$ G. High internal fields can significantly deform a WD's equilibrium structure, generating a quadrupole moment. If the rotation axis is misaligned with the magnetic axis, the deformation can lead to the emission of continuous gravitational waves (CGWs). We examine the potential for detecting CGWs from magnetized WDs with future space-based detectors such as LISA, ALIA, DECIGO, Deci-Hz, BBO and TianQin. We model the field-induced deformation and compute the resulting GW strain, incorporating amplitude decay due to angular momentum loss from electromagnetic and gravitational radiation. This sets a timescale for detection -`active timescale' of $10^{5-6}$ yr, requiring observation while the object remains sufficiently young. Our results suggest that LISA could detect a few dozens of highly magnetized WDs across the Galaxy during its mission. As a specific case, we investigate ZTF J1901+1458- a compact, massive, fast-rotating, and strongly magnetized WD with spin period $\\sim416$ s and inferred surface field $\\sim10^{9}$ G. We find that this object would be detectable by LISA with four years of continuous data. This highlights the potential of CGW observations to probe magnetic field structure in WDs and their role in type Ia supernova progenitors.\n\n", "2510.23723": "2025-10-27, **AT2025ulz and S250818k: Leveraging DESI spectroscopy in the hunt for a kilonova associated with a sub-solar mass gravitational wave candidate**, Xander J. Hall et.al., [2510.23723v1](http://arxiv.org/abs/2510.23723v1)\n\n On August 18th, 2025, the LIGO--Virgo--KAGRA collaboration reported a sub-threshold gravitational wave candidate detection consistent with a sub-solar-mass neutron star merger, denoted S250818k. An optical transient, AT2025ulz, was discovered within the localization region. AT2025ulz initially appeared to meet the expected behavior of kilonova (KN) emission, the telltale signature of a binary neutron star merger. The transient subsequently rebrightened after $\\sim$\\,$5$ days and developed spectral features characteristic of a Type IIb supernova. In this work, we analyze the observations of the host galaxy of AT2025ulz obtained by the Dark Energy Spectroscopic Instrument (DESI). From the DESI spectrum, we obtain a secure redshift of $z = 0.084840 \\pm 0.000006$, which places the transient within $2\\sigma$ of the gravitational wave distance and results in an integral overlap between the gravitational wave alert and the transient location of $\\log\\_{10}\\mathcal{I} \\approx 3.9-4.2$. Our analysis of the host galaxy's spectral energy distribution reveals a star-forming, dusty galaxy with stellar mass ${\\sim} 10^{10}~M\\_\\odot$, broadly consistent with the population of both short gamma-ray bursts and core-collapse supernova host galaxies. We also present our follow-up of DESI-selected candidate host galaxies using the Fraunhofer Telescope at the Wendelstein Observatory, and show the promise of DESI for associating or rejecting candidate electromagnetic counterparts to gravitational wave alerts. These results emphasize the value of DESI's extensive spectroscopic dataset in rapidly characterizing host galaxies, enabling spectroscopic host subtraction, and guiding targeted follow-up.\n\n", "2510.23548": "2025-10-27, **The MandelZoom project II: the impact of stellar feedback on black hole accretion through an $α$-disc in dwarf galaxies with a resolved interstellar medium**, Eun-jin Shin et.al., [2510.23548v1](http://arxiv.org/abs/2510.23548v1)\n\n We present a suite of high-resolution simulations to study how different stellar feedback channels regulate the growth of central intermediate-mass black holes (IMBHs) in dwarf galaxies hosting nuclear star clusters (NSCs). We employ a super-Lagrangian refinement scheme to resolve the self-gravity radius of the $\\alpha$-accretion disc ($<0.01$~pc) and follow the gas inflows from the interstellar medium (ISM) to the black hole (BH), allowing for the self-consistent emergence of circumnuclear discs (CNDs). In the absence of stellar feedback, as expected, the galactic disc fragments excessively, producing a massive CND. When radiative stellar feedback is included, fragmentation is suppressed, with even more massive CNDs forming and feeding the IMBH. With supernova (SN) feedback only, clustered SNe strongly heat the ISM, yielding both the lowest CND masses and BH accretion rates. When both radiative stellar feedback and SNe are included, the CND becomes intermittent: it survives for $10$--$100$~Myr, and is then destroyed by feedback before being replenished by fresh galactic inflows, while substantial BH growth still takes place. These results highlight the critical importance of accurately modelling the combined effects of key stellar feedback processes to understand IMBH growth. Our simulation suite brackets the likely range of CND states, with IMBHs exhibiting significant growth and systematic spin-up in all dwarf galaxy models explored. These findings bode well for the detection of IMBHs with future observational facilities such as SKA, the Rubin Observatory, and LISA, and make them highly relevant progenitor candidates of the high-redshift supermassive BHs observed by JWST.\n\n", "2510.23533": "2025-10-27, **Discovery of SN 2025wny: a Strongly Gravitationally Lensed Superluminous Supernova at z = 2.01**, Joel Johansson et.al., [2510.23533v1](http://arxiv.org/abs/2510.23533v1)\n\n We present the discovery of SN 2025wny (ZTF25abnjznp/GOTO25gtq) and spectroscopic classification of this event as the first gravitationally lensed Type I superluminous supernovae (SLSN-I). Deep ground-based follow-up observations resolves four images of the supernova with ~1.7\" angular separation from the main lens galaxy, each coincident with the lensed images of a background galaxy seen in archival imaging of the field. Spectroscopy of the brightest point image shows narrow features matching absorption lines at a redshift of z = 2.011 and broad features matching those seen in superluminous SNe with Far-UV coverage. We infer a magnification factor of 20 to 50 for the brightest image in the system, based on photometric and spectroscopic comparisons to other SLSNe-I. SN 2025wny demonstrates that gravitationally-lensed SNe are in reach of ground-based facilities out to redshifts far higher than what has been previously assumed, and provide a unique window into studying distant supernovae, internal properties of dwarf galaxies, as well as for time-delay cosmography.\n\n", "2510.23330": "2025-10-27, **The First Star-by-star $N$-body/Hydrodynamics Simulation of Our Galaxy Coupling with a Surrogate Model**, Keiya Hirashima et.al., [2510.23330v1](http://arxiv.org/abs/2510.23330v1)\n\n A major goal of computational astrophysics is to simulate the Milky Way Galaxy with sufficient resolution down to individual stars. However, the scaling fails due to some small-scale, short-timescale phenomena, such as supernova explosions. We have developed a novel integration scheme of $N$-body/hydrodynamics simulations working with machine learning. This approach bypasses the short timesteps caused by supernova explosions using a surrogate model, thereby improving scalability. With this method, we reached 300 billion particles using 148,900 nodes, equivalent to 7,147,200 CPU cores, breaking through the billion-particle barrier currently faced by state-of-the-art simulations. This resolution allows us to perform the first star-by-star galaxy simulation, which resolves individual stars in the Milky Way Galaxy. The performance scales over $10^4$ CPU cores, an upper limit in the current state-of-the-art simulations using both A64FX and X86-64 processors and NVIDIA CUDA GPUs.\n\n", "2510.23126": "2025-10-27, **A volcanic chronosequence as a time-resolved paleo-detector array to study the cosmic-ray flux in the Late Pleistocene and Holocene**, Claudio Galelli et.al., [2510.23126v1](http://arxiv.org/abs/2510.23126v1)\n\n We present a phenomenological study demonstrating the feasibility of using olivine xenoliths from the Cha\\^ine des Puys as a time-resolved paleo-detector array to probe the cosmic-ray flux over the last 40,000 years. This volcanic region provides a unique chronosequence of samples brought to the surface by well-dated eruptions. By modeling the expected density of nuclear recoil tracks induced by cosmic-ray muons in olivine, we show that the signal is detectable and above backgrounds from natural radioactivity. We demonstrate that by analyzing samples with different exposure ages, it is possible to construct a time-differential measurement of the cosmic-ray flux. This method shows sensitivity to historical variations, such as the enhanced flux expected during the Laschamp geomagnetic excursion ($\\sim$41~kyr) and the potential contribution from nearby supernovae, for which we use the Antlia supernova remnant precursor as a benchmark. This work establishes a new application of the paleo-detector technique for long-scale time-domain high-energy astrophysics and provides the direct scientific motivation for experimental efforts to measure these track records.\n\n", "2510.23037": "2025-10-27, **Testing the cosmic distance duality relation using model-independent approach**, Shubham Barua et.al., [2510.23037v1](http://arxiv.org/abs/2510.23037v1)\n\n In this work, we test the cosmic distance duality relation (CDDR) using the arbitrary redshift pivot Pad\\'e-(2,1) expansion methodology developed in arXiv:2509.16196. This approach allows us to constrain cosmographic parameters and test CDDR at a particular redshift. Further, it does not rely on data reconstructions or extrapolations of the cosmographic parameters to higher redshifts. We employ observational data from the Dark Energy Spectroscopic Instrument Baryon Acoustic Oscillation dataset, cosmic chronometers, and Type Ia supernovae from the Pantheon Plus and Dark Energy Survey Year 5 compilations. We find no significant deviations from the standard CDDR relation, with constraints reaching sub-percent precision across most redshifts in the range $0\\lesssim z \\lesssim 1$.\n\n", "2510.22997": "2025-10-27, **SN 2024iss: A Double-peaked Type IIb Supernova with Evidence of Circumstellar Interaction**, Liyang Chen et.al., [2510.22997v1](http://arxiv.org/abs/2510.22997v1)\n\n We present optical, ultraviolet, and X-ray observations of supernova (SN) 2024iss, a Type IIb SN that shows a prominent double-peaked light curve. We modeled the first peak with a semianalytical shock-cooling model and the X-ray emission with a free-free model. We compare the envelope radius and mass-loss rate with other Type IIb SNe to explore the relationships between the progenitor envelope and the circumstellar material (CSM). The shock-cooling peak in the $V$-band light curve reached $M\\_V = -17.33\\pm 0.26$mag, while the $^{56}$Ni-powered second peak attained $M\\_V = -17.43\\pm 0.26$mag. Early spectra show an photospheric velocity of $\\sim19,400\\,km\\,s^{-1}$ at 3.82days from the H$\\alpha$ P~Cygni profile. The Balmer lines persist at least +87 days after the explosion, characterizing hydrogen-rich ejecta. Modeling the first light-curve peak suggests an extended envelope with a mass of $0.11\\pm0.04\\,M\\_{\\odot}$ and a radius of $244\\pm43~R\\_{\\odot}$. Fitting the second light-curve peak with an Arnett-like model indicates a typical $^{56}$Ni mass of $ 0.117\\pm0.013~M\\_{\\odot}$ and a relatively low ejecta mass of $1.272\\pm0.343\\,M\\_{\\odot}$. X-ray observations reveal bright thermal bremsstrahlung emission and indicate a mass-loss rate of $1.6\\times10^{-5}\\ M\\_{\\odot} \\ \\rm{yr}^{-1}$. SN 2024iss occupies a transitional position between the two subclasses of extended (eIIb) and compact (cIIb) Type IIb SNe. Its envelope radius and pre-explosion mass-loss rate appear to be correlated as theoretically predicted. The observational properties of SN 2024iss are compatible with a binary interaction scenario being the dominant mechanism for envelope stripping. Furthermore, the low column density of neutral hydrogen suggests a compact CSM with an outer radius of $\\lesssim1.3\\times10^{14}$ cm, indicating that the progenitor star experienced eruptive mass loss within $\\sim4\\,yr$ of its terminal explosion.\n\n", "2510.22989": "2025-10-27, **SN2017ckj: A linearly declining Type IIb supernova with a relatively massive hydrogen envelope**, L. -H. Li et.al., [2510.22989v1](http://arxiv.org/abs/2510.22989v1)\n\n We present optical observations of the Type IIb supernova (SN) 2017ckj, covering approximately 180 days after the explosion. Its early-time multi-band light curves display no clear evidence of a shock-cooling tail, resembling the behavior of SN2008ax. The $V$-band light curve exhibits a short rise time of about 5 days and reaches an absolute peak magnitude of $M\\_{\\rm V}=-18.58\\pm0.17\\mathrm{mag}$. The late-time multi-band light curves reveal a linear decline. We modelled the bolometric light curve of SN2017ckj to constrain the progenitor and the explosion parameters. We estimated a total mass of $\\rm ^{56}Ni$ synthesized by SN2017ckj of $M\\_{\\rm Ni} = 0.21^{+0.05}\\_{-0.03}\\ M\\_\\odot$, with a massive H-rich envelope of $M\\_{\\rm env} = 0.4^{+0.1}\\_{-0.1}\\ M\\_\\odot$. Both the $\\rm ^{56}Ni$ mass and the envelope mass of SN2017ckj are higher than those of typical SNe IIb, in agreement with its peculiar light curve evolution. The early-time spectra of SN2017ckj are dominated by a blue continuum, accompanied by narrow $\\rm H\\_\\alpha$ and \\Heii emission lines. The earliest spectrum exhibits flash ionization features, from which we estimated a progenitor mass-loss rate of $\\sim 3.4\\times10^{-4}M\\_\\odot \\mathrm{yr}^{-1}$. At later epochs, the spectra develop broad P-Cygni profiles and become increasingly similar to those of SNe IIb, especially SN2018gk. The late-time spectrum at around 139 days does not show a distinct decline in the strength of $\\rm H\\_\\alpha$ emission profile, also indicating a relatively massive envelope of its progenitor. Aside from the $\\rm H\\_\\alpha$ feature, the nebular spectrum exhibits prominent emission lines of \\Oi, \\Caii, [\\Caii], and \\Mgi], which are consistent with the prototypical SN1993J.\n\n"}}