{"neutrino": {"2504.15272": "2025-04-21, **Superheavy dark matter from the natural inflation in light of the highest-energy astroparticle events**, Kohta Murase et.al., [2504.15272v1](http://arxiv.org/abs/2504.15272v1)\n\n Superheavy dark matter has been attractive as a candidate of particle dark matter. We propose a \"natural\" particle model, in which the dark matter serves as the inflaton in natural inflation, while decaying to high-energy particles at energies of $10^{9}-10^{13} \\, \\text{GeV}$ from the prediction of the inflation. A scalar field responsible to dilute the dark matter abundance revives the natural inflation. Since the dark matter must be a spin zero scalar, we study carefully the galactic dark matter 3-body decay into fermions and two body decays into a gluon pair, and point out relevant multi-messenger bounds that constrain these decay modes. Interestingly, the predicted energy scale may coincide with the AMATERASU event and/or the KM3NeT neutrino event, KM3-230213A. We also point out particle models with dark baryon to further alleviate $\\gamma$-ray bounds. This scenario yields several testable predictions for the UHECR observations, including the highest-energy neutrons that are unaffected by magnetic fields, the tensor-to-scalar ratio, the running of spectral indices, $\\alpha\\_s\\gtrsim\\mathcal{O}(0.001)$, and the existence of light new colored particles that could be accessible at future collider experiments. Further measurements of high energy cosmic rays, including their components and detailed coordinates may provide insight into not only the origin of the cosmic rays but also inflation.\n\n", "2504.15164": "2025-04-21, **Minimal effective theory for leptogenesis, dark matter, and neutrino masses**, Tomas Blazek et.al., [2504.15164v1](http://arxiv.org/abs/2504.15164v1)\n\n We study the phenomenological consequences of choosing a minimal set of effective operators that allow for the simultaneous generation of the dark matter relic density and the matter-antimatter asymmetry of the universe. Neutrino masses are obtained in a specific case of baryogenesis via leptogenesis. We find that only two new particles -- a heavy unstable fermion and a light dark matter scalar -- need to be included in addition to the Standard Model particle content.\n\n", "2504.15055": "2025-04-21, **Failure of the comformal-map method for relativistic quantum billiards**, Barbara Dietz et.al., [2504.15055v1](http://arxiv.org/abs/2504.15055v1)\n\n We demonstrate that the conformal-map method introduced by Robnik in 1984 for nonrelativistic quantum billiards is not applicable for the quantization of relativistic neutrino billiards (NBs) consisting of a massless non-interacting spin-1/2 particle confined to a two-dimensional domain. To be precise, we demonstrate in this work, that this method does not provide solutions of the associated Weyl (Dirac) equation, nor does it fulfill the boundary conditions imposed on the spinor eigenfunctions to ensure confinement of the particle to the domain of the billiard. We review in detail the wave equation, boundary conditions and quantization of NBs and derivation of relevant equations, to make the proof comprehensible for the general reader. Our results are corroborated with numerical results for non-relativistic and relativistic quantum billiards whose shapes depend on a parameter, which allows the study of the properties of their eigenstates as the classical dynamics experiences a transition from regular to chaotic dynamics.\n\n", "2504.14918": "2025-04-21, **Monopoles at Future Neutrino Detectors**, Pablo M. Candela et.al., [2504.14918v1](http://arxiv.org/abs/2504.14918v1)\n\n We investigate the potential of future neutrino experiments, DUNE and Hyper-Kamiokande, to probe magnetic monopoles via Callan-Rubakov (CR) processes. We consider both relativistic and non-relativistic monopoles and focus on two primary detection signatures: high-energy antiproton production and proton decay catalysis. For relativistic monopoles, our analysis of the CR process indicates antiproton production with energies near 900 GeV and we find that both experiments can provide limits on the fluxes an order of magnitude below the Parker bound (approximately $\\Phi \\lesssim 10^{-16}\\,\\mathrm{cm^{-2}\\,s^{-1}\\,sr^{-1}}$). For non-relativistic monopoles, we recast the experimental sensitivity to proton decay catalysis and obtain upper limits on the monopole flux of $\\Phi \\lesssim 2.3 \\times 10^{-23}\\,\\mathrm{cm^{-2}\\,s^{-1}\\,sr^{-1}}$ for Hyper-Kamiokande and $\\Phi \\lesssim 1.1 \\times 10^{-22}\\,\\mathrm{cm^{-2}\\,s^{-1}\\,sr^{-1}}$ for DUNE.\n\n", "2504.14726": "2025-04-20, **Quantum field theory treatment of neutrino spin-flavor oscillations in a magnetic field**, Maxim Dvornikov et.al., [2504.14726v1](http://arxiv.org/abs/2504.14726v1)\n\n We study spin-flavor oscillations of neutrinos in a magnetic field within the quantum field theory approach in which neutrinos are virtual particles. Neutrinos are taken to be Majorana particles having a nonzero transition magnetic moment. We derive the dressed propagators of the neutrino mass eigenstates exactly accounting for the magnetic field contribution. The matrix element and the transition probability for spin-flavor oscillations are obtained. The leading term in the transition probability is shown to coincide with the result of the standard quantum mechanical description of neutrino oscillations. We also derive the correction to the transition probability which has the quantum field theory origin.\n\n", "2504.14671": "2025-04-20, **Gravitational wave signatures of dark sector portal leptogenesis**, Debasish Borah et.al., [2504.14671v1](http://arxiv.org/abs/2504.14671v1)\n\n We study the possibility of probing leptogenesis via stochastic gravitational waves (GW) arising from a dark sector assisted first-order electroweak phase transition. The same dark sector, with non-trivial transformation under an unbroken $Z\\_2$ symmetry is also responsible for providing the only source of CP asymmetry via one-loop interference with the tree level decay of a heavy right-handed neutrino into lepton and Higgs doublets. The new Yukawa and scalar portal couplings enhance the CP asymmetry allowing TeV scale leptogenesis without any resonant enhancement. Light neutrino masses arise from a combination of type-I and one-loop contributions with vanishing lightest neutrino mass. While the new degrees of freedom in sub-TeV range keep the detection prospects at terrestrial experiments promising, the new scalars enhance the strength of the electroweak phase transition keeping the GW signals within reach of near future experiments like LISA.\n\n"}, "dark matter": {"2504.15262": "2025-04-21, **Revealing the 3D Cosmic Web through Gravitationally Constrained Neural Fields**, Brandon Zhao et.al., [2504.15262v1](http://arxiv.org/abs/2504.15262v1)\n\n Weak gravitational lensing is the slight distortion of galaxy shapes caused primarily by the gravitational effects of dark matter in the universe. In our work, we seek to invert the weak lensing signal from 2D telescope images to reconstruct a 3D map of the universe's dark matter field. While inversion typically yields a 2D projection of the dark matter field, accurate 3D maps of the dark matter distribution are essential for localizing structures of interest and testing theories of our universe. However, 3D inversion poses significant challenges. First, unlike standard 3D reconstruction that relies on multiple viewpoints, in this case, images are only observed from a single viewpoint. This challenge can be partially addressed by observing how galaxy emitters throughout the volume are lensed. However, this leads to the second challenge: the shapes and exact locations of unlensed galaxies are unknown, and can only be estimated with a very large degree of uncertainty. This introduces an overwhelming amount of noise which nearly drowns out the lensing signal completely. Previous approaches tackle this by imposing strong assumptions about the structures in the volume. We instead propose a methodology using a gravitationally-constrained neural field to flexibly model the continuous matter distribution. We take an analysis-by-synthesis approach, optimizing the weights of the neural network through a fully differentiable physical forward model to reproduce the lensing signal present in image measurements. We showcase our method on simulations, including realistic simulated measurements of dark matter distributions that mimic data from upcoming telescope surveys. Our results show that our method can not only outperform previous methods, but importantly is also able to recover potentially surprising dark matter structures.\n\n", "2504.15116": "2025-04-21, **Wigner multiplets in QFT: from Wigner degeneracy to Elko fields**, Cheng-Yang Lee et.al., [2504.15116v1](http://arxiv.org/abs/2504.15116v1)\n\n We establish the theoretical foundation of the Wigner superposition field, a quantum field framework for spin-1/2 fermions that exhibit a Wigner doublet -- a discrete quantum number arising from nontrivial representations of the extended Poincar\\'{e} group. In contrast to the previously developed doublet formalism, which treats the Wigner degeneracy as a superficial label, the superposition formalism encodes it directly into the structure of a unified field via a coherent superposition of degenerate spinor fields. By imposing the Lorentz covariance, causality, and canonical quantization, we derive nontrivial constraints on the field configuration, which uniquely identify the Elko field as the consistent realization of the Wigner superposition field. Our analysis further clarifies that although the Elko field is a spinor field, it possesses mass dimension one and obeys the Klein-Gordon rather than the Dirac kinematics. Moreover, we explore the general Elko representation through basis redefinitions, showing that certain traditional properties, such as being eigenspinors of charge conjugation, are artifacts of specific basis choices rather than intrinsic features. Finally, we discuss the physical implications of Elko as a dark matter (DM) candidate. This work lays the foundation for a systematic reformulation of Elko interactions and its phenomenology as a viable component of DM.\n\n", "2504.14980": "2025-04-21, **Bayesian model selection of Primordial Black Holes and Dressed Primordial Black Holes with lensed Gravitational Waves**, Xin-yi Lin et.al., [2504.14980v1](http://arxiv.org/abs/2504.14980v1)\n\n If particle dark matter (DM) and primordial black holes (PBHs) coexist, PBHs will be surrounded by particle DM, forming celestial objects known as dressed PBHs (dPBHs). These structures suggest a scenario in which PBHs and DM can exist simultaneously. However, in the high-frequency regime, the gravitational lensing effect of bare PBHs is similar to that of dPBHs. Ground-based gravitational wave (GW) detectors are particularly sensitive to high-frequency GW signals. In this regime, the lensing effect of a point-mass lens with a mass in the range of $10^{-1} \\sim 10^2 M\\_{\\odot}$ becomes significant. In this work, we incorporate dPBH models with GW observations and employ Bayesian inference techniques to distinguish PBHs from dPBHs. Using the third-generation ground-based GW detectors, Einstein Telescope (ET) and Cosmic Explorer (CE), as examples, we demonstrate that these detectors can effectively differentiate the lensing effects of dPBHs from those of PBHs across a broad frequency range. Furthermore, we find that with a larger black hole (BH) mass inside the surrounding particle DM, ET and CE can distinguish these two lensed models with even greater precision.\n\n", "2504.14944": "2025-04-21, **Haloscope Searching for Dark Photons at Q-band with a Novel Coupling Tuning Structure**, Yue Yin et.al., [2504.14944v1](http://arxiv.org/abs/2504.14944v1)\n\n Laboratory searching for dark matter is crucial for understanding several fundamental conundrums in physics and cosmology. Most cavity-based haloscope searches focus on the frequency range below 10 GHz, while the parameter space with higher frequency remains rarely explored, due to the challenges lying in the fabrication of microwave cavities. Here we report the first Q-band haloscope searching for dark photons with a 33.141 GHz cavity. A novel coupling tuning structure separated from the cavity was designed so as not to degrade the quality factor of the cavity. We have established the most stringent constraints $\\chi<2.5\\times10^{-12}$ at a confidence level of 90$\\%$ in the frequency range from 33.139 GHz to 33.143 GHz, corresponding to the mass of dark photons ranging from 137.05 $\\mu$eV to 137.07 $\\mu$eV. The results surpass the previous astronomical constraints by nearly three orders of magnitude. This work has demonstrated the feasibility of dark matter haloscopes at Q band. In the future, the constraints can be further improved by more than one order of magnitude through low-temperature experiments, and the setup can be extended to search for axions, axion-like particles, and high-frequency gravitational waves.\n\n", "2504.14836": "2025-04-21, **Systematic search for blue hyper-velocity stars from LAMOST survey**, Yongkang Sun et.al., [2504.14836v1](http://arxiv.org/abs/2504.14836v1)\n\n Hypervelocity stars (HVSs) represent a unique class of objects capable of escaping the gravitational pull of the Milky Way due to extreme acceleration events, such as close encounters with the supermassive black hole at the Galactic center (GC), supernova explosions in binary systems, or multi-body dynamical interactions. Finding and studying HVSs are crucial to exploring these ejection mechanisms, characterizing central black holes, probing the GC environment, and revealing the distribution of dark matter in our galaxy. The Large Sky Area Multi-Object Fiber Spectroscopic Telescope (LAMOST) spectroscopic surveys have so far identified four B-type unbound HVSs. To expand this sample with the second-phase LAMOST survey that started in 2018, we conducted a systematic search for early-type HVSs using the LAMOST Data Release 10. We identified 125 early-type high-velocity candidates with total velocities exceeding 300 km\\,s$^{-1}$. Among them, we report ten new unbound B- and A-type hypervelocity star (HVS) candidates (designated LAMOST-HVS5 through LAMOST-HVS14), tripling the number of unbound HVSs previously identified by LAMOST. Kinematic analyses suggest that these newly discovered HVS candidates likely originated either from the Galactic Center or via dynamical interactions. Future high-resolution follow-up observations promise to refine the stellar parameters, distances, and elemental abundances of these candidates, thereby providing deeper insights into their origins and broadening their potential applications across astrophysics.\n\n", "2504.14799": "2025-04-21, **Detecting Dark Matter with Neutron Stars**, Anupam Ray et.al., [2504.14799v1](http://arxiv.org/abs/2504.14799v1)\n\n Neutron stars offer powerful astrophysical laboratories to probe the properties of dark matter. Gradual accumulation of heavy, non-annihilating dark matter in neutron stars can lead to the formation of comparable-mass black holes, and non-detection of gravitational waves from mergers of such low-mass black holes can constrain such dark matter interactions with nucleons. These constraints, though dependent on the currently uncertain binary neutron star merger rate density, are significantly more stringent than those from direct detection experiments and provide some of the strongest limits on heavy, non-annihilating dark matter interactions. Additionally, dark matter with baryon number-violating interactions can induce excess heating in cold neutron stars and is thus significantly constrained by thermal observations of cold neutron stars.\n\n", "2504.14656": "2025-04-20, **Analyzing the 21cm forest with Wavelet Scattering Transform: Insight into non-Gaussian features of the 21cm forest**, Hayato Shimabukuro et.al., [2504.14656v1](http://arxiv.org/abs/2504.14656v1)\n\n The 21cm forest, narrow absorption features in the spectra of high redshift radio sources caused by intervening neutral hydrogen, offers a unique probe of the intergalactic medium and small-scale structures during reionization. While traditional power spectrum methods have been widely used for analyzing the 21cm forest, these techniques are limited in capturing the non-Gaussian nature of the signal. In this work, we introduce the Wavelet Scattering Transform (WST) as a novel diagnostic tool for the 21cm forest, which allows for the extraction of higher-order statistical features that power spectrum methods cannot easily capture. By decomposing simulated brightness temperature spectra into a hierarchy of scattering coefficients, the WST isolates both local intensity fluctuations (first-order coefficients) and scale-scale correlations (second-order coefficients), revealing the complex, multi-scale non-Gaussian interactions inherent in the 21cm forest. This approach enhances the power of 21cm forest in distinguishing between different cosmological models, such as Cold Dark Matter (CDM) and Warm Dark Matter (WDM), as well as scenarios with enhanced X-ray heating. Unlike traditional methods, which focus primarily on Gaussian statistics, the WST captures richer astrophysical and cosmological information. Our analysis shows that WST can significantly improve constraints on key parameters, such as the X-ray heating efficiency and the WDM particle mass, providing deeper insights into the early stages of cosmic structure formation.\n\n", "2504.14616": "2025-04-20, **The galaxy bias profile of cosmic voids**, Antonio D. Montero-Dorta et.al., [2504.14616v1](http://arxiv.org/abs/2504.14616v1)\n\n Cosmic voids are underdense regions within the large-scale structure of the Universe, spanning a wide range of physical scales - from a few megaparsecs (Mpc) to the largest observable structures. Their distinctive properties make them valuable cosmological probes and unique laboratories for galaxy formation studies. A key aspect to investigate in this context is the galaxy bias, $b$, within voids - that is, how galaxies in these underdense regions trace the underlying dark-matter density field. We want to measure the dependence of the large-scale galaxy bias on the distance to the void center, and to evaluate whether this bias profile varies with the void properties and identification procedure. We apply a void identification scheme based on spherical overdensities to galaxy data from the IllustrisTNG magnetohydrodynamical simulation. For the clustering measurement, we use an object-by-object estimate of large-scale galaxy bias, which offers significant advantages over the standard method based on ratios of correlation functions or power spectra. We find that the average large-scale bias of galaxies inside voids tends to increase with void-centric distance when normalized by the void radius. For the entire galaxy population within voids, the average bias rises with the density of the surrounding environment and, consequently, decreases with increasing void size. Due to this environmental dependence, the average galaxy bias inside S-type voids - embedded in large-scale overdense regions - is significantly higher ($\\langle b\\rangle\\_{\\rm in} > 0$) at all distances compared to R-type voids, which are surrounded by underdense regions ($\\langle b\\rangle\\_{\\rm in} < 0$). The bias profile for S-type voids is also slightly steeper. Since both types of voids host halo populations of similar mass, the measured difference in bias can be interpreted as a secondary bias effect.\n\n", "2504.14529": "2025-04-20, **Search for Dark Matter in 2HDMS at LHC and future Lepton Colliders**, Juhi Dutta et.al., [2504.14529v1](http://arxiv.org/abs/2504.14529v1)\n\n We investigate the phenomenological prospects of the Two Higgs Doublet and Complex Singlet Scalar Extension (2HDMS) in the context of dark matter (DM) and Higgs phenomenology. The 2HDMS provides an enlarged Higgs sector along with a DM candidate. In this work, we perform an exhaustive scan to find representative benchmarks which are consistent with all theoretical and experimental constraints. We choose benchmarks with light, intermediate and massive DM masses and in some cases, also accommodate the 95 GeV excess in $b\\bar{b}$ and $\\gamma\\gamma$ channels observed at the Large Electron-Positron Collider (LEP) and Large Hadron Collider (LHC). We focus on the relevant signatures at the LHC and at proposed future lepton colliders including electron-positron and muon colliders. Using a cut and count analysis, we show that while the High Luminosity LHC (HL-LHC) may give a hint of new physics, future lepton colliders prove to be efficient discovery probes for the 2HDMS.\n\n"}, "supernova": {"2504.15274": "2025-04-21, **Is Dynamical Dark Energy Necessary? DESI BAO and Modified Recombination**, Seyed Hamidreza Mirpoorian et.al., [2504.15274v1](http://arxiv.org/abs/2504.15274v1)\n\n Recent measurements of baryon acoustic oscillations (BAO) by the Dark Energy Spectroscopic Instrument (DESI) exhibit a mild-to-moderate tension with cosmic microwave background (CMB) and Type Ia supernova (SN) observations when interpreted within a flat $\\Lambda$CDM framework. This discrepancy has been cited as evidence for dynamical dark energy (DDE). Given the profound implications of DDE for fundamental physics, we explore whether the tension can instead be resolved by modifying the physics of recombination. We find that a phenomenological model of modified recombination can effectively reconcile the BAO and CMB datasets and, unlike DDE, also predicts a higher Hubble constant $H\\_0$, thereby partially alleviating the Hubble tension. A global fit to BAO, CMB, and calibrated SN data clearly favors modified recombination over DDE, suggesting that current claims of a DDE detection may be premature.\n\n", "2504.15222": "2025-04-21, **Did DESI DR2 truly reveal dynamical dark energy?**, Deng Wang et.al., [2504.15222v1](http://arxiv.org/abs/2504.15222v1)\n\n A fundamental question in cosmology is whether dark energy evolves over time, a topic that has gained prominence since the discovery of cosmic acceleration. Recently, the DESI collaboration has reported increasing evidence for evolving dark energy using combinations of cosmic microwave background (CMB), type Ia supernova (SN), and their new measurements of baryon acoustic oscillations (BAO). However, our analysis reveals that these combinations are problematic due to clear tensions among the CMB, BAO and SN datasets. Consequently, DESI's claim of dynamical dark energy (DDE) is not robust. A more reliable approach involves constraining the evolution of dark energy using each dataset independently. Through a statistical comparison for each dataset, on average, we find that DDE is strongly preferred over the $\\Lambda$CDM model. This suggests that DDE likely exists, although its real parameter space remains elusive due to weak constraints on the dark energy equation of state and inconsistencies among the datasets. Interestingly, when considering DDE, none of the individual datasets -- including CMB, DESI DR2, Pantheon+, Union3, and DESY5 -- can independently detect cosmic acceleration at a significant level. Our findings not only clarify the current understanding of the nature of dark energy but also challenge the established discovery of cosmic acceleration and the long-held notion that dark energy exerts negative pressure. Both individual and combined datasets suggest that the ultimate fate of the universe is likely to be dominated by matter rather than dark energy.\n\n", "2504.15127": "2025-04-21, **Reconstructing the redshift evolution of Type Ia supernovae absolute magnitude**, Rodrigo von Marttens et.al., [2504.15127v1](http://arxiv.org/abs/2504.15127v1)\n\n This work investigates a potential time dependence of the absolute magnitude of Type Ia Supernovae (SN Ia). Employing the Gaussian Process approach, we obtain the SN Ia absolute magnitude and its derivative as a function of redshift. The data set considered in the analysis comprises measurements of apparent magnitude from SN Ia, Hubble rate from cosmic chronometers, and the ratio between angular and radial distances from Large-Scale Structure data (BAO and voids). Our findings reveal good compatibility between the reconstructed SN Ia absolute magnitudes and a constant value. However, the mean value obtained from the Gaussian Process reconstruction is $M=-19.456\\pm 0.059$, which is $3.2\\sigma$ apart from local measurements by Pantheon+SH0ES. This incompatibility may be directly associated to the $\\Lambda$CDM model and local data, as it does not appear in either model-dependent or model-independent estimates of the absolute magnitude based on early universe data. Furthermore, we assess the implications of a variable $M$ within the context of modified gravity theories. Considering the local estimate of the absolute magnitude, we find $\\sim3\\sigma$ tension supporting departures from General Relativity in analyzing scenarios involving modified gravity theories with variations in Planck mass through Newton's constant.\n\n", "2504.14973": "2025-04-21, **Ultra-diffuse galaxies in the EAGLE simulation**, Haonan Zheng et.al., [2504.14973v1](http://arxiv.org/abs/2504.14973v1)\n\n We use the highest-resolution EAGLE simulation, Recal-L025N0752, to study the properties and formation of ultra-diffuse galaxies (UDGs). We identify 181 UDGs and find their properties closely match observations. The total masses of EAGLE UDGs range from ${\\sim}5\\times 10^{8}~M\\_{\\odot}$ to ${\\sim}2\\times 10^{11}~M\\_{\\odot}$, indicating that they are dwarf galaxies rather than failed $L\\_\\star$ galaxies. EAGLE UDGs are not a distinct population, but rather a subset of dwarf galaxies, as their properties generally form a continuous distribution with those of normal dwarf galaxies. Unlike the situations in previous studies, the extended sizes of field UDGs in EAGLE are not driven by high halos spin or by supernova-induced stellar expansion, but instead largely arise from high spins in their star-forming gas and thus the newly formed stars at large radii. This might be attributed to galactic fountains, by which star-forming gas are launched to large halo-centric distances and acquire additional angular momentum through interactions with the circumgalactic medium.For satellite UDGs, ${\\sim} 60 \\%$ of them were already UDGs before falling into the host galaxy, while the remaining ${\\sim} 40\\%$ were normal galaxies prior to infall and subsequently transformed into UDGs due to tidal effects after infall.\n\n", "2504.14836": "2025-04-21, **Systematic search for blue hyper-velocity stars from LAMOST survey**, Yongkang Sun et.al., [2504.14836v1](http://arxiv.org/abs/2504.14836v1)\n\n Hypervelocity stars (HVSs) represent a unique class of objects capable of escaping the gravitational pull of the Milky Way due to extreme acceleration events, such as close encounters with the supermassive black hole at the Galactic center (GC), supernova explosions in binary systems, or multi-body dynamical interactions. Finding and studying HVSs are crucial to exploring these ejection mechanisms, characterizing central black holes, probing the GC environment, and revealing the distribution of dark matter in our galaxy. The Large Sky Area Multi-Object Fiber Spectroscopic Telescope (LAMOST) spectroscopic surveys have so far identified four B-type unbound HVSs. To expand this sample with the second-phase LAMOST survey that started in 2018, we conducted a systematic search for early-type HVSs using the LAMOST Data Release 10. We identified 125 early-type high-velocity candidates with total velocities exceeding 300 km\\,s$^{-1}$. Among them, we report ten new unbound B- and A-type hypervelocity star (HVS) candidates (designated LAMOST-HVS5 through LAMOST-HVS14), tripling the number of unbound HVSs previously identified by LAMOST. Kinematic analyses suggest that these newly discovered HVS candidates likely originated either from the Galactic Center or via dynamical interactions. Future high-resolution follow-up observations promise to refine the stellar parameters, distances, and elemental abundances of these candidates, thereby providing deeper insights into their origins and broadening their potential applications across astrophysics.\n\n", "2504.14502": "2025-04-20, **Red Supergiant problem viewed from the nebular phase spectroscopy of type II supernovae**, Qiliang Fang et.al., [2504.14502v1](http://arxiv.org/abs/2504.14502v1)\n\n The red supergiant (RSG) problem refers to the observed dearth of luminous RSGs identified as progenitors of Type II supernovae (SNe II) in pre-SN imaging. Understanding this phenomenon is essential for studying pre-SN mass loss and the explodability of core-collapse SNe. In this work, we re-assess the RSG problem using late-phase spectroscopy of a sample of 50 SNe II. The [O I] $\\lambda\\lambda$6300,6363 emission in the spectra is employed to infer the zero-age main sequence (ZAMS) mass distribution of the progenitors, which is then transformed into a luminosity distribution via an observation-calibrated mass-luminosity relation. The resulting luminosity distribution reveals an upper cutoff at log $L/L\\_{\\odot} = 5.21^{+0.09}\\_{-0.07}$ dex, and the RSG problem is statistically significant at the 2$\\sigma$ to 3$\\sigma$ level. Assuming single RSG progenitors that follow the mass-luminosity relation of KEPLER models, this luminosity cutoff corresponds to an upper ZAMS mass limit of $20.63^{+2.42}\\_{-1.64}$ $M\\_{\\odot}$. Comparisons with independent measurements, including pre-SN imaging and plateau-phase light curve modeling, consistently yield an upper ZAMS mass limit below about 25 $M\\_{\\odot}$, with a significance level of 1-3$\\sigma$. While each individual method provides only marginal significance, the consistency across multiple methodologies suggests that the lack of luminous RSG progenitors may reflect a genuine physical problem. Finally, we discuss several scenarios to account for this issue should it be confirmed as a true manifestation of stellar physics.\n\n", "2504.14433": "2025-04-20, **The impact of ultraviolet suppression on the rates and properties of strongly lensed Type IIn supernovae detected by LSST**, Andrés I. Ponte Pérez et.al., [2504.14433v1](http://arxiv.org/abs/2504.14433v1)\n\n Upcoming wide-field time-domain surveys, such as the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) are expected to discover up to two orders of magnitude more strongly lensed supernovae per year than have so far been observed. Of these, Type IIn supernovae have been predicted to be detected more frequently than any other supernova type, despite their small relative detection fraction amongst non-lensed supernovae. However, previous studies that predict a large population of lensed Type IIn supernova detections model their time evolving spectrum as a pure blackbody. In reality, there is a deficit in the UV flux of supernovae relative to the blackbody continuum due to line-blanketing from iron-group elements in the ejecta and scattering effects. In this work we quantify the effect of this UV suppression on the detection rates by LSST of a simulated population of strongly lensed Type IIn supernovae, relative to a pure blackbody model, using a mock LSST observing run. With a blackbody model, we predict to detect $\\sim$70 lensed Type IIn supernova per year with LSST. By modelling a similar UV deficit to that seen in superluminous supernovae, we recover 60 - 80% of the detections obtained using a pure blackbody model, of which $\\sim$10 detections per year are sufficiently bright ($m\\_\\textrm{i} < 22.5$ mag) and detected early enough (> 5 observations before lightcurve peak) to enable high-cadence spectroscopic follow up.\n\n"}}