{"neutrino": {"2506.10767": "2025-06-12, **Impact of improved energy resolution on DUNE sensitivity in presence of a light sterile neutrino**, Sabila Parveen et.al., [2506.10767v1](http://arxiv.org/abs/2506.10767v1)\n\n The Deep Underground Neutrino Experiment (DUNE) primarily aims to measure the yet unknown parameters of the standard three neutrino framework, i.e., the determination of Dirac CP phase ($\\delta\\_{13}$), neutrino mass hierarchy (MH) and octant of $\\theta\\_{23}$. In the present work, we consider the standard three neutrino paradigm (referred to as the $(3+0)$ case) and beyond with an additional light sterile neutrino (referred to as the $(3+1)$ case). We consider two configurations : standard energy resolution as in DUNE Technical Design Report (TDR) and improved energy resolution and study the impact of energy resolution in the $(3+0)$ and $(3+1)$ cases. In general, inclusion of subdominant new physics effects spoils the sensitivities. However, improved energy resolution leads to enhancement in sensitivities to the three unknowns in both $(3+0)$ and $(3+1)$ cases.\n\n", "2506.10618": "2025-06-12, **Evading Dark Matter Bounds through NLSP-Assisted Freeze-Out with Long-Lived Signatures**, Sarif Khan et.al., [2506.10618v1](http://arxiv.org/abs/2506.10618v1)\n\n In this work, we explore a conversion-driven freeze-out scenario, where the next-to-lightest stable particle (NLSP) sets the dark matter (DM) abundance through the process ``NLSP SM $\\leftrightarrow$ DM SM\". Although DM is produced via a freeze-out mechanism, its interaction strength with the visible sector can range from weak to feeble couplings. This results in a vast, largely unexplored parameter space that evades current direct, indirect, and collider bounds, while remaining testable in the near future. We study this mechanism in the context of an alternative $U(1)\\_{B-L}$ model, where four chiral fermions are required to cancel gauge anomalies, unlike the usual case with three right-handed neutrinos. The observed relic abundance is successfully reproduced within this framework. The viable parameter space can be probed by future direct detection experiments, while remaining inaccessible to indirect searches. Our results show that the DM relic density is highly sensitive to the NLSP-SM interaction strength and the mass difference between the NLSP and DM, but not to the DM-SM direct interaction. For certain parameter choices, the NLSP decays to DM via two or three body processes involving an extra gauge boson and SM particles, leading to long-lived decays outside the CMS or ATLAS detectors at the LHC. In contrast, if the decay proceeds via a CP-odd Higgs, it occurs promptly within the detector. We investigate prospects for detecting such long-lived NLSPs at the proposed MATHUSLA detector, with similar expectations for the ongoing FASER experiment. Finally, we find that choosing arbitrarily small values of the gauge coupling or BSM fermionic mixing angle can violate successful BBN predictions.\n\n", "2506.10551": "2025-06-12, **Impact of angle-dependent recombination on neutrino energy reconstruction in LArTPCs**, J. Vences et.al., [2506.10551v1](http://arxiv.org/abs/2506.10551v1)\n\n The technology of Liquid Argon Time-Projection Chambers (LArTPC) plays a very important role in modern neutrino physics. It allows precise tracking and calorimetry in detectors with very large volume and mass. One important component of LArTPC calorimetric energy reconstruction is the electron-ion recombination effect.   Existing experiments have provided constraints to its empirical description, including an explicit dependence on the particle's angle with respect to the TPC's electric field.   In this paper we analyze the impact of angle-dependent recombination models on the reconstruction of neutrino energy in LArTPCs. We examine in detail the predictions of the existing models, showing that there is still considerable uncertainty for the angular dependence prediction at the low values of $dE/dx$ typical of minimum ionizing particles. We apply a simple correction to overcome unphysical predictions in the non-constrained energy loss regions and evaluate the consequences of that in the bias and linearity of electron neutrino energy responses, using generator-level and electron shower simulations for neutrino energies in the range of 0.5-5 GeV. Comparing prediction with and without angular-dependence, we observe an average energy bias between -0.9\\% at 0.5 GeV and -0.6\\% at 5 GeV. While small, these values are close to the typical requirement of 2\\% for the energy scale uncertainty of future experiments, and indicate the need to obtain actual experimental constraints at low $dE/dx$ and take the effect into account in order to achieve the best precision in future LAr TPC electron neutrino calorimetry.\n\n", "2506.09806": "2025-06-11, **Enhancing air-shower observations: Results from an IceCube Surface Array Prototype Station**, Megha Venugopal et.al., [2506.09806v1](http://arxiv.org/abs/2506.09806v1)\n\n The Surface Array Enhancement of the IceCube Neutrino Observatory is set to equip the existing surface cosmic-ray array of ice-Cherenkov detectors, IceTop, with radio antennas and scintillation detectors. This can lower the energy threshold of detection and increase the measurement accuracy of IceTop. The antenna readout uses a multiplicity trigger from the scintillation detectors. A fully functioning prototype station of the enhancement was deployed at the South Pole in 2020 and upgraded in 2023, and provides a pathway for the future IceCube-Gen2 surface array detector. Previous results include air-shower searches with existing data using traditional and machine learning methods and a preliminary estimation of $X\\_\\mathrm{max}$. The detection methods for radio involving multi-detector components are described and the latest results are presented.\n\n", "2506.09706": "2025-06-11, **Charged-current quasielastic neutrino scattering off nuclei with nucleon-nucleon short-range correlations**, Jian Liu et.al., [2506.09706v1](http://arxiv.org/abs/2506.09706v1)\n\n In recent years, many studies on neutrino-nucleus scattering have been carried out to investigate nuclear structures and the interactions between neutrinos and nucleons. This paper develops a charged-current quasielastic (CCQE) neutrino-nucleus scattering model to explore the nuclear mean-field dynamics and short-range correlation effects. In this model, the nuclear structure effect is depicted using the scaling function, while the neutrinonucleon interaction is represented by the elementary weak cross section. Results indicate that the double-differential cross section of scattered muon is influenced by the energy and momentum of nucleon in nuclei, and the total cross section depends primarily on the incident neutrino energy. Furthermore, incorporating short-range correlations yields the flux-integrated differential cross sections at high-T region producing larger values, a longer tail, and achieving better experimental consistency. It eventually elucidates the physical relationship between the neutrinonucleus scattering cross section and the variation in incident neutrino energy. The studies in this paper furnishes insights for the research of nucleon dynamics and provides detailed examinations of the neutrino-nucleus scattering mechanism.\n\n", "2506.09694": "2025-06-11, **Searching for sub-TeV IceCube neutrinos correlated to sub-threshold GW events**, Tista Mukherjee et.al., [2506.09694v1](http://arxiv.org/abs/2506.09694v1)\n\n The IceCube Neutrino Observatory is active in multi-messenger follow-ups of Gravitational Wave (GW) events. Since the release of the Gravitational Wave Transient Catalogue (GWTC)-2.1 by the LIGO-Virgo-KAGRA (LVK) collaboration, sub-threshold GW candidates have been made publicly available. However, they were not followed up in real-time to search for neutrino counterparts. For a deeper understanding of these sub-threshold candidates, archival searches are essential. Finding evidence for a neutrino counterpart will enhance the astrophysical significance of these sub-threshold GW candidates and improve their localisation. Additionally, it will aid in better understanding possible thresholds on specific GW parameters, beyond which the sub-threshold GW candidates could also be promising multi-messenger sources. Thus, the search contributes to the ongoing efforts to establish correlations between astrophysical neutrinos and GW sources. Here, we present the current status of this ongoing work with the IceCube neutrino data.\n\n", "2506.09492": "2025-06-11, **Improving the description of dimuon production in neutrino-nucleus collisions using the SACOT-$χ$ scheme**, Hannu Paukkunen et.al., [2506.09492v1](http://arxiv.org/abs/2506.09492v1)\n\n Dimuon production in deeply inelastic scattering between neutrinos and nuclei plays an important role in constraining the strange-quark parton distribution functions (PDFs). Here, we present a self-contained calculation of this process consisting of a next-to-leading order semi-inclusive charmed-hadron production in the SACOT-$\\chi$ general-mass variable-flavor-number scheme, followed by a semi-leptonic decay of the charmed hadron. We find that invoking the SACOT-$\\chi$ scheme introduces modifications up to $20 \\, \\%$ in comparison to our previous esimates, where only kinematic mass effects were considered through the slow-rescaling variable. We reiterate our earlier observation that the effective acceptance correction - typically used in global PDF fits as a simplifying approximation - depends on the perturbative order, PDFs, scales, and also on the treatment of heavy-quark effects. We find good agreement with the corresponding data from the NuTeV experiment.\n\n", "2506.09481": "2025-06-11, **Imaging systematics induced by galaxy sub-sample fluctuation: new systematics at second order**, Hui Kong et.al., [2506.09481v1](http://arxiv.org/abs/2506.09481v1)\n\n Imaging systematics refers to the inhomogeneous distribution of a galaxy sample caused by varying observing conditions and astrophysical foregrounds. Current mitigation methods correct the galaxy density fluctuations, caused by imaging systematics assuming that all galaxies in a sample have the same galaxy density fluctuations. Under this assumption, the corrected sample cannot perfectly recover the true correlation function. We name this effect sub-sample systematics. For a galaxy sample, even if its overall sample statistics (redshift distribution n(z), galaxy bias b(z)), are accurately measured, n(z), b(z) can still vary across the observed footprint. It makes the correlation function amplitude of galaxy clustering higher, while correlation functions for galaxy-galaxy lensing and cosmic shear do not have noticeable change. Such a combination could potentially degenerate with physical signals on small angular scales, such as the amplitude of galaxy clustering, the impact of neutrino mass on the matter power spectrum, etc. Sub-sample systematics, cannot be corrected using imaging systematics mitigation approaches that rely on the cross-correlation signal between imaging systematics maps and the observed galaxy density field. In this paper, we derive formulated expressions of sub-sample systematics, demonstrating its fundamental difference with other imaging systematics. We also provide several toy models to visualize this effect. Finally, we discuss the estimation and mitigation of sub-sample systematics, with a combination of synthetic source injection (SSI), analytical benchmarking on SSI, and self-organizing map.\n\n", "2506.09322": "2025-06-11, **Searching for beyond-Standard-Model solar neutrino interactions using directional detectors**, Anirudh Chandra Shekar et.al., [2506.09322v1](http://arxiv.org/abs/2506.09322v1)\n\n Micro-pattern gaseous detectors (MPGDs) are a class of technologies that enable the full three-dimensional spatial reconstruction of ionisation tracks from nuclear and electron recoils in gas. Anticipating near-future 30 m$^3$-scale time projection chambers with MPGD-based readout, we forecast the sensitivity of such directionally-sensitive low-energy recoil detectors to neutrino interactions beyond the Standard Model. We work in the framework of neutrino non-standard interactions (NSIs), and calculate the combined recoil energy-angle distributions of the electron recoil signal generated by solar neutrinos in atmospheric-pressure He:CF$\\_4$ gas. We estimate the expected exclusion limits that such an experiment could place on various NSI parameters, as well as the mass and coupling of a new light mediator that interacts with electrons and neutrinos. We find that with an achievable background reduction of around a factor of ten from current estimates for a 30 m$^3$ optical-readout detector using this gas mixture, sensitivity to NSI parameters would already approach Borexino's sensitivity. Directionality also allows for event-by-event neutrino energy reconstruction, which would provide a means to resolve some parameter degeneracies present in the modified neutrino cross section in this formalism. Our results strongly motivate the development of small-scale directionally-sensitive gas detectors for neutrino physics.\n\n"}, "dark matter": {"2506.10928": "2025-06-12, **Two coincidences are a clue: Probing a GeV-scale dark QCD sector**, Yi Chung et.al., [2506.10928v1](http://arxiv.org/abs/2506.10928v1)\n\n The similarity between dark matter and baryon energy densities suggests the existence of a dark sector analogous to the visible QCD sector. In addition, small-scale structure issues can be addressed by dark matter self-interactions with a cross section comparable to that of QCD. Both observations point to a GeV-scale dark QCD sector. In this letter, guided by these two coincidences, we investigate how a chiral dark QCD model with a MeV-scale dark photon can resolve the core-cusp problem. A potential third coincidence, associated with the latest measurement of $N\\_{\\rm eff}$ being lower than the Standard Model prediction, is also discussed. Current constraints leave a finite window in the parameter space, which can be tested by future experiments such as Gamma Factory.\n\n", "2506.10246": "2025-06-12, **Search for Primordial Black Holes from the International Space Station with the SQM-ISS detector**, Francesca Liberatori et.al., [2506.10246v1](http://arxiv.org/abs/2506.10246v1)\n\n In this paper we discuss the observational capabilities and sensitivity of the SQM-ISS detector to primordial black holes. The SQM-ISS experiment aims to detect slow, non relativistic massive particles within cosmic rays, using a detector on board the International Space Station. The device is designed to recognize the passage of highly penetrating and dense particles in a wide range of mass and charge states such as Strange Quark Matter (SQM). These particles, traveling at speeds typical of gravitationally bound objects in the galaxy - around 250 km/s - are also possible candidates of dark matter. The ability of SQM-ISS to identify penetrating, massive and slow-moving objects allows it also to be sensitive to the detection of primordial black holes. We discuss how black holes, traveling through the detector at velocities compatible with galactic orbital speeds, can be identified based on their interaction signatures.\n\n", "2506.10220": "2025-06-11, **Kinematic Confirmation of a Remarkable Linear Trail of Galaxies in the NGC 1052 Field, Consistent with Formation in a High-Speed Bullet Dwarf Collision**, Michael A. Keim et.al., [2506.10220v1](http://arxiv.org/abs/2506.10220v1)\n\n A unique linear trail of diffuse galaxies was recently identified in the NGC 1052 field. This trail includes the remarkable, ultra-diffuse galaxies DF2 and DF4 which lack dark matter and host unusually luminous globular clusters. It has been proposed that the trail formed via a high-speed collision between two gas-rich dwarf galaxies. This scenario predicts that the trail galaxies are kinematically connected and follow a specific trend in radial velocity as a function of position, based on the known velocities and positions of DF2 and DF4. To test this hypothesis, we measured radial velocities for seven additional galaxies on the trail. While the galaxies' low surface brightnesses presented observational challenges, we employ several methods to obtain measurements for galaxies with effective surface brightnesses up to 28.6 mag arcsec$^{-2}$, including a narrow slit placed over globular clusters and a novel wide slit mode on Keck/LRIS, as well as a 'light bucket' mode on Keck/KCWI. We find that five of our seven targets follow the precise velocity trend predicted by DF2 and DF4, to a degree with just a 2% chance of randomly occurring. Moreover, the trail galaxies' radial velocities are significantly higher than those of the NGC 1052 group, setting it apart as a separate, kinematically connected system. Our findings support the theory that this trail of galaxies, including DF2 and DF4, formed together in a single event. A 'bullet dwarf' collision remains the only known explanation for all the unusual properties of DF2, DF4, and the associated trail of galaxies.\n\n", "2506.10122": "2025-06-11, **A novel method to trace the dark matter density profile around supermassive black holes with AGN reverberation mapping**, Mayank Sharma et.al., [2506.10122v1](http://arxiv.org/abs/2506.10122v1)\n\n We propose a new method to determine the dark matter density profile in the vicinity of distant supermassive black holes (SMBH) using reverberation mapping measurements of active galactic nuclei (AGN). For some AGN, the mapping of multiple emission lines allows us to measure the enclosed mass within different radii from the central SMBH, which allows us to infer or constrain the dark matter density profile on sub-pc scales. We find that for five out of fourteen AGN in our identified sample, the observed enclosed mass grows with radii, hinting evidence for the presence of a dark matter component at the 1-2 $\\sigma$ level. For these sources, we find global evidence for a universal dark matter profile with a preferred radial steepness of index $\\gamma \\sim 1.6$, consistent with the scenario expected for a dark matter spike mildly relaxed by stellar heating processes. For the remaining AGN in our sample, we are able to derive upper limits on the dark matter density profile parameters. Interestingly, the strongest evidence for a dark matter component arises from the farthest object considered, 3C 390. This new method allows us to measure or constrain for the first time the dark matter density in the vicinity of extragalactic SMBHs, which is crucial to our understanding of the dynamics and nature of dark matter.\n\n", "2506.10070": "2025-06-11, **Light Dark Matter Detection with Sub-eV Transition-Edge Sensors**, Muping Chen et.al., [2506.10070v1](http://arxiv.org/abs/2506.10070v1)\n\n We present a comprehensive analysis of high-resolution transition-edge sensors (TESs) as a quantum sensing platform for detecting dark matter (DM). Operating near the thermodynamic noise limit with sub-eV energy resolution, TESs offer a powerful approach for probing light DM in the sub-GeV mass range. Optical TESs, realized on superconducting films with critical temperatures below 150 mK, achieve energy thresholds below 100 meV and enable precise calorimetric detection of individual energy depositions. We model TES response by incorporating fundamental noise sources and applying optimal filtering techniques, and evaluate their sensitivity across a range of DM interaction channels, accounting for in-medium effects in the target material. We show that even ng-month-scale exposures can reach previously unexplored DM-electron scattering cross sections below $10^{-27}$ cm$^2$ for sub-MeV masses, and can probe the MeV-scale mass range for DM-nucleon couplings. Combining high energy resolution, photon-number sensitivity, and scalability, optical TESs provide a compelling quantum sensing platform for rare-event searches at the intersection of particle physics and quantum metrology.\n\n", "2506.09819": "2025-06-11, **Is non-zero equation of state of dark matter favored by DESI DR2?**, Tian-Nuo Li et.al., [2506.09819v1](http://arxiv.org/abs/2506.09819v1)\n\n The nature of dark matter remains one of the most fundamental and unresolved questions in modern cosmology. In most cosmological models, dark matter is typically modeled as pressureless dust with an equation of state (EoS) parameter $w\\_{\\rm dm} = 0$. However, there is no fundamental theoretical reason to exclude the possibility of a non-zero dark matter EoS parameter. In this work, we explore the possibility of a non-zero dark matter EoS within the phenomenologically emergent dark energy (PEDE) model, given its simplicity and proven ability to alleviate the Hubble tension. We perform observational constraints by using the latest baryon acoustic oscillation data from DESI DR2, the cosmic microwave background (CMB) data from Planck, and the type Ia supernova data from DESY5 and PantheonPlus. From our analysis, we observe that a negative dark matter EoS parameter is preferred in all scenarios. Specifically, the CMB+DESI+DESY5 data yields $w\\_{\\mathrm{dm}} = -0.00093 \\pm 0.00032$, deviating from zero at approximately the $3\\sigma$ level. However, this deviation is likely driven by unidentified systematics or inconsistencies in the DESY5 data, with the deviation decreasing to $2\\sigma$ when using PantheonPlus data. Meanwhile, a negative $w\\_{\\rm dm}$ would increase the Hubble tension due to the positive degeneracy between $w\\_{\\rm dm}$ and $H\\_0$. Furthermore, Bayesian evidence suggests that the $\\Lambda$CDM model is strongly preferred over the PEDE+$w\\_{\\rm dm}$ model. These analyses illustrate that it is not possible to both support a non-cold dark matter component within the PEDE model and alleviate the Hubble tension simultaneously.\n\n", "2506.09744": "2025-06-11, **Distinguishing Monochromatic Signals in LISA and Taiji: Ultralight Dark Matter versus Gravitational Waves**, Heng-Tao Xu et.al., [2506.09744v1](http://arxiv.org/abs/2506.09744v1)\n\n Ultralight dark matter (ULDM) is an attractive candidate for cold dark matter, one of the main mysterious components of the Universe. Recent studies suggest that gravitational-wave (GW) laser interferometers can also detect bosonic ULDM fields, which would produce monochromatic signals resembling those from gravitational waves (GWs). Distinguishing between these potential origins therefore would be essential. In this work, we develop a method to address this challenge for space-based GW interferometers (such as LISA and Taiji) by utilizing the null-response channel (NRC) in interferometric combinations, a channel constructed to have zero response to a specific type of source from a given direction. We find that while the GW NRC remains blind to GWs from a specific direction, it still responds to ULDM, particularly at frequencies above the interferometer's critical frequency. The ULDM NRC exhibits similar behavior. Based on these observations, we outline a test procedure to discriminate between signal origins. Our method provides a new diagnostic tool for analyzing monochromatic signals in space-based GW interferometers, potentially expanding the scientific scope of future missions.\n\n", "2506.09511": "2025-06-11, **Spatial and Pulse Efficiency Constraints in Atom Interferometric Gravitational Wave Detectors**, Patrik Schach et.al., [2506.09511v1](http://arxiv.org/abs/2506.09511v1)\n\n Currently planned and constructed terrestrial detectors for gravitational waves and dark matter based on differential light-pulse atom interferometry are designed around three primary strategies to enhance their sensitivity: (i) Resonant-mode enhancement using multiple diamonds, (ii) large-momentum-transfer techniques to increase arm separation within the interferometer, and (iii) very-long baseline schemes that increase the distance between the two interferometers. Both resonant-mode enhancement and large-momentum-transfer techniques result in a greater number of light pulses, making high pulse fidelity during atom-light interactions imperative. At the same time, increasing the number of diamonds in vertical configurations leads to taller atomic fountains, which consequently reduces the available distance between interferometers. As a result, the number of diamonds, large-momentum-transfer pulses, and the fountain height are interdependent parameters that must be carefully balanced. In this work, we present optimal configurations for multi-diamond geometries, explicitly accounting for the spatial extent of a single interferometer, considering constraints imposed by the baseline dimensions and atomic losses due to imperfect pulses. We provide practical analytical relations to estimate the optimal number of pulses that should be applied. Many proposals beyond demonstrator experiments require pulse numbers that demand efficiencies not yet demonstrated with state-of-the-art momentum transfer techniques. As a result, the observed sensitivity falls short of expectations - an effect caused by both arm separation and atom loss per pulse - highlighting the urgent need for research aimed at improving pulse fidelities.\n\n"}, "supernova": {"2506.10700": "2025-06-12, **SN 2023xgo: Helium rich Type Icn or Carbon-Flash Type Ibn supernova?**, Anjasha Gangopadhyay et.al., [2506.10700v1](http://arxiv.org/abs/2506.10700v1)\n\n We present observations of SN 2023xgo, a transitional Type Ibn/Icn SN, from $-5.6$ to 63 days relative to $r$-band peak. Early spectra show CIII $\\lambda$5696 emission like Type Icn SNe, shifting to Type Ibn features. The He I velocities (1800-10000 km s$^{-1}$) and pseudo-equivalent widths are among the highest in the Ibn/Icn class. The light curve declines at 0.14 mag d$^{-1}$ until 30 days, matching SNe Ibn/Icn but slower than fast transients. SN 2023xgo is the faintest in our SN Ibn sample (M$\\_{r}$ = -17.65 $\\pm$ 0.04) but shows typical colour and host properties. Semi-analytical modelling of the light curve suggests a compact CSM shell (10$^{12}$-10$^{13}$ cm), mass-loss rate between 10$^{-4}$-10$^{-3}$ M$\\_{\\odot}$ yr$^{-1}$ with CSM and ejecta masses of $\\sim$0.22 and 0.12 M$\\_{\\odot}$, respectively. Post-maximum light-curve, spectral modelling favours a $\\sim$3 M$\\_{\\odot}$ helium star progenitor with extended ($\\sim$10$^{15}$ cm), stratified CSM (density exponent of 2.9) and mass-loss rate of 0.1-2.7 M$\\_{\\odot}$ yr$^{-1}$. These two mass-loss regimes imply a radially varying CSM, shaped by asymmetry or changes in the progenitors mass loss over time. This mass-loss behavior fits both binary and single-star evolution. Early Icn-like features stem from hot carbon ionization, fading to Ibn-like with cooling. SN 2023xgo thus offers rare insight into the connection between SNe Icn, Ibn, and SNe Ibn with ejecta signatures.\n\n", "2506.09819": "2025-06-11, **Is non-zero equation of state of dark matter favored by DESI DR2?**, Tian-Nuo Li et.al., [2506.09819v1](http://arxiv.org/abs/2506.09819v1)\n\n The nature of dark matter remains one of the most fundamental and unresolved questions in modern cosmology. In most cosmological models, dark matter is typically modeled as pressureless dust with an equation of state (EoS) parameter $w\\_{\\rm dm} = 0$. However, there is no fundamental theoretical reason to exclude the possibility of a non-zero dark matter EoS parameter. In this work, we explore the possibility of a non-zero dark matter EoS within the phenomenologically emergent dark energy (PEDE) model, given its simplicity and proven ability to alleviate the Hubble tension. We perform observational constraints by using the latest baryon acoustic oscillation data from DESI DR2, the cosmic microwave background (CMB) data from Planck, and the type Ia supernova data from DESY5 and PantheonPlus. From our analysis, we observe that a negative dark matter EoS parameter is preferred in all scenarios. Specifically, the CMB+DESI+DESY5 data yields $w\\_{\\mathrm{dm}} = -0.00093 \\pm 0.00032$, deviating from zero at approximately the $3\\sigma$ level. However, this deviation is likely driven by unidentified systematics or inconsistencies in the DESY5 data, with the deviation decreasing to $2\\sigma$ when using PantheonPlus data. Meanwhile, a negative $w\\_{\\rm dm}$ would increase the Hubble tension due to the positive degeneracy between $w\\_{\\rm dm}$ and $H\\_0$. Furthermore, Bayesian evidence suggests that the $\\Lambda$CDM model is strongly preferred over the PEDE+$w\\_{\\rm dm}$ model. These analyses illustrate that it is not possible to both support a non-cold dark matter component within the PEDE model and alleviate the Hubble tension simultaneously.\n\n", "2506.09734": "2025-06-11, **AMUSE-Antlia. II. Intracluster X-ray Population in the Antlia Cluster**, Zhensong Hu et.al., [2506.09734v1](http://arxiv.org/abs/2506.09734v1)\n\n We conduct a systematic survey of X-ray sources in the inner ($r\\sim200$ kpc) region of the Antlia cluster based on \\Chandra observations, down to a source detection limit of $ L(0.5\\text{--}8\\ \\mathrm{keV})\\sim4.2\\times10^{-7}\\ \\mathrm{ph\\ cm^{-2}\\ s^{-1}}$ ($2\\times10^{38}\\ \\mathrm{erg\\ s^{-1}}$). We present an X-ray source catalog with 202 sources and provide their coordinates, multi-band flux information and hardness ratios. We find a statistically significant excess at a significance level of $4.2\\sigma$ with 37.6 excess sources beyond three times the mean effective radius of the two BCGs. This implies that these excess sources could be a genuine intracluster X-ray population that is not associated with the bulk stellar component. Also, the increased number of excess sources in the fields containing a BCG implies a potential connection between the excess sources and BCGs. The discovery of these sources in the Antlia cluster, together with previous research of similar findings in other two nearby clusters, Virgo and Fornax, indicates that the intracluster X-ray population could be universal in nearby galaxy clusters. Furthermore, we discuss the candidate origins of the excess sources, including low-mass X-ray binaries (LMXBs) associated with intracluster light (ICL-LMXBs), LMXBs in globular clusters (GC-LMXBs) and supernova-kicked LMXBs (SN-kicked LMXBs). We estimate the contribution of ICL-LMXBs, which should include the LMXBs relating with the stellar halo surrounding BCGs, are unlikely to dominate the intracluster X-ray population in Antlia. Meanwhile, GC-LMXBs and SN-kicked LMXBs, each component could contribute $\\sim30\\%$ to the total excess sources.\n\n"}}