{"neutrino": {"2410.02723": "2024-10-03, **Looking for WIMPs through the neutrino fogs**, Itay M. Bloch et.al., [2410.02723v1](http://arxiv.org/abs/2410.02723v1)\n\n We revisit the expected sensitivity of large-scale xenon detectors to Weakly Interacting Massive Particles (WIMPs). Assuming current primary noise sources can be mitigated, we find that with the present discrimination power between nuclear and electron recoils, the experimental sensitivity is limited not only by atmospheric neutrinos' nuclear recoils (''nuclear recoil neutrino fog'') but also by solar neutrinos' electron-recoil events (''electron recoil neutrino fog''). While this is known by experimentalists, it is often missed or misunderstood by theorists, and we therefore emphasize this effect. We set up a realistic detector simulation to quantify the contamination of the WIMP signal from both these neutrino backgrounds. We observe that the electron-recoil background remains significant even for signal rates exceeding those of atmospheric neutrinos, as predicted by most electroweak WIMP candidates. We update the projections for the required exposure to exclude/discover a given electroweak WIMP, streamlining the computation of their signal rates and uncertainties. We show that all of the real WIMPs with zero hypercharge can be excluded (discovered) with a 50 tonne year (300 tonne year) exposure. A similar exposure will allow to probe a large portion of the viable parameter space for complex WIMP with non-zero hypercharge.\n\n", "2410.02421": "2024-10-03, **Search for lepton number violating decays of $D_s^+\\to h^-h^0e^+e^+$**, BESIII Collaboration et.al., [2410.02421v1](http://arxiv.org/abs/2410.02421v1)\n\n Based on 7.33 fb$^{-1}$ of $e^+e^-$ collision data collected by the BESIII detector operating at the BEPCII collider at center-of-mass energies from 4.128 to 4.226 GeV, a search for the Majorana neutrino $\\nu\\_m$ is conducted in the lepton-number-violating decays of $D\\_s^+\\to h^-h^0e^+e^+$. Here, $h^-$ represents a $K^-$ or $\\pi^-$, and $h^0$ represents a $\\pi^0$, $K\\_S^0$ or $\\phi$. No significant signal is observed, and the upper limits of their branching fractions at the 90\\% confidence level are determined to be $\\mathcal{B}(D\\_s^+\\to \\phi\\pi^-e^+e^+) < 6.9 \\times 10^{-5}$, $\\mathcal{B}(D\\_s^+\\to \\phi K^-e^+e^+) < 9.9 \\times 10^{-5}$, $\\mathcal{B}(D\\_s^+\\to K\\_S^0\\pi^-e^+e^+) < 1.3 \\times 10^{-5}$, $\\mathcal{B}(D\\_s^+\\to K\\_S^0K^-e^+e^+) < 2.9 \\times 10^{-5}$, $\\mathcal{B}(D\\_s^+\\to \\pi^-\\pi^0e^+e^+) < 2.9 \\times 10^{-5}$ and $\\mathcal{B}(D\\_s^+\\to K^-\\pi^0e^+e^+) < 3.4 \\times 10^{-5}$. The Majorana neutrino is searched for with different mass assumptions within the range [0.20, 0.80] GeV$/c^2$ in the decay of $D\\_s^+\\to\\phi e^+\\nu\\_m$ with $\\nu\\_m\\to\\pi^-e^+$, and the upper limits of the branching fractions at the 90\\% confidence level are at the level of $10^{-5}-10^{-2}$, depending on the mass of the Majorana neutrino.\n\n", "2410.02380": "2024-10-03, **Long-term Monte Carlo based neutrino-radiation viscous-hydrodynamics simulations for a merger remnant black hole-torus system**, Kyohei Kawaguchi et.al., [2410.02380v1](http://arxiv.org/abs/2410.02380v1)\n\n We present our new general relativistic Monte Carlo (MC)-based neutrino radiation hydrodynamics code designed to solve axisymmetric systems with several improvements. The main improvements are as follows: (i) the development of an extended version of the implicit MC method for multi-species radiation fields; (ii) modeling of neutrino pair process rates based on a new numerically efficient and asymptotically correct fitting function for the kernel function; (iii) the implementation of new numerical limiters on the radiation-matter interaction to ensure a stable and physically correct evolution of the system. We apply our code to a black hole (BH)-torus system with a BH mass of $3\\,M\\_\\odot$, BH dimmensionless spin of 0.8, and a torus mass of $0.1\\,M\\_\\odot$, which mimics a post-merger remnant of a binary neutron star merger in the case that the massive neutron star collapses to a BH within a short time scale ($\\sim10\\,{\\rm ms}$). We follow the evolution of the BH-torus system up to more than $1\\,{\\rm s}$ with our MC-based radiation viscous-hydrodynamics code that dynamically takes into account non-thermal pair process. We find that the system evolution and the various key quantities, such as neutrino luminosity, ejecta mass, torus $Y\\_e$, and pair annihilation luminosity, are broadly in agreement with the results of the previous studies. We also find that the $\\nu\\_e{\\bar \\nu}\\_e$ pair annihilation can launch a relativistic outflow for a time scale of $\\sim 0.1\\,{\\rm s}$, and it can be energetic enough to explain some of short-hard gamma-ray bursts and the precursors. Finally, we calculate the indicators of the fast flavor instability directly from the obtained neutrino distribution functions, which indicate that the instability can occur particularly near the equatorial region of the torus.\n\n", "2410.02216": "2024-10-03, **Multi-wavelength and Multi-messenger Counterparts of Fast Radio Bursts**, Bing Zhang et.al., [2410.02216v1](http://arxiv.org/abs/2410.02216v1)\n\n Fast radio bursts are brief, highly dispersed bursts detected in the radio band, originating from cosmological distances. The only such event detected in the Milky Way galaxy, FRB 20200428DD, was associated with an X-ray burst emitted by a magnetar named SGR J1935+2154, revealing the first case of a multi-wavelength counterpart of an FRB. Counterparts in other wavelengths accompanying or following FRBs, as well as the bright emission associated with the progenitor of the FRB engine, have been proposed in various FRB models, but no robust detection has been made so far. In general, FRBs as we know them are not favorite multi-messenger emitters. Nonetheless, possible neutrino and gravitational wave emission signals associated with FRBs or FRB-like events have been discussed in the literature. Here I review these suggested multi-wavelength and multi-messenger counterparts of FRBs or FRB-like events and the observational progress in searching for these signals. The topics include multi-wavelength (X-rays, $\\gamma$-rays, optical) emission and neutrino emission from FRBs within the framework of the magnetar source models and possible FRB-like events associated with gravitational waves.\n\n", "2410.02119": "2024-10-03, **Astroparticles from X-ray Binary Coronae**, Ke Fang et.al., [2410.02119v1](http://arxiv.org/abs/2410.02119v1)\n\n The recent observation of high-energy neutrinos from the Galactic plane implies an abundant population of hadronic cosmic-ray sources in the Milky Way. We explore the role of the coronae of accreting stellar-mass black holes as such astroparticle emitters. We show that the particle acceleration and interaction timescales in the coronal region are tied to the compactness of the X-ray source. Thus, neutrino emission processes may similarly happen in the cores of active galactic nuclei and black hole X-ray binaries (XRB), despite of their drastically different masses and physical sizes. We apply the model to the well-measured XRB Cygnus X-1 and find that the cascaded gamma rays accompanying the neutrino emission naturally explain the GeV emission that only presents during the source's hard state. We show that XRB coronae could contribute significantly to the Galactic cosmic-ray and Galactic plane neutrino fluxes. Our model predicts variable high-energy neutrino emission from bright Galactic XRBs that may be observed by IceCube and future neutrino observatories.\n\n"}, "dark matter": {"2410.02663": "2024-10-03, **The three phases of self-gravitating scalar field ground states**, Anthony E. Mirasola et.al., [2410.02663v1](http://arxiv.org/abs/2410.02663v1)\n\n It is generally assumed that scalar field dark matter halos would contain solitonic cores -- spherically symmetric ground state configurations -- at their centers. This is especially interesting in the case of ultralight dark matter (ULDM), where the solitons sizes are on the order of galaxies. In this work, we show that the paradigm of a spherically symmetric soliton embedded in the center of each halo is not universally valid in a scenario with multiple interacting scalar fields. In particular, sufficiently strong repulsive interspecies interactions make the fields immiscible. In such models, the ground state configuration can fall into a number of different phases that depend on the fields' relative densities, masses, and interaction strengths. This raises the possibility that the inner regions of ULDM halos are more complex and diverse than previously assumed.\n\n", "2410.02662": "2024-10-03, **Slow it down: axion-photon conversion down to the non-relativistic regime**, Clemente Smarra et.al., [2410.02662v1](http://arxiv.org/abs/2410.02662v1)\n\n In the presence of a magnetic field, axions can convert into photons and viceversa. The phenomenology of the conversion is captured by a system of two coupled Klein-Gordon equations, which, assuming that the axion is relativistic, is usually recast into a pair of first order Schr\\\"odinger-like equations. In such a limit, focusing on a constant magnetic field and plasma frequency, the equations admit an exact analytic solution. The relativistic limit significantly simplifies the calculations; therefore, it is widely used in phenomenological applications. In this work, we discuss how to evaluate the axion-photon system evolution without relying on such relativistic approximation. In particular, we give an exact analytical solution, valid for any axion energy, in the case that both the magnetic field and plasma frequency are constant. Moreover, we devise an analytic perturbative expansion that allows for tracking the conversion probability in a slightly inhomogeneous magnetic field or plasma frequency, whose characteristic scale of variation is much larger than the typical axion-photon oscillation length. Finally, we discuss a case of resonant axion-photon conversion giving useful simplified formulae that might be directly applied to dark matter axions converting in neutron star magnetospheres.\n\n", "2410.02591": "2024-10-03, **Primordial Black Hole Mergers as Probes of Dark Matter in Galactic Center**, Qianhang Ding et.al., [2410.02591v1](http://arxiv.org/abs/2410.02591v1)\n\n Primordial black holes (PBHs) from the early Universe that can contribute to dark matter (DM) abundance have been linked to gravitational wave observations. Super-massive black holes (SMBHs) at the centers of galaxies are expected to modify distribution of DM in their vicinity, and can result in highly concentrated DM spikes. We revisit PBH merger rates in the presence of DM spikes, tracking their history. We find novel peaked structure in the redshift-evolution of PBH merger rates at low redshifts around $z \\sim 5$. These effects are generic and are present for distinct PBH mass functions and spike profiles, and also can be linked to peaked structure in redshift evolution of star formation rate. Redshift evolution characteristics of PBH merger rates can be distinguished from astrophysical black hole contributions and observable with gravitational waves, enabling them to serve as probes of DM in galactic centers.\n\n", "2410.02574": "2024-10-03, **LMC Calls, Milky Way Halo Answers: Disentangling the Effects of the MW--LMC Interaction on Stellar Stream Populations**, Richard A. N. Brooks et.al., [2410.02574v1](http://arxiv.org/abs/2410.02574v1)\n\n The infall of the LMC into the Milky Way (MW) has dynamical implications throughout the MW's dark matter halo. We study the impact of this merger on the statistical properties of populations of simulated stellar streams. Specifically, we investigate the radial and on-sky angular dependence of stream perturbations caused by the direct effect of stream-LMC interactions and/or the response of the MW dark matter halo. We use a time-evolving MW--LMC simulation described by basis function expansions to simulate streams. We quantify the degree of perturbation using a set of stream property statistics including the misalignment of proper motions with the stream track. In the outer halo, direct stream--LMC interactions produce a statistically significant effect, boosting the fraction of misaligned proper motions by ~25% compared to the model with no LMC. Moreover, there is on-sky angular dependence of stream perturbations:~the highest fractions of perturbed streams coincide with the same on-sky quadrant as the present-day LMC location. In the inner halo, the MW halo dipole response primarily drives stream perturbations, but it remains uncertain whether this is a detectable signature distinct from the LMC's influence. For the fiducial MW--LMC model, we find agreement between the predicted fraction of streams with significantly misaligned proper motions, $\\bar{\\vartheta}>10^{\\circ}$, and Dark Energy Survey data. Finally, we predict this fraction for the Vera Rubin Large Synoptic Survey Telescope (LSST) footprint. Using LSST data will improve our constraints on dark matter models and LMC properties as it is sensitive to both.\n\n", "2410.02411": "2024-10-03, **Gravitational Lensing of Euler-Heisenberg Black Hole Surrounded by Perfect Fluid Dark Matter**, Ping Su et.al., [2410.02411v1](http://arxiv.org/abs/2410.02411v1)\n\n In this work, we study the gravitating lensing Euler-Heisenberg black hole surrounded by perfect fluid dark matter. This kind of black hole solution enables us to investigate the nontrivial interplay between the dark matter effects and nonlinear electrodynamics effects (or quantum electrodynamics effects). The important observable in gravitational lensing observations are calculated and discussed, including the gravitational deflection angle of light, time delay of light, precession angle of massive orbit's bound orbits, and black hole shadow radius. The results indicates that the Euler-Heisenberg black hole with a negative perfect fluid dark matter parameter ($\\lambda\\_{\\text{DM}} < 0$) could greatly intensify the gravitational deflection angle of light, time delay of light and precession angle of massive object's bound orbit, while the nonlinear electrodynamics effects do not have large influences on these gravitational lensing observables.   Keywords: Euler Heisenberg Black Hole; Gravitational Lensing; Perfect Fluid Dark Matter; Nonlinear Electrodynamics\n\n", "2410.02261": "2024-10-03, **Constructing Viable Interacting Dark Matter and Dark Energy Models: A Dynamical Systems Approach**, Ashmita et.al., [2410.02261v1](http://arxiv.org/abs/2410.02261v1)\n\n We study the evolution of $k=-1$ FLRW cosmological models for two interacting Dark Matter-Dark Energy Models using dynamical system analysis. Since we are interested in late time evolution, the sign of the interaction term is chosen such that it facilitates the transfer of energy from dark matter to dark energy. We also explore the $k=0$ invariant subspace of these models. We find that both these models have sectors which have a stable fixed point where we can recover an accelerating universe with a negative equation of state. This indicates these can be viable models for our universe. We also rule out certain sectors of these models because they do not give the correct late time observational features. We observe that although we start with a dust-like Dark Matter, its effective equation of state evolves due to its interaction with Dark Energy. As a result, the Dark Matter can display features of stiff matter and exotic matter in the course of evolution.\n\n", "2410.02218": "2024-10-03, **First results from a search for axionlike dark matter using octupole-deformed nuclei in a crystal**, Mingyu Fan et.al., [2410.02218v1](http://arxiv.org/abs/2410.02218v1)\n\n Most of the matter in the universe is in the form of dark matter. However, dark matter has never been observed to interact with normal matter in laboratory experiments. ALPs -- ultralight axionlike particles -- are a class of dark matter models that are consistent with astrophysical constraints, and produce measurable signatures in the form of oscillating violations of discrete symmetries in nuclei. We report the first results from a search for oscillating parity-odd time-reversal-odd nuclear moments of $^{153}$Eu ions in a crystal, which leads to an experimental constraint on the ALP-gluon coupling strength across a wide band of ALP masses.\n\n", "2410.02161": "2024-10-03, **The calibrations of DAMPE $γ$-ray effective area**, Zhao-Qiang Shen et.al., [2410.02161v1](http://arxiv.org/abs/2410.02161v1)\n\n The DArk Matter Particle Explorer (DAMPE) is a cosmic-ray detector as well as a pair-converting $\\gamma$-ray telescope. The effective area, reflecting the geometrical cross-section area, the $\\gamma$-ray conversion probability and the photon selection efficiency, is important in the $\\gamma$-ray analyses. In the work, we find a significant time variation in the effective area, as large as $\\sim -4\\%/{\\rm yr}$ at 2 GeV for the high-energy trigger. We derive the data-based correction factors to the effective areas and apply corrections to both the effective areas and the exposure maps. The calibrated exposure can be $\\sim 12\\%$ smaller than the Monte Carlo one on average at 2 GeV. The calibration is further verified using the observation of the Vela pulsar, showing the spectral parameters with the correction are more consistent with those in the Fermi-LAT catalog than the ones without correction. All the corrections are now implemented in the latest version of the DAMPE $\\gamma$-ray analysis toolkit DmpST.\n\n"}, "supernova": {"2410.02586": "2024-10-03, **Chemo-dynamical abundance analysis of the very metal-poor halo star HE 2315-4240**, Xinuo Wang et.al., [2410.02586v1](http://arxiv.org/abs/2410.02586v1)\n\n Learning about the chemical evolution of the universe is crucial to understanding the formation of the first stars and structure formation in the early universe. To find out how elements are produced via nucleosynthesis and how their relative amounts have evolved with time, abundance trends of stars with different metallicities can be established and compared. In this study, we present a spectrum of a very metal-poor star, HE 2315$-$4240, with [Fe/H] = $-$2.89 based on a Magellan/MIKE high-resolution visual light spectrum. The star has a radial velocity of +41.9 km s$^{-1}$, an effective temperature of 5181 K, a surface gravity of 2.24 dex, and a microturbulence of 1.61 km s$^{-1}$. The $\\alpha$-elements and the iron peak elements agree well with the abundance trend. The low abundance of [Sr/Ba] and [C/Fe] suggests that HE 2315$-$4240 is accreted and formed in a dwarf galaxy. The value of [Ba/Eu] suggests the operation of a limited r-process. The abundance pattern of [Mg/Fe] and [Si/Fe] in HE 2315$-$4240 and its metallicity indicated that the star is formed from the gas enriched by a Type II supernova of a massive Pop III star. The abundance pattern fits Population III supernova yields moderately. The star's kinematic behavior shows that the star has a retrograde orbit and is moving away from the galactic center and out of the galactic disk to the south, and although the star is located in the halo of the Milky Way, it didn't form in the Milky Way but was rather formed in a small dwarf galaxy that was later absorbed by the Milky Way.\n\n", "2410.02315": "2024-10-03, **Extragalactic fast X-ray transient from a weak relativistic jet associated with a Type Ic-BL supernova**, H. Sun et.al., [2410.02315v1](http://arxiv.org/abs/2410.02315v1)\n\n Massive stars end their life as core-collapse supernovae, amongst which some extremes are Type Ic broad-lined supernovae associated with long-duration gamma-ray bursts (LGRBs) having powerful relativistic jets. Their less-extreme brethren make unsuccessful jets that are choked inside the stars, appearing as X-ray flashes or low-luminosity GRBs. On the other hand, there exists a population of extragalactic fast X-ray transients (EFXTs) with timescales ranging from seconds to thousands of seconds, whose origins remain obscure. Known sources that contribute to the observed EFXT population include the softer analogs of LGRBs, shock breakouts of supernovae, or unsuccessful jets. Here, we report the discovery of the bright X-ray transient EP240414a detected by the Einstein Probe (EP), which is associated with the Type Ic supernova SN 2024gsa at a redshift of 0.401. The X-ray emission evolution is characterised by a very soft energy spectrum peaking at < 1.3 keV, which makes it distinct from known LGRBs, X-ray flashes, or low-luminosity GRBs. Follow-up observations at optical and radio bands revealed the existence of a weak relativistic jet that interacts with an extended shell surrounding the progenitor star. Located on the outskirts of a massive galaxy, this event reveals a new population of explosions of Wolf-Rayet stars characterised by a less powerful engine that drives a successful but weak jet, possibly owing to a progenitor star with a smaller core angular momentum than in traditional LGRB progenitors.\n\n"}}