{"neutrino": {"2511.07239": "2025-11-10, **Search for steady and flaring neutrino emission from cosmic sources using the complete ANTARES dataset**, ANTARES Collaboration et.al., [2511.07239v1](http://arxiv.org/abs/2511.07239v1)\n\n ANTARES, a neutrino detector located in the depths of the Mediterranean Sea, operated successfully for over 15 years before being decommissioned in 2022. The telescope offered an ideal vantage view of the Southern Sky and benefited from optimal water properties for enhanced angular resolution. This study makes use of data collected over the entire operational period of ANTARES to search for sources of high-energy cosmic neutrinos, considering both steady and flaring emission scenarios. First, a time-integrated search for high-energy neutrino clustering across the celestial sphere is conducted. The most significant accumulation is found at coordinates $(\\alpha, \\delta) =(200.5^\\circ\\, 17.7^\\circ)$ with a post-trial p-value equal to 0.38. A dedicated search in the Galactic Plane is also performed for extended sources, yielding no significant excess. Additionally, a list of potential neutrino sources are investigated. The blazar MG3 J225517+2409 is identified as the most significant object, yet the excess remains compatible with background fluctuations. A mild local excess of 2.4$\\sigma$ is found for the blazar TXS 0506+056. The full sky is also examined for the presence of flaring neutrino emissions. The most significant excess in this case corresponds to a $\\sim$4-day flare from the direction $(\\alpha, \\delta) = (141.3^\\circ\\, 9.8^\\circ)$, with a post-trial p-value of 0.30. Finally, the directions of sources highlighted in IceCube's time-dependent searches are investigated. Temporal overlaps between ANTARES and IceCube flares are identified for PKS 1502+106 and TXS 0506+056, with an estimated chance probability of about 0.02%, making this observation particularly noteworthy.\n\n", "2511.07227": "2025-11-10, **Prospects for geoneutrino detection with JUNO**, Thomas Adam et.al., [2511.07227v1](http://arxiv.org/abs/2511.07227v1)\n\n Geoneutrinos, which are antineutrinos emitted during the decay of long-lived radioactive elements inside Earth, serve as a unique tool for studying the composition and heat budget of our planet. The Jiangmen Underground Neutrino Observatory (JUNO) experiment in China, which has recently completed construction, is expected to collect a sample comparable in size to the entire existing world geoneutrino dataset in less than a year. This paper presents an updated estimation of sensitivity to geoneutrinos of JUNO using the best knowledge available to date about the experimental site, the surrounding nuclear reactors, the detector response uncertainties, and the constraints expected from the TAO satellite detector. To facilitate comparison with present and future geological models, our results cover a wide range of predicted signal strengths. Despite the significant background from reactor antineutrinos, the experiment will measure the total geoneutrino flux with a precision comparable to that of existing experiments within its first few years, ultimately achieving a world-leading precision of about 8% over ten years. The large statistics of JUNO will also allow separation of the Uranium-238 and Thorium-232 contributions with unprecedented precision, providing crucial constraints on models of formation and composition of Earth. Observation of the mantle signal above the lithospheric flux will be possible but challenging. For models with the highest predicted mantle concentrations of heat-producing elements, a 3-sigma detection over six years requires knowledge of the lithospheric flux to within 15%. Together with complementary measurements from other locations, the geoneutrino results of JUNO will offer cutting-edge, high-precision insights into the interior of Earth, of fundamental importance to both the geoscience and neutrino physics communities.\n\n", "2511.06924": "2025-11-10, **Exponential $f(R)$ cosmology with massive neutrinos as a dynamical dark energy framework**, Simone D'Onofrio et.al., [2511.06924v1](http://arxiv.org/abs/2511.06924v1)\n\n The exponential $f(R)$ gravity model provides a theoretically well-motivated extension of General Relativity, introducing a modified gravitational dynamics at late times consistent with a dynamical dark energy scenario, while recovering the $\\Lambda$CDM-like regime at high redshifts with a smooth transition. Using a Bayesian Markov Chain Monte Carlo (MCMC) analysis, we constrain the parameters of the exponential $f(R)$ model in combination with the total neutrino mass $\\sum m\\_\\nu$, employing the latest measurements from cosmic chronometers, the DESI DR2 BAO data, the CMB acoustic scale, and the Pantheon+ supernovae compilation, comparing the results with the $\\Lambda$CDM and the $w\\_0w\\_a$CDM models. Our results show that the exponential $f(R)$ model remains consistent with current observations while slightly alleviating the Hubble tension and the neutrino mass problem relative to $\\Lambda$CDM, although the constraints on $\\sum m\\_\\nu$ are tighter than those obtained for the phenomenological $w\\_0w\\_a$CDM scenario. These results indicate that the interplay between modified gravity and neutrino physics in the late Universe may offer a viable framework for further investigation of cosmological tensions.\n\n", "2511.06707": "2025-11-10, **Seyfert Galaxies as Neutrino Sources: An Outflow$-$Cloud Interaction Perspective**, Zhi-Peng Ma et.al., [2511.06707v1](http://arxiv.org/abs/2511.06707v1)\n\n Following the identification of the first confirmed individual neutrino source, Seyfert galaxies have emerged as the most prominent class of high-energy neutrino emitters. In this work, we perform a detailed investigation of the outflow--cloud interaction scenario for neutrino production in Seyfert nuclei. In this framework, fast AGN-driven winds collide with clumpy gas clouds in the nuclear region, forming bow shocks that efficiently accelerate cosmic-ray protons. The accelerated protons subsequently interact with cold protons from the outflows via inelastic proton--proton ($pp$) collisions, producing high-energy neutrinos, while the photomeson ($p\\gamma$) process with disk photons may provide a subdominant contribution at the highest energies. Applying this model to five neutrino-associated Seyfert galaxies, we successfully reproduce the observed TeV neutrino fluxes without violating existing gamma-ray constraints. By integrating over the Seyfert population using X-ray luminosity functions, we further demonstrate that Seyfert galaxies can account for a substantial fraction of the diffuse astrophysical neutrino background in the $10^4-10^5~{\\rm GeV}$ energy range.\n\n", "2511.06355": "2025-11-09, **Flavored QCD axion and Modular invariance**, Yang Hwan Ahn et.al., [2511.06355v1](http://arxiv.org/abs/2511.06355v1)\n\n A four-dimensional effective model with $G\\_{\\rm SM}\\times SL(2,\\mathbb{Z}) \\times U(1)\\_X$ is proposed in string-derived supergravity framework, where $G\\_{\\rm SM}$ is the Standard Model (SM) gauge group and $U(1)\\_X$ is gauged. We show $SL(2,\\mathbb{Z})$- and $U(1)\\_X$-mixed anomalies should vanish. Anomalies induced by K{\\\"a}hler transformations match those from gaugino chiral rotations. When SM fermions transform nontrivially under $SL(2,\\mathbb{Z})$, and with vanishing gaugino contributions, the anomaly-free conditions are powerful enough to determine the quark and lepton flavor structures, set scales for $U(1)\\_X$ breaking, and ensure the strong CP phase remains unmodified. While the Green-Schwarz coefficient $\\delta^{\\rm GS}\\_X$ is generically non-zero, vanishing $U(1)\\_X$ anomalies cause gauge boson decoupling and $\\delta^{\\rm GS}\\_X\\rightarrow 0$, yielding a massless global $U(1)\\_X$ without a Nambu-Goldstone mode. We show that the modulus vacuum expectation value stabilizes near $\\langle\\tau\\rangle \\approx i$, where exact $SL(2,\\mathbb{Z})$ ($T$-duality) is spontaneously broken, removing residual modular symmetry. The framework predicts seesaw-generated neutrino masses and flavored axion properties, with all Yukawa coefficients constrained to unit-magnitude complex numbers. Our model reproduces current quark and lepton data, predicts an axion mass $m\\_a=1.82\\times10^{-4}$ eV and photon coupling $\\|g\\_{a\\gamma\\gamma}\\|=1.75\\times10^{-14}\\,{\\rm GeV}^{-1}$, and unlike the ordinary case, suppresses flavor-violating axion couplings to $s,d$ quarks and $\\mu,e$ leptons to $\\mathcal{O}(\\lambda^4)$ (with $\\lambda$ the Cabibbo angle). It also yields normal neutrino mass hierarchy consistent with oscillation data, $0\\nu\\beta\\beta$-decay rate, and cosmological and astrophysical measurements.\n\n"}, "dark matter": {"2511.06928": "2025-11-10, **Mock Observations for the CSST Mission: Multi-Channel Imager--The Cluster Field**, Yushan Xie et.al., [2511.06928v1](http://arxiv.org/abs/2511.06928v1)\n\n The Multi-Channel Imager (MCI), one of the instruments aboard the China Survey Space Telescope (CSST), is designed to simultaneously observe the sky in three filters, covering wavelengths from the near-ultraviolet (NUV) to the near-infrared (NIR). With its large field of view ($7.5^{\\prime}\\times7.5^{\\prime}$), MCI is particularly well-suited for observing galaxy clusters, providing a powerful tool for investigating galaxy evolution, dark matter and dark energy through gravitational lensing. Here we present a comprehensive simulation framework of a strong lensing cluster as observed by MCI, aiming to fully exploit its capabilities in capturing lensing features. The framework simulates a strong lensing cluster from the CosmoDC2 catalog, calculating the gravitational potential and performing ray-tracing to derive the true positions, shapes and light distribution of galaxies within the cluster field. Additionally, the simulation incorporates intra-cluster light (ICL) and spectral energy distributions (SEDs), enabling further strong lensing analyses, such as ICL seperation from galaxy light and mass reconstruction combining strong and weak lensing measurements. This framework provides a critical benchmark for testing the MCI data pipeline and maximizing its potential in galaxy cluster research.\n\n", "2511.06489": "2025-11-09, **Sub-GeV dark matter in neutron stars: halo morphologies and their suppression by vacuum-like pressure**, Loreany F. Araújo et.al., [2511.06489v1](http://arxiv.org/abs/2511.06489v1)\n\n We investigate neutron stars that contain a unified dark sector composed of cold, degenerate fermionic dark matter and a vacuum-like dark-energy component. Within a general-relativistic two-fluid framework that allows a covariantly conserved, gradient-driven energy exchange between baryons and the dark sector, we quantify how dark microphysics reshapes global structure when the total gravitational radius need not coincide with the luminous baryonic radius. Using a state-of-the-art baryonic equation of state, we explore the halo-forming mass range for fermionic dark matter with particle masses of 400 MeV and 1 GeV, and we characterize sequences by the difference between the total and luminous radii and by the fractional difference between the total and baryonic masses. We confirm established trends: lighter fermions typically support low-density halos that increase the total radius by several kilometers at nearly fixed mass, whereas masses near 1 GeV tend to shrink halos and make the two radii appreciably closer. Our central new result is that a percent-level vacuum-like admixture markedly reduces halo formation, shrinking the radius difference from several kilometers to sub-kilometer scales and the fractional mass difference to $\\lesssim 1\\%$. Combined gravitational-wave and X-ray observations offer a practical route to bound the halo size and the allowed vacuum-like fraction.\n\n", "2511.06329": "2025-11-09, **Natural Realization of Tens-of-GeV Dark Matter in the GNMSSM**, Fei Li et.al., [2511.06329v1](http://arxiv.org/abs/2511.06329v1)\n\n This study presents a comparative analysis of the Minimal Supersymmetric Standard Model (MSSM), the $Z\\_3$-symmetric Next-to-Minimal Supersymmetric Standard Model ($Z\\_3$-NMSSM), and the General Next-to-Minimal Supersymmetric Standard Model (GNMSSM), incorporating constraints from dark matter (DM) relic density, the LUX-ZEPLIN 2024 experiment (LZ 2024), Higgs data, and the Large Hadron Collider (LHC). The results suggest that, among the three frameworks, only GNMSSM can naturally accommodate for light DM with a mass below $100~{\\rm GeV}$. As such, the viable supersymmetry candidate is primarily Singlino-like. One key advantage of the GNMSSM is the effective decoupling between interactions that establish the relic density and those that control direct detection, allowing the model to satisfy all current experimental bounds simultaneously. We further explore two characteristic mass hierarchies in the GNMSSM parameter space, each exhibiting distinct phenomenological behaviors. The first hierarchy, $\\tilde{S} < \\tilde{B} < \\tilde{H}$ (Singlino--Bino--Higgsino), involves a relatively light Bino and allows the Higgsino mass parameter, $\\mu\\_{\\rm tot}$, to be as low as about $200~{\\rm GeV}$, naturally yielding light DM at tens of GeV. The dominant annihilation channels are then $\\tilde{\\chi}\\_1^0\\tilde{\\chi}\\_1^0 \\to A\\_sA\\_s$ in the $h\\_1$ scenario and $\\tilde{\\chi}\\_1^0\\tilde{\\chi}\\_1^0 \\to h\\_sA\\_s$ in the $h\\_2$ scenario, where $h\\_s$ and $A\\_s$ denote singlet-dominated CP-even and CP-odd Higgs bosons, respectively. The second hierarchy, $\\tilde{S} < \\tilde{H} < \\tilde{B}$, corresponds to a heavy Bino. In this case, although the DM phenomenology remains qualitatively similar, LHC constraints require $\\mu\\_{\\rm tot} \\gtrsim 900~{\\rm GeV}$, implying a significant degree of fine-tuning in reproducing the $Z$-boson mass.\n\n", "2511.06210": "2025-11-09, **Particle loads for cosmological simulations with equal-mass dark matter and baryonic particles**, Shihong Liao et.al., [2511.06210v1](http://arxiv.org/abs/2511.06210v1)\n\n Traditional cosmological hydrodynamical simulations usually assume equal-numbered but unequal-mass dark matter and baryonic particles, which can lead to spurious collisional heating due to energy equipartition. To avoid such a numerical heating effect, a simulation setup with equal-mass dark matter and baryonic particles, which corresponds to a particle number ratio of $N\\_{\\rm DM}:N\\_{\\rm gas} = \\Omega\\_{\\rm cdm} / \\Omega\\_{\\rm b}$, is preferred. However, previous studies have typically used grid-based particle loads to prepare such initial conditions, which can only reach specific values for $N\\_{\\rm DM}:N\\_{\\rm gas}$ due to symmetry requirements. In this study, we propose a method based on the glass approach that can generate two-component particle loads with more general $N\\_{\\rm DM}:N\\_{\\rm gas}$ ratios. The method simultaneously relaxes two Poisson particle distributions by introducing an additional repulsive force between particles of the same component. We show that the final particle load closely follows the expected minimal power spectrum, $P(k) \\propto k^{4}$, exhibits good homogeneity and isotropy properties, and remains sufficiently stable under gravitational interactions. Both the dark matter and gas components individually also exhibit uniform and isotropic distributions. We apply our method to two-component cosmological simulations and demonstrate that an equal-mass particle setup effectively mitigates the spurious collisional heating that arises in unequal-mass simulations. Our method can be extended to generate multi-component uniform and isotropic distributions. Our code based on Gadget-2 is available at https://github.com/liaoshong/gadget-2glass .\n\n"}, "supernova": {"2511.07394": "2025-11-10, **The position of SN 1987A**, C. Tegkelidis et.al., [2511.07394v1](http://arxiv.org/abs/2511.07394v1)\n\n The accurate positional measurement of Supernova (SN) 1987A is important for determining the kick velocity of its compact object and the velocities of the ejecta and various shock components. In this work, we perform absolute astrometry to determine the position of SN 1987A. We used multi-epoch Hubble Space Telescope imaging to model the early ejecta and the equatorial ring (ER). We combined our measurements and obtained the celestial coordinates in the International Celestial Reference System (ICRS) by registering the observations onto Gaia Data Release 3. The final average position of the different measurements is ${\\alpha = 5^{\\mathrm{h}}~ 35^{\\rm{m}}~ 27^{\\rm{s}}.9884(30)}$, ${\\delta = -69^{\\circ}~ 16'~ 11''.1134(136)}$ (ICRS J2016). The early ejecta position is located 14 mas south and 16 mas east of the ER center, with the offset being significant at 96% confidence. The offset may be due to instrument and/or filter-dependent systematics and registration uncertainties, though an intrinsic explosion offset relative to the ER remains possible. Image registration with proper motion corrections yields similar astrometry and a source proper motion of ${\\mu\\_{\\rm east} (\\equiv \\rm{PM\\_{\\alpha }*}) = 1.60 \\pm 0.15 ~\\rm{mas ~ yr^{-1}}}$ and ${\\mu\\_{\\rm{north}} (\\equiv \\rm{PM\\_{\\delta}}) = 0.44 \\pm 0.09~\\rm{mas ~ yr^{-1}}}$, in agreement with the typical local motion of the Large Magellanic Cloud. The absolute positional uncertainty of 21 mas adds a systematic uncertainty to the sky-plane kick velocity of ${123}~(t/40~\\rm{yr})^{-1}~\\rm{km~s}^{-1}$, where $t$ is the time since the explosion. Comparing the location of the compact source observed with JWST to our updated position implies a sky-plane kick of ${399\\pm148~\\mathrm{km~s^{-1}}}$ and a 3D kick of ${472\\pm126~\\mathrm{km~s^{-1}}}$, which is consistent with previous estimates.\n\n", "2511.06755": "2025-11-10, **Redshift-Frame Systematics and Their Impact on the Hubble Constant from Pantheon+ Supernovae**, Said Laaroua et.al., [2511.06755v1](http://arxiv.org/abs/2511.06755v1)\n\n We present a full-sky covariance-weighted analysis of redshift-frame consistency in the Pantheon+ Type~Ia supernova sample. Using 1,543 unique objects with heliocentric ($z\\_{\\rm HEL}$) and cosmic microwave background ($z\\_{\\rm CMB}$) redshifts, we quantify residual differences between frames. A statistically significant but physically small mean offset $\\langle z\\_{\\rm CMB} - z\\_{\\rm HEL} \\rangle = (-3.8 \\pm 0.1)\\times10^{-4}$ is found, exhibiting a sign reversal between low- and high-redshift subsets ($p = 3.8\\times10^{-15}$). A dipole fit to the residuals yields an amplitude $A = (1.5 \\pm 0.1)\\times10^{-3}$ directed toward $(\\mathrm{RA},\\mathrm{Dec}) = (167.1^\\circ, -1.6^\\circ)$, consistent within $1^\\circ$ of the CMB dipole. When propagated through a covariance-weighted Hubble fit, these effects shift the inferred Hubble constant by only $\\Delta H\\_0 = 0.07~\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$ (about $1.3\\%$ of the current Hubble tension). The recovered dipole aligns with the known solar motion relative to the CMB, validating the kinematic frame corrections in Pantheon+ and establishing a systematic floor for future bulk-flow searches.\n\n", "2511.06554": "2025-11-09, **Formation Channels of Magnetars**, Rui-Chong Hu et.al., [2511.06554v1](http://arxiv.org/abs/2511.06554v1)\n\n The formation channels of magnetars remain an open question. Although core collapse supernovae of isolated massive stars are important, binary interactions -- such as tidal interaction, common envelope evolution, and stellar mergers -- may also play a significant role in making magnetars. Understanding the relative contributions of these channels is crucial for linking magnetars to their observed properties and host environments. In this paper, we investigate potential magnetar formation channels using population synthesis simulations, considering both single-star and isolated binary system evolution. By conducting simulations with different parameters, we compare the effects of various evolution processes on magnetar formation. Additionally, we study the delay times and kick velocities across all formation channels, analyze the orbital properties and companion types of surviving magnetar binaries. We find that the majority of magnetars are observed as single objects ($\\geq 90\\%$), although a large fraction of them were originally in binary systems and experienced either kick disruption or merger. Surviving binaries are most likely to host main-sequence companions and exhibit different distributions of eccentricities due to different supernova mechanisms. These findings show the critical role of binary evolution in magnetar formation and provide predictions for the properties of magnetar populations that can be tested with future observations.\n\n", "2511.06332": "2025-11-09, **Bayesian and Machine-Learning Analyses of Nonminimal $f(Q)$ Gravity and $H_0$ Tension**, Simran Arora et.al., [2511.06332v1](http://arxiv.org/abs/2511.06332v1)\n\n In this study, the cosmological implications of nonminimally coupled $f(Q)$ gravity are examined within the metric-affine formalism, in which the nonmetricity scalar $Q$ couples directly to the matter Lagrangian. Within the symmetric teleparallel framework, a representative $f(Q)$ model is constructed, and the corresponding background cosmological equations are derived. The analysis aims to test whether this geometric formulation yields more consistent realizations of nonminimal matter-geometry couplings. A comprehensive statistical MCMC analysis is performed using cosmic chronometers, DESI BAO DR2, and Type Ia supernovae from the Pantheon+, DESY5, and Union3 samples. To complement the statistical study, we employ machine learning methods, such as linear regression, support vector regression (SVR), and random forest algorithms, to evaluate the predictive performance and robustness of the data. The results indicate that a partial alleviation of the $H\\_0$ tension can be achieved for a broad range of parameter choices. Nonetheless, $f(Q)$ gravity emerges as a promising and flexible framework for late-time cosmology, motivating further exploration of extended models consistent with all observations.\n\n"}}