{"neutrino": {"2510.08504": "2025-10-09, **Constraining the new contributions to electron $g-2$ in a radiative neutrino mass model**, Bayu Dirgantara et.al., [2510.08504v1](http://arxiv.org/abs/2510.08504v1)\n\n We examine electron and muon anomalous magnetic dipole moments within a radiative neutrino mass model featuring TeV-scale scalar leptoquarks $S(3,1,-1/3)$ and $R(3,2,1/6)$. We utilize textures with decoupling electron and muon sectors, so that both electron and muon anomalous magnetic dipole moments could receive internal chiral enhancements from different heavy up-type quarks while in the same time evading the stringent $\\mu\\to e\\gamma$ constraint. A successful fit to neutrino oscillation data requires the simultaneous presence of one- and two-loop neutrino mass contributions. This severely constrains the parameter space of the model, which results in a negligible new physics correction to the muon $g-2$. The electron $g-2$ discrepancy implied by the rubidium experiment, on the other hand, can be resolved within $2\\sigma$ uncertainty provided that neutrino mass ordering is inverted. Lepton-flavor-violating tau decay rates, such as $\\tau\\to e\\gamma$ and $\\tau\\to 3e$, are predicted to be within the sensitivities of next-generation experiments.\n\n", "2510.08437": "2025-10-09, **Beyond-the-Standard-Model Physics in the Neutrino Sector**, Kevin J. Kelly et.al., [2510.08437v1](http://arxiv.org/abs/2510.08437v1)\n\n Neutrino oscillations are a phenomenon that has been observed for over two decades and leads to the conclusion that neutrinos have mass. The Standard Model predicts massless neutrinos, and so neutrinos require physics beyond the Standard Model. Other signatures of BSM physics are detectable in modern neutrino facilities -- this chapter explores those possibilities. These can range from new effects modifying neutrino oscillations (beyond the expectations when neutrinos have mass), to searches for new particles in neutrino facilities. Next-generation experiments are particularly powerful for these searches due to high-intensity neutrino beams and novel detection technologies. We give an introduction to these search strategies, giving a non-comprehensive overview of the field as it stands presently.\n\n", "2510.08380": "2025-10-09, **Identification of low-energy kaons in the ProtoDUNE-SP detector**, DUNE Collaboration et.al., [2510.08380v1](http://arxiv.org/abs/2510.08380v1)\n\n The Deep Underground Neutrino Experiment (DUNE) is a next-generation neutrino experiment with a rich physics program that includes searches for the hypothetical phenomenon of proton decay. Utilizing liquid-argon time-projection chamber technology, DUNE is expected to achieve world-leading sensitivity in the proton decay channels that involve charged kaons in their final states. The first DUNE demonstrator, ProtoDUNE Single-Phase, was a 0.77~kt detector that operated from 2018 to 2020 at the CERN Neutrino Platform, exposed to a mixed hadron and electron test-beam with momenta ranging from 0.3 to 7~GeV/c. We present a selection of low-energy kaons among the secondary particles produced in hadronic reactions, using data from the 6 and 7~GeV/c beam runs. The selection efficiency is 1\\% and the sample purity 92\\%. The initial energies of the selected kaon candidates encompass the expected energy range of kaons originating from proton decay events in DUNE (below $\\sim$200~MeV). In addition, we demonstrate the capability of this detector technology to discriminate between kaons and other particles such as protons and muons, and provide a comprehensive description of their energy loss in liquid argon, which shows good agreement with the simulation. These results pave the way for future proton decay searches at DUNE.\n\n", "2510.08090": "2025-10-09, **Neutrinoless double beta decay in a supersymmetric left-right model**, Vivek Banerjee et.al., [2510.08090v1](http://arxiv.org/abs/2510.08090v1)\n\n Neutrinoless double beta ($0\\nu\\beta\\beta$) decay, an important low-energy process, serves not only as a potential test of the Majorana nature of neutrinos, but also as a sensitive probe for new physics beyond the Standard Model. In this study, the supersymmetric left-right model is explored to investigate its impact on $0\\nu\\beta\\beta$ decay. Although the process takes place at low energies as compared to the electroweak scale, it carries the potential to provide indirect hints about the parity-breaking scale $\\text{M}\\_R$. In this work, we formulate the decay amplitude using an effective field theory approach by separating long- and short-range contributions, each expressed in terms of dimensionless particle physics parameters and nuclear matrix elements. The analysis shows that the $\\text{M}\\_R$ must lie above $1$ TeV, and future experiments may push it beyond $4 - 5$ TeV region. Another important outcome of this work is the role played by the tentative dark matter candidates, the lightest neutralino and sneutrino, which contribute significantly to the half-life of $0\\nu\\beta\\beta$ decay. This suggests that if any supersymmetric particle is detected in future experiments, dark matter candidates will gain a permanent position in these extensions of the Standard Model.\n\n", "2510.07792": "2025-10-09, **Aluminum-Based Superconducting Tunnel Junction Sensors for Nuclear Recoil Spectroscopy**, Spencer L. Fretwell et.al., [2510.07792v1](http://arxiv.org/abs/2510.07792v1)\n\n The BeEST experiment is searching for sub-MeV sterile neutrinos by measuring nuclear recoil energies from the decay of $^7$Be implanted into superconducting tunnel junction (STJ) sensors. The recoil spectra are affected by interactions between the radioactive implants and the sensor materials. We are therefore developing aluminum-based STJs (Al-STJs) as an alternative to existing tantalum devices (Ta-STJs) to investigate how to separate material effects in the recoil spectrum from potential signatures of physics beyond the Standard Model. Three iterations of Al-STJs were fabricated. The first had electrode thicknesses similar to existing Ta-STJs. They had low responsivity and reduced resolution, but were used successfully to measure $^7$Be nuclear recoil spectra. The second iteration had STJs suspended on thin SiN membranes by backside etching. These devices had low leakage current, but also low yield. The final iteration was not backside etched, and the Al-STJs had thinner electrodes and thinner tunnel barriers to increase signal amplitudes. These devices achieved 2.96 eV FWHM energy resolution at 50 eV using a pulsed 355 nm (~3.5 eV) laser. These results establish Al-STJs as viable detectors for systematic material studies in the BeEST experiment.\n\n", "2510.07463": "2025-10-08, **Boosted decision tree reweighting of simulated neutrino interactions for $O(1)$ GeV neutrino cross-section measurements**, Z. Lin et.al., [2510.07463v1](http://arxiv.org/abs/2510.07463v1)\n\n This paper illustrates a generic method for multi-dimensional reweighting of $O(1)$ GeV neutrino interaction Monte Carlo samples. The reweighting is based on a Boosted Decision Tree algorithm trained on high-dimensional space in detector final state observables. This enables one generator's events to be reweighted so that its reconstructed particle content and kinematics distributions, as well as detector efficiency, match those of a target model. The approach establishes an efficient way to reuse legacy Monte Carlo data, avoiding re-generation. As an example, we test its use in a measurement of transverse kinematic imbalance of the $\\mu^-$ and proton in charged-current quasielastic like $\\nu\\_\\mu$ events from the MINERvA experiment.\n\n", "2510.07454": "2025-10-08, **Simulation-based inference for neutrino interaction model parameter tuning**, Karla Tame-Narvaez et.al., [2510.07454v1](http://arxiv.org/abs/2510.07454v1)\n\n High-energy physics experiments studying neutrinos rely heavily on simulations of their interactions with atomic nuclei. Limitations in the theoretical understanding of these interactions typically necessitate ad hoc tuning of simulation model parameters to data. Traditional tuning methods for neutrino experiments have largely relied on simple algorithms for numerical optimization. While adequate for the modest goals of initial efforts, the complexity of future neutrino tuning campaigns is expected to increase substantially, and new approaches will be needed to make progress. In this paper, we examine the application of simulation-based inference (SBI) to the neutrino interaction model tuning for the first time. Using a previous tuning study performed by the MicroBooNE experiment as a test case, we find that our SBI algorithm can correctly infer the tuned parameter values when confronted with a mock data set generated according to the MicroBooNE procedure. This initial proof-of-principle illustrates a promising new technique for next-generation simulation tuning campaigns for the neutrino experimental community.\n\n", "2510.07433": "2025-10-08, **Sterile neutrino dark matter from a TeV Scale Seesaw**, Kunal Pandey et.al., [2510.07433v1](http://arxiv.org/abs/2510.07433v1)\n\n In this article, we investigate the phenomenological aspects of a feebly interacting sterile neutrino dark matter in a low-scale seesaw setup. The Type-I seesaw framework is augmented by a second complex scalar doublet ($\\Phi\\_{\\nu}$), which couples exclusively with the heavy right-handed neutrinos and the lepton doublet, thereby forming the neutrino Dirac mass term, while the first doublet is responsible for the mass generation of the remaining Standard Model particles. The lightest sterile neutrino ($N\\_1$) serves as a feebly interacting massive particle (FIMP), produced primarily through W and Z boson decays -a previously overlooked dominant contribution that solely determines the relic abundance. Owing to the small vev ($v\\_{\\nu}\\sim 10$ MeV) of the second Higgs doublet, an enhancement in the available parameter space of the sterile neutrino masses is observed, spanning from sub-keV to $0.2$ GeV. After incorporating the latest Lyman-$\\alpha$ forest observations it is found that the setup is able to accommodate both warm and cold dark matter options.\n\n", "2510.07399": "2025-10-08, **Neutrinos from stars in the Milky Way**, Pablo Martínez-Miravé et.al., [2510.07399v1](http://arxiv.org/abs/2510.07399v1)\n\n Neutrinos are produced during stellar evolution by means of thermal and thermonuclear processes. We model the cumulative neutrino flux expected at Earth from all stars in the Milky Way: the Galactic stellar neutrino flux (GS$\\nu$F). We account for the star formation history of our Galaxy and reconstruct the spatial distribution of Galactic stars by means of a random sampling procedure based on Gaia Data Release 2. We use the stellar evolution code $\\texttt{MESA}$ to compute the neutrino emission for a suite of stellar models with solar metallicity and zero-age-main-sequence mass between $0.08M\\_\\odot$ and $100\\ M\\_\\odot$, from their pre-main sequence phase to their final fates. We then reconstruct the evolution of the neutrino spectral energy distribution for each stellar model in our suite. The GS$\\nu$F lies between $\\mathcal{O}(1)$ keV and $\\mathcal{O}(10)$ MeV, with thermal (thermonuclear) processes responsible for shaping neutrino emission at energies smaller (larger) than $0.1$ MeV. Stars with mass larger than $\\mathcal{O}(1\\ M\\_\\odot)$, located in the thin disk of the Galaxy, provide the largest contribution to the GS$\\nu$F. Moreover, most of the GS$\\nu$F originates from stars distant from Earth about $5-10$ kpc, implying that a large fraction of stellar neutrinos can reach us from the Galactic Center. Solar neutrinos and the diffuse supernova neutrino background have energies comparable to those of the GS$\\nu$F, challenging the detection of the latter. However, directional information of solar neutrino and GS$\\nu$F events, together with the annual modulation of the solar neutrino flux, could facilitate the GS$\\nu$F detection; this will kick off a new era for low-energy neutrino astronomy, also providing a novel probe to discover New Physics.\n\n", "2510.07236": "2025-10-08, **Texture-zeros in minimal seesaw from non-invertible symmetry fusion rules**, Zheng Jiang et.al., [2510.07236v1](http://arxiv.org/abs/2510.07236v1)\n\n The $Z\\_2$ gauging of $Z\\_N$ symmetry can enforce certain elements of the fermion Yukawa couplings to vanish. We have performed a systematical study of texture zero patterns of lepton mass matrices in the minimal seesaw model, and we present all the possible patterns of the charged lepton Yukawa coupling $Y\\_E$, neutrino Yukawa coupling $Y\\_{\\nu}$, right-handed neutrino mass matrix $M\\_R$ and the light neutrino mass matrix $M\\_{\\nu}$ which can be derived from the $Z\\_2$ gauging of $Z\\_N$ symmetry. The realization of the textures with the maximum number of zeros and the second maximum number of zeros from non-invertible symmetry is studied, and the phenomenological implications in neutrino oscillation are discussed.\n\n", "2510.07360": "2025-10-08, **Search for an eV-scale sterile neutrino with the first six detection units of KM3NeT/ORCA**, KM3NeT Collaboration et.al., [2510.07360v1](http://arxiv.org/abs/2510.07360v1)\n\n The existence of an eV-scale sterile neutrino has been proposed to explain several anomalous experimental results obtained over the course of the past 25 years. The first search for such a sterile neutrino conducted with data from KM3NeT/ORCA -- a water Cherenkov neutrino telescope under construction at the bottom of the Mediterranean Sea -- is reported in this paper. GeV-scale atmospheric neutrino oscillations are measured by reconstructing the energy and arrival direction of up-going neutrinos that have traversed the Earth. This study is based on a data sample containing 5828 neutrino candidates collected with 6 detection units ($5\\%$ of the complete detector), corresponding to an exposure of 433 kton-years. From the expected effect of an eV-scale sterile neutrino on the first $\\nu\\_\\mu \\rightarrow \\nu\\_\\tau$ standard oscillation maximum, simultaneous constraints are put on the magnitude of the $U\\_{\\mu 4}$ and $U\\_{\\tau 4}$ mixing elements under the assumption $\\Delta m^2\\_{41} = 1$ eV$^2$. The results are compatible with the absence of mixing between active neutrinos and a sterile state, with $\\|U\\_{\\mu 4}\\|^2 < 0.138$ and $\\|U\\_{\\tau 4}\\|^2 < 0.076$ at a $90\\%$ confidence level. Such constraints are compatible with the results reported by other long-baseline experiments, and indicate that with KM3NeT/ORCA it is possible to bring crucial contributions to sterile neutrino searches in the coming years.\n\n", "2510.07107": "2025-10-08, **A two scalar triplets model as common origin for dark matter, neutrino masses, baryon asymmetry and inflation**, Sin Kyu Kang et.al., [2510.07107v1](http://arxiv.org/abs/2510.07107v1)\n\n We propose an extension of the standard model (SM) by two SU(2) triplet scalars and an inert SU(2) doublet. We demonstrate that this setup can simultaneously produce an inflaton and baryon asymmetry in the early universe, provide a dark matter candidate and explain the smallness of neutrino masses. The two triplets are particularly important as they become mediators for the production of dark matter and the generation of lepton asymmetry, as well as contribute an inflaton. The inert doublet results in a dark matter candidate. The required CP-violation for lepton asymmetry is obtained by interference between the triplet mediators that communicate the dark sector to the SM sector. More precisely, the complex Breit-Wigner propagators of the triplets and their mixing, result in an asymmetric production of leptons and antileptons that is boosted before dark matter freeze-out. In this case, simultaneously achieving enough dark matter relic abundance and proper matter-antimatter asymmetry limits the available parameter space of the model. Moreover, the scalar triplets are coupled non-minimally to gravity and give rise to the inflaton. We calculate the inflationary parameters and check that we can obtain predictions consistent with Planck constraints from 2018. We also perform an analysis of the reheating for the inflaton decays/annihilations to relativistic SM particles.\n\n", "2510.06702": "2025-10-08, **State preparation and symmetries**, Ivana Miháliková et.al., [2510.06702v1](http://arxiv.org/abs/2510.06702v1)\n\n We demonstrate the importance of symmetries in Variational Quantum Eigensolver (VQE) algorithms to prepare the ground or specific low-lying states of quantum Hamiltonians. We examine two spin problems, one with random all-to-all couplings inspired by neutrino flavor evolution in supernovae, and the standard Heisenberg spin Hamiltonian on a $4 \\times 3$ lattice. The neutrino Hamiltonian has the total spin $J$ and third component $J\\_{\\rm{z}}$ as its only symmetries. The Heisenberg model has these symmetries plus translational invariance and reflection symmetry.   We demonstrate that the convergence of variational methods is dramatically improved by keeping all symmetries. In both cases a nearly exact solution can be obtained in cases where standard unconstrained variational algorithms fail. Since variational algorithms can use standard Trotter steps as part of the optimization, allowing additional correlations that obey all the symmetries of the Hamiltonian will speed convergence of variational algorithms. This will lead to faster convergence than standard projection algorithms.\n\n", "2510.06665": "2025-10-08, **Doping of a Borexino-like Liquid Scintillator with Tellurium-Diols**, Hans Th. J. Steiger et.al., [2510.06665v1](http://arxiv.org/abs/2510.06665v1)\n\n One of the most promising approaches for future neutrinoless double beta decay searches is to incorporate a candidate isotope into the liquid scintillator of a next-generation neutrino detector. In this study, a sample of the high-performance 1,2,4-Trimethylbenzene-based liquid scintillator from the Borexino detector was loaded with different concentrations of Te-diols. Therefore,a novel and completely water-free synthesis in a non-acidic organic environment at room temperature was used. Key parameters of the loaded samples were analyzed and compared with those of the pure Borexino liquid. Both the emission spectrum and transmission remained nearly unchanged,even at high doping levels. The reduction in light yield was moderate, with approximately 8,400 photons emitted for a 1 MeV energy deposition by an electron at 1$\\%$ tellurium loading. The time profile of the light emission induced by alpha particles was also investigated, revealing that the scintillation response becomes significantly faster with increasing tellurium concentration.\n\n", "2510.06616": "2025-10-08, **Instrumentation of JUNO 3-inch PMTs**, Jilei Xu et.al., [2510.06616v1](http://arxiv.org/abs/2510.06616v1)\n\n Over 25,600 3-inch photomultiplier tubes (PMTs) have been instrumented for the central detector of the Jiangmen Underground Neutrino Observatory. Each PMT is equipped with a high-voltage divider and a frontend cable with waterproof sealing. Groups of sixteen PMTs are connected to the underwater frontend readout electronics via specialized multi-channel waterproof connectors. This paper outlines the design and mass production processes for the high-voltage divider, the cable and connector, as well as the waterproof potting of the PMT bases. The results of the acceptance tests of all the integrated PMTs are also presented.\n\n", "2510.06574": "2025-10-08, **Nuclear and electron scattering by neutrinos and dark matter in condensed systems**, James B. Dent et.al., [2510.06574v1](http://arxiv.org/abs/2510.06574v1)\n\n Low-threshold dark matter detectors, in particular cryogenic detectors based on dielectric materials, are among the best tools for probing sub-GeV dark matter masses. In the coming years detectors of this type will become sensitive to solar neutrino scattering. Previous work has shown that, for dark matter scattering at very low recoil energies, one must include collective excitations of the electrons in the solid. In this work, we have computed the collective excitations due to neutrino scattering on electrons and nuclei. We find the full electron-scattering response at leading order is captured by 5 structure factors and identify the leading component with the electron energy-loss function. Then, using silicon and germanium detectors as an example, we perform a dark matter sensitivity study and compute their respective neutrino floors. Lastly, we show that these detectors are sensitive to unexplored scenarios of beyond-Standard Model neutrino physics, within the exposure required to reach the neutrino floor.\n\n"}, "dark matter": {"2510.08573": "2025-10-09, **Reconstructing the local density field with combined convolutional and point cloud architecture**, Baptiste Barthe-Gold et.al., [2510.08573v1](http://arxiv.org/abs/2510.08573v1)\n\n We construct a neural network to perform regression on the local dark-matter density field given line-of-sight peculiar velocities of dark-matter halos, biased tracers of the dark matter field. Our architecture combines a convolutional U-Net with a point-cloud DeepSets. This combination enables efficient use of small-scale information and improves reconstruction quality relative to a U-Net-only approach. Specifically, our hybrid network recovers both clustering amplitudes and phases better than the U-Net on small scales.\n\n", "2510.08459": "2025-10-09, **The dark sector of the Universe as a scalar field in Horndeski Gravity**, M. S. Oliveira et.al., [2510.08459v1](http://arxiv.org/abs/2510.08459v1)\n\n In the present work, we study a subclass of Horndeski gravity characterized by a non-minimal derivative coupling between a scalar field and the Einstein tensor, as a possible alternative to alleviate the observational tension associated with estimates of the Hubble constant $H\\_{0}$. Two scenarios within a flat FRW spacetime were considered. In the first case, the scalar field mimics cold dark matter, whereas in the second case, it acts as dark energy. We derive the dynamical equations and perform a statistical analysis using observational data of $H(z)$, obtaining constraints for the cosmological parameters. The results indicate that the model can effectively fit the cosmic expansion rate at late epochs, providing values of $H\\_{0}$ that are more compatible with local measurements. These results suggest that the non-minimal coupling sector in the Horndeski context constitutes a viable and promising approach to alleviate the $H\\_{0}$ tension and investigate scenarios beyond the standard cosmological model.\n\n", "2510.08455": "2025-10-09, **A first look at quasar-galaxy clustering at $z\\simeq7.3$**, Jan-Torge Schindler et.al., [2510.08455v1](http://arxiv.org/abs/2510.08455v1)\n\n We present JWST observations of the environments surrounding two high-redshift quasars -- J0252$-$0503 at $z = 7.0$ and J1007$+$2115 at $z = 7.5$ -- which enable the first constraints on quasar-galaxy clustering at $z \\sim 7.3$. Galaxies in the vicinity of the quasars are selected through ground-based and JWST/NIRCam imaging and then spectroscopically confirmed with JWST/NIRSpec using the multi-shutter assembly (MSA). Over both fields, we identify 51 $z>5$ galaxies, of which eight are found within a $\\Delta v\\_{\\textrm{LOS}}=\\pm1500 \\rm{km} \\rm{s}^{-1}$ line-of-sight velocity window from the quasars and another eight in the background. The galaxy J0252\\\\_8713, located just $7\\,\\rm{pkpc}$ and $\\Delta v\\_{\\textrm{LOS}} \\approx 360\\,\\rm{km}\\,\\rm{s}^{-1}$ from quasar J0252$-$0503, emerges as a compelling candidate for one of the most distant quasar-galaxy mergers. Combining the galaxy discoveries over the two fields, we measure the quasar-galaxy cross-correlation and obtain a correlation length of $r\\_0^{\\rm{QG}}\\approx7.6\\_{-1.6}^{+1.7}\\,h^{-1}\\,\\rm{cMpc}$, based on a power-law model with a fixed slope of $\\gamma\\_{\\rm{QG}} = 2.0$. Under the assumption that quasars and galaxies trace the same underlying dark matter density fluctuations, we infer a minimum dark matter halo mass for $z\\simeq7.3$ quasars of $\\log\\_{10}(M\\_{\\textrm{halo, min}}/\\textrm{M}\\_{\\odot})= 11.6\\pm0.6$ in a halo model framework. Compared to measurements from EIGER at $\\langle z \\rangle = 6.25$ and ASPIRE at $\\langle z \\rangle = 6.7$ (where $\\log\\_{10}(M\\_{\\textrm{halo, min}}/\\textrm{M}\\_{\\odot}) \\gtrsim 12.3$), our clustering results provide tentative evidence for a non-monotonic redshift evolution of quasar clustering properties. We further estimate a quasar duty cycle of $f\\_{\\rm{duty}}\\approx0.1\\%$, consistent with constraints from quasar proximity zones and IGM damping wings. (abridged)\n\n", "2510.08375": "2025-10-09, **Primordial Black Holes, Charge, and Dark Matter: Rethinking Evaporation Limits**, Sebastian Schuster et.al., [2510.08375v1](http://arxiv.org/abs/2510.08375v1)\n\n Limits on the dark matter fraction of small mass primordial black holes from Hawking radiation are predominantly derived from the assumption of a Schwarzschild black hole evaporating. However, astrophysical black holes are usually much more realistically modelled by the rotating Kerr black hole solution. Meanwhile, electromagnetically charged black holes are astrophysically of little importance due to their fast neutralisation in the present universe. Dark matter is not just a possible solution to issues of astrophysics and cosmology, but also to issues of the standard model of particle physics. Extensions of this model thus can lead to charges present in the early universe which remain preserved in the charge of primordial black holes - even when the corresponding particles have disappeared from the particle content of the present epoch of the universe. Here, we report on a thorough proof-of-concept that such charges can greatly change evaporation limits for primordial black hole dark matter. Special emphasis is placed on (near-)extremal black holes, for which this effect is especially pronounced.\n\n", "2510.08331": "2025-10-09, **The superclustering of hot gas: cosmological sensitivity in the Websky simulations**, M. Lokken et.al., [2510.08331v1](http://arxiv.org/abs/2510.08331v1)\n\n Combinations of galaxy surveys and cosmic microwave background secondaries, such as the thermal Sunyaev Zeldovich (tSZ) effect, are increasingly being used to jointly constrain cosmology and astrophysical properties of the gas within and beyond halos. Standard cross-correlations measure a directionless correlation between the microwave maps and galaxy catalogs. However, more information about the cosmic web structure can be captured by summary statistics which include environmental constraints and measure oriented correlations along axes of structure, such as filaments or superclusters. This work studies the sensitivity of multipole moments of constrained oriented stacks, a directional and environmentally-dependent statistic, to variations in cosmological and astrophysical parameters. We run nine different 2.4 Gpc-per-side simulations with the Websky algorithm, varying the dark matter energy density within flat $\\Lambda$CDM, and create mock tSZ maps with each. We also apply six different gas prescriptions, imitating AGN feedback variations, to the fiducial cosmology. We analyze oriented stacks of the tSZ signal in supercluster regions in each simulation, focusing on signal out to $\\sim20$ transverse Mpc from massive ($M>5\\times10^{13}~M\\_\\odot$) halos. The cosmology variations affect anisotropic and isotropic measurements similarly, while the halo-pasted gas variations mostly affect the isotropic signal. Our results suggest it is worthwhile to incorporate directional information into SZ-galaxy cross-correlations to increase cosmological sensitivity and help break degeneracies with gas physics.\n\n", "2510.08293": "2025-10-09, **The Dependence of Halo Clustering on Subhalo Anisotropy and Planarity**, Nathaniel P. Johnson et.al., [2510.08293v1](http://arxiv.org/abs/2510.08293v1)\n\n We show that host cold dark matter (CDM) haloes cluster in a manner that depends upon the anisotropy/planarity of their subhaloes, indicating an environmental dependence to subhalo anisotropy/planarity. The spatial distribution of satellite galaxies about central galaxies and correspondingly, the spatial distribution of subhaloes about host haloes have been subjects of interest for two decades. Important questions include the degree to which satellites are distributed anisotropically about their hosts or exhibit planarity in their distributions and the degree to which this anisotropy depends upon the environment of the host-satellite system. We study the spatial distributions of subhaloes in a cosmological N-body simulation. We find that CDM subhaloes are distributed in a manner that is strongly anisotropic/planar, in agreement with prior work, though our presentation is complementary. The more novel result is that this anisotropy has an environmental dependence. Systems which exhibit less (more) anisotropy and less (more) planarity cluster more strongly (weakly). Systems in which subhaloes reside further from their host centres cluster more weakly. None of these clustering effects are caused by a correlation between subhalo anisotropy/planarity and other properties on which host halo clustering is known to depend, such as concentration, spin parameter, host halo shape, or subhalo count. We discuss the impact of this result on the anisotropy of satellites as predicted by CDM, its testability, and its possible relation to anisotropy observed about the large galaxies of the Local Group.\n\n", "2510.08115": "2025-10-09, **Probing Strange Dark Matter through $f$-mode Oscillations of Neutron Stars with Hyperons and Quark Matter**, Mahboubeh Shahrbaf et.al., [2510.08115v1](http://arxiv.org/abs/2510.08115v1)\n\n We investigate the impact of a hypothetical bosonic dark matter (DM) candidate, the sexaquark, on the fundamental ($f$-mode) oscillations of neutron stars (NSs). By varying the DM particle mass and considering different core compositions including hypernuclear matter, sexaquark DM, and deconfined quark matter (QM), we construct hybrid equations of state (EOS) with a smooth hadron--quark crossover that remain consistent with current astrophysical constraints on mass, radius, and tidal deformability. Our analysis shows that the presence of these exotic components systematically alters quasi-universal $f$-mode relations. In particular, relations involving $f$--$\\sqrt{M/R^{3}}$, $(R^{4}/M^{3}\\tau)(C)$, $\\omega M(C)$, require higher-order polynomial fits compared to standard studies. Quadratic forms remain sufficient for $f$--$\\sqrt{M/R^{3}}$ and $\\omega M(C)$, while damping-time relations such as $(R^{4}/M^{3}\\tau)(C)$ demand higher-order corrections to capture their curvature. For $f(\\Lambda)$, a cubic fit provides a satisfactory description. Within this extended framework the relations remain tight and effectively composition independent. These results suggest that precise $f$-mode measurements with future gravitational-wave detectors could provide clear signatures of DM and other exotic matter in NS interiors.\n\n", "2510.08007": "2025-10-09, **Atomic Observables Induced by Cosmic Fields**, Sebastian Lahs et.al., [2510.08007v1](http://arxiv.org/abs/2510.08007v1)\n\n The existence of cosmic fields made from yet unknown light bosons is predicted in many extensions to the Standard Model. They are especially of interest as possible constituents of dark matter. To detect such light and weakly interacting fields, atomic precision measurements offer one of the most sensitive platforms. In this work, we derive which atomic observables are sensitive to what kind of cosmic field couplings. For this we consider fields that couple either through scalar, pseudoscalar, vector, axial vector, or tensor couplings. We derive the corresponding non relativistic atomic potentials. Based on their symmetry properties, these can induce direct energy shifts or induce atomic electric dipole, magnetic dipole, electric quadrupole as well as nuclear Schiff and anapole moments.\n\n", "2510.07894": "2025-10-09, **Emission of Nambu-Goldstone bosons from the semilocal string network**, Yukihiro Kanda et.al., [2510.07894v1](http://arxiv.org/abs/2510.07894v1)\n\n Semilocal cosmic string is a line-like non-topological soliton associated with the breakdown of the $SU(2)\\_{\\rm global} \\times U(1)\\_{\\rm gauge}$ symmetry to the $U(1)\\_{\\rm global}$ symmetry. The broken phase has two massless Nambu-Goldstone (NG) modes as dynamical fields, and they can be emitted by semilocal strings. In this paper, we numerically show that such NG bosons are copiously produced with the evolution of the semilocal string network in the early universe. Our numerical analysis shows that the spectrum of produced particles has a peak at low momenta corresponding to the horizon scale. If the emitted NG bosons acquire mass due to soft-breaking terms, they can take the role of dark matter. This scenario typically predicts very light pseudo NG boson dark matter.\n\n", "2510.07878": "2025-10-09, **FlowLensing: Simulating Gravitational Lensing with Flow Matching**, Hamees Sayed et.al., [2510.07878v1](http://arxiv.org/abs/2510.07878v1)\n\n Gravitational lensing is one of the most powerful probes of dark matter, yet creating high-fidelity lensed images at scale remains a bottleneck. Existing tools rely on ray-tracing or forward-modeling pipelines that, while precise, are prohibitively slow. We introduce FlowLensing, a Diffusion Transformer-based compact and efficient flow-matching model for strong gravitational lensing simulation. FlowLensing operates in both discrete and continuous regimes, handling classes such as different dark matter models as well as continuous model parameters ensuring physical consistency. By enabling scalable simulations, our model can advance dark matter studies, specifically for probing dark matter substructure in cosmological surveys. We find that our model achieves a speedup of over 200$\\times$ compared to classical simulators for intensive dark matter models, with high fidelity and low inference latency. FlowLensing enables rapid, scalable, and physically consistent image synthesis, offering a practical alternative to traditional forward-modeling pipelines.\n\n", "2510.07800": "2025-10-09, **Constraints on inelastic dark matter from the CDEX-1B experiment**, Y. F. Liang et.al., [2510.07800v1](http://arxiv.org/abs/2510.07800v1)\n\n We present limits on spin-independent inelastic WIMP-nucleus scattering using the 737.1 kg $\\cdot$ day dataset from the CDEX-1B experiment. Expected nuclear recoil spectra for various inelastic WIMP masses $m\\_\\chi$ and mass splittings $\\delta$ are calculated under the standard halo model. An accurate background model of CDEX-1B is constructed by simulating all major background sources. The model parameters are then determined through maximum likelihood estimation and Markov Chain Monte Carlo fitting. The resulting 90\\% confidence level upper limits on the WIMP-nucleon cross section $\\sigma\\_{\\mathrm{n}}$ exclude certain DAMA/LIBRA allowed regions: the $\\chi^2 < 4$ regions for $\\delta < 30$ keV at $m\\_\\chi = 250$ GeV and the $\\chi^2 < 9$ region for $\\delta < 50$ keV at $m\\_\\chi = 500$ GeV. The method is applicable to other inelastic dark matter scenarios, and the upcoming CDEX-50 experiment is expected to improve sensitivity by four orders of magnitude.\n\n", "2510.07511": "2025-10-08, **Robust Measurement of Stellar Streams Around the Milky Way: Correcting Spatially Variable Observational Selection Effects in Optical Imaging Surveys**, K. Boone et.al., [2510.07511v1](http://arxiv.org/abs/2510.07511v1)\n\n Observations of density variations in stellar streams are a promising probe of low-mass dark matter substructure in the Milky Way. However, survey systematics such as variations in seeing and sky brightness can also induce artificial fluctuations in the observed densities of known stellar streams. These variations arise because survey conditions affect both object detection and star-galaxy misclassification rates. To mitigate these effects, we use Balrog synthetic source injections in the Dark Energy Survey (DES) Y3 data to calculate detection rate variations and classification rates as functions of survey properties. We show that these rates are nearly separable with respect to survey properties and can be estimated with sufficient statistics from the synthetic catalogs. Applying these corrections reduces the standard deviation of relative detection rates across the DES footprint by a factor of five, and our corrections significantly change the inferred linear density of the Phoenix stream when including faint objects. Additionally, for artificial streams with DES like survey properties we are able to recover density power spectra with reduced bias. We also find that uncorrected power-spectrum results for LSST-like data can be around five times more biased, highlighting the need for such corrections in future ground based surveys.\n\n", "2510.07490": "2025-10-08, **Apparent Lorentz violation from disformally coupled ultralight dark matter**, Guillem Domènech et.al., [2510.07490v1](http://arxiv.org/abs/2510.07490v1)\n\n We study the impact of general disformal metric transformations on fermions, which shift the gravitational metric by an additional rank-2 tensor. This tensor can in principle be constructed from scalar-field gradients, vector fields, or field-strength contractions. We show this transformation results in the conventional Dirac action being modified by additional kinetic and axial-current couplings that are quadratic in the shifted field. When the field sourcing the metric shift takes on a non-trivial background value, apparent Lorentz-violating effects can result, which we identify as terms in an effective field theory. Assuming the well-motivated cases of scalar and vector ultralight dark matter, we demonstrate that experimental tests of rotation and boost violation imply constraints on the additional kinetic coupling. Even under conservative assumptions, the constraints for vector ultralight dark matter are extremely stringent.\n\n", "2510.07403": "2025-10-08, **Can Relativistic Effects explain Galactic Dynamics without Dark Matter?**, L. Filipe O. Costa et.al., [2510.07403v1](http://arxiv.org/abs/2510.07403v1)\n\n We show that, contrary to some recent claims, relativistic effects cannot mimic dark matter in the galactic rotation curves and gravitational lensing.\n\n", "2510.07387": "2025-10-08, **Probing Dark Matter Interactions with Stellar Motion near Sagittarius A***, R. Andrew Gustafson et.al., [2510.07387v1](http://arxiv.org/abs/2510.07387v1)\n\n Stars orbiting Sgr A* at the Milky Way's center provide a unique laboratory to test gravity and dark matter (DM). We demonstrate that DM interactions in stellar interiors induce a novel momentum transfer force, altering orbits beyond gravitational effects. Using S2's 2000-2019 orbital data we derive the first astrophysical constraints on DM-nucleon scattering, excluding new sub-GeV parameter space. Stellar lifetime constraints over Myr timescales complement these, surpassing some direct detection and cosmological limits. This establishes stellar dynamics as a novel probe of DM interactions.\n\n", "2510.07382": "2025-10-08, **A million-solar-mass object detected at cosmological distance using gravitational imaging**, D. M. Powell et.al., [2510.07382v1](http://arxiv.org/abs/2510.07382v1)\n\n Structure on sub-galactic scales provides important tests of galaxy formation models and the nature of dark matter. However, such objects are typically too faint to provide robust mass constraints. Here, we report the discovery of an extremely low-mass object detected via its gravitational perturbation to a thin lensed arc observed with milli-arcsecond-resolution very long baseline interferometry (VLBI). The object was identified using a non-parametric gravitational imaging technique and confirmed using independent parametric modelling. It contains a mass of $m\\_{\\rm 80}=(1.13 \\pm 0.04)\\times 10^6{M\\_\\odot}$ within a projected radius of 80 parsecs at an assumed redshift of 0.881. This detection is extremely robust and precise, with a statistical significance of 26$\\sigma$, a 3.3 per cent fractional uncertainty on $m\\_{\\rm 80}$, and an astrometric uncertainty of 194 $\\mu$as. This is the lowest-mass object known to us, by two orders of magnitude, to be detected at a cosmological distance by its gravitational effect. This work demonstrates the observational feasibility of using gravitational imaging to probe the million-solar-mass regime far beyond our local Universe.\n\n", "2510.07371": "2025-10-08, **Axion Perturbations: A General Analytical Treatment**, Itamar J. Allali et.al., [2510.07371v1](http://arxiv.org/abs/2510.07371v1)\n\n Cosmological data provides us two key constraints on dark matter (DM): it must have a particular abundance, and it must have an adiabatic spectrum of density perturbations in the early universe. Many different cosmological scenarios have been proposed that establish the abundance of axion DM in qualitatively different ways. In this paper we emphasize that, despite this variety of backgrounds, the perturbations in axion DM can be understood from universal principles. How does a feebly interacting axion field acquire perturbations proportional to those of photons? How do the isocurvature power spectrum and non-Gaussianity depend on the background evolution of the universe? We answer these questions for a completely general choice of cosmological background and temperature-dependent axion potential. We show that the most general solution to the axion field equation on super-horizon scales is entirely determined by the family of background solutions for different initial field values $\\theta\\_{\\rm ini}$. This holds for both the component in the field perturbation solution contributing to the DM isocurvature perturbation (enhanced at late times by the sensitivity of the DM abundance to the initial condition, $\\partial \\Omega\\_a / \\partial \\theta\\_{\\rm ini}$, which can be large for initial conditions near the hilltop), and the other component that contributes to the DM curvature perturbation. In particular, we explain that an unperturbed axion field in the early universe evolving into one with nontrivial adiabatic perturbations is guaranteed by Weinberg's theorem on adiabatic modes. These results have been derived before with various assumptions, such as a radiation dominated background or a quadratic potential. Our aim is to give a clear, simple derivation that is manifestly independent of those assumptions, and thus can be applied to any cosmological axion scenario.\n\n", "2510.07103": "2025-10-08, **Unified Dark Matter and Dark Energy in a model of Non-Canonical Scalar-Tensor Theory**, Nihal Jalal Pullisseri et.al., [2510.07103v1](http://arxiv.org/abs/2510.07103v1)\n\n We consider a model of non-canonical scalar-tensor theory in which the kinetic term in the Brans-Dicke action is replaced by a non-canonical scalar field Lagrangian $\\mathcal{L}(X, \\phi)= \\lambda X^\\alpha \\phi^\\beta - V(\\phi)$ where $X = (1/2) \\partial\\_{\\mu} \\phi \\partial^{\\mu} \\phi$ and $\\alpha$, $\\beta$ and $\\lambda$ are parameters of the model. This can be considered as a simple non-canonical generalization of the Brans-Dicke theory with a potential term which corresponds to a special case of this model with the values of the parameter $\\alpha = 1$, $\\beta = -1$ and $\\lambda = 2w\\_{\\_{BD}}$ where $w\\_{\\_{BD}}$ is the Brans-Dicke parameter. Considering a spatially flat Friedmann-Robertson-Walker Universe with scale factor $a(t)$, it is shown that, in the matter free Universe, the kinetic term $\\lambda X^\\alpha \\phi^\\beta$ can lead to a power law solution $a(t)\\propto t^{n}$ but the maximum possible value of $n$ turns out to be $(1+\\sqrt{3})/4 \\approx 0.683$. When $\\alpha \\geq 18$, this model can lead to a solution $a(t)\\propto t^{2/3}$, thereby mimicking the evolution of scale factor in a cold dark matter dominated epoch with Einstein's General Relativity (GR). With the addition of a linear potential term $V(\\phi) = V\\_{0}\\phi$, it is shown that this model mimics the standard $\\Lambda$CDM model type evolution of the Universe. The larger the value of $\\alpha$, the closer the evolution of $a(t)$ in this model to that in the $\\Lambda$CDM model based on Einstein's GR. The purpose of this paper is to demonstrate that this model with a linear potential can mimic the GR based $\\Lambda$CDM model. However, with an appropriate choice of the potential $V(\\phi)$, this model can provide a unified description of both dark matter and dynamical dark energy, as if it were based on Einstein's GR.\n\n", "2510.06948": "2025-10-08, **When vacuum breaks: a self-consistency test for astrophysical environments in extreme mass ratio inspirals**, Lorenzo Copparoni et.al., [2510.06948v1](http://arxiv.org/abs/2510.06948v1)\n\n Gravitational-wave signals are typically interpreted under the vacuum hypothesis, i.e. assuming negligible influence from the astrophysical environment. This assumption is expected to break down for low-frequency sources such as extreme mass ratio inspirals (EMRIs), which are prime targets for the Laser Interferometer Space Antenna (LISA) and are expected to form, at least in part, in dense environments such as Active Galactic Nuclei or dark-matter spikes/cores. Modeling environmental effects parametrically is challenging due to the large uncertainties in their underlying physics. We propose a non-parametric test for environmental effects in EMRIs, based on assessing the self-consistency of vacuum parameter posteriors inferred from different portions of the signal. Our results demonstrate that this approach can reveal the presence of astrophysical environments, or even deviations from General Relativity, without introducing additional parameters or assumptions about the underlying physics.\n\n", "2510.06921": "2025-10-08, **Dark matter direct search result from InDEx run2 at JUSL**, Susmita Das et.al., [2510.06921v1](http://arxiv.org/abs/2510.06921v1)\n\n The Indian Dark matter search Experiment (InDEx) has been initiated at Jaduguda Underground Science Laboratory (JUSL) to explore the low mass region of dark matter. The detectors used by InDEx are superheated droplet detectors with active liquid C2H2F4. The run1 of InDEx was with 2.47 kg-days of exposure at a threshold of 5.87 keV. In the present work, the run2 of InDEx, the detectors were set at 1.95 keV thresholds with an active liquid mass of 70.4 g. For a runtime of 102.48 days, the experimental results set constraint on spin-independent at 20.4 GeV/c2 and on spin-dependent at 21.0 GeV/c2 WIMP mass respectively. There is a shift of the most sensitive WIMP mass towards the lower region and an improvement of the sensitivity limit over the InDEx run1.\n\n", "2510.06905": "2025-10-08, **The radial acceleration relation at the EDGE of galaxy formation: testing its universality in low-mass dwarf galaxies**, Mariana P. Júlio et.al., [2510.06905v1](http://arxiv.org/abs/2510.06905v1)\n\n A tight correlation between the baryonic and observed acceleration of galaxies has been reported over a wide range of mass ($10^8 < M\\_{\\rm bar}/{\\rm M}\\_\\odot < 10^{11}$) - the Radial Acceleration Relation (RAR). This has been interpreted as evidence that dark matter is actually a manifestation of some modified weak-field gravity theory. In this paper, we study the radially resolved RAR of 12 nearby dwarf galaxies, with baryonic masses in the range $10^4 < M\\_{\\rm bar}/{\\rm M}\\_\\odot < 10^{7.5}$, using a combination of literature data and data from the MUSE-Faint survey. We use stellar line-of-sight velocities and the Jeans modelling code GravSphere to infer the mass distributions of these galaxies, allowing us to compute the RAR. We compare the results with the EDGE simulations of isolated dwarf galaxies with similar stellar masses in a $\\Lambda$CDM cosmology. We find that most of the observed dwarf galaxies lie systematically above the low-mass extrapolation of the RAR. Each galaxy traces a locus in the RAR space that can have a multi-valued observed acceleration for a given baryonic acceleration, while there is significant scatter from galaxy to galaxy. Our results indicate that the RAR does not apply to low-mass dwarf galaxies and that the inferred baryonic acceleration of these dwarfs does not contain enough information, on its own, to derive the observed acceleration. The simulated EDGE dwarfs behave similarly to the real data, lying systematically above the extrapolated RAR. We show that, in the context of modified weak-field gravity theories, these results cannot be explained by differential tidal forces from the Milky Way, nor by the galaxies being far from dynamical equilibrium, since none of the galaxies in our sample seems to experience strong tides. As such, our results provide further evidence for the need for invisible dark matter in the smallest dwarf galaxies.\n\n"}, "supernova": {"2510.08505": "2025-10-09, **AT 2018cow at ~5 years: additional evidence for a tidal disruption origin**, Anne Inkenhaag et.al., [2510.08505v1](http://arxiv.org/abs/2510.08505v1)\n\n The Luminous Fast Blue Optical Transient (LFBOT) AT 2018cow is the prototype of its class with an extensive set of multi-wavelength observations. Despite a rich data set there is, still, no consensus about the physical nature and origin of this event. AT 2018cow remained UV bright 2-4 years after the explosion, which points at an additional energy injection source, most likely from an accretion disk. We present additional late time UV data obtained with the Hubble Space Telescope, to show there is no significant fading in the optical since the last epoch and only marginal fading in the UV. The new UV data points match the predictions of previously published accretion disk models, where the disk is assumed to form from the tidal disruption of a low mass star by an intermediate mass black hole. This consistency provides evidence that AT 2018cow could indeed be a tidal disruption event. The marginal decay is in contrast with the predictions of light curves produced by interacting supernovae. The difference between expectations for disc emission and interacting supernovae will further increase with time, making data at even later times a route to robustly rule out interaction between supernova ejecta and circumstellar material.\n\n", "2510.08339": "2025-10-09, **Probing departures from $Λ$CDM by late-time datasets**, Himanshu Chaudhary et.al., [2510.08339v1](http://arxiv.org/abs/2510.08339v1)\n\n Observational data play a pivotal role in identifying cosmological models that are both theoretically consistent and empirically viable. In this work, we investigate whether the standard $\\Lambda$CDM model exhibits significant departure with current late time datasets, including Cosmic Chronometers, Baryon Acoustic Oscillations from DESI DR2, and various Type Ia supernova compilations (Pantheon$^+$, DES-SN5Y, Union3). We analyze several dynamical dark energy models, including $\\omega$CDM, o$\\omega$CDM, $\\omega\\_0\\omega\\_a$CDM, Logarithmic, Exponential, JBP, BA, and GEDE. While CC + DESI DR2 data show mild deviations from $\\Lambda$CDM ($\\lesssim 2\\sigma$), adding supernova samples (DES-SN5Y or Union3) increases deviations, with BA, JBP, and Logarithmic models reaching $3-3.5\\sigma$, and CC + DESI DR2 + DES-SN5Y producing the largest deviations. We find consistent evidence for $\\omega\\_0 > -1$ and $\\omega\\_a < 0$ in all dark energy models, indicating that the cosmological constant faces a potential crisis and that dynamical dark energy models could provide a possible solution, characterized by a Quintom-B type scenario. The $\\Lambda$CDM model has long served as the cornerstone of modern cosmology, successfully shaping our understanding of the Universe from its earliest epochs to the present day. However, in light of DESI DR2 and other recent measurements, emerging cracks in this paradigm suggest that a complete understanding of the cosmos may require moving beyond the cosmological constant and exploring new physics governing the dark sector.\n\n", "2510.07673": "2025-10-09, **Detection of supernova magnitude fluctuations induced by large-scale structure**, A. Nguyen et.al., [2510.07673v1](http://arxiv.org/abs/2510.07673v1)\n\n The peculiar velocities of supernovae and their host galaxies are correlated with the large-scale structure of the Universe, and can be used to constrain the growth rate of structure and test the cosmological model. In this work, we measure the correlation statistics of the large-scale structure traced by the Dark Energy Spectroscopic Instrument Bright Galaxy Survey Data Release 1 sample, and magnitude fluctuations of type Ia supernova from the Pantheon+ compilation across redshifts z < 0.1. We find a detection of the cross-correlation signal between galaxies and type Ia supernova magnitudes. Fitting the normalised growth rate of structure f sigma\\_8 to the auto- and cross-correlation function measurements we find f sigma\\_8 = 0.384 +0.094 -0.157, which is consistent with the Planck LambdaCDM model prediction, and indicates that the supernova magnitude fluctuations are induced by peculiar velocities. Using a large ensemble of N-body simulations, we validate our methodology, calibrate the covariance of the measurements, and demonstrate that our results are insensitive to supernova selection effects. We highlight the potential of this methodology for measuring the growth rate of structure, and forecast that the next generation of type Ia supernova surveys will improve f sigma\\_8 constraints by a further order of magnitude.\n\n", "2510.07637": "2025-10-09, **Testing Lens Models of PLCK G165.7+67.0 Using Lensed SN H0pe**, Aadya Agrawal et.al., [2510.07637v1](http://arxiv.org/abs/2510.07637v1)\n\n Supernova H0pe is a multiply-imaged Type Ia supernova (SN Ia) and the second lensed SN to yield a measurement of the Hubble constant by the time-delay cosmography method, finding $H\\_0 = 75.4^{+8.1}\\_{-5.5} \\text{km s}^{-1} \\text{Mpc}^{-1}$. We investigate the seven lens modeling approaches used to derive $H\\_0$, assessing their agreement with $\\Lambda \\text{CDM}$ constraints from SN Ia surveys through a purely observational comparison. While photometrically derived magnifications yield distance moduli in line with $\\Lambda \\text{CDM}$ expectations, our comparison reveals that lens model predictions, even the most precise ones, consistently overestimate the magnification, with a offset of $ \\Delta \\mu > 1$ mag. This known bias, already appreciated by modeling teams, is independently confirmed through our analysis and highlights the value of lensed SNe as a tool to test model accuracy. If unaccounted for, such magnification biases can propagate into uncertainties in derived cosmological parameters, including $H\\_0$, and affect the interpretation of future precision measurements. These findings highlight a critical challenge for precision cosmology using strongly lensed transients. With next-generation surveys such as LSST, Roman, and Euclid poised to discover many more gravitationally lensed supernovae, the development and validation of robust, accurate lens models will be essential for using these rare events to probe cosmology.\n\n", "2510.07393": "2025-10-08, **A multiscale evolutionary study of molecular gas in STARFORGE. I. Synthetic observations of SEDIGISM-like molecular clouds**, K. R. Neralwar et.al., [2510.07393v1](http://arxiv.org/abs/2510.07393v1)\n\n Molecular clouds are active sites of star formation in galaxies, and their formation and evolution are largely affected by stellar feedback. This includes outflows and winds from newly formed stars, radiation from young clusters, and supernova explosions. High-resolution molecular line observations allow for the identification of individual star-forming regions and the study of their integrated properties. Moreover, simulations are now capable of accurately replicating the evolution of MCs including all key stellar feedback processes. We present 13CO(2-1) synthetic observations of the STARFORGE simulations produced using the radiative transfer code RADMC-3D, matching the observational setup of the SEDIGISM survey. From these, we identified the population of MCs using hierarchical clustering and analysed them to provide insights into the interpretation of observed MCs as they evolve. The flux distributions of the post-processed synthetic observations and the properties of the MCs, namely radius, mass, velocity dispersion, virial parameter and surface density, are consistent with those of SEDIGISM. Both samples of MCs occupy the same regions in the scaling relation plots; however, the average distributions of MCs at different evolutionary stages do not overlap on the plots. This highlights the reliability of our approach in modelling SEDIGISM and suggests that MCs at different evolutionary stages contribute to the scatter in observed scaling relations. We study the trends in MC properties over time to analyse their physical structure as they evolve. MCs appear as small, diffuse cloudlets in early stages, followed by their evolution to filamentary structures, before being shaped by stellar feedback into 3D bubbles and getting dispersed. These trends in the observable properties of MCs provide strong evidence that clouds exhibit distinct morphologies over the course of their evolution.\n\n", "2510.07131": "2025-10-08, **CURLING -- II. Improvement on the $H_{0}$ Inference from Pixelized Cluster Strong Lens Modeling**, Yushan Xie et.al., [2510.07131v1](http://arxiv.org/abs/2510.07131v1)\n\n Strongly lensed supernovae (glSNe) provide a powerful, independent method to measure the Hubble constant, $H\\_{0}$, through time delays between their multiple images. The accuracy of this measurement depends critically on both the precision of time delay estimation and the robustness of lens modeling. In many current cluster-scale modeling algorithms, all multiple images used for modeling are simplified as point sources to reduce computational costs. In the first paper of the CURLING program, we demonstrated that such a point-like approximation can introduce significant uncertainties and biases in both magnification reconstruction and cosmological inference. In this study, we explore how such simplifications affect $H\\_0$ measurements from glSNe. We simulate a lensed supernova at $z=1.95$, lensed by a galaxy cluster at $z=0.336$, assuming time delays are measured from LSST-like light curves. The lens model is constructed using JWST-like imaging data, utilizing both Lenstool and a pixelated method developed in CURLING. Under a fiducial cosmology with $H\\_0=70\\rm \\ km \\ s^{-1}\\ Mpc^{-1}$, the Lenstool model yields $H\\_0=69.91^{+6.27}\\_{-5.50}\\rm \\ km\\ s^{-1}\\ Mpc^{-1}$, whereas the pixelated framework improves the precision by over an order of magnitude, $H\\_0=70.39^{+0.82}\\_{-0.60}\\rm \\ km \\ s^{-1}\\ Mpc^{-1}$. Our results indicate that in the next-generation observations (e.g., JWST), uncertainties from lens modeling dominate the error budget for $H\\_0$ inference, emphasizing the importance of incorporating the extended surface brightness of multiple images to fully leverage the potential of glSNe for cosmology.\n\n", "2510.06667": "2025-10-08, **Ionized gas components in low surface brightness galaxy AGC 111629**, Tian-Wen Cao et.al., [2510.06667v1](http://arxiv.org/abs/2510.06667v1)\n\n We present integral field spectroscopy of ionized gas components in AGC 111629, an edge-on low surface brightness galaxy (LSBG) with a stellar mass of 5.7$\\times$10$^{8}$ M$\\_{\\odot}$. AGC 111629 displays an irregular H$\\alpha$ morphology and an arch-like structure in the extraplanar region, which is absent in continuous stellar image. The irregular H$\\alpha$ morphology may be related to a past merger event with its satellite galaxy AGC 748815. A peanut-shaped structure at the center in the integrated [OIII]$\\lambda$5007 map, with a position angle that differs from that of the main stellar disk. This structure exhibits a higher [OIII]$\\lambda$5007/H$\\beta$ flux ratio, a larger equivalent width (EW) of [OIII]$\\lambda$5007, and a lower H$\\alpha$/H$\\beta$ flux radio ($<$ 2.86). Some spaxels associated with the peanut-shaped structure fall within the composite region of the BPT diagram based on [NII]$\\lambda$6583. These features may be associated with the central AGN. Additionally, a sub-peak in the southern disk is clearly visible in the [OIII]$\\lambda$5007 map. An extended region ($\\sim$ 2 kpc) with an extremely low value of H$\\alpha$/H$\\beta$ flux ratio is observed near this sub-peak. We interpret the sub-peak as a superbubble likely driven by supernova explosions in the southern disk. We derive the gas-phase metallicity, 12+log(O/H), using the [NII]$\\lambda$6583/H$\\alpha$ diagnostic and find that AGC 111629 exhibits low central metallicity. This may result from feedback associated with AGN activity and supernova explosions.\n\n"}}