{"neutrino": {"2404.05690": "2024-04-08, **The neutrino background from non-jetted active galactic nuclei**, P. Padovani et.al., [2404.05690v1](http://arxiv.org/abs/2404.05690v1)\n\n Aims. We calculate the contribution to the neutrino background from the non-jetted active galactic nuclei (AGN) population following the recent IceCube association of TeV neutrinos with NGC 1068. Methods. We exploit our robust knowledge of the AGN X-ray luminosity function and evolution and convert it to the neutrino band by using NGC 1068 as a benchmark and a theoretically motivated neutrino spectrum. Results. The resulting neutrino background up to redshift 5 does not violate either the IceCube diffuse flux or the upper bounds for non-jetted AGN, although barely so. This is consistent with a scenario where the latter class makes a substantial contribution mostly below 1 PeV, while jetted AGN, i.e. blazars, dominate above this energy, in intriguing agreement with the dip in the neutrino data at ~ 300 TeV. More and better IceCube data on Seyfert galaxies will allow us to constrain the fraction of neutrino emitters among non-jetted AGN.\n\n", "2404.05524": "2024-04-08, **$(g-2)_{e,μ}$ anomalies and decays $h, Z\\to e_b e_a $ in 3-3-1 models with inverse seesaw neutrinos**, T. T. Hong et.al., [2404.05524v1](http://arxiv.org/abs/2404.05524v1)\n\n The Lepton flavor violating (LFV) decays $h, Z\\to e\\_b e\\_a $, and $e\\_b\\to e\\_a \\gamma$ are discussed in a class of general 3-3-1 models adding heavy neutral leptons and singly charged Higgs bosons to accommodate experimental data of neutrino oscillation and $(g-2)\\_{e\\_a}$ anomalies of charged leptons through the inverse seesaw mechanism. We show that the models with the minimal number of inverse seesaw neutrinos can not reach the $1\\sigma$ range of $(g-2)\\_{\\mu}$ data due to the experimental upper bounds on decay rates of $(\\tau \\to \\mu \\gamma)$ and $(\\mu \\to e \\gamma)$. Features of LFV decays are presented in detail, focusing on the regions of parameter space satisfying the $1\\sigma$ ranges of $(g-2)\\_{e,\\mu}$ data.\n\n", "2404.05354": "2024-04-08, **Search for Neutrino Emission from GRB 221009A using the KM3NeT ARCA and ORCA detectors**, S. Aiello et.al., [2404.05354v1](http://arxiv.org/abs/2404.05354v1)\n\n Gamma-ray bursts are promising candidate sources of high-energy astrophysical neutrinos. The recent GRB 221009A event, identified as the brightest gamma-ray burst ever detected, provides a unique opportunity to investigate hadronic emissions involving neutrinos. The KM3NeT undersea neutrino detectors participated in the worldwide follow-up effort triggered by the event, searching for neutrino events. In this letter, we summarize subsequent searches, in a wide energy range from MeV up to a few PeVs. No neutrino events are found in any of the searches performed. Upper limits on the neutrino emission associated with GRB 221009A are computed.\n\n"}, "dark matter": {"2404.05704": "2024-04-08, **Novel collider signatures in the type-I 2HDM+$a$ model**, Spyros Argyropoulos et.al., [2404.05704v1](http://arxiv.org/abs/2404.05704v1)\n\n The 2HDM+$a$ model is one of the main models used in the interpretations of dark matter searches at the LHC. So far, all the 2HDM+$a$ benchmarks considered by the ATLAS and CMS experiments are limited to a type-II Yukawa sector, in which the Higgs bosons $A$, $H$, and $H^\\pm$ are all constrained to be mass-degenerate and heavier than around $600 \\, {\\rm GeV}$. In this work, we present the first detailed study of 2HDM+$a$ models with a type-I Yukawa sector, which, for moderate values of $\\tan\\beta$, lift the constraints from flavour physics, allowing the extra Higgs bosons to be even lighter than the $125 \\, {\\rm GeV}$ Higgs boson discovered at the LHC. We discuss several benchmarks where the $A$, $H$, and $H^\\pm$ states are not necessarily mass-degenerate and the signatures that arise in these models, some of which have not yet been explored at the LHC. We present the dominant channels in the studied benchmarks and the expected sensitivity in Run 2 data using truth-level analyses and discuss potential improvements in the experimental searches for Run 3.\n\n", "2404.05691": "2024-04-08, **GW230529_181500: A Potential Primordial Binary Black Hole Merger in the Mass Gap**, Qing-Guo Huang et.al., [2404.05691v1](http://arxiv.org/abs/2404.05691v1)\n\n During the fourth observing run of the LIGO-Virgo-KAGRA detector network, the LIGO Livingston observatory detected a coalescing compact binary, GW230529\\_181500, with component masses of $2.5-4.5\\, M\\_\\odot$ and $1.2-2.0\\, M\\_\\odot$ at the $90\\%$ credible level. The gravitational-wave data alone is insufficient to determine whether the components are neutron stars or black holes. In this paper, we propose that GW230529\\_181500 originated from the merger of two primordial black holes (PBHs). We estimate a merger rate of $5.0^{+47.0}\\_{-4.9} \\mathrm{Gpc}^{-3}\\,\\mathrm{yr}^{-1}$ for compact binary coalescences with properties similar to GW230529\\_181500. Assuming the source is a PBH-PBH merger, GW230529-like events lead to approximately $1.7^{+36.2}\\_{-1.5} \\times 10^{-3}$ of the dark matter in the form of PBHs. The required abundance of PBHs to explain this event is consistent with existing upper limits derived from microlensing, cosmic microwave background observations and the null detection of gravitational wave background by LIGO-Virgo-KAGRA.\n\n", "2404.05676": "2024-04-08, **Dark matter free dwarf galaxy formation at the the tips of the tentacles of jellyfish galaxies**, V. Lora et.al., [2404.05676v1](http://arxiv.org/abs/2404.05676v1)\n\n When falling into a galaxy cluster, galaxies experience a loss of gas due to ram pressure stripping. In particular, disk galaxies lose gas from their disks and very large tentacles of gas can be formed. Because of the morphology of these stripped galaxies they have been referred to as Jellyfish galaxies. It has been found that star formation is triggered not only in the disk, but also in the tentacles of such Jellyfish galaxies. The observed star forming regions located in the tentacles of those galaxies have been found to be as massive as $3\\times10^7$ M$\\_{\\odot}$ and with sizes $> 100$ pc. Interestingly, these parameters in mass and size agree with those of dwarf galaxies. In this work we make use of the state of the art magneto-hydrodynamical cosmological simulation Illustris TNG-50, to study massive jellyfish galaxies with long tentacles. We find that, in the tentacles of TNG-50 Jellyfish galaxies, the star formation regions (gas+stars) formed could be as massive as $\\sim2\\times10^8$ M$\\_{\\odot}$. A particular star forming region was analyzed. This region has a star formation rate of $0.04$ M$\\_{\\odot}$/yr, it is metal rich, has an average age of $0.46$ Gyr, and has a half mass radius of $\\sim1$ kpc, typical of standard dwarf galaxies. Most importantly, this region is gravitationally self-bound. All and all, we identify a new type of dwarf galaxy being born from the gas tentacles of jellyfish galaxies, that by construction lacks a dark matter (hereafter DM) halo.\n\n", "2404.05597": "2024-04-08, **Little Rip and Pseudo Rip cosmological models with coupled dark energy based on a new generalized entropy**, I. Brevik et.al., [2404.05597v1](http://arxiv.org/abs/2404.05597v1)\n\n We study Little Rip (LR) and Pseudo Rip (PR) cosmological models containing two coupled fluids: dark energy and dark matter. We assume a spatially flat Friedmann-Robertson-Walker (FRW) universe. The interaction between the dark energy and the dark matter fluid components is described in terms of the parameters in the generalized equation of state (EoS) in presence of the bulk viscosity. We consider entropic cosmology and use a description based on a new generalized entropy function, which was proposed by Nojiri-Odintsov-Faraoni [1]. Conditions for the appearance of the (LR) and the (PR) in terms of the parameters of the (EoS) are obtained. Introducing an energy density $\\rho\\_g$ corresponding to a specified entropy function $S\\_g$, together with an interaction term $Q$ in the gravitational equations of motion, we derive modified forms of the EoS parameters. We discuss the corrections of the thermodynamic parameters associated with the generalized entropy function. Properties of the late universe as well as in the early universe in this formalism are pointed out.\n\n", "2404.05430": "2024-04-08, **New ideas on the formation and astrophysical detection of primordial black holes**, Marcos M. Flores et.al., [2404.05430v1](http://arxiv.org/abs/2404.05430v1)\n\n Recently, a number of novel scenarios for primordial black hole (PBH) formation have been discovered. Some of them require very minimal new physics, some others require no new ingredients besides those already present in commonly considered models, such as supersymmetry. At the same time, new strategies have emerged for detection of PBHs. For example, an observation of an orphan kilonova unaccompanied by the gravitational waves signal of merging neutron stars, but associated with a fast radio burst, could be a smoking gun of PBH dark matter. We review some new ideas for PBH formation and detection.\n\n", "2404.05421": "2024-04-08, **The $κ$-model under test of the SPARC database**, Gianni Pascoli et.al., [2404.05421v1](http://arxiv.org/abs/2404.05421v1)\n\n Our main goal is here to make a comparative analysis between the well-known MOND theory and a more recent model called$\\kappa$-model. An additional connection, between the $\\kappa$-model and twoother novel MOND-type theories: Newtonian Fractional-DimensionGravity (NFDG) and Refracted Gravity (RG), is likewise presented.All these models are built to overtake the DM paradigm, or at leastto strongly reduce the dark matter content. Whereas they rely ondifferent formalisms, however, all four seem to suggest that the universal parameter, a0, appearing in MOND theory could intrinsicallybe correlated to either the sole baryonic mean mass density (RG and$\\kappa$-model) and/or to the dimension of the object under consideration(NFDG and $\\kappa$-model). We could then confer to the parameter a0 amore flexible status of multiscale parameter, as required to explainthe dynamics together in galaxies and in galaxy clusters. Eventually,the conformal gravity theory (CFT) also seems to have some remotelink with the $\\kappa$-model, even though the first one is an extension ofgeneral relativity, and the second one is Newtonian in essence. The$\\kappa$-model has been tested on a small sample of spiral galaxies and ingalaxy clusters. Now we test this model on a large sample of galaxiesissued from the SPARC database.\n\n", "2404.05400": "2024-04-08, **Generating Galaxy Clusters Mass Density Maps from Mock Multiview Images via Deep Learning**, Daniel de Andres et.al., [2404.05400v1](http://arxiv.org/abs/2404.05400v1)\n\n Galaxy clusters are composed of dark matter, gas and stars. Their dark matter component, which amounts to around 80\\% of the total mass, cannot be directly observed but traced by the distribution of diffused gas and galaxy members. In this work, we aim to infer the cluster's projected total mass distribution from mock observational data, i.e. stars, Sunyaev-Zeldovich, and X-ray, by training deep learning models. To this end, we have created a multiview images dataset from {\\sc{The Three Hundred}} simulation that is optimal for training Machine Learning models. We further study deep learning architectures based on the U-Net to account for single-input and multi-input models. We show that the predicted mass distribution agrees well with the true one.\n\n", "2404.05375": "2024-04-08, **A theoretical perspective on the almost dark galaxy Nube: exploring the fuzzy dark matter model**, Yu-Ming Yang et.al., [2404.05375v1](http://arxiv.org/abs/2404.05375v1)\n\n In recent astronomical observations, an almost dark galaxy, designated as Nube, has unveiled an intriguing anomaly in its stellar distribution. Specifically, Nube exhibits an exceptionally low central brightness, with the 2D half-light radius of its stars far exceeding the typical values found in dwarf galaxies, and even surpassing those observed in ultra-diffuse galaxies (UDGs). This phenomenon is difficult to explain within the framework of cold dark matter (CDM). Meanwhile, due to its ultralight particle mass, fuzzy dark matter (FDM) exhibits a de Broglie wavelength on the order of kiloparsecs under the typical velocities of galaxies. The interference between different modes of the FDM wave gives rise to fluctuations in the gravitational field, which can lead to the dynamical heating of stars within galaxies, resulting in an expansion of their spatial distribution. In this paper, we aim to interpret the anomalous stellar distribution observed in Nube as a consequence of the dynamical heating effect induced by FDM. Our findings suggest that a FDM particle mass around $1-2\\times 10^{-23}$ eV can effectively account for this anomaly. And we propose that the FDM dynamical heating effect provides a new insight into understanding the formation of field UDGs.\n\n", "2404.05332": "2024-04-08, **Dark matter phenomenology and phase transition dynamics of the next to minimal composite Higgs model with dilaton**, Borui Zhang et.al., [2404.05332v1](http://arxiv.org/abs/2404.05332v1)\n\n In this paper, we conduct a comprehensive study of the Next-to-Minimal Composite Higgs Model (NMCHM) extended with a dilaton field $\\chi$ (denoted as NMCHM$\\_\\chi$). A pseudo-Nambu-Goldstone boson (pNGB) $\\eta$, resulting from the SO(6)$\\to$SO(5) breaking, serves as a dark matter (DM) candidate. The inclusion of the dilaton field is helpful for evading the stringent constraints from dark matter direct detection, as it allows for an accidental cancellation between the amplitudes of DM-nucleon scattering, an outcome of the mixing between the dilaton and Higgs fields. The presence of the dilaton field also enriches the phase transition patterns in the early universe. We identify two types of phase transitions: (i) a 1-step phase transition, where the chiral symmetry and electroweak symmetry breaking (EWSB) occur simultaneously, and (ii) a 2-step phase transition, where the chiral symmetry breaking transition takes place first, followed by a second phase transition corresponding to EWSB. Since the first-order phase transitions can be strong due to supercooling in our model, we also examine the stochastic background of gravitational waves generated by these phase transitions. We find that these gravitational waves hold promise for detection in future space-based gravitational wave experiments, such as LISA, Taiji, BBO, and DECIGO.\n\n", "2404.05301": "2024-04-08, **Cosmological fluids with boundary term couplings**, Christian G. Boehmer et.al., [2404.05301v1](http://arxiv.org/abs/2404.05301v1)\n\n Cosmological models can be studied effectively using dynamical systems techniques. Starting from Brown's formulation of the variational principle for relativistic fluids, we introduce new types of couplings involving a perfect fluid, a scalar field, and boundary terms. We describe three different coupling models, one of which turns out to be particularly relevant for cosmology. Its behaviour is similar to that of models in which dark matter decays into dark energy. In particular, for a constant coupling, the model mimics well-known dynamical dark energy models while the non-constant couplings offer a rich dynamical structure, unseen before. We are able to achieve this richness whilst working in a two-dimensional phase space. This is a significant advantage which allows us to provide a clear physical interpretation of the key features and draw analogies with previously studied models.\n\n", "2404.05030": "2024-04-07, **Halo asymmetry in the modelling of galaxy clustering**, Anna Durkalec et.al., [2404.05030v1](http://arxiv.org/abs/2404.05030v1)\n\n Conventional studies of galaxy clustering within the framework of halo models typically assume that the density profile of all dark matter haloes can be approximated by the Navarro-Frenk-White (NFW) spherically symmetric profile. However, both modern N-body simulations and observational data suggest that most haloes are either oblate or prolate, and almost never spherical. In this paper we present a modified model of the galaxy correlation function. In addition to the five \"classical\" HOD parameters proposed by Zheng et al. 2007, it includes an additional free parameter $\\phi$ in the modified NFW density profile describing the asymmetry of the host dark matter halo.   Using a subhalo abundance matching model (SHAM), we populate galaxies within BolshoiP N-body simulations. We compute the projected two-point correlation function $w\\_p(r\\_p)$ for six stellar mass volume limited galaxy samples. We fit our model to the results, and then compare the best-fit asymmetry parameter $\\phi$ (and other halo parameters) to the asymmetry of dark matter haloes measured directly from the simulations and find that they agree within 1$\\sigma$. We then fit our model to the $w\\_p(r\\_p)$ results from Zehavi et al. 2011 and compare halo parameters. We show that our model accurately retrieves the halo asymmetry and other halo parameters. Additionally, we find $2-6\\%$ differences between the halo masses ($\\log M\\_{min}$ and $\\log M\\_1$) estimated by our model and \"classical\" HOD models. The model proposed in this paper can serve as an alternative to multiparameter HOD models, since it can be used for relatively small samples of galaxies.\n\n", "2404.04926": "2024-04-07, **On the cosmological abundance of magnetic monopoles**, Chen Zhang et.al., [2404.04926v1](http://arxiv.org/abs/2404.04926v1)\n\n We demonstrate that Debye shielding cannot be employed to constrain the cosmological abundance of magnetic monopoles, contrary to what is stated in the previous literature. Current model-independent bounds on the monopole abundance are then revisited for unit Dirac magnetic charge. We find that the Andromeda Parker bound can be employed to set an upper limit on the monopole flux at the level of $F\\_M\\lesssim 5.3\\times 10^{-19}\\,\\text{cm}^{-2}\\text{s}^{-1}\\text{sr}^{-1}$ for a monopole mass $10^{13}\\,\\text{GeV}/c^2\\lesssim m\\lesssim 10^{16}\\,\\text{GeV}/c^2$, which is more stringent than the MACRO direct search limit by two orders of magnitude. This translates into stringent constraints on the monopole density parameter $\\Omega\\_M$ at the level of $10^{-7}-10^{-4}$ depending on the mass. For larger monopole masses the scenarios in which magnetic monopoles account for all or the majority of dark matter are disfavored.\n\n", "2404.04881": "2024-04-07, **Constraining Axion-Like Particles Dark Matter in Coma Berenices with FAST**, Wen-Qing Guo et.al., [2404.04881v1](http://arxiv.org/abs/2404.04881v1)\n\n Axions and axion-like particles (ALPs) appear in many extensions of the Standard Model and are being investigated as promising dark matter (DM) candidates. One viable methodology for their detection involves the investigation of the line-like radio emissions from the dwarf spheroidal galaxy, potentially originating from the radiative decay of ALPs or the conversion of ALPs in the magnetic field. In this work, we constrain the properties of ALPs using the 2-hour radio observation of Coma Berenices through the Five-hundred-meter Aperture Spherical radio Telescope (FAST). The $\\rm 95\\%$ upper limits of the ALP-photon coupling are calculated for the ALP decay and conversion scenarios, respectively. Note that the sensitive ALP masses for FAST range from $\\sim \\mu \\rm eV$ to tens of $\\mu \\rm eV$, where ALP can explain the DM abundance naturally. However, our limits are weaker than those of the CAST helioscope, which can provide an independent and complementary check on the ALP non-detection for ground experiments. Furthermore, we evaluate the expected sensitivity on the ALP of FAST with its full designed bandwidth (70 $\\rm MHz$ - 3 $\\rm GHz$) for 100 hours of observation time. Our results indicate that, even with the exceptional sensitivity of the FAST, it is challenging to surpass the existing experimental constraints on ALP DM using radio observation of dSphs, unless the possible enhancements of ALP signals by compact stars in dSphs are considered.\n\n", "2404.04827": "2024-04-07, **Dark Matter-Induced Low-Mass Gap Black Hole Echoing LVK Observations**, Shuailiang Ge et.al., [2404.04827v1](http://arxiv.org/abs/2404.04827v1)\n\n The recent detection of gravitational waves from a binary merger involving a potential low-mass gap black hole (LMBH) by LIGO-Virgo-KAGRA (LVK) Collaboration motivates investigations into mechanisms beyond conventional stellar evolution theories to account for their existence. We study a mechanism in which dark matter (DM), through its capture and accumulation inside main sequence stars, induces the formation of black holes within the mass range of $[3, 5]M\\_\\odot$. We examine the distribution of these LMBHs as a function of galaxy halo mass, particularly when paired with neutron stars. This gives a distinct signature that can be tested with future gravitational wave observations. We find that a viable portion of the DM parameter space predicts a merger rate of such binaries consistent with LVK observations.\n\n"}, "supernova": {"2404.05725": "2024-04-08, **The MOSDEF Survey: Properties of Warm Ionised Outflows at $z=$ 1.4-3.8**, Andrew Weldon et.al., [2404.05725v1](http://arxiv.org/abs/2404.05725v1)\n\n We use the large spectroscopic data set of the MOSFIRE Deep Evolution Field survey to investigate the kinematics and energetics of ionised gas outflows. Using a sample of 598 star-forming galaxies at redshift 1.4 < $z$ < 3.8, we decompose $\\rm{H}\\alpha$ and [OIII] emission lines into narrow and broad components, finding significant detections of broad components in 10% of the sample. The ionised outflow velocity from individual galaxies appears independent of galaxy properties, such as stellar mass, star-formation rate (SFR), and star-formation-rate surface density ($\\Sigma\\_{\\rm SFR}$). Adopting a simple outflow model, we estimate the mass-, energy- and momentum-loading factors of the ionised outflows, finding modest values with averages of 0.33, 0.04, and 0.22, respectively. The larger momentum- than energy-loading factors, for the adopted physical parameters, imply that these ionised outflows are primarily momentum-driven. We further find a marginal correlation (2.5$\\sigma$) between the mass-loading factor and stellar mass in agreement with predictions by simulations, scaling as $\\eta\\_{m}$ $\\propto M\\_{\\star}^{-0.45}$. This shallow scaling relation is consistent with these ionised outflows being driven by a combination of mechanical energy generated by supernovae explosions and radiation pressure acting on dusty material. In a majority of galaxies, the outflowing material does not appear to have sufficient velocity to escape the gravitational potential of their host, likely recycling back at later times. Together, these results suggest that the ionised outflows traced by nebular emission lines are negligible, with the bulk of mass and energy carried out in other gaseous phases.\n\n", "2404.05715": "2024-04-08, **Reconstructing the recombination history by combining early and late cosmological probes**, Gabriel P. Lynch et.al., [2404.05715v1](http://arxiv.org/abs/2404.05715v1)\n\n We develop and apply a new framework for reconstructing the ionization history during the epoch of recombination with combinations of cosmic microwave background (CMB), baryon acoustic oscillation (BAO) and supernova data. We find a wide range of ionization histories that are consistent with current CMB data, and also that cosmological parameter constraints are significantly weakened once freedom in recombination is introduced. BAO data partially break the degeneracy between cosmological parameters and the recombination model, and are therefore important in these reconstructions. The 95% confidence upper limits on H0 are 80.1 (70.7) km/s/Mpc given CMB (CMB+BAO) data, assuming no other changes are made to the standard cosmological model. Including Cepheid-calibrated supernova data in the analysis drives a preference for non-standard recombination histories with visibility functions that peak early and exhibit appreciable skewness. Forthcoming measurements from SPT-3G will reduce the uncertainties in our reconstructions by about a factor of two.\n\n", "2404.05651": "2024-04-08, **The persistence of high altitude non-equilibrium diffuse ionized gas in simulations of star forming galaxies**, Lewis McCallum et.al., [2404.05651v1](http://arxiv.org/abs/2404.05651v1)\n\n Widespread, high altitude, diffuse ionized gas with scale heights of around a kiloparsec is observed in the Milky Way and other star forming galaxies. Numerical radiation-magnetohydrodynamic simulations of a supernova-driven turbulent interstellar medium show that gas can be driven to high altitudes above the galactic midplane, but the degree of ionization is often less than inferred from observations. For computational expediency, ionizing radiation from massive stars is often included as a post-processing step assuming ionization equilibrium. We extend our simulations of a Milky Way-like interstellar medium to include the combined effect of supernovae and photoionization feedback from midplane OB stars and a population of hot evolved low mass stars. The diffuse ionized gas has densities below 0.1 ${\\rm cm^{-3}}$, so recombination timescales can exceed millions of years. Our simulations now follow the time-dependent ionization and recombination of low density gas. The long recombination timescales result in diffuse ionized gas that persists at large altitudes long after the deaths of massive stars that produce the vast majority of the ionized gas. The diffuse ionized gas does not exhibit the large variability inherent in simulations that adopt ionization equilibrium. The vertical distribution of neutral and ionized gas is close to what is observed in the Milky Way. The volume filling factor of ionised gas increases with altitude resulting in the scale height of free electrons being larger than that inferred from H$\\alpha$ emission, thus reconciling the observations of ionized gas made in H$\\alpha$ and from pulsar dispersion measurements.\n\n", "2404.05408": "2024-04-08, **A new solution of the pulsar equation**, Ioannis Contopoulos et.al., [2404.05408v1](http://arxiv.org/abs/2404.05408v1)\n\n We present the first new type of solution of the pulsar equation since 1999. In it, the whole magnetosphere is confined inside the light cylinder and an electrically charged layer wraps around it and holds it together. The reason this new solution has never been obtained before is that all current time-dependent simulations are initialized with a vacuum dipole configuration that extends to infinity, thus their final steady-state solution also extends to infinity. Under special conditions, such a confined configuration may be attained when the neutron star first forms in the interior of a collapsing star during a supernova explosion, or when it accretes from an external wind or disk from a donor star. It is shown that this new maximally closed non-decelerating solution is the limit of a continuous sequence of standard magnetospheres with open and closed field lines when the amount of open field lines gradually drops to zero. The minimum energy solution in this sequence is a standard magnetosphere in which the closed field line region extends up to about 80% of the light cylinder. We estimate that the released energy when the new solution transitions to the minimum energy one is enough to power a fast radio burst.\n\n", "2404.05371": "2024-04-08, **Constraints on the dense matter equation of state from young and cold isolated neutron stars**, Alessio Marino et.al., [2404.05371v1](http://arxiv.org/abs/2404.05371v1)\n\n Neutron stars are the dense and highly magnetic relics of supernova explosions of massive stars. The quest to constrain the Equation of State (EoS) of ultra-dense matter and thereby probe the behavior of matter inside neutron stars, is one of the core goals of modern physics and astrophysics. A promising method involves investigating the long-term cooling of neutron stars, and comparing theoretical predictions with various sources at different ages. However, limited observational data, and uncertainties in source ages and distances, have hindered this approach. In this work, re-analyzing XMM-Newton and Chandra data from dozens of thermally emitting isolated neutron stars, we have identified three sources with unexpectedly cold surface temperatures for their young ages. To investigate these anomalies, we conducted magneto-thermal simulations across diverse mass and magnetic fields, considering three different EoS. We found that the \"minimal\" cooling model, failed to explain the observations, regardless the mass and the magnetic field, as validated by a machine learning classification method. The existence of these young cold neutron stars suggests that any dense matter EoS must be compatible with a fast cooling process at least in certain mass ranges, eliminating a significant portion of current EoS options according to recent meta-modelling analysis.\n\n", "2404.05171": "2024-04-08, **A Monte-Carlo Simulation on Resonant Scattering of X-ray Line Emission in Supernova Remnants**, Yiping Li et.al., [2404.05171v1](http://arxiv.org/abs/2404.05171v1)\n\n Resonant scattering (RS) of X-ray line emission in supernova remnants (SNRs) may modify the observed line profiles and fluxes and has potential impact on estimating the physical properties of the hot gas and hence on understanding the SNR physics, but has not been theoretically modeled ever. Here we present our Monte-Carlo simulation of RS effect on X-ray resonant-line emission, typified by O VII He$\\alpha$ r line, from SNRs. We employ the physical conditions characterized by the Sedov-Taylor solution and some basic parameters similar to those in Cygnus Loop. We show that the impact of RS effect is most significant near the edge of the remnant. The line profiles are predicted to be asymmetric because of different temperatures and photon production efficiencies of the expanding gas at different radii. We also predict the surface brightness of the line emission would decrease in the outer projected region but is slightly enhanced in the inner. The G-ratio of the OVII He$\\alpha$ triplet can be effectively elevated by RS in the outer region. We show that RS effect of the O VII He$\\alpha$ r line in the southwestern boundary region of Cygnus Loop is non-negligible. The observed OVII G-ratio $\\sim$1.8 of the region could be achieved with RS taken into account for properly elevated O abundance from the previous estimates. Additional simulation performed for the SNRs in ejecta-dominated phase like Cas A shows that RS in the shocked ejecta may have some apparently effects on the observational properties of oxygen resonant lines.\n\n", "2404.05135": "2024-04-08, **Searching for Magnetar Binaries Disrupted by Core-Collapse Supernovae**, Myles B. Sherman et.al., [2404.05135v1](http://arxiv.org/abs/2404.05135v1)\n\n Core-collapse Supernovae (CCSNe) are considered to be the primary magnetar formation channel, with 15 magnetars associated with supernova remnants (SNRs). A large fraction of these should occur in massive stellar binaries that are disrupted by the explosion, meaning that $\\sim45\\%$ of magnetars should be nearby high-velocity stars. Here we conduct a multi-wavelength search for unbound stars, magnetar binaries, and SNR shells using public optical ($uvgrizy-$bands), infrared ($J-$, $H-$, $K-$, and $K\\_s-$bands), and radio ($888$ MHz, $1.4$ GHz, and $3$ GHz) catalogs. We use Monte Carlo analyses of candidates to estimate the probability of association with a given magnetar based on their proximity, distance, proper motion, and magnitude. In addition to recovering a proposed magnetar binary, a proposed unbound binary, and 13 of 15 magnetar SNRs, we identify two new candidate unbound systems: an OB star from the Gaia catalog we associate with SGR J1822.3-1606, and an X-ray pulsar we associate with 3XMM J185246.6+003317. Using a Markov-Chain Monte Carlo simulation that assumes all magnetars descend from CCSNe, we constrain the fraction of magnetars with unbound companions to $5\\lesssim f\\_u \\lesssim 24\\%$, which disagrees with population synthesis results. Alternate formation channels are unlikely to wholly account for the lack of unbound binaries as this would require $31\\lesssim f\\_{nc} \\lesssim 66\\%$ of magnetars to descend from such channels. Our results support a high fraction ($48\\lesssim f\\_m \\lesssim 86\\%$) of pre-CCSN mergers, which can amplify fossil magnetic fields to preferentially form magnetars.\n\n", "2404.04835": "2024-04-07, **A born ultramassive white dwarf-hot subdwarf super-Chandrasekhar candidate**, Changqing Luo et.al., [2404.04835v1](http://arxiv.org/abs/2404.04835v1)\n\n Although supernovae is a well-known endpoint of an accreting white dwarf, alternative theoretical possibilities has been discussing broadly, such as the accretion-induced collapse (AIC) event as the endpoint of oxygen-neon (ONe) white dwarfs, either accreting up to or merging to excess the Chandrasekhar limit (the maximum mass of a stable white dwarf). AIC is an important channel to form neutron stars, especially for those unusual systems, which are hardly produced by core-collapse supernovae. However, the observational evidences for this theoretical predicted event and its progenitor are all very limited. In all of the known progenitors, white dwarfs increase in mass by accretion. Here, we report the discovery of an intriguing binary system Lan 11, consisted of a stripped core-helium-burning hot subdwarf and an unseen compact object of 1.08 to 1.35 $M\\_{\\odot}$. Our binary population synthesis calculations, along with the absence of detection from the deep radio observations of the Five-hundred-meter Aperture Spherical Radio Telescope, strongly suggest that the latter is an ONe white dwarf. The total mass of this binary is 1.67 to 1.92 $M\\_{\\odot}$}, significantly excessing the Chandrasekhar limit. The reproduction of its evolutionary history indicates that the unique system has undergone two phases of common envelope ejections, implying a born nature of this massive ONe white dwarf rather than an accretion growth from its companion. These results, together with short orbital period of this binary (3.65 hours), suggest that this system will merge in 500-540 Myr, largely triggering an AIC event, although the possibility of type Ia supernova cannot be fully ruled out. This finding greatly provides valuable constraints on our understanding of stellar endpoints, whatever leading to an AIC or a supernova.\n\n", "2404.04786": "2024-04-07, **Reconciling the HESS J1731-347 constraints with Parity doublet model**, Bikai Gao et.al., [2404.04786v1](http://arxiv.org/abs/2404.04786v1)\n\n The recent discovery of a central compact object (CCO) within the supernova remnant HESS J1731-347, characterized by a mass of approximately $0.77^{+0.20}\\_{-0.17} M\\_{\\odot}$ and a radius of about $10.4^{+0.86}\\_{-0.78}$ km, has opened up a new window for the study of compact objects. This CCO is particularly intriguing because it is the lightest and smallest compact object ever observed, raising questions and challenging the existing theories. To account for this light compact star, a mean-field model within the framework of parity doublet structure is applied to describe the hadron matter. Inside the model, part of the nucleon mass is associated with the chiral symmetry breaking while the other part is from the chiral invariant mass $m\\_0$ which is insensitive to the temperature/density. The value of $m\\_0$ affects the nuclear equation of state for uniform nuclear matter at low density and exhibits strong correlations with the radii of neutron stars.   We point out that HESS J1731-347 can be explained as the lightest neutron star for $m\\_0 \\simeq 850$\\,MeV.\n\n", "2404.04778": "2024-04-07, **Thermal X-ray Emission in the Western Half of the LMC Superbubble 30 Dor C**, Yi-Heng Chi et.al., [2404.04778v1](http://arxiv.org/abs/2404.04778v1)\n\n While 30 Dor C is a unique superbubble in the Large Magellanic Cloud for its luminous non-thermal X-ray emission, the thermal X-ray emission it emanates has not yet been thoroughly investigated and well constrained. Based on the separate ~1 Ms deep XMM-Newton and Chandra observations, we report the discovery of the thermally-emitting plasma in some portions of the western half of 30 Dor C. The thermal emission can be reproduced by a collisional-ionization-equilibrium plasma model with an average electron temperature of ~0.4 keV. We find a significant overabundance of the intermediate-mass elements such as O, Ne, Mg, and Si, which may be indicative of a recent supernova explosion in 30 Dor C. Dynamical properties in combination with the information of the OB association LH 90 suggest that the internal post-main-sequence stars dominate the power of the superbubble and blow it out in the past ~1 Myr.\n\n"}}