{"neutrino": {"2507.02840": "2025-07-03, **Neutrino mixing parameters and masses from $Δ(96)\\rtimes H_{CP}$ in the tri-direct CP approach**, Li-Na Yan et.al., [2507.02840v1](http://arxiv.org/abs/2507.02840v1)\n\n We present a comprehensive model independent analysis of all breaking patterns resulting from $\\Delta(96)\\rtimes H\\_{CP}$ in the tri-direct CP approach of the minimal seesaw model with two right-handed neutrinos. The three generations of left-handed lepton doublets are assumed to transform as the irreducible triplet $\\bm{3\\_{0}}$ of $\\Delta(96)$, and the two right-handed neutrinos are assigned to singlets. In the case that both flavon fields $\\phi\\_{\\text{atm}}$ and $\\phi\\_{\\text{sol}}$ transform as triplet $\\bm{\\bar{3}\\_{0}}$, only one phenomenologically viable lepton mixing pattern is obtained for normal ordering neutrino masses. The lepton mixing matrix is predicted to be TM1 pattern, with neutrino masses, mixing angles, and CP violation phases depending on only three real input parameters. When $\\phi\\_{\\text{sol}}$ is assigned to the $\\bm{\\bar{3}\\_{1}}$ representation, an additional real parameter $x$ must be included. Then we find 42 independent phenomenologically interesting mixing patterns, and the corresponding predictions for lepton mixing parameters and neutrino masses are obtained. Furthermore, we perform a detailed numerical analysis for five example breaking patterns with some benchmark values of $x$. The absolute values of the first columns of PMNS matrix are fixed to be $\\left(\\sqrt{\\frac{2}{3}},\\frac{1}{\\sqrt{6}},\\frac{1}{\\sqrt{6}}\\right)^{T}$, $\\frac{1}{5}\\left(\\sqrt{17},2,2\\right)^{T}$, $\\frac{1}{\\sqrt{38}}\\left(5,2,3\\right)^{T}$, $\\frac{1}{\\sqrt{57}}\\left(\\sqrt{37},\\sqrt{10},\\sqrt{10}\\right)^{T}$ and $\\frac{1}{3}\\left(\\sqrt{6},1,\\sqrt{2}\\right)^{T}$, respectively.\n\n", "2507.02538": "2025-07-03, **Matching from quark to hadronic operators: external source vs spurion methods**, Gang Li et.al., [2507.02538v1](http://arxiv.org/abs/2507.02538v1)\n\n Various weak processes at the hadronic scale have been utilized to search for new physics at high energy scale, which can be described by the QCD chiral Lagrangian matched from the low-energy effective theory (LEFT). Utilizing the chiral symmetry $SU(2)\\_L\\times SU(2)\\_R \\to SU(2)\\_V$ at the quark and hadronic levels, we make a comprehensive comparison of various matching methods, including the external source method, conventional spurion method, and our systematic spurion method. Although different methods show agreements for dimension-6 LEFT operator matching, we find that for higher-dimensional operators, the external source method is quite limited or inapplicable, the conventional spurion methods needs to introduce more and more spurions, while our spurion method does not need to introduce any new spurions than the ones in the dimension-6 matching. Using minimal set of spurions, we thus establish an one-to-one correspondence between the LEFT and chiral operators, with several examples, such as derivative operators at dimensions 7 and 8 with a single bilinear, four-quark operators at the dimension-9 level with two quark bilinears, which can be applied to the study of neutrino/electron scatterings and neutrinoless double beta decay.\n\n", "2507.02326": "2025-07-03, **Hadronic origin of the very high-energy gamma-ray emission from the low-luminosity AGN in NGC 4278**, Asahi Shoji et.al., [2507.02326v1](http://arxiv.org/abs/2507.02326v1)\n\n The Large High Altitude Air Shower Observatory has detected very high-energy (VHE) gamma rays from NGC 4278, which is known to host a low-luminosity active galactic nucleus (AGN). Having only very weak radio jets, the origin of its VHE gamma rays is unclear. In this paper we first show that NGC 4278 has a massive molecular cloud surrounding the nucleus by analyzing data taken with the Atacama Large Millimeter/submillimeter Array. We then assume that cosmic ray protons are accelerated in a radiatively inefficient accretion flow around the supermassive black hole, which diffuse into the molecular cloud and produce gamma rays and neutrinos via $pp$ interactions. We model the gamma-ray spectra and find that the observations can be explained by such hadronic processes if the AGN activity was higher in the past than at present, and the diffusion coefficient in the molecular cloud is appreciably smaller than in the Milky Way interstellar medium. However, we also show that the high-energy neutrinos co-produced with the gamma rays are unlikely to be detectable even with IceCube-Gen2.\n\n", "2507.02246": "2025-07-03, **Prospects for PBR detection of KM3-230213A-like events**, Angela V. Olinto et.al., [2507.02246v1](http://arxiv.org/abs/2507.02246v1)\n\n POEMMA-Balloon with Radio (PBR) is a scaled-down version of the Probe Of Extreme Multi-Messenger Astrophysics (POEMMA) design, optimized to be flown as a payload on one of NASA's sub-orbital super pressure balloons circling the Earth above the southern oceans for a mission duration of more than 20 days. One of the main science objectives of PBR is to follow up astrophysical event alerts in search of neutrinos with very high energy ($10^8 \\lesssim E\\_\\nu /{\\rm GeV} \\lesssim 10^{10}$). Of particular interest for anticipated PBR observations, the KM3NeT Collaboration has recently reported the detection of the neutrino KM3-230213A with $10^{8.1} \\lesssim E\\_\\nu/{\\rm GeV} \\lesssim 10^{8.9}$. Such an unprecedented event is in tension with upper limits on the cosmic neutrino flux from IceCube and the Pierre Auger Observatory: for a diffuse isotropic neutrino flux there is a $3.5\\sigma$ tension between KM3NeT and IceCube measurements, and about $2.6\\sigma$ if the neutrino flux originates in transient sources. Therefore, if KM3-230213A was not beginner's luck, it becomes compelling to consider beyond Standard Model (BSM) possibilities which could lead to a signal at KM3NeT-ARCA but not at IceCube/Auger. We calculate the PBR horizon-range sensitivity to probe BSM physics compatible with observation at KM3NeT-ARCA and non-observation at IceCube/Auger. As an illustration, we consider a particular class of BSM physics models which has been described in the literature as a possible explanation of KM3-230213A.\n\n", "2507.02167": "2025-07-02, **Probing Earth's core using atmospheric neutrino oscillations with NSI**, Krishnamoorthi J et.al., [2507.02167v1](http://arxiv.org/abs/2507.02167v1)\n\n Neutrinos can serve as a complementary and independent tool to gravitational and seismic studies in exploring the interior of Earth, thanks to their unique properties: extremely low interaction cross sections and flavor oscillations. With the precise measurements of neutrino oscillation parameters and observation of the non-zero value of mixing angle $\\theta\\_{13}$, it has become feasible to detect the forward scattering of GeV-energy atmospheric neutrinos passing through Earth with ambient electrons in the form of matter effects on neutrino oscillation probabilities. These matter effects depend on both the neutrino energy and electron density distribution along their path, making them ideally suited for exploring the inner structure of Earth. Furthermore, in the presence of non-standard interactions (NSI) of neutrinos with matter, oscillation patterns undergo additional modifications. In this study, we quantify the capability of an atmospheric neutrino experiment, such as a magnetized iron calorimeter detector, to validate the Earth's core and measure the position of the core-mantle boundary in the presence of NSI. We perform this study considering a three-layered density profile of Earth. Our analysis demonstrates that neutrino non-standard interactions impact these Earth tomography measurements in comparison to standard interactions.\n\n", "2507.02101": "2025-07-02, **Testing T2K's Bayesian constraints with priors in alternate parameterisations**, The T2K Collaboration et.al., [2507.02101v1](http://arxiv.org/abs/2507.02101v1)\n\n Bayesian analysis results require a choice of prior distribution. In long-baseline neutrino oscillation physics, the usual parameterisation of the mixing matrix induces a prior that privileges certain neutrino mass and flavour state symmetries. Here we study the effect of privileging alternate symmetries on the results of the T2K experiment. We find that constraints on the level of CP violation (as given by the Jarlskog invariant) are robust under the choices of prior considered in the analysis. On the other hand, the degree of octant preference for the atmospheric angle depends on which symmetry has been privileged.\n\n", "2507.02063": "2025-07-02, **Primordial high energy neutrinos: theoretical/observational constraints and sharp spectral features**, Nicolas Grimbaum Yamamoto et.al., [2507.02063v1](http://arxiv.org/abs/2507.02063v1)\n\n Among the few ways that allow or could allow us to probe the early Universe from the observation of a flux of primordial particles, there is one possibility which has been little studied: the observation today of high energy neutrinos which could have been emitted shortly after the Big Bang, from the decay or annihilation of early universe relics. We perform a general study of such a possibility. To this end we first emphasise that these neutrinos could display various kinds of sharp spectral features, resulting from the primary energy spectrum at emission, and from how this spectrum is smoothed by redshift and radiative correction effects. Next we determine the ranges of mass (from a fraction of eV all the way to the Planck scale) and lifetime of the source particles along which we do not/we do expect that the sharp spectral feature will be altered by interactions of the neutrinos on their way to the detector, mainly with the cosmic neutrino background or between themselves. We also study the theoretical (i.e. mainly BBN and CMB) and observational constraints which hold on such a possibility. This allows us to delineate the regions of parameter space (mass, lifetime and abundance) that are already excluded, hopeless for future observation or, instead, which could lead to the observation of such neutrinos in the near future.\n\n", "2507.02040": "2025-07-02, **Many-Body Simulations of the Fast Flavor Instability**, Zoha Laraib et.al., [2507.02040v1](http://arxiv.org/abs/2507.02040v1)\n\n The neutrino fast flavor instability dominates the evolution of neutrino flavor within the engines of core-collapse supernovae and neutron star mergers. However, theoretical models of neutrino flavor change that include many-body quantum correlations can differ starkly from similar mean-field calculations. We demonstrate for the first time that the inhomogeneous fast flavor instability is disrupted by many-body correlations using a novel tensor network framework that allows a continuous transition between mean-field and many-body results by tuning the singular value decomposition cutoff value. Generalizing the forward-scattering Hamiltonian to spatially varying conditions, we demonstrate that the timescale of flavor transformation scales logarithmically with system size, suggesting that many-body effects could outpace mean-field instabilities even for realistic neutrino numbers. Our results have significant implications for astrophysical explosion dynamics, nucleosynthesis, and observable neutrino signatures.\n\n", "2507.01962": "2025-07-02, **Sub-keV dark matter can strongly ionize molecular clouds**, Pedro De la Torre Luque et.al., [2507.01962v1](http://arxiv.org/abs/2507.01962v1)\n\n We show that the ionization of dense molecular clouds can be used to set strong constraints on dark matter models producing UV/X-ray photons in their annihilation or decay. We place robust and competitive constraints on various dark matter models, such as axion-like particles, scalars and sterile neutrinos, for masses between $\\sim30$~eV and $10$~keV, and project forecasts to illustrate the potential of this target. We discuss how these constraints can be significantly improved by considering a more refined sample of molecular clouds near the Galactic Center and above the Galactic plane, a detailed modeling of the cosmic-ray ionization contribution and, potentially, a more refined analysis of the gas density in clouds through dust extinction maps. Thus, ionization of molecular clouds emerges as one of the most powerful tools for probing sub-keV dark matter.\n\n", "2507.01895": "2025-07-02, **$E_6$ Unification of Freeze-In Dark Matter and Leptogenesis**, Adeela Afzal et.al., [2507.01895v1](http://arxiv.org/abs/2507.01895v1)\n\n We investigate the possibility of \\emph{freeze-in} dark matter production and baryogenesis in an $E\\_6$ extension of the Standard Model, featuring a residual $U(1)\\_{\\psi'}$ gauge symmetry. This symmetry arises from a linear combination of $U(1)\\chi$ and $U(1)\\_{\\psi}$, both of which are subgroups of the $E\\_6$. The spontaneous breaking of $U(1)\\_{\\psi'}$ symmetry governs the dynamics of a singlet fermion, which naturally serves as a freeze-in dark matter candidate. The dark matter mass arises from dimension-five operators, and a discrete symmetry ensures their stability. We show that freeze-in production from scalar decay can yield the correct relic abundance for dark matter masses between few MeV to a few hundred GeV. Simultaneously, heavy right-handed neutrinos generate light neutrino masses via the type-I seesaw and produce the observed baryon asymmetry via leptogenesis.\n\n", "2507.01893": "2025-07-02, **Measurement of the diffuse astrophysical neutrino flux over six seasons using cascade events from the Baikal-GVD expanding telescope**, Baikal-GVD Collaboration et.al., [2507.01893v1](http://arxiv.org/abs/2507.01893v1)\n\n We present an updated measurement of the diffuse astrophysical neutrino flux using Baikal-GVD cascade data collected between April 2018 to March 2024. In this period, the detector grew from 15% to 55% of its baseline cubic kilometer configuration. The diffuse astrophysical neutrino flux is detected with a statistical significance of 5.1 $\\sigma$. Assuming a single power law model of the astrophysical neutrino flux with identical contribution from each neutrino flavor, the following best-fit parameter values are found: the spectral index $\\gamma\\_{astro}$ = 2.64$^{+0.09}\\_{-0.11}$ and the flux normalization $\\phi\\_{astro}$ = 4.42$^{+2.31}\\_{-1.29}\\times10^{-18} \\text{GeV}^{-1}\\text{cm}^{-2}\\text{s}^{-1}\\text{sr}^{-1}$ per one flavor at 100 TeV. These results are broadly consistent with IceCube measurements.\n\n", "2507.01863": "2025-07-02, **$Λ_b \\to Λ^{(\\ast)}ν\\barν$ decays and the recent Belle-II $B^+\\to K^+ν\\barν$ data**, Diganta Das et.al., [2507.01863v1](http://arxiv.org/abs/2507.01863v1)\n\n The Belle-II experiment has recently reported the first measurement of $B^+ \\to K^+ \\nu\\bar{\\nu}$ decay which exceeds the Standard Model prediction by approximately 2.7$\\sigma$. The deviation may indicate the presence of new physics beyond the Standard Model in the $b\\to s\\nu\\bar{\\nu}$ sector. Under this assumption, we study the hadronic $\\Lambda\\_b \\to \\Lambda(\\to p\\pi)\\nu\\bar{\\nu}$ and $\\Lambda\\_b \\to \\Lambda^\\ast(\\to N\\!\\bar{K})\\nu\\bar{\\nu}$ decays within both the Standard Model and beyond. We work in a low energy effective field theory framework with additional light right-handed neutrinos. We calculate the differential branching ratios of these decay modes and explore the implications of the Belle-II results through various observables.\n\n", "2507.01848": "2025-07-02, **Neutrino mass tension or suppressed growth rate of matter perturbations?**, William Giarè et.al., [2507.01848v1](http://arxiv.org/abs/2507.01848v1)\n\n Assuming a minimal $\\Lambda$CDM cosmology with three massive neutrinos, the joint analysis of Planck cosmic microwave background data, DESI baryon acoustic oscillations, and distance moduli measurements of Type Ia supernovae from the Pantheon+ sample sets an upper bound on the total neutrino mass, $\\sum m\\_\\nu \\lesssim 0.06$-$0.07$ eV, that lies barely above the lower limit from oscillation experiments. These constraints are mainly driven by mild differences in the inferred values of the matter density parameter across different probes that can be alleviated by introducing additional background-level degrees of freedom (e.g., by dynamical dark energy models). However, in this work we explore an alternative possibility. Since both $\\Omega\\_\\mathrm{m}$ and massive neutrinos critically influence the growth of cosmic structures, we test whether the neutrino mass tension may originate from the way matter clusters, rather than from a breakdown of the $\\Lambda$CDM expansion history. To this end, we introduce the growth index $\\gamma$, which characterizes the rate at which matter perturbations grow. Deviations from the standard $\\Lambda$CDM value ($\\gamma \\simeq 0.55$) can capture a broad class of models, including non-minimal dark sector physics and modified gravity. We show that allowing $\\gamma$ to vary significantly relaxes the neutrino mass bounds to $\\sum m\\_\\nu \\lesssim 0.13$-$0.2$ eV, removing any tension with terrestrial constraints without altering the inferred value of $\\Omega\\_\\mathrm{m}$. However, this comes at the cost of departing from standard growth predictions: to have $\\sum m\\_\\nu \\gtrsim 0.06$ eV one needs $\\gamma > 0.55$, and we find a consistent preference for $\\gamma > 0.55$ at the level of $\\sim 2\\sigma$. This preference increases to $\\sim 2.5$-$3\\sigma$ when a physically motivated prior $\\sum m\\_\\nu \\ge 0.06$ eV from oscillation experiments is imposed.\n\n", "2507.01815": "2025-07-02, **Ge-based Quantum Sensors for Low-Energy Physics**, D. -M. Mei et.al., [2507.01815v1](http://arxiv.org/abs/2507.01815v1)\n\n We present \\textbf{GeQuLEP} (Germanium-based Quantum Sensors for Low-Energy Physics), a conceptual design for an advanced quantum sensing platform integrating high-purity germanium (Ge) crystals with engineered phononic crystal cavities. At cryogenic temperatures, these cavities naturally host dipole-bound states, effectively forming quantum dots coupled to radio-frequency quantum point contact (RF-QPC) readout systems. This innovative coupling approach promises ultra-sensitive phonon-mediated charge detection through phonon-induced charge displacement. GeQuLEP is specifically designed to achieve exceptionally low detection thresholds, theoretically enabling single primary phonon sensitivity with anticipated energy depositions as low as \\textbf{0.00745~eV}. This unprecedented sensitivity, if realized experimentally, would provide unique access to searches for low-mass dark matter down to the keV/$c^2$ mass range via nuclear and electronic recoils. Additionally, GeQuLEP aims to facilitate the real-time detection of solar \\textit{pp} neutrinos through coherent elastic neutrino--nucleus scattering (CE$\\nu$NS). By combining phonon-based quantum transduction with quantum-classical hybrid readout schemes, the GeQuLEP architecture represents a scalable, contact-free phonon spectroscopy design that could significantly advance the capabilities of ultra-low-energy rare-event detection at the quantum limit.\n\n", "2507.01675": "2025-07-02, **Extending the sensitivity of heavy sterile neutrino searches with solar neutrino experiments**, Yutao Zhu et.al., [2507.01675v1](http://arxiv.org/abs/2507.01675v1)\n\n A sensitivity study of the search for heavy sterile neutrinos ($\\nu\\_H$) in the MeV mass range using solar neutrino experiments is presented. $\\nu\\_H$, with masses ranging from a few MeV up to 15 MeV, can be produced in the Sun through $^8$B decay and subsequently decay into $\\nu\\_e e^+ e^-$. Its flux and lifetime strongly depend on the mixing parameter $\\|U\\_{eH}\\|^2$ and mass $m\\_{\\nu\\_H}$. The $\\nu\\_H$ signal can be detected via its decay products, either the $e^+e^-$ pair or $\\nu\\_e$, depending on whether $\\nu\\_H$ decays inside or outside the detector. Expected signal yields for both detection methods (detecting $e^+e^-$ or $\\nu\\_e$ signal) are presented across the full $\\|U\\_{eH}\\|^2$ and $m\\_{\\nu\\_H}$ parameter space. These two methods are found to be complementary in different regions of the $\\|U\\_{eH}\\|^2$ and $m\\_{\\nu\\_H}$ phase space. By combining both approaches, we anticipate observing at least a handful of signal events across most of the parameter space of $10^{-6} < \\|U\\_{eH}\\|^2 < 1$ and 2 MeV $< m\\_{\\nu\\_H} < $ 14 MeV, assuming a 500-ton solar neutrino experiment operating for one year. Key variables, such as the energy spectra of $\\nu\\_e$ or $e^+e^-$ and the $\\nu\\_e$ solar angle, are also discussed to help distinguish signal from major backgrounds, such as solar neutrino events.\n\n", "2507.01505": "2025-07-02, **Numerical treatment of annual modulation of relic neutrinos**, Fabian Zimmer et.al., [2507.01505v1](http://arxiv.org/abs/2507.01505v1)\n\n We present a numerical treatment of the annual modulation of relic neutrinos due to the Sun's gravitational influence. Extending our previously developed N-1-body simulation framework from Milky Way scales to solar system dynamics, we model how cosmic neutrino background densities might vary throughout Earth's orbital cycle. We validate our numerical approach against analytical expectations from previous studies that assumed idealized relic neutrino populations. Our results suggest that the prior gravitational history of neutrinos traversing asymmetric dark matter distributions can affect annual modulation patterns. While our simulations reproduce modulation amplitudes similar to analytical predictions for heavier neutrinos, we find that the amplitude can vary considerably depending on the specific morphology of dark matter halos. These findings highlight the importance of incorporating realistic structure formation effects when predicting potential observational relic neutrino signatures.\n\n", "2507.01480": "2025-07-02, **A Factorized Mass Structure of Fermions and Its Fit**, Qingfeng Cao et.al., [2507.01480v1](http://arxiv.org/abs/2507.01480v1)\n\n The structure of the mass matrix, a challenging problem in the Standard Model, is closely related to flavor phenomenology and the understanding of the Yukawa interaction. We derive a factorized mass structure based on observed fermion mass hierarchies, investigating the role of $SO(2)^f$ family symmetry in explaining the approximate degeneracy of light quark generations and its connection to flavor mixing. Our calculation includes the slightest modification from the lightest fermions by $\\mathcal{O}(h^2)$ hierarchy corrections. Using this model-independent framework, we systematically analyze all mass patterns and perform comprehensive fits to both quark CKM and lepton PMNS mixing data with extended normal-ordered Dirac neutrinos. The results demonstrate this framework's capacity to unify flavor phenomena while simultaneously providing new insights into the fundamental nature of Yukawa interactions.\n\n"}, "dark matter": {"2507.02821": "2025-07-03, **Relativistic accretion and burdened primordial black holes**, Suvashis Maity et.al., [2507.02821v1](http://arxiv.org/abs/2507.02821v1)\n\n We examine the joint effects of relativistic accretion and memory burdened evaporation on the evolution of primordial black holes (PBHs). The memory burden effect, which delays the evaporation by inducing a backreaction and making the evaporation rate scale as an inverse power law of the PBH entropy, opens up a new window that allows PBHs with $M \\lesssim 10^{15}~\\mathrm{g}$ to survive until the present epoch. Meanwhile, accretion increases the mass of PBHs, thereby enhancing their chances of survival for a given initial mass. We consider two main scenarios: one where PBHs evaporate completely before big bang nucleosynthesis, and another where PBHs persist until today. In the case of evaporation, we analyse the emission of dark matter (DM) and dark radiation (DR) during the process of evaporation. Conversely, in the other case, the surviving PBHs themselves can contribute as DM. We further investigate how relativistic and non-relativistic accretion, together with memory burdened evaporation, impact the parameter space of the emitted DM, the abundance of stable PBHs as DM, and the contribution of DR to the effective number of relativistic degrees of freedom, $\\Delta N\\_{\\mathrm{eff}}$.\n\n", "2507.02811": "2025-07-03, **Bayesian frequency estimation at the fundamental quantum limit**, James W. Gardner et.al., [2507.02811v1](http://arxiv.org/abs/2507.02811v1)\n\n Searching for a weak signal at an unknown frequency is a canonical task in experiments probing fundamental physics such as gravitational-wave observatories and ultra-light dark matter haloscopes. These state-of-the-art sensors are limited by quantum noise arising from the fundamental uncertainty about the state of the device. Classically, frequency estimation suffers from a threshold effect in the signal-to-noise ratio such that weak signals are extremely hard to localise in frequency. We show that this phenomenon persists at the fundamental quantum limit but that the classical approach, a quadrature measurement, can nevertheless be beaten by a coherent protocol of projecting onto the \"quantum whitened\" possible quantum states. Quantum whitening is a covariant measurement, and we examine it analytically in the wide-prior limit and numerically for finite-width priors. Beyond accelerating searches for unknown frequencies, quantum whitening may be used generally to sense the parameter of a unitary encoding given no prior information about the parameter.\n\n", "2507.02810": "2025-07-03, **Advancements in Computing and Simulation Techniques for the HIBEAM-NNBAR Experiment**, Bernhard Meirose et.al., [2507.02810v1](http://arxiv.org/abs/2507.02810v1)\n\n The HIBEAM-NNBAR program is a proposed two-stage experiment at the European Spallation Source focusing on searches for baryon number violation processes as well as ultralight dark matter. This paper presents recent advancements in computing and simulation, including machine learning for event selection, fast parametric simulations for detector studies, and detailed modeling of the time projection chamber and readout electronics.\n\n", "2507.02653": "2025-07-03, **An Ultra-Cold Mechanical Quantum Sensor for Tests of New Physics**, Andraz Omahen et.al., [2507.02653v1](http://arxiv.org/abs/2507.02653v1)\n\n Initialization of mechanical modes in the quantum ground state is crucial for their use in quantum information and quantum sensing protocols. In quantum processors, impurity of the modes' initial state affects the infidelity of subsequent quantum algorithms. In quantum sensors, excitations out of the ground state contribute to the noise of the detector, and their prevalence puts a bound on rare events that deposit energy into the mechanical modes. In this work, we measure the excited-state populations of GHz-frequency modes in a high-overtone bulk acoustic wave resonator (HBAR). We find that the population of the first excited state can be as low as $P\\_p$=(1.2$\\pm$5.5)$\\times10^{-5}$, corresponding to an effective temperature of 25.2 mK, which are upper bounds limited by imperfections in the measurement process. These results compare favorably to the lowest populations measured in superconducting circuits. Finally, we use the measured populations to constrain the amplitude of high-frequency gravitational waves, the kinetic mixing strength of ultra-light dark matter, and non-linear modifications of the Schr\\\"{o}dinger equation describing wavefunction collapse mechanisms. Our work establishes HBARs as a versatile resource for quantum state initialization and studies of fundamental physics.\n\n", "2507.02651": "2025-07-03, **Prospects for probing dark matter particles and primordial black holes with the Square Kilometre Array using the 21 cm power spectrum at cosmic dawn**, Meng-Lin Zhao et.al., [2507.02651v1](http://arxiv.org/abs/2507.02651v1)\n\n Probing the nature of dark matter (DM) remains an outstanding problem in modern cosmology. The 21 cm signal, as a sensitive tracer of neutral hydrogen during cosmic dawn, provides a unique means to investigate DM nature during this critical epoch. Annihilation and decay of DM particles, as well as Hawking radiation of primordial black holes (PBHs), can modify the thermal and ionization histories of the early universe, leaving distinctive imprints on the 21 cm power spectrum. Therefore, the redshifted 21 cm power spectrum serves as a powerful tool to investigate such DM processes. In this work, we systematically assess the potential of the upcoming Square Kilometre Array (SKA) to constrain DM and PBH parameters using the 21 cm power spectrum. Assuming $10,000$ hours of integration time, the SKA is projected to reach sensitivities of $\\langle\\sigma v\\rangle \\leq 10^{-28}\\,{\\rm cm}^{3}\\,{\\rm s}^{-1}$ and $\\tau\\geq 10^{28}\\,{\\rm seconds}$, for $10\\,{\\rm GeV}$ DM particles. It can also probe PBHs with masses of $10^{16}\\,\\mathrm{g}$ and abundances $f\\_{\\mathrm{PBH}} \\leq 10^{-6}$. These results indicate that the SKA could place constraints on DM annihilation, decay, and PBH Hawking radiation that are up to two to three orders of magnitude stronger than current limits. Furthermore, the SKA is expected to exceed existing bounds on sub-GeV DM and to probe Hawking radiation from PBHs with masses above $10^{17}\\,{\\rm g}$, which are otherwise inaccessible by conventional cosmological probes. Overall, the SKA holds great promise for advancing our understanding of both DM particles and PBHs, potentially offering new insights into the fundamental nature of DM.\n\n", "2507.02610": "2025-07-03, **Entropy Analysis of Dark Matter Halo Structures**, Abdelhakim Benkrane et.al., [2507.02610v1](http://arxiv.org/abs/2507.02610v1)\n\n In this study, we aim to derive the entropy associated with a dark matter halo modeled using a double (broken) power-law density profile. Our approach is inspired by the pioneering work of Verlinde, who proposed that gravity may not be a fundamental force but rather an emergent phenomenon rooted in entropic principles. To investigate this idea, we examine four different dark matter halo profiles: the Dehnen-type, Hernquist, Jaffe, Plummer sphere, and the perfect sphere. Using these profiles, we derive corresponding entropy expressions and assess their consistency with the second law of thermodynamics, which governs the behavior of entropy in closed systems. Furthermore, to broaden the scope of our analysis, we extend the study to a cosmological context, allowing us to explore how the derived entropy expressions influence the dynamics of the Friedmann equations that describe the evolution of the universe.\n\n", "2507.02566": "2025-07-03, **LHC and dark matter implications of t-b-τ Yukawa unification in split SUSY GUTs**, Mureed Hussain et.al., [2507.02566v1](http://arxiv.org/abs/2507.02566v1)\n\n We investigate a grand unification (GUT) inspired version of the minimal supersymmetric standard model (MSSM)   based on a left-right symmetric $4$-$2$-$2$ gauge group, incorporating Yukawa coupling unification and current   phenomenological constraints. Utilizing a split soft supersymmetry-breaking (SSB) parameter space motivated by   flavor symmetries, we analyze the implications of recent results from ATLAS, CMS, LHCb, and dark matter direct   detection experiments. Our numerical scans, conducted with SARAH and SPheno, identify viable low-energy regions   consistent with third-generation Yukawa unification, the observed Higgs boson mass, dark matter relic density,   and flavor observables such as $B \\to X\\_s \\gamma$, $B\\_s \\to \\mu^+ \\mu^-$ and $B\\_u \\to \\tau \\nu\\_{\\tau}$ .   Our findings suggest that while current bounds severely constrain much of the   MSSM-like parameter space, substantial regions remain experimentally viable and testable in the ongoing LHC run   and next-generation dark matter experiments.\n\n", "2507.02563": "2025-07-03, **Dipolar dark matter theory based on a non-Abelian Yang-Mills field**, Luc Blanchet et.al., [2507.02563v1](http://arxiv.org/abs/2507.02563v1)\n\n Most theories that attempt to reproduce the Modified Newtonian Dynamics (MOND) phenomenology for dark matter at galactic scales rely on ad hoc free functions, preventing them from being regarded as fundamental. In this work, we present a new theory that reproduces MOND, built on a supposed to be fundamental Yang-Mills gauge field based on SU(2), with a gravitational coupling constant, and emerging in a low-acceleration regime, below the MOND acceleration scale. The gauge field plays the role of the internal force in the dipolar dark matter (DDM) model. We discuss how certain solutions of this theory recover the deep MOND regime without introducing arbitrary functions in the action. Within this framework, the MOND phenomenology appears to be due to the existence of a new sector of particle physics.\n\n", "2507.02474": "2025-07-03, **Optimisation of amplification and gas mixture for directional Dark Matter searches with the CYGNO/INITIUM project**, Giorgio Dho et.al., [2507.02474v1](http://arxiv.org/abs/2507.02474v1)\n\n Astrophysical and cosmological observations suggest the existence of beyond standard model ingredient known as dark matter (DM). One of the most supported class of theories suggests that DM is composed of weakly interactive massive particles (WIMPs), possibly detectable via weak interaction with standard matter resulting in the recoil of the latter. The motion of the Sun and Earth with respect to the Galactic Centre is expected to induce a strong directional dependence in the recoil spectrum. Direct detection experiments capable of measuring the angular features of the recoils gain access to a wide range of advantages such as the possibility to positively claim a discovery of DM. The CYGNO project sets into this context, with the aim of deploying a large directional detector for rare event searches as DM. It exploits a gaseous time projection chamber filled with a He:CF4 gas mixture with a segmented amplification stage and granular optical readout. In this thesis, it is presented the work carried out with small CYGNO prototypes to maximise the light yield without degrading spatial and energy resolution, the addition of highly electronegative gases to induce a reduction of the electron cloud diffusion while drifting towards the amplification stage, very relevant to precisely measure the topological information of the recoil tracks. Moreover, the potential performances of directional detectors in the context of a direct DM search are analysed with the use of rigorous statistical tools both in the improvement in setting limits in the WIMP to nucleon sensitivity and in the capability of discerning two different DM models exploiting a directional detector.\n\n", "2507.02429": "2025-07-03, **COSINUS -- a model-independent challenge of the DAMA/LIBRA dark matter claim with cryogenic NaI detectors operated in a new low-background facility**, G. Angloher et.al., [2507.02429v1](http://arxiv.org/abs/2507.02429v1)\n\n Low-temperature detectors are a powerful technology for dark matter search, offering excellent energy resolution and low energy thresholds. COSINUS is the only experiment that combines scintillating sodium iodide (NaI) crystals with an additional phonon readout at cryogenic temperatures, using superconducting sensors (remoTES), alongside the conventional scintillation light signal. Via the simultaneous phonon and scintillation light detection, a unique event-by-event particle identification is enabled. This dual-channel approach allows for a model-independent cross-check of the long-standing DAMA/LIBRA signal with a moderate exposure of a few hundred kg d, while completely avoiding key systematic uncertainties inherent to scintillation-only NaI-based searches. COSINUS built and commissioned a dedicated low-background cryogenic facility at the LNGS underground laboratories. Data taking with eight NaI detector modules (COSINUS1$\\pi$ Run1) is planned to begin in late 2025.\n\n", "2507.02410": "2025-07-03, **Estimation of gravitational production uncertainties**, Jose A. R. Cembranos et.al., [2507.02410v1](http://arxiv.org/abs/2507.02410v1)\n\n Cosmological production of scalar, non-minimally coupled dark matter depends on the specifics of the inflationary model under consideration. We analyze both Starobinsky inflation and a quadratic potential, solve the full background dynamics, study pair production during inflation and reheating, and find that the observed dark matter abundance can be explained solely by this mechanism, regardless of the inflationary model. Qualitative differences between the two cases only appear for dark matter masses close to the inflationary scale. In addition, we identify a large region in parameter space in which cosmological production of dark matter is mostly independent of the chosen inflationary potential, highlighting the robustness of this dark matter production mechanism and its independence of the unknown particular details of inflation. In the region of masses lower than the scale of inflation, and sufficiently away from the conformal limit, the total comoving number density of produced particles becomes a function of the coupling to the geometry alone. This allows us to provide an approximated analytic expression for fitting the resulting abundance.\n\n", "2507.02396": "2025-07-03, **Primordial regular black holes as all the dark matter. III. Covariant canonical quantum gravity models**, Marco Calzà et.al., [2507.02396v1](http://arxiv.org/abs/2507.02396v1)\n\n In earlier companion papers, we showed that non-singular primordial black holes (PBHs) could account for all the dark matter (DM) over a significantly wider mass range compared to Schwarzschild PBHs. Those studies, mostly based on phenomenological metrics, are now extended by considering the quantum-corrected space-time recently proposed by Zhang, Lewandowski, Ma and Yang (ZLMY), derived from an effective canonical (loop) quantum gravity approach explicitly enforcing general covariance. Unlike the BHs considered earlier, ZLMY BHs are free from Cauchy horizons, and are hotter than their Schwarzschild counterparts. We show that this higher temperature boosts the evaporation spectra of ZLMY PBHs, tightening limits on their abundance relative to Schwarzschild PBHs and shrinking the asteroid mass window where they can constitute all the DM, a result which reverses the earlier trend, but rests on firmer theoretical ground. While stressing the potential key role of quantum gravity effects in addressing the singularity and DM problems, our study shows that working within a consistent theoretical framework can strongly affect observational predictions.\n\n", "2507.02284": "2025-07-03, **The dark matter content of Milky Way dwarf spheroidal galaxies: Draco, Sextans and Ursa Minor**, Hao Yang et.al., [2507.02284v1](http://arxiv.org/abs/2507.02284v1)\n\n The Milky Way Survey of the Dark Energy Spectroscopic Instrument (DESI) has so far observed three classical dwarf spheroidal galaxies (dSphs): Draco, Sextans and Ursa Minor. Based on the observed line-of-sight velocities and metallicities of their member stars, we apply the axisymmetric Jeans Anisotropic Multi-Gaussian Expansion modeling (JAM) approach to recover their inner dark matter distributions. In particular, both the traditional single-population Jeans model and the multiple population chemodynamical model are adopted. With the chemodynamical model, we divide member stars of each dSph into metal-rich and metal-poor populations. The metal-rich populations are more centrally concentrated and dynamically colder, featuring lower velocity dispersion profiles than the metal-poor populations. We find a diversity of the inner density slopes $\\gamma$ of dark matter halos, with the best constraints by single-population or chemodynamical models consistent with each other. The inner density slopes are $0.71^{+0.34}\\_{-0.35}$, $0.26^{+0.22}\\_{-0.12}$ and $0.33^{+0.20}\\_{-0.16}$ for Draco, Sextans and Ursa Minor, respectively. We also present the measured astrophysical J and D factors of the three dSphs. Our results indicate that the study of the dark matter content of dSphs through stellar kinematics is still subject to uncertainties behind both the methodology and the observed data, through comparisons with previous measurements and data sets.\n\n", "2507.02175": "2025-07-02, **A search for dark matter produced in association with a dark Higgs boson decaying into a Higgs boson pair in 3$b$ or 4$b$ final states using $pp$ collisions at $\\sqrt{s}=13$ TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2507.02175v1](http://arxiv.org/abs/2507.02175v1)\n\n A search is performed for dark matter particles produced in association with a resonant pair of Higgs bosons using 140 fb$^{-1}$ of proton--proton collisions at a centre-of-mass energy of 13 TeV recorded by the ATLAS detector at the Large Hadron Collider. This signature is expected in some extensions of the Standard Model predicting the production of dark matter particles, and is interpreted in terms of a dark Higgs model containing a $Z'$ mediator in which the dark Higgs boson $s$ decays into a pair of Higgs bosons. The dark Higgs boson is reconstructed through final states with at least three $b$-tagged jets, produced by the pair of Higgs boson decays, in events with significant missing transverse momentum consistent with the presence of dark matter. The observed data are found to be in good agreement with Standard Model predictions, constraining scenarios with dark Higgs boson masses within the range of 250 to 400 GeV and $Z'$ mediators up to 2.3 TeV.\n\n", "2507.02172": "2025-07-02, **Development of new ultra-low-background particle detectors based on Micromegas technology for the search of Dark Matter at the low-mass frontier**, Oscar Perez et.al., [2507.02172v1](http://arxiv.org/abs/2507.02172v1)\n\n Weakly Interacting Massive Particles (WIMPs) are one of the best motivated candidates to compose the Dark Matter of the Universe. The lack of experimental confirmation by direct detection experiments or collider searches has ruled out canonical WIMP scenarios (masses $\\sim$ GeV-TeV), making a case for the largely unexplored sub-GeV frontier. This PhD thesis is focused on the evolution and latest developments of TREX-DM, a gaseous Time Projection Chamber (TPC) designed to detect low-mass WIMPs through their low-energy nuclear recoils. TREX-DM is equipped with microbulk Micromegas readout planes, a technology well-suited for rare event searches due to its intrinsic radiopurity, potential for low energy thresholds and background discrimination capabilities through 3D event reconstruction.   A central focus of the thesis is background reduction in TREX-DM: through 222Rn mitigation and surface contamination control, background levels have been reduced from $\\sim$ 1000 to 80-100 dru. Surface contamination, primarily from 222Rn progeny, has prompted the development of novel screening tools such as AlphaCAMM, a high-sensitivity surface contamination detector.   The most significant result is the implementation of a Gas Electron Multiplier (GEM) pre-amplification stage on top of the microbulk Micromegas detectors. This yields extra gain factors up to $\\sim$ 100, substantially reducing the energy threshold. A calibration with a 37Ar source (low-energy peaks at 0.27 keV and 2.82 keV) validated this reduction, demonstrating energy thresholds at the level of single-ionisation energies (26 eV in argon).   Future improvements target further background reduction through a modified cathode design, enhanced detector stability via a more robust field cage, and gas mixture optimisation to enhance sensitivity to low-energy nuclear recoils.\n\n", "2507.02062": "2025-07-02, **Vertical Structure and Dynamics of a Galactic Disk**, Chanda J. Jog et.al., [2507.02062v1](http://arxiv.org/abs/2507.02062v1)\n\n Most of the visible mass in a typical spiral galaxy is distributed in a thin disk, with a radial extent much larger than its thickness. While the planar disk structure, including non-axisymmetric features such as spiral structure, has been studied extensively, the vertical structure has not received comparable attention. This review aims to give a comprehensive, pedagogic introduction to the rich topic of vertical structure of a galactic disk in hydrostatic equilibrium and discuss the theoretical developments in this field in the context of recent observations. A realistic multi-component disk plus halo model of a galaxy has been developed and studied by us in detail. This takes account of both stars and interstellar gas, treated as isothermal components with different velocity dispersions, which are gravitationally coupled; further, the disk is in the gravitational field of the dark matter halo. This review focuses on this model and the results from it in different physical cases.   The gas and halo crucially affect the resulting self-consistent stellar distribution such that it is vertically constrained to be closer to the mid-plane and has a steeper profile than in the standard one-component case, in agreement with modern observations. A typical stellar disk is shown to flare by a factor of few within the visible radial extent of the disk. These robust results question the sech^2 profile and a constant scale height, routinely used in the literature, for convenience. In an important application, the observed HI gas scale height is used as a constraint on the model which helps determine the shape and the density profile of the dark matter halo for galaxies. Finally, we outline some key, open questions which can be addressed in the near future using the above model, and new observational data -- for example, from IFU surveys and JWST -- for a better understanding of this topic.\n\n", "2507.02048": "2025-07-02, **Enabling Sub-GeV Dark Matter within the Vanilla $L_μ$-$L_τ$ Model**, Nicolás Bernal et.al., [2507.02048v1](http://arxiv.org/abs/2507.02048v1)\n\n Thermal dark matter is a compelling setup that has been probed by a multitude of experiments, mostly in the GeV-TeV mass range. The thermal paradigm in the sub-GeV range is about to experience the same experimental test with the next generation of low-energy accelerators and light dark matter detectors. Motivated by this, we investigate sub-GeV dark matter in the $L\\_\\mu-L\\_\\tau$ and assess how the introduction of a matter-dominated era impacts the parameter that yields the correct relic density. Interestingly, we show that the projected experiments, such as MuSIC, FCC-ee, and LDMX, will probe a large region of the viable parameter space that yields the correct relic density. In the GeV-TeV mass regime, the usual large-scale detectors push the sensitivity. Our work highlights the rich interplay between early-universe dynamics, dark matter phenomenology, and the discovery potential of next-generation experiments.\n\n", "2507.02046": "2025-07-02, **Constraining compact dark matter with time-varying quasar equivalent widths**, Georgios Vernardos et.al., [2507.02046v1](http://arxiv.org/abs/2507.02046v1)\n\n One of the possible explanations for dark matter is that of compact dark objects of baryonic origin, such as black holes or even planets. Accumulating evidence, including the discovery of merging stellar mass black holes through gravitational waves, point to a population of such objects making up at least some fraction of dark matter. We revisit a historically heavily used probe, quasar spectra, from the new perspective of time variability and gravitational lensing. From a sample of 777 quasars selected from archival data we identify 19 that show decisive evidence of lensing by compact objects with masses measured in the range $5\\times 10^{-5} < M/\\mathrm{M}\\_{\\odot} < 2\\times 10^{-2}$ with 99\\% confidence. This is much lower than what is hoped to be detected by even the most futuristic gravitational wave detectors and analysis strategies, but is crucial for theories of compact dark matter, such as primordial black holes predicted from quantum phase transitions in the early Universe.\n\n", "2507.01956": "2025-07-02, **Universal lower bound on the axion decay constant from free streaming effects**, Keisuke Harigaya et.al., [2507.01956v1](http://arxiv.org/abs/2507.01956v1)\n\n We show that enhancement of the axion relic abundance compared to the standard misalignment contribution generically leads to the production of nonzero momentum axion modes, resulting in warm dark matter behavior and enhanced isocurvature perturbations. It leads to universal constraints on the axion parameter space that are independent of detailed model assumptions and cosmological history. For models enhancing relic abundance with gradient axion modes, observations of the Lyman-$\\alpha$ forest impose a lower bound on the axion decay constant, $f\\_a \\gtrsim 10^{15} {\\rm GeV}\\,(10^{-18}{\\rm eV}/m\\_a)$, from the free-streaming effect. For models relying on the delay of coherent axion oscillations, we obtain a slightly weaker bound, $f\\_a \\gtrsim 10^{14} {\\rm GeV}\\,(10^{-18}{\\rm eV}/m\\_a)$. We make relatively conservative choices to establish these universal bounds but also provide scaling parameters that can be calibrated for stronger constraints in concrete models and updated as observations improve.\n\n", "2507.01822": "2025-07-02, **Kinetic Fragmentation of the QCD Axion on the Lattice**, Matteo Fasiello et.al., [2507.01822v1](http://arxiv.org/abs/2507.01822v1)\n\n Kinetic misalignment, one of the most compelling scenarios for the non-thermal generation of axion dark matter, is generally accompanied by axion fragmentation, a process in which the energy of the axion condensate is transferred to its perturbations. The dynamics of fragmentation, at least in the context of dark matter production, have so far been studied semi-analytically using perturbation theory. In this work, we present the first classical lattice simulation of kinetic axion fragmentation in the context of dark matter production, focusing on parameters relevant to the QCD axion. Our findings indicate that the non-perturbative dynamics captured by the lattice lead to a significantly broader spectrum of axion fluctuations, with a sustained transfer of energy to mildly relativistic modes and with smaller occupation numbers compared to the linear approximation. As a consequence, the final dark matter abundance is typically O(1) lower than in the linear approximation, which is itself O(1) lower than the zero-mode-only prediction. This broadening and suppression of the spectrum could have a significant impact on axion mini-halo formation, one of the main experimental handles on kinetic fragmentation.\n\n", "2507.01814": "2025-07-02, **Where are all the dark galaxies? Predicting galaxy/halo locations from their bright neighbors**, Alice Chen et.al., [2507.01814v1](http://arxiv.org/abs/2507.01814v1)\n\n Astronomical objects in our universe that are too faint to be directly detectable exist and are important - an obvious example being dark matter. The same can also apply to very faint baryonic objects, such as low luminosity dwarf galaxies and gravitationally compact objects (e.g., rogue planets, white dwarfs, neutron stars, black holes, dark sirens). While they are very difficult to observe directly, they have locations that are highly important when studying astrophysical phenomena. Here, we use a machine learning algorithm known as symbolic regression to model the probability of a dark object's existence as a function of their separation distances to their closest two ``bright\" (directly observable) neighbors, and the distances of these bright objects to each other. An advantage of this algorithm is that it is interpretable by humans and can be used to make reproducible predictions. Galaxies with masses above $10^9 M\\_{\\odot}$ and halos above $10^{12} M\\_{\\odot} $ are the objects that we separate into ``bright\" and ``dark\" to be used in our analysis. We find that it is possible to predict the density of dark objects using an analytic expression that depends on their distances to their closest bright neighbors in Illustris-TNG galaxy formation simulations, which is significantly better than the (linear) scale-dependent biasing prediction for $k \\sim 1.0~ h$Mpc$^{-1}$ (and potentially beyond, if allowed by the resolution). This could potentially open the avenue for finding dark objects based on their vicinity to directly observable bright sources and make future surveys more targeted and efficient.\n\n", "2507.01686": "2025-07-02, **Tidal Suppression of Fuzzy Dark Matter Heating in Milky Way Satellite Galaxies**, Yu-Ming Yang et.al., [2507.01686v1](http://arxiv.org/abs/2507.01686v1)\n\n Many previous studies have imposed stringent constraints on the particle mass of fuzzy dark matter (FDM) by analyzing observations of Galactic satellite galaxies, which show no significant evidence of the heating effect predicted by FDM. However, these analyses have generally neglected the tidal influence of the Milky Way, which can substantially suppress the FDM-induced heating in satellites. This oversight arises from computational challenges of accurately capturing the tidal effects in FDM simulations. In this study, we present a novel simulation framework that, for the first time, enables the simulation of an FDM-stellar system within an observationally motivated gravitational potential of the Milky Way. This framework incorporates the diverse Galactic components, including the gravitational influence of the Large Magellanic Cloud. Using the Fornax dwarf galaxy as a case study, we demonstrate that tidal effects significantly alleviate the tension between observational data and the predicted heating effect for an FDM particle mass of $m\\_a\\sim 10^{-22}$ eV.\n\n", "2507.01626": "2025-07-02, **Luminosity Function of Galaxies in Voids: A Modification Inspired by Excursion Set Theory**, Zeynab Ashurikisomi et.al., [2507.01626v1](http://arxiv.org/abs/2507.01626v1)\n\n In the standard picture of cosmology, the galaxies reside in dark matter (DM) halos. DM halos are distributed in the cosmic web in different environments. The luminosity of the galaxies in different environments can be used as a probe to assess a cosmological model. This study focuses on the properties of galaxies in void regions, where halos typically do not experience extreme conditions. By examining the galaxy luminosity function, we aim to understand the dependence of galaxy properties on their environment and redshift so that later, we could use this as a tool to evaluate cosmological models. We employ the Excursion Set Theory to incorporate parameters related to the number density of DM halos into the luminosity function. Using the Galaxy and Mass Assembly (GAMA) survey and 2dFGRS datasets, we fit our theoretical models to observational data, examining the environmental and redshift dependence of the galaxy luminosity function. Our results indicate that we model the galaxy luminosity function in voids effectively by considering the linear density contrast of the environment and the growth function $D(z)$ for redshift dependence. This study provides a model for the environmental dependence of galaxy luminosity function that offers an improvement in the $\\chi ^2$ parameter compared to the previously proposed model in \\cite{mcnaught2014galaxy}. Both BIC and AIC tests support the superiority of this model for the void region.\n\n", "2507.01421": "2025-07-02, **Primordial Black Holes as Coma Cluster Dark Matter and the Unresolved γ-Ray Background**, Jeremy Mould et.al., [2507.01421v1](http://arxiv.org/abs/2507.01421v1)\n\n If 0.1% of the dark matter in the Coma cluster is constituted by primordial black holes (PBHs) with masses ranging from 10^-19 to 10^-17 solar masses, then the observed GeV {\\gamma}-ray emission from the cluster could potentially be attributed to Hawking radiation. The emitted spectrum is inversely proportional to the black hole's mass, meaning lighter PBHs radiate at higher energies, potentially falling within the GeV range. If 0.1% of the Coma cluster's dark matter is PBH in this mass range, a fit to the cluster's GeV emission is obtained. We then investigate the potential for constraining evaporating PBHs through cross-correlations between the Unresolved Gamma-Ray Background and weak gravitational lensing. Utilizing 12 years of Fermi-LAT observations and weak lensing measurements from the Dark Energy Survey Year 3, we assess whether such correlations can reveal a PBH {\\gamma}-ray component. While a statistically significant correlation between the UGRB and large-scale structure has been observed, this signal is consistent with emission from clustered astrophysical sources such as blazars. Attributing a measurable fraction of the UGRB to PBH evaporation would require unrealistically large PBH abundances. We also draw attention to a cluster of Coma-like X-ray clusters, designated Draco X, observed at a redshift of z = 0.12. These systems, characterized by their significant X-ray emission from hot, diffuse intracluster gas, represent massive gravitationally bound structures. The existence and properties of such clusters at these redshifts provide crucial cosmological probes, offering insights into the formation and evolution of large-scale structure and the underlying cosmological parameters. Further investigation of Draco X and similar high-redshift clusters would yield additional constraints on large scale structure.\n\n", "2507.01386": "2025-07-02, **Cosmology and Source Redshift Constraints from Galaxy Clustering and Tomographic Weak Lensing with HSC Y3 and SDSS using the Point-Mass Correction Model**, Tianqing Zhang et.al., [2507.01386v1](http://arxiv.org/abs/2507.01386v1)\n\n The combination of galaxy clustering and weak lensing is a powerful probe of the cosmology model. We present a joint analysis of galaxy clustering and weak lensing cosmology using SDSS data as the tracer of dark matter (lens sample) and the HSC Y3 dataset as source galaxies. The analysis divides HSC Y3 galaxies into four tomographic bins for both galaxy-galaxy lensing and cosmic shear measurements, and employs a point-mass correction model to utilize galaxy-galaxy lensing signals down to 2$h^{-1}$Mpc, extending up to 70$h^{-1}$Mpc. These strategies enhance the signal-to-noise ratio of the galaxy-galaxy lensing data vector. Using a flat $\\Lambda$CDM model, we find $S\\_8 = 0.780^{+0.029}\\_{-0.030}$, and using a $w$CDM model, we obtain $S\\_8 = 0.756^{+0.038}\\_{-0.036}$ with $w = -1.176^{+0.310}\\_{-0.346}$. We apply uninformative priors on the redshift mean-shift parameters for the third and fourth tomographic bins. Leveraging the self-calibration power of tomographic weak lensing, we measure $\\Delta z\\_3 = -0.112^{+0.046}\\_{-0.049}$ and $\\Delta z\\_4 = -0.185^{+0.071}\\_{-0.081}$, in agreement with previous HSC Y3 results. This demonstrates that weak lensing self-calibration can achieve redshift constraints comparable to other methods such as photometric and clustering redshift calibration.\n\n"}, "supernova": {"2507.02780": "2025-07-03, **Massive Interacting Binaries Enhance Feedback in Star-Forming Regions**, Claude Cournoyer-Cloutier et.al., [2507.02780v1](http://arxiv.org/abs/2507.02780v1)\n\n We present a new framework to incorporate feedback from massive interacting binaries in simulations of star cluster formation. Our new feedback model adds binary stellar evolution to the cluster formation code Torch, and couples it in AMUSE to the pre-existing modules for collisional stellar dynamics, magnetohydrodynamics, and mechanical and radiative feedback. Our model accounts for the effects of mass transfer on the stars' mass loss rates, their radiation spectra, and the timing of core-collapse supernovae. It also injects mass lost through non-conservative mass transfer and common envelope ejection into the interstellar medium. We demonstrate the use of our feedback model through simulations of isolated binaries in a gaseous medium, and of embedded clusters of massive binaries. Feedback from interacting binaries efficiently couples with the surrounding interstellar medium. It increases the size of HII regions, increases the kinetic and thermal energy of the gas, and increases the pressure within HII regions compared to models that use single star stellar evolution. Those differences arise from the ionizing radiation, which increases by three orders of magnitude, resulting in HII regions that expand due to thermal pressure rather than radiation pressure. The effects of stellar dynamics and the gravitational potential of the background gas cause the evolution of individual binaries to deviate from the predictions made by secular evolution, impacting the subsequent feedback from the binary. We conclude that massive interacting binaries are an important source of feedback in cluster-forming regions, and must be considered when studying the emerging timescales of young star clusters.\n\n", "2507.02056": "2025-07-02, **Envisioning the Distance Ladder in the Era of the Habitable Worlds Observatory**, Gagandeep Anand et.al., [2507.02056v1](http://arxiv.org/abs/2507.02056v1)\n\n The current state-of-the-art cosmic distance ladder requires three rungs--geometric distances, primary indicators, and Type Ia Supernovae--to achieve a 1% measurement of the Hubble constant $H\\_0$. The Habitable Worlds Observatory will have the sensitivity and resolution to reduce this to a two-step measurement, eliminating the third rung entirely and reaching into the Hubble flow with stellar distance indicators such as Cepheid variables and the tip of the red giant branch alone. We discuss the requirements for a program to measure $H\\_0$ to 1% with HWO here, including telescope and instrument design considerations. We also comment on the potential of HWO to measure distances to low-mass dwarf galaxies via their RR Lyrae stars.\n\n", "2507.01508": "2025-07-02, **Duration and properties of the embedded phase of star formation in 37 nearby galaxies from PHANGS-JWST**, Lise Ramambason et.al., [2507.01508v1](http://arxiv.org/abs/2507.01508v1)\n\n Light reprocessed by dust grains emitting in the infrared allows the study of the physics at play in dusty, embedded regions, where ultraviolet and optical wavelengths are attenuated. Infrared telescopes such as JWST have made it possible to study the earliest feedback phases, when stars are shielded by cocoons of gas and dust. This phase is crucial for unravelling the effects of feedback from young stars, leading to their emergence and the dispersal of their host molecular clouds. Here we show that the transition from the embedded to the exposed phase of star formation is short (< 4 Myr) and sometimes almost absent (< 1 Myr), across a sample of 37 nearby star-forming galaxies, covering a wide range of morphologies from massive barred spirals to irregular dwarfs. The short duration of the dust-clearing timescales suggests a predominant role of pre-supernova feedback mechanisms in revealing newborn stars, confirming previous results on smaller samples and allowing, for the first time, a statistical analysis of their dependencies. We find that the timescales associated with mid-infrared emission at 21 {\\mu}m, tracing a dust-embedded feedback phase, are controlled by a complex interplay between giant molecular cloud properties (masses and velocity dispersions) and galaxy morphology. We report relatively longer durations of the embedded phase of star formation in barred spiral galaxies, while this phase is significantly reduced in low-mass irregular dwarf galaxies. We discuss tentative trends with gas-phase metallicity, which may favor faster cloud dispersal at low metallicities.\n\n", "2507.01495": "2025-07-02, **The environment of TeV halo progenitors**, Lioni-Moana Bourguinat et.al., [2507.01495v1](http://arxiv.org/abs/2507.01495v1)\n\n TeV halos are extended very-high-energy gamma-ray sources found around some middle-aged pulsars. The emission spanning several tens of parsecs suggests an efficient confinement of the ultra-relativistic lepton pairs produced by pulsars in their vicinity. The physical mechanism responsible for this suppressed transport has not yet been identified. In some scenarios, pair confinement may be linked to the medium the pulsars are located in. We aim at understanding which type of medium pulsars are probing over their lifetime. We developed a model for the environment probed by moving pulsars, from their birth in core-collapse explosions, where they receive a natal kick, until their entry into the interstellar medium. The model involves: (i) a Monte-Carlo sampling of the properties of the massive-star progenitors of pulsars; (ii) a calculation of the structure of the surrounding medium shaped by these progenitors, for the two cases of isolated stars and star clusters; (iii) a computation of the evolution of supernova remnants in these parent environments. Ultimately, from a distribution of neutron star kick velocities, we assess in which medium pulsars are located as a function of time. We first derive the statistical properties of a fully synthetic Galactic population, and then apply the model to a selection of known pulsars to assess the likely nature of their environment. We show that pulsars escape into the ISM at around 200 kyr, significantly later than the values most commonly used in the literature. The majority of known pulsars with a confirmed TeV halo have high probabilities of still being in their parent environment, which suggests that efficient pair confinement is connected to the region influenced by progenitor stars. In order to test this idea, we provide the probability of still residing in the parent environment for a list of known pulsars.\n\n", "2507.01331": "2025-07-02, **Supernova Remnants with M dwarf surviving companions**, Kuo-Chuan Pan et.al., [2507.01331v1](http://arxiv.org/abs/2507.01331v1)\n\n We study the possibility that Type Ia supernovae might be produced by binary systems where the companion of the exploding white dwarf is an M-dwarf star. Such companion would appear as a runaway star, retaining its pre-explosion orbital velocity along with a kick imparted by the supernova ejecta. It might be rapidly rotating, from being tidally locked with the white dwarf prior to explosion in a very close binary. For this study, we perform a series of multidimensional hydrodynamic simulations to investigate the interaction between M-dwarf companions and SN ejecta, followed by post-impact stellar evolution modeling using the MESA code. Our initial models in the 3D simulations had high spin angular momenta and the effects of magnetic braking have been included. They very significantly reduce the final rotation.   A surviving companion candidate, MV-G272, has recently been discovered in the supernova remnant G272.2-3.2, which is an 8.9$\\sigma$ proper motion outlier, although being slowly rotating. Our results show that the properties of this companion (luminosity, effective temperature, surface gravity) can be reproduced by our post-impact M-dwarf models. The slow rotation, which is a common characteristic with several proposed hypervelocity SN companions, can be explained by magnetic braking during the post-impact evolution, thus supporting the possibility that the MV-G272 star is the surviving companion of the Type Ia supernova now found as G272.2-3.2 SNR.\n\n"}}