{"neutrino": {"2408.04234": "2024-08-08, **Distinguishing Beyond-Standard Model Effects in Neutrino Oscillation**, A. Calatayud-Cadenillas et.al., [2408.04234v1](http://arxiv.org/abs/2408.04234v1)\n\n We systematically assess the DUNE experiment's ability to distinguish between various beyond-standard neutrino oscillation hypotheses pair combinations. For a pair comparison, we evaluate the statistical separation, where one hypothesis plays the role of the true signal while the other corresponds to the test signal. The beyond-standard neutrino oscillation hypotheses under scrutiny include neutrino decay (invisible and visible), non-standard interactions, quantum decoherence, and the violation of the equivalence principle. When taken as the true model, we found that either quantum decoherence or the violation of the equivalence principle are the easiest to differentiate compared to the rest of the hypotheses. Additionally, from our statistical test, we investigate potential discrepancies between the measured CP-violation phase $\\delta\\_{CP}$ relative to its true value, which could occur for a given comparison. In our analysis, we will take the true values of $\\delta\\_{CP}$ as $-90^\\circ$ and $180^\\circ$. Notably, even in cases where the beyond-standard neutrino oscillation hypotheses scenarios are statistically indistinguishable, the measured value can exhibit significant deviations from its true value.\n\n", "2408.04180": "2024-08-08, **From Safeguards Application to Fundamental Physics: Advancements in Reactor Neutrino Detection with the ν-Angra Experiment**, E. Kemp et.al., [2408.04180v1](http://arxiv.org/abs/2408.04180v1)\n\n Operating on a surface with high noise rates and requiring susceptible, yet small-scale detectors, the Neutrinos-Angra detector is an excellent platform for technological development and expertise in new detection methods. This report details the primary features of the detector, the electronics involved, and preliminary physics results from the operational phase, particularly the ON-OFF analysis comparing the signals with the reactor in operation (ON) and during the maintenance shut-down (OFF), demonstrating the detector's capability to monitor reactor activity. Additionally, we will briefly discuss the prospects of using a cryogenic calorimeter to detect neutrinos via Coherent Elastic Neutrino-Nucleus Scattering (CEvNS), highlighting potential advancements in neutrino detection technology. Looking ahead, the project promises to play a crucial role in the integration of Latin American scientists and engineers into global scientific collaborations, significantly contributing to the LASF4RI and the broader HECAP strategic framework.\n\n", "2408.04021": "2024-08-07, **Superradiant Interactions of the Cosmic Neutrino Background, Axions, Dark Matter, and Reactor Neutrinos**, Asimina Arvanitaki et.al., [2408.04021v1](http://arxiv.org/abs/2408.04021v1)\n\n In this paper we do three things. First, we outline the conditions under which the interaction rate of inelastic processes that change the internal state of a system of $N$ targets scales as $N^2$. This is an effect distinct from coherent elastic scattering, but with the same scaling. Second, we compute example rates for such processes for various weakly interacting particles. Finally, we point to potential quantum observables for these processes that go beyond traditional energy exchange.   Maximal coherence in inelastic processes is achieved when the targets are placed in an equal superposition of the ground and excited states. These coherent inelastic processes are analogous to Dicke superradiance, and we thus refer to them as superradiant interactions.   We compute the superradiant interaction rates for the C$\\nu$B, dark matter scattering and absorption, and late-universe particles, such as reactor neutrinos, when the two-level system is realized by nuclear or electron spins in a magnetic field. The rates we find can be quite sizable on macroscopic yet small targets. For example, the C$\\nu$B interacts with a rate of $\\mathcal{O}(\\text{Hz})$ when scattering off a 10~cm liquid or solid-state density spin-polarized sphere. For QCD axion dark matter, similar rates can be achieved with much smaller samples, $N \\sim \\mathcal{O}(10^{15})\\left(\\frac{m}{2\\times 10^{-8}~\\text{eV}}\\right)^{-1/2}$, where $m$ is the axion mass.   Using the Lindblad formalism for open quantum systems, we show that these superradiant interactions can manifest as a source of noise on the system. This points to new observables, sensitive to the sum of the excitation and de-excitation rates, and can be viewed as introducing diffusion and decoherence to the system. The effects presented in this paper may point to a new class of ultra-low threshold detectors.\n\n", "2408.03931": "2024-08-07, **Superfluid quantum criticality and the thermal evolution of neutron stars**, Hao-Fu Zhu et.al., [2408.03931v1](http://arxiv.org/abs/2408.03931v1)\n\n The neutron star starts to cool down shortly after its birth by emitting neutrinos. When it is cold enough, the Cooper pairs of neutrons are formed, which triggers a superfluid transition. Previous works on neutron superfluidity are focused on the finite-temperature transition. Little attention is paid to the potentially important quantum critical phenomena associated with superfluidity. Here, we provide the first theoretical analysis of superfluid quantum criticality, concentrating on its impact on neutron star cooling. Extensive calculations found that superfluidity occurs within a finite range of nuclear density $\\rho$. The density serves as a non-thermal parameter for superfluid quantum phase transition. In a broad quantum critical region, there is a strong coupling between the gapless neutrons and the quantum critical fluctuations of superfluid order parameter. We handle this coupling by using perturbation theory and renormalization group method, and show that it leads to non-Fermi liquid behavior, which yields a logarithmic $T\\ln(1/T)$ correction to the Fermi-liquid specific heat $c\\_{n}\\propto T$ and also markedly alters the neutrino emissivity. Quantum critical phenomena emerge at a time much earlier than the onset of superfluidity and persist throughout almost the entire life of a neutron star. At a low $T$, such phenomena coexist with superfluidity in the neutron star interior, yet occupying different layers. We include superfluid quantum criticality into the theoretical description of neutron star cooling and find that it obviously prolongs the thermal relaxation time. By varying the strength of superfluid fluctuations and other quantities, we obtain an excellent fit to the observed cooling data of a variety of neutron stars. Our results indicate the existence of an intriguing correlation between superfluid quantum criticality and the thermal evolution of neutron stars.\n\n", "2408.03760": "2024-08-07, **Feasibility of a directional solar neutrino measurement with the CYGNO/INITIUM experiment**, Samuele Torelli et.al., [2408.03760v1](http://arxiv.org/abs/2408.03760v1)\n\n Over the past five decades, solar neutrino research has been pivotal in driving significant scientific advancements, enriching our comprehension of both neutrino characteristics and solar processes. Despite numerous experiments dedicated to solar neutrino detection, a segment of the lower pp spectrum remains unexplored, while the precision of measurements from the CNO cycle remains insufficient to resolve the solar abundance problem determined by the discrepancy between the data gathered from helioseismology and the forecasts generated by stellar interior models for the Sun. The CYGNO/INITIUM experiment aims to deploy a large 30 m3 directional detector for rare event searches focusing on Dark Matter. Recently, in the CYGNUS collaboration, there has been consideration for employing these time projection chamber technology in solar neutrino directional detection trough neutrino-electron elastic scattering. This is due to their potential to conduct low-threshold, high-precision measurements with spectroscopic neutrino energy reconstruction on an event-by-event basis driven by the kinematic. However, so far, no experiments have been investigated on the feasibility of this measurement using actual detector performances and background levels. Such a detector already with a volume of O(10) m3 could perform an observation of solar neutrino from the pp chain with an unprecedented low threshold, while with larger volumes it could measure the CNO cycle eventually solving the solar metallicity problem.\n\n", "2408.03493": "2024-08-07, **Effect of neutrino electromagnetic properties on the quasielastic neutral-current neutrino-nucleus scattering**, K. S. Kim et.al., [2408.03493v1](http://arxiv.org/abs/2408.03493v1)\n\n In the quasielastic region, we investigate the effect of neutrino electromagnetic properties constrained from the recent experiments on the electroweak neutral current reaction process of the neutrino-$^{12}$C scattering. For a relativistic description of the nuclear dynamics, we employ the relativistic mean-field model, which has been proven to describe the data nicely in the quasielastic region. In the present work, we analyze the influence beyond the Standard Model by considering the neutrino magnetic and electric dipole form factors and charge radius on the neutrino electroweak interactions within $^{12}$C. To this end, we use the values of the neutrino charge radius and the magnetic moment at the squared four momentum transfer $Q^2=0$ obtained from the recent experiments and calculate the neutrino differential cross section of the neutrino-$^{12}$C scattering. We find that the effect of the charge radius and the electric dipole form factor is very small, but the role of the magnetic dipole form factor is sensitive to $Q^2$ and becomes sizable at small momentum transfer.\n\n"}, "dark matter": {"2408.04623": "2024-08-08, **Axion production via trapped misalignment from Peccei-Quinn symmetry breaking**, Luca Di Luzio et.al., [2408.04623v1](http://arxiv.org/abs/2408.04623v1)\n\n The Peccei-Quinn (PQ) symmetry does not need to be exact, and even a tiny source of PQ breaking not aligned with the QCD anomaly might have significant phenomenological implications. In this study, we examine the effects of a general class of PQ-breaking operators on the axion cosmological production via misalignment, focussing on both temperature-dependent and independent PQ-breaking potentials. In particular, we show that a variant of the trapped misalignment mechanism can delay the onset of axion oscillation, leading to an axion dark matter window with $m\\_a \\gg 10^{-5}$ eV. This scenario is testable through various experimental approaches, including standard axion haloscopes and helioscopes, as well as searches for electric dipole moments and axion-mediated forces.\n\n", "2408.04611": "2024-08-08, **An empirical background modeling tool (TweedleDEE) applied to new Milky Way satellite Leo VI**, Chance Hoskinson et.al., [2408.04611v1](http://arxiv.org/abs/2408.04611v1)\n\n We present a computational tool, TweedleDEE, for empirically modeling diffuse gamma-ray background emission in a 1 degree region of the sky, using publicly available gamma-ray data slightly off-axis from this region. This background model allows a user to perform a purely data-driven search for anomalous localized sources of gamma-ray emission, including new physics. As an application, we use TweedleDEE and the MADHATv2 package to perform the first search for dark matter annihilation in the newly discovered Leo VI dwarf spheroidal galaxy, and present model constraints for a variety of choices of the annihilation channel and velocity dependence of the cross section.\n\n", "2408.04530": "2024-08-08, **Multidimensionality of the Hubble tension: the roles of $Ω_m$ and $ω_c$**, Davide Pedrotti et.al., [2408.04530v1](http://arxiv.org/abs/2408.04530v1)\n\n The Hubble tension is inherently multidimensional, and bears important implications for parameters beyond $H\\_0$. We discuss the key role of the matter density parameter $\\Omega\\_m$ and the physical cold dark matter density $\\omega\\_c$. We argue that once $\\Omega\\_m$ and the physical baryon density $\\omega\\_b$ are calibrated, through Baryon Acoustic Oscillations (BAO) and/or Type Ia Supernovae (SNeIa) for $\\Omega\\_m$, and via Big Bang Nucleosynthesis for $\\omega\\_b$, any model raising $H\\_0$ inevitably raises $\\omega\\_c$ and, under minimal assumptions, the clustering parameter $S\\_8$. We explicitly verify that this behaviour holds when analyzing recent BAO and SNeIa data. We argue that a calibration of $\\Omega\\_m$ which is as reliable and model-independent as possible should be a priority in the Hubble tension discussion, and an interesting possibility in this sense could be represented by galaxy cluster gas mass fraction measurements.\n\n", "2408.04470": "2024-08-08, **Why artificial disruption is not a concern for current cosmological simulations**, Feihong He et.al., [2408.04470v1](http://arxiv.org/abs/2408.04470v1)\n\n Recent studies suggest that cold dark matter subhalos are hard to disrupt and almost all cases of subhalo disruption observed in numerical simulations are due to numerical effects. However, these findings primarily relied on idealized numerical experiments, which do not fully capture the realistic conditions of subhalo evolution within a hierarchical cosmological context. Based on the Aquarius simulations, we identify clear segregation in the population of surviving and disrupted subhalos, which corresponds to two distinct acquisition channels of subhalos. We find that all of the first-order subhalos accreted after redshift 2 survive to the present time without suffering from artificial disruption. On the other hand, most of the disrupted subhalos are sub-subhalos accreted at high redshift. Unlike the first-order subhalos, sub-subhalos experience pre-processing and many of them are accreted through major mergers at high redshift, resulting in very high mass loss rates. We confirm these high mass loss rates are physical through both numerical experiments and semi-analytical modeling, thus supporting a physical origin for their rapid disappearance in the simulation. Even though we cannot verify whether these subhalos have fully disrupted or not, their extreme mass loss rates dictate that they can at most contribute a negligible fraction to the very low mass end of the subhalo mass function. We thus conclude that current state-of-the-art cosmological simulations have reliably resolved the subhalo population.\n\n", "2408.04425": "2024-08-08, **Effects from Dark Matter Halos on X-ray Pulsar Pulse Profiles**, Yukun Liu et.al., [2408.04425v1](http://arxiv.org/abs/2408.04425v1)\n\n Neutron stars (NSs) can capture dark matter (DM) particles because of their deep gravitational potential and high density. The accumulated DM can affect the properties of NSs. In this work we use a general relativistic two-fluid formalism to solve the structure of DM-admixed NSs (DANSs) and the surrounding spacetime. Specifically, we pay attention to the situation where those DANSs possess DM halos. Due to the gravitational effect of the DM halo, the pulse profile of an X-ray pulsar is changed. Our study finds a universal relation between the peak flux deviation of the pulse profile and $M\\_{\\rm halo}/R\\_{\\rm BM}$, which is the ratio of the DM halo mass, $M\\_{\\rm halo}$, to the baryonic matter (BM) core radius, $R\\_{\\rm BM}$. Our results show that, when $M\\_{\\rm halo}/R\\_{\\rm BM}=0.292$ and the DM particle mass $m\\_f = 0.3\\,$GeV, the maximum deviation of the profile can be larger than 100$\\%$, which has implication in X-ray pulsar observation.\n\n", "2408.03983": "2024-08-07, **Loosely Bound Composite Dark Matter**, Javier F. Acevedo et.al., [2408.03983v1](http://arxiv.org/abs/2408.03983v1)\n\n We investigate loosely bound composite states made of dark matter, where the binding energy for constituent particles is less than the constituent mass. We focus on models of nuclear and molecular dark matter, where constituents are separated by length scales larger than the inverse constituent mass, just like nuclei and atoms in the Standard Model. The cosmology, structure, and interactions at underground experiments are described. We find that loosely bound composites can have a very large cross section for scattering with nuclei that scales with nucleon number like $\\sim A^4$. For some couplings, these composites produce extremely soft ($\\ll$ keV) individual atomic recoils while depositing a large amount of total recoil energy ($\\gg$ keV) in a single passage through a detector, implying an interesting new class of signatures for low threshold direct detection.\n\n", "2408.03861": "2024-08-07, **A tunable photonic band gap resonator for axion dark matter searches**, Samantha M. Lewis et.al., [2408.03861v1](http://arxiv.org/abs/2408.03861v1)\n\n Axions are a well-motivated dark matter candidate particle. Haloscopes aim to detect axions in the galactic halo by measuring the photon signal resulting from axions interacting with a strong magnetic field. Existing haloscopes are primarily targeting axion masses which produce microwave-range photons and rely on microwave resonators to enhance the signal power. Only a limited subset of resonator modes are useful for this process, and current cylindrical-style cavities suffer from mode mixing and crowding from other fundamental modes. The majority of these modes can be eliminated by using photonic band gap (PBG) resonators. The band gap behavior of these structures allows for a resonator with mode selectivity based on frequency. We present results from the first tunable PBG resonator, a proof-of-concept design with a footprint compatible with axion haloscopes. We have thoroughly characterized the tuning range of two versions of the structure and report the successful confinement of the operating TM$\\_{010}$ mode and the elimination of all TE modes within the tuning range.\n\n", "2408.03793": "2024-08-07, **Violations of energy conservation in Horava-Lifshitz gravity: a new ingredient in the dark matter puzzle**, Paolo M Bassani et.al., [2408.03793v1](http://arxiv.org/abs/2408.03793v1)\n\n We investigate the interplay between Horava-Lifshitz (HL) gravity and more general theories where the local Hamiltonian constraint is lost, for example due to the time variability of the Lagrangian (e.g. via its parameters) where time is defined on a foliation according to a prescription mimicking Lambda and 4-volume time in unimodualr gravity. In one direction we subject the multitude of parameters in HL to this variability game, mimicking RG flow in a cosmological setting. In the opposite direction, we examine the evolution on the left-over Hamiltonian should the HL algebra of constraints be still applicable, rather than the algebra of General Relativity being restored. Within the projectable theory, the non-vanishing Hamiltonian can be reinterpreted as a pressureless fluid. Unlike in theories with similar variability based on GR, violations of stress-energy tensor conservation persist, and these are computed here for the full class of projectable HL models. The phenomenological implications are examined: remarkably the driven solutions resulting from these energy conservation violations have the correct profiles to flatten the galactic rotation curves in a toy model. Unfortunately this interesting remark does not survive closer scrutiny: neither is the driven solution an attractor, nor does it have the right sign for acceptable values of the HL parameter, certainly for the simplest terms examined. Yet, in this paper we have established a new ingredient in the dark matter mystery, the possibility of energy conservation violation.\n\n", "2408.03780": "2024-08-07, **Feasibility of dark matter admixed neutron star based on recent observational constraints**, Prashant Thakur et.al., [2408.03780v1](http://arxiv.org/abs/2408.03780v1)\n\n The equation of state (EOS) for neutron stars is modeled using the Relativistic Mean Field (RMF) approach with a mesonic nonlinear (NL) interaction, a modified sigma cut potential (NL-$\\sigma$ cut), and the influences of dark matter in the NL (NL DM). Using a Bayesian analysis framework, we evaluate the plausibility and impact of each scenario. Experimental constraints on the general properties of finite nuclei and heavy ion collisions, along with astrophysical observational data on neutron star radii and tidal deformation, have been taken into account. It was shown that all models, including the PREX-II data, were less favored, indicating that this experimental data seemed to be in tension with the other constraints included in the inference procedure, and were incompatible with chiral effective field theoretical calculations of pure neutron matter. Considering the models with no PREX-II constraints, we find the model NL-$\\sigma$ cut with the largest Bayes evidence, indicating that the constraints considered favor the stiffening of the EOS at large densities. Conversely, the neutron star with a dark matter component is the least favorable case in light of recent observational constraints, among different scenarios considered here. The $f$ and $p$ modes were calculated within the Cowling approximation, and it can be seen that $f$ modes are sensitive to the EOS. An analysis of the slopes of the mass-radius curves and $f$-mode mass curves has indicated that these quantities may help distinguish the different scenarios.We also analyzed the impact of new PSR J0437-4715 measurements on neutron star mass-radius estimates, noting a $\\sim$ 0.2 km reduction in the 90\\% CI upper boundary across all models and a significant Bayes evidence decrease, indicating potential conflicts with previous data or the necessity for more adaptable models.\n\n", "2408.03759": "2024-08-07, **Deep Inelastic Scattering in the Capture of Dark Matter by Neutron Stars**, Liangliang Su et.al., [2408.03759v1](http://arxiv.org/abs/2408.03759v1)\n\n Due to the dense environment, neutron stars (NSs) can serve as an ideal laboratory for studying the interactions between dark matter (DM) and ordinary matter. In the process of DM capture, deep inelastic scattering may dominate over elastic scattering, especially for the DM with a large momentum transfer. In this work, we calculate DM-nucleon deep inelastic scattering via a vector mediator and estimate its contribution to the capture rate. Using the surface temperature of the NSs, we derive the exclusion limits for the DM-nucleon scattering cross section in the mass range, $1~{\\rm GeV}<m\\_{\\chi}< 10^{5}~{\\rm GeV}$. We find the bounds for DM with the mass $\\gtrsim$ 1 GeV can be changed several times after including the deep inelastic scattering contribution.\n\n", "2408.03656": "2024-08-07, **Exploring the Singlino-dominated Thermal Neutralino Dark Matter in the $Z_3$ invariant NMSSM**, Amit Adhikary et.al., [2408.03656v1](http://arxiv.org/abs/2408.03656v1)\n\n We examine the parameter space of the Next to Minimal Supersymmetric Standard Model (NMSSM) with Singlino-dominated neutralino $\\widetilde\\chi\\_1^0$ as the lightest supersymmetric particle (LSP). Our study focuses on identifying the regions within this parameter space that produce a thermal relic abundance of $\\widetilde\\chi\\_1^0$ smaller than the observed cold dark matter relic density while remaining consistent with constraints from LEP measurements, low-energy experiments, Higgs measurements, LHC data, and dark matter direct detection experiments. We identify the dominant annihilation modes of the LSP neutralino across varying LSP mass ranges $\\sim \\mathcal{O}(1)-\\mathcal{O}(10^{3})~$GeV. Furthermore, we conduct a benchmark study to assess the production rates of triple-boson final states emerging from direct electroweakino pair production at the LHC. Drawing insights from these findings, we perform a detailed collider analysis to explore the future potential of probing the triple-boson final states involving a light Higgs boson at the high-luminosity LHC (HL-LHC).\n\n"}, "supernova": {"2408.04530": "2024-08-08, **Multidimensionality of the Hubble tension: the roles of $Ω_m$ and $ω_c$**, Davide Pedrotti et.al., [2408.04530v1](http://arxiv.org/abs/2408.04530v1)\n\n The Hubble tension is inherently multidimensional, and bears important implications for parameters beyond $H\\_0$. We discuss the key role of the matter density parameter $\\Omega\\_m$ and the physical cold dark matter density $\\omega\\_c$. We argue that once $\\Omega\\_m$ and the physical baryon density $\\omega\\_b$ are calibrated, through Baryon Acoustic Oscillations (BAO) and/or Type Ia Supernovae (SNeIa) for $\\Omega\\_m$, and via Big Bang Nucleosynthesis for $\\omega\\_b$, any model raising $H\\_0$ inevitably raises $\\omega\\_c$ and, under minimal assumptions, the clustering parameter $S\\_8$. We explicitly verify that this behaviour holds when analyzing recent BAO and SNeIa data. We argue that a calibration of $\\Omega\\_m$ which is as reliable and model-independent as possible should be a priority in the Hubble tension discussion, and an interesting possibility in this sense could be represented by galaxy cluster gas mass fraction measurements.\n\n", "2408.04354": "2024-08-08, **Exploring the Hubble tension with a late time Modified Gravity scenario**, Luis A. Escamilla et.al., [2408.04354v1](http://arxiv.org/abs/2408.04354v1)\n\n We investigate a modified cosmological model aimed at addressing the Hubble tension, considering revised dynamics in the late Universe. The model introduces a parameter $c$ affecting the evolution equations, motivated by a modified Poisson algebra inspired by effective Loop Quantum Cosmology. Our analysis includes diverse background datasets such as Cosmic Chronometers, Pantheon+ Type Ia Supernovae (with and without the SH0ES calibration), SDSS, DESY6 and DESI Baryon Acoustic Oscillations, and background information of the Cosmic Microwave Background. We find that the model alleviates the Hubble tension in most of the dataset combinations, with cases reducing discrepancies to below $1\\sigma$ when including SH0ES. However, the model exhibits minimal improvement in the overall fit when compared to $\\Lambda$CDM, and Bayesian evidence generally favors the standard model. Theoretical foundations support this approach as a subtle adjustment to low-redshift dynamics, suggesting potential for further exploration into extensions of $\\Lambda$CDM. Despite challenges in data fitting, our findings underscore the promise of small-scale modifications in reconciling cosmological tensions.\n\n", "2408.03996": "2024-08-07, **The atomic gas sequence and mass-metallicity relation from dwarfs to massive galaxies**, D. Scholte et.al., [2408.03996v1](http://arxiv.org/abs/2408.03996v1)\n\n Galaxy scaling relations provide insights into the processes that drive galaxy evolution. The extension of these scaling relations into the dwarf galaxy regime is of particular interest. This is because dwarf galaxies represent a crucial stage in galaxy evolution, and understanding them could also shed light on their role in reionising the early Universe. There is currently no consensus on the processes that dominate the evolution of dwarfs. In this work we constrain the atomic gas sequence (stellar mass vs. atomic gas fraction) and mass-metallicity relation (stellar mass vs. gas phase metallicity) from dwarf ($10^{6.5}$ $\\textrm{M}\\_{\\odot}$) to massive ($10^{11.5}$ $\\textrm{M}\\_{\\odot}$) galaxies in the local Universe. The combined optical and 21-cm spectroscopic observations of the DESI and ALFALFA surveys allow us to simultaneously constrain both scaling relations. We find a slope change of the atomic gas sequence at a stellar mass of $\\sim 10^{9} ~\\textrm{M}\\_{\\odot}$. We also find that the shape and scatter of the atomic gas sequence and mass-metallicity relation are strongly linked for both dwarfs and more massive galaxies. Consequently, the low mass slope change of the atomic gas sequence is imprinted onto the mass-metallicity relation of dwarf galaxies. The mass scale of the measured slope change is consistent with a predicted escape velocity threshold below which low mass galaxies experience significant supernova-driven gas loss, as well as with a reduction in cold gas accretion onto more massive galaxies.\n\n", "2408.03993": "2024-08-07, **Circumstellar Interaction in the Ultraviolet Spectra of SN 2023ixf 14-66 Days After Explosion**, K. Azalee Bostroem et.al., [2408.03993v1](http://arxiv.org/abs/2408.03993v1)\n\n SN 2023ixf was discovered in M101 within a day of explosion and rapidly classified as a Type II supernova with flash features. Here we present ultraviolet (UV) spectra obtained with the Hubble Space Telescope 14, 19, 24, and 66 days after explosion. Interaction between the supernova ejecta and circumstellar material (CSM) is seen in the UV throughout our observations in the flux of the first three epochs and asymmetric MgII emission at day 66. We compare our observations to CMFGEN supernova models which include CSM interaction ($\\dot{M}<10^{-3}$ $M\\_{\\odot}$/yr) and find that the power from CSM interaction is decreasing with time, from $L\\_{\\rm sh}\\approx5\\times10^{42}$ erg/s at day 14 to $L\\_{sh}\\approx1\\times10^{40}$ erg/s at day 66. We examine the contribution of individual atomic species to the spectra at day 14 and 19, showing that the majority of the features are dominated by iron, nickel, magnesium, and chromium absorption in the ejecta. The UV spectral energy distribution of SN 2023ixf sits between that of supernovae which show no definitive signs of CSM interaction and those with persistent signatures assuming the same progenitor radius and metallicity. Finally, we show that the evolution and asymmetric shape of the MgII emission are not unique to SN 2023ixf. These observations add to the early measurements of dense, confined CSM interaction, tracing the mass-loss history of SN 2023ixf to $\\sim33$ yr prior to explosion and the density profile to a radius of $\\sim5.7\\times10^{15}$ cm. They show the relatively short evolution from quiescent red supergiant wind to high mass loss.\n\n", "2408.03916": "2024-08-07, **Building spectral templates and reconstructing parameters for core collapse supernovae with CASTOR**, Andrea Simongini et.al., [2408.03916v1](http://arxiv.org/abs/2408.03916v1)\n\n The future of time-domain optical astronomy relies on the development of techniques and software capable of handling a rising amount of data and gradually complementing, or replacing if necessary, real observations. Next generation surveys, like the Large Synoptic Survey Telescope (LSST), will open the door to the new era of optical astrophysics, creating, at the same time, a deficiency in spectroscopic data necessary to confirm the nature of each event and to fully recover the parametric space. In this framework, we developed Core collApse Supernovae parameTers estimatOR (CASTOR), a novel software for data analysis. CASTOR combines Gaussian Process and other Machine Learning techniques to build time-series templates of synthetic spectra and to estimate parameters of core collapse supernovae for which only multi-band photometry is available. Techniques to build templates are fully data driven and non-parametric through empirical and robust models, and rely on the direct comparison with a training set of 111 core collapse supernovae from the literature. Furthermore, CASTOR employees the real photometric data and the reconstructed synthetic spectra of an event to estimate parameters that belong to the supernova ejecta, to the stellar progenitor and to the event itself, in a rapid and user-friendly framework. In this work we provide a demonstration of how CASTOR works, studying available data from SN2015ap and comparing our results with those available in literature.\n\n", "2408.03902": "2024-08-07, **HOLISMOKES -- XIV. Time-delay and differential dust extinction determination with lensed type II supernova color curves**, J. Grupa et.al., [2408.03902v1](http://arxiv.org/abs/2408.03902v1)\n\n The Hubble tension is one of the most relevant unsolved problems in cosmology today. Strongly gravitationally lensed transient objects, such as strongly lensed supernovae, are an independent and competitive probe that can be used to determine the Hubble constant. In this context, the time delay between different images of lensed supernovae is a key ingredient. We present a method, to retrieve time delays and the amount of differential dust extinction between multiple images of lensed type IIP supernovae through their color curves, which display a kink in the time evolution. With multiple realistic mock color curves based on an observed unlensed supernova from the Carnegie Supernova Project, we demonstrate that we can retrieve the time delay with uncertainties of $\\pm$1.0 days for light curves with 2-day cadence and 35% missing data due to weather losses. The differential dust extinction is more susceptible to uncertainties, because it depends on imposing the correct extinction law. Further we also investigate the kink structure in the color curves for different rest-frame wavelength bands, particularly rest-frame UV light curves from SWIFT, finding sufficiently strong kinks for our method to work for typical lensed SN redshifts that would redshift the kink feature to optical wavelengths. With the upcoming Rubin Observatory Legacy Survey of Space and Time, hundreds of strongly lensed supernovae will be detected and our new method for lensed SN IIP is readily applicable to provide delays.\n\n", "2408.03875": "2024-08-07, **Effects of a local physics change on the SH0ES determination of $H_0$**, Ruchika et.al., [2408.03875v1](http://arxiv.org/abs/2408.03875v1)\n\n The Hubble tension, a significant discrepancy between the Hubble constant ($H\\_0$) values derived from early-time (Cosmic Microwave Background and Baryon Acoustic Oscillations) and late-time (Cepheid-calibrated Type Ia Supernovae) measurements, remains a major challenge in cosmology. Traditional attempts to resolve this tension have struggled to maintain consistency with dynamical and geometrical probes at redshifts $0.01 < z \\lesssim 2.5$. We explore a novel model introducing new degrees of freedom in local physical laws affecting calibrators like Cepheids and Type Ia Supernovae within a distance of $d \\lesssim 50$ Mpc ($z \\lesssim 0.01$). Specifically, we incorporate a gravitational transition causing a change in the gravitational constant ($G$) at a specific distance, affecting the Cepheid Period-Luminosity Relation (PLR) and the absolute magnitude of SNe Ia. We verify the inverse scaling of SN luminosity $L$ with Chandrasekhar Mass $M\\_C$ in a changed $G$ scenario as predicted using a semi-analytical model in a recent theoretical study \\cite{Wright2018}. Fixing $\\Delta G/G \\approx 0.04$, our model naturally resolves the Hubble tension, yielding a best-fit $H\\_0$ value consistent with the Planck measurement, even without using Planck data. This approach suggests a potential resolution to the Hubble tension by aligning $H\\_0$ with high-redshift CMB measurements.\n\n", "2408.03749": "2024-08-07, **Suppression of the type Ia supernova host galaxy step in the outer regions of galaxies**, M. Toy et.al., [2408.03749v1](http://arxiv.org/abs/2408.03749v1)\n\n Using 1533 type Ia supernovae (SNe Ia) from the five-year sample of the Dark Energy Survey (DES), we investigate the effects of projected galactocentric separation between the SNe and their host galaxies on their light curves and standardization. We show, for the first time, that the difference in SN Ia post-standardization brightnesses between high and low-mass hosts reduces from $0.078\\pm0.011$ mag in the full sample to $0.036 \\pm 0.018$ mag for SNe Ia located in the outer regions of their host galaxies, while increasing to $0.100 \\pm 0.014$ mag for SNe in the inner regions. In these inner regions, the step can be reduced (but not removed) using a model where the $R\\_V$ of dust along the line-of-sight to the SN changes as a function of galaxy properties. To explain the remaining difference, we use the distributions of the SN Ia stretch parameter to test whether the inferred age of SN progenitors are more varied in the inner regions of galaxies. We find that the proportion of high-stretch SNe Ia in red (older) environments is more prominent in outer regions and that the outer regions stretch distributions are overall more homogeneous compared to inner regions, but conclude that this effect cannot explain the reduction in significance of any Hubble residual step in outer regions. We conclude that the standardized distances of SNe Ia located in the outer regions of galaxies are less affected by their global host galaxy properties than those in the inner regions.\n\n", "2408.03731": "2024-08-07, **The $R$-Process Alliance: Fifth Data Release from the Search for $R$-Process-Enhanced Metal-poor Stars in the Galactic Halo with the GTC**, Avrajit Bandyopadhyay et.al., [2408.03731v1](http://arxiv.org/abs/2408.03731v1)\n\n Understanding the abundance pattern of metal-poor stars and the production of heavy elements through various nucleosynthesis processes offers crucial insights into the chemical evolution of the Milky Way, revealing primary sites and major sources of rapid neutron-capture process ($r$-process) material in the Universe. In this fifth data release from the $R$-Process Alliance, we present the detailed chemical abundances of 41 faint (down to V = 15.8) and extremely metal-poor (down to [Fe/H] = -3.3) halo stars selected from the $R$-Process Alliance (RPA). We obtained high-resolution spectra for these objects with the HORuS spectrograph on the Gran Telescopio Canarias. We measure the abundances of light, alpha, Fe-peak, and neutron-capture elements. We report the discovery of five CEMP, one limited-$r$, three $r$-I, and four $r$-II stars, and six Mg-poor stars. We also identify one star of a possible globular cluster origin at an extremely low metallicity at [Fe/H] = -3.0. This adds to the growing evidence of a lower limit metallicity floor for globular cluster abundances. We use the abundances of Fe-peak elements and the alpha-elements to investigate the contributions from different nucleosynthesis channels in the progenitor supernovae. We find the distribution of [Mg/Eu] as a function of [Fe/H] to have different enrichment levels, indicating different possible pathways and sites of their production. We also reveal differences in the trends of the neutron-capture element abundances of Sr, Ba, and Eu of various r-I and r-II stars from the RPA data releases, which provide constraints on their nucleosynthesis sites and subsequent evolution.\n\n", "2408.03725": "2024-08-07, **Two novel $f(Q)$ models**, Xianfu Su et.al., [2408.03725v2](http://arxiv.org/abs/2408.03725v2)\n\n We propose two novel models in the framework of $f(Q)$ gravity to explain our accelerated universe, namely the exponential $f(Q)\\_{EXP}$ model and the hyperbolic tangent $f(Q)\\_{HT}$ model. The current cosmological electromagnetic observations including the cosmic microwave background anisotropies (CMB), the baryon acoustic oscillations(BAO), the type Ia supernovae (SN) and the direct measurements of H(z), combined with the simulated gravitational-wave data are used to constrain the $f(Q)$ models. We find that the Hubble tension can be significantly alleviated to $1.40\\sigma$ level in the $f(Q)\\_{EXP}$ model. The fitting $\\chi^2$ of the $f(Q)\\_{HT}$ model is $9.75\\sigma$ poorer than that of the $f(Q)\\_{EXP}$ model, implying the $f(Q)\\_{HT}$ model would be excluded by future gravitational-wave observation.\n\n", "2408.03660": "2024-08-07, **An improved Tully-Fisher estimate of $H_0$**, Paula Boubel et.al., [2408.03660v1](http://arxiv.org/abs/2408.03660v1)\n\n We propose an improved comprehensive method for determining the Hubble constant ($H\\_0$) using the Tully-Fisher relation. By fitting a peculiar velocity model in conjunction with the Tully-Fisher relation, all available data can be used to derive self-consistent Tully-Fisher parameters. In comparison to previous approaches, our method offers several improvements: it can be readily generalised to different forms of the Tully-Fisher relation and its intrinsic scatter; it uses a peculiar velocity model to predict distances more accurately; it can account for all selection effects; it uses the entire dataset to fit the Tully-Fisher relation; and it is fully self-consistent. The Tully-Fisher relation zero-point is calibrated using the subset of galaxies with distances from absolute distance indicators. We demonstrate this method on the Cosmicflows-4 catalogue $i$-band and $W1$-band Tully-Fisher samples and show that the uncertainties from fitting the Tully-Fisher relation amount to only 0.2 km s$^{-1}$Mpc$^{-1}$. Using all available absolute distance calibrators, we obtain $H\\_0=73.3$ $\\pm$ 2.1 (stat) $\\pm$ 3.5 (sys) km s$^{-1}$Mpc$^{-1}$, where the statistical uncertainty is dominated by the small number of galaxies with absolute distance estimates. The substantial systematic uncertainty reflects inconsistencies between various zero-point calibrations of the Cepheid period-luminosity relation, the tip of the red giant branch standard candle, and the Type Ia supernova standard candle. However, given a reliable set of absolute distance calibrators, our method promises enhanced precision in $H\\_0$ measurements from large new Tully-Fisher samples such as the WALLABY survey.\n\n"}}