{"neutrino": {"2308.12125": "2023-08-23, **Progress Towards a Diffuse Neutrino Search in the Full Livetime of the Askaryan Radio Array**, Paramita Dasgupta et.al., [2308.12125v1](http://arxiv.org/abs/2308.12125v1)\n\n The Askaryan Radio Array (ARA) is an in-ice ultrahigh energy (UHE, $>10$ PeV) neutrino experiment at the South Pole that aims to detect radio emissions from neutrino-induced particle cascades. ARA has five independent stations which together have collected nearly 24 station-years of data. Each of these stations search for UHE neutrinos by burying in-ice clusters of antennas $\\sim 200$ m deep in a roughly cubical lattice with side length $\\sim 15$ m. Additionally, the fifth ARA station (A5) has a beamforming trigger, referred to as the Phased Array (PA), consisting of a trigger array of 7 tightly packed vertically-polarized antennas. In this proceeding, we will present a neutrino search with the data of this \"hybrid\" station, emphasizing its capabilities for improved analysis efficiencies, background rejection, and neutrino vertex reconstruction. This is enabled by combining the closely packed trigger antennas with the long-baselines of the outrigger antennas. We will also place the A5 analysis into the context of the broader five station analysis program, including efforts to characterize and calibrate the detector, model and constrain backgrounds, and reject noise across the entire array. We anticipate this full neutrino search to set world-leading limits above 100 PeV, and inform the next generation of neutrino detection experiments.\n\n", "2308.12105": "2023-08-23, **Pulse shape discrimination for the CONUS experiment in the keV and sub-keV regime**, H. Bonet et.al., [2308.12105v1](http://arxiv.org/abs/2308.12105v1)\n\n Point-contact p-type high-purity germanium detectors (PPC HPGe) are particularly suited for detection of sub-keV nuclear recoils from coherent elastic scattering of neutrinos or light dark matter particles. While these particles are expected to interact homogeneously in the entire detector volume, specific classes of external background radiation preferably deposit their energy close to the semi-active detector surface, in which diffusion processes dominate that subsequently lead to slower rising pulses compared to the ones from the fully active bulk volume. Dedicated studies of their shape are therefore highly beneficial for the understanding and the rejection of these unwanted events. This article reports about the development of a data-driven pulse shape discrimination (PSD) method for the four 1 kg size PPC HPGe detectors of the CONUS experiment in the keV and sub-keV regime down to 210 eV$\\_{\\text{ee}}$. The impact of the electronic noise at such low energies is carefully examined. It is shown that for an acceptance of 90% of the faster signal-like pulses from the bulk volume, approx. 50% of the surface events can be rejected at the energy threshold and that their contribution is fully suppressed above 800 eV$\\_{\\text{ee}}$. Applied to the CONUS background data, such a PSD rejection cut allows to achieve an overall (15-25)% reduction of the total background budget. The new method allows to improve the sensitivity of future CONUS analyses and to refine the corresponding background model in the sub-keV energy region.\n\n", "2308.11608": "2023-08-22, **A Measurement of Gravitational Lensing of the Cosmic Microwave Background Using SPT-3G 2018 Data**, Z. Pan et.al., [2308.11608v1](http://arxiv.org/abs/2308.11608v1)\n\n We present a measurement of gravitational lensing over 1500 deg$^2$ of the Southern sky using SPT-3G temperature data at 95 and 150 GHz taken in 2018. The lensing amplitude relative to a fiducial Planck 2018 $\\Lambda$CDM cosmology is found to be $1.020\\pm0.060$, excluding instrumental and astrophysical systematic uncertainties. We conduct extensive systematic and null tests to check the robustness of the lensing measurements, and report a minimum-variance combined lensing power spectrum over angular multipoles of $50<L<2000$, which we use to constrain cosmological models. When analyzed alone and jointly with primary cosmic microwave background (CMB) spectra within the $\\Lambda$CDM model, our lensing amplitude measurements are consistent with measurements from SPT-SZ, SPTpol, ACT, and Planck. Incorporating loose priors on the baryon density and other parameters including uncertainties on a foreground bias template, we obtain a $1\\sigma$ constraint on $\\sigma\\_8 \\Omega\\_{\\rm m}^{0.25}=0.595 \\pm 0.026$ using the SPT-3G 2018 lensing data alone, where $\\sigma\\_8$ is a common measure of the amplitude of structure today and $\\Omega\\_{\\rm m}$ is the matter density parameter. Combining SPT-3G 2018 lensing measurements with baryon acoustic oscillation (BAO) data, we derive parameter constraints of $\\sigma\\_8 = 0.810 \\pm 0.033$, $S\\_8 \\equiv \\sigma\\_8(\\Omega\\_{\\rm m}/0.3)^{0.5}= 0.836 \\pm 0.039$, and Hubble constant $H\\_0 =68.8^{+1.3}\\_{-1.6}$ km s$^{-1}$ Mpc$^{-1}$. Using CMB anisotropy and lensing measurements from SPT-3G only, we provide independent constraints on the spatial curvature of $\\Omega\\_{K} = 0.014^{+0.023}\\_{-0.026}$ (95% C.L.) and the dark energy density of $\\Omega\\_\\Lambda = 0.722^{+0.031}\\_{-0.026}$ (68% C.L.). When combining SPT-3G lensing data with SPT-3G CMB anisotropy and BAO data, we find an upper limit on the sum of the neutrino masses of $\\sum m\\_{\\nu}< 0.30$ eV (95% C.L.).\n\n", "2308.11476": "2023-08-22, **Searching for neutrino-modulino oscillations at the Forward Physics Facility**, Luis A. Anchordoqui et.al., [2308.11476v1](http://arxiv.org/abs/2308.11476v1)\n\n We make use of swampland conjectures to explore the phenomenology of neutrino-modulino mixing in regions of the parameter space that are within the sensitivity of experiments at the CERN's Forward Physics Facility (FPF). We adopt the working assumption of Dirac mass terms which couple left- and right-handed neutrinos. We further assume that the 3 right-handed neutrinos are 0-modes of bulk 5-dimensional states in the dark dimension, a novel scenario which has a compact space with characteristic length-scale in the micron range that produces a natural suppression of the 4-dimensional Yukawa couplings, yielding naturally light Dirac neutrinos. We formulate a specific realization of models with high-scale supersymmetry breaking that can host a rather heavy gravitino ($m\\_{3/2} \\sim 250$ TeV) and a modulino with mass scale ($m\\_4 \\sim 50$ eV) within the FPF discovery reach.\n\n", "2308.11436": "2023-08-22, **The cosipy library: COSI's high-level analysis software**, Israel Martinez-Castellanos et.al., [2308.11436v1](http://arxiv.org/abs/2308.11436v1)\n\n The Compton Spectrometer and Imager (COSI) is a selected Small Explorer (SMEX) mission launching in 2027. It consists of a large field-of-view Compton telescope that will probe with increased sensitivity the under-explored MeV gamma-ray sky (0.2-5 MeV). We will present the current status of cosipy, a Python library that will perform spectral and polarization fits, image deconvolution, and all high-level analysis tasks required by COSI's broad science goals: uncovering the origin of the Galactic positrons, mapping the sites of Galactic nucleosynthesis, improving our models of the jet and emission mechanism of gamma-ray bursts (GRBs) and active galactic nuclei (AGNs), and detecting and localizing gravitational wave and neutrino sources. The cosipy library builds on the experience gained during the COSI balloon campaigns and will bring the analysis of data in the Compton regime to a modern open-source likelihood-based code, capable of performing coherent joint fits with other instruments using the Multi-Mission Maximum Likelihood framework (3ML). In this contribution, we will also discuss our plans to receive feedback from the community by having yearly software releases accompanied by publicly-available data challenges.\n\n", "2308.11403": "2023-08-22, **Searching for Charged Lepton Flavour Violation with Mu3e**, Ann-Kathrin Perrevoort et.al., [2308.11403v1](http://arxiv.org/abs/2308.11403v1)\n\n The observation of lepton flavour violation (LFV) in the charged lepton sector would be an unambiguous sign of physics beyond the Standard Model (BSM), and thus, it is the channel of choice for many BSM searches. LFV searches in muon decays in particular benefit from the fact that muons can be easily produced at high rates. There is a global effort to search for LFV at high-intensity muon sources to which the upcoming Mu3e experiment at the Paul Scherrer Institute (PSI) will contribute. The Mu3e Collaboration aims to perform a background-free search for the LFV decay $\\mu^+\\to e^+e^-e^+$ with an unprecedented sensitivity in the order of $10^{-15}$ in the first phase of operation and $10^{-16}$ in the final phase - an improvement over the preceding SINDRUM experiment by four orders of magnitude. The high muon stopping rates and low momenta of the decay electrons make high demands on momentum and time resolution and on the data acquisition. The innovative experimental concept is based on a tracking detector built from novel ultra-thin silicon pixel sensors and scintillating fibres and tiles as well as online event reconstruction and filtering in real time.\n\n", "2308.11313": "2023-08-22, **Identification of time-correlated neutrino clusters in populations of astrophysical transient sources**, Mathieu Lamoureux et.al., [2308.11313v1](http://arxiv.org/abs/2308.11313v1)\n\n The detection of astrophysical neutrinos from transient sources can help to understand the origin of the neutrino diffuse flux and to constrain the underlying production mechanisms. In particular, proton-neutron collisions may produce GeV neutrinos. However, at these energies, neutrino data from large water Cherenkov telescopes, like KM3NeT and IceCube, are dominated by the well-known atmospheric neutrino flux. It is then necessary to identify a sub-dominant component due to an astrophysical emission based on time correlation across messengers. The contribution covers several methods to search for such a signal in short time windows centered on observed transient sources, including a novel approach based on the distribution of time differences. Their performance is compared in the context of subpopulations of astrophysical sources that may show prompt or delayed neutrino emissions. The outlook for the usage of such techniques in actual analyses is also presented.\n\n", "2308.11299": "2023-08-22, **Nuclear $β$ spectrum from projected shell model (I): allowed one-to-one transition**, Fan Gao et.al., [2308.11299v1](http://arxiv.org/abs/2308.11299v1)\n\n Nuclear $\\beta$ spectrum and the corresponding (anti-)neutrino spectrum play important roles in many aspects of nuclear astrophysics, particle physics, nuclear industry and nuclear data. In this work we propose a projected shell model (PSM) to calculate the level energies as well as the reduced one-body transition density (ROBTD) by the Pfaffian algorithm for nuclear $\\beta$ decays. The calculated level energies and ROBTD are inputed to the Beta Spectrum Generator (BSG) code to study the high precision $\\beta$ spectrum of allowed one-to-one transitions. When experimental level energies are adopted, the calculated $\\beta$ spectrum by ROBTD of the PSM deviates from the one by the extreme simple particle evaluation of the BSG by up to $10\\%$, reflecting the importance of nuclear many-body correlations. When calculated level energies are adopted, the calculated $\\beta$ spectrum shows sensitive dependence on the reliability of calculated level energies. The developed method for ROBTD by the PSM will also be useful for study of the first-forbidden transitions, the isovector spin monopole resonance etc. in a straightforward way.\n\n"}, "dark matter": {"2308.12176": "2023-08-23, **The DAMIC excess from WIMP-nucleus elastic scattering**, A. E. Chavarria et.al., [2308.12176v1](http://arxiv.org/abs/2308.12176v1)\n\n Two dark matter searches performed with charge-coupled devices (CCDs) in the DAMIC cryostat at SNOLAB reported with high statistical significance the presence of an unidentified source of low-energy events in bulk silicon. The observed spectrum is consistent with nuclear recoils from the elastic scattering of weakly interacting massive particles (WIMPs) with masses between 2 and 3 GeV. In the standard scenario of spin-independent WIMP-nucleus scattering, the derived cross section is conclusively excluded by results in argon by the DarkSide-50 experiment. We identify isospin-violating and spin-dependent scenarios where interactions with $^{40}$Ar are strongly suppressed and the interpretation of the DAMIC excess as WIMP-nucleus elastic scattering remains viable.\n\n", "2308.12174": "2023-08-23, **Scalar- and Vector Dark Matter Admixed Neutron Stars**, Cédric Jockel et.al., [2308.12174v1](http://arxiv.org/abs/2308.12174v1)\n\n It is believed that dark matter (DM) could accumulate inside neutron stars and significantly change their masses, radii and tidal properties. We study what effect bosonic dark matter, modelled as a massive and self-interacting scalar or vector field, has on neutron stars. We derive equations to compute the tidal deformability of the full Einstein-Hilbert-Klein-Gordon system self-consistently, and probe the influence of the scalar field mass and self-interaction strength on the total mass and tidal properties of the combined system, called fermion boson stars (FBS). We are the first to combine Proca stars with neutron stars to mixed systems of fermions and a vector field in Einstein-Proca theory, which we name fermion Proca stars (FPS). We construct equilibrium solutions of FPS, compute their masses, radii and analyse them regarding their stability and higher modes. We find that FPS tend to be more massive and geometrically larger than FBS for equal boson masses and self-interaction strengths. Both FBS and FPS admit DM core and DM cloud solutions and we find that they can produce degenerate results. Core solutions compactify the neutron star component and lower their tidal deformability, cloud solutions have the inverse effect. Electromagnetic observations of certain cloud-like configurations would appear to violate the Buchdahl limit. The self-interaction strength is found to significantly affect both mass and tidal deformability. We discuss observational constraints and the connection to anomalous detections. We also show how models with an effective equation of state compare to the self-consistent solution of FBS and find the self-interaction strength where both solutions converge sufficiently.\n\n", "2308.12154": "2023-08-23, **QCD Axion Hybrid Inflation**, Yuma Narita et.al., [2308.12154v1](http://arxiv.org/abs/2308.12154v1)\n\n When the inflaton is coupled to the gluon Chern-Simons term for successful reheating, mixing between the inflaton and the QCD axion is generally expected given the solution of the strong CP problem by the QCD axion. This is particularly natural if the inflaton is a different, heavier axion. We propose a scenario in which the QCD axion plays the role of the inflaton by mixing with heavy axions. In particular, if the energy scale of inflation is lower than the QCD scale, a hybrid inflation is realized where the QCD axion plays the role of the inflaton in early stages. We perform detailed numerical calculations to take account of the mixing effects. Interestingly, the initial misalignment angle of the QCD axion, which is usually a free parameter, is determined by the inflaton dynamics. It is found to be close to $\\pi$ in simple models. This is the realization of the pi-shift inflation proposed in previous literature, and it shows that QCD axion dark matter and inflation can be closely related. The heavy axion may be probed by future accelerator experiments.\n\n", "2308.12026": "2023-08-23, **Prospects of detecting gamma-ray signal of dark matter interaction with the MACE telescope**, M. Khurana et.al., [2308.12026v1](http://arxiv.org/abs/2308.12026v1)\n\n The MACE (Major Atmospheric Cherenkov Experiment) telescope has started its regular gamma-ray observations at Hanle in India. Located at an altitude of $\\sim$ 4.3 km above sea level and equipped with a 21 m diameter large quasi-parabolic reflector, it has the capability to explore the gamma-ray sky in the energy range above 20 GeV with very high sensitivity. In this work, we present the results from the feasibility studies for searching high-energy gamma-ray signals from dark matter interaction in potential astrophysical environments. We study the impact of MACE response function and other instrumental characteristics to probe the velocity average interaction cross-section ($<\\sigma v>$) of the weakly interacting massive particles (WIMPs), expected from the thermal dark matter freeze-out during the decoupling era. We consider the presence of dark matter in the form of pure WIMPs in the mass range 200 GeV - 10 TeV to produce distinctive gamma-ray spectra through its self-annihilation into standard model particles using the Pythia simulation package. The convolution of gamma-ray spectra corresponding to different standard model channels with the MACE response function is used to estimate the upper limit on $<\\sigma v>$ for 100 hours of expected MACE observation of Segue1 (a dwarf spheroidal galaxy) which is a potential site of dark matter.\n\n", "2308.11323": "2023-08-22, **Tidal properties of neutron stars in scalar-tensor theories of gravity**, Gastón Creci et.al., [2308.11323v1](http://arxiv.org/abs/2308.11323v1)\n\n A major science goal of gravitational-wave (GW) observations is to probe the nature of gravity and constrain modifications to General Relativity. An established class of modified gravity theories are scalar-tensor models, which introduce an extra scalar degree of freedom. This affects the internal structure of neutron stars (NSs), as well as their dynamics and GWs in binary systems, where distinct novel features can arise from the appearance of scalar condensates in parts of the parameter space. To improve the robustness of the analyses of such GW events requires advances in modeling internal-structure-dependent phenomena in scalar-tensor theories. We develop an effective description of potentially scalarized NSs on large scales, where information about the interior is encoded in characteristic Love numbers or equivalently tidal deformabilities. We demonstrate that three independent tidal deformabilities are needed to characterize the configurations: a scalar, tensor, and a novel 'mixed' parameter, and develop the general methodology to compute these quantities. We also present case studies for different NS equations of state and scalar properties and provide the mapping between the deformabilities in different frames often used for calculations. Our results have direct applications for future GW tests of gravity and studies of potential degeneracies with other uncertain physics such as the equation of state or presence of dark matter in NS binary systems.\n\n", "2308.11094": "2023-08-22, **WKB approximation to boson dark matter**, Lauren Street et.al., [2308.11094v1](http://arxiv.org/abs/2308.11094v1)\n\n Galactic dark matter halos may be composed of ultralight axions (ULAs) ($m\\_a \\lesssim 1$ eV) with wave functions that satisfy nonlinear Schr\\\"{o}dinger-Poisson equations (SPA). We find eigenstates of SPA in WKB approximation. The expansion parameter of the WKB approximation is $\\delta=1/\\sqrt{S}$, where $S=2 M R G m\\_a^{2}$, with $M$ being the total mass, $R$ the radius of the halo, and $G$ the gravitational constant. $S\\gg 1$ for almost all galaxies, even if the ULA mass is as small as $m\\_a=10^{-22} $ eV, making the leading order WKB approximation almost exact. As the level spacing of bound states is roughly proportional to $\\delta$, the number of states in the gravitational well is huge. We do not see a reason why not all or most of them contribute to the halo. Using an appropriate distribution function allows the summation of states to construct the profile of the halo as a function of the gravitational potential, which can be found solving the Poisson equation. Using various energy distribution functions, we obtain results similar to those in simulations. Future plans include investigations of collapse through time dependent generalizations, and inclusion of self-interactions, which also induce decay processes of the halo.\n\n"}, "supernova": {"2308.11913": "2023-08-23, **Polarization Signature of Companion-Fed Supernovae Arising from BH-NS/BH Progenitor Systems**, Xudong Wen et.al., [2308.11913v1](http://arxiv.org/abs/2308.11913v1)\n\n The formation of black hole-neutron star (BH-NS) or BH-BH systems may be accompanied with special supernova (SN) signals, due to the accretion feedback from the companion BH. The additional heating, which is mainly attributed to the Blandford-Payne mechanism, would disrupt the isotropic nature of the luminosity distribution on the surface of the SN ejecta, leading to the appearance of polarization. Here we develop a three dimensional (3D) Monte Carlo polarization simulation code (MCPSC) to conduct simulations for these special SNe. We find that the maximum polarization level of approximately \\sim 2 occurs at the peak time of SN emission in the \"close-binary\" scenario, while in the \"faraway-binary\" case, maximum polarization (i.e. \\sim 0.7) is observed at a considerably later time than the peak of the SN. The magnitude of polarization is dependent on the degree of unevenness in the luminosity distribution and the angle between the line of sight and the equatorial direction. When considering the geometric distortion of supernova ejecta at the same time, the magnitude of polarization may either increase (for a oblate ellipsoidal shape) or decrease (for a prolate ellipsoidal shape). The polarization signatures represent a promising auxiliary instrument to facilitate the identification of the companion-fed SNe. Moreover, by comparing the event rate of these special SNe with the event rate density of LIGO-Virgo detected BH-NS/BH systems could further help to distinguish the BH-NS/BH formation channel.\n\n", "2308.11372": "2023-08-22, **The population of Galactic supernova remnants in the TeV range**, Rowan Batzofin et.al., [2308.11372v1](http://arxiv.org/abs/2308.11372v1)\n\n SNRs are likely to be significant sources of Galactic cosmic rays up to the knee. They produce gamma rays in the very-high-energy (E>100 GeV) range mainly via two mechanisms: hadronic interactions of accelerated protons with the interstellar medium and leptonic interactions of accelerated electrons with soft photons. Observations with current instruments have lead to the detection of about a dozen SNRs in VHE gamma rays and future instruments will help significantly increase this number. Yet, the details of particle acceleration at SNRs, and of the mechanisms producing VHE gamma-ray at SNRs remain poorly understood: What is the spectrum of accelerated particles? What is the efficiency of particle acceleration? Is the gamma-ray emission dominated by hadronic or leptonic origin?   To address these questions, we simulate the population of SNRs in the gamma-ray domain, and confront it to the current population of TeV SNRs. This method allows us to investigate several crucial aspects of particle acceleration at SNRs, such as the level of magnetic field around SNR shocks or scanning the parameter space of the accelerated particles (spectral index, electron to proton ratio and the acceleration efficiency of the shock) with the possibility to constrain some of the parameters.\n\n"}}