{"neutrino": {"2304.05203": "2023-04-11, **The Atacama Cosmology Telescope: DR6 Gravitational Lensing Map and Cosmological Parameters**, Mathew S. Madhavacheril et.al., [2304.05203v1](http://arxiv.org/abs/2304.05203v1)\n\n We present cosmological constraints from a gravitational lensing mass map covering 9400 sq. deg. reconstructed from CMB measurements made by the Atacama Cosmology Telescope (ACT) from 2017 to 2021. In combination with BAO measurements (from SDSS and 6dF), we obtain the amplitude of matter fluctuations $\\sigma\\_8 = 0.819 \\pm 0.015$ at 1.8% precision, $S\\_8\\equiv\\sigma\\_8({\\Omega\\_{\\rm m}}/0.3)^{0.5}=0.840\\pm0.028$ and the Hubble constant $H\\_0= (68.3 \\pm 1.1)\\, \\text{km}\\,\\text{s}^{-1}\\,\\text{Mpc}^{-1}$ at 1.6% precision. A joint constraint with CMB lensing measured by the Planck satellite yields even more precise values: $\\sigma\\_8 = 0.812 \\pm 0.013$, $S\\_8\\equiv\\sigma\\_8({\\Omega\\_{\\rm m}}/0.3)^{0.5}=0.831\\pm0.023$ and $H\\_0= (68.1 \\pm 1.0)\\, \\text{km}\\,\\text{s}^{-1}\\,\\text{Mpc}^{-1}$. These measurements agree well with $\\Lambda$CDM-model extrapolations from the CMB anisotropies measured by Planck. To compare these constraints to those from the KiDS, DES, and HSC galaxy surveys, we revisit those data sets with a uniform set of assumptions, and find $S\\_8$ from all three surveys are lower than that from ACT+Planck lensing by varying levels ranging from 1.7-2.1$\\sigma$. These results motivate further measurements and comparison, not just between the CMB anisotropies and galaxy lensing, but also between CMB lensing probing $z\\sim 0.5-5$ on mostly-linear scales and galaxy lensing at $z\\sim 0.5$ on smaller scales. We combine our CMB lensing measurements with CMB anisotropies to constrain extensions of $\\Lambda$CDM, limiting the sum of the neutrino masses to $\\sum m\\_{\\nu} < 0.12$ eV (95% c.l.), for example. Our results provide independent confirmation that the universe is spatially flat, conforms with general relativity, and is described remarkably well by the $\\Lambda$CDM model, while paving a promising path for neutrino physics with gravitational lensing from upcoming ground-based CMB surveys.\n\n", "2304.05044": "2023-04-11, **Characterizing quasi-steady states of fast neutrino-flavor conversion by stability and conservation laws**, Masamichi Zaizen et.al., [2304.05044v1](http://arxiv.org/abs/2304.05044v1)\n\n The question of what ingredients characterize the quasi-steady state of fast neutrino-flavor conversion (FFC) is one of the long-standing riddles in neutrino oscillation. Addressing this issue is necessary for accurate modeling of neutrino transport in core-collapse supernova and binary neutron star merger. Recent numerical simulations of FFC have shown, however, that the quasi-steady state is sensitively dependent on boundary conditions in space, and the physical reason for the dependence is not clear at present. In this study, we provide a physical interpretation of this issue based on arguments with stability and conservation laws. The stability can be determined by the disappearance of ELN(electron neutrino-lepton number)-XLN(heavy-leptonic one) angular crossings, and we also highlight two conserved quantities characterizing the quasi-steady state of FFC: (1) lepton number conservation along each neutrino trajectory and (2) conservation law associated with angular moments, depending on boundary conditions, for each flavor of neutrinos. We demonstrate that neutrino distributions in quasi-steady states can be determined in an analytic way regardless of boundary conditions, which are in good agreement with numerical simulations. This study represents a major step forward a unified picture determining asymptotic states of FFCs.\n\n", "2304.05043": "2023-04-11, **ZnO-based scintillating bolometers: New prospects to study double beta decay of $^{64}$Zn**, A. Armatol et.al., [2304.05043v1](http://arxiv.org/abs/2304.05043v1)\n\n The first detailed study on the performance of a ZnO-based cryogenic scintillating bolometer as a detector to search for rare processes in zinc isotopes was performed. A 7.2 g ZnO low-temperature detector, containing more than 80\\% of zinc in its mass, exhibits good energy resolution of baseline noise 1.0--2.7 keV FWHM at various working temperatures resulting in a low-energy threshold for the experiment, 2.0--6.0 keV. The light yield for $\\beta$/$\\gamma$ events was measured as 1.5(3) keV/MeV, while it varies for $\\alpha$ particles in the range of 0.2--3.0 keV/MeV. The detector demonstrate an effective identification of the $\\beta$/$\\gamma$ events from $\\alpha$ events using time-properties of only heat signals. %(namely, Rise time parameter). The radiopurity of the ZnO crystal was evaluated using the Inductively Coupled Plasma Mass Spectrometry, an ultra-low-background High Purity Ge $\\gamma$-spectrometer, and bolometric measurements. Only limits were set at the level of $\\mathcal{O}$(1--100) mBq/kg on activities of \\Nuc{K}{40}, \\Nuc{Cs}{137} and daughter nuclides from the U/Th natural decay chains. The total internal $\\alpha$-activity was calculated to be 22(2) mBq/kg, with a major contribution caused by 6(1) mBq/kg of \\Nuc{Th}{232} and 12(2) mBq/kg of \\Nuc{U}{234}. Limits on double beta decay (DBD) processes in \\Nuc{Zn}{64} and \\Nuc{Zn}{70} isotopes were set on the level of $\\mathcal{O}(10^{17}$--$10^{18})$ yr for various decay modes profiting from 271 h of acquired background data in the above-ground lab. This study shows a good potential for ZnO-based scintillating bolometers to search for DBD processes of Zn isotopes, especially in \\Nuc{Zn}{64}, with the most prominent spectral features at $\\sim$10--20 keV, like the two neutrino double electron capture. A 10 kg-scale experiment can reach the experimental sensitivity at the level of $\\mathcal{O}(10^{24})$ yr.\n\n", "2304.05017": "2023-04-11, **CKM and PMNS mixing matrix from $SO(2)$ flavor symmetry**, Guojun Xu et.al., [2304.05017v1](http://arxiv.org/abs/2304.05017v1)\n\n The relation between quark masses and CKM mixing is studied based on an approximate chiral $SO(2)\\_L\\times SO(2)\\_R$ flavor symmetry of quark mass matrix. In mass hierarchy limit, the mass ratio effect to CKM mixing is suppressed, which separates mass hierarchy and quark flavor mixing into two independent problems. We show that CKM mixing is dominated by two left-handed $SO(2)\\_L^{u,d}$ symmetry while mass hierarchy only provides slight corrections. The same mixing structure is generalized to lepton sector with extended Dirac neutrinos. The common flavor mixing provides a novel comprehension on the relation between quark CKM mixing and lepton PMNS mixing.\n\n", "2304.04689": "2023-04-10, **There and back again: Solar cycle effects in future measurements of low-energy atmospheric neutrinos**, Kevin J. Kelly et.al., [2304.04689v1](http://arxiv.org/abs/2304.04689v1)\n\n We study the impact of time-dependent solar cycles in the atmospheric neutrino rate at DUNE and Hyper-Kamiokande (HK), focusing in particular on the flux below 1 GeV. Including the effect of neutrino oscillations for the upward-going component that travels through the Earth, we find that across the solar cycle the amplitude of time variation is about $\\pm5\\%$ at DUNE, and $\\pm 1\\%$ at HK. At DUNE, the ratio of up/down-going events ranges from 0.45 to 0.85, while at HK, it ranges from 0.75 to 1.5. Over the 11-year solar cycle, we find that the estimated statistical significance for observing time modulation of atmospheric neutrinos is $4.8\\sigma$ for DUNE and $2.0\\sigma$ for HK. Flux measurements at both DUNE and HK will be important for understanding systematics in the low-energy atmospheric flux as well as for understanding the effect of oscillations in low-energy atmospheric neutrinos.\n\n", "2304.04629": "2023-04-10, **Leptogenesis and Dark Matter-Nucleon Scattering Cross Section in the SE6SSM**, Roman Nevzorov et.al., [2304.04629v1](http://arxiv.org/abs/2304.04629v1)\n\n The E6 inspired extension of the minimal supersymmetric (SUSY) standard model (MSSM) with an extra U(1)\\_N gauge symmetry, under which right-handed neutrinos have zero charge, involves exotic matter beyond the MSSM to ensure anomaly cancellation. We consider the variant of this extension (SE6SSM) in which the cold dark matter is composed of the lightest neutral exotic fermion and gravitino. The observed baryon asymmetry can be induced in this case via the decays of the lightest right-handed neutrino/sneutrino into exotic states even for relatively low reheating temperatures T\\_R < 10^{6-7} GeV. We argue that there are some regions of the SE6SSM parameter space, which are safe from all current constraints, and discuss the implications of this model for collider phenomenology.\n\n", "2304.04622": "2023-04-10, **PVEMC: Isolating the flavor-dependent EMC effect using parity-violating elastic scattering in SoLID**, Rakitha Beminiwattha et.al., [2304.04622v1](http://arxiv.org/abs/2304.04622v1)\n\n In order to better understand the EMC effect, we propose a clean and precise measurement of the flavor dependence of the EMC effect using parity-violating deep inelastic scattering on a $^{48}$Ca target. This measurement will provide an extremely sensitive test for flavor dependence in the modification of nuclear parton distribution functions (PDFs) for neutron-rich nuclei. A measurement of the flavor dependence will provide new and vital information and help to explain nucleon modification at the quark level. In addition to helping understand the origin of the EMC effect, a flavor-dependent nuclear pdf modification could significantly impact a range of processes, including neutrino-nucleus scattering, nuclear Drell-Yan processes, and e-A observables at the Electron-Ion Collider.   The parity-violating asymmetry APV from $^{48}$Ca using an 11 GeV beam at $80\\ \\mu A$ will be measured using the SoLID detector in its PVDIS configuration. In 68 days of data taking, we will reach $0.7-1.3\\%$ statistical precision for $0.2<x<0.7$ with $0.6-0.7\\% $ systematic uncertainties. The goal is to make the first direct measurement of the flavor dependence of the EMC effect. The precision of the measurement will allow for quantification of the flavor-dependent effects, greatly improving our ability to differentiate between models of the EMC effect and constraining the u- and d-quark contributions in neutron rich nuclei.\n\n", "2304.04520": "2023-04-10, **Bright X-ray pulsars as sources of MeV neutrinos in the sky**, Aman Asthana et.al., [2304.04520v1](http://arxiv.org/abs/2304.04520v1)\n\n High mass accretion rate onto strongly magnetised neutron stars results in the appearance of accretion columns supported by the radiation pressure and confined by the strong magnetic field of a star. At mass accretion rates above $\\sim 10^{19}\\,{\\rm g\\,s^{-1}}$, accretion columns are expected to be advective. Under such conditions, a noticeable part of the total energy release can be carried away by neutrinos of a MeV energy range. Relying on a simple model of the neutrino luminosity of accreting strongly magnetised neutron stars, we estimate the neutrino energy fluxes expected from six ULX pulsars known up to date and three brightest Be X-ray transits hosting magnetised neutron stars. Despite the large neutrino luminosity expected in ULX pulsars, the neutrino energy flux from the Be X-ray transients of our Galaxy, SMC and LMC is dominant. However, the neutrino flux from the brightest X-ray transients is estimated to be below the isotropic background by two orders of magnitude at least, which makes impossible direct registration of neutrino emission from accreting strongly magnetised neutron stars nowadays.\n\n", "2304.04513": "2023-04-10, **Chiral perturbative relation for neutrino masses in the type-I seesaw mechanism**, Masaki J. S. Yang et.al., [2304.04513v1](http://arxiv.org/abs/2304.04513v1)\n\n In this letter, we perform a perturbative analysis by the lightest singular value $m\\_{D1}$ of the Dirac mass matrix $m\\_{D}$ in the type-I seesaw mechanism. As a result, the mass $M\\_{1}$ of the lightest right-handed neutrino $\\nu\\_{R1}$ is expressed as $M\\_{1} = m\\_{D1}^{2}/ \\|(m\\_{\\nu})\\_{11}\\|$ by the mass matrix of the left-handed neutrinos $m\\_{\\nu}$ in the diagonal basis of $m\\_{D}$.   Since $m\\_{D1} \\sim 1$ MeV and $\\|(m\\_{\\nu})\\_{11}\\| \\sim 1$ meV lead to $M\\_{1} \\sim 10^{6}$ GeV, such a $\\nu\\_{R1}$ with a tiny Yukawa coupling $y\\_{\\nu 1} \\sim O(10^{-5})$ may indirectly influence observations of IceCube. On the other hand, the famous bound of the thermal leptogenesis $M\\_{1} \\gtrsim 10^{9}$ GeV that requires $m\\_{D1} \\gtrsim 30$ MeV seems to be difficult to reconcile with a simple unified theory.\n\n", "2304.04483": "2023-04-10, **Searching for Majorana Neutrinos at a Same-Sign Muon Collider**, Ruobing Jiang et.al., [2304.04483v1](http://arxiv.org/abs/2304.04483v1)\n\n Majorana properties of neutrinos have long been a focus in the pursuit of possible new physics beyond the standard model, which has motivated lots of dedicated theoretical and experimental studies. A future same-sign muon collider is an ideal platform to search for Majorana neutrinos through the Lepton Number Violation process. Specifically, this t-channel kind of process is less kinematically suppressed and has a good advantage in probing Majorana neutrinos at high mass regions up to 10 TeV. In this paper, we perform a detailed fast Monte Carlo simulation study through examining three different final states: 1) pure-leptonic state with electrons or muons, 2) semi-leptonic state, and 3) pure-hadronic state in the resolved or merged categories. Furthermore, we perform a full simulation study on the pure-leptonic final state to validate our fast simulation results.\n\n", "2304.04430": "2023-04-10, **Updated Constraints and Future Prospects on Majoron Dark Matter**, Kensuke Akita et.al., [2304.04430v1](http://arxiv.org/abs/2304.04430v1)\n\n Majorons are (pseudo-)Nambu-Goldstone bosons associated with lepton number symmetry breaking due to the Majorana mass term of neutrinos introduced in the seesaw mechanism. They are good dark matter candidates since their lifetime is suppressed by the lepton number breaking scale. We update constraints and discuss future prospects on majoron dark matter in the singlet majoron models based on neutrino, gamma-ray, and cosmic-ray telescopes in the mass region of MeV--10 TeV.\n\n"}, "dark matter": {"2304.05321": "2023-04-11, **Non-relativistic limit for Higher Spin Fields and Planar Schroedinger Equation in 3D**, Abhijeet Dutta et.al., [2304.05321v1](http://arxiv.org/abs/2304.05321v1)\n\n Higher spin (HS) fields naturally occur in string theory, they are considered as a candidate for dark matter and may also appear as a collective excitation in condensed matter systems. In some cases one may study the HS fields in the non-relativistic settings. Thus, it is of interest to know the non-relativistic limit of HS fields and how to find the Schroedinger equation as the dynamical equation in this limit. In this paper, we consider the non-relativistic limit of HS fields in Minkowskian spacetime in 3D. We work both at the level of equation of motion and action/Lagrangian density. We find the systematic procedures in both settings and show that they can be generalized to arbitrary HS fields.\n\n", "2304.05134": "2023-04-11, **Aether Scalar Tensor (AeST) theory: Quasistatic spherical solutions and their phenomenology**, Peter Verwayen et.al., [2304.05134v1](http://arxiv.org/abs/2304.05134v1)\n\n There have been many efforts in the last three decades to embed the empirical MOND program into a robust theoretical framework. While many such theories can explain the profile of galactic rotation curves, they usually cannot explain the evolution 15 the primordial fluctuations and the formation of large-scale-structures in the Universe. The Aether Scalar Tensor (AeST) theory seems to have overcome this difficulty, thereby providing the first compelling example of an extension of general relativity able to successfully challenge the particle dark matter hypothesis. Here we study the phenomenology of this theory in the quasistatic weak-field regime and specifically for the idealised case of spherical isolated sources.   We find the existence of three distinct gravitational regimes, that is, Newtonian, MOND and a third regime characterised by the presence of oscillations in the gravitational potential which do not exist in the traditional MOND paradigm. We identify the transition scales between these three regimes and discuss their dependence on the boundary conditions and other parameters in the theory. Aided by analytical and numerical solutions, we explore the dependence of these solutions on the theory parameters. Our results could help in searching for interesting observable phenomena at low redshift pertaining to galaxy dynamics as well as lensing observations, however, this may warrant proper N-body simulations that go beyond the idealised case of spherical isolated sources.\n\n", "2304.05100": "2023-04-11, **Investigating Dark Matter-Admixed Neutron Stars with NITR Equation of State in Light of PSR J0952-0607**, Pinku Routaray et.al., [2304.05100v1](http://arxiv.org/abs/2304.05100v1)\n\n The heaviest pulsar, PSR J0952-0607, with a mass of $M=2.35\\pm0.17 \\ M\\_\\odot$, has recently been discovered in the disk of the Milky Way Galaxy. In response to this discovery, a new RMF model, \"NITR\" has been developed. The NITR model's naturalness has been confirmed by assessing its validity for various finite nuclei and nuclear matter (NM) properties, including incompressibility, symmetry energy, and slope parameter values of 225.11, 31.69, and 43.86 MeV, respectively. These values satisfy the empirical/experimental limits currently available. The maximum mass and canonical radius of a neutron star (NS) calculated using the NITR model parameters are 2.35 $M\\_\\odot$ and 12.73 km, respectively, which fall within the range of PSR J0952-0607 and the latest NICER limit. This study aims to test the NITR model consistency by applying it to different systems and, consequently, calibrate its validity extensively. Subsequently, the NITR model equation of state (EOS) is employed to obtain the properties of a dark matter admixed neutron star using two approaches: non-gravitational (single fluid) and two-fluid. In the two-fluid model, the dark matter (DM) particles only interact with each other via gravity rather than the nucleons. In both cases, the equation of state becomes softer due to DM interactions, which reduces various macroscopic properties such as maximum mass, radius, tidal deformability, etc. Additionally, through the use of various observational data, efforts are made to constraint the quantity of DM within the NS.\n\n", "2304.04990": "2023-04-11, **Future Constraints on Dark Matter with Gravitationally Lensed Fast Radio Bursts Detected by BURSTT**, Simon C. -C. Ho et.al., [2304.04990v1](http://arxiv.org/abs/2304.04990v1)\n\n Understanding dark matter is one of the most urgent questions in modern physics. A very interesting candidate is primordial black holes (PBHs; Carr2016). For the mass ranges of $< 10^{-16} M\\_{\\odot}$ and $> 100 M\\_{\\odot}$, PBHs have been ruled out. However, they are still poorly constrained in the mass ranges of $10^{-16} - 100 M\\_{\\odot}$ (Belotsky et al. 2019). Fast radio bursts (FRBs) are millisecond flashes of radio light of unknown origin mostly from outside the Milky Way. Due to their short timescales, gravitationally lensed FRBs, which are yet to be detected, have been proposed as a useful probe for constraining the presence of PBHs in the mass window of $< 100M\\_{\\odot}$ (Mu\\~noz et al. 2016). Up to now, the most successful project in finding FRBs has been CHIME. Due to its large field of view (FoV), CHIME is detecting at least 600 FRBs since 2018. However, none of them is confirmed to be gravitationally lensed (Leung et al. 2022). Taiwan plans to build a new telescope, BURSTT dedicated to detecting FRBs. Its survey area will be 25 times greater than CHIME. BURSTT can localize all of these FRBs through very-long-baseline interferometry (VLBI). We estimate the probability to find gravitationally lensed FRBs, based on the scaled redshift distribution from the latest CHIME catalog and the lensing probability function from Mu\\~noz et al. (2016). BURSTT-2048 can detect ~ 24 lensed FRBs out of ~ 1,700 FRBs per annum. With BURSTT's ability to detect nanosecond FRBs, we can constrain PBHs to form a part of dark matter down to $10^{-4}M\\_{\\odot}$.\n\n", "2304.04785": "2023-04-10, **Field-level inference of cosmic shear with intrinsic alignments and baryons**, Natalia Porqueres et.al., [2304.04785v1](http://arxiv.org/abs/2304.04785v1)\n\n We construct a field-based Bayesian Hierarchical Model for cosmic shear that includes, for the first time, the important astrophysical systematics of intrinsic alignments and baryon feedback, in addition to a gravity model. We add to the BORG-WL framework the tidal alignment and tidal torquing model (TATT) for intrinsic alignments and compare them with the non-linear alignment (NLA) model. With synthetic data, we have shown that adding intrinsic alignments and sampling the TATT parameters does not reduce the constraining power of the method and the field-based approach lifts the weak lensing degeneracy. We add baryon effects at the field level using the enthalpy gradient descent (EGD) model. This model displaces the dark matter particles without knowing whether they belong to a halo and allows for self-calibration of the model parameters, which are inferred from the data. We have also illustrated the effects of model misspecification for the baryons. The resulting model now contains the most important physical effects and is suitable for application to data.\n\n", "2304.04735": "2023-04-10, **Detecting Stochastic Wave Dark Matter with Fermi-LAT $γ$-ray Pulsar Timing Array**, Hoang Nhan Luu et.al., [2304.04735v1](http://arxiv.org/abs/2304.04735v1)\n\n Wave dark matter (DM) represents a class of the most representative DM candidates. Due to its periodic perturbation to spacetime, the wave DM can be detected with a galactic interferometer - pulsar timing array (PTA). We perform in this Letter a first analysis of applying the $\\gamma$-ray PTA to detect the wave DM, with the data of Fermi Large Area Telescope (Fermi-LAT). Despite the limitation in statistics, the $\\gamma$-PTA demonstrates a promising sensitivity potential for a mass $\\sim 10^{-23}-10^{-22}$ eV. We show that the upper limits not far from those of the dedicated radio-PTA projects can be achieved. Particularly, we have fulfilled an analysis to cross-correlate the pulsar data, which has been essentially missing so far in real data analysis but is known to be crucial for identifying the nature of potential signals, with the Fermi-LAT data of two pulsars.\n\n", "2304.04721": "2023-04-10, **A Solar Investigation of Multicomponent Dark Matter**, Amit Dutta Banik et.al., [2304.04721v1](http://arxiv.org/abs/2304.04721v1)\n\n If multiple thermal weakly interacting massive particle (WIMP) dark matter candidates exist, then their capture and annihilation dynamics inside a massive stars such as Sun could change from conventional method of study. With a simple correction to time evolution of dark matter (DM) number abundance inside the Sun for multiple dark matter candidates, significant changes in DM annihilation flux depending on annihilation, direct detection cross-section, internal conversion and their contribution to relic abundance are reported in present work.\n\n", "2304.04534": "2023-04-10, **MSSM-inflation revisited: Towards a coherent description of high-energy physics and cosmology**, Gilles Weymann-Despres et.al., [2304.04534v1](http://arxiv.org/abs/2304.04534v1)\n\n The aim of this paper is to highlight the challenges and potential gains surrounding a coherent description of physics from the high-energy scales of inflation down to the lower energy scales probed in particle-physics experiments. As an example, we revisit the way inflation can be realised within an effective Minimal Supersymmetric Standard Model (eMSSM), in which the $LLe$ and $udd$ flat directions are lifted by the combined effect of soft-supersymmetric-breaking masses already present in the MSSM, together with the addition of effective non-renormalizable operators. We clarify some features of the model and address the question of the one-loop Renormalization Group improvement of the inflationary potential, discussing its impact on the fine-tuning of the model. We also compare the parameter space that is compatible with current observations (in particular the amplitude, $A\\_{\\scriptscriptstyle{\\mathrm{S}}}$, and the spectral index, $n\\_{\\scriptscriptstyle{\\mathrm{S}}}$, of the primordial cosmological fluctuations) at tree level and at one loop, and discuss the role of reheating. Finally we perform combined fits of particle and cosmological observables (mainly $A\\_{\\scriptscriptstyle{\\mathrm{S}}}$, $n\\_{\\scriptscriptstyle{\\mathrm{S}}}$, the Higgs mass, and the cold-dark-matter energy density) with the one-loop inflationary potential applied to some examples of dark-matter annihilation channels (Higgs-funnel, Higgsinos and A-funnel), and discuss the status of the ensuing MSSM spectra with respect to the LHC searches.\n\n", "2304.04469": "2023-04-10, **Variation of the quadrupole hyperfine structure and nuclear radius due to an interaction with scalar and axion dark matter**, V. V. Flambaum et.al., [2304.04469v1](http://arxiv.org/abs/2304.04469v1)\n\n Atomic spectroscopy is used to search for the space-time variation of fundamental constants which may be due to an interaction with scalar and pseudo-scalar (axion) dark matter. In this letter, we study the effects which are produced by the variation of the nuclear radius and electric quadrupole moment. The sensitivity of the electric quadrupole hyperfine structure to both the variation of the quark mass and the effects of dark matter exceeds that of the magnetic hyperfine structure by 1-2 orders of magnitude. Therefore, the measurement of the variation of the ratio of the electric quadrupole and magnetic dipole hyperfine constants is proposed. The sensitivity of the optical clock transitions in the Yb$^+$ ion to the variation of the nuclear radius allows us to extract, from experimental data, limits on the variation of the hadron and quark masses, the QCD parameter $\\theta$ and the interaction with axion and scalar dark matter.\n\n", "2304.04463": "2023-04-10, **Self-interactions of ULDM to the rescue?**, Bihag Dave et.al., [2304.04463v1](http://arxiv.org/abs/2304.04463v1)\n\n One of the most important questions in cosmology is concerning the fundamental nature of dark matter (DM). DM could consist of spinless particles of very small mass i.e. $m \\sim 10^{-22}\\ \\text{eV}$. This kind of ultralight dark matter (ULDM) would form cored density profiles (called \"solitons\") at the centre of galaxies. In this context, recently it has been argued that (a) there exists a power law relation between the mass of the soliton and mass of the surrounding halo called the Soliton-Halo (SH) relation, and, (b) the requirement of satisfying observed galactic rotation curves as well as SH relations is so stringent that ULDM is disfavoured from comprising $100\\%$ of the total cosmological dark matter. In this work, we revisit these constraints for ULDM particles with non-negligible quartic self-interactions. Using a recently obtained soliton-halo relation which takes into account the effect of self-interactions, we present evidence which suggests that, for $m = 10^{-22}\\ \\text{eV}$, the requirement of satisfying both galactic rotation curves as well as SH relations can be fulfilled with repulsive self-coupling $\\lambda \\sim \\mathcal{O}(10^{-90})$.\n\n", "2304.04401": "2023-04-10, **Skipper-CCD Sensors for the Oscura Experiment: Requirements and Preliminary Tests**, Brenda A. Cervantes-Vergara et.al., [2304.04401v1](http://arxiv.org/abs/2304.04401v1)\n\n Oscura is a proposed multi-kg skipper-CCD experiment designed for a dark matter (DM) direct detection search that will reach unprecedented sensitivity to sub-GeV DM-electron interactions with its 10 kg detector array. Oscura is planning to operate at SNOLAB with 2070 m overburden, and aims to reach a background goal of less than one event in each electron bin in the 2-10 electron ionization-signal region for the full 30 kg-year exposure, with a radiation background rate of 0.01 dru. In order to achieve this goal, Oscura must address each potential source of background events, including instrumental backgrounds. In this work, we discuss the main instrumental background sources and the strategy to control them, establishing a set of constraints on the sensors' performance parameters. We present results from the tests of the first fabricated Oscura prototype sensors, evaluate their performance in the context of the established constraints and estimate the Oscura instrumental background based on these results.\n\n", "2304.04378": "2023-04-10, **Josephson Parametric Amplifier in Axion Experiments**, Jinmyeong Kim et.al., [2304.04378v1](http://arxiv.org/abs/2304.04378v1)\n\n The axion is a hypothetical particle, a promising candidate for dark matter, and a solution to the strong CP problem. Axion haloscope search experiments deal with a signal power comparable to noise uncertainty at millikelvin temperature. We use a flux-driven Josephson parametric amplifier (JPA) with the aim of approaching a noise level near the theoretically allowed limit of half quanta. In our measurements to characterize the JPA we have found the added noise to the system with a JPA as the first-stage amplifier to be lower than 110 mK at the frequencies from 0.938 GHz to 0.963 GHz.\n\n"}, "supernova": {"2304.05013": "2023-04-11, **Nitrogen pollution by metal enriched supermassive stars**, Chris Nagele et.al., [2304.05013v1](http://arxiv.org/abs/2304.05013v1)\n\n GN-z11 is an unusually luminous high redshift galaxy which was recently observed to have strong nitrogen lines while at the same time lacking traditional signatures of AGN activity. These observations have been interpreted as a super-solar nitrogen abundance which is challenging to explain with standard stellar evolution and supernovae enrichment. We present simulations of four models of metal enriched supermassive stars after the zero age main sequence which produce super-solar nitrogen consistent with the observations of GN-z11. We then show that the most massive model ends its life in a violent explosion which results in even greater nitrogen pollution.\n\n", "2304.04973": "2023-04-11, **CM Mic and other ER UMa stars showing standstills**, Taichi Kato et.al., [2304.04973v1](http://arxiv.org/abs/2304.04973v1)\n\n We analyzed All-Sky Automated Survey for Supernovae (ASAS-SN), Asteroid Terrestrial-impact Last Alert System (ATLAS) and Transiting Exoplanet Survey Satellite (TESS) observations of CM Mic and found that this object belongs to a small group of ER UMa stars showing standstills. In addition to typical ER UMa-type cycles, the object showed standstills between 2017 and 2019 July, and in 2022. The supercycles varied between 49 and 83 d. In 2015, the object showed outbursts with a cycle length of ~35 d. An analysis of TESS observations during the 2020 July outburst detected superhumps with a mean period of 0.080251(6) d (value after the full development of superhumps). We also studied other ER UMa stars showing standstills mainly using Zwicky Transient Facility (ZTF) data. DDE 48, MGAB-V728 and ZTF18abmpkbj mostly showed ER UMa-type supercycles but showed one or two standstills. MGAB-V3488 was mostly in ER UMa states with short (~25 d) supercycles in 2020-2022 similar to RZ LMi. This object also showed long standstills. PS1-3PI J181732.65+101954.6 showed ER UMa-type supercycles up to 2020 May and entered a long standstill. ZTF18abncpgs showed standstills most of the time, but also showed ER UMa-type supercycles occasionally between standstills. ZTF19aarsljl is a likely member of this group. MGAB-V284 showed a pattern similar to ER UMa stars showing standstills but with a longer time-scale of normal outbursts. This object seems to be an ER UMa star with standstills above the period gap. None of the objects we studied showed a superoutburst arising from a long standstill, as recorded in NY Ser in 2018, although the 2019 June-July superoutburst of PS1-3PI J181732.65+101954.6 might have been an exception.\n\n"}}