{"neutrino": {"2401.09999": "2024-01-18, **Toward a theory of neutrino mass and mixing**, Alexei Yu. Smirnov et.al., [2401.09999v1](http://arxiv.org/abs/2401.09999v1)\n\n Among numerous theoretical ideas, approaches, mechanisms, models there are probably few elements which will eventually enter the true theory of neutrino masses and mixing. The task is to identify them. Still something conceptually important can be missed. The problems of construction of the theory are outlined. Perspectives and possible future developments are discussed.\n\n", "2401.09920": "2024-01-18, **On the determination of the interaction time of GeV neutrinos in large argon gas TPCs**, A. Saá-Hernández et.al., [2401.09920v1](http://arxiv.org/abs/2401.09920v1)\n\n Next-generation megawatt-scale neutrino beams open the way to studying neutrino-nucleus scattering resorting, for the first time, to gaseous targets. This could lead to deeper knowledge of neutrino cross sections in the energy region between hundreds of MeV and a few GeV, of interest for the upcoming generation of long-baseline neutrino oscillation experiments. The challenge is, therefore, to accurately track and (especially) time the particles produced in neutrino interactions in large and seamless volumes down to few-MeV energies. We propose to accomplish this through an optically-read time projection chamber (TPC) filled with high-pressure argon and equipped with both tracking and timing functions. In this work, we present a detailed study of the time-tagging capabilities of such a device, based on end-to-end optical simulations that include the effect of photon propagation, photosensor response, dark-count rate and pulse reconstruction. We show that the neutrino interaction time could be reconstructed from the primary-scintillation signal with a precision in the range 1--2.5~ns ($\\sigma$) for point-like deposits with energies down to 5~MeV, and well below 1~ns for minimum-ionizing particle tracks. A discussion on previous limitations towards such a detection technology, and how they can be realistically overcome in the near future thanks to recent developments in the field, is presented (particularly the strong scintillation yields recently reported for Ar/CF$\\_4$ mixtures). The performance presented in our analysis seems to be well within reach of next-generation neutrino-oscillation experiments through the instrumentation of the proposed TPC with conventional reflective materials and a SiPM carpet behind a transparent cathode.\n\n", "2401.09837": "2024-01-18, **Prototyping a High Purity Germanium cryogenic veto system for a bolometric detection experiment**, Chloé Goupy et.al., [2401.09837v1](http://arxiv.org/abs/2401.09837v1)\n\n The use of High Purity Germanium detectors operated in ionization mode at cryogenic temperatures is investigated as an external background mitigation solution for bolometers used in rare-event search experiments. A simple experimental setup with very partial coverage, running a 52-g $\\mathrm{Li\\_2WO\\_4}$ bolometer sandwiched in-between two 2-cm thick High Purity Germanium cylindrical detectors in a dry cryostat, shows promising rejection to environmental gammas and atmospheric muons backgrounds. The acquired data are used together with a Monte Carlo simulation of the setup to extract the main contributions to the external backgrounds expected in an above ground experiment, such as e.g.~current and future experimental efforts targeting the detection of coherent elastic neutrino-nucleus scattering at reactor facilities. Based on all these results, a $\\mathrm{4\\pi}$ coverage similar veto system achieving a $\\mathcal{O}$(10 keV) energy threshold is expected to achieve a $\\mathrm{\\gtrsim}$ 70 \\% and a $\\mathrm{\\gtrsim}$ 97 \\% rejection power for gamma-like and muon-like events, respectively.\n\n"}, "dark matter": {"2401.10202": "2024-01-18, **SPARC galaxies prefer Dark Matter over MOND**, Mariia Khelashvili et.al., [2401.10202v1](http://arxiv.org/abs/2401.10202v1)\n\n We currently have two different hypotheses to solve the missing mass problem: dark matter (DM) and modified Newtonian dynamics (MOND). In this work, we use Bayesian inference applied to the Spitzer Photometry and Accurate Rotation Curves (SPARC) galaxies' rotation curves to see which hypothesis fares better. For this, we represent DM by two widely used cusped and cored profiles, Navarro-Frenk-White (NFW) and Burkert. We parameterize MOND by a widely used radial-acceleration relation (RAR). Our results show a preference for the cored DM profile with high Bayes factors in a substantial fraction of galaxies. Interestingly enough, MOND is typically preferred by those galaxies which lack precise rotation curve data. Our study also confirms that the choice of prior has a significant impact on the credible interval of the characteristic MOND acceleration. Overall, our analysis comes out in favor of dark matter.\n\n", "2401.10116": "2024-01-18, **Interpreting deviations between AR-VTG and GR**, Roberto Dale et.al., [2401.10116v1](http://arxiv.org/abs/2401.10116v1)\n\n The Cosmic microwave background (CMB) anisotropies predicted by two cosmological models are compared, one of them is the standard model of general relativity with cold dark matter and cosmological constant, whereas the second model is based on a consistent vector-tensor theory of gravitation explaining solar system and cosmological observations. It is proved that the resulting differences -- between the anisotropies of both models -- are due to the so-called late integrated Sachs Wolfe effect and, consequently, cross correlations between maps of CMB temperatures and tracers of the dark matter distribution could be used in future to select one of the above models. The role of reionization is analysed in detail.\n\n", "2401.10112": "2024-01-18, **Recent $\\boldsymbol{B^+ \\!\\to K^+ν\\barν}$ Excess and Muon $\\boldsymbol{g - 2}$ Illuminating Light Dark Sector with Higgs Portal**, Shu-Yu Ho et.al., [2401.10112v1](http://arxiv.org/abs/2401.10112v1)\n\n The Belle II collaboration recently announced that they observed the $\\boldsymbol{B^+ \\!\\to K^+\\nu\\bar{\\nu}}$ decay process for the first time. This dineutrino mode of $\\boldsymbol{B^+ \\!\\to K^+\\nu\\bar{\\nu}}$ has been theoretically identified as a very clean channel. However, their result encounters a $2.8{}^{}\\sigma$ deviation from the Standard Model (SM) calculation. On the other hand, last year, Fermilab released new data on muon $g-2$ away from the SM expectation with $5{}^{}\\sigma$. In this letter, we study the simplest UV-complete $\\text{U}(1)\\_{\\textsf{L}\\_\\mu - \\textsf{L}\\_\\tau}^{}$-charged complex scalar Dark Matter (DM) model. Thanks to the existence of light dark Higgs boson and light dark photon, we can explain the observed relic density of DM and resolve the results reported by both Belle II and Fermilab experiments simultaneously. As a byproduct, the Hubble tension is alleviated by taking $\\Delta N\\_\\textsf{eff}^{} \\simeq 0.3$ induced by the light dark photon.\n\n", "2401.10024": "2024-01-18, **Cluster abundance cosmology: Towards including Super-Sample Covariance in the unbinned likelihood**, Constantin Payerne et.al., [2401.10024v1](http://arxiv.org/abs/2401.10024v1)\n\n The measure of the abundance of galaxy clusters in the Universe is a sensitive probe of cosmology, sensitive to both the expansion history and the growth of structure. Density fluctuations across the finite survey volume induce noise to this measure, often referred to as Super-Sample Covariance (SSC). In the past for unbinned cluster analysis such noise has not been included in the cluster likelihood. In this paper, we present a derivation of the unbinned likelihood accounting for Super-Sample Covariance by using a Gauss-Poisson Compound (GPC) likelihood. We show that deriving the unbinned likelihood with SSC from the expansion of the GPC formalism to the second order in density perturbation is not sufficient, preventing us from using analytical methods already explored in the literature. In order to solve this issue, we still used the GPC model to derive an alternative \"hybrid\" likelihood, by using standard redshift bins. Using simulated dark matter halo catalog obtained by the PINOCCHIO algorithm, we found that the hybrid likelihood, accounting for both Poisson noise and SSC, increases the dispersion of the parameter posteriors by 25 per cent using 2,500 clusters, compared to the standard Poisson likelihood.\n\n"}, "supernova": {"2401.09729": "2024-01-18, **Initial state of the recombining plasma in supernova remnant W 28**, Rui Himono et.al., [2401.09729v1](http://arxiv.org/abs/2401.09729v1)\n\n We investigate an SNR W28 with the Suzaku archive data and report the results of spatial resolved analyses. We carry out spectral analysis using a recombining plasma (RP) model with an element-dependent initial ionization temperature, and obtain the ionization temperatures to be $\\sim0.5$~keV for Ne, $\\sim0.7$~keV for Mg, $\\sim1.0$~keV for Si, $\\sim1.2$~keV for S, $\\sim1.4$~keV for Ar, $\\sim1.7$~keV for Ca, and $\\sim0.7$~keV for Fe in the RP-initial phase. In addition to northeast regions where RP have been reported, we find that the ionization temperature in the southeast and southwest regions show a similar trend to the central region, in the RP-initial phase. Furthermore, the elapsed time from the RP-initial phase to present is shorter, $\\sim300$~yr in the central region and longer, $\\sim10^3$-$10^4$~yr in the outside regions. Our results cannot be explained by simple scenarios of thermal conduction due to molecular clouds or adiabatic cooling (rarefaction), and indicate that more complex mechanism or other scenarios are required. Also, we estimate the ejecta mass $\\gtrsim14M\\_{\\odot}$, which indicates a SNR derived a massive star.\n\n"}}