{"neutrino": {"2504.17758": "2025-04-24, **First study of neutrino angle reconstruction using quasielastic-like interactions in MicroBooNE**, MicroBooNE collaboration et.al., [2504.17758v1](http://arxiv.org/abs/2504.17758v1)\n\n We investigate the expected precision of the reconstructed neutrino direction using a {\\nu}{\\mu}-argon quasielastic-like event topology with one muon and one proton in the final state and the reconstruction capabilities of the MicroBooNE liquid argon time projection chamber. This direction is of importance in the context of DUNE sub-GeV atmospheric oscillation studies. MicroBooNE allows for a data-driven quantification of this resolution by investigating the deviation of the reconstructed muon-proton system orientation with respect to the well-known direction of neutrinos originating from the Booster Neutrino Beam with an exposure of 1.3 x 1021 protons on target. Using simulation studies, we derive the expected sub-GeV DUNE atmospheric-neutrino reconstructed simulated spectrum by developing a reweighting scheme as a function of the true neutrino energy. We further report flux-integrated single- and double-differential cross section measurements of charged-current {\\nu}{\\mu} quasielastic-like scattering on argon as a function of the muon-proton system angle using the full MicroBooNE data sets. We also demonstrate the sensitivity of these results to nuclear effects and final state hadronic reinteraction modeling.\n\n", "2504.17373": "2025-04-24, **The lepton-number-violating pion decay and the type-I seesaw mechanism in chiral perturbation theory**, You-Cai Chen et.al., [2504.17373v1](http://arxiv.org/abs/2504.17373v1)\n\n We investigate the process of lepton-number-violating pion decay, which dominates the nuclear neutrinoless double beta decay induced by the short-range operator, within the type-\\uppercase\\expandafter{\\romannumeral1} seesaw mechanism. The type-\\uppercase\\expandafter{\\romannumeral1} seesaw mechanism gives rise to the Dirac and Majorana mass terms of neutrinos by introducing the gauge-singlet right-handed neutrinos, which are usually called sterile neutrinos. Using chiral perturbation theory, the transition amplitudes in the case of the light and heavy sterile neutrinos are calculated up to $\\mathcal{O}(Q^2/\\Lambda^2\\_\\chi)$ respectively, where $Q$ is the typical low-energy scale in this process and $\\Lambda\\_\\chi$ the chiral symmetry breaking scale. We then adopt a naive interpolation formula of mass dependence to obtain the amplitude in the full mass range and briefly discuss its validity.\n\n"}, "dark matter": {"2504.17750": "2025-04-24, **Pure Chromo-Natural Inflation: Signatures of Particle Production from Weak to Strong Backreaction**, Ema Dimastrogiovanni et.al., [2504.17750v1](http://arxiv.org/abs/2504.17750v1)\n\n We consider, in the context of axion-inflation, the \\textit{Pure Natural Inflation} (PNI) model coupled with an SU(2) gauge sector via a Chern-Simons term. As the axion rolls down its potential, it dissipates energy in the gauge sector thus sourcing fluctuations of scalar and tensor degrees of freedom therein. Gauge field fluctuations will, in turn, feed primordial gravitational waves as well as curvature perturbations. Remarkably, we can use upcoming cosmological probes to test this mechanism across a vast range of scales, from the CMB to laser interferometers. Due to their flat plateau at large field values, we find that PNI potentials fare better vis-\\'{a}-vis CMB observations than the conventional sinusoidal potential of chromo-natural inflation (CNI). We show that, even when the dynamics begin in the weak backreaction regime, the rolling of the axion leads to a build-up of the gauge-quanta production, invariably triggering the strong backreaction of the gauge sector tensors on the background dynamics. This transition results in the copious production of both scalar and tensor perturbations, which we study in detail. The gravitational wave signatures include a rich peak structure with a characteristic scale-dependent chirality, a compelling target for future gravitational wave detectors. Additionally, the peak in scalar perturbations may lead to the formation of primordial black holes, potentially accounting for a significant fraction of the observed dark matter abundance.\n\n", "2504.17386": "2025-04-24, **Free Cosmic Density Bispectrum on Small Scales**, Ricardo Waibel et.al., [2504.17386v1](http://arxiv.org/abs/2504.17386v1)\n\n We study the asymptotic behaviour of the free, cold-dark matter density fluctuation bispectrum in the limit of small scales. From an initially Gaussian random field, we draw phase-space positions of test particles which then propagate along Zel'dovich trajectories. A suitable expansion of the initial momentum auto-correlations of these particles leads to an asymptotic series whose lower-order power-law exponents we calculate. The dominant contribution has an exponent of $-11/2$. For triangle configurations with zero surface area, this exponent is even enhanced to $-9/2$. These power laws can only be revealed by a non-perturbative calculation with respect to the initial power spectrum. They are valid for a general class of initial power spectra with a cut-off function, required to enforce convergence of its moments. We then confirm our analytic results numerically. Finally, we use this asymptotic behaviour to investigate the shape dependence of the bispectrum in the small-scale limit, and to show how different shapes grow over cosmic time. These confirm the usual model of gravitational collapse within the Zel'dovich picture.\n\n", "2504.17293": "2025-04-24, **Effective field theory of coupled dark energy and dark matter**, Katsuki Aoki et.al., [2504.17293v1](http://arxiv.org/abs/2504.17293v1)\n\n We formulate an effective field theory (EFT) of coupled dark energy (DE) and dark matter (DM) interacting through energy and momentum transfers. In the DE sector, we exploit the EFT of vector-tensor theories with the presence of a preferred time direction on the cosmological background. This prescription allows one to accommodate shift-symmetric and non-shift-symmetric scalar-tensor theories by taking a particular weak coupling limit, with and without consistency conditions respectively. We deal with the DM sector as a non-relativistic perfect fluid, which can be described by a system of three scalar fields. By choosing a unitary gauge in which the perturbations in the DE and DM sectors are eaten by the metric, we incorporate the leading-order operators that characterize the energy and momentum transfers besides those present in the conventional EFT of vector-tensor and scalar-tensor theories and the non-relativistic perfect fluid. We express the second-order action of scalar perturbations in real space in terms of time- and scale-dependent dimensionless EFT parameters and derive the linear perturbation equations of motion by taking into account additional matter (baryons, radiation). In the small-scale limit, we obtain conditions for the absence of both ghosts and Laplacian instabilities and discuss how they are affected by the DE-DM interactions. We also compute the effective DM gravitational coupling $G\\_{\\rm eff}$ by using a quasi-static approximation for perturbations deep inside the DE sound horizon and show that the existence of momentum and energy transfers allow a possibility to realize $G\\_{\\rm eff}$ smaller than in the uncoupled case at low redshift.\n\n", "2504.17209": "2025-04-24, **Characterisation of Hamamatsu R11065-20 PMTs for use in the SABRE South NaI(Tl) Crystal Detectors**, O. Stanley et.al., [2504.17209v1](http://arxiv.org/abs/2504.17209v1)\n\n The SABRE Experiment is a direct detection dark matter experiment using a target composed of multiple NaI(Tl) crystals. The experiment aims to be an independent check of the DAMA/LIBRA results with a detector in the Northern (Laboratori Nazionali Del Gran Sasso, LNGS) and Southern (Stawell Underground Physics Laboratory, SUPL) hemispheres. The SABRE South photomultiplier tubes (PMTs) will be used near the low energy noise threshold and require a detailed calibration of their performance and contributions to the background in the NaI(Tl) dark matter search, prior to installation. We present the development of the pre-calibration procedures for the R11065-20 Hamamatsu PMTs. These PMTs are directly coupled to the NaI(Tl) crystals within the SABRE South experiment. In this paper we present methodologies to characterise the gain, dark rate, and timing properties of the PMTs. We develop a method for in-situ calibration without a light injection source. Additionally we explore the application of machine learning techniques using a Boosted Decision Tree (BDT) trained on the response of single PMTs to understand the information available for background rejection. Finally, we briefly present the simulation tool used to generate digitised PMT data from optical Monte Carlo simulations.\n\n"}, "supernova": {"2504.17638": "2025-04-24, **Testing Quintessence Axion Dark Energy with Recent Cosmological Results**, Weikang Lin et.al., [2504.17638v1](http://arxiv.org/abs/2504.17638v1)\n\n We investigate a quintessence axion model for dynamical dark energy, motivated in part by recent results from the Baryon Acoustic Oscillation (BAO) measurements of the Dark Energy Spectroscopic Instrument (DESI) and the Cosmic Microwave Background (CMB) observations from the Atacama Cosmology Telescope (ACT). By carefully treating the initial conditions and parameter sampling, we identify a preferred parameter space featuring a sub-Planckian axion decay constant and a relatively large axion mass, which naturally avoids the quality problem and remains consistent with the perturbative string conjecture. Our parameter scan also uncovers a trans-Planckian regime of theoretical interest, which is only mildly disfavored by observations. The results remain robust when DESI BAO data are combined with CMB and supernova observations. Finally, we discuss the possible connection between this model and the recently reported non-zero rotation of the CMB linear polarization angle, emphasizing the broader cosmological implications and the promising prospects for testing this scenario. We show that an $\\mathcal{O}(1)$ electromagnetic anomaly coefficient is preferred by the strongest constraint, which is in full agreement with the minimal quintessence axion model.\n\n", "2504.17516": "2025-04-24, **EP250108a/SN 2025kg: A Broad-Line Type Ic Supernova Associated with a Fast X-ray Transient Showing Evidence of Extended CSM Interaction**, Gokul P. Srinivasaragavan et.al., [2504.17516v1](http://arxiv.org/abs/2504.17516v1)\n\n We present optical, radio, and X-ray observations of EP250108a/SN 2025kg, a broad-line Type Ic supernova (SN Ic-BL) accompanying an Einstein Probe (EP) fast X-ray transient (FXT) at $z=0.176$. EP250108a/SN 2025kg possesses a double-peaked optical light curve and its spectrum transitions from a blue underlying continuum to a typical SN Ic-BL spectrum over time. We fit a radioactive decay model to the second peak of the optical light curve and find SN parameters that are consistent with the SNe Ic-BL population, while its X-ray and radio properties are consistent with those of low-luminosity GRB (LLGRB) 060218/SN 2006aj. We explore three scenarios to understand the system's multi-wavelength emission -- (a) SN ejecta interacting with an extended circumstellar medium (CSM), (b) the shocked cocoon of a collapsar-driven jet choked in its stellar envelope, and (c) the shocked cocoon of a collapsar-driven jet choked in an extended CSM. All three models can explain the optical light curve and are also consistent with the radio and X-ray observations. We favor models (a) and (c) because they self-consistently explain both the X-ray prompt emission and first optical peak, but we do not rule out model (b). From the properties of the first peak in models (a) and (c), we find evidence that EP250108a/SN 2025kg interacts with an extended CSM, and infer an envelope mass $M\\_{\\rm e} \\sim 0.1\\,\\rm M\\_\\odot$ and radius $R\\_{\\rm e} \\sim 4 \\times 10^{13}$ cm. EP250108a/SN 2025kg's multi-wavelength properties make it a close analog to LLGRB 060218/SN 2006aj, and highlight the power of early follow-up observations in mapping the environments of massive stars prior to core collapse.\n\n", "2504.17506": "2025-04-24, **Population III Supernovae as a dust factory I --- molecule formation and mixing/fallback in ejecta**, Gen Chiaki et.al., [2504.17506v1](http://arxiv.org/abs/2504.17506v1)\n\n Recent observations have revealed the spectral feature of carbonaceous grains even in a very distant galaxy. We develop a state-of-the-art dust synthesis code by self-consistently solving molecule and dust formation in supernova (SN) ejecta that contain various elements in different layers. With a progenitor mass 25 Msun and explosion energy 10^{52} erg, we run the following four test calculations to investigate the impact of input physics. (i) With molecule formation solved, our SN model produces 8.45x10^{-2} Msun carbonaceous grains. (ii) If all available C and Si were initially depleted into CO and SiO molecules, respectively, the C grain mass could be underestimated by ~40%. In these two models producing 0.07 Msun 56Ni without mixing fallback, a large amount of silicates (0.260 Msun) created in O-rich layers are also ejected and likely to hide the spectral feature of carbonaceous grains. We then consider mixing-fallback that can reproduce the observed elemental abundance ratios of C-normal and C-enhanced extremely metal-poor stars in the Milky Way. (iii) In the former, the mass ratio of carbonaceous to silicate grains is still small (~0.3). However, (iv) in the latter (known as a ``faint SN'), while the C grain mass is unchanged (6.78x10^{-2} Msun), the silicate mass is reduced (9.98x10^{-3} Msun). Therefore, we conclude that faint SNe can be a significant carbonaceous dust factory in the early Universe.\n\n", "2504.17500": "2025-04-24, **New insights on supernova remnants and HII regions in M82**, D. Williams-Baldwin et.al., [2504.17500v1](http://arxiv.org/abs/2504.17500v1)\n\n The nearby (d=3.6 Mpc) starburst galaxy M82 has been studied for several decades by very long baseline interferometry (VLBI) networks such as e-MERLIN and the European VLBI Network (EVN). The numerous supernova remnants (SNRs), HII regions and other exotic transients make it a perfect laboratory for studying stellar evolution and the interstellar medium (ISM). Its proximity provides a linear resolution of 17 pc/arcsec, enabling decadal-time-scale variability and morphology studies of the tens of compact radio sources. In this proceedings, we describe new techniques developed in the last ten years that provide deeper, more robust imaging, enable in-band spectral index mapping, and allow wider fields of view to be imaged to find new radio sources.\n\n"}}