{"neutrino": {"2511.15702": "2025-11-19, **Terrestrial Matter Effects on Reactor Antineutrino Oscillations: Constant vs. Fluctuated Density Profiles**, Yu-Feng Li et.al., [2511.15702v1](http://arxiv.org/abs/2511.15702v1)\n\n The JUNO Collaboration has recently released its first reactor antineutrino oscillation result, achieving unprecedented precision in the measurement of $Δm^2\\_{21}$ and $\\sin^2θ\\_{12}$. We emphasize that the accurate determination and modeling of the terrestrial matter density profile are fundamental for extracting the oscillation parameters and probing the neutrino mass ordering. This paper presents a realistic piecewise-constant model for the shallow crustal density profile along the baselines from Taishan and Yangjiang to the experimental hall, based on geological and petrophysical information. The uncertainty in the density profiles arises from variations in the density and length of each segment, both of which are conservatively estimated to be 10\\%. A careful comparison of constant and fluctuated density profiles is provided and the implications for the precision measurement of oscillation parameters are discussed. Finally, we also discuss the possibility of tomography of the shallow Earth's crust in future reactor neutrino experiments.\n\n", "2511.15654": "2025-11-19, **Trimaximal Mixing Patterns Meet the First JUNO Result**, Di Zhang et.al., [2511.15654v1](http://arxiv.org/abs/2511.15654v1)\n\n The JUNO experiment has recently released its first measurement results based on 59.1 days of data, achieving unprecedented precision in measuring the lepton mixing angle $θ\\_{12}$. This significant improvement places stringent constraints on certain neutrino mass models and flavor mixing patterns. In this work, we examine the impact of the latest JUNO results on the two trimaximal (i.e., TM1 and TM2) mixing patterns. They are two well-motivated variants of the tri-bimaximal mixing pattern and predict specific correlations between $θ\\_{12}$ and $θ\\_{13}$, which lie outside the experimentally allowed $1σ$ and $3σ$ regions, respectively, after taking into account JUNO's results. Then, attempting to reconcile these TM mixing patterns with the latest experimental data, we further investigate the renormalization group (RG) running effects on them in the both Majorana and Dirac neutrino cases. Our analytical and numerical results show that RG corrections can bring the two TM mixing patterns into excellent agreement with the latest JUNO data if neutrino masses are quasi-degenerate. However, the Majorana case faces severe constraints from neutrinoless double beta decay limits, and particularly, the TM2 mixing pattern with Majorana neutrinos has been essentially ruled out. In the Dirac case, the TM1 mixing pattern is fully consistent with current data including beta decay results, whereas the TM2 pattern is strongly constrained by the KATRIN limit and even could be largely ruled out if the KATRIN experiment reaches its final sensitivity without any discovery. Future high-precision measurements of lepton mixing parameters and absolute neutrino masses in both oscillation and non-oscillation experiments will provide decisive tests of these mixing patterns.\n\n", "2511.15644": "2025-11-19, **The data processing system of the POEMMA-Balloon with Radio mission**, Valentina Scotti et.al., [2511.15644v1](http://arxiv.org/abs/2511.15644v1)\n\n The POEMMA-Balloon with Radio (PBR) mission incorporates an advanced data processing system (DP) to enable the detection and characterization of ultra-high-energy cosmic rays and astrophysical neutrinos. The data acquisition (DAQ) system integrates inputs from the Cherenkov Camera, the Fluorescence Camera, the Radio Instrument and the X-Gamma detectors, ensuring synchronized event detection. Built upon the heritage of the EUSO-SPB2 DAQ architecture, the system has been adapted to support both the hybrid focal surface and radio instrumentation.   The DP features two redundant CPUs, differential GPS receivers, and environmental monitoring capabilities, including temperature, humidity, and gyroscope-based orientation tracking. A central clock board synchronizes data collection across all instruments, ensuring precise event reconstruction. The main trigger and clock board manages trigger signals from different detectors, supporting both joint and independent data acquisition modes. These advancements enhance the mission's contribution to multi-messenger astrophysics and provide valuable insights for future space-based observatories.   In this paper, we describe the system's main components and the design developed for this new mission.\n\n", "2511.15636": "2025-11-19, **The Cherenkov Camera for the PBR mission**, Valentina Scotti et.al., [2511.15636v1](http://arxiv.org/abs/2511.15636v1)\n\n The POEMMA-Balloon with Radio (PBR) mission is a NASA super-pressure balloon experiment designed to advance the detection of ultra-high-energy cosmic rays, high-altitude horizontal air showers, and astrophysical neutrinos. A key instrument of PBR is the Cherenkov Camera (CC), which utilizes a 2048-pixel SiPM camera to detect the optical Cherenkov emission from cosmic-ray-induced air showers and search for upward-going signals indicative of neutrinos.   The CC operates in the 320-900 nm spectral range with a 10 ns integration time, leveraging a bi-focal optical design to enhance detection efficiency. The CC enables precise reconstruction of shower trajectories and provides valuable data on cosmic rays' composition and energy distribution. PBR's sub-orbital altitude is particularly advantageous for these measurements, offering a unique vantage point that bridges the observational gap between ground-based and space-based instruments. Additionally, the CC will play a critical role in neutrino searches, detecting tau-lepton decay showers from Earth-skimming neutrinos associated with astrophysical transients. By integrating the CC with fluorescence and radio detection systems, PBR will pioneer a multi-messenger approach to high-energy cosmic phenomena, refining observational techniques for future space-based missions.   This contribution will describe the current status of the development of the CC as well as its expected performance.\n\n", "2511.15569": "2025-11-19, **Measurements of $ZZ \\rightarrow \\ell\\ellνν$ and $ZZjj \\rightarrow \\ell\\ellννjj$ productions in $pp$ collisions at $\\sqrt{s}=13$ TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2511.15569v1](http://arxiv.org/abs/2511.15569v1)\n\n This article presents measurements of $Z$ boson pair production cross-sections at a center-of-mass energy of $\\sqrt{s} = 13$ TeV, using 140 fb$^{-1}$ of proton-proton data collected with the ATLAS detector at the Large Hadron Collider. The analysis includes both inclusive $ZZ$ production and $ZZ$ production in association with two jets ($ZZjj$), where one $Z$ boson decays into a pair of charged leptons $\\ell^+\\ell^-$ ($\\ell = e, μ$), and the other decays into a neutrino pair. The measured fiducial cross-section of the inclusive $ZZ$ production is $21.0\\pm1.0$ fb, while for the $ZZjj$ production it is $0.96^{+0.18}\\_{-0.16}$ fb. Extrapolation of the $ZZ$ cross-section to the full phase space, for $Z$ bosons within the mass range $66-116$~GeV, yields $σ(pp \\rightarrow ZZ) = 15.38\\pm0.81$ pb. Differential cross-sections are presented for an extended set of kinematic observables. The results are found to be in good agreement with Standard Model predictions. Constraints on anomalous gauge boson self-interactions are derived using both the vertex function formalism and the effective field theory framework.\n\n", "2511.15559": "2025-11-19, **Excess of diffuse gamma-ray emission detected from the galaxy cluster Abell 119 from 14-year Fermi-LAT Data**, Gajanan D Harale et.al., [2511.15559v1](http://arxiv.org/abs/2511.15559v1)\n\n Galaxy clusters are among the most massive gravitationally bound systems in the Universe and are considered major reservoirs of high-energy cosmic rays, yet no conclusive $γ$-ray detection from them has been achieved. This non-detection may stem from limited sensitivity and source localization of current $γ$-ray instruments, as well as strong interactions of $γ$-rays with intervening material that restrict detectable signals to only a few nearby and dynamically active clusters. Motivated by these constraints, we selected a sample of nearby ($z<0.05$) merging clusters and analyzed 14 years of \\textit{Fermi}-LAT data. In this work, we present a detailed study of Abell 119 (A119), a merging cluster with significant X-ray luminosity and complex dynamics. Using \\textit{Fermipy} and \\textit{Fermi} Science Tools, we modeled all potential $γ$-ray sources and confirmed the 4FGL point sources 4FGL J0059.3$-$0152, 4FGL J0101.0$-$0059, and 4FGL J0059.2+0006 with significant TS values.s. It further reveals, a $\\sim4σ$ excess of diffuse $γ$-ray emission offset by $\\sim0.25^\\circ$ from the cluster center, plausibly associated with the cluster halo. An extended model provides the best fit, yielding luminosity bounds of $\\sim 12.21^{+2.74}\\_{-3.95}\\times10^{42}\\,\\mathrm{erg\\,s^{-1}}$ and a particle spectral index of $\\sim2.25^{+0.38}\\_{-0.13}$, consistent with earlier expectations for cluster-scale non-thermal emission. These results suggest a hadronic origin for the detected signal. Although the $\\sim4σ$ excess is compelling, uncertainties in localization and instrumental limitations prevent a definitive detection. Nonetheless, the results highlight the potential for deeper cluster studies, and the estimated neutrino flux $E^{2}φ\\_ν\\approx3\\times10^{-10}\\,\\mathrm{GeV\\,cm^{-2}\\,s^{-1}\\,sr^{-1}}$ motivates future observations with upcoming neutrino telescopes.\n\n", "2511.15525": "2025-11-19, **Probing unitarity violation of lepton flavor mixing matrix with reactor antineutrinos at JUNO and TAO**, Jihong Huang et.al., [2511.15525v1](http://arxiv.org/abs/2511.15525v1)\n\n Motivated by the precise measurements of neutrino oscillation parameters at Jiangmen Underground Neutrino Observatory (JUNO), we investigate the possibility of probing the unitarity violation of lepton flavor mixing matrix solely with reactor antineutrinos. First, we stress that it is necessary to reconsider the production and detection of neutrinos in a self-consistent way, apart from neutrino propagation, when analyzing experimental sensitivities to unitarity violation. Then, concentrating on JUNO and its satellite experiment Taishan Antineutrino Observatory (TAO), we demonstrate how the event rates of inverse beta decays (i.e., $\\overlineν^{}\\_e + p \\to e^+ + n$) for observing $\\overlineν^{}\\_e \\to \\overlineν^{}\\_e$ oscillations, and those of elastic antineutrino-electron scattering (i.e., $\\overlineν^{}\\_α+ e^- \\to \\overlineν^{}\\_α+ e^-$ with $α= e, μ, τ$) for $\\overlineν^{}\\_e \\to \\overlineν^{}\\_μ$ and $\\overlineν^{}\\_e \\to \\overlineν^{}\\_τ$ oscillations, depend on the parameters characterizing unitarity violation. Our investigation will be useful for JUNO and TAO to place independent constraints with more data in the near future.\n\n", "2511.15494": "2025-11-19, **Quantum field theory approach to neutrino oscillations in dark matter and its implication in the Juno experiment**, Wei Chao et.al., [2511.15494v1](http://arxiv.org/abs/2511.15494v1)\n\n Neutrino oscillation is a significant physical process worthy of in-depth exploration. In this paper, we investigate the matter effect of massive neutrinos in a scalar-type ultra-light dark matter and calculate the neutrino oscillation probability using the quantum field theory method. The result reveals that the neutrino oscillation probability derived from the quantum field theory approach exhibits no additional time dependence, which marks the most significant distinction from the oscillation result obtained through the quantum mechanics method. Furthermore, we discuss predictions of the Juno experiment regarding neutrino oscillation behavior in scalar-type ultra-light dark matter. This study extends the understanding of the interaction between neutrinos and dark matter, which warrants further exploration.\n\n", "2511.15442": "2025-11-19, **CP Prediction from Residual $\\mathbb Z_2^s$ and $\\overline{\\mathbb Z}_2^s$ Symmetries with JUNO First Data**, Shao-Feng Ge et.al., [2511.15442v1](http://arxiv.org/abs/2511.15442v1)\n\n The JUNO first data and the recent neutrino global fit results are implemented in the sum rule from the residual $\\mathbb Z^s\\_2$ and $\\overline{\\mathbb Z}^s\\_2$ symmetries to make prediction of the leptonic Dirac CP phase $δ\\_D$. Without involving model parameters, the probability distribution of $δ\\_D$ can be readily obtained from the experimental measurements of the three mixing angles. We then confront the theoretical predictions with the global fit results for the CP phase as well as the T2K and NOvA joint analysis for their CP measurement to give the data preference of the two residual symmetries with Bayes factor for both normal and inverted orderings. We further extend our analysis to a two-dimensional probability distribution to fully explore the correlation between the CP phase $δ\\_D$ and the atmospheric angle $θ\\_a \\equiv θ\\_{23}$.\n\n", "2511.15430": "2025-11-19, **21 cm Cosmology Sensitivity to Small-Scale Structure: Warm vs Neutrino-Interacting Dark Matter**, Virgile Dandoy et.al., [2511.15430v1](http://arxiv.org/abs/2511.15430v1)\n\n The $21\\,$cm signal originating from Cosmic Dawn to the Epoch of Reionisation is highly sensitive to the processes governing star formation in the early universe as well as new physics. In this work, we focus on the imprint of non-cold dark matter (DM), which impacts the formation of the smallest halos. Our goal in particular is to clarify whether near-future radio telescopes such as the Hydrogen Epoch of Reionisation Array (HERA), will be able to distinguish between free-streaming dark matter, specifically in the form of thermal warm DM (WDM), and collisional damping due to neutrino-DM ($ν$DM) interactions giving rise to larger overdensities on small scales. For that purpose we first implement a mapping between the two models in terms of a cutoff scale and determine detection thresholds for the two DM models. Using Fisher matrix forecasts, we show that $ν$DM interaction strengths down to $σ\\_{ν{\\rm DM}}\\sim 3\\times10^{-35}$ cm$^2$ could be probed by $21\\,$cm cosmology when considering two populations of galaxies for a GeV mass DM. This would allow to either confirm or rule out a recent claimed preference for a non-zero $ν$DM interaction in Lyman-$α$ data. Furthermore, we find that HERA will not be able to distinguish between $ν$DM and WDM. In the latter context, the threshold for detection of $ν$DM interactions translates into WDM with mass up to $m\\_{\\rm WDM}\\sim 9$ keV that could be detected by HERA.\n\n", "2511.15391": "2025-11-19, **Neutrinoless Double Beta Decay in Light of JUNO First Data**, Shao-Feng Ge et.al., [2511.15391v1](http://arxiv.org/abs/2511.15391v1)\n\n The first results from the JUNO reactor neutrino oscillation experiment improve our knowledge of neutrino masses and mixing parameters, especially the solar angle $θ\\_s \\equiv θ\\_{12}$ and the solar mass squared difference $Δm^2\\_s \\equiv Δm^2\\_{21}$. We discuss the implications of these results on neutrinoless double beta decay by itself and in combination with the global fit of neutrino oscillation experiments, the JUNO first data, and cosmological constraints on the neutrino mass sum. For the effective mass $\\langle m\\_{ee} \\rangle$, the uncertainties in its lower limits for both mass orderings and upper limits for the normal ordering are largely reduced. Since the cosmological CMB and DESI BAO data put a stringent constraint on the neutrino mass scale, we also show how the probability distribution of both the real and imaginary parts of the effective mass $\\langle m\\_{ee} \\rangle$ on the complex plane is affected. Especially, the funnel region with $\\|\\langle m\\_{ee} \\rangle\\| \\lesssim 1$\\,meV receives larger chance to happen. Correspondingly, the chance of determining the two Majorana CP phases simultaneously in this region also increases with reduced uncertainty.\n\n", "2511.15325": "2025-11-19, **Origin of Galaxies**, Nikolaos Samaras et.al., [2511.15325v1](http://arxiv.org/abs/2511.15325v1)\n\n Milgromian Dynamics (MOND) has been particularly successful in predicting scaling relations for galactic systems, namely the baryonic Tully-Fisher for spirals, the Faber-Jackson for ellipticals and the Radial Acceleration Relation for late-type galaxies. Its essential tenet is the modification of the gravity law at low accelerations. Nevertheless, despite MOND's passed tests, the puzzle of the missing mass on galaxy clusters' scales still persists. One proposed scenario to complete this deficit and apply it further to cosmology is the so-called $ν$HDM model. It is composed of a sterile neutrino and the MOND gravity. In this Ph.D. thesis, I have put forward this cosmological idea, conducting hydrodynamical simulations to investigate the $ν$HDM structure formation. In the debut attempt, the $ν$HDM model was proven capable of reproducing the $Λ$CDM cosmology, imitating the same expansion history ($Ω\\_m \\approx$ 0.3 and $H\\_0 \\approx$ 67.6 km/s/Mpc), reproducing the CMB phenomenology, while the cosmic web is nicely formed. In the next step, I have optimized the $ν$HDM model using Bayesian statistics, re-branding it to opt-$ν$HDM. I managed to optimally fit the angular power spectrum of the CMB calculated by \\textit{Planck}, except its fourth peak, but the opt-$ν$HDM cosmological parameters changed significantly with respect to its precursor, resulting in a much heavier cosmos, with $Ω\\_m \\approx$ 0.5 and $H\\_0 \\approx$ 55.6 km/s/Mpc. Next, I explore the opt-$ν$HDM expansion history, its structure formation and the resulting mass function. The appearance of the early-time structures, firstly in the $ν$HDM model, as well as in the opt-$ν$HDM model occurs quiet late, at $z\\approx4$ and at $z\\approx 5.5$, respectively. Although the resolution has improved from previous studies, the $ν$HDM variants cannot explain easily the high-redshift galaxies, observed by JWST.\n\n", "2511.15127": "2025-11-19, **Divergence in tracing the flavors of astrophysical neutrinos: can JUNO help IceCube?**, Zhi-zhong Xing et.al., [2511.15127v1](http://arxiv.org/abs/2511.15127v1)\n\n We derive the flavor fractions $(η^{}\\_e , η^{}\\_μ, η^{}\\_τ)$ for ultrahigh-energy neutrinos originating from a remote astrophysical source by using their flavor ratios $(f^{}\\_e , f^{}\\_μ, f^{}\\_τ)$ observed at a neutrino telescope, and find that a potential divergence may appear in inferring the values of $η^{}\\_μ$ and $η^{}\\_τ$ as an unavoidable consequence of the approximate $μ$-$τ$ interchange symmetry of lepton flavor mixing. We illustrate such an effect by applying our formula to the IceCube all-sky neutrino flux data ranging from 5 TeV to 10 PeV in the naive assumption that the relevant sources have a common flavor composition. We show that only $η^{}\\_e$ and $η^{}\\_μ+ η^{}\\_τ$ can be extracted from the measurements of $f^{}\\_e$, $f^{}\\_μ$ and $f^{}\\_τ$ if the $μ$-$τ$ flavor symmetry is exact, and the JUNO and Daya Bay precision antineutrino oscillation data will help a lot in this connection.\n\n", "2511.15114": "2025-11-19, **Large-Width New Physics at Colliders: A Gauge-Invariant Resummation Approach**, Yin-Fa Shen et.al., [2511.15114v1](http://arxiv.org/abs/2511.15114v1)\n\n Broad resonances challenge the standard Monte-Carlo treatment of unstable particles, which introduces a Breit-Wigner width into leading-order matrix elements and can generate unphysical gauge artifacts. We develop a gauge-consistent framework that combines a Dyson-resummed propagator with Slavnov-Taylor-identity-implied resummed vertices, enabling a consistent implementation in MadGraph5. In the Type-I seesaw model, heavy Majorana neutrinos naturally satisfy $Γ\\sim m$, leading to strong departures from the Breit-Wigner lineshape, distorted angular correlations, and significant modifications to both $s$- and $t$-channel dynamics. Comparing with the normal and complex-mass schemes, we find that standard treatments can substantially misestimate cross sections and kinematic distributions in the large-width regime. Our results show that existing collider limits on heavy neutrinos-and, more generally, on any broad resonance-should be revisited within a fully resummed framework, opening new opportunities for both experimental searches and theoretical model building.\n\n", "2511.15111": "2025-11-19, **Modified TM2 for Reproducing All Best-Fit Values of Neutrino Mixing Angles**, Michael Fodroci et.al., [2511.15111v1](http://arxiv.org/abs/2511.15111v1)\n\n As measurements of neutrino mixing angles continue to become more precise, it is increasingly likely that in the very near future a realistic neutrino mixing model will be required to precisely reproduce their best-fit values. In this study, a modified TM$\\_2$ mixing model which reproduces the best-fit values of all three neutrino mixing angles is proposed. The model reproduces the correct mixing angles within 1$σ$ of the current central values and is robust against any future changes of the best-fit values.\n\n", "2511.14857": "2025-11-18, **511 keV Gamma Ray Echo from Particle Decays in Supernovae**, Garv Chauhan et.al., [2511.14857v1](http://arxiv.org/abs/2511.14857v1)\n\n The formation of a hot and dense core in a core-collapse supernova (SN) can produce massive Beyond Standard Model (BSM) particles. These particles can decay in the stellar envelope, generating positrons either directly or through secondary processes involving neutrinos or photons. We show for the first time that such positrons regardless of their production channel, can thermalize and annihilate at rest with ambient electrons in the outer SN envelope, producing a characteristic echo of 511 keV gamma rays. For axion-like particles (ALPs), we derive bounds on the ALP-photon coupling ($G\\_{a γ}$) using Pioneer Venus Orbiter observations of SN 1987A. We also evaluate the sensitivity of upcoming MeV gap gamma-ray telescopes in the 511 keV range, such as COSI and AMEGO, for future Galactic SNe, which can improve existing constraints or enable ALP discovery. The echo signal is a generic prediction for any particle species that efficiently produces positrons near the stellar surface.\n\n", "2511.14593": "2025-11-18, **First measurement of reactor neutrino oscillations at JUNO**, Angel Abusleme et.al., [2511.14593v1](http://arxiv.org/abs/2511.14593v1)\n\n Neutrino oscillations, a quantum effect manifesting at macroscopic scales, are governed by lepton flavor mixing angles and neutrino mass-squared differences that are fundamental parameters of particle physics, representing phenomena beyond the Standard Model. Precision measurements of these parameters are essential for testing the completeness of the three-flavor framework, determining the mass ordering of neutrinos, and probing possible new physics. The Jiangmen Underground Neutrino Observatory (JUNO) is a 20 kton liquid-scintillator detector located 52.5 km from multiple reactor cores, designed to resolve the interference pattern of reactor neutrinos with sub-percent precision. Here we report, using the first 59.1 days of data collected since detector completion in August 2025, the first simultaneous high-precision determination of two neutrino oscillation parameters, $\\sin^2 θ\\_{12} = 0.3092\\,\\pm\\,0.0087$ and $Δm^2\\_{21} = (7.50\\,\\pm\\,0.12)\\times10^{-5}\\;{\\rm eV}^2$ for the normal mass ordering scenario, improving the precision by a factor of 1.6 relative to the combination of all previous measurements. These results advance the basic understanding of neutrinos, validate the detector's design, and confirm JUNO's readiness for its primary goal of resolving the neutrino mass ordering with a larger dataset. The rapid achievement with a short exposure highlights JUNO's potential to push the frontiers of precision neutrino physics and paves the way for its broad scientific program.\n\n", "2511.14590": "2025-11-18, **Initial performance results of the JUNO detector**, Angel Abusleme et.al., [2511.14590v1](http://arxiv.org/abs/2511.14590v1)\n\n The Jiangmen Underground Neutrino Observatory (JUNO) started physics data taking on 26 August 2025. JUNO consists of a 20-kton liquid scintillator central detector, surrounded by a 35 kton water pool serving as a Cherenkov veto, and almost 1000 m$^2$ of plastic scintillator veto on top. The detector is located in a shallow underground laboratory with an overburden of 1800 m.w.e. This paper presents the performance results of the detector, extensively studied during the commissioning of the water phase, the subsequent liquid scintillator filling phase, and the first physics runs. The liquid scintillator achieved an attenuation length of 20.6 m at 430 nm, while the high coverage PMT system and scintillator together yielded about 1785 photoelectrons per MeV of energy deposit at the detector centre, measured using the 2.223 MeV $γ$ from neutron captures on hydrogen with an Am-C calibration source. The reconstructed energy resolution is 3.4% for two 0.511 MeV $γ$ at the detector centre and 2.9% for the 0.93 MeV quenched Po-214 alpha decays from natural radioactive sources. The energy nonlinearity is calibrated to better than 1%. Intrinsic contaminations of U-238 and Th-232 in the liquid scintillator are below 10$^{-16}$ g/g, assuming secular equilibrium. The water Cherenkov detector achieves a muon detection efficiency better than 99.9% for muons traversing the liquid scintillator volume. During the initial science runs, the data acquisition duty cycle exceeded 97.8%, demonstrating the excellent stability and readiness of JUNO for high-precision neutrino physics.\n\n", "2511.14289": "2025-11-18, **Solar carbon abundance from 3D non-LTE modelling of the diagnostic lines of the CH molecule**, Richard Hoppe et.al., [2511.14289v1](http://arxiv.org/abs/2511.14289v1)\n\n Context. The spectral lines of the CH molecule are a key carbon (C) abundance diagnostic in FGKM-type stars. These lines are detectable in metal-rich and, in contrast to atomic C lines, also in metal-poor late-type stars. However, only 3D LTE analyses of the CH lines have been performed so far.   Aims. We test the formation of CH lines in the solar spectrum, using for the first time, 3D Non-LTE (NLTE) models. We also aim to derive the solar photospheric abundance of C, using the diagnostic transitions in the optical (4218 - 4356 Å) and infrared (33025 - 37944 Å).   Methods. We use the updated NLTE model molecule from Popa et al. (2023) and different solar 3D radiation-hydrodynamics model atmospheres. The models are contrasted against new spatially-resolved optical solar spectra, and the center-to-limb variation (CLV) of CH lines is studied.   Results. The 1D LTE and 1D NLTE models fail to describe the line CLV, and lead to underestimated solar C abundances. The 3D NLTE modelling of diagnostic lines in the optical and IR yields a carbon abundance of A(C)=$8.52\\pm0.07$ dex. The estimate is in agreement with recent results based on neutrino fluxes measured by Borexino.   Conclusions. 3D NLTE modelling and tests on spatially-resolved solar data are essential to derive robust solar abundances. The analysis presented here focuses on CH, but we expect that similar effects will be present for other molecules of astrophysical interest.\n\n"}, "dark matter": {"2511.15693": "2025-11-19, **Effects of short-range correlations at high densities on neutron stars with and without DM content: role of the repulsive self-interaction**, Odilon Lourenço et.al., [2511.15693v1](http://arxiv.org/abs/2511.15693v1)\n\n In this work, we investigate how short-range correlations affect relativistic hadronic models at high densities, with direct consequences for the structure of neutron stars, both with and without dark matter content. Two versions of the model are examined: one with vector self-interactions up to second order ($ω\\_0^2$) and another including a fourth-order term ($ω\\_0^4$). We show that SRC tend to soften the equation of state when only the quadratic term is present, but produce a noticeable stiffening once the $ω\\_0^4$ term is included. The corresponding Tolman-Oppenheimer-Volkoff solutions for pure neutron stars indicate that short-range correlations reduce the maximum mass in the first case but increase it in the second. Extending the analysis to stars containing a fermionic dark matter component, within the two-fluid formalism, we verify that the same features appear in the respective mass-radius diagrams. In particular, the decrease of the maximum mass with increasing dark matter fraction is partly compensated by the SRC effects in the hadronic sector for the model with the fourth-order term. In all cases, the resulting parametrizations are consistent with recent astrophysical constraints, including the joint NICER-XMM-Newton analyses of the pulsars PSR J0030+0451 and PSR J0740+6620, as well as the gravitational-wave event GW190425.\n\n", "2511.15655": "2025-11-19, **New features in the Z2xZ2 3HDM two component DM model**, Jorge C. Romão et.al., [2511.15655v1](http://arxiv.org/abs/2511.15655v1)\n\n We investigate the constraints and phenomenology of a three Higgs doublet model (3HDM) with a $\\Z2\\times\\Z2$ symmetry, featuring two inert scalar doublets that give rise to a two-component dark matter (DM) scenario. We analyze the model's vacuum structure, exploring the competition between different symmetry-breaking minima, and subject it to comprehensive theoretical and current experimental constraints. Our analysis reveals previously unexplored regions of parameter space with viable dark matter candidates. Notably, we identify scenarios where both DM particles contribute comparably to the observed relic density, offering distinctive experimental signatures that could guide future searches.\n\n", "2511.15484": "2025-11-19, **Dark Matter Realism: How Referential Semantics Restricts Realism in Contemporary Fundamental Physics**, Simon Allzén et.al., [2511.15484v1](http://arxiv.org/abs/2511.15484v1)\n\n Philosophers increasingly treat semantics as decisive for realism about dark matter. In this paper, I consider a recent proposal from Vaynberg (2024) anchored in the causal-descriptive theory of reference from Psillos (1999, 2012). I argue that the application of Psillos' general scientific realist framework in the local context of dark matter is misguided, partly because of the overlooked metaphysical commitments underpinning causal-descriptivism, and partly because the extension of 'dark matter' on this account includes entities we do not currently consider to be dark matter, and exclude entities that we currently consider could be dark matter. Furthermore, I argue that this discord between scientific realism and dark matter should be regarded endemic in contexts where empirical evidence is scarce: the semantic details required by the proposed scientific realism is dependent on canonical empirical confirmation, because it is against that background that scientific realism has been formulated and developed.\n\n", "2511.15438": "2025-11-19, **Detectability of axion-like dark matter for different time-delay interferometry combinations in space-based gravitational wave detectors**, Yong-Yong Liu et.al., [2511.15438v1](http://arxiv.org/abs/2511.15438v1)\n\n In the space-based gravitational wave detections, the axion-like dark matter would alter the polarization state of the laser link between spacecrafts due to the birefringence effect. However, current designs of space-based laser interferometer are insensitive to variations in the polarization angle. Thus, the additional wave plates are employed to enable the response of the axion-induced birefringence effect. We calculate and compare the sensitivities of different space-based detectors, accounting for three time-delay interferometry combinations, including Monitor, Beacon, and Relay. We find that the Monitor and Beacon combinations have better sensitivity in the high-frequency range, and the optimal sensitivity reaches $g\\_{aγ}\\sim 10^{-13}\\text{GeV}^{-1}$, while the Sagnac combination is superior in the low-frequency range. We also find that ASTROD-GW can cover the detection range of axion-like dark matter mass down to $10^{-20}\\text{eV}$.\n\n", "2511.15422": "2025-11-19, **Viscous Dark Energy and Mass-Varying Dark Matter in Lyra Manifold: Cosmological Dynamics and Observational Constraints**, Giridhari Deogharia et.al., [2511.15422v1](http://arxiv.org/abs/2511.15422v1)\n\n We investigate the cosmological dynamics of a universe described by Lyra's geometry in the presence of dark energy (DE) and dark matter (DM). Dark energy is modeled as a quintessence scalar field with bulk viscosity, while dark matter is allowed to interact with the scalar sector. The displacement vector field, arising naturally in Lyra's manifold, provides an additional geometric contribution. By employing dynamical system techniques, we analyze stability properties and late-time attractors. Our results indicate that viscosity and DE--DM interaction enrich the phase space structure and can help address both the cosmic acceleration and the coincidence problem. Furthermore, by performing a Markov Chain Monte Carlo (MCMC) analysis with recent observational datasets, we derive best-fit values for the model parameters that exhibit good consistency with current data.\n\n", "2511.15354": "2025-11-19, **Galaxy-Multiplet Clustering from DESI DR2**, Hanyue Wang et.al., [2511.15354v1](http://arxiv.org/abs/2511.15354v1)\n\n We present an efficient estimator for higher-order galaxy clustering using small groups of nearby galaxies, or multiplets. Using the Luminous Red Galaxy (LRG) sample from the Dark Energy Spectroscopic Instrument (DESI) Data Release 2, we identify galaxy multiplets as discrete objects and measure their cross-correlations with the general galaxy field. Our results show that the multiplets exhibit stronger clustering bias as they trace more massive dark matter halos than individual galaxies. When comparing the observed clustering statistics with the mock catalogs generated from the N-body simulation AbacusSummit, we find that the mocks underpredict multiplet clustering despite reproducing the galaxy two-point auto-correlation reasonably well. This discrepancy indicates that the standard Halo Occupation Distribution (HOD) model is insufficient to describe the properties of galaxy multiplets, revealing the greater constraining power of this higher-order statistic on galaxy-halo connection and the possibility that multiplets are specific to additional assembly bias. We demonstrate that incorporating secondary biases into the HOD model improves agreement with the observed multiplet statistics, specifically by allowing galaxies to preferentially occupy halos in denser environments. Our results highlight the potential of utilizing multiplet clustering, beyond traditional two-point correlation measurements, to break degeneracies in models describing the galaxy-dark matter connection.\n\n", "2511.15049": "2025-11-19, **The effects of dark energy on the matter-gravity coupling**, Antonio Enea Romano et.al., [2511.15049v1](http://arxiv.org/abs/2511.15049v1)\n\n Dark energy perturbations are expected to modify the evolution of cosmological perturbations, producing observable effects on scalar perturbations and gravitational waves. We show that the effects of dark energy for a generic modified gravity model can be encoded in a momentum, space and polarization dependent effective matter-gravity coupling, in agreement with the results obtained in some specific theories, and that this is not just related to the effective Planck mass appearing in the action as a coefficient of the Ricci's scalar. Using appropriately defined effective energy tensors, we show that the method can be extended to include also the effects of higher order perturbations. The generality of this effective description of the effects of dark energy on cosmological perturbations gives a solid theoretical justification for the phenomenological approaches often used in the analysis of cosmological observations, allowing to understand the mapping between the results of phenomenological analysis of observational data and theoretical models. The momentum and polarization dependence of the effective gravitational coupling implies that the gravitational energy emitted by a binary coalescence can have an additional frequency and polarization dependence, due to the effects of dark energy perturbations.\n\n", "2511.15025": "2025-11-19, **Modifications of Newtonian dynamics from higher moments of quantum spin connection in precanonical quantum gravity**, M. E. Pietrzyk et.al., [2511.15025v1](http://arxiv.org/abs/2511.15025v1)\n\n Building upon previous work that derived an alternative to (galactic) dark matter in the form of Modified Newtonian Dynamics (MOND), with a specific theoretical interpolating function, from the motion of a non-relativistic test particle in the gravitational field of a point mass immersed in the non-relativistic static limit of the spin connection foam -- which represents the quantum analogue of Minkowski spacetime within precanonical quantum gravity -- we now show the consequences of using higher moments (third and fourth) of the corresponding geodesic equation with a random spin connection term. These higher moments lead to more general quantum modifications of the Newtonian potential (qMOND potentials expressed in terms of Gauss and Appell hypergeometric functions), more general (steeper) MOND interpolating functions, and a new modification of MOND at low accelerations (mMOND) that features an almost-flat asymptotic rotation curve $\\propto r^{-1/18}$, which is expected to operate at approximately the same galactic scales as MOND.\n\n", "2511.14912": "2025-11-18, **Dynamics in the Cores of Self-Interacting Dark Matter Halos: Reduced Stalling and Accelerated Core Collapse**, Frank C. van den Bosch et.al., [2511.14912v1](http://arxiv.org/abs/2511.14912v1)\n\n Self-interacting dark matter (SIDM) is an intriguing alternative to the standard cold dark matter (CDM) paradigm, which predicts that dark matter halos typically have large, isothermal cores. Numerical simulations have shown that dynamical friction ceases to operate in cores of (roughly) constant density, a phenomenon known as core stalling. In addition, such cores often are unstable to a dipole instability that gives rise to dynamical buoyancy, causing massive central objects to move outward. Thus far, these manifestations of core dynamics have only been demonstrated in collisionless systems. In this paper, we use idealized N-body simulations to study whether core stalling and dynamical buoyancy operate in SIDM halos. We find that if the self-interactions are sufficiently strong, neither core stalling nor buoyancy are present, and a massive perturber will quickly sink all the way to the center of its host. In doing so, it gravitationally contracts the core, catalyzing a strongly accelerated core collapse. The reason why core dynamics are so different in SIDM halos is that self-interactions drive the halo's distribution function to a featureless exponential, removing any inflections or plateaus that are responsible for the dipole instability and core stalling in the case of CDM. We discuss implications of our finding for constraining the nature of dark matter by using observations of massive objects such as supermassive black holes (SMBHs), globular clusters, and nuclear star clusters in the central regions of galaxies.\n\n", "2511.14851": "2025-11-18, **Probing Axion via Mössbauer Spectroscopy**, Shengyi Liu et.al., [2511.14851v1](http://arxiv.org/abs/2511.14851v1)\n\n We propose using the ultra-narrow 88 keV Mössbauer transition in $^{109}$Ag to search for QCD axion dark matter. The sub-eV axion field oscillates coherently, inducing a time-varying effective $\\barθ\\_{\\rm QCD}$ angle. This, in turn, modulates the nuclear binding energy. From existing linewidth measurements, we derive constraints on the $f\\_a^{-1}$-$m\\_a$ plane that already surpass other laboratory bounds. We further detail an experimental setup to directly probe this time-dependent signature via precision Mössbauer spectroscopy in the gravitational potential. This Letter demonstrates that this approach can significantly extend search capability and probe a vast, unexplored region of axion parameter space. Particularly, this setup can probe axion masses beyond the reach of existing experiments, such as atomic-clock measurements, offering a powerful new way for exploring higher-mass axion dark matter. The sensitivity has the potential to be further improved with advancing experimental capabilities.\n\n", "2511.14845": "2025-11-18, **Low-frequency radio telescopes sensitivity to light dark matter**, Ruben Zatini et.al., [2511.14845v1](http://arxiv.org/abs/2511.14845v1)\n\n Ground-based radio telescopes are routinely used to search for light dark matter (DM) candidates such as axion-like particles or dark photons. These instruments face however inherent limitations to push the searches to masses below $10^{-7}$ eV, due to the effect of the Earth's ionosphere. The extant and planned space- or Moon-based radio telescopes motivate this study: We systematically investigate their sensitivity to resonant conversion of light DM into radio signals from three solar system targets: the Sun, the Earth, and Jupiter. The perspectives are especially encouraging for dark photon searches using the Sun as a target, and for axion-like particles conversion in Jupiter's magnetosphere.\n\n", "2511.14726": "2025-11-18, **Constraining the Nature of Dark Matter from Tidal Radii of Cluster Galaxy Subhalos**, Barry T. Chiang et.al., [2511.14726v1](http://arxiv.org/abs/2511.14726v1)\n\n Gravitational lensing by galaxy clusters provides a powerful probe of the spatial distribution of dark matter and its microphysical properties. Strong and weak lensing constraints on the density profiles of subhalos and their truncation radii offer key diagnostics for distinguishing between collisionless cold dark matter (CDM) and self-interacting dark matter (SIDM). Notably, in the strongly collisional SIDM regime, subhalo core collapse and enhanced mass loss from ram-pressure stripping predict steeper central density slopes and more compact truncation radii--features that are directly testable with current lensing data. We analyze subhalo truncation in eight lensing clusters (Abell 2218, 383, 963, 209, 2390, and MACS J0416.1, J1206.2, J1149.6) that span the redshift range <$z\\_\\text{spec}$>$ \\simeq 0.17$-$0.54$ with virial masses $M\\_{200} \\simeq0.41$-$2.2\\times 10^{15}$ M$\\_\\odot$ to constrain SIDM versus CDM. Our results indicate that the outer spatial extents of subhalos are statistically consistent with CDM, corroborated by redshift- and mass-matched analogs from the Illustris-TNG simulations. We conclude that the tidal radii of cluster galaxy subhalos serve as an important and complementary diagnostic of the nature of dark matter in these violent, dense environments.\n\n", "2511.14677": "2025-11-18, **Equilateral non-Gaussian Bias at the Field Level**, Divij Sharma et.al., [2511.14677v1](http://arxiv.org/abs/2511.14677v1)\n\n Primordial non-Gaussianity (PNG) is a common prediction of a wide class of inflationary models. Equilateral-type PNG, generically predicted by single-field inflationary models with higher-derivative interactions, imprints subtle but measurable signatures on the large-scale distribution of matter. An important parameter of these imprints is the PNG-induced bias coefficient $b\\_ψ$, which quantifies how the abundance and clustering of dark matter halos and galaxies respond to mode coupling in the initial conditions. Measuring $b\\_ψ$ is important for constraining equilateral PNG, yet it is notoriously challenging due to its degeneracy with Gaussian scale-dependent bias contributions. In this work, we present the first precision measurements of equilateral $b\\_ψ$ for dark matter halos using effective field theory at the field level. We show that this approach disentangles PNG effects from those of the Gaussian bias by virtue of noise variance cancellation. We compare our results with the phenomenological predictions based on the Peak-Background Split model, finding some agreement at the qualitative level on the redshift and mass dependence, but poor agreement at the quantitative level. We present a fitting formula for $b\\_ψ$ as a function of the linear bias, which can be used to set priors in PNG searches with ongoing and future galaxy surveys.\n\n", "2511.14667": "2025-11-18, **High-resolution weak lensing mass mapping from DES-Y3 data using diffusion-based prior**, Supranta S. Boruah et.al., [2511.14667v1](http://arxiv.org/abs/2511.14667v1)\n\n High-resolution mapping of cosmic mass distribution is essential for a variety of astrophysical applications including understanding cosmic structure formation, and galaxy formation and evolution. However dark matter is not directly observed and therefore we need advanced methods for solving inverse problems to reconstruct the underlying cosmic matter distribution. Here, we train a generative diffusion model and use it in the Diffusion Posterior Sampling (DPS) framework to reconstruct mass maps from Dark Energy Survey-Year 3 (DES-Y3) weak gravitational lensing data at high (1 arcminute) resolution. We show that the standard DPS results are biased, but they can be easily corrected by scaling the log-likelihood score during the diffusion process, yielding unbiased results with proper uncertainty quantification. The resulting mass maps reveal cosmic structures with enhanced detail, opening the door for improved astrophysical studies using the obtained mass maps.\n\n", "2511.14635": "2025-11-18, **Probing the Phenomenology of Dark Matter from Decoupled Freeze-Out**, Geneviève Bélanger et.al., [2511.14635v1](http://arxiv.org/abs/2511.14635v1)\n\n We consider a model of dark matter where the mediator corresponds to a superposition of a scalar and pseudoscalar, and the scenario where, after reheating, the number densities of the dark sector particles, i.e. the dark matter and the mediators, are negligible. If the coupling of the mediators to the Standard Model is feeble, but the coupling to the dark matter is large enough, the dark sector may reach equilibrium at a temperature distinct from that of the thermal bath. The relic density is then said to be obtained via decoupled freeze out (DFO). We focus on the $s$-wave annihilation scenario, which particularly benefits from the DFO mechanism by evading standard CMB limits while still yielding indirect detection signals. We calculate the relic density by solving a set of four coupled Boltzmann equations for the number densities of the dark sector particles and the energy transfer from the light to dark sector. We finally perform a thorough analysis of experimental bounds on this scenario, namely from indirect detection and the CMB, as well as from BBN, and find that, while there are considerable constraints on the parameter space where the correct relic density is obtained, a viable region remains to be explored.\n\n", "2511.14571": "2025-11-18, **Impact of conversion-driven processes on singlet-doublet Majorana dark matter relic**, Partha Kumar Paul et.al., [2511.14571v1](http://arxiv.org/abs/2511.14571v1)\n\n The singlet-doublet dark matter model offers a rich framework for exploring the nature of dark matter (DM) through its unique fermion structure. In this model, the important parameters are singlet-doublet mass splitting $Δ{M}$, singlet-doublet mixing angle $\\sinθ$, and DM mass $M\\_{\\rm DM}$. If the DM is assumed to be of Dirac nature, then the annihilation, co-annihilation, and conversion driven processes combinedly allows a range of parameter space: $1~{\\rm GeV} \\lesssim M\\_{\\rm DM}\\lesssim750$ GeV and $10^{-6}\\lesssim\\sinθ\\lesssim0.04$ for all $Δ{M}>1$ GeV. While the nature of DM either Dirac or Majorana is not known, in this work we assume the nature of singlet-doublet DM to be of Majorana type and find that the relic density and direct detection can be satisfied in a larger parameter space. In particular, the allowed ranges of DM mass and $\\sinθ$ are: $1~{\\rm GeV}\\lesssim M\\_{\\rm DM}\\lesssim1750$ GeV and $2\\times10^{-7}\\lesssim\\sinθ\\lesssim0.16$ for all $Δ{M}>1$ GeV.\n\n", "2511.14532": "2025-11-18, **Early Universe Constraints on Variations in Fundamental Constants Induced by Ultralight Scalar Dark Matter**, Subhajit Ghosh et.al., [2511.14532v1](http://arxiv.org/abs/2511.14532v1)\n\n We study the cosmological impact of ultralight dark matter (ULDM) with a quadratic coupling to Standard Model particles. In addition to the suppression of small-scale power from ULDM itself, the coupling induces a variation of fundamental constants that is modulated by the ULDM oscillatory field value. In this work, we consider the ULDM-induced, time-dependent variation of the fine structure constant and the mass of the electron. These variations modify the predicted abundance of light elements during Big Bang nucleosynthesis (BBN) and the process of recombination, thereby affecting the anisotropies of the cosmic microwave background (CMB). We use CMB anisotropy data and baryon acoustic oscillation measurements to obtain constraints on the variation of couplings over a wide range of ULDM masses. We self-consistently account for the modification of the primordial helium abundance during BBN in computing the CMB power spectra. We find that the allowed ULDM fraction of total dark matter abundance is more constrained for ULDM masses $\\lesssim 10^{-26}~\\mathrm{eV}$ in the presence of the variations. Moreover, our constraints on the variational couplings for ULDM masses $\\lesssim 10^{-27}~\\mathrm{eV}$ are stronger than the ones derived from the primordial helium abundance at BBN. Under our ULDM model, the variation of fundamental constants has no appreciable impact on the Hubble constant inferred from CMB data and thus does not present a viable solution to the Hubble tension.\n\n", "2511.14425": "2025-11-18, **Dark matter halos and transonic accretion flow**, Avijit Chowdhury et.al., [2511.14425v1](http://arxiv.org/abs/2511.14425v1)\n\n The interplay between supermassive black holes (SMBHs) and their surrounding environment is fundamental to understanding galactic evolution. This work investigates the influence of a cold dark matter (DM) halo on the dynamics of relativistic, low angular momentum, inviscid, and advective hot accretion flow onto a galactic SMBH. Modeling the spacetime geometry as a black hole embedded within various DM distributions, including those with a central density spike, we demonstrate that the presence of a DM halo, particularly one that is massive and compact, enhances the luminosity of the accretion disk. The dominant contribution to this luminosity originates from the inner regions of the flow, suggesting that luminosity measurements could serve as a valuable observational probe for the dense DM environments expected near galactic centers.\n\n", "2511.14235": "2025-11-18, **Spontaneous Symmetry Breaking as a Late-Time Trigger for Interacting Dark Energy**, Pradosh Keshav MV et.al., [2511.14235v1](http://arxiv.org/abs/2511.14235v1)\n\n Persistent tensions in the Hubble constant (H0) and the matter clustering parameter (S8) motivate late-time new physics that suppresses structure growth without significantly altering the background expansion history of the LambdaCDM model. We study a class of dark-sector dynamics in which a scalar dark energy field, governed by a Z2-symmetric quartic potential, interacts with dark matter through Yukawa and portal couplings. When the matter density drops below a critical threshold, a cosmological spontaneous symmetry breaking mechanism generates a time-dependent vacuum expectation value v(a) and activates an effective coupling eta(a). This creates a symmetric phase (a <= ac) identical to LambdaCDM at early times, and a broken phase (a > ac) in which eta(a) > 0 transfers energy from dark matter to dark energy, suppressing linear structure growth. Using RSD, BAO, cosmic chronometers, Pantheon+SH0ES supernovae, and compressed Planck distance priors, we compare a fixed LambdaCDM background with a self-consistent coupled-scalar evolution. The RSD-only analysis shows a strong shift: the dynamical background gives Omega\\_m ~ 0.31 +/- 0.10 and sigma8,0 ~ 0.59 +/- 0.01, while the fixed-background case gives Omega\\_m ~ 0.20 +/- 0.09 and sigma8,0 ~ 0.75 +/- 0.05. In the full joint fit, we obtain Omega\\_m = 0.29 +/- 0.01, H0 = 69.7 +/- 0.6 km s^-1 Mpc^-1, and sigma8,0 = 0.78 +/- 0.01. A late-time interaction triggered by spontaneous symmetry breaking can therefore damp structure growth and ease the S8 tension while leaving the expansion history and the inferred H0 essentially unchanged, suggesting distinct physical origins for the two tensions.\n\n", "2511.14089": "2025-11-18, **Cosmological dynamics of interacting dark matter-dark energy in generalized Rastall gravity**, Manuel Gonzalez-Espinoza et.al., [2511.14089v1](http://arxiv.org/abs/2511.14089v1)\n\n In this work, we investigate late-time interacting cosmologies within the framework of generalized Rastall gravity, where the interaction arises naturally from the non-conservation of the energy-momentum tensor. We formulate the background evolution of the dark sector as an autonomous dynamical system, defining interaction terms $Q\\_1=α\\,\\dot{f}$ and $Q\\_2=-\\dot{f}\\,(1+α)$, with $α$ a constant parameter and $f$ a time-dependent function. Three interaction cases are studied: $f \\propto ρ\\_m$, $f \\propto ρ\\_{de}$, and $f \\propto ρ\\_m + ρ\\_{de}$, assuming a constant dark-energy equation of state $w\\_{de}$. For each scenario, we derive the closed dynamical system in terms of the density parameters $(Ω\\_{de}, Ω\\_m)$, identify its fixed points, and analyze their stability across the parameter space. In this context, the phase-space exhibits a standard cosmological dynamics: an unstable radiation point, a transient matter saddle, and a stable late-time attractor with accelerated expansion. In addition, we utilize a joint likelihood analysis with Cosmic Chronometers, PantheonPlus, and DESI data to obtain marginalized parameter estimates at the $68\\%$ and $95\\%$ confidence levels, constraining the parameter space in each interaction model.\n\n", "2511.14047": "2025-11-18, **Exact, non-singular black holes from a phantom DBI Field as primordial dark matter**, Tausif Parvez et.al., [2511.14047v1](http://arxiv.org/abs/2511.14047v1)\n\n We present the first exact, non-singular black hole solution in General Relativity sourced by a Dirac-Born-Infeld (DBI) scalar field. Crucially, the solution is exclusively supported by the phantom branch of the DBI action, dynamically replacing the central singularity with a regular core. The solution is asymptotically flat, possesses non-trivial scalar hair, and replaces the central singularity with a regular 2-sphere. The mechanism for singularity resolution is a dynamical kinetic stiffness -- analogous to shear thickening in non-Newtonian fluids -- which also explains the evasion of classical no-hair theorems. We show these black holes evaporate to a stable, non-singular, extremal Planck-scale relic. This provides a robust mechanism to evade standard evaporation constraints, opening a vast, previously forbidden mass window for light Primordial Black Holes to constitute dark matter. The model is testable via distinctive gravitational-wave signatures from its scalar hair.\n\n"}, "supernova": {"2511.15470": "2025-11-19, **Advancing Identification method of Gamma-Ray Bursts with Data and Feature Enhancement**, Peng Zhang et.al., [2511.15470v1](http://arxiv.org/abs/2511.15470v1)\n\n Gamma-ray bursts (GRBs) are challenging to identify due to their transient nature, complex temporal profiles, and limited observational datasets. We address this with a one-dimensional convolutional neural network integrated with an Adaptive Frequency Feature Enhancement module and physics-informed data augmentation. Our framework generates 100,000 synthetic GRB samples, expanding training data diversity and volume while preserving physical fidelity-especially for low-significance events. The model achieves 97.46% classification accuracy, outperforming all tested variants with conventional enhancement modules, highlighting enhanced domain-specific feature capture. Feature visualization shows model focuses on deep-seated morphological features and confirms the capability of extracting physically meaningful burst characteristics. Dimensionality reduction and clustering reveal GRBs with similar morphologies or progenitor origins cluster in the feature space, linking learned features to physical properties. This perhaps offers a novel diagnostic tool for identifying kilonova- and supernova-associated GRB candidates, establishing criteria to enhance multi-messenger early-warning systems. The framework aids current time-domain surveys, generalizes to other rare transients, and advances automated detection in large-volume observational data.\n\n", "2511.15401": "2025-11-19, **Explosions in the Empty: A Survey of Transients in Local Void Galaxies**, Suo-Ning Wang et.al., [2511.15401v1](http://arxiv.org/abs/2511.15401v1)\n\n We present a systematic analysis of transient astrophysical events -- including supernovae (SNe), gamma-ray bursts (GRBs), and fast radio bursts (FRBs) -- in void and non-void galaxies within the local universe ($0.005 < z < 0.05$). Cosmic voids, defined by low galaxy densities and characterized by minimal environmental interactions, offer a natural laboratory for isolating the impact of large-scale underdensities on stellar evolution and transient production. Using multi-wavelength data from the Sloan Digital Sky Survey, the Sternberg Astronomical Institute Supernova Catalogue, and high-energy space observatories, we compare transient occurrence rates and host galaxy properties across environments. We find that core-collapse supernovae (CCSNe) are significantly more common in void galaxies, indicating that massive star formation remains active in underdense regions. In contrast, Type Ia supernovae are less frequent in voids, consistent with a scarcity of older stellar populations. Notably, we identify a short-duration GRB hosted by a void galaxy, demonstrating that compact object mergers can occur in isolated environments. Additionally, we find no FRBs associated with void galaxies. Taken together, these results show that cosmic voids exert a measurable influence on the star formation history of galaxies and hence on the production of transients.\n\n", "2511.15349": "2025-11-19, **Type Iax supernovae as a source of iron-rich silicate dust**, Aman Kumar et.al., [2511.15349v1](http://arxiv.org/abs/2511.15349v1)\n\n We model the formation of dust in the ejecta of Type Iax supernovae (SNe), which is a low-luminosity subclass of Type Ia SNe. A non-equilibrium chemical kinetic approach is adopted to trace the synthesis of molecules, molecular clusters, and dust grains in the ejecta of thermonuclear SNe. We find that Type Iax SNe provide conditions conducive to the formation of several O-rich dust species in the ejecta. Particularly, iron-rich silicates of chemical type FeSiO3, Fe2SiO4, and MgFeSiO4 are found to form in abundance, suggesting that the ejecta of low-luminosity thermonuclear SNe can be a site where a large fraction of iron is locked up in dust, unlike other stellar sources. The final mass of dust formed in the ejecta ranges between 10^{-5} and 10^{-4} Msun, where most of the dust forms between 1000 and 2000 days post-explosion. Apart from Fe-rich silicates, Mg-silicates, and silicon carbide are also formed in the ejecta of Type Iax SNe. When compared to the dust budget of typical Type Ia SNe, we find that the expected dust-to-ejecta mass ratio is one or two orders of magnitude larger in Type Iax SNe. We conclude that the ejecta of typical Type Ia SNe form a negligible amount of dust, in agreement with observation, while the low-luminosity subclass Type Iax SNe are potential producers of iron-rich silicates.\n\n", "2511.14916": "2025-11-18, **SN 2023taz: Implications for the UV Diversity of Superluminous Supernovae**, Aysha Aamer et.al., [2511.14916v1](http://arxiv.org/abs/2511.14916v1)\n\n Superluminous supernovae (SLSNe) are some of the brightest explosions in the Universe representing the extremes of stellar deaths. At the upper end of their distribution is SN\\,2023taz, one of the most luminous SLSNe discovered to date with a peak absolute magnitude of $M\\_{g,\\rm{peak}}=-22.75 \\pm 0.03$ and a lower limit for energy radiated of $E=2.9 \\times 10^{51}$\\,erg. Magnetar model fits reveal individual parameter values typical of the SLSN population, but the combination of a low $B$-field and ejecta mass with a short spin period places SN\\,2023taz in a unusual region of parameter space, accounting for its extreme luminosity. The optical data around peak are consistent with a temperature of $\\sim$17\\,000\\,K but SN\\,2023taz shows a surprising deficit in the UV compared to other events in this temperature range. We find no indication of dust extinction that could plausibly explain the UV deficit. The lower level of UV flux is reminiscent of the absorption seen in lower-luminosity events like SN\\,2017dwh, where Fe-group elements are responsible for the effect. However, in the case of SN\\,2023taz, there is no evidence for a larger amount of Fe-group elements which could contribute to line blanketing. Comparing to SLSNe with well-observed UV spectra, an underlying temperature of $8000-9000$\\,K would match the UV spectral slope, but is not consistent with the optical colour temperatures of these events. The most likely explanation is enhanced absorption by intermediate-mass elements, challenging previous findings that SLSNe exhibit similar UV absorption line equivalent widths. This highlights the need for expanded UV spectroscopic coverage of SLSNe, especially at early times, to build a framework for interpreting their diversity and to enable classification at higher redshifts where optical observations will exclusively probe rest-frame UV emission.\n\n", "2511.14829": "2025-11-18, **Delayed Wind Onset in Pa 30, the Remnant of Type Iax SN 1181**, Takatoshi Ko et.al., [2511.14829v1](http://arxiv.org/abs/2511.14829v1)\n\n Pa 30 is the recently identified remnant of the historical supernova SN 1181, likely a Type Iax event, and a nebula surrounding the central white dwarf launching a fast wind ($\\sim10^9~\\cm~\\s^{-1}$) is observed in optical and infrared bands. X-ray observations show that this wind collides with the surrounding material and produces a termination shock, and the observed extent of the shock indicates that the wind started blowing centuries after 1181 A.D. rather than immediately after the SN explosion. We propose that the wind is triggered by delayed ignition of fallback carbon-rich material on the WD surface and investigate the conditions that reproduce such delayed ignition. We show that producing delays of several centuries requires a relatively hot post-explosion WD core with a temperature $T\\_c \\simeq 6\\times10^8~\\mathrm{K}$. This supports the pure-deflagration progenitor scenario for Type Iax SN 1181, which implies the presence of a He star companion inside Pa~30; we also discuss why such a potential He star has not been detected and its prospects for discovery by future observations.\n\n", "2511.14686": "2025-11-18, **Massive runaway star HD 254577: the pre-supernova binary companion to the progenitor of the supernova remnant IC 443**, B. Dinçel et.al., [2511.14686v1](http://arxiv.org/abs/2511.14686v1)\n\n The secondaries of the massive binary systems can be found as runaway stars after being ejected due to the supernova (SN) of the more massive component. We search for such stars inside the supernova remnants (SNRs), where a recent SN is guaranteed to have happened. In this paper, we present the massive runaway star HD~254577 as the pre-supernova binary companion to the progenitor of the supernova remnant IC~443 and the neutron star (NS) CXOU~J61705.3$+$222127. We performed spectroscopic observations of the runaway star and specified its atmospheric parameters. Together with the precise \\textit{Gaia} DR3 astrometry and photometry, we identified the possible birth origin of the runaway star, and by isochrone fitting, we determined the progenitor mass. From the \\textit{Gaia} DR3 proper motions, we specified the possible explosion sites and calculated the neutron star (NS) velocity. HD~254577 is a hot and evolved star with an effective temperature of $24000\\pm1000$ K (B0.5II) and a surface gravity of $\\log({g~\\rm[cm/s^2]})=2.75\\pm0.25$. It is probably a single star with a peculiar 3-D velocity of $31.3^{+1.2}\\_{-0.9}$ km~s$^{-1}$, lying at a heliocentric distance of $1701^{+55}\\_{-54}$ pc. The cometary tail of the NS implies that it is moving away from the same site as the runaway star. From the flight trajectories, we calculated that the NS has typical pulsar velocities such as $254-539$ km~s$^{-1}$ at a distance of $1.7$ kpc for $10-20$ kyr ages. Together with the blue-only shifted interstellar medium lines on its spectrum, HD~254577 must be the pre-supernova binary companion to the progenitor of IC~443. By identifying the pre-supernova companion and the possible parent cluster, we showed that the progenitor zero-age main sequence mass is high: $31-64$ M$\\_\\odot$. We also discuss the expansion dynamics of the SNR due to the highly off-centered explosion site.\n\n", "2511.14596": "2025-11-18, **The Role of Binary Configuration in Shaping Nova Evolution via Wind Accretion in Symbiotic Systems**, Irin Babu Vathachira et.al., [2511.14596v1](http://arxiv.org/abs/2511.14596v1)\n\n We investigate the impact of the Bondi--Hoyle--Lyttleton (BHL) accretion mechanism on the evolution of nova eruptions in symbiotic systems by systematically varying three key input parameters: the initial donor (asymptotic giant branch; AGB) mass, the initial white dwarf (WD) mass, and the initial binary separation ($a$). We explore models with AGB masses in the range $1.5$--$3.5\\,{\\rm M\\_{\\odot}}$, WD masses in the range $0.7$--$1.25\\,{\\rm M\\_{\\odot}}$, and separations in the range $1$--$8\\,{\\rm kR\\_{\\odot}}$. We find that all models exhibit a significant long-term orbital increase. This trend is primarily driven by the fact that approximately $99\\%$ of the AGB mass is lost from the system, either directly via a wind that is not accreted by the WD, or accreted onto the WD and subsequently ejected during nova eruptions. As a result, the secular orbital response to mass loss or mass transfer dominates over angular-momentum-loss sinks that could otherwise shrink the orbit, producing a consistent orbital widening. Consequently, all WD masses gradually decrease with time. More massive WDs achieve higher mass-transfer efficiencies and accretion rates, leading to slightly higher mass-retention efficiencies per nova. However, because higher accretion rates also produce more frequent eruptions, the total WD mass lost over the AGB lifetime is larger in these systems. We conclude that symbiotic systems transferring mass via the BHL mechanism are unlikely to be viable progenitors of Type Ia supernovae.\n\n", "2511.14578": "2025-11-18, **Point-symmetric morphology in supernova remnant G11.2-0.3: the jittering jets explosion mechanism**, Noam Soker et.al., [2511.14578v1](http://arxiv.org/abs/2511.14578v1)\n\n I identify a point-symmetric morphology in the core-collapse supernova (CCSN) remnant SNR G11.2-0.3 composed of three pairs of opposite morphological features, and attribute their shaping to three energetic pairs of jets during the explosion process in the frame of the jittering jets explosion mechanism (JJEM). The pairs of morphological features are two opposite rings, a strip of dense ejecta extending on both sides of the central pulsar PSR J1811-1925, and an ear-nozzle opposite structure. According to the JJEM, additional weaker pairs of jets may also have participated in the explosion. The jets' axis from the ear to the nozzle coincides with the axis of the presently active pulsar jets, which is the pulsar spin axis. The jets of this pair were the last that the newly born neutron star launched during the explosion, and the accretion disk that launched these jets spun up the neutron star in the same direction as the jets. The identification of a point-symmetric morphology in SNR G11.2-0.3 strengthens the claim that the JJEM is the primary explosion mechanism of CCSNe.\n\n", "2511.14332": "2025-11-18, **On the impact of the supernova subsamples in reducing the Hubble tension**, Gonçalo Martins et.al., [2511.14332v1](http://arxiv.org/abs/2511.14332v1)\n\n The persistent 4-6$σ$ difference between early- and late-time Hubble constant ($H\\_{0}$) measurements, known as the \"Hubble tension,\" is a major problem in modern cosmology. We study how differences in colour ($c$), stretch ($x\\_{1}$), and host galaxy properties-stellar mass ($M$) and specific star formation rate (sSFR)-between calibration and Hubble Flow (HF) Type Ia supernova (SN Ia) samples used by SH0ES affect SN luminosity standardization and $H\\_{0}$ estimates. We generate subsamples from both, estimating $H\\_{0}$, $M\\_{B}$, $α$, $β$, $Δ\\_{host}$, and $σ\\_{int}$. We use Kolmogorov-Smirnov to assess the consistency between subsamples and reveal how parameter estimates change as sample matching improves. The calibration sample is not fully representative of the HF sample, especially in $M$ and sSFR. Improving sample consistency leads to changes in $H\\_{0}$, $M\\_{B}$, $α$, and $σ\\_{int}$, though overall values remain broadly stable. Better-matched subsamples tend to yield a mass step consistent with zero within 1$σ$. By disentangling SN subpopulations, we find persistent differences in $H\\_{0}$ ($\\sim$2-3$σ$) and $M\\_{B}$ ($\\sim2σ$) between low- and high-stretch SNe: $H\\_{0} = 75.27 \\pm 1.18$ km s$^{-1}$ Mpc$^{-1}$ for low-stretch and $H\\_{0} = 71.25 \\pm 1.59$ km s$^{-1}$ Mpc$^{-1}$ for high-stretch, resulting in Hubble tensions of 6.07$σ$ and 2.52$σ$. These differences suggest SNe Ia subpopulations with varying dust and intrinsic colour not captured by a single $β$, impacting cosmology. Estimating a single $H\\_{0}$ for both subpopulations yields $H\\_{0} = 73.78 \\pm 2.17$ km s$^{-1}$ Mpc$^{-1}$, with a much larger uncertainty that lowers the Hubble tension from $5.87σ$ to $\\sim2.86σ$. Our results suggest that the mass step may arise from an over-correction of more than one SN subpopulation associated to different environments.\n\n", "2511.14235": "2025-11-18, **Spontaneous Symmetry Breaking as a Late-Time Trigger for Interacting Dark Energy**, Pradosh Keshav MV et.al., [2511.14235v1](http://arxiv.org/abs/2511.14235v1)\n\n Persistent tensions in the Hubble constant (H0) and the matter clustering parameter (S8) motivate late-time new physics that suppresses structure growth without significantly altering the background expansion history of the LambdaCDM model. We study a class of dark-sector dynamics in which a scalar dark energy field, governed by a Z2-symmetric quartic potential, interacts with dark matter through Yukawa and portal couplings. When the matter density drops below a critical threshold, a cosmological spontaneous symmetry breaking mechanism generates a time-dependent vacuum expectation value v(a) and activates an effective coupling eta(a). This creates a symmetric phase (a <= ac) identical to LambdaCDM at early times, and a broken phase (a > ac) in which eta(a) > 0 transfers energy from dark matter to dark energy, suppressing linear structure growth. Using RSD, BAO, cosmic chronometers, Pantheon+SH0ES supernovae, and compressed Planck distance priors, we compare a fixed LambdaCDM background with a self-consistent coupled-scalar evolution. The RSD-only analysis shows a strong shift: the dynamical background gives Omega\\_m ~ 0.31 +/- 0.10 and sigma8,0 ~ 0.59 +/- 0.01, while the fixed-background case gives Omega\\_m ~ 0.20 +/- 0.09 and sigma8,0 ~ 0.75 +/- 0.05. In the full joint fit, we obtain Omega\\_m = 0.29 +/- 0.01, H0 = 69.7 +/- 0.6 km s^-1 Mpc^-1, and sigma8,0 = 0.78 +/- 0.01. A late-time interaction triggered by spontaneous symmetry breaking can therefore damp structure growth and ease the S8 tension while leaving the expansion history and the inferred H0 essentially unchanged, suggesting distinct physical origins for the two tensions.\n\n", "2511.14126": "2025-11-18, **The Origin of the Mg-rich Supernova Remnant J0550-6823 and the Frequency of Similar Events in the Large Magellanic Cloud**, Yui Kuboike et.al., [2511.14126v1](http://arxiv.org/abs/2511.14126v1)\n\n Shell burning and internal mixing in massive stars play an important role in setting the initial conditions for core-collapse supernova explosions. In the late stages of stellar evolution, intense shell burning can cause distinct convective regions to merge, fundamentally restructuring the stellar interior. Although such phenomena are difficult to observe directly, the observation of ``Mg-rich'' supernova remnants (SNRs) has recently emerged as a potential signature of these events. In this study, we reanalyze X-ray observations of J0550--6823, a SNR in the Large Magellanic Cloud (LMC) and a new candidate Mg-rich SNR. Our spectral analysis confirms a low Ne/Mg mass ratio of $\\approx$1, and its classification as Mg-rich. By comparing the observational results with pre-supernova models, we suggest that the progenitor of J0550-6823 likely had an extended convective shell that reduces the Ne/Mg ratio prior to its explosion. Furthermore, we observe that $\\sim$2--3 Mg-rich SNRs exist in the LMC, suggesting that $\\lesssim$10--40\\% of massive stars in the LMC may have had an extended convective shell, similar to what we observed in J0550-6823. This fraction would be important for understanding the final stages of the evolution of massive stars and galactic chemical evolution.\n\n", "2511.14039": "2025-11-18, **Aspherical Remnants of Triple and Quadruple Detonations in Binary White Dwarfs**, Logan J. Prust et.al., [2511.14039v1](http://arxiv.org/abs/2511.14039v1)\n\n White dwarfs which explode by the double-detonation mechanism may have a binary white dwarf donor which is subsequently ignited by its collision with the ejecta. This results in the destruction of the donor via either the triple- or quadruple-detonation mechanism, adding significant mass to the resulting ejecta as well as modifying its structure and composition. We simulate the evolution of supernova remnants resulting from such detonations in a variety of binary progenitors and compare them against a double detonation with a surviving donor. Because of the time delay between the detonations of the two white dwarfs, high-velocity ejecta from the first explosion governs the first few centuries of remnant evolution, whereas at later times the dense core resulting from the donor detonation drives both the forward and reverse shocks to larger radii. The collision between the highest-velocity ejecta of the primary explosion and the donor carves a conical wake into the ejecta, which persists into the remnant phase regardless of whether or not the donor detonates. Our suite of simulated remnants are found to exhibit multiple distinguishing features of the explosion properties: a distinct X-ray morphology in the thermal emission and iron lines for triple detonations and smaller remnants with centrally-concentrated emission for double detonations. The remnants are also varied in their elemental abundances and distributions, particularly for lighter elements, but these have limited observational utility and are sensitive to the properties of the progenitor binary.\n\n"}}