{"neutrino": {"2504.16040": "2025-04-22, **Linking the KM3-230213A Neutrino Event to Dark Matter Decay and Gravitational Waves Signals**, Sarif Khan et.al., [2504.16040v1](http://arxiv.org/abs/2504.16040v1)\n\n The KM3NeT collaboration recently reported the detection of an ultra-high-energy neutrino event, dubbed KM3-230213A. This is the first observed neutrino event with energy of the order of $\\mathcal{O}(100)$PeV, the origin of which remains unclear. We interprete this high energy neutrino event results from the Dirac fermion dark matter (DM) $\\chi$ decay through the right-handed (RH) neutrino portal assuming the Type-I seesaw mechanism for neutrino masses and mixings. Fruthermore, dark matter $\\chi$ is assumed to charged under $U(1)\\_X$ dark gauge symmetry, which is sponetaneously broken by the vacuum expectation value of the dark Higgs $\\Phi$. In this scenario, the DM can decay into a pair of Standard Model (SM) particles for $v\\_\\Phi \\gg m\\_\\chi$, which we assume is the case. If the DM mass is around $440$ PeV with a lifetime $5\\times 10^{29}$ sec, it can account for the KM3-230213A event. However, such heavy DM cannot be produced through the thermal freeze-out mechanism due to overproduction and violation of unitarity bounds. We focus on the UV freeze-in production of DM through a dimension-5 operator, which helps in producing the DM dominantly in the early Universe. We have also found a set of allowed parameter values that can correctly account for the DM relic density and decay lifetime required to explain the KM3NeT signal. Moreover, we have generated the neutrino spectra from the two-body decay using the HDMSpectra package, which requires the dark Higgs vacuum expectations value (VEV) to be much larger than the DM mass. Finally, the large value of the dark Higgs field VEV opens up the possibility of generating GW spectra from cosmic strings. We have found a reasonable set of parameter values that can address the KM3NeT signal, yield the correct value of the DM relic density through freeze-in mechanism, and allow for possible detection of GW at future detectors.\n\n", "2504.16022": "2025-04-22, **Non-Renormalizable SU(5) GUTs: Leptoquark-Induced Neutrino Masses**, Ilja Doršner et.al., [2504.16022v1](http://arxiv.org/abs/2504.16022v1)\n\n We revisit the doublet-triplet splitting problem within the $SU(5)$ gauge group framework to advocate a viable regime with the light scalar leptoquark of the doublet-triplet splitting notoriety that is compatible with the current experimental bounds on partial proton decay lifetimes. We explicitly demonstrate, through a consistent use of higher-dimensional operators, how to implement suppression of baryon number violating interactions of the aforementioned color triplet. Our study thus offers an alternative approach to the doublet-triplet splitting problem as it removes a need for an extreme mass hierarchy between the partners residing in the same representation. We furthermore pursue two different extensions of two distinct symmetry breaking scenarios of $SU(5)$, one with a $24$-dimensional representation and the other one with a $75$-dimensional representation, to produce comparative study of novel consequences for the gauge coupling unification and the one-loop level neutrino mass generation. Our results point towards qualitatively novel $SU(5)$ scenarios, where the light scalar leptoquarks, responsible for the neutrino mass generation, might be even accessible at colliders and thus serve as an accelerator accessible portal to the high-scale physics.\n\n", "2504.16019": "2025-04-22, **Cosmic Clues from Amaterasu: Blazar-Driven Ultrahigh-Energy Cosmic Rays?**, Saikat Das et.al., [2504.16019v1](http://arxiv.org/abs/2504.16019v1)\n\n The detection of the 244 EeV Amaterasu event by the Telescope Array, one of the most energetic ultrahigh-energy cosmic rays (UHECRs; $E\\gtrsim0.1$ EeV) observed to date, invites scrutiny of its potential source. We investigate whether the nearby blazar PKS 1717+177, located within $2.5^\\circ$ of the reconstructed arrival direction, could explain the event under a proton-primary hypothesis. Using a one-zone jet model, we fit the multi-wavelength spectral energy distribution of the source, incorporating both leptonic and hadronic cascade emission from photohadronic interactions. Our model supports a cosmic-ray origin of the very-high-energy ($E\\gtrsim 100$ GeV) $\\gamma$-ray flux and predicts a subdominant neutrino flux, an order of magnitude lower than from TXS 0506+056. Under Lorentz invariance violation, protons above a specific energy can propagate over hundreds of Mpc without significant energy loss for certain parameter choices. In such a scenario, our analysis indicates negligible deflection in the Galactic magnetic field, implying a strong extragalactic magnetic field, placing a lower bound on the field strength. Our findings provide a compelling multi-messenger framework linking UHECRs, $\\gamma$ rays, and neutrinos and motivate targeted searches by current and future high-energy neutrino telescopes during increased $\\gamma$-ray or X-ray activity of this blazar.\n\n", "2504.15998": "2025-04-22, **Effects of the Matter Potential at One-Loop Level on Neutrino Oscillations in Long-Baseline Experiments**, Jihong Huang et.al., [2504.15998v1](http://arxiv.org/abs/2504.15998v1)\n\n In this work, we demonstrate that one-loop corrections to the matter potential for neutrino oscillations can significantly impact the sensitivity to neutrino mass ordering in long-baseline accelerator experiments. Using numerical simulations for the future experiment DUNE, we find that the statistical significance for excluding the incorrect mass ordering can be enhanced by $1.0\\sigma$--$1.2\\sigma$ if a one-loop correction of $5.8\\%$ -- predicted by the Standard Model in the on-shell renormalization scheme -- is included. Even with a smaller correction of $2.0\\%$, based instead on the Fermi coupling constant $G^{}\\_\\mu$ derived from measurements of muon lifetime, we show that the enhancement remains notable at about $0.4\\sigma$. In contrast, the sensitivity to leptonic CP violation in DUNE is essentially unchanged. Finally, we emphasize that one-loop corrections should be incorporated into analyses of future neutrino oscillation data in a consistent and systematic manner.\n\n", "2504.15892": "2025-04-22, **The accretion disk and neutrino pair annihilation process of Barrow-modified Black Hole**, Yuxuan Shi et.al., [2504.15892v1](http://arxiv.org/abs/2504.15892v1)\n\n This paper attempts to clarify the deep consequences of Barrow fractal black hole spacetime configurations caused by quantum gravity on neutrino pair annihilation and accretion disk dynamics. We systematically derive the analytical expression for the innermost stable circular orbit (ISCO) radius ($r\\_{\\text{ISCO}}\\propto M^{2/(2+\\Delta)}$) by building a Barrow-modified static spherically symmetric metric ($r\\rightarrow r^{1+\\Delta/2}$), and we find that increasing $\\Delta$ significantly shifts the ISCO inward. We numerically solve the radiation flux, effective temperature, and differential luminosity distribution under the modified metric based on the Novikov-Thorne relativistic thin accretion disk model. For $\\Delta=1$, the results show that the temperature increases by $62.5\\%$, the peak disk radiation flux increases by $22.5\\%$, and the spectral radiance increases by around $50\\%$. Fractal horizons enhance neutrino trajectory bending effects, according to further study of neutrino pair annihilation ($\\nu\\bar{\\nu}\\rightarrow e^+e^-$) energy deposition processes using local Lorentz transformations and null geodesic equations. The energy deposition rate for $\\Delta=1$ is $8-28$ times higher than classical estimates when the black hole radius is $R/M\\sim3-4$. This work provides important theoretical insights into the influence of quantum spacetime geometry on high-energy astrophysical phenomena in extreme gravitational fields by establishing, for the first time, quantitative relationships between the Barrow parameter $\\Delta$ and neutrino pair annihilation energy and accretion disk radiative efficiency.\n\n", "2504.15660": "2025-04-22, **Electroweak form factors of baryons in dense nuclear matter**, G. Ramalho et.al., [2504.15660v1](http://arxiv.org/abs/2504.15660v1)\n\n There are evidences that the properties of the hadrons are modified in a nuclear medium. Information about the medium modifications of the internal structure of the hadrons are fundamental for the study of dense nuclear matter and high energy processes including heavy-ion and nucleus-nucleus collisions. At the moment, however, the empirical information about the medium modifications of the hadrons is limited, therefore, theoretical studies are essential for the progress in the field. In the present work we review theoretical studies of the electromagnetic and axial form factors of octet baryons in symmetric nuclear matter. The calculations are based on a model that takes into account the degrees of freedom revealed on experimental studies of the low and intermediate square transfer momentum $q^2=-Q^2$: valence quarks and meson cloud excitations of the baryon cores. The formalism combines a covariant constituent quark model, developed for the free space (vacuum) with the quark-meson coupling model for the extension to the nuclear medium. We conclude that the nuclear medium modifies the baryon properties differently according to the flavor content of the baryons and the medium density. The effects of the medium increase with the density, and are stronger (quenched or enhanced) for light baryons than for heavy baryons. In particular, the in-medium neutrino-nucleon and antineutrino-nucleon cross sections are reduced compared to the values in free space. The proposed formalism can be extended to densities above the normal nuclear density and applied to neutrino-hyperon and antineutrino-hyperon scattering in dense nuclear matter.\n\n"}, "dark matter": {"2504.16044": "2025-04-22, **Search for Axionlike Dark Matter Using Liquid-State Nuclear Magnetic Resonance**, Julian Walter et.al., [2504.16044v1](http://arxiv.org/abs/2504.16044v1)\n\n We search for dark matter in the form of axionlike particles (ALPs) in the mass range $5.576741 \\,\\mathrm{neV/c^2}$ - $5.577733\\,\\mathrm{neV/c^2}$ by probing their possible coupling to fermion spins through the ALP field gradient. This is achieved by performing proton nuclear magnetic resonance spectroscopy on a sample of methanol as a technical demonstration of the Cosmic Axion Spin Precession Experiment Gradient (CASPEr-Gradient) Low-Field apparatus. Searching for spin-coupled ALP dark matter in this mass range with associated Compton frequencies in a 240 Hz window centered at 1.348570 MHz resulted in a sensitivity to the ALP-proton coupling constant of $g\\_{\\mathrm{ap}} \\approx 3 \\times 10^{-2}\\,\\mathrm{GeV}^{-1}$. This narrow-bandwidth search serves as a proof-of-principle and a commissioning measurement, validating our methodology and demonstrating the experiment's capabilities. It opens the door to probing large swaths of hitherto unexplored mass-coupling parameter space in the future by using hyperpolarized samples.\n\n", "2504.15902": "2025-04-22, **Density Profiles of TNG300 Voids across Cosmic Time**, Olivia Curtis et.al., [2504.15902v1](http://arxiv.org/abs/2504.15902v1)\n\n We present radial density profiles, as traced by luminous galaxies and dark matter particles, for voids in eleven snapshots of the \\texttt{TNG300} simulation. The snapshots span 11.65~Gyr of cosmic time, corresponding to the redshift range $0 \\le z \\le 3$. Using the comoving galaxy fields, voids were identified via a well-tested, watershed transformation-based algorithm. Voids were defined to be underdense regions that are unlikely to have arisen from Poisson noise, resulting in the selection of $\\sim100-200$ of the largest underdense regions in each snapshot. At all redshifts, the radial density profiles as traced by both the galaxies and the dark matter resemble inverse top-hat functions. However, details of the functions (particularly the underdensities of the innermost regions and the overdensities of the ridges) evolve considerably more for the dark matter density profiles than for the galaxy density profiles. At all redshifts, a linear relationship between the galaxy and dark matter density profiles exists, and the slope of the relationship is similar to the bias estimates for \\texttt{TNG300} snapshots. Lastly, we identify distinct environments in which voids can exist, defining ``void-in-void\" and ``void-in-cloud\" populations (i.e., voids that reside in larger underdense or overdense regions, respectively) and we investigate ways in which the relative densities of dark matter and galaxies in the interiors and ridges of these structures vary as a function of void environment.\n\n", "2504.15635": "2025-04-22, **Questioning Cosmic Acceleration with DESI: The Big Stall of the Universe**, Deng Wang et.al., [2504.15635v2](http://arxiv.org/abs/2504.15635v2)\n\n One of the most important discoveries in modern cosmology is cosmic acceleration. However, we find that today's universe could decelerate in the statistically preferred Chevallier-Polarski-Linder (CPL) scenario over the $\\Lambda$CDM model by cosmic microwave background, type Ia supernova and DESI's new measurements of baryon acoustic oscillations. Using various datasets, at a beyond $5\\,\\sigma$ confidence level, we demonstrate that the universe experiences a triple deceleration during its evolution and finally reaches the state of the ``Big Stall\", which predicts that: (i) the universe suddenly comes to a halt in the distant future; (ii) its eventual destiny is dominated by dark matter rather than dark energy ; (iii) it ultimately retains an extremely small fraction of dark energy but exerts an extremely large pressure. Our findings profoundly challenge the established understanding of cosmic acceleration and enrich our comprehension of cosmic evolution.\n\n", "2504.15633": "2025-04-22, **An analytic redshift-independent formulation of baryonic effects on the matter power spectrum**, Matthieu Schaller et.al., [2504.15633v1](http://arxiv.org/abs/2504.15633v1)\n\n Baryonic effects created by feedback processes associated with galaxy formation are an important, poorly constrained systematic effect for models of large-scale structure as probed by weak gravitational lensing. Upcoming surveys require fast methods to predict and marginalize over the potential impact of baryons on the total matter power spectrum. Here we use the FLAMINGO cosmological hydrodynamical simulations to test a recent proposal to approximate the matter power spectrum as the sum of the linear matter power spectrum and a constant multiple, $A\\_{\\rm mod}$, of the difference between the linear and non-linear gravity-only power spectra. We show that replacing this constant multiple with a one-parameter family of sigmoid functions of the wavenumber $k$ allows to us match the predictions of simulations with different feedback strengths for $z \\leq 1, k < 3~h\\cdot{\\rm Mpc}^{-1}$, and the different cosmological models in the FLAMINGO suite. The baryonic response predicted by FLAMINGO models that use jet-like AGN feedback instead of the fiducial thermally-driven AGN feedback can also be reproduced, but at the cost of increasing the number of parameters in the sigmoid function from one to three. The assumption that $A\\_{\\rm mod}$ depends only on $k$ breaks down for decaying dark matter models, highlighting the need for more advanced baryon response models when studying cosmological models that deviate strongly from $\\Lambda$CDM.\n\n"}, "supernova": {"2504.15988": "2025-04-22, **SN 2023vbg: A Type IIn Supernova Resembling SN 2009ip, with a Long-Duration Precursor and Early-Time Bump**, Sota Goto et.al., [2504.15988v1](http://arxiv.org/abs/2504.15988v1)\n\n Type IIn supernovae (SNe) resembling SN 2009ip (09ip-like SNe) originate from the interaction between circumstellar material (CSM) and the ejecta. This subclass not only shares similar observational properties around the maximum, but is commonly characterized by a long duration precursor before its maximum. Investigating the observed properties of the precursor provides constraints on the mass-loss history of the progenitor.We present observational data of SN 2023vbg, a 09ip-like type IIn SN that displayed unique observational properties compared to other 09ip-like SNe. SN 2023vbg showed a long-duration precursor at $M\\_g\\sim-14$ mag lasting for $\\sim100$ days, followed by a bright bump at $M\\_g\\sim-17$ mag at 12-25 days before the maximum. The luminosity of the precursor is similar to those of other 09ip-like SNe, but the bright bump has not been observed in other cases.After reaching the peak luminosity, the light curve exhibited a peculiar smooth decline.While the H$\\alpha$ profile displays two velocity components ($\\sim 500$ and $3000\\ \\mathrm{km\\ s^{-1}}$), a broad component observed in other 09ip-like SNe was not detected. We suggest that these properties are explained by the difference in the CSM structure as compared to other 09ip-like SNe; SN 2023vbg had an inner denser CSM component, as well as generally smooth CSM density distribution in a more extended scale, than in the others. Such diversity of CSM likely reflects the diversity of pre-SN outbursts, which in turn may mirror the range of evolutionary pathways in the final stages of the progenitors.\n\n", "2504.15959": "2025-04-22, **A Novel Relationship Between Gamma Ray Burst Duration And Photospheric Radius**, Ranadeep Ghosh Dastidar et.al., [2504.15959v1](http://arxiv.org/abs/2504.15959v1)\n\n Long Gamma Ray Bursts (lGRBs) are associated with jets in Type Ic broadline supernovae. The Collapsar model provides a theoretical framework for the jet formation from the core collapse of a massive star in such supernovae. The GRB can only be produced after a successful jet break out from the star. Under this formalism the GRB duration ($t\\_{\\rm{90}}$) has been hypothesized to be the difference between the central engine activity duration ($t\\_{\\rm{eng}}$) and the jet breakout time ($t\\_{\\rm{bo}}$), that is $t\\_{\\rm{90}} = t\\_{\\rm{eng}} - t\\_{\\rm{bo}}$. This disallows $t\\_{\\rm{90}} > t\\_{\\rm{eng}}$ and puts a lower bound on successful lGRB jet central engine duration ($t\\_{\\rm{eng}} > t\\_{\\rm{bo}}$), various numerical simulations have shown otherwise. This study considers a photospheric GRB emission from a relativistic jet punching out of a Wolf-Rayet-like star. We use the bolometric lightcurve generated to calculate the lGRB duration ($t\\_{\\rm{90}}$) for varying engine duration. We find for longer engine duration the lGRB lightcurve reflects the jet profile and $t\\_{\\rm{90}} \\approx t\\_{\\rm{eng}}$. While for shorter engine duration, the $t\\_{\\rm{90}}$ has photospheric radius ($R\\_{\\rm{ph}}$) dependence. This can be modeled by a relation, $t\\_{\\rm{90}} = t^{\\rm{90}}\\_{\\rm{eng}} + 0.03\\left(\\frac{R\\_{\\rm{ph}}}{c}\\right)$, where c is the speed of light, with a lower bound on $t\\_{\\rm{90}}$ for a successful lGRB. This relation should be most relevant for possible low-luminous lGRBs originating from a collapsar with central engine duration comparable to the jet breakout time.\n\n", "2504.15940": "2025-04-22, **Infrared and X-ray emission of a supernova remnant in a clumpy medium**, S. Yu. Dedikov et.al., [2504.15940v1](http://arxiv.org/abs/2504.15940v1)\n\n The infrared (IR) to X-ray luminosity ratio (IRX) is an indicator of the role of the dust plays in cooling of hot gas in supernova remnants (SNR). Using the 3D dynamics of gas and interstellar polydisperse dust grains we analyze the evolution of SNR in the inhomogeneous medium. We obtain spatial distributions of the surface brigthness both of the X-ray emission from hot gas inside SNR and the IR emission from the SNR swept-up shell, as well as, the average gas temperature in the SNR, $T\\_X$. We find that the IRX changes significantly (by a factor of $\\sim 3-30$) as a function of impact distance within the SNR and its age. In a low inhomogeneous medium the IRX drops rapidly during the SNR evolution. On the other hand, if large inhomogeneities are present in the medium, the IRX is maintained at higher levels during the late SNR evolution at radiative phase due to replenishment of dust in the hot gas by incompletely destroyed fragments behind the shock front. We show that the onset of the radiative phase determines the evolution of the $T\\_X - {\\rm IRX}$ diagram. We illustrate that decreasing gas metallicity or density leads to high values of temperature and IRX ratio. We discuss how our results can be applied to the observational data to analyse the SNR older than 10 kyr (i.e. when the mass of the swept-up dust in the shell is expected to exceed that produced in the SNR) in the Galaxy and Large Magellanic Cloud.\n\n", "2504.15739": "2025-04-22, **Development of an Ultra-fast, Likelihood-based, Distance Inference Framework for the Next Generation of Type Ia Supernova Surveys**, Dylan Kuhn et.al., [2504.15739v1](http://arxiv.org/abs/2504.15739v1)\n\n In this work, we present EDRIS (French for Distance Estimator for Incomplete Supernova Surveys), a cosmological inference framework tailored to reconstruct unbiased cosmological distances from type Ia supernovae light-curve parameters. This goal is achieved by including data truncation directly in the statistical model which takes care of the standardization of luminosity distances. It allows us to build a single-step distance estimate by maximizing the corresponding likelihood, free from the biases the survey detection limits would introduce otherwise. Moreover, we expect the current worldwide statistics to be multiplied by O(10) in the upcoming years. This provides a new challenge to handle as the cosmological analysis must stay computationally towable. We show that the optimization methods used in EDRIS allow for a reasonable time complexity of O($N^2$) resulting in a very fast inference process (O(10s) for 1500 supernovae).\n\n", "2504.15684": "2025-04-22, **Hydrogen-poor Superluminous Supernovae with Bumpy Light Curves Powered by Precessing Magnetars**, Biao Zhang et.al., [2504.15684v1](http://arxiv.org/abs/2504.15684v1)\n\n Recent observations and statistical studies have revealed that a significant fraction of hydrogen-poor superluminous supernovae (SLSNe-I) exhibit light curves that deviate from the smooth evolution predicted by the magnetar-powered model, instead showing one or more bumps after the primary peak. However, the formation mechanisms of these post-peak bumps remain a matter of debate. Furthermore, previous studies employing the magnetar-powered model have typically assumed a fixed magnetic inclination angle and neglected the effects of magnetar precession. However, recent research has shown that the precession of newborn magnetars forming during the collapse of massive stars causes the magnetic inclination angle to evolve over time, thereby influencing magnetic dipole radiation. In this paper, therefore, we incorporate the effects of magnetar precession into the magnetar-powered model to develop the precessing magnetar-powered model. Using this model, we successfully reproduce the multi-band light curves of 6 selected representative SLSNe-I with post-peak bumps. Moreover, the derived model parameters fall within the typical parameter range for SLSNe-I. By combining the precessing magnetars in SLSNe-I and long GRBs, we find that the ellipticity of magnetars is related to the dipole magnetic field strength, which may suggest a common origin for the two phenomena. Our work provides a potential explanation for the origin of post-peak bumps in SLSNe-I and offers evidence for the early precession of newborn magnetars formed in supernova explosions.\n\n", "2504.15635": "2025-04-22, **Questioning Cosmic Acceleration with DESI: The Big Stall of the Universe**, Deng Wang et.al., [2504.15635v2](http://arxiv.org/abs/2504.15635v2)\n\n One of the most important discoveries in modern cosmology is cosmic acceleration. However, we find that today's universe could decelerate in the statistically preferred Chevallier-Polarski-Linder (CPL) scenario over the $\\Lambda$CDM model by cosmic microwave background, type Ia supernova and DESI's new measurements of baryon acoustic oscillations. Using various datasets, at a beyond $5\\,\\sigma$ confidence level, we demonstrate that the universe experiences a triple deceleration during its evolution and finally reaches the state of the ``Big Stall\", which predicts that: (i) the universe suddenly comes to a halt in the distant future; (ii) its eventual destiny is dominated by dark matter rather than dark energy ; (iii) it ultimately retains an extremely small fraction of dark energy but exerts an extremely large pressure. Our findings profoundly challenge the established understanding of cosmic acceleration and enrich our comprehension of cosmic evolution.\n\n"}}