{"neutrino": {"2309.03889": "2023-09-07, **Neutron star cooling with lepton-flavor-violating axions**, Hong-Yi Zhang et.al., [2309.03889v1](http://arxiv.org/abs/2309.03889v1)\n\n The cores of dense stars are a powerful laboratory for studying feebly-coupled particles such as axions. Some of the strongest constraints on axionlike particles and their couplings to ordinary matter derive from considerations of stellar axion emission. In this work we study the radiation of axionlike particles from degenerate neutron star matter via a lepton-flavor-violating (LFV) coupling that leads to muon-electron conversion when an axion is emitted. We calculate the axion emission rate per unit volume (emissivity) and by comparing with the rate of neutrino emission, we infer upper limits on the LFV coupling that are at the level of $\\|g\\_{ae\\mu}\\| \\lesssim 10^{-6}$. For the hotter environment of a supernova, such as SN 1987A, the axion emission rate is enhanced and the limit is stronger, at the level of $\\|g\\_{ae\\mu}\\| \\lesssim 10^{-11}$, competitive with laboratory limits. Interestingly, our derivation of the axion emissivity reveals that axion emission via the LFV coupling is suppressed relative to the familiar lepton-flavor-preserving channels by a factor of $T^2 E\\_{F,e}^2 / (m\\_\\mu^2 - m\\_e^2)^2 \\sim T^2/m\\_\\mu^2$, which is responsible for the relatively weaker limits.\n\n", "2309.03870": "2023-09-07, **Anomalies in Particle Physics**, Andreas Crivellin et.al., [2309.03870v1](http://arxiv.org/abs/2309.03870v1)\n\n The currently accepted mathematical description of the fundamental constituents and interactions of matter is the Standard Model of particle physics. Its last missing particle, the famous Higgs boson, was observed at the Large Hadron Collider at CERN in 2012. However, it is clear that the Standard Model cannot be the ultimate theory of Nature, and e.g. cannot account for Dark Matter or non-vanishing neutrino masses (and does not include gravity). In fact, searches for physics beyond the SM have been intensified since the Higgs boson discovery. In this article, we review the hints for new physics, called ``anomalies'', obtained in particle physics experiments within the last years. We consider both direct high-energy searches for new resonances at the LHC and indirect low-energy precision experiments. These anomalies range from the nuclear scale (approximately the mass of the proton) to the electroweak scale (i.e. the mass of the Higgs boson) to the TeV scale (the highest scale directly accessible at the LHC), therefore spanning over four orders of magnitude. After discussing the experimental and theoretical status of the anomalies, we summarize possible explanations in terms of new particles and new interactions. In particular, new Higgs bosons and leptoquarks are promising candidates. Discovery prospects and implications for future colliders are discussed.\n\n", "2309.03526": "2023-09-07, **General-relativistic radiation transport scheme in Gmunu II: Implementation of novel microphysical library for neutrino radiation -- Weakhub**, Harry Ho-Yin Ng et.al., [2309.03526v1](http://arxiv.org/abs/2309.03526v1)\n\n We introduce \\texttt{Weakhub}, a novel neutrino microphysics library that provides opacities and kernels beyond conventional interactions used in the literature. This library includes neutrino-matter, neutrino-photon, and neutrino-neutrino interactions, along with corresponding weak and strong corrections. A full kinematics approach is adopted for the calculations of $\\beta$-processes, incorporating various weak corrections and medium modifications due to the nuclear equation of state. Calculations of plasma processes, electron neutrino-antineutrino annihilation, and nuclear de-excitation are included. We also present the detailed derivations of weak interactions and the coupling of them to the two-moment based general-relativistic multi-group radiation transport in the \\texttt{G}eneral-relativistic \\texttt{mu}ltigrid \\texttt{nu}merical (\\texttt{Gmunu}) code. We compare the neutrino opacity spectra for all interactions and estimate their contributions at hydrodynamical points in core-collapse supernova and binary neutron star postmerger remnant, and predict the effects of improved opacities in comparison to conventional ones for a binary neutron star postmerger at a specific hydrodynamical point. We test the implementation of the conventional set of interactions by comparing it to an open-source neutrino library \\texttt{NuLib} in a core-collapse supernova simulation. We demonstrate good agreement with discrepancies of less than $\\sim 10\\%$ in luminosity for all neutrino species, while also highlighting the reasons contributing to the differences. To compare the advanced interactions to the conventional set in core-collapse supernova modelling, we perform simulations to analyze their impacts on neutrino signatures, hydrodynamical behaviors, and shock dynamics, showing significant deviations.\n\n"}, "dark matter": {"2309.03894": "2023-09-07, **Rapid neutron star cooling triggered by accumulated dark matter**, Afonso Ávila et.al., [2309.03894v1](http://arxiv.org/abs/2309.03894v1)\n\n We study the effect of asymmetric fermionic dark matter (DM) on the thermal evolution of neutron stars (NSs). No interaction between DM and baryonic matter is assumed, except the gravitational one. Using the two-fluid formalism, we show that DM accumulated in the core of a star pulls inwards the outer baryonic layers of the star, increasing the baryonic density in the NS core. As a result, it significantly affects the star's thermal evolution by triggering an early onset of the direct Urca process and modifying the photon emission from the surface caused by the decrease of the radius. Thus, due to the gravitational pull of DM, the direct Urca process becomes kinematically allowed for stars with lower masses. Based on these results, we discuss the importance of NS observations at different distances from the Galactic center. Since the DM distribution peaks towards the Galactic center, NSs in this region are expected to contain higher DM fractions that could lead to a different cooling behavior.\n\n", "2309.03865": "2023-09-07, **Constraining Hot Dark Matter Sub-Species with Weak Lensing and the Cosmic Microwave Background Radiation**, Fabian Hervas Peters et.al., [2309.03865v1](http://arxiv.org/abs/2309.03865v1)\n\n Although it is well known that the bulk of dark matter (DM) has to be cold, the existence of an additional sub-dominant, hot species remains a valid possibility. In this paper we investigate the potential of the cosmic shear power spectrum to constrain such a mixed (hot plus cold) DM scenario with two additional free parameters, the hot-to-total DM fraction ($f\\_{\\rm hdm}$) and the thermal mass of the hot component ($m\\_{\\rm hdm}$). Running a Bayesian inference analysis for both the Kilo-Degree Survey cosmic shear data (KiDS) as well as the Cosmic Microwave Background (CMB) temperature and polarisation data from Planck, we derive new constraints for the mixed DM scenario. We find a 95 per cent confidence limit of $f\\_{\\rm hdm}<0.08$ for a very hot species of $m\\_{\\rm hdm}\\leq20$ eV. This constraint is weakened to $f\\_{\\rm hdm}<0.25$ for $m\\_{\\rm hdm}\\leq80$ eV. Scenarios with masses above $m\\_{\\rm hdm}\\sim200$ eV remain unconstrained by the data. Next to providing limits, we investigate the potential of mixed DM to address the clustering (or $S\\_8$) tension between lensing and the CMB. We find a reduction of the 2D ($\\Omega\\_m - S\\_8$) tension from 2.9$\\sigma$ to 1.6$\\sigma$ when going from a pure cold DM to a mixed DM scenario. When computing the 1D gaussian tension on $S\\_8$ the improvement is milder, from 2.4$\\sigma$ to 2.0$\\sigma$.\n\n", "2309.03712": "2023-09-07, **Prospects for $γ$-ray observations of the Perseus galaxy cluster with the Cherenkov Telescope Array**, The Cherenkov Telescope Array Consortium et.al., [2309.03712v1](http://arxiv.org/abs/2309.03712v1)\n\n Galaxy clusters are expected to be dark matter (DM) reservoirs and storage rooms for the cosmic-ray protons (CRp) that accumulate along the cluster's formation history. Accordingly, they are excellent targets to search for signals of DM annihilation and decay at gamma-ray energies and are predicted to be sources of large-scale gamma-ray emission due to hadronic interactions in the intracluster medium. We estimate the sensitivity of the Cherenkov Telescope Array (CTA) to detect diffuse gamma-ray emission from the Perseus galaxy cluster. We perform a detailed spatial and spectral modelling of the expected signal for the DM and the CRp components. For each, we compute the expected CTA sensitivity. The observing strategy of Perseus is also discussed. In the absence of a diffuse signal (non-detection), CTA should constrain the CRp to thermal energy ratio within the radius $R\\_{500}$ down to about $X\\_{500}<3\\times 10^{-3}$, for a spatial CRp distribution that follows the thermal gas and a CRp spectral index $\\alpha\\_{\\rm CRp}=2.3$. Under the optimistic assumption of a pure hadronic origin of the Perseus radio mini-halo and depending on the assumed magnetic field profile, CTA should measure $\\alpha\\_{\\rm CRp}$ down to about $\\Delta\\alpha\\_{\\rm CRp}\\simeq 0.1$ and the CRp spatial distribution with 10% precision. Regarding DM, CTA should improve the current ground-based gamma-ray DM limits from clusters observations on the velocity-averaged annihilation cross-section by a factor of up to $\\sim 5$, depending on the modelling of DM halo substructure. In the case of decay of DM particles, CTA will explore a new region of the parameter space, reaching models with $\\tau\\_{\\chi}>10^{27}$s for DM masses above 1 TeV. These constraints will provide unprecedented sensitivity to the physics of both CRp acceleration and transport at cluster scale and to TeV DM particle models, especially in the decay scenario.\n\n", "2309.03706": "2023-09-07, **Constraining light dark matter and mediator with $B^+ \\rightarrow K^+ ν\\bar ν$ data**, Murat Abdughani et.al., [2309.03706v1](http://arxiv.org/abs/2309.03706v1)\n\n We study the decay of $B^+$ meson into $K^+$ plus a light mediator $\\phi$ followed by production of dark matter (DM) pair $\\bar \\chi \\chi$, which can mimic the flavor changing neural current (FCNC) process of $B^+ \\rightarrow K^+ \\nu \\bar \\nu$ in the standard model (SM). Constraints from DM relic density, direct detection, collider and $B-$physics data combined with the recently reported $B^+\\rightarrow K^+ \\nu \\bar \\nu$ branching ratio performed at the Belle II experiment, we analyse couplings between the mediator and the SM fermions as well as the dark matter particle. We obtain that: if the process $\\phi \\rightarrow \\bar \\chi \\chi$ is kinematically allowed, i.e. $m\\_\\phi > 2m\\_\\chi$, then $m\\_\\phi$ should be larger than mass of the muon pair; Otherwise, $\\phi$ should play the role of missing energy, and only allowed decaying channel is $\\phi \\rightarrow e^+ e^-$.\n\n", "2309.03675": "2023-09-07, **$f(T)$ cosmology in the regime of quasar observations**, Rodrigo Sandoval-Orozco et.al., [2309.03675v1](http://arxiv.org/abs/2309.03675v1)\n\n The open problems related to cosmological tensions in current times have opened new paths to study new probes to constrain cosmological parameters in standard and extended cosmologies, in particular, to determine at a local level the value of the Hubble constant $H\\_0$, through independent techniques. However, while standard Cosmological Constant Cold Dark Matter ($\\Lambda$CDM) model has been well constrained and parts of extended cosmology have been intensively studied, the physics behind them aspects restrains our possibilities of selecting the best cosmological model that can show a significant difference from the first model. Therefore, to explore a possible deviation from a such model that can explain the current discrepancy on the $H\\_0$ value, in this work we consider adding the current local observables, e.g. Supernovae Type Ia (SNIa), $H(z)$ measurements, and Baryon Acoustic Observations (BAO) combined with two new calibrated Quasars (QSO) datasets using ultraviolet, x-ray and optical plane techniques. While these can be identified as part of the high-redshift standard candle objects, the main characteristics of these are based on fluxes distributions calibrated up to $z \\sim 7 $. We consider five $H\\_0$ prior scenarios to develop these calibrations. Furthermore, we found that our estimations provide the possibility to relax the $H\\_0$ tension at 2$\\sigma$ using a QSO ultraviolet sample in combination with late measurements showing higher values of $H\\_0$. Our results can be an initial start for more serious treatments in the quasars physics from ultraviolet, x-ray, and optical plane techniques behind the local observations as cosmological probes to relax the cosmological tensions problems.\n\n"}, "supernova": {"2309.03675": "2023-09-07, **$f(T)$ cosmology in the regime of quasar observations**, Rodrigo Sandoval-Orozco et.al., [2309.03675v1](http://arxiv.org/abs/2309.03675v1)\n\n The open problems related to cosmological tensions in current times have opened new paths to study new probes to constrain cosmological parameters in standard and extended cosmologies, in particular, to determine at a local level the value of the Hubble constant $H\\_0$, through independent techniques. However, while standard Cosmological Constant Cold Dark Matter ($\\Lambda$CDM) model has been well constrained and parts of extended cosmology have been intensively studied, the physics behind them aspects restrains our possibilities of selecting the best cosmological model that can show a significant difference from the first model. Therefore, to explore a possible deviation from a such model that can explain the current discrepancy on the $H\\_0$ value, in this work we consider adding the current local observables, e.g. Supernovae Type Ia (SNIa), $H(z)$ measurements, and Baryon Acoustic Observations (BAO) combined with two new calibrated Quasars (QSO) datasets using ultraviolet, x-ray and optical plane techniques. While these can be identified as part of the high-redshift standard candle objects, the main characteristics of these are based on fluxes distributions calibrated up to $z \\sim 7 $. We consider five $H\\_0$ prior scenarios to develop these calibrations. Furthermore, we found that our estimations provide the possibility to relax the $H\\_0$ tension at 2$\\sigma$ using a QSO ultraviolet sample in combination with late measurements showing higher values of $H\\_0$. Our results can be an initial start for more serious treatments in the quasars physics from ultraviolet, x-ray, and optical plane techniques behind the local observations as cosmological probes to relax the cosmological tensions problems.\n\n"}}