{"neutrino": {"2502.08508": "2025-02-12, **On the potential cosmogenic origin of the ultra-high-energy event KM3-230213A**, The KM3NeT collaboration et.al., [2502.08508v1](http://arxiv.org/abs/2502.08508v1)\n\n On the 13th February 2023 the KM3NeT/ARCA telescope observed a track-like event compatible with a ultra-high-energy muon with an estimated energy of 120 PeV, produced by a neutrino with an even higher energy, making it the most energetic neutrino event ever detected. A diffuse cosmogenic component is expected to originate from the interactions of ultra-high-energy cosmic rays with ambient photon and matter fields. The flux level required by the KM3NeT/ARCA event is however in tension with the standard cosmogenic neutrino predictions based on the observations collected by the Pierre Auger Observatory and Telescope Array over the last decade of the ultra-high-energy cosmic rays above the ankle (hence from the local Universe, $z\\lesssim 1$). We show here that both observations can be reconciled by extending the integration of the equivalent cosmogenic neutrino flux up to a redshift of $z\\simeq 6$ and assuming a subdominant fraction of protons in the ultra-high-energy cosmic-ray flux, thus placing constraints on known cosmic accelerators.\n\n", "2502.08493": "2025-02-12, **DUNE: science and status**, Francisco Martínez López et.al., [2502.08493v1](http://arxiv.org/abs/2502.08493v1)\n\n The Deep Underground Neutrino Experiment (DUNE) is a next-generation long-baseline neutrino oscillation experiment. Its primary goal is the determination of the neutrino mass hierarchy and the CP-violating phase. The DUNE physics program also includes the detection of astrophysical neutrinos and the search for beyond the Standard Model phenomena, such as nucleon decays. DUNE will consist of a near detector complex placed at Fermilab, several hundred meters downstream of the neutrino production point, and 17-kton Liquid Argon Time Projection Chamber (LArTPC) far detector modules to be built in the Sanford Underground Research Facility (SURF), approximately 1.5 km underground and 1300 km away. The detectors will be exposed to a wide-band neutrino beam generated by a 1.2 MW proton beam, with a planned upgrade to 2.4 MW. Two prototypes of the FD technology, the ProtoDUNE 700 ton LArTPCs, have been operated at CERN for over 2 years, and have been recently optimized to take new data in 2024-2025. Additionally, the 2x2 Demonstrator, a prototype of the LAr component of the near detector, has recently started operations in the NuMI beam at Fermilab. This talk will present the science programme, as well as recent progress, of DUNE and its different prototyping efforts.\n\n", "2502.08484": "2025-02-12, **Characterising Candidate Blazar Counterparts of the Ultra-High-Energy Event KM3-230213A**, KM3NeT Collaboration et.al., [2502.08484v1](http://arxiv.org/abs/2502.08484v1)\n\n The KM3NeT experiment reported the detection of an ultra-high-energy neutrino with an energy estimate of ~ 220 PeV, the most energetic yet observed. The neutrino arrival direction has a 99% confidence region of 3{\\deg} radius centred at RA 94.3{\\deg}, Dec -7.8{\\deg} (J2000). High-energy astrophysical neutrinos are a crucial messenger for understanding hadronic acceleration processes in the Universe and for identifying the origin of ultra-high-energy cosmic rays. Among the most powerful cosmic accelerators, blazars are proposed as promising neutrino sources. A sample of seventeen candidate blazars located in this region is selected through their multiwavelength properties, and studied using archival data and dedicated observations. One of the candidate counterparts exhibits a radio flare coinciding with the neutrino arrival time, with a pre-trial chance probability of 0.26%. Another candidate counterpart exhibits a rising trend in the X-ray flux in a one-year window around the neutrino arrival time. A third candidate undergoes a gamma-ray flare during the same period. While none of these candidates can conclusively be linked to the neutrino, the implications of a possible blazar origin for the KM3NeT event are discussed.\n\n", "2502.08387": "2025-02-12, **On the Potential Galactic Origin of the Ultra-High-Energy Event KM3-230213A**, O. Adriani et.al., [2502.08387v1](http://arxiv.org/abs/2502.08387v1)\n\n The KM3NeT observatory detected the most energetic neutrino candidate ever observed, with an energy between 72 PeV and 2.6 EeV at the 90% confidence level. The observed neutrino is likely of cosmic origin. In this article, it is investigated if the neutrino could have been produced within the Milky Way. Considering the low fluxes of the Galactic diffuse emission at these energies, the lack of a nearby potential Galactic particle accelerator in the direction of the event and the difficulty to accelerate particles to such high energies in Galactic systems, we conclude that if the event is indeed cosmic, it is most likely of extragalactic origin.\n\n", "2502.08173": "2025-02-12, **The ultra-high-energy event KM3-230213A within the global neutrino landscape**, KM3NeT Collaboration et.al., [2502.08173v1](http://arxiv.org/abs/2502.08173v1)\n\n On February 13th, 2023, the KM3NeT/ARCA telescope detected a neutrino candidate with an estimated energy in the hundreds of PeVs. In this article, the observation of this ultra-high-energy neutrino is discussed in light of null observations above tens of PeV from the IceCube and Pierre Auger observatories. Performing a joint fit of all experiments under the assumption of an isotropic $E^{-2}$ flux, the best-fit single-flavour flux normalisation is $E^2 \\Phi^{\\rm 1f}\\_{\\nu + \\bar \\nu} = 7.5 \\times 10^{-10}~{\\rm GeV cm^{-2} s^{-1} sr^{-1}}$ in the 90% energy range of the KM3NeT event. Furthermore, the ultra-high-energy data are then fit together with the IceCube measurements at lower energies, either with a single power law or with a broken power law, allowing for the presence of a new component in the spectrum. The joint fit including non-observations by other experiments in the ultra-high-energy region shows a slight preference for a break in the PeV regime if the ``High-Energy Starting Events'' sample is included, and no such preference for the other two IceCube samples investigated. A stronger preference for a break appears if only the KM3NeT data is considered in the ultra-high-energy region, though the flux resulting from such a fit would be inconsistent with null observations from IceCube and Pierre Auger. In all cases, the observed tension between KM3NeT and other datasets is of the order of $2.5\\sigma-3\\sigma$, and increased statistics are required to resolve this apparent tension and better characterise the neutrino landscape at ultra-high energies.\n\n"}, "dark matter": {"2502.08466": "2025-02-12, **Searching for Nearby Diffuse Dwarf Galaxies in the COSMOS Field**, Dongdong Shi et.al., [2502.08466v1](http://arxiv.org/abs/2502.08466v1)\n\n It remains challenging to systematically survey nearby diffuse dwarf galaxies and address the formation mechanism of this population distinguishing from regular ones. We carry out a pilot search for these galaxies in the COSMOS field using the deep \\textit{HST}/F814W imaging data. We report three diffuse dwarf galaxies satisfying the criteria: (1) redshift $z<0.2$, (2) effective radius $r\\_{\\rm e}>1.0''$, and (3) central surface brightness $\\mu\\_{\\rm 0}>24$ mag arcsec$^{-2}$. Two of the three galaxies, COSMOS-UDG1 and COSMOS-UDG2, are recognized as ultra-diffuse galaxies (UDGs) with redshift $z=0.130$ and $0.049$, respectively. The third galaxy, COSMOS-dw1, is spectroscopically confirmed as a dwarf galaxy at $z=0.004$. We derive the physical properties through fitting their spectral energy distributions (SEDs) extracted from deep multiwavelength observations. COSMOS-dw1 has a stellar mass of $5.6\\_{-2.7}^{+2.5}\\times10^{6}$ M$\\_{\\odot}$, harboring neutral hydrogen gas of mass $4.90\\pm0.90\\times10^{6}$ M$\\_{\\odot}$, hinting that this galaxy may be in the nascent stages of quenching. The estimated dynamical mass of $3.4\\times10^{7}\\,M\\_{\\odot}$ further suggests that COSMOS-dw1 is predominantly of dark matter. COSMOS-UDG1 and COSMOS-UDG2 exhibit comparable stellar masses of $\\sim 2\\times10^{8}$ M$\\_{\\odot}$. Notably, COSMOS-UDG1 is younger and more metal-rich than COSMOS-UDG2 and COSMOS-dw1. Conversely, COSMOS-UDG2 and COSMOS-dw1 have similar stellar metallicities, yet COSMOS-UDG2 is older than COSMOS-dw1. All three galaxies adhere to the stellar mass-metallicity relation (MZR) for dwarf galaxies in the local Universe, implying they belong to the dwarf galaxy population.\n\n", "2502.08444": "2025-02-12, **Analysis of the weak lensing mass-richness relation of redMaPPer clusters in the LSST DESC DC2 simulations**, Constantin Payerne et.al., [2502.08444v1](http://arxiv.org/abs/2502.08444v1)\n\n Cluster scaling relations are key ingredients in cluster abundance-based cosmological studies. In optical cluster cosmology, weak gravitational lensing has proven to be a powerful tool to constrain the cluster mass-richness relation. This work is conducted as part of the Dark Energy Science Collaboration (DESC), which aims to analyze the Legacy Survey of Space and Time (LSST) of Vera C. Rubin Observatory, starting in 2026. Weak lensing-inferred cluster properties, such as mass, suffer from several sources of bias. In this paper, we aim to test the impact of modeling choices and observational systematics in cluster lensing on the inference of the mass-richness relation. We constrain the mass-richness relation of 3,600 clusters detected by the redMaPPer algorithm in the cosmoDC2 extra-galactic mock catalog (covering $440$ deg$^2$) of the LSST DESC DC2 simulation, using number count measurements and stacked weak lensing profiles in several intervals of richness ($20 \\leq \\lambda \\leq 200$) and redshift ($0.2 \\leq z \\leq 1$). By modeling the mean of the scaling relation as $\\langle \\ln \\lambda\\|M\\_{\\rm 200c}, z\\rangle = \\ln\\lambda\\_0 + \\mu\\_z\\log[(1+z)/(1+0.5)] + \\mu\\_m[\\log\\_{10}(M\\_{\\rm 200c}) - 14.3]$, our baseline constraints are $\\ln\\lambda\\_0 = 3.37\\pm 0.03$, $\\mu\\_z = 0.08\\pm 0.07$ and $\\mu\\_m = 2.18 \\pm 0.07$. We have found that, for a LSST-like source galaxy density, our constraints are robust to a change in concentration-mass relation and dark matter density profile modeling choices, when source redshifts and shapes are perfectly known. We have found that photometric redshift uncertainties can introduce bias at the $1\\sigma$ level, which can be mitigated by an overall correcting factor, fitted jointly with scaling parameters. We find that including positive shear-richness covariance in the fit shifts the results by up to 0.5$\\sigma$.\n\n", "2502.08164": "2025-02-12, **Dynamical Models of the Milky Way in Action Space with LAMOST DR8 and GAIA EDR3**, Guang-Chen Sun et.al., [2502.08164v2](http://arxiv.org/abs/2502.08164v2)\n\n This work explores dynamical models of the Milky Way (MW) by analyzing a sample of 86,109 K giant stars selected through cross-matching the LAMOST DR8 and Gaia EDR3 surveys. Our earlier torus models in Wang et al. (2017) did not include Gaia data, making them incompatible with the new proper motion distributions of samples. Here, we refine the construction of action-based, self-consistent models to constrain the three-dimensional velocity distribution of K giants over a larger parameter space, drawing on a series of existing MW models. This approach produces several new MW models. Our best-fit model for the local kinematics near the Sun indicates a MW virial mass of 1.35 $\\times 10^{12} M\\_\\odot$, a local stellar density of 0.0696 $\\rm M\\_\\odot pc^{-3}$, and a local dark matter density of 0.0115 $\\rm M\\_\\odot pc^{-3}$. Our main conclusion supports a thicker and more extended thick disk, alongside a cooler thin disk, compared to the best-fitting model in Wang et al. (2017). Near the Sun, our model aligns well with observations, but is less satisfactory at distances far from the Galactic center, perhaps implying unidentified structures. Further high-precision observations will be critical for understanding the dynamics in these outer Galactic regions, and will require a more realistic model.\n\n"}, "supernova": {"2502.08385": "2025-02-12, **Field-level inference of $H_0$ from simulated type Ia supernovae in a local Universe analogue**, Eleni Tsaprazi et.al., [2502.08385v1](http://arxiv.org/abs/2502.08385v1)\n\n Two particular challenges face type Ia supernovae (SNeIa) as probes of the expansion rate of the Universe. One is that they may not be fair tracers of the matter velocity field, and the second is that their peculiar velocities distort the Hubble expansion. Although the latter has been estimated at $\\lesssim1.5\\%$ for $z>0.023$, this is based either on constrained linear or unconstrained non-linear velocity modelling. In this paper, we address both challenges by incorporating a physical model for the locations of supernovae, and develop a Bayesian Hierarchical Model that accounts for non-linear peculiar velocities in our local Universe, inferred from a Bayesian analysis of the 2M++ spectroscopic galaxy catalogue. With simulated data, the model recovers the ground truth value of the Hubble constant $H\\_0$ in the presence of peculiar velocities including their correlated uncertainties arising from the Bayesian inference, opening up the potential of including lower redshift SNeIa to measure $H\\_0$. Ignoring peculiar velocities, the inferred $H\\_0$ increases minimally by $\\sim 0.4 \\pm 0.5$ km s$^{-1}$ Mpc$^{-1}$ in the range $0.023<z<0.046$. We conclude it is unlikely that the $H\\_0$ tension originates in unaccounted-for non-linear velocity dynamics.\n\n"}}