{"neutrino": {"2504.07819": "2025-04-10, **Testing Leptogenesis from Observable Gravitational Waves**, Wei Liu et.al., [2504.07819v1](http://arxiv.org/abs/2504.07819v1)\n\n Leptogenesis provides an elegant mechanism to explain the observed baryon asymmetry of the Universe (BAU), yet its experimental verification remains challenging due to requirements of either extremely heavy right-handed neutrinos or precisely fine-tuned mass splittings. We adapt a solution by introducing an extra scalar field that significantly enhances $CP$ asymmetry through loop-level contributions. This scalar extension not only facilitates successful leptogenesis but also enables a strong first-order electroweak phase transition, generating potentially observable gravitational waves (GWs). We demonstrate a strong correlation between the generated BAU and the GW signal strength, establishing a unique way to test the leptogenesis. We show that when the model achieves a successful BAU, the resulting GW signal from EWPT can have signal-to-noise ratio of $\\mathcal{O}(10^3)$ and $\\mathcal{O}(10^6)$ at the upcoming LISA and DECIGO experiments, respectively. This work presents a concrete connection between successful leptogenesis and detectable GWs, offering a promising method for experimental testing of the leptogenesis mechanism through future GW observations.\n\n", "2504.07816": "2025-04-10, **The effect of background matter on the spin oscillations of neutrinos scattered by the supermassive black hole**, Mridupawan Deka et.al., [2504.07816v1](http://arxiv.org/abs/2504.07816v1)\n\n We study spin oscillations of neutrinos in relativistic moving matter inside an accretion disk. These neutrinos are gravitationally scattered off a spinning Kerr black hole surrounded by a thick accretion disk. The disk can co-rotate and counter-rotate with respect to BH spin. We perform numerical simulations of the propagation of a large number of incoming test neutrinos. We briefly discuss our results.\n\n", "2504.07805": "2025-04-10, **Symmetry energy dependence of the bulk viscosity of nuclear matter**, Yumu Yang et.al., [2504.07805v1](http://arxiv.org/abs/2504.07805v1)\n\n We clarify how the weak-interaction-driven bulk viscosity $\\zeta$ and the bulk relaxation time $\\tau\\_\\Pi$ of neutrino-transparent $npe$ matter depend on the nuclear symmetry energy. We show that, at saturation density, the equation-of-state dependence of these transport quantities is fully determined by the experimentally constrained nuclear symmetry energy $S$ and its slope $L$. Variations of $L$ within current experimental uncertainties can change the (frequency-independent) bulk viscosity by orders of magnitude. This suggests that dissipative effects encoded in the gravitational-wave signatures of binary neutron star inspirals may help constrain nuclear symmetry energy properties.\n\n", "2504.07762": "2025-04-10, **Millimeter emission from supermassive black hole coronae**, S. del Palacio et.al., [2504.07762v1](http://arxiv.org/abs/2504.07762v1)\n\n Active Galactic Nuclei (AGN) host accreting supermassive black holes (SMBHs). The accretion can lead to the formation of a hot, X-ray emitting corona close to the SMBH capable of accelerating relativistic electrons. Observations in the millimetre (mm) band can probe its synchrotron emission. We provide a framework to derive physical information of SMBH coronae by modelling their spectral energy distribution (SED) from radio to far infrared frequencies. We also explore the possibilities of deriving additional information from mm observations, such as the SMBH mass, and studying high-redshift lensed sources. We introduce a corona emission model based on a one-zone spherical region with a hybrid thermal and non-thermal plasma. We investigate in detail how the corona SED depends on different parameters such as size, opacity, and magnetic field strength. Other galactic emission components from dust, ionised gas and diffuse relativistic electrons are also included in the SED fitting scheme. We apply our code consistently to a sample of radio-quiet AGN with strong indications of a coronal component in the mm. The detected mm emission from SMBH coronae is consistent with having a non-thermal relativistic particle population with an energy density that is ~0.5-10% of that in the thermal plasma. This requires magnetic energy densities close to equipartition with the thermal gas, and corona sizes of 60-250 gravitational radii. The model can also reproduce the observed correlation between mm emission and SMBH mass when accounting for uncertainties in the corona size. The mm band offers a unique window into the physics of SMBH coronae, enabling the study of highly dust-obscured sources and high-redshift lensed quasars. Gaining a deeper understanding of the relativistic particle population in SMBH coronae can provide key insights into their potential multiwavelength and neutrino emission.\n\n", "2504.07193": "2025-04-09, **Strongly coupled inert scalar sector with radiative neutrino masses**, A. E. Cárcamo Hernández et.al., [2504.07193v1](http://arxiv.org/abs/2504.07193v1)\n\n We explore the phenomenological implications of a model with an extended scalar sector, incorporating strongly coupled inert Higgs doublets. The model introduces three Higgs doublets: one interacting with the $SU(2)$ symmetry of the Standard Model and two inert doublets belonging to a strongly interacting sector, within the $SU(2)\\_2 \\times SU(2)\\_1 \\times U(1)\\_Y$ electroweak gauge symmetry, which is supplemented by the spontaneously broken $\\mathbb{Z}\\_2$ and preserved $\\mathbb{Z}\\_2'$ discrete symmetries. In this model, the top quark and exotic fermion masses arise from renormalizable Yukawa interactions at tree level, the masses of the SM charged fermions lighter than the top quark are generated via a tree-level seesaw mechanism, and the tiny neutrino masses emerge from a one-loop-level radiative seesaw mechanism. The model is consistent with constraints from charged lepton flavor-violating processes, electroweak precision observables, and the Higgs diphoton decay rate, as well as with the constraints resulting from the Higgs trilinear self-coupling. Furthermore, it successfully complies with the constraints arising from the $95$ GeV diphoton excess.\n\n", "2504.07178": "2025-04-09, **Primordial neutrinos fade to gray: constraints from cosmological observables**, Gabriela Barenboim et.al., [2504.07178v1](http://arxiv.org/abs/2504.07178v1)\n\n We investigate the effect of potentially large distortions of the relic neutrino spectra on cosmological observables.To that end, we consider a phenomenological model of \"gray\" spectral distributions, described by a single parameter which generalizes the traditional $y$-distortions to possibly large negative values. Implementing these distortions in the primordial nucleosynthesis code PRIMAT, we can constrain the distortion parameter along with the presence of extra radiation, exploiting the complementarity of big bang nucleosynthesis and cosmic microwave background measurements to disentangle gravitational and non-thermal effects. These constraints rule out a distortion where more than $\\sim 1/2$ of the neutrinos energy density is replaced by dark radiation. Nonetheless, we find that large distortions, accompanied by extra radiation, are allowed-and even slightly preferred in some cases-by current cosmological observations. As this scenario would require substantial modifications to the physics of neutrino decoupling in the early Universe, these observational constraints call for a renewed attention on the possibility of large deviations from the standard cosmological model in the neutrino sector.\n\n", "2504.06857": "2025-04-09, **Machine Learning-Assisted Unfolding for Neutrino Cross-section Measurements**, Roger G. Huang et.al., [2504.06857v1](http://arxiv.org/abs/2504.06857v1)\n\n The choice of unfolding method for a cross-section measurement is tightly coupled to the model dependence of the efficiency correction and the overall impact of cross-section modeling uncertainties in the analysis. A key issue is the dimensionality used in unfolding, as the kinematics of all outgoing particles in an event typically affect the reconstruction performance in a neutrino detector. OmniFold is an unfolding method that iteratively reweights a simulated dataset, using machine learning to utilize arbitrarily high-dimensional information, that has previously been applied to proton-proton and proton-electron datasets. This paper demonstrates OmniFold's application to a neutrino cross-section measurement for the first time using a public T2K near detector simulated dataset, comparing its performance with traditional approaches using a mock data study.\n\n", "2504.06692": "2025-04-09, **SHiP experiment at the SPS Beam Dump Facility**, SHiP Collaboration et.al., [2504.06692v1](http://arxiv.org/abs/2504.06692v1)\n\n In 2024, the SHiP experiment, together with the associated Beam Dump Facility (BDF) under the auspices of the High Intensity ECN3 (HI-ECN3) project, was selected for the future physics exploitation of the ECN3 experimental facility at the SPS. The SHiP experiment is a general-purpose intensity-frontier setup designed to search for physics beyond the Standard Model in the domain of Feebly Interacting Particles at the GeV-scale. It comprises a multi-system apparatus that provides discovery sensitivity to both decay and scattering signatures of models with feebly interacting particles, such as dark-sector mediators, both elastic and inelastic light dark matter, as well as millicharged particles. The experiment will also be able to perform both Standard Model measurements and Beyond Standard Model searches with neutrino interactions. In particular, it will have access to unprecedented statistics of tau and anti-tau neutrinos. The construction plan foresees commissioning of the facility and detector, and start of operation in advance of Long Shutdown 4, with a programme of exploration for 15 years of data taking. By exploring unique regions of parameter space for feebly interacting particles in the GeV/c$^2$ mass range, the SHiP experiment will complement ongoing searches at the LHC and searches at future colliders.\n\n", "2504.06599": "2025-04-09, **Axionless Solution to the Strong CP Problem -- two-zeros textures of the quark and lepton mass matrices and neutrino CP violation --**, Morimitsu Tanimoto et.al., [2504.06599v1](http://arxiv.org/abs/2504.06599v1)\n\n CP invariance is a very attractive solution to the strong CP problem in QCD. This solution requires the vanishing ${\\rm arg}\\,[{\\rm det}\\, M\\_d\\, {\\rm det} M\\_u]$, where the $M\\_d$ and $M\\_u$ are the mass matrices for the down- and up-type quarks. It happens if we have several zeros in the quark mass matrices. We proceed a systematic construction, in this paper, of two zeros textures for the down-type quark mass matrix while the mass matrix for the up-type quarks is always diagonal. We find only three types of the mass matrices can explain the observed CKM matrix, the masses of the quarks and the charged leptons and the small enough vacuum angle $\\theta < 10^{-10}$. We extend the mass construction to the neutrino sector and derive predictions on the CP violating parameter $\\delta\\_{CP}$ in the neutrino oscillation and the mass parameter $m\\_{\\beta\\beta}$. It is extremely remarkable that the normal (NH) and inverted (IH) hierarchies in the neutrino masses are equally possible in the case where we introduce only two right-handed neutrinos $N$s. Furthermore, we have a strict prediction on the $\\delta\\_{CP} \\simeq 200^\\circ$ or $250^\\circ$ in the NH case. If it is the case we can naturally explain the positive sign of the baryon asymmetry in the present universe.\n\n"}, "dark matter": {"2504.07890": "2025-04-10, **Stupendously Large Primordial Black Holes from the QCD axion**, Miguel Faria et.al., [2504.07890v1](http://arxiv.org/abs/2504.07890v1)\n\n The inflationary diffusion of (pseudo-)scalar fields with discrete symmetries can seed the formation of a gas of closed domain walls after inflation, when the distance between degenerate minima in field space is not too far from the inflationary Hubble scale. Primordial black holes (PBHs) can then be formed once sufficiently heavy domain walls re-enter the Hubble sphere. In this scenario, inflation determines a distinctive PBH mass distribution that is rather flat and can thus lead to a sizable total abundance of PBHs, while avoiding some of the downsides of PBH formation from critical collapse. We show that generic QCD axion models, with decay constant close to the inflationary Hubble scale, can yield up to $1\\%$ of the dark matter (DM) today in the form of PBHs, while being compatible with isocurvature constraints from Cosmic Microwave Background observations. This occurs for values of axion decay constants around $f\\_a\\simeq 10^{8}~\\text{GeV}$, that is the region targeted by axion helioscopes and partially constrained by astrophysical observations. The resulting PBHs have \\textit{stupendously} large masses, above $10^{11}M\\_\\odot$, and their existence can be probed by Large Scale Structure observations. Larger PBH abundances can be generated by axion-like particles. Alternatively, in scenarios where isocurvature constraints can be relaxed, we find that the totality of the DM can be produced by the QCD axion misalignment mechanism, accompanied by a ${\\cal O}(10^{-3})$ DM fraction in PBHs of masses $(10^5-10^6)~M\\_\\odot$. These can act as seeds for the formation of massive black holes at large redshifts, as suggested by recent JWST observations.\n\n", "2504.07861": "2025-04-10, **Horizons, throats and bounces in hybrid metric-Palatini gravity with a non-zero potential**, Gabriel I. Róis et.al., [2504.07861v1](http://arxiv.org/abs/2504.07861v1)\n\n This work conducts an in-depth exploration of exact electrically charged solutions, including traversable wormholes, black holes, and black bounces, within the framework of the scalar-tensor representation of hybrid metric-Palatini gravity (HMPG) with a non-zero scalar potential. By integrating principles from both the metric and Palatini formulations, HMPG provides a flexible approach to addressing persistent challenges in General Relativity (GR), such as the late-time cosmic acceleration and the nature of dark matter. Under the assumption of spherical symmetry, we employ an inverse problem technique to derive exact solutions in both the Jordan and Einstein conformal frames. This method naturally leads to configurations involving either canonical or phantom scalar fields. A thorough examination of horizon structures, throat conditions, asymptotic behaviour, and curvature regularity (via the Kretschmann scalar) reveals the intricate causal structures permitted by this theoretical model. The analysis uncovers a diverse range of geometric configurations, with the phantom sector exhibiting a notably richer spectrum of solutions than the canonical case. These solutions encompass traversable wormholes, black universe models, where the interior of a black hole evolves into an expanding cosmological phase rather than a singularity, as well as black bounce structures and multi-horizon black holes. The results demonstrate that introducing a non-zero scalar potential within HMPG significantly expands the array of possible gravitational solutions, yielding complex causal and curvature properties that go beyond standard GR. Consequently, HMPG stands out as a powerful theoretical framework for modelling extreme astrophysical environments, where deviations from classical gravity are expected to play a crucial role.\n\n", "2504.07859": "2025-04-10, **Conversion-Driven Freeze-Out: A Common Framework for Dark Matter and Baryogenesis**, Jan Heisig et.al., [2504.07859v1](http://arxiv.org/abs/2504.07859v1)\n\n We explore dark matter genesis beyond the WIMP paradigm, focusing on the mechanism of conversion-driven freeze-out. This mechanism enables the thermalization of dark matter despite its very weak couplings. While the scenario evades conventional WIMP searches, it predicts novel signatures of long-lived particles at colliders, making it a prime target for upcoming LHC searches. We review various model realizations of this mechanism, highlighting its deep connections to other unresolved problems of the Standard Model. In particular, we show how conversion-driven freeze-out can naturally give rise to baryogenesis, offering a compelling perspective on the origins of both dark and baryonic matter.\n\n", "2504.07679": "2025-04-10, **The Cosmological Evidence for Non-Minimal Coupling**, William J. Wolf et.al., [2504.07679v1](http://arxiv.org/abs/2504.07679v1)\n\n The recent observational evidence of deviations from the $\\Lambda$-Cold Dark Matter ($\\Lambda$CDM) model points towards the presence of evolving dark energy. The simplest possibility consists of a cosmological scalar field $\\varphi$, dubbed quintessence, driving the accelerated expansion. We assess the evidence for the existence of such a scalar field. We find that, if the accelerated expansion is driven by quintessence, the data favour a potential energy $V(\\varphi)$ that is concave, i.e., $m^2=d^2V/d\\varphi^2<0$. Furthermore, and more significantly, the data strongly favour a scalar field that is non-minimally coupled to gravity (Bayes factor $\\log(B) = 7.34 \\pm 0.60$), leading to time variations in the gravitational constant on cosmological scales, and the existence of fifth forces on smaller scales. The fact that we do not observe such fifth forces implies that either new physics must come into play on non-cosmological scales or that quintessence is an unlikely explanation for the observed cosmic acceleration.\n\n", "2504.07613": "2025-04-10, **Power spectrum of the CODEX clusters**, Valtteri Lindholm et.al., [2504.07613v1](http://arxiv.org/abs/2504.07613v1)\n\n Aims. We analyze the clustering of galaxy clusters in a large contiguous sample, the Constrain Dark Energy with X-ray (CODEX) sample. We construct a likelihood for cosmological parameters by comparing the measured clustering signal and a theoretical prediction, and use this to obtain parameter constraints. Methods. We measured the three multipole moments (monopole, quadrupole, and hexadecapole, $\\ell = 0, 2, 4$) of the power spectrum of a subset of the CODEX clusters. To fully model cluster clustering, we also determined the expected clustering bias of the sample using estimates for the cluster masses and a mass-to-bias model calibrated using N-body simulations. We estimated the covariance matrix of the measured power spectrum multipoles using a set of simulated dark-matter halo catalogs. Combining all these ingredients, we performed a Markov chain Monte Carlo sampling of cosmological parameters $\\Omega\\_m$ and $\\sigma\\_8$ to obtain their posterior. Results. We found the CODEX clustering signal to be consistent with an earlier X-ray selected cluster sample, the REFLEX II sample. We also found that the measured power spectrum multipoles are compatible with the predicted, bias-scaled linear matter power spectrum when the cosmological parameters determined by the Planck satellite are assumed. Furthermore, we found the marginalized parameter constraints of $\\Omega\\_m = 0.24^{+0.06}\\_{-0.04}$ and $\\sigma\\_8 = 1.13^{+0.43}\\_{-0.24}$. The full 2D posterior is consistent, for example, with the Planck cosmology within the 68% confidence region.\n\n", "2504.07559": "2025-04-10, **Axion dark matter search from terrestrial magnetic fields at extremely low frequencies**, Atsushi Nishizawa et.al., [2504.07559v1](http://arxiv.org/abs/2504.07559v1)\n\n The natural environment of the Earth can act as a sensitive detector for dark matter in ultralight axions. When axions with masses between $1\\times10^{-15}\\,{\\rm eV}$ and $1\\times10^{-13}\\,{\\rm eV}$ pass through the Earth, they interact with the global geomagnetic field, generating electromagnetic (EM) waves in the extremely low-frequency range ($0.3$--$30\\,{\\rm Hz}$) through axion-photon coupling. This paper is one of a series of companion papers for~\\cite{Taruya:2025zql}, focusing on the data analysis method and search results for an axion signal. Utilizing the theoretical predictions of axion-induced EM spectra from a companion study, we analyzed long-term observational data of terrestrial magnetic fields in this frequency band to search for axion-induced signals. Our analysis identified 65 persistent signal candidates with a signal-to-noise ratio (SNR) greater than 3. Aside from these candidates, we placed a new upper bound on the axion-photon coupling parameter, significantly refining the previous constraint from CAST by at most two orders of magnitude down to $g\\_{a\\gamma} \\lesssim 4\\times10^{-13} \\,{\\rm GeV}^{-1}$ for the axion mass around $3 \\times 10^{-14}\\,{\\rm eV}$.\n\n", "2504.07517": "2025-04-10, **Gravitational wave signals from primordial black holes orbiting solar-type stars**, Vitorio A. De Lorenci et.al., [2504.07517v1](http://arxiv.org/abs/2504.07517v1)\n\n Primordial black holes (PBHs) with masses between $10^{14}$ and $10^{20}$ kg are candidates to contribute a substantial fraction of the total dark matter abundance. When in orbit around the center of a star, which can possibly be a completely interior orbit, such objects would emit gravitational waves, as predicted by general relativity. In this work, we examine the gravitational wave signals emitted by such objects when they orbit typical stars, such as the Sun. We show that the magnitude of the waves that could eventually be detected on Earth from a possible PBH orbiting the Sun or a neighboring Sun-like star within our galaxy can be significantly stronger than those originating from a PBH orbiting a denser but more distant neutron star (NS). Such signals may be detectable by the LISA gravitational-wave detector. In addition, we estimate the contribution that a large collection of such PBH-star systems would make to the stochastic gravitational-wave background (SGWB) within a range of frequencies to which pulsar timing arrays are sensitive.\n\n", "2504.07367": "2025-04-10, **Galaxy and halo properties around cosmic filaments from Sloan Digital Sky Survey Data Release 7 and the ELUCID simulation**, Youcai Zhang et.al., [2504.07367v1](http://arxiv.org/abs/2504.07367v1)\n\n Using galaxies from the Sloan Digital Sky Survey Data Release 7 (SDSS DR7) along with haloes from the dark matter only constrained ELUCID (Exploring the Local Universe with the reConstructed Initial Density field) simulation, we examine the properties of galaxies and haloes with respect to their distance to cosmic filaments, determined by the medial-axis thinning technique of the COsmic Web Skeleton (COWS) method. Our findings suggest that galaxies or subhaloes grow in mass as they approach these filaments. Galaxies exhibit a redder colour and diminished specific star formation rates as they approach these filaments. Additionally, older subhaloes tend to be more common near the central regions of these filaments. Elliptical galaxies are more frequently found than spiral galaxies in the central regions of the filaments. Lower-mass galaxies typically display reduced sizes in proximity to filaments, whereas higher-mass galaxies tend to exhibit increased sizes when close to filaments. Moreover, the concentration and spin of the haloes grow as they approach the filaments. These findings support the notion that the large-scale structure of the universe, characterized by cosmic web structures, plays a vital role in shaping galaxy and halo properties.\n\n", "2504.07279": "2025-04-09, **Search for Axion Dark Matter from 1.1 to 1.3 GHz with ADMX**, ADMX Collaboration et.al., [2504.07279v1](http://arxiv.org/abs/2504.07279v1)\n\n Axion dark matter can satisfy the conditions needed to account for all of the dark matter and solve the strong CP problem. The Axion Dark Matter eXperiment (ADMX) is a direct dark matter search using a haloscope to convert axions to photons in an external magnetic field. Key to this conversion is the use of a microwave resonator that enhances the sensitivity at the frequency of interest. The ADMX experiment boosts its sensitivity using a dilution refrigerator and near quantum-limited amplifier to reduce the noise level in the experimental apparatus. In the most recent run, ADMX searched for axions between 1.10-1.31 GHz to extended Kim-Shifman-Vainshtein-Zakharov (KSVZ) sensitivity. This Letter reports on the results of that run, as well as unique aspects of this experimental setup.\n\n", "2504.07232": "2025-04-09, **A dark matter hail: Detecting macroscopic dark matter with asteroids, planetary rings, and craters**, Zachary S. C. Picker et.al., [2504.07232v1](http://arxiv.org/abs/2504.07232v1)\n\n Dark matter could be composed of macroscopic objects with large masses and geometric cross-sections spanning many decades. We investigate the potential interaction of such `stuff-sized' dark matter by considering its interactions with asteroids, planetary rings, and terrestrial bodies. This hail of dark matter could catastrophically destroy these Solar System objects, evaporate them from their orbits, or cause substantial cratering. We estimate these effects and use them to place competitive bounds on a wide, previously-unconstrained swathe of the dark matter parameter space.\n\n", "2504.07188": "2025-04-09, **Probing the UV with IR Axion Dark Matter Experiments**, Jacob M. Leedom et.al., [2504.07188v1](http://arxiv.org/abs/2504.07188v1)\n\n There is an ongoing and future experimental program searching for axions as both extensions of the Standard Model and as candidates for the observed dark matter. In this paper, we examine the feasibility of being able to pin down precise features of axions within the context of this program. We define a set of infrared data that can be probed by experiments and explain how it encodes the ultraviolet data defining particular models of the QCD axion. We then critically examine the extent to which these data can be determined. If the parameters are favorable, we will be able to determine the axion couplings to photons, electrons, nuclei, as well as the dark matter halo density. However, further experimental proposals are needed to fully flesh out the ultraviolet model of the axion.\n\n", "2504.07187": "2025-04-09, **Galactic Accelerations from the GD-1 Stream Suggest a Tilted Dark Matter Halo**, Jacob Nibauer et.al., [2504.07187v1](http://arxiv.org/abs/2504.07187v1)\n\n Cold dark matter halos are expected to be triaxial and often tilted relative to the stellar disk. Stellar streams provide a sensitive tracer of the Milky Way's halo shape, though models for the Galactic potential are typically limited to simple, symmetric functional forms. Here, we measure the Galactic acceleration field along the GD-1 stellar stream using a direct differentiation of the stream's track in phase-space. Using a fully data-driven catalog of stream members from Gaia, SDSS, LAMOST, and DESI, we map the stream in 6D phase-space. We fit splines to the stream track, and infer cylindrical acceleration components $a\\_R = -2.5 \\pm\\_{0.1}^{0.2}, \\ a\\_z = -1.8\\pm 0.1, \\ a\\_\\phi = 0.2\\pm 0.1~\\rm{km \\ s^{-1} \\ Myr^{-1}}$ at $(R,z,\\phi) = (11.9~\\rm{kpc}, 7.3~\\rm{kpc}, 171.1~\\rm{deg})$. We measure mass enclosed within $14~\\rm{kpc}$ of $1.4\\pm 0.1 \\times 10^{11} M\\_\\odot$ and z-axis density flattening of $q\\_{\\rho, z} = 0.81\\pm^{0.06}\\_{0.03}$, both consistent with previous estimates. However, we find a 2$\\sigma$ deviation from an axisymmetric acceleration field, which can be explained by a triaxial dark matter halo with axis ratios 1:0.75:0.70. The major axis of the halo is consistent with a tilt of $18~\\rm{deg}$ above the Galactic plane in the direction of the Sun. The magnitude and direction of the tilt are consistent with measurements of the Milky Way's stellar halo from Gaia and the H3 survey. A tilted triaxial halo has important consequences for orbit-integration-based studies of the Galaxy, and can be further tested by deriving acceleration constraints from multiple streams.\n\n", "2504.07179": "2025-04-09, **Prospects for detecting new dark physics with the next generation of atomic clocks**, Benjamin Elder et.al., [2504.07179v1](http://arxiv.org/abs/2504.07179v1)\n\n Wide classes of new fundamental physics theories cause apparent variations in particle mass ratios in space and time. In theories that violate the weak equivalence principle (EP), those variations are not uniform across all particles and may be detected with atomic and molecular clock frequency comparisons. In this work we explore the potential to detect those variations with near-future clock comparisons. We begin by searching published clock data for variations in the electron-proton mass ratio. We then undertake a statistical analysis to model the noise in a variety of clock pairs that can be built in the near future according to the current state of the art, determining their sensitivity to various fundamental physics signals. Those signals are then connected to constraints on fundamental physics theories that lead directly or indirectly to an effective EP-violating, including those motivated by dark matter, dark energy, the vacuum energy problem, unification or other open questions of fundamental physics. This work results in projections for tight new bounds on fundamental physics that could be achieved with atomic and molecular clocks within the next few years. Our code for this work is packaged into a forecast tool that translates clock characteristics into bounds on fundamental physics.\n\n", "2504.07172": "2025-04-09, **A Robust Determination of Antinuclei Production from Dark Matter via Weakly Decaying Beauty Hadrons**, Mattia Di Mauro et.al., [2504.07172v1](http://arxiv.org/abs/2504.07172v1)\n\n Recently, the Alpha Magnetic Spectrometer (AMS-02) Collaboration presented tentative evidence for the detection of cosmic antihelion-3 (${}^3\\overline{\\rm He}$) events, alongside a comparable number of antideuterons ($\\overline{\\rm D}$). If confirmed, these observations could revolutionize our understanding of cosmic-ray production and propagation and/or serve as compelling indirect evidence for dark matter. Given that the detection of cosmic $\\overline{\\rm D}$ is already at the limit of AMS-02 sensitivity, explaining the observation of ${}^3\\overline{\\rm He}$ even within the standard coalescence framework poses a significant challenge. It has recently been shown that a previously overlooked mechanism within the Standard Model of particle physics-namely, the production of antihelion via the displaced-vertex decay of $\\bar{\\Lambda}\\_b^0$ baryons-could substantially enhance the ${}^3\\overline{\\rm He}$ flux arising from dark matter-induced processes. In light of these challenges, we present a tuning of Pythia that is consistent with LEP data on the fragmentation function of $b$ quarks into $b$-hadrons-a critical factor for determining the $\\bar{\\Lambda}\\_b^0$ multiplicity-and with ALICE and ALEPH data for the $\\overline{\\rm D}$ and ${}^3\\overline{\\rm He}$ spectra, which we employ to determine our coalescence model. Our refined Pythia tuning, in conjunction with our coalescence model, results in a predicted branching ratio for the production of ${}^3\\overline{\\rm He}$ from $\\bar{\\Lambda}\\_b^0$ decays that is consistent with the recent upper limit measured by LHCb. Furthermore, our prediction indicates that the contribution of $\\overline{\\rm D}$ and ${}^3\\overline{\\rm He}$ from beauty-hadron decays is negligible relative to the direct production from hadronization.\n\n", "2504.07039": "2025-04-09, **Microlensing at Cosmological Distances: Event Rate Predictions in the Warhol Arc of MACS 0416**, J. M. Palencia et.al., [2504.07039v1](http://arxiv.org/abs/2504.07039v1)\n\n Highly magnified stars ($\\mu$ $>$ 100) are now outinely identified as transient events at cosmological distances thanks to microlensing by intra-cluster stars near the critical curves of galaxy clusters. Using the {\\it James Webb} Space Telescope (JWST) in combination with the {\\it Hubble} Space Telescope (HST), we outline here an analytical framework that is applied to the Warhol arc (at $z=0.94$) in the MACS 0416 galaxy cluster (at $z=0.396)$ where over a dozen microlensed stars have been detected to date. This method is general and can be applied to other lensed arcs. Within this lensed galaxy we fit the spatially resolved SED spanned by eight JWST-NIRCam filters combined with three ACS filters, for accurate lensed star predictions in 2D. With this tool we can generate 2D maps of microlensed stars for well resolved arcs in general, including dependence on wavelength and limiting apparent magnitude, for comparison with with planned cadenced campaigns for JWST and Hubble, for constraining directly the IMF and the level of dark matter substructure.\n\n", "2504.06709": "2025-04-09, **Universal profile for cosmic birefringence tomography with radio galaxies**, Fumihiro Naokawa et.al., [2504.06709v1](http://arxiv.org/abs/2504.06709v1)\n\n We propose a new method to tomographically probe cosmic birefringence using radio galaxies. We show that the redshift evolution of the cosmic birefringence angle induced by a slow-rolling pseudoscalar field, which is a candidate for dynamical dark energy, is independent of the detailed model of the pseudoscalor field. This universal profile evolves predominantly at $z\\lesssim10$. In contrast, if the origin is a dark matter-like pseudscalor field, the resulting birefringence angle tends to be negligible in the low-redshift regime. This new insight provides a strong motivation to independently test the cosmic birefringence using polarized astrophysical sources such as radio galaxies. We find that a sample size of $\\order{10^5-10^6}$ is required to distinguish the profiles, which is achievable with ongoing and upcoming radio surveys such as ASKAP or SKA.\n\n", "2504.06653": "2025-04-09, **Hunting axion dark matter signatures in low-frequency terrestrial magnetic fields**, Atsushi Taruya et.al., [2504.06653v1](http://arxiv.org/abs/2504.06653v1)\n\n We show that Earth's natural environment can serve as a powerful probe for ultralight axion dark matter. In the presence of global geomagnetic fields, the axions with masses ranging from $10^{-15}\\,{\\rm eV}-10^{-13}\\,{\\rm eV}$ induce electromagnetic waves in the (sub-) extremely low-frequency band ($0.3-30\\,{\\rm Hz}$) through the axion-photon coupling. We predict the amplitude of induced magnetic fields in the Earth-ionosphere cavity, taking the finite conductivity of the atmosphere into account. This allows us to constrain the axion-photon coupling parameter, $g\\_{\\rm a\\gamma}$, from the long-term monitoring data of the low-frequency magnetic fields, resulting in a significant improvement from the previous constraints down to $g\\_{\\rm a\\gamma} \\lesssim 4\\times10^{-13}\\,{\\rm GeV}^{-1}$ for axion mass $\\sim 3 \\times 10^{-14}\\,{\\rm eV}$.\n\n", "2504.06530": "2025-04-09, **Weyl Phonons: The connection of topology and chirality**, Tiantian Zhang et.al., [2504.06530v1](http://arxiv.org/abs/2504.06530v1)\n\n Topology and chirality of fermionic quasiparticles have enabled exciting discoveries, including quantum anomalous Hall liquids and topological superconductivity. Recently, topological and chiral phonons emerge as new and fast-evolving research directions. While these concepts are separately developed, they are intimately connected in the context of Weyl phonons. The couplings between chiral and topological phonons with various electronic and magnetic quasiparticles are predicted to give rise to new quantum states and giant magnetism with fundamental and applicational interests, ranging from quantum information science to dark matter detectors.\n\n"}, "supernova": {"2504.07966": "2025-04-10, **What it takes to solve the Hubble tension through scale-dependent modifications of the primordial power spectrum**, Nanoom Lee et.al., [2504.07966v1](http://arxiv.org/abs/2504.07966v1)\n\n We investigate scale-dependent modifications to the primordial scalar power spectrum as potential solutions to the Hubble tension. We use the Fisher-bias formalism, recently adapted to examine perturbed recombination solutions to the Hubble tension, and extend its range of validity with an iterative method. We first analyze the Planck cosmic microwave background (CMB) anisotropy data, demonstrating the existence of modifications to the primordial power spectrum capable of fully resolving the tension between Planck and SH0ES. As a proof of concept, we interpret these solutions in terms of small, time-dependent variations in the first slow roll parameter or in the sound speed of curvature perturbations during a stage of primordial inflation. However, these solutions are associated with a low total matter density $\\Omega\\_m$, which makes them inconsistent with baryon acoustic oscillations (BAO) and uncalibrated supernovae (SNIa) data. When incorporating additional BOSS and PantheonPlus data, the solutions that reduce the Hubble tension tend to overfit Planck CMB data to compensate for the worsened fit to BAO and SNIa data, making them less compelling. These findings suggest that modifying the primordial power spectrum alone is unlikely to provide a robust resolution to the tension and highlight how the viability of such data-driven solutions depends on the specific datasets considered, emphasizing the role of future high-precision observations in further constraining possible resolutions to the tension.\n\n", "2504.07051": "2025-04-09, **Revisiting X-ray polarization of the shell of Cassiopeia A using spectropolarimetric analysis**, Alessandra Mercuri et.al., [2504.07051v1](http://arxiv.org/abs/2504.07051v1)\n\n X-ray synchrotron radiation is expected to be highly polarized. Thanks to the Imaging X-ray Polarimetry Explorer (IXPE), it is now possible to evaluate the degree of X-ray polarization in sources such as supernova remnants (SNRs). Jointly using IXPE data and high-resolution Chandra observations, we perform a spatially resolved spectropolarimetric analysis of SNR Cassiopeia A (Cas A). We focus in the 3-6 keV energy band on regions near the shell dominated by nonthermal synchrotron emission. By combining IXPE's polarization sensitivity with Chandra's higher spatial and spectral resolution, we constrain the local polarization degree (PD) and polarization angle (PA) across the remnant. Our analysis reveals PD values ranging locally from 10% to 26%, showing significant regional variations that underscore the complex magnetic field morphology of Cas A. The polarization vectors indicate a predominantly radial magnetic field, consistent with previous studies. Thanks to the improved modeling of thermal contamination using Chandra data, we retrieve higher PD values compared to earlier IXPE analysis and more significant detections with respect to the standard IXPEOBSSIM analysis. Finally, we also estimate the degree of magnetic turbulence {\\eta} from the measured photon index and PD, under the assumption of an isotropic fluctuating field across the shell of Cas A.\n\n", "2504.06831": "2025-04-09, **Hubble tension and small-scale inhomogeneities on light propagation**, Lucila Kraiselburd et.al., [2504.06831v2](http://arxiv.org/abs/2504.06831v2)\n\n One of the observational challenges in the standard cosmological model is known as the Hubble tension. This $\\sim$ 5$\\sigma$ discrepancy between early and late measurements of the Hubble Constant arises from observations that rely on cosmological distance estimates, either explicitly or implicitly. In this study, we relax the assumption of the Friedmann-Lema\\^itre-Robertson-Walker (FLRW) distance-redshift relation and explore the influence of small-scale inhomogeneities on the propagation of light from distant sources, using the Zeldovich-Kantowski-Dyer-Roeder (ZKDR) approximation as an alternative approach to address this tension. We employ the ZKDR equation along with a modified version to test our hypothesis using recent Type Ia supernovae data from the Pantheon+ compilation and the SH0ES collaboration and six gravitational lens systems from the H0LiCOW collaboration. Our findings indicate that a background model characterized by the ZKDR approximation and its modifications does not solve or alleviate the Hubble tension.\n\n"}}