{"neutrino": {"2403.09387": "2024-03-14, **High-energy Neutrinos from Outflows Powered by Kicked Remnants of Binary Black Hole Mergers in AGN Accretion Disks**, Zhi-Peng Ma et.al., [2403.09387v1](http://arxiv.org/abs/2403.09387v1)\n\n Merging of stellar-mass binary black holes (BBH) could take place within the accretion disk of active galactic nuclei (AGN). The resulting BH remnant is likely to accrete the disk gas at a super-Eddington rate, launching a fast, quasi-spherical outflow (wind). Particles will be accelerated by shocks driven by the wind, subsequently interacting with the shocked disk gas or radiation field through hadronic processes and resulting in the production of high-energy neutrinos and potential electromagnetic (EM) emissions. This study delves into the intricate evolution of the shock driven by the remnant BH wind within AGN disks. Subsequently, we calculated the production of neutrinos and the expected detection numbers for a single event, along with their contributions to the overall diffuse neutrino background. Our analysis, considering various scenarios, reveals considerable neutrino production and possible detection by IceCube for nearby events. The contribution of the remnant BH winds on the diffuse neutrino background is minor due to the low event rate density, but it can be improved to some extent for some optimistic parameters. We also propose that there could be two neutrino/EM bursts, one originating from the premerger BBH wind and the other from the remnant BH wind, with the latter typically having a time gap to the GW event of around tens of days. When combined with the anticipated gravitational waves (GW) emitted during the BBH merger, such a system emerges as a promising candidate for joint observations involving neutrinos, GWs, and EM signals.\n\n", "2403.09105": "2024-03-14, **Effect of torsion in long-baseline neutrino oscillation experiments**, Papia Panda et.al., [2403.09105v1](http://arxiv.org/abs/2403.09105v1)\n\n In this work we investigate the effect of curved spacetime on neutrino oscillation. In a curved spacetime, the effect of curvature on fermionic fields is represented by spin connection. The spin connection consists of a non-universal ``contorsion\" part which is expressed in terms of vector and axial current density of fermions. The contraction of contorsion part with the tetrad fields, which connects the internal flat space metric and the spacetime metric, is called torsion. In a scenario where neutrino travels through background of fermionic matter at ordinary densities in a curved spacetime, the Hamiltonian of neutrino oscillation gets modified by the torsional coupling constants $\\lambda\\_{21}^{\\prime}$ and $\\lambda\\_{31}^{\\prime}$. The aim of this work is to study the effect of $\\lambda\\_{21}^{\\prime}$ and $\\lambda\\_{31}^{\\prime}$ in DUNE and P2SO. In our study we, (i) discuss the effect of torsional coupling constants on the neutrino oscillation probabilities, (ii) estimate the capability of P2SO and DUNE to put bounds on these parameters and (iii) study how the physics sensitivities get modified in presence of torsion.\n\n"}, "dark matter": {"2403.09597": "2024-03-14, **Tidal evolution of cored and cuspy dark matter halos**, Xiaolong Du et.al., [2403.09597v1](http://arxiv.org/abs/2403.09597v1)\n\n The internal structure and abundance of dark matter halos and subhalos are powerful probes of the nature of dark matter. In order to compare observations with dark matter models, accurate theoretical predictions of these quantities are needed. We present a fast and accurate method to describe the tidal evolution of subhalos within their parent halo, based on a semi-analytic approach. We first consider idealized N-body simulations of subhalos within their host halo, using a generalized mass density profile that describes their properties in a variety of dark matter models at infall, including popular warm, cold, and self-interacting ones. Using these simulations we construct tidal \"tracks\" for the evolution of subhalos based on their conditions at infall. Second, we use the results of these simulations to build semi-analytic models (SAMs) for tidal effects, including stripping and heating and implement them within the code GALACTICUS. Our SAMs can accurately predict the tidal evolution of both cored and cuspy subhalos, including the bound mass and density profiles, providing a powerful and efficient tool for studying the post-infall properties of subhalos in different dark matter models.\n\n", "2403.09555": "2024-03-14, **Testing MOND on small bodies in the remote solar system**, David Vokrouhlický et.al., [2403.09555v1](http://arxiv.org/abs/2403.09555v1)\n\n Modified Newtonian dynamics (MOND), which postulates a breakdown of Newton's laws of gravity/dynamics below some critical acceleration threshold, can explain many otherwise puzzling observational phenomena on galactic scales. MOND competes with the hypothesis of dark matter, which successfully explains the cosmic microwave background and large-scale structure. Here we provide the first solar-system test of MOND that probes the sub-critical acceleration regime. Using the Bekenstein-Milgrom AQUAL formulation, we simulate the evolution of myriads of test particles (planetesimals or comets) born in the trans-Neptunian region and scattered by the giant planets over the lifetime of the Sun to heliocentric distances of $10^2$-$10^5$ au. We include the effects of the Galactic tidal field and passing stars. While Newtonian simulations reproduce the distribution of binding energies of long-period and Oort-cloud comets detectable from Earth, MOND-based simulations do not. This conclusion is robust to plausible changes in the migration history of the planets, the migration history of the Sun, the MOND transition function, effects of the Sun's birth cluster, and the fading properties of long-period comets. For the most popular version of AQUAL, characterized by a gradual transition between the Newtonian and MOND regimes, our MOND-based simulations also fail to reproduce the orbital distribution of trans-Neptunian objects in the detached disk (perihelion > 38 au). Our results do not rule out some MOND theories more elaborate than AQUAL, in which non-Newtonian effects are screened on small spatial scales, at small masses, or in external gravitational fields comparable in strength to the critical acceleration.\n\n", "2403.09343": "2024-03-14, **Sensitivity to sub-GeV dark matter from cosmic-ray scattering with very-high-energy gamma-ray observatories**, Igor Reis et.al., [2403.09343v1](http://arxiv.org/abs/2403.09343v1)\n\n Huge efforts have been deployed to detect dark matter (DM) in the GeV-TeV mass range involving various detection techniques, and led to strong constraints in the available parameter space. We compute here the sensitivity to sub-GeV DM that can be probed from the inevitable cosmic-ray scattering onto DM particles populating the Milky Way halo. Inelastic scattering of energetic cosmic rays off DM would produce high-energy gamma rays in the final state, providing a new avenue to probe the poorly-constrained so far sub-GeV dark matter mass range. In this work we derive sensitivity forecasts for the inelastic cosmic-ray proton - DM cross section for current and future very-high-energy gamma-ray observatories such as H.E.S.S., LHAASO, CTA and SWGO in the 100 eV to 100 MeV mass range. These inelastic cross section constraints are converted to the elastic proton - DM cross section to highlight further complementarity with cosmological, collider and direct detection searches. The sensitivity computed at 95\\% confidence level on the elastic cross section reaches $\\sim$2$\\times$ 10$^{-32}$ cm$^2$ for a 100 keV DM mass for H.E.S.S.-like and $\\sim$7$\\times$ 10$^{-34}$ cm$^2$ for a $\\sim$1 keV DM mass for LHAASO. The sensitivity prospects for CTA and a strawman SWGO model reach $\\sim$6$\\times$ 10$^{-34}$ cm$^2$ and $\\sim$4$\\times$ 10$^{-35}$ cm$^2$, for DM masses of 10 keV and 1 keV, respectively. The sensitivity reach of the gamma-ray observatories considered here enables to probe an uncharted region of the DM mass - cross section parameter space.\n\n", "2403.09292": "2024-03-14, **Exploration at the high-energy frontier: ATLAS Run 2 searches investigating the exotic jungle beyond the Standard Model**, ATLAS Collaboration et.al., [2403.09292v1](http://arxiv.org/abs/2403.09292v1)\n\n The Large Hadron Collider is at the high-energy frontier of particle physics, having produced proton$-$proton collisions during Run 2, from 2015 to 2018, at an unprecedented centre-of-mass energy of 13 TeV. The ATLAS experiment has a broad programme to thoroughly explore this uncharted territory, to seek out new exotic particles predicted by theories that boldly go beyond the Standard Model. Although the Standard Model has been very successful, it leaves many questions unanswered, prompting novel ideas about particles that could be hiding in the data, waiting to be discovered by intrepid explorers. These include dark-matter candidates, hidden-sector particles, new vector resonances, leptoquarks, and vector-like quarks, to name a few examples. Searches for new particles are reported here, with the exception of searches for supersymmetry or extended Higgs sectors as these are the subjects of separate reports.\n\n", "2403.09186": "2024-03-14, **TangoSIDM Project: Is the Stellar Mass Tully-Fisher relation consistent with SIDM?**, Camila Correa et.al., [2403.09186v1](http://arxiv.org/abs/2403.09186v1)\n\n Self-interacting dark matter (SIDM) has the potential to significantly influence galaxy formation in comparison to the cold, collisionless dark matter paradigm (CDM), resulting in observable effects. This study aims to elucidate this influence and to demonstrate that the stellar mass Tully-Fisher relation imposes robust constraints on the parameter space of velocity-dependent SIDM models. We present a new set of cosmological hydrodynamical simulations that include the SIDM scheme from the TangoSIDM project and the SWIFT-EAGLE galaxy formation model. Two cosmological simulations suites were generated: one (Reference model) which yields good agreement with the observed $z=0$ galaxy stellar mass function, galaxy mass-size relation, and stellar-to-halo mass relation; and another (WeakStellarFB model) in which the stellar feedback is less efficient, particularly for Milky Way-like systems. Both galaxy formation models were simulated under four dark matter cosmologies: CDM, SIDM with two different velocity-dependent cross sections, and SIDM with a constant cross section. While SIDM does not modify global galaxy properties such as stellar masses and star formation rates, it does make the galaxies more extended. In Milky Way-like galaxies, where baryons dominate the central gravitational potential, SIDM thermalises, causing dark matter to accumulate in the central regions. This accumulation results in density profiles that are steeper than those produced in CDM from adiabatic contraction. The enhanced dark matter density in the central regions of galaxies causes a deviation in the slope of the Tully-Fisher relation, which significantly diverges from the observational data. In contrast, the Tully-Fisher relation derived from CDM models aligns well with observations.\n\n", "2403.09089": "2024-03-14, **Gravitational Wave Probe of Gravitational Dark Matter from Preheating**, Ruopeng Zhang et.al., [2403.09089v1](http://arxiv.org/abs/2403.09089v1)\n\n Following our previous studies on gravitational dark matter (GDM) production in the early Universe of preheating,we forecast high-frequency gravitational wave (GW) spectra as the indirect probe of such GDM. We use proper lattice simulations to handle the resonance,and to solve the GW equation of motion with resonance induced scalar field excitations as the source term.Our numerical results show that the Higgs scalar excitations in the Higgs preheating model give rise to magnitudes of GW energy density spectra of order $10^{-10}$ at frequencies $10-10^{3}$ MHz, whereas the inflaton fluctuation excitations in the inflaton self-resonant preheating model yield magnitudes of GW energy density spectrum up to $10^{-9}~(10^{-11})$ at frequencies near $30~(2)$ MHz for the index $n=4~(6)$.\n\n", "2403.09038": "2024-03-14, **Dynamical Friction and Black Holes in Ultralight Dark Matter Solitons**, Russell Boey et.al., [2403.09038v1](http://arxiv.org/abs/2403.09038v1)\n\n We numerically simulate the motion of a black hole as it plunges radially through an ultralight dark matter soliton. We investigate the timescale in which dynamical friction reduces the kinetic energy of the black hole to a minimum, and consider the sensitivity of this timescale to changes in the ULDM particle mass, the total soliton mass, and the mass of the black hole. We contrast our numerical results with a semi-analytic treatment of dynamical friction, and find that the latter is poorly suited to this scenario. In particular, we find that the back-reaction of the soliton to the presence of the black hole is significant, resulting in oscillations in the coefficient of dynamical friction which cannot be described in the simple semi-analytical framework. Furthermore, we observe a late-time reheating effect, in which a significant amount of kinetic energy is transferred back to the black hole after an initial damping phase. This complicates the discussion of ULDM dynamical friction on the scales relevant to the final parsec problem.\n\n"}, "supernova": {}}