{"neutrino": {"2510.14940": "2025-10-16, **Invisible neutron decay and light BSM particles**, J. C. Helo et.al., [2510.14940v1](http://arxiv.org/abs/2510.14940v1)\n\n In Standard Model Effective Field Theory (SMEFT) invisible neutron   decay arises from $d=12$ operators. Adding new, light particles to   the field content of the SM, such as right-handed neutrinos, allows   to construct operators for invisible neutron decay at much lower   dimensions. Observing invisible neutron decay, if nucleon decays   with charged leptons remain absent, would therefore point towards the   existence of new neutral degrees of freedom. Here, we discuss four   cases: (i) Adding right-handed neutrinos to the SM; (ii) a   right-handed neutrino and an axion-like particle; (iii) a   right-handed neutrino and a (nearly) massless singlet scalar; and   (iv) a right-handed neutrino and a light $Z'$. We give the general   tree-level decomposition for the resulting $d=(7-9)$ operators for   invisible neutron decay. We also briefly discuss LHC searches   related to the exotic states found in these UV completions.\n\n", "2510.14850": "2025-10-16, **General-relativistic radiation magnetohydrodynamics simulations of binary neutron star mergers: The influence of spin on the multi-messenger picture**, Anna Neuweiler et.al., [2510.14850v1](http://arxiv.org/abs/2510.14850v1)\n\n The rich phenomenology of binary neutron star mergers offers a unique opportunity to test general relativity, investigate matter at supranuclear densities, and learn more about the origin of heavy elements. As multi-messenger sources, they emit both gravitational waves and electromagnetic radiation across several frequency bands. The interpretation of these signals relies heavily on accurate numerical-relativity simulations that incorporate the relevant microphysical processes. Using the latest updates of the BAM code, we perform general-relativistic radiation magnetohydrodynamic simulations of binary neutron star mergers with two different spin configurations. We adopt a state-of-the-art equation of state based on relativistic mean-field theory developed for dense matter in neutron star mergers. To capture both dynamical ejecta and secular outflows from magnetic and neutrino-driven winds, we evolve the systems up to $\\sim 100\\ \\rm ms$ after the merger at considerably high resolution with a grid spacing of $\\Delta x \\approx 93\\ \\rm m$ across the neutron stars. Our results show that the non-spinning configuration undergoes a more violent merger, producing more ejecta with lower electron fraction and higher velocities, while the spinning configuration forms a larger disk due to its higher angular momentum. Although the initial magnetic field amplification within $\\lesssim 10\\ \\rm ms$ after merger is similar in both systems, the non-spinning system reaches stronger magnetic fields and higher energies at later times. For a detailed view of the multi-messenger observables, we extract the gravitational-wave signal and compute nucleosynthesis yields, the expected kilonova and afterglow light curves from our ejecta profiles.\n\n", "2510.14636": "2025-10-16, **Performance of the Prototype Station of the IceCube Surface Array Enhancement**, S. Shefali for the IceCube Collaboration et.al., [2510.14636v1](http://arxiv.org/abs/2510.14636v1)\n\n The prototype station of the Surface Array Enhancement at the IceCube Neutrino Observatory has been taking data in its final design since 2023. This station is part of the planned extension within the footprint of the existing surface array, IceTop. One station consists of 8 scintillator detectors, 3 radio antennas, and a central DAQ. The final upgrade of the scintillation detectors and their firmware at the prototype station has extended the dynamic range and increased the data-taking up-time, thereby expanding the observation window for air showers. This contribution will discuss the performance of the upgraded prototype station after commissioning and its angular resolution capabilities when observing air showers with the scintillation detectors and in coincidence with IceTop. Furthermore, the integration of additional stations during the most recent deployment will be discussed.\n\n"}, "dark matter": {"2510.14957": "2025-10-16, **Phantom Mirage from Axion Dark Energy**, Rayne Liu et.al., [2510.14957v1](http://arxiv.org/abs/2510.14957v1)\n\n Supernova (SN) and baryon acoustic oscillation (BAO) distance measures have recently provided hints that the dark energy is not only dynamical but apparently evolves from normal to phantom dark energy between redshifts $0<z<1$. A normal axion dark energy component in the mass range just below the Hubble scale can mimic a phantom component by appearing as dark energy at $z=1$ and dark matter at $z=0$, raising the possibility of a phantom mirage. We show that there is a wide range of axion dark energy contributions that can resolve the SN-BAO tension as well as thawing quintessence does, leaving BAO tension with the cosmic microwave background (CMB) for the distance measures from $z\\sim 1$ to recombination to be resolved at high redshifts. With axions, raising the optical depth to reionization to $\\tau \\approx 0.1$ works essentially as well as $w\\_0-w\\_a$ phantom dark energy for all but the lowE CMB data, with a remaining $\\Delta\\chi^2\\sim -16$ compared with $\\Lambda$CDM, whereas a small spatial curvature of $\\Omega\\_K \\sim 0.003$ can largely relax the full SN-BAO-CMB tension with a total $\\Delta\\chi^2 \\sim -12$.\n\n", "2510.14953": "2025-10-16, **Dark Matter Subhalos and Higher Order Catastrophes in Gravitational Wave Lensing**, Luka Vujeva et.al., [2510.14953v1](http://arxiv.org/abs/2510.14953v1)\n\n Gravitational lensing is an invaluable probe of the nature of dark matter, and the structures it forms. Lensed gravitational waves in particular allow for unparalleled sensitivity to small scale structures within the lenses, due to the precise time resolution in combination with the continuous monitoring of the entire sky. In this work, we show two distinct ways of using strongly lensed gravitational waves to identify the presence of dark matter subhalos: \\emph{{i)}} through higher order caustics generating high relative magnification ($\\mu\\_r > 2$), short time delay image pairs that break the caustic universality relations of single dark matter halos, which occur for $\\sim 1-10$ percent of strongly lensed events in our cold dark matter models, and \\emph{ii)} through the presence of more than three highly magnified images, which occur for $\\sim 0.01-1$ percent of the same simulated events. We find that these results are highly sensitive to the concentrations of subhalos in our simulations, and more mildly to their number densities. The presence of low-mass subhalos increases the probability of observing wave-optics lensing in lensed gravitational waves, which is studied by solving the diffraction integral with the stationary phase approximation, as well as numerically. We also report distinct quantitative and qualitative differences in the distributions of relative magnifications and time delays for subhalo populations with increased number densities or concentrations. With the upcoming detection of strongly lensed events by ground- and space- based detectors, comparisons against these simulated distributions will provide insight into the nature of dark matter.\n\n", "2510.14877": "2025-10-16, **Astrophysical uncertainties challenge 21-cm forecasts: A primordial black hole case study**, Dominic Agius et.al., [2510.14877v1](http://arxiv.org/abs/2510.14877v1)\n\n The 21-cm signal is a powerful probe of the early Universe's thermal history and could provide a unique avenue for constraining exotic physics. Previous studies have forecasted stringent constraints on energy injections from exotic sources that heat, excite, and ionize the background gas and thereby modify the 21-cm signal. In this work, we quantify the substantial impact that astrophysical uncertainties have on the projected sensitivity to exotic energy injection. In particular, there are significant uncertainties in the minimum star-forming dark matter halo mass, the Lyman-$\\alpha$ emission, and the X-ray emission, whose values characterize the fiducial astrophysical model when projecting bounds. As a case study, we investigate the energy injection of accreting primordial black holes of mass $\\sim 1~M\\_\\odot-10^3~M\\_\\odot$, also taking into account uncertainties in the accretion model. We show that, depending on the chosen fiducial model and accretion uncertainties, the sensitivity of future 21-cm data could constrain the abundance of primordial black holes to be either slightly stronger, or significantly weaker, than current limits from the Cosmic Microwave Background.\n\n", "2510.14833": "2025-10-16, **Non-exotic traversable wormholes with strong deflection angle in King and Dekel-Zhao dark matter halos under f(R,Lm) gravity**, Susmita Sarkar et.al., [2510.14833v1](http://arxiv.org/abs/2510.14833v1)\n\n In this article, we investigate asymptotically flat non-exotic traversable wormhole geometries within the King and Dekel-Zhao dark matter halos in the framework of $f(R, L\\_m)$ gravity. Two functional forms of the theory are considered: Model-I: $f(R, L\\_m)=(R/2) + L\\_m^{\\alpha}$ and Model-II: $f(R, L\\_m)=(R/2) + (1 + \\lambda R)L\\_m$. For both models, wormhole solutions are obtained and analyzed using the King and Dekel-Zhao dark matter density profiles, allowing us to explore how the underlying matter distribution influences the wormhole structures. The energy conditions are examined to verify the feasibility of sustaining the wormhole geometries with non-exotic matter, while embedding surfaces, proper radial distance, and total gravitational energy are studied to illustrate the wormhole's physical viability and traversability. Moreover, we test the strong deflection angle and its implications for gravitational lensing and show possible observational signatures of such wormhole configurations. Our results indicate that within $f(R, L\\_m)$ gravity, and for appropriate parameter choices, dark matter environments can sustain physically consistent non-exotic traversable wormhole geometries with distinct gravitational lensing signatures, providing new insights into the interplay between modified gravity, dark matter, and astrophysical observations.\n\n", "2510.14779": "2025-10-16, **The dark side of early galaxies: $\\texttt{geko}$ uncovers dark-matter fractions at $z\\sim4-6$**, A. Lola Danhaive et.al., [2510.14779v1](http://arxiv.org/abs/2510.14779v1)\n\n JWST/NIRCam slitless spectroscopy enables dynamical mass measurements for typical star-forming galaxies only a billion years after the Big Bang. We model the H$\\alpha$ morpho-kinematics of 163 galaxies at redshift $z\\approx4$-6 from FRESCO and CONGRESS (with JADES imaging), using the $\\texttt{geko}$ code, and infer rotational velocities and dispersions within $r\\_{\\rm e}$. Our sample spans $\\log M\\_{\\star}\\approx7$-10 and $\\log M\\_{\\rm dyn}\\approx9$-11. Gas masses are estimated via scaling relations, yielding baryonic masses and dark-matter (DM) fractions $f\\_{\\rm DM}(r<r\\_{\\rm e})$ within the H$\\alpha$ half-light radius. We find high median fractions of $\\langle f\\_{\\rm gas}\\rangle=0.77$ and $\\langle f\\_{\\rm DM}\\rangle=0.73$, where $f\\_{\\rm gas}$ is measured with respect to the baryonic mass and $f\\_{\\rm DM}$ with respect to the DM+baryonic mass. About two-thirds of systems are DM-dominated within $r\\_{\\rm e}\\sim0.5-1$ kpc. Both $f\\_{\\rm gas}$ and $f\\_{\\rm DM}$ decrease with stellar mass, consistent with simulations. The stellar Tully-Fisher relation shows a tentative offset to higher $v\\_{\\rm circ}$ at fixed $M\\_{\\star}$ and substantial intrinsic scatter, suggesting that the relation is only beginning to emerge at $z\\sim5$. We measure a negative correlation between $f\\_{\\rm DM}$ and baryonic surface density $\\Sigma\\_{\\rm bar}$, weaker but broadly consistent with trends at cosmic noon and at $z\\sim0$. Qualitatively comparing with modified NFW profiles coupled to an empirical stellar-to-halo mass relation suggests that the lowest $f\\_{\\rm DM}$ ($\\lesssim0.4$) require cored inner DM profiles, while the highest fractions favour cuspier profiles, potentially reflecting adiabatic contraction. Overall, the elevated $f\\_{\\rm gas}$ and $f\\_{\\rm DM}$ at $z\\gtrsim4$ are compatible with progenitors of baryon-dominated systems at $z\\sim2$ and naturally anticipate overmassive black holes at fixed $M\\_{\\star}$.\n\n", "2510.14766": "2025-10-16, **Predicting the Subhalo Mass Functions in Simulations from Galaxy Images**, Andreas Filipp et.al., [2510.14766v1](http://arxiv.org/abs/2510.14766v1)\n\n Strong gravitational lensing provides a powerful tool to directly infer the dark matter (DM) subhalo mass function (SHMF) in lens galaxies. However, comparing observationally inferred SHMFs to theoretical predictions remains challenging, as the predicted SHMF can vary significantly between galaxies - even within the same cosmological model - due to differences in the properties and environment of individual galaxies. We present a machine learning framework to infer the galaxy-specific predicted SHMF from galaxy images, conditioned on the assumed inverse warm DM particle mass $M^{-1}\\_{\\rm DM}$. To train the model, we use 1024 high-resolution hydrodynamical zoom-in simulations from the DREAMS suite. Mock observations are generated using Synthesizer, excluding gas particle contributions, and SHMFs are computed with the Rockstar halo finder. Our neural network takes as input both the galaxy images and the inverse DM mass. This method enables scalable, image-based predictions for the theoretical DM SHMFs of individual galaxies, facilitating direct comparisons with observational measurements.\n\n"}, "supernova": {"2510.14957": "2025-10-16, **Phantom Mirage from Axion Dark Energy**, Rayne Liu et.al., [2510.14957v1](http://arxiv.org/abs/2510.14957v1)\n\n Supernova (SN) and baryon acoustic oscillation (BAO) distance measures have recently provided hints that the dark energy is not only dynamical but apparently evolves from normal to phantom dark energy between redshifts $0<z<1$. A normal axion dark energy component in the mass range just below the Hubble scale can mimic a phantom component by appearing as dark energy at $z=1$ and dark matter at $z=0$, raising the possibility of a phantom mirage. We show that there is a wide range of axion dark energy contributions that can resolve the SN-BAO tension as well as thawing quintessence does, leaving BAO tension with the cosmic microwave background (CMB) for the distance measures from $z\\sim 1$ to recombination to be resolved at high redshifts. With axions, raising the optical depth to reionization to $\\tau \\approx 0.1$ works essentially as well as $w\\_0-w\\_a$ phantom dark energy for all but the lowE CMB data, with a remaining $\\Delta\\chi^2\\sim -16$ compared with $\\Lambda$CDM, whereas a small spatial curvature of $\\Omega\\_K \\sim 0.003$ can largely relax the full SN-BAO-CMB tension with a total $\\Delta\\chi^2 \\sim -12$.\n\n", "2510.14941": "2025-10-16, **Non-Minimally Coupled Quintessence in Light of DESI**, Samuel Sánchez López et.al., [2510.14941v1](http://arxiv.org/abs/2510.14941v1)\n\n We analyze a model of quintessence governed by an exponential potential and non-minimally coupled to gravity, in light of recent datasets, including cosmic microwave background, baryon acoustic oscillations, and supernovae distance moduli observations. Mainly focusing on the Palatini formulation of gravity, a phase space analysis reveals the existence of a late-time stable de Sitter attractor as long as the non-minimal coupling constant is negative, regardless of the value of the slope of the exponential. Fitting to CMB+DESI+DESY5 data, we find strong evidence for our model over $\\Lambda$CDM, with a Bayes factor $\\log B = 5.52$. Furthermore, the data seem to prefer dynamical dark energy at $>3\\sigma$ C.L. and a phantom crossing in the barotropic parameter of dark energy at $2-3\\sigma$ C.L.. We find that the scalar field dynamics in the Palatini formalism provides marginally better agreement to the data compared to the metric formalism.\n\n", "2510.14908": "2025-10-16, **Fermi Bubbles Without AGN: Gamma-Ray Bubbles in MHD Galaxy Formation Simulations with Full Cosmic Ray Spectra**, Isabel S. Sands et.al., [2510.14908v1](http://arxiv.org/abs/2510.14908v1)\n\n For the first time, we show in MHD simulations with cosmological initial conditions that bi-lobed gamma-ray outflows similar to the Fermi bubbles can form from star formation and supernova feedback, without involvement from active galactic nuclei (AGN). We use simulations run with full MHD and dynamical, on-the-fly multi-species cosmic ray transport in MeV-TeV energy bins to model gamma-ray emission in Milky Way-mass spiral galaxies from neutral pion decay, relativistic non-thermal Bremsstrahlung, and inverse Compton scattering. We find that these gamma-ray outflows are present in all three Milky-Way mass simulated galaxies. The amplitude, shape, and the composition of the gamma-ray spectrum of these bubbles fluctuates over time, with lepton-dominated and hadron-dominated phases. Spectra in which there is O(1) more gamma-ray flux from inverse Compton scattering than neutral pion decay are a good fit to the measured Fermi-LAT spectrum. Additionally, these simulations predict multi-wavelength features in soft x-rays and synchrotron radio, potentially providing new observational signatures that can connect the circumgalactic medium to cosmic ray physics and activity in the galactic center.\n\n", "2510.14875": "2025-10-16, **AREPO-RSG: Aspherical Circumstellar Material and Winds from Pulsating Dusty Red Supergiants in Global 3D Radiation Hydrodynamic Simulations**, Jing-Ze Ma et.al., [2510.14875v1](http://arxiv.org/abs/2510.14875v1)\n\n Recent observations have revealed a surprisingly large fraction of hydrogen-rich supernovae (SNe) interacting with dense confined circumstellar material (CSM), whose origin is heavily debated. Exploiting our recent implementation of a sophisticated radiation transport scheme in the moving-mesh code AREPO, we perform full-sphere 3D radiation hydrodynamic simulations of red supergiant envelopes. For $10\\, M\\_\\odot$ and $20\\, M\\_\\odot$ core-carbon-burning stars, we find that large-amplitude radial pulsations lift the surface material of density $10^{-14}$-$10^{-12}\\; \\mathrm{g\\; cm^{-3}}$ to the circumstellar environment up to $3\\times10^{14}$ cm, consistent with the inferred density for the interacting SN 2013fs. There, radiation acts on dust to drive highly anisotropic outflows of $10^{-6}$-$10^{-5}\\, M\\_\\odot\\, \\mathrm{yr^{-1}}$. The total CSM masses for both simulations are $\\sim 0.01\\, M\\_\\odot$. Due to convection, the CSM density structure has order-of-magnitude angular variations, dominated by large-scale asymmetries. We suggest that (1) the CSM around the progenitor is bound material instead of a widely-assumed steady wind, (2) highly aspherical CSM is common and can be created by surface convection rather than only from binary interactions, and (3) 3D effects need to be incorporated in 1D SN modeling, potentially via effective clumping. Based on our simulations, we propose a 1D analytical CSM model to be directly used for SN observable modeling. We predict that progenitor pulsations (seen in SN 2023ixf) and highly-confined CSM (seen in SN 2013fs) should be common among most hydrogen-rich SNe. This can be tested with progenitor monitoring using Rubin Observatory and near-future high-cadence surveys such as ULTRASAT and UVEX.\n\n", "2510.14469": "2025-10-16, **ALP couplings to muons and electrons: a comprehensive analysis of supernova bounds**, Ricardo Z. Ferreira et.al., [2510.14469v1](http://arxiv.org/abs/2510.14469v1)\n\n We provide a comprehensive analysis of the phenomenology of axion-like particles (ALPs) produced in core-collapse supernovae (ccSNe) through interactions with electrons and muons, both of which have a non-negligible abundance in the SN plasma. We identify and calculate six significant ALP-production channels, two of which are loop-level processes involving photons. We then examine several observational constraints on the ALP-electron and ALP-muon parameter spaces. Those include the bounds on anomalous cooling, energy deposition, decay into photons, diffuse gamma rays, and the 511 keV line. Our results provide updated and robust constraints on ALP couplings to electrons and muons from an improved treatment of production and absorption processes. Furthermore, we quantify the uncertainties of the results by using three state-of-the-art supernova models based on two independent simulation codes, finding that constraints vary by factors of O(2-10).\n\n", "2510.14390": "2025-10-16, **Evidence for the dynamical dark energy with evolving Hubble constant**, Yi-Ying Wang et.al., [2510.14390v1](http://arxiv.org/abs/2510.14390v1)\n\n Hubble constant tension, together with the recent indications of dynamical dark energy proposed from the Dark Energy Spectroscopic Instrument (DESI) baryon acoustic oscillation (BAO) measurements, poses significant challenges to the standard cosmological model. In this work, we perform a model-independent reconstruction of the dark-energy equation of state $w(z)$, jointly with an evolving Hubble constant $H\\_0(z)$. Using the DESI DR2 data combined with multiple type Ia supernova samples, we find that $w(z)$ varies with redshift and exhibits two potential phantom crossings at $z\\sim0.5$ and $z\\sim1.5$. Meanwhile, $H\\_0$ decreases continually from local to high redshift, alleviating the Hubble constant tension effectively. The joint $w(z)$-$H\\_0(z)$ model is strongly favored over the $w$CDM ($\\Lambda$CDM) framework, with a logarithmic Bayes factor $\\ln \\boldsymbol{\\mathcal B}= 5.04~(8.53)$. Across various prior assumptions and dataset combinations, we obtain consistent, data-driven reconstructions of both $w(z)$ and $H\\_0(z)$. Future BAO measurements from Euclid and next-generation CMB experiments will provide critical tests of these results and bring deeper insights into the nature of dark energy and the evolution of cosmic expansion.\n\n", "2510.14202": "2025-10-16, **Hierarchical Simulation-Based Inference of Supernova Power Sources and their Physical Properties**, Edgar P. Vidal et.al., [2510.14202v1](http://arxiv.org/abs/2510.14202v1)\n\n Time domain surveys such as the Vera C. Rubin Observatory are projected to annually discover millions of astronomical transients. This and complementary programs demand fast, automated methods to constrain the physical properties of the most interesting objects for spectroscopic follow up. Traditional approaches to likelihood-based inference are computationally expensive and ignore the multi-component energy sources powering astrophysical phenomena. In this work, we present a hierarchical simulation-based inference model for multi-band light curves that 1) identifies the energy sources powering an event of interest, 2) infers the physical properties of each subclass, and 3) separates physical anomalies in the learned embedding space. Our architecture consists of a transformer-based light curve summarizer coupled to a flow-matching regression module and a categorical classifier for the physical components. We train and test our model on $\\sim$150k synthetic light curves generated with $\\texttt{MOSFiT}$. Our network achieves a 90% classification accuracy at identifying energy sources, yields well-calibrated posteriors for all active components, and detects rare anomalies such as tidal disruption events (TDEs) through the learned latent space. This work demonstrates a scalable joint framework for population studies of known transients and the discovery of novel populations in the era of Rubin.\n\n"}}