{"neutrino": {"2503.09426": "2025-03-12, **Investigating the correlation between ZTF TDEs and IceCube high-energy neutrinos**, Ming-Xuan Lu et.al., [2503.09426v1](http://arxiv.org/abs/2503.09426v1)\n\n The main contributors of the IceCube diffuse neutrino flux remain unclear. Tidal disruption events (TDEs) have been proposed as potential emitters of the high-energy neutrinos detected by IceCube. Therefore, investigating the correlation between the TDE population and IceCube neutrinos could help us better understand whether the TDE population could be potential high-energy neutrino emitters. In this paper, we perform a systematic search for TDEs that are associated with neutrinos in a sample including 143 IceCube neutrino alert events and 61 TDEs classified by the Zwicky Transient Facility (ZTF) - Bright Transient Survey (BTS). Furthermore, considering that the TDEs/TDE candidates reported as potential IceCube neutrino emitters are all accompanied by infrared (IR) observations, we further select the TDEs with IR observations from these 61 TDEs as a subsample to examine the correlation with neutrinos. Based on the Wide-field Infrared Survey Explorer (WISE) mission database, seven TDEs are identified as having IR observations. Due to good spatial localization is crucial for association analysis, we employ two methods to handle alert events with large error radii in our sample. Then we employ three Monte Carlo simulation methods to investigate the correlation between TDE sample/subsample and IceCube neutrinos. Finally, after considering spatial and temporal criteria, seven TDEs with IR flares show the most significant correlation at a 2.43{\\sigma} confidence level. If we tentatively further take the time delay factor into account in the weighting scheme, the correlation enhances to 2.54{\\sigma} confidence level.\n\n", "2503.09401": "2025-03-12, **Graph-based Full Event Interpretation: a graph neural network for event reconstruction in Belle II**, Merna Abumusabh et.al., [2503.09401v1](http://arxiv.org/abs/2503.09401v1)\n\n In this work we present the Graph-based Full Event Interpretation (GraFEI), a machine learning model based on graph neural networks to inclusively reconstruct events in the Belle~II experiment. Belle~II is well suited to perform measurements of $B$ meson decays involving invisible particles (e.g. neutrinos) in the final state. The kinematical properties of such particles can be deduced from the energy-momentum imbalance obtained after reconstructing the companion $B$ meson produced in the event. This task is performed by reconstructing it either from all the particles in an event but the signal tracks, or using the Full Event Interpretation, an algorithm based on Boosted Decision Trees and limited to specific, hard-coded decay processes. A recent example involving the use of the aforementioned techniques is the search for the $B^+ \\to K^+ \\nu \\bar \\nu$ decay, that provided an evidence for this process at about 3 standard deviations. The GraFEI model is trained to predict the structure of the decay chain by exploiting the information from the detected final state particles only, without making use of any prior assumptions about the underlying event. By retaining only signal-like decay topologies, the model considerably reduces the amount of background while keeping a relatively high signal efficiency. The performances of the model when applied to the search for $B^+ \\to K^+ \\nu \\bar \\nu$ are presented.\n\n", "2503.09280": "2025-03-12, **eV-scale sterile neutrino: A window open to non-unitarity?**, Hisakazu Minakata et.al., [2503.09280v1](http://arxiv.org/abs/2503.09280v1)\n\n An excess observed in the accelerator neutrino experiments in the $\\nu\\_{\\mu} \\rightarrow \\nu\\_{e}$ channel at high confidence level (CL) has been interpreted as due to eV-scale sterile neutrino(s). But, it has been suffered from the problem of ``appearance - disappearance tension'' at the similarly high CL because the measurements of the $\\nu\\_{\\mu} \\rightarrow \\nu\\_{\\mu}$ channel do not observe the expected event number depletion corresponding to the sterile contribution in the appearance channel. We suggest non-unitarity as a simple and natural way of resolving the tension, which leads us to construct the non-unitary $(3+1)$ model. With reasonable estimation of the parameters governing non-unitarity, we perform an illustrative analysis to know if the tension is resolved in this model. At the best fit of the appearance signature we have found the unique solution with $\\sin^2 2\\theta\\_{14} \\approx 0.3$, which is consistent with the (reactors + Ga) data combined fit. Unexpectedly, our tension-easing mechanism bridges between the two high CL signatures, the BEST and LSND-MiniBooNE anomalies.\n\n", "2503.09108": "2025-03-12, **ASKAP and VLASS search for a radio-continuum counterpart of ultra-high-energy neutrino event KM3-230213A**, M. D. Filipović et.al., [2503.09108v1](http://arxiv.org/abs/2503.09108v1)\n\n We present the results of an Australian Square Kilometre Array Pathfinder (ASKAP) 944 MHz and Very Large Array Sky Survey (VLASS) 3~GHz search for a radio-continuum counterpart of the recent ultra-high-energy (UHE) neutrino event, KM3-230213A. Using (ASKAP), we catalog 1052 radio sources within the 1.5$^\\circ$ radius search area (68% certainty region) around the particle's calculated origin, 10 of which we classify as blazar candidates based on their radio spectra. The most prominent radio source in the search area is the nearby spiral galaxy UGCA 127 (nicknamed Phaedra, From Greek: $\\phi\\alpha i\\delta\\rho\\alpha$, a Cretan princess of Greek Mythology, derived from Phaidros, Greek: ${\\phi}{\\alpha}{\\iota}{\\delta}{\\rho}o{\\varsigma}$, meaning 'bright'.). Its non-thermal radio spectrum classifies it as a non-blazar active galactic nucleus (AGN). We also present an extended radio source, WISEA J061715.89-075455.4 (nicknamed Hebe, From Greek: $H{\\beta}{\\eta}$, the Greek goddess of youth.), located only ~7' from the geometric center of the search area, with a very unusual highly polarized compact component. Finally, we present a strong radio source, EMU J062248-072246 (nicknamed Narcissus, From Greek $N{\\alpha}{\\rho}{\\kappa}{\\iota}{\\sigma}{\\sigma}o{\\zeta}$ was a self-absorbed hunter from Thespiae in Boeotia.), which has a maximum self-absorption spectral slope of +2.5 at low frequencies, and exhibits ~25% flux density variability over the ~5-year VLASS 3~GHz survey.\n\n", "2503.09031": "2025-03-12, **PMT calibration for the JSNS2-II far detector with an embedded LED system**, Jisu Park et.al., [2503.09031v1](http://arxiv.org/abs/2503.09031v1)\n\n The JSNS2-II (the second phase of JSNS2, J-PARC Sterile Neutrino Search at J-PARC Spallation Neutron Source) is an experiment aimed at searching for sterile neutrinos. This experiment has entered its second phase, employing two liquid scintillator detectors located at near and far positions from the neutrino source. Recently, the far detector of the experiment has been completed and is currently in the calibration phase. This paper presents a detailed description of the calibration process utilizing the LED system. The LED system of the far detector uses two Ultra-Violet (UV) LEDs, which are effective in calibrating all of PMTs at once. The UV light is converted into the visible light wavelengths inside liquid scintillator via the wavelength shifters, providing pseudo-isotropic light. The properties of all functioning Photo-Multiplier-Tubes (PMTs) to detect the neutrino events in the far detector, such as gain, its dependence of supplied High Voltage (HV), and Peak-to-Valley (PV) were calibrated. To achieve a good energy resolution for physics events, up to 10% of the relative gain adjustment is required for all functioning PMTs. This will be achieved using the measured HV curves and the LED calibration. The Peak-to-Valley (PV) ratio values are the similar to those from the production company, which distinguish the single photo-electron signal from the pedestal. Additionally, the precision of PMT signal timing is measured to be 2.1 ns, meeting the event reconstruction requirement of 10 ns.\n\n", "2503.09005": "2025-03-12, **Progenitor Dependence of Neutrino-driven Supernova Explosions with the Aid of Heavy Axion-like Particles**, Tsurugi Takata et.al., [2503.09005v1](http://arxiv.org/abs/2503.09005v1)\n\n We perform spherically symmetric simulations of core-collapse supernovae with the aid of heavy axion-like particles (ALPs) which interact with photons and redistribute energy within supernova matter. We explore a wide ALP parameter space that includes MeV-scale ALP mass $m\\_{\\,a}$ and the ALP-photon coupling constant $g\\_{\\,a \\gamma} \\sim 10^{\\,-10} \\, \\rm{GeV}^{\\,-1}$ , employing three progenitor models with zero-age main-sequence mass of $11.2\\,M\\_\\odot$, $20.0\\,M\\_\\odot$, and $25.0\\,M\\_\\odot$. We find a general trend that, given $m\\_{\\,a}\\lesssim 300\\,$MeV, heavier ALPs are favorable for the shock wave to be successfully revived, aiding the onset of the neutrino-driven explosion. However, if ALPs are heavier than $\\sim 400\\,$MeV, the explosion is failed or weaker than that for the models with smaller $m\\_{\\,a}$, because of an insufficient temperature inside the supernova core to produce heavy ALPs. The maximum temperature in the core depends on the initial progenitor structure. Our simulations indicate that the high-temperature environment in the collapsing core of massive progenitors leads to a significant impact of ALPs on the explodability.\n\n", "2503.08859": "2025-03-11, **Low-Energy Backgrounds in Solid-State Phonon and Charge Detectors**, Daniel Baxter et.al., [2503.08859v1](http://arxiv.org/abs/2503.08859v1)\n\n Solid-state phonon and charge detectors probe the scattering of weakly interacting particles, such as dark matter and neutrinos, through their low recoil thresholds. Recent advancements have pushed sensitivity to eV-scale energy depositions, uncovering previously-unseen low-energy excess backgrounds. While some arise from known processes such as thermal radiation, luminescence, and stress, others remain unexplained. This review examines these backgrounds, their possible origins, and parallels to low-energy effects in solids. Their understanding is essential for interpreting particle interactions at and below the eV-scale.\n\n", "2503.08830": "2025-03-11, **Leptogenesis and Neutrino Masses Via Pseudo-Dirac Gauginos**, Cem Murat Ayber et.al., [2503.08830v1](http://arxiv.org/abs/2503.08830v1)\n\n In a $U(1)\\_{R-L}$-symmetric supersymmetric model, pseudo-Dirac bino and wino can act like right-handed neutrinos, generating the light neutrino masses through a hybrid Type I + III inverse seesaw mechanism. We investigate such a model to accommodate the baryon asymmetry of the universe together with neutrino masses. A pseudo-Dirac gaugino goes under particle-antiparticle oscillations. Possible $CP$ violation in bino decays, induced by mixing with the neutrinos, can be enhanced in bino--antibino oscillations. Focusing on a long-lived bino, we show that its oscillations and decays can generate the observed baryon asymmetry while the wino is responsible for generating the neutrino masses. This mechanism requires a decoupled mass spectrum with a bino of mass $M\\_{\\tilde{B}}\\sim O({\\rm TeV})$ and sfermions with mass $M\\_{\\rm sf}\\gtrsim 25$ TeV. Furthermore, for the bino to decay out-of-equilibrium before the electroweak sphalerons turn off, the messenger scale needs to be $\\Lambda\\_M \\sim O(10^7~ {\\rm TeV})$. We discuss the displaced vertex signals at the LHC resulting from such a high messenger scale.\n\n", "2503.08807": "2025-03-11, **Project 8 Apparatus for Cyclotron Radiation Emission Spectroscopy with $^\\mathrm{83m}$Kr and Tritium**, A. Ashtari Esfahani et.al., [2503.08807v1](http://arxiv.org/abs/2503.08807v1)\n\n Cyclotron Radiation Emission Spectroscopy (CRES) is a novel technique for the precise measurement of relativistic electron energy. This technique is being employed by the Project~8 collaboration for measuring a high-precision tritium beta decay spectrum to perform a frequency-based measurement of the neutrino mass. In this work, we describe the Project 8 Phase II apparatus, used for the detection of the CRES signal from the conversion electrons of $\\mathrm{^{83m}Kr}$ and the first CRES measurement of the beta-decay spectrum of molecular tritium.\n\n", "2503.08667": "2025-03-11, **Extreme Jet Beaming Observed in Neutrino-Associated Blazars**, Alexander V. Plavin et.al., [2503.08667v1](http://arxiv.org/abs/2503.08667v1)\n\n Bright blazars were found to be prominent neutrino sources, and a number of IceCube events were associated with them over recent years. A particularly strong observational connection is present between neutrinos and blazars with bright, Doppler-boosted, parsec-scale radio emission. In this work, we further explore the nature of this connection by examining the jet geometry and kinematics of neutrino-associated blazars. We find that these blazars demonstrate remarkably strong jet beaming, even compared to other radio-bright sources. Their Doppler and Lorentz factors are larger, and viewing angles are smaller than for other blazars in the complete uniformly selected MOJAVE sample. Observationally, this serves as yet another piece of evidence for blazars forming a major population of neutrino sources. The strong neutrino-beaming correlation indicates that high-energy neutrino velocity is predominantly oriented along the jet, and the original PeV-scale protons exhibit a relativistic bulk motion along the jet. It suggests that neutrino production happens not too close to the black hole, but rather at sub-parsec distances, where the jet is already accelerated.\n\n", "2503.08439": "2025-03-11, **Testing the dark origin of neutrino masses with oscillation experiments**, Andrew Cheek et.al., [2503.08439v1](http://arxiv.org/abs/2503.08439v1)\n\n The origin of neutrino masses remains unknown to date. One popular idea involves interactions between neutrinos and ultralight dark matter, described as fields or particles with masses $m\\_\\phi \\ll 10\\,\\mathrm{eV}$. Due to the large phase-space number density, this type of dark matter exists in coherent states and can be effectively described by an oscillating classical field. As a result, neutrino mass-squared differences undergo field-induced interference in spacetime, potentially generating detectable effects in oscillation experiments. We demonstrate that if $m\\_\\phi\\gg 10^{-14}\\,\\mathrm{eV}$, the mechanism becomes sensitive to dark matter density fluctuations, which suppresses the oscillatory behavior of flavor-changing probabilities as a function of neutrino propagation distance in a model-independent way, thereby ruling out this regime. Furthermore, by analyzing data from the Kamioka Liquid Scintillator Antineutrino Detector (KamLAND), a benchmark long-baseline reactor experiment, we show that the hypothesis of a dark origin for the neutrino masses is disfavored for $m\\_\\phi \\ll 10^{-14}\\,\\mathrm{eV}$, compared to the case of constant mass values in vacuum. This result holds at more than the 4$\\sigma$ level across different datasets and parameter choices. The mass range $10^{-17}\\,\\mathrm{eV} \\lesssim m\\_\\phi \\lesssim 10^{-14}\\,\\mathrm{eV}$ can be further tested in current and future oscillation experiments by searching for time variations (rather than periodicity) in oscillation parameters.\n\n", "2503.08273": "2025-03-11, **Neutrino Mass Matrix with broken Scaling in light of LMA and Dark-LMA Solutions**, Ajay Kumar et.al., [2503.08273v1](http://arxiv.org/abs/2503.08273v1)\n\n In the present work we have investigated some patterns of broken ``scaling\" ansatz of the neutrino mass matrix. The scaling neutrino mass matrix is disallowed by the current neutrino oscillation data as, among others, it predicts vanishing reactor angle ($\\theta\\_{13}=0$). We study its possible breaking scenarios in light of the large mixing angle (LMA) and Dark-LMA solutions suggested by current neutrino oscillation data. The normal hierarchical neutrino mass spectrum is ruled out in all three possible breaking patterns. Also, one of the interesting features of these breaking scenarios is the interplay between $\\theta\\_{23}$-octant and possible CP violation. We find that the model allows maximal CP violation for $\\theta\\_{23}$ above $6\\%$ of its maximal value which, interestingly, is close to its current best-fit value for inverted hierarchical neutrino masses. We have, also, investigated the implications for effective Majorana neutrino mass parameter $\\|M\\_{ee}\\|$ for allowed breaking patterns. The correlation behavior of Majorana CP phases, which can be probed in $0\\nu\\beta\\beta$ decay experiments, is found to have the capability of distinguishing LMA and Dark-LMA solutions.\n\n"}, "dark matter": {"2503.09104": "2025-03-12, **Dark matter distributions around Schwarzschild-like black holes in bumblebee and Kalb-Ramond models**, Minghong Yu et.al., [2503.09104v1](http://arxiv.org/abs/2503.09104v1)\n\n A central black hole can attract a dark matter cluster and generate a spike in the density profile, as demonstrated by detailed analysis of Schwarzschild and Kerr black holes in the past. Do different black holes attract dark matter differently? To get a fair answer to this question, we customize a relativistic framework to grow general static spherical black holes in dark matter halos and investigate how deviations from the Schwarzschild geometry modify the dark matter spike for the first time. The framework is applied to a class of Schwarzschild-like black hole solutions in Lorentz-violated gravity models -- one in the bumblebee model and two in the Kalb-Ramond model. For these black holes, the answer is no if initially the dark matter has a constant distribution, but the answer is yes if it has a Hernquist profile initially.\n\n", "2503.09082": "2025-03-12, **Search of High-Frequency Variations of Fundamental Constants Using Spin-based Quantum Sensors**, Xi Kong et.al., [2503.09082v1](http://arxiv.org/abs/2503.09082v1)\n\n This study presents a novel method using spin quantum sensors to explore temporal variations of fundamental constants, significantly expanding the frequency range and providing constraints on scalar dark matter.\n\n", "2503.08897": "2025-03-11, **Rekindling s-Wave Dark Matter Annihilation Below 10GeV with Breit-Wigner Effects**, Geneviève Bélanger et.al., [2503.08897v1](http://arxiv.org/abs/2503.08897v1)\n\n Velocity-independent (s-wave) annihilation of thermal Dark Matter is ruled out by CMB data for masses below 10GeV, effectively ruling out the possibility of indirectly detecting it in this mass range. We demonstrate in a model-independent framework that Breit-Wigner effects from very narrow resonances can circumvent CMB constraints, thereby reviving the potential to detect s-wave DM annihilation in the present Universe. The density of resonant s-wave Dark Matter continues to evolve long after chemical decoupling, leading to a scenario we refer to as belated freeze-out, where kinetic decoupling plays a significant role in determing the relic density.\n\n", "2503.08787": "2025-03-11, **Echoes of Self-Interacting Dark Matter from Binary Black Hole Mergers**, Amitayus Banik et.al., [2503.08787v1](http://arxiv.org/abs/2503.08787v1)\n\n Dark matter (DM) environments around black holes (BHs) can influence their mergers through dynamical friction, causing gravitational wave (GW) dephasing during the inspiral phase. While this effect is well studied for collisionless dark matter (CDM), it remains unexplored for self-interacting dark matter (SIDM) due to the typically low DM density in SIDM halo cores. In this work, we show that SIDM models with a massive force mediator can support dense enough DM spikes, significantly affecting BH mergers and producing a distinct GW dephasing. Using ${N}$-body simulations, we analyze GW dephasing in binary BH inspirals within CDM and SIDM spikes. By tracking the binary's motion in different SIDM environments, we show that the Laser Interferometer Space Antenna (LISA) can distinguish DM profiles shaped by varying DM interaction strengths, revealing detailed properties of SIDM.\n\n", "2503.08659": "2025-03-11, **On new physics off the Z peak in $H \\rightarrow \\ell^+\\ell^- γ$**, Aliaksei Kachanovich et.al., [2503.08659v1](http://arxiv.org/abs/2503.08659v1)\n\n Motivated by a small but intriguing excess observed in the decay mode $ H\\rightarrow \\ell^+\\ell^- \\gamma$ reported by both the ATLAS and CMS collaborations, we explore the possibility that new physics contributes directly to the effective $ H \\ell \\overline{\\ell} \\gamma $ coupling rather than modifying the $ Z $ peak. Concretely, we consider a dimension-8 operator that could arise from new particles via box diagrams. Such non-resonant contribution may provide an alternative origin for current or future excesses. We examine how experimental cuts may distinguish between possible modifications of the $ Z $ peak and non-resonant contributions. The currently measured excess requires that the new physics scale is relatively low $( \\Lambda\\_R \\sim v $). However, we show that it may remain within current experimental bounds. In particular, we illustrate this using a simplified model, motivated by the dark matter problem, and discuss its other experimental constraints.\n\n", "2503.08586": "2025-03-11, **CSST Strong Lensing Preparation: Fast Modeling of Galaxy-Galaxy Strong Lenses in the Big Data Era**, Xiaoyue Cao et.al., [2503.08586v1](http://arxiv.org/abs/2503.08586v1)\n\n Galaxy-galaxy strong lensing provides a powerful probe of galaxy formation, evolution, and the properties of dark matter and dark energy. However, conventional lens-modeling approaches are computationally expensive and require fine-tuning to avoid local optima, rendering them impractical for the hundreds of thousands of lenses expected from surveys such as Euclid, CSST, and Roman Space Telescopes. To overcome these challenges, we introduce TinyLensGPU, a GPU-accelerated lens-modeling tool that employs XLA-based acceleration with JAX and a neural-network-enhanced nested sampling algorithm, nautilus-sampler. Tests on 1,000 simulated galaxy-galaxy lenses demonstrate that on an RTX 4060 Ti GPU, TinyLensGPU achieves likelihood evaluations approximately 2,000 times faster than traditional methods. Moreover, the nautilus-sampler reduces the number of likelihood evaluations by a factor of 3, decreasing the overall modeling time per lens from several days to roughly 3 minutes. Application to 63 SLACS lenses observed by the Hubble Space Telescope recovers Einstein radii consistent with the literature values (within $\\lesssim 5\\%$ deviation), which is within known systematic uncertainties. Catastrophic failures, where the sampler becomes trapped in local optima, occur in approximately 5\\% of the simulated cases and 10\\% of the SLACS sample. We argue that such issues are inherent to automated lens modeling but can be mitigated by incorporating prior knowledge from machine learning techniques. This work thus marks a promising step toward the efficient analysis of strong lenses in the era of big data. The code and data are available online: https://github.com/caoxiaoyue/TinyLensGpu.\n\n", "2503.08528": "2025-03-11, **Effect of generic dark matter halo on transonic accretion onto galactic black holes**, Avijit Chowdhury et.al., [2503.08528v1](http://arxiv.org/abs/2503.08528v1)\n\n The environment surrounding a black hole or black hole binaries is generally expected to play an important role in understanding various astrophysical phenomena around them. In this paper, we study relativistic, low angular momentum, inviscid, and advective hot accretion flow onto a galactic supermassive black hole dressed with a cold dark matter halo. Focusing on different relativistic dark matter distributions with an inner density spike, we analyze the effect of the dark matter halo on the topology and properties of the accretion flow. Our results show enhancement of disk luminosity in the presence of dark matter, which depends on the nature and properties (halo mass and compactness) of the dark matter distribution. Since the dominant contribution to the disk luminosity for compact and massive halo comes from the inner region of the accretion disk, our analysis suggests that luminosity measurement can indeed be useful to probe the exact nature of the dark matter density spike.\n\n", "2503.08468": "2025-03-11, **Flow and thermal modelling of the argon volume in the DarkSide-20k TPC**, DarkSide-20k Collaboration et.al., [2503.08468v1](http://arxiv.org/abs/2503.08468v1)\n\n The DarkSide-20k dark matter experiment, currently under construction at LNGS, features a dual-phase time projection chamber (TPC) with a ~50 t argon target from an underground well. At this scale, it is crucial to optimise the argon flow pattern for efficient target purification and for fast distribution of internal gaseous calibration sources with lifetimes of the order of hours. To this end, we have performed computational fluid dynamics simulations and heat transfer calculations. The residence time distribution shows that the detector is well-mixed on time-scales of the turnover time (~40 d). Notably, simulations show that despite a two-order-of-magnitude difference between the turnover time and the half-life of $^{83\\text{m}}$Kr of 1.83 h, source atoms have the highest probability to reach the centre of the TPC 13 min after their injection, allowing for a homogeneous distribution before undergoing radioactive decay. We further analyse the thermal aspects of dual-phase operation and define the requirements for the formation of a stable gas pocket on top of the liquid. We find a best-estimate value for the heat transfer rate at the liquid-gas interface of 62 W with an upper limit of 144 W and a minimum gas pocket inlet temperature of 89 K to avoid condensation on the acrylic anode. This study also informs the placement of liquid inlets and outlets in the TPC. The presented techniques are widely applicable to other large-scale, noble-liquid detectors.\n\n", "2503.08742": "2025-03-11, **Investigating shadow of a rotating charged black hole with a cosmological constant immersed in the perfect fluid dark matter**, Zheng-Long Ban et.al., [2503.08742v1](http://arxiv.org/abs/2503.08742v1)\n\n In this paper, we mainly investigate the shadow of a rotating charged black hole with a cosmological constant immersed in perfect fluid dark matter. We first obtain the charged spherically symmetric black hole with a cosmological constant solution immersed in perfect fluid dark matter by using the gravitational decoupling method. Based on the mass function seed source of the spherically symmetric solution, we construct a rotating charged black hole with a cosmological constant immersed in perfect fluid dark matter, and study the effects of the perfect fluid dark matter parameter $\\alpha$, cosmological constant $\\Lambda$, electric charge $Q$, and rotating parameter $a$ on the event horizons of the rotating black hole. We then derive the geodesic equation of photon of the rotating charged black hole with a cosmological constant immersed in perfect fluid dark matter. In addition, we analyze the influences of the four black hole parameters on the effective potential functions of photon, the boundaries, and the deformations of the rotating black hole shadows. Particularly, we find that the effects of the $\\alpha$ on the event horizons, the effective potential functions, the boundaries, and the deformations of the black hole shadows are more obvious than the other three parameters ($\\Lambda, Q$, and $a$). We expect our results will be useful in the future to relate the theoretical models of perfect fluid dark matter and dark energy with observations of celestial bodies immersed in dark matter and dark energy.\n\n", "2503.08733": "2025-03-11, **Are dark matter and dark energy omnipresent?**, Richard Lieu et.al., [2503.08733v1](http://arxiv.org/abs/2503.08733v1)\n\n A set of temporal singularities (transients) in the mass-energy density and pressure, bearing a specific mathematical structure which represents a new solution to the continuity equation (\\ie~conservation of mass-energy) and satisfying the strong energy condition, is proposed to account for the expansion history of a homogeneous Universe, and the formation and binding of large scale structures as a continuum approximation of their cumulative effects. These singularities are unobservable because they occur rarely in time and are unresolvably fast, and that could be the reason why dark matter and dark energy have not been found. Implication on inflationary cosmology is discussed. The origin of these temporal singularities is unknown, safe to say that the same is true of the moment of the Big Bang itself. This work complements a recent paper, where a topological defect in the form of a spatial, spherical shell of density singularity giving rise to a 1/r attractive force (to test particles of positive mass) but zero integrated mass over a large volume of space, was proposed to solve the dark matter problem in bound structures but not cosmic expansion. The idea also involved a negative density, which is not present in the current model.\n\n"}, "supernova": {"2503.09599": "2025-03-12, **Hints of Primordial Magnetic Fields at Recombination and Implications for the Hubble Tension**, Karsten Jedamzik et.al., [2503.09599v1](http://arxiv.org/abs/2503.09599v1)\n\n Primordial Magnetic Fields (PMFs), long studied as potential relics of the early Universe, accelerate the recombination process and have been proposed as a possible way to relieve the Hubble tension. However, previous studies relied on simplified toy models. In this study, for the first time, we use the recent high-precision evaluations of recombination with PMFs, incorporating full magnetohydrodynamic (MHD) simulations and detailed Lyman-alpha radiative transfer, to test PMF-enhanced recombination ($b\\Lambda$CDM) against observational data from the cosmic microwave background (CMB), baryon acoustic oscillations (BAO), and Type Ia supernovae (SN). Focusing on non-helical PMFs with a Batchelor spectrum, we find a preference for present-day total field strengths of approximately 5-10 pico-Gauss. Depending on the dataset combination, this preference ranges from mild ($\\sim 1.8\\sigma$ with Planck + DESI) to moderate ($\\sim 3\\sigma$ with Planck + DESI + SH0ES-calibrated SN) significance. The $b\\Lambda$CDM has Planck + DESI $\\chi^2$ values equal or better than those of the $\\Lambda$CDM model while predicting a higher Hubble constant. The favored field strengths align closely with those required for cluster magnetic fields to originate entirely from primordial sources, without the need for additional dynamo amplification or stellar magnetic field contamination. Future high-resolution CMB temperature and polarization measurements will be crucial for confirming or further constraining the presence of PMFs at recombination.\n\n", "2503.08812": "2025-03-11, **ASASSN-13dn: A Luminous and Double-Peaked Type II Supernova**, E. Hueichapán et.al., [2503.08812v1](http://arxiv.org/abs/2503.08812v1)\n\n We present observations of ASASSN-13dn, one of the first supernovae discovered by ASAS-SN, and a new member of the rare group of Luminous Type II Supernovae (LSNe II). It was discovered near maximum light, reaching an absolute magnitude of M$\\_{v}$ $\\sim$ -19 mag, placing this object between normal luminosity type II SNe and superluminous SNe A detailed analysis of the photometric and spectroscopic data of ASASSN-13dn is performed. The spectra are characterized by broad lines, in particular the H$\\alpha$ lines where we measure expansion velocities ranging between 14000 - 6000 km s$^{-1}$ over the first 100 days. H$\\alpha$ dominates the nebular spectra, and we detect a narrow P-Cygni absorption within the broader emission line with an expansion velocity of 1100 km s$^{-1}$. Photometrically, its light curve shows a re-brightening of $\\sim$ 0.6 mag in the $gri$ bands starting at 25$\\pm$2 days after discovery, with a secondary peak at $\\sim 73$d, followed by an abrupt and nearly linear decay of 0.09 mag d$^{-1}$ for the next 35 days. At later times, after a drop of 4 magnitudes from the second maximum, the light curves of ASASSN-13dn shows softer undulations from 125 to 175 days. We compare ASASSN-13dn with other LSNe II in the literature, finding no match to both light curve and spectroscopic properties. We discuss the main powering mechanism and suggest that interaction between the ejecta and a dense CSM produced by eruptions from an LBV-like progenitor could potentially explain the observations.\n\n", "2503.08790": "2025-03-11, **Multi-Phase Shock Cooling Emission in Ultra-Stripped Supernovae**, Annastasia Haynie et.al., [2503.08790v1](http://arxiv.org/abs/2503.08790v1)\n\n Ultra-stripped and Type Ibn supernovae (USSNe and SNe Ibn, respectively) are fast-evolving, hydrogen-poor transients that often show signs of interaction with dense circumstellar material (CSM). Wu & Fuller (2022) identify a mass range for helium-core stars in which they expand significantly during core oxygen/neon burning, resulting in extreme late-stage mass loss in tight binaries ($P\\sim1-100\\,{\\rm days}$). Here we explore the resulting light curves from a subset of models from Wu & Fuller (2022) and find that in some cases they can exhibit two phases of shock cooling emission (SCE). The first SCE is attributed to the circumbinary material, and the second SCE is from the extended helium-burning envelope of the exploding star. Since SCE luminosity is roughly proportional to the initial radius of the emitting material, events that exhibit both phases of SCE provide the exciting opportunity of measuring both the extent of the CSM and the radius of the exploding star. These light curves are explored with both analytic arguments and numerical modeling, and from this we identify the parameter space of CSM mass, helium envelope mass, and nickel mass, for which the helium envelope SCE will be visible. We provide a qualitative comparison of these models to two fast-evolving, helium-rich transients, SN2019kbj and SN2019dge. The similarity between these events and our models demonstrates that this extreme binary mass loss mechanism may explain some SNe Ibn and USSNe.\n\n", "2503.08768": "2025-03-11, **Precursor Activity Preceding Interacting Supernovae I: Bridging the Gap with SN 2022mop**, S. J. Brennan et.al., [2503.08768v1](http://arxiv.org/abs/2503.08768v1)\n\n Over the past two decades, an increasing number of transients have shown luminous activity at their explosion sites weeks to years before an interacting supernova (SN) is observed. For some objects, this pre-SN activity is typically linked to large-scale mass-loss events preceding core collapse, yet its triggering mechanism and the underlying explosion process remain uncertain. We present SN 2022mop, which was initially observed in August 2022, exhibiting nebular emission, including [O I], Mg I], and [Ca II], resembling the late-time (~200 days post-explosion) spectrum of a stripped-envelope SN (SESN) from a progenitor with M[ZAMS] < 18 Msun. SN 2022mop shows strong (~ 1 mag) repeating undulations in its light curve, suggesting late-time interaction. In mid-2024, the transient re-brightened for several months before a Type IIn SN (r[peak] = -18.2 mag) was observed in December 2024, closely resembling the evolution of SN 2009ip. By triangulating both transients using Pan-STARRS images, we determine that both transients are coincident within approximately 3 parsecs. Given the environment, the chance alignment of two isolated SNe is unlikely. We propose a merger-burst scenario: a compact object formed in 2022, is kicked into an eccentric orbit, interacts with its hydrogen-rich companion over subsequent months, and ultimately merges, triggering a Type IIn SN-like transient.\n\n", "2503.08658": "2025-03-11, **Nonparametric reconstructions of dynamical dark energy via flexknots**, A. N. Ormondroyd et.al., [2503.08658v1](http://arxiv.org/abs/2503.08658v1)\n\n Recent cosmological surveys have provided unprecedented datasets that can be used to reconstruct the history of the dark energy equation of state. In this work, a free-form \"flexknot'' parameterisation is employed to represent $w(a)$ as a linear spline between free-moving nodes, the number of which may vary. By combining DESI Baryon Acoustic Oscillation measurements with Pantheon+ or DES5Y supernovae, the functional posteriors of $w(a)$ reveal an unexpected W-shaped structure. While the Bayesian evidence may still favour $\\Lambda$CDM, the robustness of these results suggests the structure is indeed present in the data. The tension $R$-statistic and suspiciousness have been marginalised over models, and demonstrate that while the reconstructions from DESI and Pantheon+ agree, DESI and DES5Y do not. We conclude that, while there is no smoking gun for dynamical dark energy, the structure unearthed in this work is generally too complex to be captured by the restrictive $w$CDM or CPL parameterisations.\n\n", "2503.08491": "2025-03-11, **On the Uncertainties of Galaxy Distances from Flow Models**, Konstantin Haubner et.al., [2503.08491v1](http://arxiv.org/abs/2503.08491v1)\n\n The systemic velocity or redshift of galaxies is a convenient tool to calculate their distances in the absence of primary methods, but the uncertainties on these flow distances may be substantial due to galaxy peculiar motions. Here, we derive a simple and easily applicable method to assign uncertainties to flow distances from four different methodologies, namely the Hubble law with both heliocentric and local-sheet velocities, the Cosmicflows-4 model, and the Numerical Action Methods model. Our uncertainty scheme is derived by comparing these flow distances to accurate, redshift-independent distances of a subsample of ~2000 galaxies from the Cosmicflows-4 database, using the tip magnitude of the red giant branch, Cepheids, surface brightness fluctuations, supernovae type Ia, masers, and supernovae type II. We provide simple functions and tables to calculate the distance uncertainties for all the flow models considered. This uncertainty scheme is generally applicable except for the region around the Virgo cluster, where we assign increased uncertainties due to larger peculiar motions.\n\n", "2503.08441": "2025-03-11, **Utilizing localized fast radio bursts to constrain their progenitors and the expansion history of the Universe**, Sandeep Kumar Acharya et.al., [2503.08441v1](http://arxiv.org/abs/2503.08441v1)\n\n Fast radio bursts (FRBs) are increasingly being used for cosmological applications such as measuring the Hubble constant and baryon abundance. The increasing number of localized FRBs and precise measurement of dispersion measure (DM) make them a suitable probe for such an approach. We use a sample of 110 localized FRBs as well as a small sub-sample of 24 FRBs with scattering timescale measurements or limits. We infer the Hubble constant ($H\\_0$) and the DM distribution of the host galaxies simultaneously by fitting our model to the FRB DM measurements. With current data, our results are in agreement with both high and low redshift measurements of $H\\_0$, obtained using Cosmic Microwave Background (CMB) and Type Ia supernovae data respectively. We project that with about 200 localized FRBs, we would be in a position to distinguish between the two scenarios at 4$\\sigma$ confidence. In addition, the host DM is expected to be related to star formation in the host galaxy and the stellar age of the progenitors. Using our inferred host galaxy DMs, we are able to rule out (at 95 percent confidence) a majority of localized FRB progenitors originating from young sources with stellar ages less than 10 Myr. This might reflect a large population of old sources or an observational bias against detecting FRBs from young sources, which may be associated with long scatter broadening times and large DM from their source environments. Indeed, we find that scatter broadening times of FRBs are inconsistent with the Milky Way ISM, but at the same time, do not appear to be strongly correlated with the FRBs' redshift or with the SFR or stellar mass of their host galaxies. This suggests that scattering is dominated by the immediate environment of the sources.\n\n", "2503.08286": "2025-03-11, **A census of OB stars within 1 kpc and the star formation and core collapse supernova rates of the Milky Way**, Alexis L. Quintana et.al., [2503.08286v1](http://arxiv.org/abs/2503.08286v1)\n\n OB stars are crucial for our understanding of Galactic structure, star formation, stellar feedback and multiplicity. In this paper we have compiled a census of all OB stars within 1 kpc of the Sun. We performed evolutionary and atmospheric model fits to observed spectral energy distributions (SEDs) compiled from astro-photometric survey data. We have characterized and mapped 24,706 O- and B-type stars ($T\\_{\\rm eff} > 10,000$ K) within 1 kpc of the Sun, whose overdensities correspond to well-studied OB associations and massive star-forming regions such as Sco-Cen, Orion OB1, Vela OB2, Cepheus and Circinus. We have assessed the quality of our catalogue by comparing it with spectroscopic samples and similar catalogues of OB(A) stars, as well as catalogues of OB associations, star-forming regions and young open clusters. Finally, we have also exploited our list of OB stars to estimate their scale height (76 $\\pm$ 1 pc), a local star formation rate of $2896^{+417}\\_{-1}$ M$\\_{\\odot}$ Myr$^{-1}$ and a local core-collapse supernova rate of $\\sim$15--30 per Myr. We extrapolate these rates to the entire Milky Way to derive a Galactic SFR of $0.67^{+0.09}\\_{-0.01}$ M$\\_{\\odot}$ yr$^{-1}$ and a core-collapse supernova rate of 0.4--0.5 per century. These are slightly lower than previous estimates, which we attribute to improvements in our census of OB stars and changes to evolutionary models. We calculate a near-Earth core collapse supernova rate of $\\sim$2.5 per Gyr that supports the view that nearby supernova explosions could have caused one or more of the recorded mass extinction events on Earth.\n\n", "2503.08236": "2025-03-11, **Cosmological Implications of Modified Entropic Gravity**, Kazem Rezazadeh et.al., [2503.08236v1](http://arxiv.org/abs/2503.08236v1)\n\n Taking into account the temperature corrections of the energy equipartition law for the bits of information that are coarse-grained on the holographic screen leads to a modification of Einstein's gravitational field equations. In the very high-temperature limit, which corresponds to strong gravitational fields, the modified gravitational equations reduce to the standard Einstein equations of general relativity, but in the low-temperature limit, which corresponds to the weak gravity regime, the modified equations show significant deviations from the standard Einstein equations. We solve the modified Einstein equations for the FRW metric and obtain the modified Friedmann equations. We see that the Friedmann equations obtained with this approach agree with the Friedmann equations previously obtained from the thermodynamic corrections of classical Newtonian mechanics. Using the modified Friedmann equations for a flat universe, we investigate the implications of our modified entropic cosmology (MEC) model. We show that our model can explain the dynamics of the universe without requiring any kind of dark energy. Using the Pantheon supernovae dataset, BAO data, Planck 2018 CMB data, and SH0ES measurements for $H\\_0$, we test the MEC model against observations. We will see that MEC fits the observational data better than the standard cosmological model of $\\Lambda$CDM. We also see that our model can successfully solve the $H\\_0$ tension that challenges the standard cosmological model.\n\n"}}