{"neutrino": {"2501.08278": "2025-01-14, **Lake- and Surface-Based Detectors for Forward Neutrino Physics**, Nicholas W. Kamp et.al., [2501.08278v1](http://arxiv.org/abs/2501.08278v1)\n\n We propose two medium-baseline, kiloton-scale neutrino experiments to study neutrinos from LHC proton-proton collisions: SINE, a surface-based scintillator panel detector observing muon neutrinos from the CMS interaction point, and UNDINE, a water Cherenkov detector submerged in lake Geneva observing all-flavor neutrinos from LHCb. Using a Monte Carlo simulation, we estimate millions of neutrino interactions during the high-luminosity LHC era. We show that these datasets can constrain neutrino cross sections, charm production in $pp$ collisions, and strangeness enhancement as a solution to the cosmic-ray muon puzzle. SINE and UNDINE thus offer a cost-effective medium-baseline complement to the proposed short-baseline forward physics facility.\n\n", "2501.08240": "2025-01-14, **Birefringence in fermion-attenuated gravitational wave power spectrum**, Jinglong Liu et.al., [2501.08240v1](http://arxiv.org/abs/2501.08240v1)\n\n Within the framework of Chern-Simons gravity, a theory that dynamically violates parity, we analyze the power spectrum of gravitational waves in light of the damping effect due to the free streaming relativistic neutrinos and dark fermions. The power spectrum is expressed terms of right- and left-handed polarizations, and the evolution of the gravitational waves is studied numerically. Birefringence is explicitly shown in the power spectrum, though the difference in the amplitudes is small. Specific features of peaks and dips appear gravitational wave power spectrum mirroring chiral gravitational wave mediated parametric resonance during reheating. Our result represents a useful tool to test Chern-Simons gravity and enables to constrain mechanisms of inflation and reheating related to this theory. We predict a falsifiable pattern of observable peaks and dips in the chiral independent gravitational power spectrum, eventually observable in next space-borne gravitational interferometers, including LISA, Taiji and Tianqin.\n\n", "2501.08127": "2025-01-14, **Experiment BEST-2 with 58Co neutrino source**, V. N. Gavrin et.al., [2501.08127v1](http://arxiv.org/abs/2501.08127v1)\n\n The article describes a new experiment with an artificial neutrino source 58Co on a gallium target GGNT (SAGE). The goal of the experiment is to study the gallium anomaly. The experiment makes it possible to find the parameters of oscillation transitions of electron neutrinos to sterile states in a wide range of parameters. Including the parameter {\\Delta}m2, the experimental determination of which usually causes significant difficulties. An important feature of the experiment is the possibility of identifying the dependence of the gallium anomaly on the neutrino energy.\n\n", "2501.08052": "2025-01-14, **Search for the production of Higgs-portal scalar bosons in the NuMI beam using the MicroBooNE detector**, MicroBooNE collaboration et.al., [2501.08052v1](http://arxiv.org/abs/2501.08052v1)\n\n We present the strongest limits to date on the mixing angle, $\\theta$, with which a new scalar particle, $S$, mixes with the Higgs field in the mass range $100$ $MeV<m\\_S<155$ MeV. This result uses the MicroBooNE liquid argon time projection chamber to search for decays of these Higgs-portal scalar particles through the $S\\rightarrow e^+e^-$ channel with the decays of kaons in the NuMI neutrino beam acting as the source of the scalar particles. The analysis uses an exposure of $7.01\\times 10^{20}$ protons on target of NuMI beam data including a period when the beam focusing system was configured to focus positively charged hadrons and a separate period when negatively charged hadrons were focused. The analysis searches for scalar particles produced from kaons decaying in flight in the beam's decay volume and at rest in the target and absorber. At $m\\_S=125$ MeV ($m\\_S=150$ MeV$)$ we set a limit of $\\theta<2.65\\times 10^{-4}$ ($\\theta<1.72\\times 10^{-4}$) at the 95$\\%$ confidence level.\n\n", "2501.07860": "2025-01-14, **Using the Kaniadakis horizon entropy in the presence of neutrinos to alleviate the Hubble and $ S_{8} $ Tensions**, Muhammad Yarahmadi et.al., [2501.07860v1](http://arxiv.org/abs/2501.07860v1)\n\n The $H\\_{0}$ tension stands as a prominent challenge in cosmology, serving as a primary driver for exploring alternative models of dark energy. Another tension arises from measurements of the $ S\\_{8} $ parameter, which is characterize the amplitude of matter fluctuations in the universe. In this study, we address the alleviation of both the Hubble tension and $ S\\_{8} $ tension by incorporating Kaniadakis horizon entropy. We investigate two scenarios to explore the impact of this entropy on cosmological parameters. In the first scenario, utilizing modified Friedmann equations through Kaniadakis entropy, we estimate the values of $H\\_{0}$ and $ S\\_{8} $. In the subsequent scenario, we introduce the neutrino term and assess its effect on mitigating the Hubble and $ S\\_{8} $ tensions. Our findings reveal that when considering the first scenario, the results closely align with Planck's 2018 outcomes for Hubble and $ S\\_{8} $ tensions. Moreover, with the inclusion of neutrinos, these tensions are alleviated to approximately 2$\\sigma$, and the $ S\\_{8} $ value is in full agreement with the results from the KiDS and DES survey. Furthermore, we impose a constraint on the parameter $K$ in each scenario. Our analysis yields $K = 0.12\\pm 0.41$ for Kaniadakis entropy without neutrinos and $K = 0.39\\pm 0.4$ for the combined dataset considering Kaniadakis entropy in the presence of neutrinos. We demonstrate that the value of K may be affected by neutrino mass, which can cause energy transfer between different parts of the universe and alter the Hubble parameter value.\n\n"}, "dark matter": {"2501.08117": "2025-01-14, **New Limits on Ultralight Axionlike Dark Matter**, K. Y. Zhang et.al., [2501.08117v1](http://arxiv.org/abs/2501.08117v1)\n\n New limits on the axion-nucleon coupling over the axion mass region $10^{-24} \\leq m\\_a \\leq 5 \\times 10^{-21}$ eV are derived by reanalyzing data from laboratory measurements on Lorentz and $CPT$ violation. These results establish the first laboratory constraints on the axion-nucleon coupling for axion masses below $10^{-22}$ eV. For $10^{-22} \\leq m\\_a \\leq 5 \\times 10^{-21}$ eV, the results improve upon previous laboratory limits by more than 3 orders of magnitude, exceeding for the first time the astrophysical limits from supernova SN1987A cooling. For the axion mass range of interest corresponding to ultralow frequencies, the crucial initial phase of the axion field is considered. Furthermore, the obtained limits are nearly equivalent to those projected for a recently proposed experiment employing high-intensity neutron beams at the European Spallation Source [Phys. Rev. Lett. 133, 181001 (2024)]. For an alternative type of axion-nucleon interaction, the quadratic wind coupling, the constraints exceed the current best results by approximately 2 orders of magnitude.\n\n", "2501.08089": "2025-01-14, **The effect of environment on the mass assembly history of the Milky Way and M31**, Ewoud Wempe et.al., [2501.08089v1](http://arxiv.org/abs/2501.08089v1)\n\n We study the mass growth histories of the halos of Milky Way and M31 analogues formed in constrained cosmological simulations of the Local Group. These simulations constitute a fair and representative set of $\\Lambda$CDM realisations conditioned on properties of the main Local Group galaxies, such as their masses, relative separation, dynamics and environment. Comparing with isolated analogues extracted from the TNG dark-matter-only simulations, we find that while our M31 halos have a comparable mass growth history to their isolated counterparts, our Milky Ways typically form earlier and their growth is suppressed at late times. Mass growth associated to major and minor mergers is also biased early for the Milky Way in comparison to M31, with most accretion occurring 1 - 4 Gyr after the Big Bang, and a relatively quiescent history at later times. 32% of our Milky Ways experienced a Gaia-Enceladus/Sausage (GES)-like merger, while 13% host an LMC-like object at the present day, with 5% having both. In one case, an SMC- and a Sagittarius-analogue are also present, showing that the most important mergers of the Milky Way in its Local Group environment can be reproduced in $\\Lambda$CDM. We find that the material that makes up the Milky Way and M31 halos at the present day first collapsed onto a plane roughly aligned with the Local Sheet and Supergalactic plane; after $z \\sim 2$, accretion occurred mostly within this plane, with the tidal effects of the heavier companion, M31, significantly impacting the late growth history of the Milky Way.\n\n", "2501.07968": "2025-01-14, **Inhomogeneous model with a space dependent Cosmological Constant**, D. Comelli et.al., [2501.07968v1](http://arxiv.org/abs/2501.07968v1)\n\n We analyse an inhomogeneous cosmological model featuring a spherically symmetric bubble solution induced by a unified single perfect fluid, comprising spatially dependent Dark Energy (with $w=-1$) and Dark Matter (with $w=0$) components. We impose an Hubble profile that matches the Planck value at early times ($H\\_0=67.4\\pm0.5$ Km/s\\,Mpc) and the local value (${\\cal H}\\_0=73.52\\pm 1.62$ Km/s\\,Mpc). We explicitly derive perturbative solutions in two distinct regimes: one expanded around the center (for small $r\\,{\\cal H}\\_0\\ll1$) and the other expanded around a homogeneous FRW universe. In both cases, we compute the cosmographic parameters, redshift profiles for the Hubbles expansion rates, and effective equations of state. Furthermore, we investigate the redshift drift behaviour extended to a Lema$\\hat{\\rm i}$tre metric.\n\n", "2501.07865": "2025-01-14, **New Constraints on Axion Mediated Dipole-Dipole Interactions**, Zitong Xu et.al., [2501.07865v1](http://arxiv.org/abs/2501.07865v1)\n\n The search for axions sits at the intersection of solving critical problems in fundamental physics, including the strong CP problem in QCD, uncovering the nature of dark matter, and understanding the origin of the universe's matter-antimatter asymmetry. The measurement of axion-mediated spin-dependent interactions offers a powerful approach for axion detection. However, it has long been restricted to regions outside the 'axion window' due to a significant trade-off: the need to effectively suppress the magnetic leakage from highly polarized spin sources while simultaneously detecting sub-femtotesla level exotic physics signals at sub-decimeter-scale distances. In this work, we report new experimental results on axion-mediated exotic spin-spin interactions using an iron-shielded SmCo$\\_5$ spin source in combination with a specially designed self-compensation comagnetometer. Employing a composite shielding structure, we achieved a suppression of the magnetic field by up to $10^{11}$. This enabled us to establish new constraints on the coupling between electrons and neutrons, surpassing previous experimental limits by more than 10000 times within the axion window. Furthermore, we also set strongest constraints on the coupling between electrons and protons. The proposed method holds substantial potential not only for advancing the search for new physics beyond the Standard Model but also for enabling transformative applications in biological and chemical research.\n\n"}, "supernova": {"2501.08117": "2025-01-14, **New Limits on Ultralight Axionlike Dark Matter**, K. Y. Zhang et.al., [2501.08117v1](http://arxiv.org/abs/2501.08117v1)\n\n New limits on the axion-nucleon coupling over the axion mass region $10^{-24} \\leq m\\_a \\leq 5 \\times 10^{-21}$ eV are derived by reanalyzing data from laboratory measurements on Lorentz and $CPT$ violation. These results establish the first laboratory constraints on the axion-nucleon coupling for axion masses below $10^{-22}$ eV. For $10^{-22} \\leq m\\_a \\leq 5 \\times 10^{-21}$ eV, the results improve upon previous laboratory limits by more than 3 orders of magnitude, exceeding for the first time the astrophysical limits from supernova SN1987A cooling. For the axion mass range of interest corresponding to ultralow frequencies, the crucial initial phase of the axion field is considered. Furthermore, the obtained limits are nearly equivalent to those projected for a recently proposed experiment employing high-intensity neutron beams at the European Spallation Source [Phys. Rev. Lett. 133, 181001 (2024)]. For an alternative type of axion-nucleon interaction, the quadratic wind coupling, the constraints exceed the current best results by approximately 2 orders of magnitude.\n\n", "2501.08084": "2025-01-14, **Dynamical evolution of the open clusters with different star formation efficiencies and orbital parameters**, M. Ishchenko et.al., [2501.08084v1](http://arxiv.org/abs/2501.08084v1)\n\n Open star clusters are dynamic systems whose evolution is critically influenced by initial conditions such as star formation efficiency and orbital parameters. Understanding their dissolution mechanisms provides insight into stellar population dynamical mixing in the Milky Way. We aim to investigate the dynamical evolution and dissolution of initially non-virialised open clusters by examining how different global star formation efficiencies and orbital characteristics impact the cluster longevity and structural changes. We followed the evolution of the clusters up to their dissolution time on the basis of our calculations. We compare our open cluster dynamical evolutionary models with the observed open clusters in our Galaxy's solar vicinity. Using high-order direct N-body simulations, we modelled cluster evolution across different Galactic orbits, systematically varying initial star formation efficiencies to comprehensively explore dissolution mechanisms. Our simulations reveal that open clusters typically survive approximately ten orbital periods, with cluster lifetime being strongly dependent on global star formation efficiency and only marginally influenced by orbital eccentricity. We estimate gas expulsion timescales of 0.9 Myr, with initial supernova explosions efficiently removing gaseous components from the cluster. The expected lifetime of the cluster (in units of orbital periods) strongly depends on the cluster global star-formation efficiency and only slightly on the orbital eccentricities of the cluster. The theoretical models demonstrate a remarkable agreement of the Roche-volobe filling parameter with the recent observed Gaia DR3 cluster catalogues in the solar vicinity. By incorporating a mixed sample of clusters with varying star formation efficiencies, we provide a more nuanced understanding of open cluster evolution in the Galactic disc.\n\n", "2501.08015": "2025-01-14, **Periodic Gamma-ray Modulation of the blazar PG 1553+113 Confirmed by Fermi-LAT and Multi-wavelength Observations**, S. Abdollahi et.al., [2501.08015v1](http://arxiv.org/abs/2501.08015v1)\n\n A 2.1-year periodic oscillation of the gamma-ray flux from the blazar PG 1553+113 has previously been tentatively identified in almost 7 year of data from the Fermi Large Area Telescope. After 15 years of Fermi sky-survey observations, doubling the total time range, we report >7 cycle gamma-ray modulation with an estimated significance of 4 sigma against stochastic red noise. Independent determinations of oscillation period and phase in the earlier and the new data are in close agreement (chance probability <0.01). Pulse timing over the full light curve is also consistent with a coherent periodicity. Multiwavelength new data from Swift X-Ray Telescope, Burst Alert Telescope, and UVOT, and from KAIT, Catalina Sky Survey, All-Sky Automated Survey for Supernovae, and Owens Valley Radio Observatory ground-based observatories as well as archival Rossi X-Ray Timing Explorer satellite-All Sky Monitor data, published optical data of Tuorla, and optical historical Harvard plates data are included in our work. Optical and radio light curves show clear correlations with the gamma-ray modulation, possibly with a nonconstant time lag for the radio flux. We interpret the gamma-ray periodicity as possibly arising from a pulsational accretion flow in a sub-parsec binary supermassive black hole system of elevated mass ratio, with orbital modulation of the supplied material and energy in the jet. Other astrophysical scenarios introduced include instabilities, disk and jet precession, rotation or nutation, and perturbations by massive stars or intermediate-mass black holes in polar orbit.\n\n"}}