{"neutrino": {"2308.14655": "2023-08-28, **Study of blazars detected by Fermi-LAT as high-energy neutrino sources**, Antonio Galván et.al., [2308.14655v1](http://arxiv.org/abs/2308.14655v1)\n\n Besides the neutrino source detected by IceCube, NGC 1068, the association of the IceCube-170922A neutrino with the blazar in a flaring state among several wavelengths (from radio up to high-energy (HE) gamma-rays), the site and mechanisms of production of HE neutrino remains in discussion. Extragalactic sources such as Quasars, Blazars, Radio galaxies, and Gamma-ray bursts have been proposed as progenitors of HE neutrinos. In this work, we study the Blazars reported by Fermi-LAT in the 4LAC catalog, which are embedded inside the 90\\% error of the best-fit position from the neutrinos reported by IceCube. We propose a one-zone lepto-hadronic scenario to describe the broadband Spectral Energy Distribution and then estimate the number of neutrinos to compare with those in the direction of each source. A brief discussion is provided of the results.\n\n", "2308.14574": "2023-08-28, **Chiral and flavor oscillations in a hyperentangled neutrino state**, Victor Bittencourt et.al., [2308.14574v1](http://arxiv.org/abs/2308.14574v1)\n\n By means of the Dirac bispinor formalism, we show that the state of a (massive) oscillating neutrino produced by a weak interaction process, is an hyperentangled state of flavor, chirality, and spin. Since chirality is not a conserved quantity, chiral oscillations take place and affects the flavor transition probability. By means of the complete complementarity relations, we analyze how correlations and coherence are redistributed in time between the different degrees-of-freedoms of the system. In a similar way, we consider a spin entangled lepton-antineutrino pair and describe the redistribution of the spin-spin entanglement into correlations between the other degrees-of-freedom. In both cases the effects of chiral oscillations are relevant in the non-relativistic regime. Our analysis provides a complete characterization of the quantum correlations involved in lepton-antineutrino pairs and in single particle neutrino evolution, and provides a further insight on possible routes to interpret and measure chiral oscillations.\n\n", "2308.14501": "2023-08-28, **Neutrino amplitude decomposition, $S$ matrix rephasing invariance, and reparametrization symmetry**, Hisakazu Minakata et.al., [2308.14501v1](http://arxiv.org/abs/2308.14501v1)\n\n The $S$ matrix rephasing invariance is one of the fundamental principles of quantum mechanics that originates in its probabilistic interpretation. For a given $S$ matrix which describes neutrino oscillation, one can define the two different rephased amplitudes $S\\_{\\alpha \\beta}^{ \\text{Reph-1} } \\equiv e^{ i (\\lambda\\_{1} / 2E) x} S\\_{\\alpha \\beta}$ and $S\\_{\\alpha \\beta}^{ \\text{Reph-2} } \\equiv e^{ i (\\lambda\\_{2} / 2E) x} S\\_{\\alpha \\beta}$, which are physically equivalent to each other, where $\\lambda\\_{k} / 2E$ denotes the energy eigenvalue of the $k$-th mass eigenstate. The leading-order terms in $S\\_{\\alpha \\beta}^{ \\text{Reph-1} }$ and $S\\_{\\alpha \\beta}^{ \\text{Reph-2} }$ describe, respectively, the 1-3 and 2-3 level crossings around the atmospheric-scale resonance. We point out that the transformation of the reparametrization (Rep) symmetry obtained with ``Symmetry Finder'' maps $S\\_{\\alpha \\beta}^{ \\text{Reph-1} }$ to $S\\_{\\alpha \\beta}^{ \\text{Reph-2} }$, and vice versa, providing a local and manifest realization of the $S$ matrix rephasing invariance by the Rep symmetry. It strongly suggests a quantum mechanical nature of the Rep symmetry. An all-order treatment of the intimate relationships between the Rep symmetry and $S$ matrix rephasing invariance is attempted.\n\n", "2308.14483": "2023-08-28, **Probing chiral and flavored $Z^\\prime$ from cosmic bursts through neutrino interactions**, ShivaSankar K. A. et.al., [2308.14483v1](http://arxiv.org/abs/2308.14483v1)\n\n The origin of tiny neutrino mass is an unsolved puzzle leading to a variety of phenomenological aspects beyond the Standard Model (BSM). Among several interesting attempts, $U(1)$ gauge extension of Standard Model (SM) is a simple and interesting set-up where the so-called seesaw mechanism is incarnated by the addition of three generations of right-handed neutrinos followed by the breaking of $U(1)$ and electroweak symmetries. Such scenarios are anomaly free in nature appearing with a neutral BSM gauge boson ($Z^\\prime$). In addition to that, there comes another open question regarding the existence of a non-luminous, hitherto unidentified object called Dark Matter (DM) originating from the measurement of its relic density. To explore properties of $Z^\\prime$, we focus on chiral and flavored scenarios where $Z^\\prime-$neutrinos interaction could be probed in the context of cosmic explosions like gamma-ray burst (GRB221009A, so far the highest energy), blazar (TXS 0506+056) and Active galaxy (NGC1068) respectively. The neutrino antineutrino annihilation produces electron-positron pair which could energize GRB through energy deposition. Taking the highest energy GRB under consideration and estimating the energy deposition rates we constrain $Z^\\prime$ mass $(M\\_{Z^\\prime})$ and the additional $U(1)$ coupling $(g\\_X)$ for chiral and flavored scenarios in the Schwarzchild, Hartle-Thorne and modified gravity frameworks. On the other hand, adding viable and alternative DM candidates in these models we study neutrino-DM scattering mediated by $Z^\\prime$ in the $t-$ channel and estimate constraints on $g\\_X-M\\_{Z^\\prime}$ plane using observed data of high energy neutrinos from cosmic blazar and active galaxy at the IceCube experiment. We compare our results with bounds obtained from different scattering, beam-dump and $g-2$ experiments.\n\n", "2308.14399": "2023-08-28, **Low-energy spectrum of the BULLKID detector array operated on surface**, D. Delicato et.al., [2308.14399v1](http://arxiv.org/abs/2308.14399v1)\n\n We present the first continuous operation in a surface lab of BULLKID, a detector for searches of light Dark Matter and precision measurements of the coherent and elastic neutrino-nucleus scattering. The detector consists of an array of 60 cubic silicon particle absorbers of 0.34 g each, sensed by cryogenic kinetic inductance detectors. The data presented focusses on one of the central elements of the array and on its surrounding elements used as veto. The energy spectrum resulting from an exposure of 39 hours to ambient backgrounds, obtained without radiation shields, is flat at the level of $(2.0\\pm0.1\\,{\\rm stat.}\\pm0.2\\,{\\rm syst.})\\times10^6$ counts / keV kg days down to the energy threshold of $160\\pm13$ eV. The data analysis demonstrates the unique capability of rejecting backgrounds generated from interactions in other sites of the array, stemming from the segmented and monolithic structure of the detector.\n\n"}, "dark matter": {"2308.14691": "2023-08-28, **Scalar Field Dark Matter: Impact of Supernovae-driven blowouts on the soliton structure of low mass dark matter halos**, Victor H. Robles et.al., [2308.14691v1](http://arxiv.org/abs/2308.14691v1)\n\n We present the first study on the gravitational impact of supernova feedback in an isolated soliton and a spherically symmetric dwarf SFDM halo of virial mass $1\\times 10^{10}\\mathrm{M\\_\\odot}$. We use a boson mass $m=10^{-22}\\mathrm{eV/c^2}$ and a soliton core $r\\_c \\approx 0.7$kpc, comparable to typical half-light radii of Local Group dwarf galaxies. We simulate the rapid gas removal from the center of the soliton by a concentric external time-dependent Hernquist potential. We explore two scenarios of feedback blowouts: i) a massive single burst, and ii) multiple consecutive blowouts injecting the same total energy to the system, including various magnitudes for the blowouts in both scenarios. In all cases, we find one single blowout has a stronger effect on reducing the soliton central density. Feedback leads to central soliton densities that oscillate quasi-periodically for an isolated soliton and stochastically for a SFDM halo. The range in the density amplitude depends on the strength of the blowout, however we observe typical variations of a factor of $\\geqslant$2. One important consequence of the stochastic fluctuating densities is that, if we had no prior knowledge of the system evolution, we can only know the configuration profile at a specific time within some accuracy. By fitting soliton profiles at different times to our simulated structures, we found the (1-$\\sigma$) scatter of their time-dependent density profiles. For configurations within the 1$\\sigma$ range, we find the inferred boson mass is typically less than 20\\% different from the real value used in our simulations. Finally, we compare the observed dynamical masses of field dwarf galaxies in our Local Group with the implied range of viable solitons from our simulations and find good agreement.\n\n", "2308.14682": "2023-08-28, **Muon $g-2$ and dark matter in Supersymmetric $SU(4)_c \\times SU(2)_L \\times SU(2)_R$**, Qaisar Shafi et.al., [2308.14682v1](http://arxiv.org/abs/2308.14682v1)\n\n The latest FermiLab muon $g-2$ result shows a $5\\sigma$ discrepancy with a ``widely advertised\" Standard Model prediction. We consider a supersymmetric $SU(4)\\_c \\times SU(2)\\_L \\times SU(2)\\_R$ model in which this discrepancy is resolved by including contributions to muon $g-2$ from a relatively light SUSY sector. A variety of realistic coannihilation scenarios can reproduce the observed dark matter relic abundance. With a significantly reduced discrepancy, of order $1 \\sigma$ or less, the Higgsino-like dark matter solutions are also viable. We provide benchmark points for these solutions that will be probed in the direct detection dark matter experiments and collider searches.\n\n", "2308.14664": "2023-08-28, **Explaining the oblate morphology of dwarf spheroidals with Wave Dark Matter perturbations**, Riccardo Della Monica et.al., [2308.14664v1](http://arxiv.org/abs/2308.14664v1)\n\n We investigate whether the oblate, spheroidal morphology of common dwarf spheroidal galaxies (dSph) may result from the slow relaxation of stellar orbits within a halo of Wave Dark Matter ($\\psi$DM) when starting from an initial disk of stars. Stellar orbits randomly walk over a Hubble time, perturbed by the pervasive \"granular\" interference pattern of $\\psi$DM, that fully modulates the dark matter density on the de Broglie scale. Our simulations quantify the level of stellar disk thickening over the Hubble time, showing that distribution of stars is predicted to become an oblate spheroid of increasing radius, that plausibly accounts for the morphology of dSph galaxies. We predict a low level of residual rotation remains after a Hubble time at the 1-3 km/s level, depending on orientation, that compares with recent claims of rotation for some well studied local dSph galaxies. This steady internal dynamical evolution may be witnessed directly with JWST for well resolved dwarf galaxies, appearing more oblate with look back time and tending to small disks of young stars at high redshift.\n\n", "2308.14656": "2023-08-28, **Search for Dark Photon Dark Matter in the Mass Range 41--74 $μ\\mathrm{eV}$ using Millimeter-Wave Receiver and Radioshielding Box**, S. Adachi et.al., [2308.14656v1](http://arxiv.org/abs/2308.14656v1)\n\n Dark photons have been considered potential candidates for dark matter. The dark photon dark matter (DPDM) has a mass and interacts with electromagnetic fields via kinetic mixing with a coupling constant of $\\chi$. Thus, DPDMs are converted into ordinary photons at metal surfaces. Using a millimeter-wave receiver set in a radioshielding box, we performed experiments to detect the conversion photons from the DPDM in the frequency range 10--18 GHz, which corresponds to a mass range 41--74 $\\mu\\mathrm{eV}$. We found no conversion photon signal in this range and set the upper limits to $\\chi < (0.5\\text{--}3.9) \\times 10^{-10}$ at a 95% confidence level.\n\n", "2308.14640": "2023-08-28, **New Bounds on Fuzzy Dark Matter from Galaxy-Galaxy Strong-Lensing Observations**, Tatyana Shevchuk et.al., [2308.14640v1](http://arxiv.org/abs/2308.14640v1)\n\n Fuzzy Dark Matter (FDM) has recently gained attention as a motivated candidate for the dark matter (DM) content of the Universe, as opposed to the commonly assumed cold DM (CDM), since the soliton profile intrinsic to FDM models was found to be particularly well suited to reproduce observed galaxy mass profiles. While FDM as a single DM component has been strongly constrained by multiple probes, there remained a mass window between $10^{-25}\\,\\mathrm{eV}$ and $10^{-24}\\,\\mathrm{eV}$ in which it can comprise a large portion ($\\gtrsim\\mathcal{O}(10\\%)$) of the total DM. In this work, we consider gravitational lensing measurements in the strong lensing regime, which are one of the only means to directly constrain the distribution and profile of DM in astronomical bodies. Using a simple model that combines a soliton FDM component with a Navarro-Frenk-White (NFW) profile, we explore under what conditions DM halos with this hybrid profile are able to reproduce the observed Einstein radii of several known lenses. We find that FDM with a particle mass of $\\lesssim 10^{-24}\\,{\\rm eV}$ cannot explain the observations if it makes up more than $\\sim10\\%$ of the total DM, effectively closing the lingering FDM mass window.\n\n", "2308.14629": "2023-08-28, **Positivity Bounds on Higgs-Portal Freeze-in Dark Matter**, Seong-Sik Kim et.al., [2308.14629v1](http://arxiv.org/abs/2308.14629v1)\n\n We consider the relic density and positivity bounds for freeze-in scalar dark matter with general Higgs-portal interactions up to dimension-8 operators. When dimension-4 and dimension-6 Higgs-portal interactions are proportional to mass squares for Higgs or scalar dark matter in certain microscopic models such as massive graviton, radion or general metric couplings with conformal and disconformal modes, we can take the dimension-8 derivative Higgs-portal interactions to be dominant for determining the relic density via the 2-to-2 thermal scattering of the Higgs fields after reheating. We show that there is a wide parameter space for explaining the correct relic density from the freeze-in mechanism and the positivity bounds can curb out the dimension-8 derivative Higgs-portal interactions nontrivially in the presence of the similar dimension-8 self-interactions for Higgs and dark matter.\n\n", "2308.14594": "2023-08-28, **Indirect detection of dark matter with (pseudo)-scalar interactions**, Simone Biondini et.al., [2308.14594v1](http://arxiv.org/abs/2308.14594v1)\n\n Indirect detection is one of the most powerful methods to search for annihilating dark matter. In this work, we investigate the impact of non-perturbative effects in the indirect detection of dark matter. For this purpose we utilize a minimal model consisting of a fermionic dark matter candidate in the TeV mass range that interacts via scalar- and pseudo-scalar interactions with a massive scalar mediator mixing with the Higgs. The scalar interaction induces an attractive Yukawa potential between dark matter particles, such that annihilations are Sommerfeld enhanced, and bound states can form. These non-perturbative effects are systematically dealt with (potential) non-relativistic effective field theories and we derive the relevant cross sections for dark matter. We discuss their impact on the relic density and indirect detection. Annihilations in dwarf galaxies and the Galactic Center require special care and we derive generalized $J$-factors for these objects that account for the non-trivial velocity dependence of the cross sections in our model. We use limits on the gamma-ray flux based on Fermi-LAT observations and limits on the rate of exotic energy injection from Planck to derive bounds on the parameter space of the model. Finally, we estimate the impact that future limits from the Cherenkov Telescope Array are expected to have on the model.\n\n", "2308.14438": "2023-08-28, **Freeze-in bino dark matter in high scale supersymmetry**, Chengcheng Han et.al., [2308.14438v1](http://arxiv.org/abs/2308.14438v1)\n\n We explore a scenario of high scale supersymmetry where all supersymmetric particles except gauginos stay at a high energy scale $M\\_{\\rm SUSY}$ which is much larger than the reheating temperature $T\\_\\text{RH}$. The dark matter is dominated by bino component with mass around the electroweak scale and the observed relic abundance is mainly generated by the freeze-in process during the early universe. Considering the various constraints, we identify two available scenarios in which the supersymmetric sector at an energy scale below $T\\_\\text{RH}$ consists of: a) bino; b) bino and wino. Typically, for a bino mass around 0.1-1 TeV and a wino mass around 2 TeV, we find that $M\\_{\\rm SUSY}$ should be around $10^{12-14}$ GeV with $T\\_\\text{RH}$ around $10^{4-6}$ GeV.\n\n", "2308.14305": "2023-08-28, **3D stellar motion in the axisymmetric Galactic potential and the e-z resonances**, Tatiana A. Michtchenko et.al., [2308.14305v1](http://arxiv.org/abs/2308.14305v1)\n\n The full phase space information on the kinematics of a huge number of stars provided by the Gaia third Data Release raises the demand for a better understanding of the 3D stellar dynamics. In this paper, we investigate the possible regimes of motion of stars in the axisymmetric approximation of a Galactic potential model. The model consists of three components: the axisymmetric disk, the central spheroidal bulge and the spherical halo of dark matter. The axisymmetric disk is divided into stellar and gaseous disk subcomponents, each one modeled by three Miyamoto-Nagai profiles. The physical and structural parameters of the Galaxy components are adjusted by observational kinematic constraints. The phase space of the two-degrees-of-freedom model is studied by means of the Poincar\\'e and dynamical mapping, the dynamical spectrum method and the direct numerical integrations of the Hamiltonian equations of motion. For the chosen physical parameters, the nearly-circular and low-altitude stellar behaviour is composed of two weakly coupled simple oscillations, radial and vertical motions. The amplitudes of the vertical oscillations of these orbits are gradually increasing with the growing Galactocentric distances, in concordance with the exponential mass decay assumed. However, for increasing planar eccentricities and the altitudes over the equatorial disk, new regimes of stellar motion emerge as a result of the beating between the radial and vertical oscillation frequencies, which we refer to as e-z resonances. The corresponding resonant motion produces characteristic sudden increase or decrease of the amplitude of the vertical oscillation, bifurcations in the dynamical spectra and the chains of islands of stable motion in the phase space. The results obtained can be useful in the understanding and interpretation of the features observed in the stellar 3D distribution around the Sun.\n\n", "2308.14278": "2023-08-28, **Simulation Of The Microlensing Effect Near The Critical Curve Of The Galaxy Cluster**, Xuliu Yang et.al., [2308.14278v1](http://arxiv.org/abs/2308.14278v1)\n\n In the smooth mass distribution model, the critical curve represents a line with magnification divergence on the image plane in a strong gravitational lensing system. Considering the microlensing effects caused by discrete masses, the magnification map in the source plane exhibits a complex structure, which offers a promising way for detecting dark matter. However, simulating microlensing near the critical curve poses challenges due to magnification divergence and the substantial computational demands involved. To achieve the required simulation accuracy, direct inverse ray-shooting would require significant computational resources. Therefore we applied a GPU-based code optimized with interpolation method to enable efficient computation on a large scale. Using the GPU of NVIDIA Tesla V100S PCIe 32GB, it takes approximately 7000 seconds to calculate the effects of around 13,000 microlenses for a simulation involving 1013 emitted rays. Then we generated 80 magnification maps, and select 800 light curves for a statistical analysis of microcaustic density and peak magnification.\n\n", "2308.14234": "2023-08-28, **An initial analysis of a strongly-lensed QSOs candidate identified by LAMOST**, Y. H. Chen et.al., [2308.14234v1](http://arxiv.org/abs/2308.14234v1)\n\n From 2011 to 2021, LAMOST has released a total of 76,167 quasar data. We try to search for gravitationally lensed QSOs by limiting coordinate differences and redshift differences of these QSOs. The name, brightness, spectrum, photometry and other information of each QSO will be visually checked carefully. Special attention should be paid to check whether there are groups of galaxies, gravitationally lensed arcs, Einstein crosses, or Einstein rings near the QSOs. Through careful selection, we select LAMOST J160603.01+290050.8 (A) and LAMOST J160602.81+290048.7 (B) as a candidate and perform an initial analysis. The component A and B are 3.36 arc seconds apart and they display blue during photometric observations. The redshift values of component A and B are 0.2\\% different, their Gaia$\\\\_$g values are 1.3\\% different, and their ugriz values are 1.0\\% or less different. For the spectra covering from 3,690 {\\AA} to 9,100 {\\AA}, the emission lines of C\\,II, Mg, H\\,$\\gamma$, O\\,III, and H\\,$\\beta$ are present for both component A and B and the ratio of flux(B) to flux(A) from LAMOST is basically a constant, around 2.2. We accidentally find a galaxy group near the component A and B. If the center of dark matter in the galaxy group is at the center between component A and B, the component A and B are probably gravitationally lensed QSOs. We estimate that the Einstein mass is 1.46 $\\times$ $10^{11}$ $M\\_{\\odot}$ and the total mass of the lens is 1.34 $\\times$ $10^{13}$ $M\\_{\\odot}$. The deflection angle is 1.97 arc seconds at positions A and B and the velocity dispersion is 261\\,$km\\,s^{-1}$. Theoretically, this candidate could be a pair of fold images of a strong lensing system by a galaxy group, and we will investigate the possibility when the redshifts of nearby galaxies are available.\n\n"}, "supernova": {"2308.14696": "2023-08-28, **The puzzling properties of the MACS1149-JD1 galaxy at z=9.11**, Massimo Stiavelli et.al., [2308.14696v1](http://arxiv.org/abs/2308.14696v1)\n\n We analyze new JWST NIRCam and NIRSpec data on the redshift 9.11 galaxy MACS1149-JD1. Our NIRCam imaging data reveal that JD1 comprises three spatially distinct components. Our spectroscopic data indicate that JD1 appears dust-free but is already enriched, $12 + \\log {\\rm (O/H) } = 7.875^{+0.042}\\_{-0.045}$. We also find that the Carbon and Neon abundances in JD1 are below the solar abundance ratio. Particularly the Carbon under-abundance is suggestive of recent star formation where Type~II supernovae have already enriched the ISM in Oxygen but intermediate mass stars have not yet enriched the ISM in Carbon. A recent burst of star formation is also revealed by the star formation history derived from NIRCam photometry. Our data do not reveal the presence of a significant amount of old populations, resulting in a factor of $\\sim7\\times$ smaller stellar mass than previous estimates. Thus, our data support the view that JD1 is a young object.\n\n", "2308.14691": "2023-08-28, **Scalar Field Dark Matter: Impact of Supernovae-driven blowouts on the soliton structure of low mass dark matter halos**, Victor H. Robles et.al., [2308.14691v1](http://arxiv.org/abs/2308.14691v1)\n\n We present the first study on the gravitational impact of supernova feedback in an isolated soliton and a spherically symmetric dwarf SFDM halo of virial mass $1\\times 10^{10}\\mathrm{M\\_\\odot}$. We use a boson mass $m=10^{-22}\\mathrm{eV/c^2}$ and a soliton core $r\\_c \\approx 0.7$kpc, comparable to typical half-light radii of Local Group dwarf galaxies. We simulate the rapid gas removal from the center of the soliton by a concentric external time-dependent Hernquist potential. We explore two scenarios of feedback blowouts: i) a massive single burst, and ii) multiple consecutive blowouts injecting the same total energy to the system, including various magnitudes for the blowouts in both scenarios. In all cases, we find one single blowout has a stronger effect on reducing the soliton central density. Feedback leads to central soliton densities that oscillate quasi-periodically for an isolated soliton and stochastically for a SFDM halo. The range in the density amplitude depends on the strength of the blowout, however we observe typical variations of a factor of $\\geqslant$2. One important consequence of the stochastic fluctuating densities is that, if we had no prior knowledge of the system evolution, we can only know the configuration profile at a specific time within some accuracy. By fitting soliton profiles at different times to our simulated structures, we found the (1-$\\sigma$) scatter of their time-dependent density profiles. For configurations within the 1$\\sigma$ range, we find the inferred boson mass is typically less than 20\\% different from the real value used in our simulations. Finally, we compare the observed dynamical masses of field dwarf galaxies in our Local Group with the implied range of viable solitons from our simulations and find good agreement.\n\n", "2308.14565": "2023-08-28, **Reduction of supernova light curves by vector Gaussian processes**, Matwey V. Kornilov et.al., [2308.14565v1](http://arxiv.org/abs/2308.14565v1)\n\n Bolometric light curves play an important role in understanding the underlying physics of various astrophysical phenomena, as they allow for a comprehensive modeling of the event and enable comparison between different objects. However, constructing these curves often requires the approximation and extrapolation from multicolor photometric observations. In this study, we introduce vector Gaussian processes as a new method for reduction of supernova light curves. This method enables us to approximate vector functions, even with inhomogeneous time-series data, while considering the correlation between light curves in different passbands. We applied this methodology to a sample of 29 superluminous supernovae (SLSNe) assembled using the Open Supernova Catalog. Their multicolor light curves were approximated using vector Gaussian processes. Subsequently, under the black-body assumption for the SLSN spectra at each moment of time, we reconstructed the bolometric light curves. The vector Gaussian processes developed in this work are accessible via the Python library gp-multistate-kernel on GitHub. Our approach provides an efficient tool for analyzing light curve data, opening new possibilities for astrophysical research.\n\n", "2308.14458": "2023-08-28, **Electromagnetic signatures of white dwarf collisions in AGN discs**, Shu-Rui Zhang et.al., [2308.14458v1](http://arxiv.org/abs/2308.14458v1)\n\n In the inner region of the disc of an active galactic nucleus (AGN), the collision of two white dwarfs (WDs) through Jacobi capture might be inevitable, leading to a Type Ia supernova (SN Ia) explosion. This transient event, influenced by the disc gas and the gravity of the supermassive black hole (SMBH), exhibits distinct characteristics compared to normal SNe Ia. The energy of the explosion is mainly stored in the ejecta in the form of kinetic energy. Typically, the ejecta is not effectively decelerated by the AGN disc and rushes rapidly out of the AGN disc. However, under the influence of the SMBH, most of the ejecta falls back toward the AGN disc. As the fallback ejecta becomes more dispersed, it interacts with the disc gas, converting its kinetic energy into thermal energy. This results in a high-energy transient characterized by a rapid initial rise followed by a decay with $L\\propto t^{-2.8}$. The time-scale of the transient ranges from hours to weeks, depending on the mass of the SMBH. This process generates high-energy radiation spanning from hard X-rays to the soft $\\gamma$ range. Additionally, the subsequent damage to the disc may result in changing-look AGNs. Moreover, the falling back of SNe Ia ejecta onto the AGN disc significantly increases the metallicity of the AGN and can even generate heavy elements within the AGN discs.\n\n", "2308.14449": "2023-08-28, **White Dwarf--White Dwarf collisions in AGN discs via close encounters**, Yan Luo et.al., [2308.14449v1](http://arxiv.org/abs/2308.14449v1)\n\n White dwarfs (WDs) in active galactic nucleus (AGNs) discs might migrate to the inner radii of the discs and form restricted three-body systems with two WDs moving around the central supermassive black hole (SMBH) in close orbits. These systems could be dynamical unstable, which can lead to very close encounters or direct collisions. In this work, we use N-body simulations to study the evolution of such systems with the different initial orbital separation $p$, relative orbital inclination $\\Delta{i}$ and SMBH mass $M$. It is found that the close encounters of WDs mainly occur at $1.1R\\_{\\rm H} \\lesssim p \\lesssim 2\\sqrt{3}R\\_{\\rm H}$, where $R\\_{\\rm H}$ is the mutual Hill radius. For $p<1.1R\\_{\\rm H}$, the majority of WDs move in horseshoe or tadpole orbits, and only few of them with small initial orbital phase difference undergo close encounters. For $p=3.0R\\_{\\rm H}$, WD-WD collisions occur in most of the samples within a time of $10^5P\\_1$, and considerable collisions occur within a time of $t<62P\\_1$ for small orbital radii, where $P\\_1$ is the orbital period. The peak of the closest separation distribution increase and the WD-WD collision fraction decreases with an increase of the relative inclination. The closest separation distribution is similar in cases with the different SMBH mass, but the WD-WD collision fraction decreases as the mass of SMBHs increases. According to our estimation, the event rate of the cosmic WD-WD collision in AGN discs is about $300{\\rm Gpc^{-3}yr^{-1}}$, roughly $1\\%$ of the one of the observed type Ia supernova. The corresponding electromagnetic emission signals can be observed by large surveys of AGNs.\n\n", "2308.14197": "2023-08-27, **JWST Observations of the Extraordinary GRB 221009A Reveal an Ordinary Supernova Without Signs of $r$-Process Enrichment in a Low-Metallicity Galaxy**, Peter K. Blanchard et.al., [2308.14197v1](http://arxiv.org/abs/2308.14197v1)\n\n Identifying the astrophysical sites of the $r$-process, one of the primary mechanisms by which heavy elements are formed, is a key goal of modern astrophysics. The discovery of the brightest gamma-ray burst of all time, GRB 221009A, at a relatively nearby redshift, presented the first opportunity to spectroscopically test the idea that $r$-process elements are produced following the collapse of rapidly rotating massive stars. Here we present spectroscopic and photometric $\\textit{James Webb Space Telescope}$ (JWST) observations of GRB 221009A obtained $+168$ and $+170$ rest-frame days after the initial gamma-ray trigger, and demonstrate they are well-described by a supernova (SN) and power-law afterglow, with no evidence for an additional component from $r$-process emission, and that the SN component strongly resembles the near-infrared spectra of previous SNe, including SN 1998bw. We further find that the SN associated with GRB 221009A is slightly fainter than the expected brightness of SN 1998bw at this phase, concluding that the SN is therefore not an unusual GRB-SN. We infer a nickel mass of $\\approx0.09$ M$\\_{\\odot}$, consistent with the lack of an obvious SN detection in the early-time data. We find that the host galaxy of GRB 221009A has a very low metallicity of $\\approx0.12$ Z$\\_{\\odot}$ and our resolved host spectrum shows that GRB 221009A occurred in a unique environment in its host characterized by strong H$\\_2$ emission lines consistent with recent star formation, which may hint at environmental factors being responsible for its extreme energetics.\n\n"}}