{"neutrino": {"2311.18692": "2023-11-30, **UV-complete Gauged Anomaly-free U(1) Froggatt-Nielsen Model**, Johan Rathsman et.al., [2311.18692v1](http://arxiv.org/abs/2311.18692v1)\n\n We investigate the possibility of understanding all fermion masses and mixings within a gauged Froggatt-Nielsen framework. Continuing the work from [J. Rathsman and F. Tellander, Phys. Rev. D \\textbf{100}, 055032 (2019)] we especially focus on a UV completion of this type of models. Independent of the UV completion, we construct an anomaly-free two Higgs doublet model with a gauged $U(1)\\_F$ flavor symmetry and three right-handed neutrinos explaining all observed masses and mixings in the fermion sector. We then investigate two different UV completions: one through fermions and one through scalars. The fermion completion has low lying Landau poles in the gague couplings while the scalar completion is viable up to the gravity scale.\n\n", "2311.18509": "2023-11-30, **Search for Hidden Neutrinos at the European Spallation Source: the SHiNESS experiment**, Stefano Roberto Soleti et.al., [2311.18509v1](http://arxiv.org/abs/2311.18509v1)\n\n The upcoming European Spallation Source (ESS) will soon provide the most intense neutrino source in the world. We propose the Search for Hidden Neutrinos at the ESS (SHiNESS) experiment, highlighting its unique opportunities to search for the existence of sterile neutrinos across a wide range of scales: anomalous oscillations at short baselines; non-unitarity mixing in the active neutrino sector; or an excess of events with multiple leptons in the final state, produced in the decay of heavy neutrinos. The baseline design of the detector comprises a tank filled with 42 ton of liquid scintillator, located 25 m far from the ESS beam target. We show that SHiNESS will be able to considerably improve current global limits for the three cases outlined above. Although in this work we focus on new physics in the neutrino sector, the proposed setup may also be used to search for signals from weakly interacting particles in a broader context.\n\n", "2311.18499": "2023-11-30, **Weighing neutrinos with Lyman-$α$ observations**, Anjan K. Sarkar et.al., [2311.18499v1](http://arxiv.org/abs/2311.18499v1)\n\n The presence of massive neutrinos has still not been revealed by the cosmological data. We consider a novel method based on the two-point line-of-sight correlation function of high-resolution Lyman-$\\alpha$ data to achieve this end in the paper. We adopt semi-analytic models of Lyman-$\\alpha$ clouds for the study. We employ Fisher matrix technique to show that it is possible to achieve a scenario in which the covariance of the two-point function nearly vanishes for both the spectroscopic noise and the signal. We analyze this near 'zero noise' outcome in detail to argue it might be possible to detect neutrinos of mass range $m\\_\\nu \\simeq 0.05 \\hbox{--}0.1 \\, \\rm eV$ with signal-to-noise of unity with a single QSO line of sight. We show that this estimate can be improved to SNR $\\simeq 3\\hbox{--}6$ with data along multiple line of sights within the redshift range $z \\simeq 2 \\hbox{--} 2.5$. Such data sets already exist in the literature. We further carry out principal component analysis of the Fisher matrix to study the degeneracies of the neutrino mass with other parameters. We show that Planck priors lift the degeneracies between the neutrino mass and other cosmological parameters. However, the prospects of the detection of neutrino mass are driven by the poorly-determined parameters characterizing the ionization and thermal state of Lyman-$\\alpha$ clouds.\n\n", "2311.18455": "2023-11-30, **Probing the dark matter capture rate in Brown Dwarfs with IceCube**, Pooja Bhattacharjee et.al., [2311.18455v1](http://arxiv.org/abs/2311.18455v1)\n\n This study explores the potential for dark matter (DM) annihilation within brown dwarfs (BDs), investigating an unconventional mechanism for neutrino production. Motivated by the efficient accumulation of DM particles in BDs through scattering interactions, we focus on a mass range of 1 GeV to 100 TeV, considering DM annihilation channels $\\chi \\chi \\rightarrow \\nu \\bar{\\nu} \\nu \\bar{\\nu}$ through long-lived mediators. Using ten years of IceCube data, we assess the detection capability of local BDs and exclude DM-nucleon scattering with cross sections as low as a few times $10^{-39}~\\rm cm^{2}$. In this case, high-energy neutrinos provide more stringent constraints on DM scattering cross section than gamma rays.\n\n", "2311.18221": "2023-11-30, **Determining the core-collapse supernova explosion mechanism with current and future gravitational-wave observatories**, Jade Powell et.al., [2311.18221v1](http://arxiv.org/abs/2311.18221v1)\n\n Gravitational waves are emitted from deep within a core-collapse supernova, which may enable us to determine the mechanism of the explosion from a gravitational-wave detection. Previous studies suggested that it is possible to determine if the explosion mechanism is neutrino-driven or magneto-rotationally powered from the gravitational-wave signal. However, long duration magneto-rotational waveforms, that cover the full explosion phase, were not available during the time of previous studies, and explosions were just assumed to be magneto-rotationally driven if the model was rapidly rotating. Therefore, we perform an updated study using new 3D long-duration magneto-rotational core-collapse supernova waveforms that cover the full explosion phase, injected into noise for the Advanced LIGO, Einstein Telescope and NEMO gravitational-wave detectors. We also include a category for failed explosions in our signal classification results. We then determine the explosion mechanism of the signals using three different methods: Bayesian model selection, dictionary learning, and convolutional neural networks. The three different methods are able to distinguish between neutrino-driven driven explosions and magneto-rotational explosions, however they can only distinguish between the non-exploding and neutrino-driven explosions for signals with a high signal to noise ratio.\n\n"}, "dark matter": {"2311.18738": "2023-11-30, **Joint Cosmic Density Reconstruction from Photometric and Spectroscopic Samples**, Benjamin Horowitz et.al., [2311.18738v1](http://arxiv.org/abs/2311.18738v1)\n\n We reconstruct the dark matter density field from spatially overlapping spectroscopic and photometric redshift catalogs through a forward modelling approach. Instead of directly inferring the underlying density field, we find the best fitting initial Gaussian fluctuations that will evolve into the observed cosmic volume. To account for the substantial uncertainty of photometric redshifts we employ a differentiable continuous Poisson process. In the context of the upcoming Prime Focus Spectrograph (PFS), we find improvements in cosmic structure classification equivalent to 50-100\\% more spectroscopic targets by combining relatively sparse spectroscopic with dense photometric samples.\n\n", "2311.18647": "2023-11-30, **Long-term temporal stability of the DarkSide-50 dark matter detector**, The DarkSide-50 Collaboration et.al., [2311.18647v1](http://arxiv.org/abs/2311.18647v1)\n\n The stability of a dark matter detector on the timescale of a few years is a key requirement due to the large exposure needed to achieve a competitive sensitivity. It is especially crucial to enable the detector to potentially detect any annual event rate modulation, an expected dark matter signature. In this work, we present the performance history of the DarkSide-50 dual-phase argon time projection chamber over its almost three-year low-radioactivity argon run. In particular, we focus on the electroluminescence signal that enables sensitivity to sub-keV energy depositions. The stability of the electroluminescence yield is found to be better than 0.5%. Finally, we show the temporal evolution of the observed event rate around the sub-keV region being consistent to the background prediction.\n\n", "2311.18622": "2023-11-30, **Modelling Einstein cluster using Einasto profile**, Ritwik Acharyya et.al., [2311.18622v1](http://arxiv.org/abs/2311.18622v1)\n\n We demonstrate a general relativistic approach to model dark matter halos using the Einstein cluster, with the matter stress-energy generated by collisionless particles moving on circular geodesics in all possible angular directions and orbital radii. Such matter, as is known, allows an anisotropic pressure profile with non-zero tangential but zero radial pressure. We use the Einasto density profile for the Einstein cluster. Analytical studies on its properties (metric functions) and stability issues are investigated. Further, to establish this model (with the Einasto profile) as one for a dark matter halo, we use the SPARC galactic rotation curve data and estimate the best-fit values for the model parameters. General relativistic features (beyond the Keplerian velocities) such as the tangential pressure profile, are quantitatively explored. Thus, Einstein clusters with the Einasto profile, which tally well with observations, may be considered as a viable model for dark matter halos.\n\n", "2311.18549": "2023-11-30, **Scattering of dark pions in an Sp(4) gauge theory**, Yannick Dengler et.al., [2311.18549v1](http://arxiv.org/abs/2311.18549v1)\n\n In this work we consider strongly interacting dark matter candidates as composite states of $N\\_f=2$ fermions charged under a dark $Sp(4)$ gauge group in the fundamental representation. We give expressions that allow the calculation of correlation functions of two pseudo-Nambu-Goldstone-bosons with lattice field theory and present first results on the scattering phase shift in the isospin-2 channel in the theory from first principles. We give a lower limit on the dark matter particle mass by comparing our results with astrophysical constraints on the cross-section.\n\n", "2311.18546": "2023-11-30, **Parametric resonance of gravitational waves in general scalar-tensor theories**, Yi-Fu Cai et.al., [2311.18546v1](http://arxiv.org/abs/2311.18546v1)\n\n Gravitational waves offer a potent mean to test the underlying theory of gravity. In general theories of gravity, such as scalar-tensor theories, one expects modifications in the friction term and the sound speed in the gravitational wave equation. In that case, rapid oscillations in such coefficients, e.g. due to an oscillating scalar field, may lead to narrow parametric resonances in the gravitational wave strain. We perform a general analysis of such possibility within DHOST theories. We use disformal transformations to find the theory space with larger resonances, within an effective field theory approach. We then apply our formalism to a non-minimally coupled ultra-light dark matter scalar field, assuming the presence of a primordial gravitational wave background, e.g., from inflation. We find that the resonant peaks in the spectral density may be detectable by forthcoming detectors such as LISA, Taiji, Einstein Telescope and Cosmic Explorer.\n\n", "2311.18264": "2023-11-30, **Cm$^{15+}$ and Bk$^{16+}$ ion clocks with enhanced sensitivity to new physics**, V. A. Dzuba et.al., [2311.18264v1](http://arxiv.org/abs/2311.18264v1)\n\n We perform calculations of electronic structure of Cm$^{15+}$ and Bk$^{16+}$ ions and demonstrate that they have transitions which combine the features of atomic optical clocks with the enhanced sensitivity to the variations of the fine structure constant $\\alpha$. The high sensitivity is due to large nuclear charge $Z$, high ionisation degree $Z\\_i$ and the effect of {\\em level crossing}, which enables optical transitions between states of different configurations. These are the $6p\\_{1/2}-5f\\_{5/2} $ and $6p\\_{1/2}-5f\\_{7/2} $ transitions in the single valence electron approximation. Variation of $\\alpha$ may be due to the interaction with scalar and pseudoscalar (axion) dark matter fields. Therefore, Cm$^{15+}$ and Bk$^{16+}$ clocks are promising candidates to search for these fields.\n\n", "2311.18211": "2023-11-30, **Analytic approach to astrometric perturbations of critical curves by substructures**, Katsuya T. Abe et.al., [2311.18211v1](http://arxiv.org/abs/2311.18211v1)\n\n Astrometric perturbations of critical curves in strong lens systems are thought to be one of the most promising probes of substructures down to small-mass scales. While a smooth mass distribution creates a symmetric geometry of critical curves with radii of curvature about the Einstein radius, substructures introduce small-scale distortions on critical curves, which can break the symmetry of gravitational lensing events near critical curves, such as highly magnified individual stars. We derive a general formula that connects the fluctuation of critical curves with the fluctuation of the surface density caused by substructures, which is useful when constraining models of substructures from observed astrometric perturbations of critical curves. We numerically check that the formula is valid and accurate as long as substructures are not dominated by a small number of massive structures. As a demonstration of the formula, we also explore the possibility that an anomalous position of an extremely magnified star, recently reported as `Mothra', can be explained by fluctuations in the critical curve due to substructures. We find that cold dark matter subhalos with masses ranging from $5 \\times 10^7 M\\_{\\odot}/h$ to $10^9 M\\_{\\odot}/h$ can well explain the anomalous position of Mothra, while in the fuzzy dark matter model, the very small mass of $\\sim 10^{-24}~\\mathrm{eV}$ is needed to explain it.\n\n", "2311.18156": "2023-11-30, **The effect of wave dark matter on equal mass black hole mergers**, Josu C. Aurrekoetxea et.al., [2311.18156v1](http://arxiv.org/abs/2311.18156v1)\n\n For dark matter to be detectable with gravitational waves from binary black holes, it must reach higher than average densities in their vicinity. In the case of light (wave-like) dark matter, the density of dark matter between the binary can be significantly enhanced by accretion from the surrounding environment. Here we show that the resulting dephasing effect on the last ten orbits of an equal mass binary is maximized when the Compton wavelength of the scalar particle is comparable to the orbital separation, $2\\pi/\\mu\\sim d$. The phenomenology of the effect is different to the channels that are usually discussed, where dynamical friction (along the orbital path) and radiation of energy and angular momentum drive the dephasing, and is rather dominated by the radial force (the spacetime curvature in the radial direction) towards the overdensity between the black holes. Whilst our numerical studies limit us to scales of the same order, this effect may persist at larger separations and/or particle masses, playing a significant role in the merger history of binaries.\n\n"}, "supernova": {"2311.18516": "2023-11-30, **Modelling of radio supernovae: Including the effects of inhomogeneities and radiative cooling**, Claes-I. Bjornsson et.al., [2311.18516v1](http://arxiv.org/abs/2311.18516v1)\n\n The presence of inhomogeneities in a spatially unresolved source is often hard to establish. This limits the accuracy with which the source properties can be determined. It is shown how observed features not expected for a homogeneous model can be used to infer the properties of the inhomogeneities in radio supernovae. Furthermore, the observed consequences of radiative cooling can be seriously affected by inhomogeneities. It is shown that the deduced source properties are very sensitive to the observed value of the cooling frequency; even a lower limit is often useful to constrain its characteristics. It is argued that the main synchrotron emission region in SN 2003L has a small volume filling factor, possibly as low as a few per cent. On the contrary, deviations from homogeneity are substantially smaller in SN 2002ap. The observed properties of type Ib/c radio supernovae in general indicate the volume filling factor to remain rather constant with time for individual sources but those peaking later at radio frequencies have lower filling factors. The conditions in the main synchrotron component in both SN 2003L and SN 2002ap are consistent with equipartition of energy between relativistic electrons and magnetic fields.\n\n", "2311.18443": "2023-11-30, **The Hubble Tension Survey: A Statistical Analysis of the 2012-2022 Measurements**, Bao Wang et.al., [2311.18443v1](http://arxiv.org/abs/2311.18443v1)\n\n In order to investigate the potential Hubble tension, we compile a catalogue of 216 measurements of the Hubble--Lema\\^itre constant $H\\_0$ between 2012 and 2022, which includes 109 model-independent measurements and 107 $\\Lambda$CDM model-based measurements. Statistical analyses of these measurements show that the deviations of the results with respect to the average $H\\_0$ are far larger than expected from their error bars if they follow a Gaussian distribution. We find that $x\\sigma $ deviation is indeed equivalent in a Gaussian distribution to $x\\_{\\rm eq}\\sigma$ deviation in the frequency of values, where $x\\_{\\rm eq}=0.72x^{0.88}$. Hence, a tension of 5$\\sigma$, estimated between the Cepheid-calibrated type Ia supernovae and cosmic microwave background (CMB) data, is indeed a 3$\\sigma$ tension in equivalent terms of a Gaussian distribution of frequencies. However, this recalibration should be independent of the data whose tension we want to test. If we adopt the previous analysis of data of 1976-2019, the equivalent tension is reduced to $2.25\\sigma$. Covariance terms due to correlations of measurements do not significantly change the results. Nonetheless, the separation of the data into two blocks with $H\\_0<71$ and $H\\_0\\ge 71$ km s$^{-1}$ Mpc$^{-1}$ finds compatibility with a Gaussian distribution for each of them without removing any outlier. These statistical results indicate that the underestimation of error bars for $H\\_0$ remains prevalent over the past decade, dominated by systematic errors in the methodologies of CMB and local distance ladder analyses.\n\n", "2311.18429": "2023-11-30, **A Study of Primordial Very Massive Star Evolution II: Stellar Rotation and Gamma-Ray Burst Progenitors**, Guglielmo Volpato et.al., [2311.18429v1](http://arxiv.org/abs/2311.18429v1)\n\n We calculate new evolutionary models of rotating primordial very massive stars, with initial mass from ${100\\,M\\_{\\odot}}$ to ${200\\,M\\_{\\odot}}$, for two values of the initial metallicity ${Z=0}$ and ${Z=0.0002}$. For the first time in this mass range, we consider stellar rotation and pulsation-driven mass loss, along with radiative winds. The models evolve from the zero-age main sequence, until the onset of pair instability. We discuss the main properties of the models during their evolution and then focus on the final fate and the possible progenitors of jet-driven events. All tracks that undergo pulsational-pair instability produce successful gamma-ray bursts (GRB) in the collapsar framework, while those that collapse directly to black holes (BH) produce jet-driven supernova events. In these latter cases, the expected black hole mass changes due to the jet propagation inside the progenitor, resulting in different models that should produce BH within the pair-instability black-hole mass gap. Successful GRBs predicted here from zero-metallicity and very metal-poor progenitors may be bright enough to be detected even up to redshift ${\\sim20}$ using current telescopes such as the Swift-BAT X-ray detector and the JWST.\n\n"}}