{"neutrino": {"2311.12559": "2023-11-21, **The Ligo-Virgo-KAGRA Computing Infrastructure for Gravitational-wave Research**, Stefano Bagnasco et.al., [2311.12559v1](http://arxiv.org/abs/2311.12559v1)\n\n The LIGO, VIRGO and KAGRA Gravitational-wave (GW) observatories are getting ready for their fourth observational period, O4, scheduled to begin in March 2023, with improved sensitivities and thus higher event rates. GW-related computing has both large commonalities with HEP computing, particularly in the domain of offline data processing and analysis, and important differences, for example in the fact that the amount of raw data doesn't grow much with the instrument sensitivity, or the need to timely generate and distribute \"event candidate alerts\" to EM and neutrino observatories, thus making gravitational multi-messenger astronomy possible. Data from the interferometers are exchanged between collaborations both for low-latency and offline processing; in recent years, the three collaborations designed and built a common distributed computing infrastructure to prepare for a growing computing demand, and to reduce the maintenance burden of legacy custom-made tools, by increasingly adopting tools and architectures originally developed in the context of HEP computing. So, for example, HTCondor is used for workflow management, Rucio for many data management needs, CVMFS for code and data distribution, and more. We will present GW computing use cases and report about the architecture of the computing infrastructure as will be used during O4, as well as some planned upgrades for the subsequent observing run O5.\n\n", "2311.12540": "2023-11-21, **Analysis of reactor burnup simulation uncertainties for antineutrino spectrum prediction**, A. Barresi et.al., [2311.12540v1](http://arxiv.org/abs/2311.12540v1)\n\n Nuclear reactors are a source of electron antineutrinos due to the presence of unstable fission products that undergo $\\beta^-$ decay. They will be exploited by the JUNO experiment to determine the neutrino mass ordering and to get very precise measurements of the neutrino oscillation parameters. This requires the reactor antineutrino spectrum to be characterized as precisely as possible both through high resolution measurements, as foreseen by the TAO experiment, and detailed simulation models. In this paper we present a benchmark analysis utilizing Serpent Monte Carlo simulations in comparison with real pressurized water reactor spent fuel data. Our objective is to study the accuracy of fission fraction predictions as a function of different reactor simulation approximations. Then, utilizing the BetaShape software, we construct fissile antineutrino spectra using the summation method, thereby assessing the influence of simulation uncertainties on reactor antineutrino spectrum.\n\n", "2311.12511": "2023-11-21, **Proto-strange quark stars from density-dependent quark mass model**, Adamu Issifu et.al., [2311.12511v1](http://arxiv.org/abs/2311.12511v1)\n\n In this paper, we investigate the evolution of strange quark stars (SQS) from birth as proto-strange quark stars to maturity as stable SQSs at a zero temperature. We assume that self-bound free quarks form neutron stars (NS) and study their evolution using a density-dependent quark mass model. We consider $\\beta$-equilibrium stellar matter at two major stages of the star's evolution: neutrino trapped regime and neutrino transparent regime during the deleptonization and cooling processes of the star. We fix the entropy density and investigate the nuclear equation of state (EoS), particle distribution and temperature profile inside the star, sound velocity, polytropic index, and the structure of the star. Our results show that stars with higher neutrino concentrations are slightly more massive than the neutrino-poor ones along the evolution lines of the SQS. We obtain EoSs in agreement with the conformal boundary set through sound velocity, and also the 2 M$\\_\\odot$ mass constraint for NSs was satisfied at all stages of the star's evolution.\n\n", "2311.12487": "2023-11-21, **Quantum Gravity Effects on Fermionic Dark Matter and Gravitational Waves**, Stephen F. King et.al., [2311.12487v1](http://arxiv.org/abs/2311.12487v1)\n\n We explore the phenomenological consequences of breaking discrete global symmetries in quantum gravity (QG). We extend a previous scenario where discrete global symmetries are responsible for scalar dark matter (DM) and domain walls (DWs), to the case of fermionic DM, considered as a feebly interacting massive particle, which achieves the correct DM relic density via the freeze-in mechanism. Due to the mixing between DM and the standard model neutrinos, various indirect DM detection methods can be employed to constrain the QG scale, the scale of freeze-in, and the reheating temperature simultaneously. Since such QG symmetry breaking leads to DW annihilation, this may generate the characteristic gravitational wave background, and hence explain the recent observations of the gravitational wave spectrum by pulsar timing arrays. This work therefore highlights a tantalizing possibility of probing the effective scale of QG from observations.\n\n", "2311.12412": "2023-11-21, **Data reduction strategy in the PandaX-4T experiment**, Yubo Zhou et.al., [2311.12412v1](http://arxiv.org/abs/2311.12412v1)\n\n The PandaX-4T experiment is designed for multiple purposes, including searches for solar neutrinos, weakly interacting massive particles, and rare double beta decays of xenon isotopes. The experiment produces a huge amount of raw data that needs to be stored for related physical analyses in a wide energy range. With the upgrading of the PandaX-4T experiment, the doubled sampling rate resulted in a larger data size, which challenges both the cost and the data processing speed. To address this issue, we propose a data reduction strategy by removing the noise tail of large signals and downsampling the remaining parts of them. This strategy reduces the requirement for storage by 65% while increasing data processing speed. The influences on physical analyses on different topics at different energy regions are negligible.\n\n"}, "dark matter": {"2311.12789": "2023-11-21, **Formation of a Bose Star in a Rotating Cloud**, Kuldeep J. Purohit et.al., [2311.12789v1](http://arxiv.org/abs/2311.12789v1)\n\n In this paper, we study the evolutions of a self-gravitating cloud of bosonic dark matter with finite angular momentum and self-interaction. This is achieved by using the sixth-order pseudospectral operator splitting method to solve the system of nonlinear Schr\\\"odinger and Poisson equations. The initial cloud is assumed to have mass density randomly distributed throughout three-dimensional space. The dark matter particles in the initial cloud are in the kinetic regime, i.e., their de Broglie wavelength is much smaller than the halo size.   It is shown that Bose stars are indeed formed in the numerical simulation presented here. The presence of angular momentum and self-interaction in the initial cloud can significantly influence the star formation time in a non-trivial fashion. Furthermore, the plots of the vorticity magnitude profile after the star formation time indicate that the formed star may not have any intrinsic angular momentum for the cases when the self-interaction among the particles is either negligible or attractive. These results are in agreement with the earlier analytical studies of an isolated rotating Bose star. However, for the case of repulsive self-interaction, the vorticity magnitude analysis shows a possibility that the star formed in the numerical simulations may possess intrinsic angular momentum. It is also shown that the average mass and radius diagrams of the star are strongly influenced by the presence of angular momentum in the initial cloud.\n\n", "2311.12658": "2023-11-21, **The impact of primordial black holes on the stellar mass function of ultra-faint dwarf galaxies**, Nicolas Esser et.al., [2311.12658v1](http://arxiv.org/abs/2311.12658v1)\n\n If primordial black holes constitute the dark matter, stars forming in dark-matter dominated environments with low velocity dispersions, such as ultra-faint dwarf galaxies, may capture a black hole at birth. The capture probability is non-negligible for primordial black holes of masses around $10^{20}$g, and increases with stellar mass. Moreover, infected stars are turned into virtually invisible black holes on cosmologically short timescales. Hence, the number of observed massive main-sequence stars in ultra-faint dwarfs should be suppressed if the dark matter was made of asteroid-mass primordial black holes. This would impact the measured mass distribution of stars, making it top-light (i.e. depleted in the high-mass range). Using simulated data that mimic the present-day observational power of telescopes, we show that already existing measurements of the mass function of stars in local ultra-faint dwarfs could be used to constrain the fraction of dark matter composed of primordial black holes in the -- currently unconstrained -- mass range of $10^{19}-10^{21}$g.\n\n", "2311.12598": "2023-11-21, **The isolated elliptical galaxy NGC 5812 -- MOND or Dark Matter?**, Tom Richtler et.al., [2311.12598v1](http://arxiv.org/abs/2311.12598v1)\n\n There exist isolated elliptical galaxies, whose dynamics can be modelled without resorting to dark matter or MOND, e.g. NGC 7507. The isolated elliptical NGC 5812 is another object to investigate a possible role of isolation. We use globular clusters (GCs) and the galaxy light itself as dynamical tracers to constrain its mass profile. We employ Gemini/GMOS mask spectroscopy, apply the GMOS reduction procedures provided within IRAF, measure GC velocities by cross correlation methods and extract the line-of-sight kinematics of galaxy spectra using the tool pPXF. We identify 28 GCs with an outermost galactocentric distance of 20 kpc, for which velocities could be obtained. Furthermore, 16 spectra of the integrated galaxy light out to 6 kpc have been used to model the central kinematics. These spectra provide evidence for a disturbed velocity field. We construct spherical Jeans models for the galaxy light and apply tracer mass estimators for the globular clusters. With the assumptions inherent to the mass estimators, MOND is compatible with the mass out to 20 kpc. However, a dark matter free galaxy is not excluded. We find one globular cluster with an estimated mass of 1.6x10**7 solar masses, the first Ultra Compact Dwarf in an isolated elliptical. We put NGC 5812 into the general context of dark matter or alternative ideas in elliptical galaxies. The case for a MONDian phenomenology also among early-type galaxies has become so strong that deviating cases appear astrophysically more interesting than agreements. The baryonic Tully Fisher relation (BTFR) as predicted by MOND is observed in some samples of early-type galaxies, in others not. However, in cases of galaxies that deviate from the MONDian prediction, data quality and data completeness are often problematic. (abridged)\n\n", "2311.12259": "2023-11-21, **Analytical models of supermassive black holes in galaxies surrounded by dark matter halos**, Zibo Shen et.al., [2311.12259v1](http://arxiv.org/abs/2311.12259v1)\n\n In this Letter, three analytical models are constructed in closed forms, each representing a supermassive black hole (SMBH) located at the center of a galaxy surrounded by a dark matter halo.The latter is modeled by the Einstein cloud. The density profile of the halo vanishes inside two Schwarzschild radii of the SMBH and satisfies the weak, strong and dominant energy conditions.The spacetime is asymptotically flat, and the difference among the three models lies in the slopes of the density profiles in the far region from the galaxy center.\n\n"}, "supernova": {"2311.12558": "2023-11-21, **A Spatially resolved X-ray Polarization map of the Vela Pulsar Wind Nebula**, Kuan Liu et.al., [2311.12558v1](http://arxiv.org/abs/2311.12558v1)\n\n In this paper, we present a full spatially resolved polarization map for the Vela Pulsar Wind Nebula (PWN) observed by IXPE. By employing effective background discrimination techniques, our results show a remarkably high degree of local polarization in the outskirt region, exceeding 60% (55%) with a probability of 95% (99%), which approaches the upper limit predicted by the synchrotron emission mechanism. The high degree of polarization suggests that the turbulent magnetic energy is at most 33% of the ordered one. In addition, the X-ray polarization map exhibits a toroidal magnetic field pattern that is consistent with the field revealed by radio observations across the entire nebula. This consistency reveals that the observed X-ray and radio emissions are radiated by electrons from the same magnetic field. Different from the Crab PWN, the consistency observed in the Vela PWN may be attributed to the interaction between the reverse shock of supernova blast wave and the PWN, which leads to a displacement between the synchrotron-cooled nebula and the fresh nebula close to the pulsar. These findings deepen our understanding of the structure and evolution of the Vela PWN, and the magnetohydrodynamic interaction in PWNe.\n\n"}}