{"neutrino": {"2303.05437": "2023-03-09, **Performance of a liquid nitrogen cryostat for the study of nuclear recoils in undoped CsI crystals**, K. Ding et.al., [2303.05437v1](http://arxiv.org/abs/2303.05437v1)\n\n There is a global trend to increase the light yield of CsI scintillators used in neutrino and dark matter detection by operating undoped crystals at cryogenic temperatures. However, high light yield alone is not sufficient to guarantee a low energy threshold. The response of undoped crystals to nuclear recoils at cryogenic temperatures is equally important. A liquid nitrogen-based cryostat was developed to measure the nuclear quenching factor of a small undoped CsI crystal using monoenergetic neutron beams at the Triangle Universities Nuclear Laboratory (TUNL). To avoid neutron scattering in high-$z$ materials, they were intentionally reduced around the crystal. The structure and performance of the cryostat are described in detail. Using this cryostat, a light yield of $33.4 \\pm 1.7$ photoelectrons per keV electron-equivalent (PE/keV$\\_\\text{ee}$) was observed at 5.9 keVee, enabling the measurement of nuclear quenching factors at very low energies. The results of the quenching factor measurement will be reported in a subsequent paper.   Non-negligible overshooting was observed in the tails of light pulses. The origin of this issue and the correction procedure are described in detail. This information may be useful for others who encounter similar technical challenges.\n\n", "2303.05373": "2023-03-09, **Performance evaluation of the 8-inch MCP-PMT for Jinping Neutrino Experiment**, Aiqiang Zhang et.al., [2303.05373v1](http://arxiv.org/abs/2303.05373v1)\n\n Jinping Neutrino Experiment plans to deploy a new type of 8-inch MCP-PMT with high photon detection efficiency for MeV-scale neutrino measurements. This work studies the performance of the MCP-PMTs, including the photon detection efficiency, the charge resolution of the single photoelectron, the transition time spread, single photoelectron response, rates of dark counts and after pulses. We find a long tail in the charge distribution, and combined with the high photon detection efficiency, the overall energy resolution sees substantial improvements. Those results will be provided as the inputs to detector simulation and design. Our results show that the new PMT satisfies all the requirements of the Jinping Neutrino Experiment.\n\n", "2303.05172": "2023-03-09, **The JUNO experiment Top Tracker**, JUNO Collaboration et.al., [2303.05172v1](http://arxiv.org/abs/2303.05172v1)\n\n The main task of the Top Tracker detector of the neutrino reactor experiment Jiangmen Underground Neutrino Observatory (JUNO) is to reconstruct and extrapolate atmospheric muon tracks down to the central detector. This muon tracker will help to evaluate the contribution of the cosmogenic background to the signal. The Top Tracker is located above JUNO's water Cherenkov Detector and Central Detector, covering about 60% of the surface above them. The JUNO Top Tracker is constituted by the decommissioned OPERA experiment Target Tracker modules. The technology used consists in walls of two planes of plastic scintillator strips, one per transverse direction. Wavelength shifting fibres collect the light signal emitted by the scintillator strips and guide it to both ends where it is read by multianode photomultiplier tubes. Compared to the OPERA Target Tracker, the JUNO Top Tracker uses new electronics able to cope with the high rate produced by the high rock radioactivity compared to the one in Gran Sasso underground laboratory. This paper will present the new electronics and mechanical structure developed for the Top Tracker of JUNO along with its expected performance based on the current detector simulation.\n\n", "2303.05127": "2023-03-09, **Search for Majorana neutrinos**, Itaru Shimizu et.al., [2303.05127v1](http://arxiv.org/abs/2303.05127v1)\n\n Whether there exist elementary particles having Majorana nature is one the fundamental open question that has persisted since the 1930s. The only practical experiments to test the Majorana nature of neutrinos is the search for neutrinoless double-beta decay, which has been a major challenge for nuclear and particle physicists. In the 2000's, a number of experiments using advanced technologies have been planned, and some of which have already achieved significant improvements in the search sensitivity. In this article, the current status of the neutrinoless double-beta decay searches are summarized, reviewing the progress of KamLAND-Zen, which recorded the world best sensitivity in the effective Majorana neutrino mass limit.\n\n", "2303.05042": "2023-03-09, **Aspects of Quantum Gravity Phenomenology and Astrophysics**, Arundhati Dasgupta et.al., [2303.05042v1](http://arxiv.org/abs/2303.05042v1)\n\n With the discovery of gravitational waves, the search for the quantum of gravity, the graviton, is imminent. We discuss the current status of the bounds on graviton mass from experiments as well as the theoretical understanding of these particles. We provide an overview of current experiments in astrophysics such as the search for Hawking radiation in gamma-ray observations and neutrino detectors, which will also shed light on the existence of primordial black holes. Finally, the semiclassical corrections to the image of the event horizon are discussed.\n\n"}, "dark matter": {"2303.05492": "2023-03-09, **Resonant production of dark photons from axion without a large coupling**, Naoya Kitajima et.al., [2303.05492v1](http://arxiv.org/abs/2303.05492v1)\n\n Dark photons could be produced resonantly by the oscillating axion field in the early universe. This resonant production mechanism has been used in various contexts, including dark photon dark matter and primordial magnetic field production. However, for this resonant production to work in an expanding universe, a large axion-dark photon coupling is required, which is not easy to realize in terms of model building and requires the introduction of many charged fermions and/or the complex clockwork mechanism. In this paper, we present a new scenario that efficiently produces dark photons from the axion with a much smaller coupling. This is possible by modifying the dynamics of axion and significantly delaying the onset of oscillations, as in the so-called trapped misalignment mechanism. As a specific example, we consider models in which dark photon production occurs efficiently despite the small axion-dark photon coupling by temporally trapping an axion in a wrong minimum and releasing it after the Hubble parameter becomes much smaller than the axion mass. In this scenario, it is expected that the polarization asymmetry of dark photons and gravitational waves generated from dark photons will be significantly reduced.\n\n", "2303.05248": "2023-03-09, **Primordial black hole isocurvature modes from non-Gaussianity**, Raphaël van Laak et.al., [2303.05248v1](http://arxiv.org/abs/2303.05248v1)\n\n Primordial black holes (PBHs) are black holes that might have formed in high density regions in the early universe. The presence of local-type non-Gaussianity can lead to large-scale fluctuations in the PBH formation rate. If PBHs make up a non-negligible fraction of dark matter, these fluctuations can appear as isocurvature modes, and be used to constrain the amplitude of non-Gaussianity. We build upon the results of previous work by extending the calculation to include peaks theory and making use of the compaction $C$ for the formation criteria, accounting for non-linearities between $C$ and the curvature perturbation $\\zeta$. For quadratic models of non-Gaussianity, our updated calculation gives constraints that are largely unaltered compared to those previously found, while for cubic models the constraints worsen significantly. In case all of the DM is made up of PBHs, the parameters of non-Gaussianity are $-2.9\\cdot10^{-4}<f<3.8\\cdot10^{-4}$ and $-1.5\\cdot10^{-3}<g<1.9\\cdot10^{-3}$ for quadratic and cubic models respectively.\n\n", "2303.05107": "2023-03-09, **Improved bounds on the bosonic dark matter with pulsars in the Milky Way**, Dicong Liang et.al., [2303.05107v1](http://arxiv.org/abs/2303.05107v1)\n\n Neutron stars (NSs) can be used to constrain dark matter (DM) since a NS can transform into a black hole (BH) if it captures sufficient DM particles and exceeds the Chandrasekhar limit. We extend earlier work and for the first time take into account the Galactic motion of individual NSs, which changes the amount of the captured DM by as large as one to two orders of magnitude. We systematically apply the analysis to 414 NSs in the Milky Way, and constrain the DM particle mass and its interaction with nucleon simultaneously. We find that the most stringent bound is placed by a few NSs and the bound becomes stronger after considering the Galactic motion. The survival of observed NSs already excludes a cross section $\\sigma\\_{nX}\\gtrsim 10^{-45} \\, {\\rm cm}^2$ for DM particles with mass from $100\\, {\\rm MeV}$ to $10^3 \\, {\\rm GeV}$. Especially for a mass around $10 \\, {\\rm GeV}$, the constraint on the cross section is as stringent as $\\sigma\\_{nX}\\lesssim 10^{-49} \\, {\\rm cm}^2$.\n\n", "2303.05104": "2023-03-09, **Estimating the Oblateness Of Dark Matter Halos Using Neutral Hydrogen Velocity Dispersion**, Mousumi Das et.al., [2303.05104v1](http://arxiv.org/abs/2303.05104v1)\n\n We derive the oblateness parameter q of the dark matter halo of a sample of gas rich, face-on disk galaxies. We have assumed that the halos are triaxial in shape but their axes in the disk plane (a and b) are equal, so that q=c/a measures the halo flattening. We have used the HI velocity dispersion, derived from the stacked HI emission lines and the disk surface density to determine the disk potential and the halo shape at the R25 and 1.5R25 radii. We have applied our model to 20 nearby galaxies, of which 6 are large disk galaxies with M(stellar)>10^10 solar mass, 8 have moderate stellar masses and 6 are low surface brightness dwarf galaxies. Our most important result is that gas rich galaxies that have M(gas)/M(baryons)>0.5 have oblate halos (q < 0.55), whereas stellar dominated galaxies have a range of q values, ranging from 0.21+-0.07 in NGC4190 to 1.27+-0.61 in NGC5194. Our results also suggest a positive correlation between the stellar mass and the halo oblateness q, which indicates that galaxies with massive stellar disks have a higher probability of having halos that are spherical or slightly prolate, whereas low mass galaxies have oblate halos (q < 0.55).\n\n", "2303.05088": "2023-03-09, **Suppression of accidental backgrounds with deep neural networks in the PandaX-II experiment**, Nasir Shaheed et.al., [2303.05088v1](http://arxiv.org/abs/2303.05088v1)\n\n The PandaX dark matter detection project searches for dark matter particles using the technology of dual phase xenon time projection chamber. The low expected rate of the signal events makes the control of backgrounds crucial for the experiment success. In addition to reducing external and internal backgrounds during the construction and operation of the detector, special techniques are employed to suppress the background events during the data analysis. In this article, we demonstrate the use of deep neural networks (DNNs) for suppressing the accidental backgrounds, as an alternative to the boosted-decision-tree method used in previous analysis of PandaX-II. A new data preparation approach is proposed to enhance the stability of the machine learning and ultimately the sensitivity of the final data analysis.\n\n"}, "supernova": {"2303.05436": "2023-03-09, **Iteratively Comparing Gravitational-Wave Observations to the Evolution of Massive Stellar Binaries**, Vera Delfavero et.al., [2303.05436v1](http://arxiv.org/abs/2303.05436v1)\n\n Gravitational-wave observations have the capability to strongly differentiate between different concrete assumptions for how binary compact objects form. The agreement of observations to different models of the evolution of massive stellar binaries leading to the formation of compact binaries can be characterized by a Bayesian marginal likelihood. In this work, we show how to carefully interpolate this marginal likelihood between choices of binary evolution model parameters, enabling the analysis of their posterior distributions between expensive binary evolution simulations. Using the StarTrack binary evolution code, we compare one- and four-dimensional binary evolution models to the compact binary mergers reported in recent gravitational-wave observing runs, considering merger detection rates and mass distributions. We demonstrate that the predicted detection rates and mass distribution of simulated binaries are effective in constraining binary evolution formation. We first consider a one-dimensional model, studying the effect of SuperNova (SN) kick velocity ($\\sigma\\_{eff}$) and follow this up with a four-dimensional study of $\\sigma\\_{eff}$, mass transfer efficiency ($f\\_a$) and angular momentum ejection ($\\beta$) during Roche-lobe accretion, and an observation-driven reduction in the mass-loss rate from stellar wind ($f\\_{wind1}$). Of those four formation parameters, we find that three of them ($\\sigma\\_{eff}$, $f\\_a$, and $f\\_{wind1}$) can be efficiently constrained at this time. After initially sampling from a uniform prior in the space of these parameters, we refined our sampling by iteratively fitting a truncated Gaussian, and sampling from those Gaussians to propose new simulations with each iteration. Our maximum likelihood simulation (K0559) has parameters: $\\sigma\\_{eff} = 108.3$ km/s, $f\\_a = 0.922$ (indicating efficient mass transfer), and $f\\_{wind1} = 0.328$.\n\n", "2303.05258": "2023-03-09, **Common envelope jets supernova with thermonuclear outburst progenitor for the enigmatic supernova remnant W49B**, Aldana Grichener et.al., [2303.05258v1](http://arxiv.org/abs/2303.05258v1)\n\n We suggest a common envelope jets supernova (CEJSN) origin to the supernova remnant (SNR) W49B where jets launched by a neutron star (NS) that collapsed to a black hole (BH) together with a thermonuclear outburst of the disrupted red super giant's (RGS's) core powered and shaped the ejecta. The jets account for the highly non-spherical morphology of W49B and the thermonuclear outburst to its high iron abundance. CEJSNe are violent events powered by jets that a NS or a BH launch as they orbit inside a red supergiant star and accrete mass from its envelope and then from its core. We classify the CEJSN process to either a case where the NS/BH enters the core to form a common envelope evolution (CEE) inside the core or to a case where the NS/BH tidally disrupts the core. In the later case the core material forms an accretion disk around the NS that might experience a thermonuclear outburst, leading to an energetic event powered by both jets and thermonuclear burning. We term this scenario thermonuclear CEJSN. We find that the maximum core mass that leads to this scenario with a NS is $2 M\\_{\\rm \\odot} \\lesssim M\\_{\\rm core} \\lesssim 3.5M\\_{\\rm \\odot}$. We estimate the event rates of CEJSN that go through tidal disruption of the core by a NS to be 5 per 1000 core collapse supernovae.\n\n", "2303.05083": "2023-03-09, **Evolution of the post merger remnants from the coalescence of oxygen-neon and carbon-oxygen white dwarf pairs**, Chengyuan Wu et.al., [2303.05083v1](http://arxiv.org/abs/2303.05083v1)\n\n Although multidimensional simulations have investigated the processes of double WD mergers, post-merger evolution only focused on the carbon-oxygen (CO) WD or helium (He) WD merger remnants. In this work, we investigate for the first time the evolution of the remnants stemmed from the merger of oxygen-neon (ONe) WDs with CO WDs. Our simulation results indicate that the merger remnants can evolve to hydrogen- and helium-deficient giants with maximum radius of about 300Rsun. Our models show evidence that merger remnants more massive than 1.95Msun can ignite Ne before significant mass-loss ensues, and they thus would become electron-capture supernovae (ECSNe). However, remnants with initial masses less than 1.90Msun will experience further core contraction and longer evolutionary time before reaching at the conditions for Ne-burning. Therefore their fates are more dependent on mass-loss rates due to stellar winds, and thus more uncertain. Relatively high mass-loss rates would cause such remnants to end their lives as ONe WDs. Our evolutionary models can naturally explain the observational properties of the double WD merger remnant IRAS 00500+6713 (J005311). As previously suggested in the literature, we propose and justify that J005311 may be the remnant from the coalescence of an ONe WD and an CO WD. We deduce that the final outcome of J005311 would be a massive ONe WD rather than a supernova explosion. Our investigations may be able to provide possible constraints on the wind mass-loss properties of the giants which have CO-dominant envelopes.\n\n", "2303.05051": "2023-03-09, **The Early Light Curve of a Type Ia Supernova 2021hpr in NGC 3147: Progenitor Constraints with the Companion Interaction Model**, Gu Lim et.al., [2303.05051v1](http://arxiv.org/abs/2303.05051v1)\n\n The progenitor system of Type Ia supernovae (SNe Ia) is expected to be a close binary system of a carbon/oxygen white dwarf (WD) and a non-degenerate star or another WD. Here, we present results from a high-cadence monitoring observation of SN 2021hpr in a spiral galaxy, NGC 3147, and constraints on the progenitor system based on its early multi-color light curve data. First, we classify SN 2021hpr as a normal SN Ia from its long-term photometric and spectroscopic data. More interestingly, we found a significant \"early excess\" in the light curve over a simple power-law $\\sim t^{2}$ evolution. The early light curve evolves from blue to red and blue during the first week. To explain this, we fitted the early part of $BVRI$-band light curves with a two-component model of the ejecta-companion interaction and a simple power-law model. The early excess and its color can be explained by shock cooling emission due to a companion star having a radius of $8.84\\pm0.58$$R\\_{\\odot}$. We also examined HST pre-explosion images with no detection of a progenitor candidate, consistent with the above result. However, we could not detect signs of a significant amount of the stripped mass from a non-degenerate companion star ($\\lesssim0.003\\,M\\_{\\odot}$ for H$\\alpha$ emission). The early excess light in the multi-band light curve supports a non-degenerate companion in the progenitor system of SN 2021hpr. At the same time, the non-detection of emission lines opens a door for other methods to explain this event.\n\n", "2303.04966": "2023-03-09, **Infrared Ejecta and Cold Dust in the Young Supernova Remnant N132D**, Jeonghee Rho et.al., [2303.04966v1](http://arxiv.org/abs/2303.04966v1)\n\n We present Spitzer, WISE, and Herschel observations of the young supernova remnant (SNR) N132D in the LMC, including 3-40 microns Spitzer IRS mapping, 12 microns WISE and 70, 100, 160, 250, 350, and 500 microns Herschel images. The high-velocity lines of [Ne II] at 12.8 microns, [Ne III] at 15.5 microns, and [O IV] 26 microns reveal infrared ejecta concentrated in a central ring and coincide the optical and X-ray ejecta. Herschel images reveal far-IR emission coinciding with the central ejecta, which suggests that the IR emission is freshly formed, cold dust in the SN-ejecta. The infrared spectra are remarkably similar to those of another young SNR of 1E0102 with Ne and O lines. Shock modeling of the Ne ejecta emission suggests a gas temperature of 300 - 600 K and densities in the range 1000-20,000 cm^{-3} in the post-shock photoionized region. The IR continuum from the ejecta shows an 18 microns-peak dust feature. We performed spectral fitting to the IRS dust continuum and Herschel photometry. The dust mass associated with the central ejecta is 1.25+-0.65 Msun, while the 18 microns dust feature requires forsterite grains. The dust mass of the central ejecta region in N132D is higher than those of other young SNRs, which is likely associated with its higher progenitor mass. We discuss the dust productivity in the ejecta of N132D and infer its plausible implications for the dust in the early Universe.\n\n"}}