{"neutrino": {"2510.05050": "2025-10-06, **A comprehensive study of $Λ_c^- \\to Λ(\\to p π) μ^- \\bar ν_μ$ incorporating SMEFT implications and right-handed neutrino**, Priyanka Boora et.al., [2510.05050v1](http://arxiv.org/abs/2510.05050v1)\n\n Charm baryon decays provide a complementary probe of new physics beyond the Standard Model. We study the decay $\\Lambda\\_c^- \\to \\Lambda (p \\pi) \\mu^- \\bar \\nu\\_{\\mu}$ in a model-independent effective field theory framework. This study covers both the left-handed and right-handed neutrino interactions in the $c \\to s \\mu \\nu\\_{\\mu}$ transition. For the left-handed neutrino operators, we incorporate the implications of the Standard Model effective field theory and do a global fit considering several observables sensitive to these operators. Based on the allowed parameter space of the new-physics operators, we analyze the differential rates, forward-backward asymmetries, polarization asymmetries of the final-state hadron and lepton in $\\Lambda\\_c^- \\to \\Lambda \\mu^- \\bar \\nu\\_{\\mu}$, and the angular coefficients in 4-body angular distribution of $\\Lambda\\_c^- \\to \\Lambda (\\to p \\pi) \\mu^- \\bar \\nu\\_{\\mu}$. Our results highlight distinctive signatures of certain operators involving right-handed quark currents and provide predictions that can be tested at BESIII, Belle II, and LHCb.\n\n", "2510.04869": "2025-10-06, **First Measurement of Neutrino Emissions from Spent Nuclear Fuel by the Double Chooz Experiment**, Double Chooz Collaboration et.al., [2510.04869v1](http://arxiv.org/abs/2510.04869v1)\n\n Neutrino emission from nuclear reactors provides real-time insights into reactor power and fuel evolution, with potential applications in monitoring and nuclear safeguards. Following reactor shutdown, a low-intensity flux of ``residual neutrinos'' persists due to the decay of long-lived fission isotopes in the partially burnt fuel remaining within the reactor cores and in spent nuclear fuel stored in nearby cooling pools. The Double Chooz experiment at the Chooz B nuclear power plant in France achieved the first quantitative measurement of this residual flux based on 17.2 days of reactor-off data. In the energy range where the residual signal is most pronounced, the neutrino detector located 400$\\,$m from the cores recorded $106 \\pm 18$ neutrino candidate events (5.9$\\sigma$ significance). This measurement is in excellent agreement with the predicted value of $88 \\pm 7$ events derived from detailed reactor simulations modeling the decay activities of fission products and incorporating the best-available models of neutrino spectra.\n\n", "2510.04841": "2025-10-06, **One-Loop Effects in the Neutrino Matter Potential and Implications for Non-Standard Interactions**, Jihong Huang et.al., [2510.04841v1](http://arxiv.org/abs/2510.04841v1)\n\n In this work, we emphasize that it is necessary to take into account one-loop corrections of $2.0\\%$ to the neutrino matter potential in the precision measurements of neutrino oscillation parameters and in the experimental searches for new physics beyond the Standard Model. With the numerical simulation of the DUNE experiment, we study how radiative corrections to the matter potential affect neutrino oscillation probabilities, and thus, the event rates in the presence of neutrino non-standard interactions (NSIs). We find that neglecting one-loop corrections may lead to wrong conclusions for the discovery of NSIs. The implications for the determination of neutrino mass ordering and constraints on the NSI parameters in future long-baseline accelerator neutrino experiments are explored in a quantitative way.\n\n", "2510.04687": "2025-10-06, **Scattering of massive neutrino test fields from a gravitational pulse**, Tekin Dereli et.al., [2510.04687v1](http://arxiv.org/abs/2510.04687v1)\n\n Linearized Einstein-Weyl equations are solved precisely in the context of sandwich gravitational waves. The neutrino's energy-momentum depends on the geometry and composition of the gravitational pulse when it is scattered. Since the background remains unchanged at the test field level, the neutrino's energy density will exhibit fluctuations between positive and negative extremes when traversing the sandwich wave. These variations could provide insights into the behavior of models concerning neutrino oscillations.\n\n", "2510.04684": "2025-10-06, **Neutrinogenic CMB spectral distortions**, Shao-Ping Li et.al., [2510.04684v1](http://arxiv.org/abs/2510.04684v1)\n\n Extra radiation injection after neutrino decoupling in the early Universe contributes to the effective number of neutrino species that can be constrained by the cosmic microwave background (CMB). However, any effective neutrino number itself cannot uniquely determine the underlying source. We argue that the degeneracy can be relaxed by CMB spectral distortions, which are caused by energy exchange between the extra radiation and photons. We consider neutrinogenic CMB spectral distortions, where extra energy is released in the form of neutrinos but still creates the CMB spectral distortions via electroweak interactions. The synergy between the effective neutrino number and CMB spectral distortions provides a complementary probe of hidden sectors that dominantly couple to neutrinos, opening up parameter space that can be targeted by joint CMB anisotropy and spectral distortion experiments.\n\n", "2510.04549": "2025-10-06, **Dirac neutrino and dark matter in left-right symmetric models**, Shohei Okawa et.al., [2510.04549v1](http://arxiv.org/abs/2510.04549v1)\n\n We study neutrino mass generation and dark matter in a left-right symmetric model. The model is based on an $SU(3)\\_c\\times SU(2)\\_L \\times SU(2)\\_R \\times U(1)\\_{B-L}$ gauge theory with a softly broken parity symmetry. Masses of the charged leptons and neutrinos are generated radiatively at one-loop and three-loop level respectively, through their interactions with newly introduced neutral fermion and scalar particles. A mass hierarchy of those new particles is required to reproduce the observed patterns of the charged lepton spectrum and neutrino oscillation data. The resulting light particles, whose mass can be as light as GeV, serve as good dark matter candidates. The phenomenology of such dark matter candidates is governed by their interactions to left- or right-handed neutrinos. We study physics of dark matter with several benchmark parameter sets that reproduce the realistic neutrino mass matrix structure, and identify viable parameter spaces.\n\n"}, "dark matter": {"2510.05037": "2025-10-06, **On the sensitivity of different galaxy properties to warm dark matter**, Belén Costanza et.al., [2510.05037v1](http://arxiv.org/abs/2510.05037v1)\n\n We study the impact of warm dark matter (WDM) particle mass on galaxy properties using 1,024 state-of-the-art cosmological hydrodynamical simulations from the DREAMS project. We begin by using a Multilayer Perceptron (MLP) coupled with a normalizing flow to explore global statistical descriptors of galaxy populations, such as the mean, standard deviation, and histograms of 14 galaxy properties. We find that subhalo gas mass is the most informative feature for constraining the WDM mass, achieving a determination coefficient of R^2 = 0.9. We employ symbolic regression to extract simple, interpretable relations with the WDM particle mass. Finally, we adopt a more localized approach by selecting individual dark matter halos and using a Graph Neural Network (GNN) with a normalizing flow to infer the WDM mass, incorporating subhalo properties as node features and global simulation statistics as graph-level features. The GNN approach yields only a residual improvement over MLP models based solely on global features, indicating that most of the predictive power resides in the global descriptors, with only marginal gains from halo-level information.\n\n", "2510.04977": "2025-10-06, **Line emission search from DM annihilation in the Galactic Center with LST-1**, Abhishek Abhishek et.al., [2510.04977v1](http://arxiv.org/abs/2510.04977v1)\n\n Dark Matter remains a great mystery in modern physics. Among various candidates, the weakly interacting massive particles (WIMPs) scenario stands out and is under extensive study. The detection of the hypothetical gamma-ray emission from WIMP annihilation could act as a direct probe of electroweak-scale interactions, complementing DM collider searches and other direct DM detection techniques. At very high energies (VHE), WIMP self-annihilation is expected to produce gamma rays together with other Standard Model particles. The galactic center (GC), due to its relative proximity to the Earth and its high expected DM density, is a prime target for monoenergetic line searches. IACTs have placed strong constraints on the DM properties at the GC, with the MAGIC providing the most stringent limits from 20 TeV to 100 TeV, exploiting large zenith angle (LZA) observations. However, the limited field of view (FoV) of the MAGIC telescopes (< 3.5{\\deg} ) prevented a detailed study of the extended region around the GC in which an enhanced DM density is expected. The LST-1 of the CTAO, located at the Roque de Los Muchachos Observatory (La Palma, Spain), close to the MAGIC site, has been observing the GC since 2021. With its wide FoV of 4.5{\\deg}, LST-1 could contribute significantly to the WIMPs search at the GC. The observations are performed at LZA (ZA > 58{\\deg}), which, while required due to the source's low altitude, also optimizes the detection of gamma rays up to 100 TeV and beyond. We present a study of the systematic uncertainties in WIMP line emission searches with LST-1. Our work examines the instrument response functions for LZA observations, background rejection in monoscopic mode, and includes updated results from simulations, highlighting new methods for spectral line searches.\n\n", "2510.04709": "2025-10-06, **Matching JWST UV Luminosity Functions with Refined $Λ$CDM Halo Models**, Saeed Fakhry et.al., [2510.04709v1](http://arxiv.org/abs/2510.04709v1)\n\n The James Webb Space Telescope (JWST) has unveiled a population of unexpectedly massive and luminous galaxies at redshifts $z \\gtrsim 7$, posing a significant challenge to the standard $\\Lambda$CDM cosmological paradigm. In this work, we address the tension between early JWST observations of luminous high-redshift galaxies and predictions of the standard $\\Lambda$CDM model by revisiting the physics of dark matter halo formation. Employing refined halo mass functions derived by Del Popolo \\textit{et al.} (DP1 and DP2) that incorporate angular momentum, dynamical friction, and redshift-dependent collapse barriers, we demonstrate a significant enhancement in the abundance of massive halos at $z \\gtrsim 7$ compared to the conventional Sheth-Tormen (ST) formalism. Using a semi-empirical framework linking halo mass to UV luminosity, we show that the DP2 model reproduces the observed UV luminosity functions from $z = 7$ to $14$ with moderate star formation efficiencies, whereas the ST model requires implausibly high efficiencies. Our results suggest that the JWST overabundance problem stems not from new physics beyond $\\Lambda$CDM, but from oversimplified treatments of gravitational collapse, highlighting the critical role of small-scale dissipative dynamics in early structure formation.\n\n", "2510.04610": "2025-10-06, **Mixed WIMP-FIMP scenario in a two-component dark matter model**, XinXin Qi et.al., [2510.04610v1](http://arxiv.org/abs/2510.04610v1)\n\n We consider the mixed WIMP-FIMP scenario in a two-component dark matter model with $Z\\_2 \\times Z\\_4$ symmetry, where a singlet scalar $S$ and a Majarano fermion $\\chi$ are introduced as dark matter candidates. We also introduce another singlet scalar $S\\_0$ with a non-zero vacuum expectation value to the SM so that the fermion dark matter can obtain mass after spontaneous symmetry breaking. Either $S$ or $\\chi$ relic density can be generated via the \"Freeze-out\" mechanism. In contrast, the other DM candidate relic density is obtained by the \"Freeze-in\" mechanism, and we therefore have two different cases. In the case of $\\chi$ as WIMP and $S$ as FIMP, we perform random scans to estimate the allowed parameter space consistent with the dark matter constraint. The results show that this case is viable over a wide range of dark matter masses with the Yukawa coupling of $S\\_0$ and $\\chi$ should be larger than 1. Instead, for the case of $S$ as WIMP and $\\chi$ as FIMP, the viable parameter space is more constrained by the direct detection experiements, and we have two regions with $m\\_S \\approx 62.5$ GeV and $m\\_S>400$ GeV under the constraints, which is consistent with the singlet scalar DM result but the scalar DM mass can be as low as a few hundred GeV for the heavy mass region in the model.\n\n", "2510.04523": "2025-10-06, **Suzaku observations of outskirts of nearby clusters and groups: I. electron density and gas fraction to the virial radius**, Kyoko Matsushita et.al., [2510.04523v1](http://arxiv.org/abs/2510.04523v1)\n\n We present an analysis of Suzaku observations of 14 nearby galaxy clusters and groups (z < 0.06), extending radial coverage out to the virial radius (approximately r200). The sample spans a wide mass range, from M500 about 2x10^13 to 7x10^14 solar masses, and includes well-studied systems such as Coma, Perseus, and Virgo. We carefully modeled all background components, including the soft X-ray foregrounds (the Local Hot Bubble, Milky Way Halo, and super-virial temperature components), the cosmic X-ray background, and the non-X-ray background, and assessed their effects on the derived properties of the intracluster medium (ICM). We constructed radial profiles of emission measure, electron density, and temperature. Temperatures decrease smoothly with radius, typically dropping to about one-third to half of their peak values near r200. For relaxed clusters, the emission measure profiles outside the core regions are well described by a beta model with beta around 0.6-0.7, while groups show slightly flatter slopes of beta around 0.4-0.65. Beyond r2500, electron density profiles follow a power-law decline with a slope close to 2. At r500 and r200, the electron density and the gas mass fraction show a tight correlation with the system mass, except for three clusters with bright subclusters. In massive clusters, the gas fraction increases with radius and approaches the cosmic baryon fraction near r200. In contrast, lower-mass systems exhibit gas fractions of around 0.1 at r200. The observed mass dependence of gas fractions suggests that feedback and related processes play an increasingly important role toward the group scale, shaping the connection between baryons and dark matter halos.\n\n", "2510.04416": "2025-10-06, **Analysis of Galaxies at the Extremes: Failed Galaxy Progenitors in the MAGNETICUM Simulations**, Jonah S. Gannon et.al., [2510.04416v1](http://arxiv.org/abs/2510.04416v1)\n\n There is increasing observational evidence for a failed galaxy formation pathway for some ultradiffuse galaxies (UDGs) at low redshift however they currently lack simulated counterparts. We attempt to identify dark matter halos at high redshift within the MAGNETICUM cosmological simulations that could plausibly be their progenitors. We build a toy model of passive galaxy evolution within the stellar mass-halo mass relation to trace z = 0 observations of UDGs back to their z = 2 locations. We identify a population of 443 galaxies that match these parameter space positions within the simulation. We build two comparison samples within the simulation that follow the stellar mass-halo mass relationship at z = 2, one of which is stellar mass matched (with varying smaller halo masses) and the other is halo mass matched (with varying larger stellar masses) to our sample. We identify that our failed galaxy progenitor candidates have 1) flatter, cored dark matter halos; 2) more extended stellar bodies; 3) a larger fraction of their gas in the outskirts of their halos; 4) lower metallicities and 5) higher star formation rates than the control samples. Findings 1) and 2) are similar to low redshift observations of UDGs. Finding 3) will aid the removal of gas and permanent quenching of star formation which is a requirement of the failed galaxy formation scenario. The low metallicities of finding 4) match those observed in low redshift failed galaxy UDGs. Comparing the high star formation rates of finding 5) to recent JWST observations suggests that a starburst would naturally explain the high globular cluster richness of the UDGs. Many of the properties we find for these failed galaxy progenitors can be explained by an assembly bias of their dark matter halo to later formation times. We conclude by proposing that the fraction of failed galaxy UDGs is expected to increase with environmental density.\n\n"}, "supernova": {"2510.04872": "2025-10-06, **The demographics of core-collapse supernovae I. The role of binary evolution and CSM interaction**, Andrea Ercolino et.al., [2510.04872v1](http://arxiv.org/abs/2510.04872v1)\n\n The observational properties of core-collapse supernovae (CC-SNe) are shaped by the envelopes of their progenitors. In massive binary systems, mass-transfer alters the pre-SN structures compared to single stars, leading to a diversity in SN explosions. Aims. We compute the distribution of CC-SN properties based on comprehensive detailed grids of single and binary stellar evolution models. We conduct a grid-based population synthesis to produce a synthetic population of CC-SNe, and compare it to observed SN samples. We also apply various explodability and merger criteria to our models. In line with earlier results, we identify interacting SN progenitors as those stars that undergo CC during or shortly after a Roche-lobe overflow phase. With an interacting binary fraction of 68%, our models predict two-thirds of all CC-SNe to be of Type IIP/L, and 1/3 of Type Ibc, in agreement with recent volume-limited SN surveys. We find that 76% of the Type Ibc SN progenitors took part in a previous binary mass transfer (mostly as mass donor), but also 63% of the Type IIP/L SN progenitors (mostly as mass gainers), yielding a much broader envelope mass distribution than expected from single stars. We find that mass-transfer induced interacting SNe make up ~5% of all CC-SNe, which is close to the observed fractions of Type IIn and Type Ibn SNe. When assuming a disk or toroidal CSM geometry for Type IIn SNe, our models predict a bimodal distribution of the radiated energies, similar to that deduced from observations. While we find the effect of binary evolution on the relative number of Type Ibc and Type IIP/L SNe to be moderate, it leads to lower average ejecta masses in Type Ibc and Type IIb SNe, and can lead to higher pre-SN masses in Type IIP/L SNe than single stars. Binary models are also able to reproduce the number and properties of interacting SNe.\n\n", "2510.04635": "2025-10-06, **The Role of Acoustic Instability in Cosmic-Ray Self-Confinement**, Antonio Capanema et.al., [2510.04635v1](http://arxiv.org/abs/2510.04635v1)\n\n Over the past decades, there has been growing observational and theoretical evidence that cosmic-ray-induced instabilities play an important role in both acceleration and transport of cosmic rays (CRs). For instance, the efficient acceleration of charged particles at supernova remnant shocks requires rapidly growing instabilities, so much so that none of the proposed processes seem sufficient to warrant acceleration to PeV energies. In this work, we investigate whether an acoustic instability triggered by the presence of a CR pressure gradient can lead to significant self-confinement of charged particles in the vicinity of shocks. We validate the expected growth rates and obtain the scale and energy of magnetic field perturbations induced by such system using magnetohydrodynamical simulations. Our results suggest a strong suppression of the diffusion coefficient for particles with Larmor radius around a thousandth of the precursor scale length.\n\n", "2510.04597": "2025-10-06, **The challenging first direct measurement of the 65 keV resonance strength in the $^{17}$O(p,$γ$)$^{18}$F reaction at LUNA**, D. Piatti et.al., [2510.04597v1](http://arxiv.org/abs/2510.04597v1)\n\n A precise determination of the proton capture rates on oxygen is mandatory to predict the abundance ratios of oxygen isotopes in a stellar environment where the hydrogen burning is active. The 17O(p,{\\gamma})18F reaction, in particular, plays a crucial role in AGB nucleosynthesis as well as in explosive hydrogen burning occurring in novae and type I supernovae. At the temperature of interest for the former scenario (from 20 MK to 80 MK) the main contribution to the astrophysical reaction rate comes from the Er = 64.5 keV resonance. The strength of this resonance is presently determined only through indirect measurements, with an adopted value {\\omega}{\\gamma} = 16(3) peV. A new high sensitivity setup has been installed at LUNA, located at Laboratori Nazionali del Gran Sasso. The underground location of LUNA 400kV guarantees a reduction of the cosmic ray background by several orders of magnitude. The residual background was further reduced by a dedicated shielding. On the other hand the 4{\\pi}BGO detector efficiency was optimized installing an aluminum target chamber and holder. With about 400 C accumulated on Ta2O5 targets, highly enriched in 17O, the LUNA collaboration has performed the first ever direct measurement of the 64.5 keV resonance strength.\n\n", "2510.04570": "2025-10-06, **Relativistic hydrodynamics simulations of supernova explosions within extragalactic jets**, B. Longo et.al., [2510.04570v1](http://arxiv.org/abs/2510.04570v1)\n\n Jets in active galactic nuclei have to cross significant distances within their host galaxies, meeting large numbers of stars of different masses and evolution stages in their paths. Given enough time, supernova explosions within the jet will eventually happen, and may have a strong impact on its dynamics, potentially triggering powerful non-thermal activity. We carried out a detailed numerical study to explore the dynamics of the interaction between the ejecta of a supernova explosion and a relativistic extragalactic jet. By means of relativistic hydrodynamics simulations using the code RATPENAT, we simulated the jet-ejecta interaction in two different geometries or scenarios: a two-dimensional, axisymmetric simulation, and a three-dimensional one, which includes the orbital velocity of the exploding star. Although initially filling a region much smaller than the jet radius, the ejecta expands and eventually covers most of the jet cross section. The expansion is enhanced as more energy from the jet is converted into kinetic and internal energy of the ejecta, which also favors the ejecta disruption, all this occurring on timescales ~ 10^4 yr. Although a complete numerical convergence of the results is unattainable given the subsonic, turbulent nature of the interaction region, the simulations are consistent in their description of the gross morphological and dynamical properties of the interaction process. At the end of the simulations, the supernova ejecta has already partially mixed with the relativistic jet. The results also suggest that the jet-ejecta interaction may be a non-negligible non-thermal emitter. Moreover, due to efficient mixing, the interaction region can be a potential source of ultra-high-energy cosmic rays of heavy composition.\n\n", "2510.04414": "2025-10-06, **Latest view of CTA 1 with VERITAS**, Alisha Chromey et.al., [2510.04414v1](http://arxiv.org/abs/2510.04414v1)\n\n CTA 1 is a shell-type supernova remnant (SNR) with a central pulsar wind nebula (PWN), visible at very-high-energy (VHE) from 50 GeV to 100 TeV from a moderately extended emission region. While general consensus concludes the VHE emission originates from relativistic leptons accelerated by the PWN and undergoing inverse Compton scattering, questions remain about electron escape and propagation, as well as the evolutionary stage of this particular PWN. CTA 1 is on the cusp of middle age (~13 kyr) and spatially resolvable at energies visible to imaging atmospheric Cherenkov telescopes (IACTs), such as the Very Energetic Radiation Imaging Telescope Array System (VERITAS) (PSF < 0.1 deg). Therefore, this remnant is an excellent candidate to study lepton propagation and escape between different PWN evolutionary stages. Since the initial VERITAS publication on CTA 1 in 2013, VERITAS has performed new observations, adding to a total exposure of about 120 hours. We have analyzed the entire VERITAS CTA 1 dataset to date and report results.\n\n", "2510.04191": "2025-10-05, **Is CPL dark energy a mirage?**, Mikel Artola et.al., [2510.04191v1](http://arxiv.org/abs/2510.04191v1)\n\n Recent observations from the Dark Energy Spectroscopic Instrument (DESI) raise doubts about the standard cosmological model, $\\Lambda$CDM, suggesting a preference for an inherently dynamical dark energy component. The Chevallier-Polarski-Linder (CPL) parameterization -- a widely used two-parameter model for the dark energy equation of state -- displays marked early-time phantom behavior and a recent crossing of the phantom divide. These features suggest the convenience to check observationally the robustness of such evolution. To address this, we design two alternative families of two-parameter dark energy parameterizations which remain close to the original CPL but aim to soften its phantom character. Specifically, these models reproduce CPL-like behavior at low redshift but mitigate early phantom behavior through the use of smooth sigmoid transitions, yielding a more gradual evolution. By combining recent DESI data with constraints from the cosmic microwave background and Type Ia supernovae, we assess the viability of these models. Our analysis shows that CPL remains a strong and competitive parameterization, with the proposed alternatives only marginally favored or disfavored. We conclude that current observational data lack the statistical precision to decisively distinguish between CPL and similarly constructed parameterizations across the redshift range probed by late-time observables.\n\n", "2510.04179": "2025-10-05, **Crosschecking Cosmic Distances from DESI BAO and DES SNe Points to Systematics**, Mauricio Lopez-Hernandez et.al., [2510.04179v1](http://arxiv.org/abs/2510.04179v1)\n\n We perform a consistency check of DESI DR2 BAO constraints ($D\\_M/r\\_d, D\\_H/r\\_d)$ by reconstructing the same quantities from DES supernovae (SNe) in bins with the same effective redshift $z\\_{\\textrm{eff}}$. We find that the ratio of $D\\_M/r\\_d$ values are consistent with a horizontal, thus confirming that the distance duality relation holds up to calibration. However, the $D\\_H/r\\_d$ ratio shows a decreasing trend with $z\\_{\\textrm{eff}}$ at $2.3 \\sigma$ to $2.5 \\sigma$ that cannot be explained by physics. We demonstrate that the result does not depend on the choice of cosmological model, but the radius of the sound horizon $r\\_d$ has a much greater influence. Studying ratios of $D\\_H/r\\_d$ is a stronger test than the distance duality relation, and the rejection of a horizontal confirms systematics in either DESI BAO or DES SNe. Claims of new physics based on combined data still have rudimentary hurdles to clear.\n\n"}}