{"neutrino": {"2410.21253": "2024-10-28, **Back to the phase space: thermal axion dark radiation via couplings to standard model fermions**, Francesco D'Eramo et.al., [2410.21253v1](http://arxiv.org/abs/2410.21253v1)\n\n We investigate the cosmological consequences of axion interactions with standard model fermions accurately and precisely. Our analysis is entirely based on a phase space framework that allows us to keep track of the axion distribution in momentum space across the entire expansion history. First, we consider flavor-diagonal couplings to charged leptons and quantify the expected amount of dark radiation as a function of the coupling strength. Leptophilic axions are immune from complications due to strong interactions and our predictions do not suffer from theoretical uncertainties. We then focus on flavor-diagonal interactions with the three heavier quarks whose masses are all above the scale where strong interactions become non-perturbative. The top quark case is rather safe because its mass is orders of magnitude above the confinement scale, and the consequent predictions are solid. The bottom and charm masses are in more dangerous territory because they are very close to the QCD crossover. We present a comprehensive discussion of theoretical uncertainties due to both the choice of the scale where we stop the Boltzmann evolution and the running of QCD parameters. Finally, we compute the predicted amount of dark radiation expressed as an effective number of additional neutrino species. We compare our predictions with the ones obtained via standard approximate procedures, and we find that adopting a rigorous phase space framework alters the prediction by an amount larger than the sensitivity of future CMB observatories.\n\n", "2410.21137": "2024-10-28, **Search for excited tau leptons in the $ττγ$ final state in proton-proton collisions at $\\sqrt{s}$ = 13 TeV**, CMS Collaboration et.al., [2410.21137v1](http://arxiv.org/abs/2410.21137v1)\n\n Results are presented for a test of the compositeness of the heaviest charged lepton, $\\tau$, using data collected by the CMS experiment in proton-proton collisions at a center-of-mass energy of 13 TeV at the CERN LHC. The data were collected in 2016-2018 and correspond to an integrated luminosity of 138 fb$^{-1}$. This analysis searches for tau lepton pair production in which one of the tau leptons is produced in an excited state and decays to a ground state tau lepton and a photon. The event selection consists of two isolated tau lepton decay candidates and a high-energy photon. The mass of the excited tau lepton is reconstructed using the missing transverse momentum in the event, assuming the momentum of the neutrinos from each tau lepton decay are aligned with the visible decay products. No excess of events above the standard model background prediction is observed. This null result is used to set lower bounds on the excited tau lepton mass. For a compositeness scale $\\Lambda$ equal to the excited tau lepton mass, excited tau leptons with masses below 4700 GeV are excluded at 95% confidence level; for $\\Lambda$ = 10 TeV this exclusion is set at 2800 GeV. This is the first experimental result covering this production and decay process in the excited tau mass range above 175 GeV.\n\n", "2410.20681": "2024-10-28, **Influence of neutrino-electron scattering and neutrino-pair annihilation on hypermassive neutron star**, Patrick Chi-Kit Cheong et.al., [2410.20681v1](http://arxiv.org/abs/2410.20681v1)\n\n We investigate the influence of inelastic neutrino microphysics in general-relativistic magnetohydrodynamics simulations of a hypermassive neutron star. In particular, we include species/energy groups coupled neutrino-matter interactions, such as inelastic neutrino-electron scattering and electron-positron annihilation kernels, into simulations up to 50 ms. Neutrino-electron inelastic scattering is known to have effective neutrino-matter energy exchange. We show that, with neutrino-electron inelastic scattering, simulations predict 75% higher disc mass with slightly different mass-averaged compositions, and 18% more ejected mass with similar distributions. The enhancement of the mass of the disc and the ejecta results in stronger baryon pollution, leading to less favourable jet launching environments. Furthermore, neutrino luminosities are about 50, 40, and 30% higher for electron neutrino, electron anti-neutrino, and heavy-lepton neutrinos. In contrast, we do not see any significant impacts due to electron-positron annihilation.\n\n"}, "dark matter": {"2410.21221": "2024-10-28, **High resolution HI mapping of nearby XMP BCD galaxies**, Tom C. Scott et.al., [2410.21221v1](http://arxiv.org/abs/2410.21221v1)\n\n Optical observations of Blue Compact Dwarf galaxies (BCDs) show they typically have high specific star formation rates and low metallicites. A subset of these galaxies (those with the lowest gas phase metallicities) display cometary optical morphologies similar to those found at high redshift. Whether this combination of properties predominantly arises from interactions with neighbours or accretion from the cosmic web or something else remains unclear. We used high resolution HI mapping to gain insights into the processes driving the observed properties of a sample of extremely metal poor (XMP) BCDs. We present Very Large Array B- and C-configuration HI mapping of four BCDs. For three of the targeted BCDs we also detect and map the HI in their nearby companions. In these three cases there is HI evidence for a recent flyby interaction between the BCD and a nearby companion. The HI evidence for recent interactions for these three BCDs is corroborated by our analysis of the tidal forces exerted on the BCDs by companions with available spectroscopic redshifts. For J0204-1009 we had sufficient spatial resolution to determine that it is dark matter dominated and estimate its DM halo mass to be in the range 1.2 x 10^11 to 5.2 x 10^11 solar masses. It is the most isolated BCD in our small sample, J0301-0052, which shows one of the most asymmetric HI morphologies. J0301-0052 has a similar cometary HI morphology to the BCD's optical morphology, although the HI column density maximum is projected at the end of the of the optical tail. Our HI observations suggest J0301-0052 may be undergoing a merger, while the other BCDs show evidence of a recent tidal interaction with a near neighbour. While our selection criteria favoured BCDs with companions our results are consistent with the earlier finding by other authors that most BCDs are associated with either mild tidal interactions or mergers.\n\n", "2410.21174": "2024-10-28, **$\\texttt{StreamSculptor}$: Hamiltonian Perturbation Theory for Stellar Streams in Flexible Potentials with Differentiable Simulations**, Jacob Nibauer et.al., [2410.21174v1](http://arxiv.org/abs/2410.21174v1)\n\n Stellar streams retain a memory of their gravitational interactions with small-scale perturbations. While perturbative models for streams have been formulated in action-angle coordinates, a direct transformation to these coordinates is only available for static and typically axisymmetric models for the galaxy. The real Milky Way potential is in a state of disequilibrium, complicating the application of perturbative methods around an equilibrium system. Here, we utilize a combination of differentiable simulations and Hamiltonian perturbation theory to model the leading-order effect of dark matter subhalos on stream observables. To obtain a perturbative description of streams, we develop a direct and efficient forward mode differentiation of Hamilton's equations of motion. Our model operates in observable coordinates, allowing us to treat the effects of arbitrary subhalo potentials on streams perturbatively, while simultaneously capturing non-linear effects due to other substructures like the infalling LMC or the rotating bar. The model predicts the velocity dispersion of streams as a function of subhalo statistics, allowing us to constrain the low-mass range of subhalos down to $\\sim 10^5~M\\_\\odot$. We forecast the velocity dispersion of the GD-1 stream, and find that observations are in agreement with a CDM subhalo population, with a slight preference for more dense subhalos. The method provides a new approach to characterize streams in the presence of substructure, with significantly more modeling flexibility compared to previous works.\n\n", "2410.21089": "2024-10-28, **New constraints on singlet scalar dark matter model with LZ, invisible Higgs decay and gamma-ray line observations**, Yang Yu et.al., [2410.21089v1](http://arxiv.org/abs/2410.21089v1)\n\n The singlet scalar dark matter (DM) model is a minimal extension of the Standard Model (SM). This model features only two free parameters: the singlet scalar mass $m\\_S$ and the quartic coupling $a\\_2$ between the singlet scalar and the SM Higgs doublet. Previous studies have suggested that only the resonant region remains viable under combined constraints. In this work, we revisit and refine the constraints using data from the direct detection experiment LZ, invisible Higgs decay measurements, and gamma-ray line observations conducted by Fermi-LAT and DAMPE. Our findings indicate that the latest results from LZ have significantly strengthened the constraints on the model parameters. We demonstrate that only a narrow parameter region remains viable, specifically $60.5\\,\\text{GeV}< m\\_S < 62.5\\,\\text{GeV}$ and $1.7\\times10^{-4}<a\\_2< 4.7\\times10^{-4}$. This suggests that a three-fold improvement in the current LZ results would thoroughly examine the parameter space below $1\\,\\rm{TeV}$ for the singlet scalar DM model.\n\n", "2410.20937": "2024-10-28, **Analysis of the S1 triplet component in the DarkSide-50 experiment**, Clea Sunny et.al., [2410.20937v1](http://arxiv.org/abs/2410.20937v1)\n\n The DarkSide-50 (DS-50) experiment aims at the direct detection of weakly interacting massive particles. It is a dual-phase liquid argon time projection chamber (LAr TPC) where Dark Matter (DM), which constitutes five sixths of all matter in the universe, is expected to interact with an argon nucleus resulting in a nuclear recoil. A scintillation signal (S1) is produced as a result of the ionising events from the DM-Ar interaction. The impurities in LAr, such as $\\text{O}\\_2, \\text{N}\\_2, \\text{H}\\_2\\text{O}$, etc., at the ppm level, quench the scintillation photons, leading to a reduction in the observed lifetime of the triplet state. In this contribution, the effect of impurities on the triplet lifetime is analyzed for individual events using DS-50 data, with a primary focus on nitrogen, one of the candidates for the impurities in LAr hypothesized to cause a suppression of triplet lifetime. This is done by determining the lifetime of the triplet component with a known purity, which can be used as a reference for the purity level of argon used in current and future dark matter searches.\n\n", "2410.20923": "2024-10-28, **Effects of dark boson mediated feeble interaction between dark matter (DM) and quark matter on $f$-mode oscillation of DM admixed quark stars**, O. P. Jyothilakshmi et.al., [2410.20923v1](http://arxiv.org/abs/2410.20923v1)\n\n We investigate the behaviour of the prominent non-radial fundamental $f$-mode oscillations of dark matter (DM) admixed strange quark stars (DMSQSs), by adopting an equation of state (EoS) developed in Ref.~\\cite{Sen:2022pfr}, which considers the possible presence of feebly interacting DM in strange quark stars (SQSs) for the first time. Within the model, feeble interaction between fermionic DM $\\chi$ and strange quark matter (SQM) is invoked via a vector new physics mediator $\\xi$ with coupling strength $y\\_{\\xi}$. The pure SQM is described by the vector MIT Bag model. By varying different EoS parameters, the structural properties viz. the mass, radius and tidal deformability ($\\Lambda$) of the DMSQSs are studied with respect to various astrophysical constraints. We study in detail the $f$-mode spectra within the Cowling approximation by obtaining the frequencies as a function of mass, compactness and $\\Lambda$ of the star. To the best of our knowledge, this study represents the first analysis of non-radial $f$-mode oscillations of DMSQSs. Our investigation indicates that the presence of DM and its interaction with SQM has great impact on the $f$-modes. We show that the $f$-mode frequencies are larger for DMSQSs, which are largely populated with massive DM fermions, compared to the SQSs. Further, we obtain a linear empirical relation between the $f$-modes and the average density of the star. We also find that the mass-scaled angular frequency varies universally with compactness for DMSQSs.\n\n", "2410.20736": "2024-10-28, **Non-minimal coupling of scalar fields in the dark sector and generalization of the top-hat collapse**, Priyanka Saha et.al., [2410.20736v1](http://arxiv.org/abs/2410.20736v1)\n\n In this article, we propose a new way to handle interactions between two scalar fields in the cosmological backdrop where one scalar field oscillates rapidly in the cosmological time scale while the other does not show any periodic behavior in the same time scale. We have interpreted the rapidly oscillating scalar field as the dark matter candidate while the other scalar field is supposed to be the canonical quintessence field or the non-canonical phantom field. A model of a generalized top-hat-like collapse is developed where the dark sector is composed of the aforementioned scalar fields. We show how the non-minimal coupling in the dark sector affects the gravitational collapse of a slightly overdense spherical patch of the universe. The results show that one can have both unclustered and clustered dark energy in such collapses, the result depends upon the magnitude of the non-minimal coupling strength.\n\n", "2410.20701": "2024-10-28, **Detection Rate of Galaxy Cluster Lensed Stellar Binary Black Hole Mergers by the Third-generation Gravitational Wave Detectors**, Zhiwei Chen et.al., [2410.20701v1](http://arxiv.org/abs/2410.20701v1)\n\n Gravitational waves (GWs) from stellar binary black hole (sBBH) mergers can be strongly gravitational lensed by intervening galaxies/galaxy clusters. Only a few works investigated the cluster-lensed sBBH mergers by adopting oversimplified models, while galaxy-lensed ones were intensively studied. In this paper, we estimate the detection rate of cluuster-lensed sBBH mergers with the third-generation GW detectors and its dependence on the lens models. We adopt detailed modeling of galaxy cluster lenses by using the mock clusters in the Synthetic Sky Catalog for Dark Energy Science with LSST (CosmoDC2) and/or approximations of the pseudo-Jaffe profile or an eccentric Navarro-Frenk-White dark matter halo plus a bright central galaxy with singular isothermal sphere profile. Considering the formation of sBBH mergers dominates by the channel of evolution of massive binary stars (EMBS), we find that the detection rate of cluster-lensed sBBHs is $\\sim5-84$ yr$^{-1}$, depending on the adopted lens model and uncertainty in the merger rate density, and it is about $\\sim{13\\_{-2.0}^{+28}}$yr$^{-1}$ if adopting relatively more realistic galaxy clusters with central main and member galaxies in the CosmoDC2 catalog, close to the estimated detection rate of sBBH mergers lensed by galaxies. In addition, we also consider the case that the production of sBBH mergers dominated by the dynamical interactions in dense stellar systems. We find that the detection rate of cluster-lensed sBBHs if from the dynamical channel is about $1.5$ times larger than that from the EMBS channel and the redshift distribution of former peaking at a higher redshift ($\\sim3$) compared with that from latter ($\\sim2$).\n\n", "2410.20645": "2024-10-28, **Direct detection of Higgs portal for light self-interacting dark matter**, Wu-Long Xu et.al., [2410.20645v1](http://arxiv.org/abs/2410.20645v1)\n\n Self-interacting dark matter (SIDM) can address the small-scale anomalies and previous researches focused on such a SIDM heavier than GeV, for which the self-scattering cross-section is in the quantum resonance region and has a non-trivial velocity dependence. For a SIDM lighter than GeV, the self-scattering cross-section falls within the Born region. In this work, considering the constraints from CMB, BBN and the DM relic density, we investigate the direct detection of the Higgs portal for a sub-GeV SIDM with a scalar mediator. For this end, we consider two approaches : one is the cosmic-ray accelerated dark matter (CRDM) scattering off the nucleon, the other is the electron recoil caused by the halo dark matter. We present direct detection limits for the parameter space of light SIDM and scalar mediator. We find that the detectability in either approach needs a sizable mediator-Higgs mixing angle ($\\sin\\theta$) which is larger than one for the CRDM approach and larger than $10^{-3}$ for the electron recoil approach. While the former case cannot be realized in the Higgs-portal light SIDM model with a scalar mediator, the latter case may also be constrained by some astrophysical observations or beam dump experiment. Anyway, even if other constraints are quite stringent, the direct detection may provide independent limits for such a sub-GeV SIDM.\n\n", "2410.20588": "2024-10-27, **Galaxy catalogs from the SAGE Semi-Analytic Model calibrated on THE THREE HUNDRED hydrodynamical simulations: A method to push the limits toward lower mass galaxies in dark matter only clusters simulations**, Jonathan S. Gómez et.al., [2410.20588v1](http://arxiv.org/abs/2410.20588v1)\n\n The new generation of upcoming deep photometric and spectroscopic surveys will allow us to measure the astrophysical properties of faint galaxies in massive clusters. This would demand to produce simulations of galaxy clusters with better mass resolution than the ones available today if we want to make comparisons between the upcoming observations and predictions of cosmological models. But producing full-physics hydrodynamical simulations of the most massive clusters is not an easy task. This would involve billions of computational elements to reliably resolve low mass galaxies similar to those measured in observations. On the other hand, dark matter only simulations of cluster size halos can be done with much larger mass resolution but at the cost of having to apply a model that populate galaxies within each of the subhalos in these simulations. In this paper we present the results of a new set of dark matter only simulations with different mass resolutions within the THE THREE HUNDRED project. We have generated catalogs of galaxies with stellar and luminosity properties by applying the SAGE Semi-Analytical Model of galaxy formation. To obtain the catalogs consistent with the results from hydrodynamical simulations, the internal physical parameters of SAGE were calibrated with the Particle Swarm Optimization method using a subset of full-physics runs with the same mass resolution than the dark matter only ones.\n\n", "2410.20323": "2024-10-27, **Probing charged lepton flavor violation in an economical muon on-target experiment**, Leyun Gao et.al., [2410.20323v1](http://arxiv.org/abs/2410.20323v1)\n\n This work proposes a new yet economical experiment to probe the charged lepton flavor violation (CLFV) process mediated by an extra massive neutron gauge boson $Z^\\prime$ beyond the standard model, by extending a recently proposed muon dark matter project in the Peking University Muon (PKMuon) Experiment. The devices used originally for light mass dark matter direct detection are easily adaptable to search for the $\\mu^+e^- \\to \\mu^+\\mu^-$ CLFV process leveraging the large-area, high-precision muon tracking and tomography system sandwiching a fixed target the incoming muons scatter off. The $\\mu^+\\mu^-$ final state signal studied in this work can be uniquely sensitive to specific CLFV parameter combinations, such as the couplings between $Z^\\prime$, electron and muon, or $Z^\\prime$ and two muons. Prospected results are obtained through detailed detector simulation for the proposal interfacing with a muon beam with energy at tens of $\\mathrm{GeV}$ and a flux of $10^6\\ \\mathrm{s^{-1}}$. Based mainly on angular information of the incoming and outgoing particles, the expected upper limit at 95\\% confidence level on the coupling coefficients $\\lambda\\_{e\\mu}\\lambda\\_{\\mu\\mu}$ is able to reach $10^{-5}$ with, for example, $Z^\\prime$ mass $0.25\\ \\mathrm{GeV}$, for a one year's run.\n\n"}, "supernova": {"2410.21255": "2024-10-28, **Semi-confined supernova feedback in HII region bubbles**, Cheryl S. C. Lau et.al., [2410.21255v1](http://arxiv.org/abs/2410.21255v1)\n\n Galactic-scale simulations rely on sub-grid models to provide prescriptions for the coupling between supernova (SN) feedback and the interstellar medium (ISM). Many of these models are computed in 1-D to allow for an efficient way to account for the variability of properties of their local environment. However, small-scale simulations revealed that the release of energy from SNe within molecular clouds can be highly asymmetrical. This is largely due to the presence of pre-SN feedback, such as ionizing radiation, that are able to carve cavities and channels around the progenitors prior to their detonation. Being partially confined, the SN energy escapes into the outer ISM preferentially through these channels, departing from the spherically symmetric 1-D descriptions. To understand by how much the feedback output could differ, we present a theoretical model for a semi-confined SN. The problem concerns a SN expanding into an evolved HII region, bounded by a molecular cloud with pre-existing vents. With the aid of simple 3-D hydrodynamical simulations, we show that this mode of energy release increases the dynamical impact of the outflows, and extends the timescales over which the SN is energetically coupled to the surrounding matter. We also show that the amount of small-scale solenoidal turbulence driven by semi-confined SNe may be amplified.\n\n", "2410.21243": "2024-10-28, **Cosmological tests of quintessence in quantum gravity**, Sukannya Bhattacharya et.al., [2410.21243v1](http://arxiv.org/abs/2410.21243v1)\n\n We use a suite of the most recent cosmological observations to test models of dynamical dark energy motivated by quantum gravity. Specifically, we focus on hilltop quintessence scenarios, able to satisfy theoretical constraints from quantum gravity. We discuss their realisation based on axions, their supersymmetric partners, and Higgs-like string constructions. We also examine a specific parameterisation for dynamical dark energy suitable for hilltop quintessence. We then perform an analysis based on Markov Chain Monte-Carlo to assess their predictions against CMB, galaxy surveys, and supernova data. We show to what extent current data can distinguish amongst different hilltop set-ups, providing model parameter constraints that are complementary to and synergetic with theoretical bounds from quantum gravity conjectures, as well as model comparisons across the main dark energy candidates in the literature. However, all these constraints are sensitive to priors based on theoretical assumptions about viable regions of parameter space. Consequently, we discuss theoretical challenges in refining these priors, with the aim of maximizing the informative power of current and forthcoming cosmological datasets for testing dark energy scenarios in quantum gravity.\n\n", "2410.21199": "2024-10-28, **Cherenkov Telescope Array Observatory sensitivity to heavy Galactic Cosmic Rays and the shape of particle spectrum**, Coline Dubos et.al., [2410.21199v1](http://arxiv.org/abs/2410.21199v1)\n\n The origin of Galactic Cosmic Rays (GCRs) and the potential role of Supernova Remnants (SNRs) as cosmic-ray (CR) accelerators remain subjects of ongoing debate. To shed more light on this topic, we have studied the spectral shape of two SNRs, RX J1713.7-3946 and HAWC J2227+610, performing simulations for the Cherenkov Telescope Array Observatory (CTAO). The previous multi-wavelength (MWL) analysis on these two sources showed an important hadronic contribution at high energies. The interaction of the GCRs accelerated by the SNRs with the medium around the accelerator leads to a process of pion decay (PD) that produces gamma-rays ($\\gamma$-rays). These emissions, detectable by CTAO, offer an indirect means of pinpointing the CR source. Two scenarios have been considered: the contribution of heavy CRs and different cut-off sharpnesses ($\\beta$) of the particle spectra. The simulations were performed by using different CR composition distributions (protons, CNO, Fe) and different sharpness values ranging from $\\beta$=0.5 to $\\beta$=1.5. The results show that, in the cases studied here, CTAO will increase the sensitivity to the spectral shape of $\\gamma$-rays. This allows us to distinguish protons from heavy CRs and obtain information on $\\beta$ values and therefore on different acceleration scenarios.\n\n", "2410.21077": "2024-10-28, **Superluminous supernova search with PineForest**, T. Majumder et.al., [2410.21077v1](http://arxiv.org/abs/2410.21077v1)\n\n The advent of large astronomical surveys has made available large and complex data sets. However, the process of discovery and interpretation of each potentially new astronomical source is, many times, still handcrafted. In this context, machine learning algorithms have emerged as a powerful tool to mine large data sets and lower the burden on the domain expert. Active learning strategies are specially good in this task. In this report, we used the PineForest algorithm to search for superluminous supernova (SLSN) candidates in the Zwicky Transient Facility. We showcase how the use of previously confirmed sources can provide important information to boost the convergence of the active learning algorithm. Starting from a data set of $\\sim$14 million objects, and using 8 previously confirmed SLSN light curves as priors, we scrutinized 120 candidates and found 8 SLSN candidates, 2 of which have not been reported before (AT 2018moa and AT 2018mob). These results demonstrate how existing spectroscopic samples can be used to improve the efficiency of active learning strategies in searching for rare astronomical sources.\n\n", "2410.20829": "2024-10-28, **Synthetic Light Curves and Spectra for the Photospheric Phase of a 3D Stripped-Envelope Supernova Explosion Model**, Thomas Maunder et.al., [2410.20829v1](http://arxiv.org/abs/2410.20829v1)\n\n We present synthetic light curves and spectra from three-dimensional (3D) Monte Carlo radiative transfer simulations based on a 3D core-collapse supernova explosion model of an ultra-stripped $3.5\\,\\mathrm{M}\\_{\\odot}$ progenitor. Our calculations predict a fast and faint transient with $\\Delta m\\_{15} \\sim 1\\texttt{-} 2\\,\\mathrm{mag}$ and peak bolometric luminosity between $-15.3\\,\\mathrm{mag}$ and $-16.4\\,\\mathrm{mag}$. Due to a large-scale unipolar asymmetry in the distribution of $^{56}\\mathrm{Ni}$, there is a pronounced viewing-angle dependence with about $1\\,\\mathrm{mag}$ difference between the directions of highest and lowest luminosity. The predicted spectra for this rare class of explosions do not yet match any observed counterpart. They are dominated by prominent Mg~II lines, but features from O, C, Si, and Ca are also found. In particular, the O~I line at \\wl{7}{774} appears as a blended feature together with Mg~II emission. Our model is not only faster and fainter than the observed Ib/c supernova population, but also shows a correlation between higher peak luminosity and larger $\\Delta m\\_{15}$ that is not present in observational samples. A possible explanation is that the unusually small ejecta mass of our model accentuates the viewing-angle dependence of the photometry. We suggest that the viewing-angle dependence of the photometry may be used to constrain asymmetries in explosion models of more typical stripped-envelope supernova progenitors in future.\n\n", "2410.20582": "2024-10-27, **Evidence for a shock-compressed magnetic field in the northwestern rim of Vela Jr. from X-ray polarimetry**, Dmitry A. Prokhorov et.al., [2410.20582v1](http://arxiv.org/abs/2410.20582v1)\n\n Synchrotron X-ray emission has been detected from nearly a dozen young supernova remnants (SNRs). X-rays of synchrotron origin exhibit linear polarization in a regular, non-randomly oriented magnetic field. The significant polarized X-ray emission from four such SNRs has already been reported on the basis of observations with the Imaging X-ray Polarimetry Explorer (IXPE). The magnetic-field structure as derived from IXPE observations is radial for Cassiopeia A, Tycho's SNR, and SN 1006, and tangential for RX J1713.7-3946. The latter together with the recent detection of a tangential magnetic field in SNR 1E 0102.2-7219 by the Australia Telescope Compact Array in the radio band shows that tangential magnetic fields can also be present in young SNRs. Thus, the dichotomy in polarization between young and middle-aged SNRs (radial magnetic fields in young SNRs, but tangential magnetic fields in middle-aged SNRs), previously noticed in the radio band, deserves additional attention. The present analysis of IXPE observations determines, for the first time, a magnetic-field structure in the northwestern rim of Vela Jr, also known as RX J0852.0-4622, and provides a new example of a young SNR with a tangential magnetic field.\n\n", "2410.20530": "2024-10-27, **On the Origin of the High Star-Formation Efficiency in Massive Galaxies at Cosmic Dawn**, Zachary Lee Andalman et.al., [2410.20530v1](http://arxiv.org/abs/2410.20530v1)\n\n Motivated by the early excess of bright galaxies seen by \\textit{JWST}, we run zoom-in cosmological simulations of a massive galaxy at Cosmic Dawn (MDG), in a halo of $10^{11} M\\_\\odot$ at $z = 9$, using the hydro-gravitational code RAMSES at an effective resolution $\\sim 10~{\\rm pc}$. We investigate physical mechanisms that enhance the star-formation efficiencies (SFEs) under the unique conditions of high gas density ($\\sim 3\\times 10^3~{\\rm cm^{-3}}$, $\\sim 10^4~M\\_\\odot/{\\rm pc^2}$). Our fiducial star formation recipe uses a physically-motivated, turbulence-based, multi-freefall model, avoiding ad-hoc extrapolation from lower redshifts. By $z = 9$, our simulated galaxy is a clumpy, thick, rotating disc with a high stellar mass of a few $10^9~M\\_\\odot$ and high star formation rate of $\\sim 100~M\\_\\odot/{\\rm yr}$. The high gas density makes supernova (SN) feedback less effective at suppressing star formation, producing a relatively high local SFE $\\gtrsim 10\\%$. The global SFE is dominated by feedback-driven outflows and is only weakly correlated with the local SFE. Photoionization heating can enhance the effects of SN feedback on the local SFE by making more SNe explode in diffuse environments, but the global SFE remains high even in our simulations with the strongest feedback. Intense accretion at Cosmic Dawn seeds strong turbulence, which reduces the local SFE for the same gas conditions due to turbulent pressure support. This prevents star-forming clouds from catastrophically collapsing, but this only weakly affects the global SFE. The star formation histories of our simulated galaxies are in the ballpark of the MDGs seen by \\textit{JWST}, despite our limited resolution. They set the stage for future simulations which treat radiation self-consistently and use a higher effective resolution $\\sim 1~{\\rm pc}$ which captures the physics of star-forming clouds.\n\n", "2410.20486": "2024-10-27, **Probing red-supergiant atmospheres and winds with early-time high-cadence high-resolution type II supernova spectra**, Luc Dessart et.al., [2410.20486v1](http://arxiv.org/abs/2410.20486v1)\n\n High-cadence high-resolution spectroscopic observations of infant Type II supernovae (SNe) represent an exquisite probe of the atmospheres and winds of exploding red-supergiant (RSG) stars. Using radiation hydrodynamics and radiative transfer, we study the gas and radiation properties during and after the phase of shock breakout, considering RSG progenitors enshrouded within a circumstellar material (CSM) that varies in extent, density, and velocity profile. In all cases, the original, unadulterated CSM structure is probed only at the onset of shock breakout, visible in high-resolution spectra as narrow, often blueshifted emission, possibly with an absorption trough. As the SN luminosity rises during breakout, radiative acceleration of the unshocked CSM starts, leading to a broadening of the ``narrow'' lines by ~100 and up to ~1000km/s, depending on CSM properties. This acceleration is maximum close to the shock, where the radiative flux is greater, and thus typically masked by optical-depth effects. Generally, narrow-line broadening is greater for more compact, tenuous CSM because of the proximity to the shock where the flux is born, and smaller in denser and more extended CSM. Narrow-line emission should show a broadening that slowly increases first (the line forms further out in the original wind), then sharply rises (the line forms in a region that is radiatively accelerated), before decreasing until late times (the line forms further away in regions more weakly accelerated). Radiative acceleration should inhibit X-ray emission during the early, IIn phase. Although high spectral resolution is critical at the earliest times to probe the original slow wind, radiative acceleration and associated line broadening may be captured with medium resolution allowing a simultaneous view of narrow, Doppler-broadened as well as extended, electron-scattering broadened line emission.\n\n", "2410.20415": "2024-10-27, **Mass-gap Black Holes in Coalescing Neutron Star Black Hole Binaries**, Zepei Xing et.al., [2410.20415v1](http://arxiv.org/abs/2410.20415v1)\n\n The existence of a mass gap of $3-5\\,M\\_{\\odot}$ between the heaviest neutron stars (NSs) and the lightest black holes (BHs), inferred from the BH mass distribution in low mass X-ray binaries (LMXBs), has been suggested for decades. The recently reported gravitational-wave source GW230529 has been confidently identified as a NSBH merger, with the BH mass falling within this lower mass gap. This detection provides strong evidence against the existence of the latter and introduces new implications for the coalescing NSBH population, including a revised BH mass distribution and an updated local merger rate. In this study, we employ POSYDON, a binary population synthesis code that integrates detailed single- and binary-star models, to investigate coalescing NSBH binaries formed through isolated binary evolution. In particular, we focus on the BH mass distribution of the intrinsic NSBH merger population. We find that, with a high common-envelope efficiency of $\\alpha\\_{\\rm{CE}} =2 $, the BH masses in NSBH mergers concentrate in the lower mass gap, aligning more closely with observations. However, after accounting for the constraints of the selection bias against mass-gap BHs in LMXBs, which suggests that the maximum NS birth mass is below $\\simeq 2\\,M\\_{\\odot}$, we find that introducing a high $\\alpha\\_{\\rm{CE}}$ is not required to match observations. Additionally, we explore the impact of core-collapse supernova kicks. Finally, we present the property distributions of observable NSBH mergers from our simulation and find that they match well with the observations. We find that the fraction of electromagnetic counterparts in observable populations is $\\approx 4-30\\%$, depending on different NS equations of state. Future detections of coalescing NSBH binaries would provide invaluable insights into SN mechanisms, common envelope evolution, and NS physics.\n\n"}}