{"neutrino": {"2304.09553": "2023-04-19, **Search for heavy Majorana or Dirac neutrinos and right-handed $W$ gauge bosons in final states with charged leptons and jets in $pp$ collisions at $\\sqrt{s}=13$ TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2304.09553v1](http://arxiv.org/abs/2304.09553v1)\n\n A search for heavy right-handed Majorana or Dirac neutrinos $N\\_{\\mathrm{R}}$ and heavy right-handed gauge bosons $W\\_{\\mathrm{R}}$ is performed in events with energetic electrons or muons, with the same or opposite electric charge, and energetic jets. The search is carried out separately for topologies of clearly separated final-state products (``resolved'' channel) and topologies with boosted final states with hadronic products partially overlapping and reconstructed as a large-radius jet (``boosted'' channel). The events are selected from $pp$ collision data at the LHC with an integrated luminosity of 139 fb$^{-1}$ collected by the ATLAS detector at $\\sqrt{s}$ = 13 TeV. No significant deviations from the Standard Model predictions are observed. The results are interpreted within the theoretical framework of a left-right symmetric model, and lower limits are set on masses in the heavy right-handed $W\\_{\\mathrm{R}}$ boson and $N\\_{\\mathrm{R}}$ plane. The excluded region extends to about $m(W\\_{\\mathrm{R}}) = 6.4$ TeV for both Majorana and Dirac $N\\_{\\mathrm{R}}$ neutrinos at $m(N\\_{\\mathrm{R}})<1$ TeV. $N\\_{\\mathrm{R}}$ with masses of less than 3.5 (3.6) TeV are excluded in the electron (muon) channel at $m(W\\_{\\mathrm{R}})=4.8$ TeV for the Majorana neutrinos, and limits of $m(N\\_{\\mathrm{R}})$ up to 3.6 TeV for $m(W\\_{\\mathrm{R}}) = 5.2$ ($5.0$) TeV in the electron (muon) channel are set for the Dirac neutrinos.\n\n", "2304.09241": "2023-04-18, **Coulomb Corrections for Coherent Neutrino Nucleus Scattering**, Ryan Plestid et.al., [2304.09241v1](http://arxiv.org/abs/2304.09241v1)\n\n In this work we consider sub-leading $O(Z^2\\alpha^3)$ corrections to coherent elastic neutrino nucleus scattering (CEvNS). These corrections are not negligible by power counting since nuclei with large coherent cross sections have sizeable nuclear charges e.g.\\ $Z\\alpha \\sim 0.4$. We find that the corrections are much smaller than naive power counting in $Z\\alpha$ would suggest and that Coulomb corrections do not substantially alter predictions for CEvNS in the Standard Model. We comment on similarities to older literature on mesonic and muonic atoms.\n\n", "2304.09168": "2023-04-18, **A practical guide to a moment approach for neutrino transport in numerical relativity**, Carlo Musolino et.al., [2304.09168v1](http://arxiv.org/abs/2304.09168v1)\n\n The development of a neutrino moment based radiative-transfer code to simulate binary neutron-star mergers can easily become an obstacle path because of the numerous ways in which the solution of the equations may fail. We describe the implementation of the grey M1 scheme in our fully general-relativistic magnetohydrodynamics code and detail those choices and strategies that could lead either to a robust scheme or to a series of failures. In addition, we present new tests designed to show the consistency and accuracy of our code in conditions that are similar to realistic merging conditions and introduce a new, publicly available, benchmark based on the head-on collision of two neutron stars. This test, which is computationally less expensive than a complete merging binary but has all the potential pitfalls of the full scenario, can be used to compare future implementations of M1 schemes with the one presented here.\n\n"}, "dark matter": {"2304.09810": "2023-04-19, **Warm dark Matter constraints from the joint analysis of CMB, Lyman-α, and global 21 cm data**, Atrideb Chatterjee et.al., [2304.09810v1](http://arxiv.org/abs/2304.09810v1)\n\n With the help of our previously built MCMC-based parameter estimation package \\texttt{CosmoReionMC}, we investigate in detail the potential of 21~cm global signal, when combined with CMB and observations related to the QSO absorption spectra, to constraint the mass of Warm Dark Matter (WDM) particle. For the first time, we simultaneously vary all the free parameters (mass of WDM particle, cosmological parameters, and astrophysical parameters) to address the long-overlooked issue of the possible degeneracies between the Dark Matter particle mass $m\\_X$ and cosmological/astrophysical parameters. From the existing CMB and QSO absorption spectra data, we can rule out $m\\_X < 2.8$~keV at 95\\% confidence level. Including the mock 21~cm global signal data expected in the future, the forecasted constraint is found to be much tighter $m\\_X > 7.7$~keV, assuming that the true dark matter model is the usual cold dark matter. In case the mock 21~cm signal is constructed for dark matter particles having $m\\_X = 7$~keV, our forecasts indicate that $\\left(m\\_X / \\text{keV}\\right)^{-1}$ is in the range $[0.1, 0.2]$ ($95\\%$ confidence level). This implies that the future 21~cm data should allow detection of the WDM particle mass if $m\\_X \\sim 7$~keV\n\n", "2304.09671": "2023-04-19, **Modified General Relativity and dark matter**, Gary Nash et.al., [2304.09671v1](http://arxiv.org/abs/2304.09671v1)\n\n Modified General Relativity (MGR) is the natural extension of General Relativity (GR). MGR explicitly uses the smooth regular line element vector field $(\\bm{X},-\\bm{X}) $, which exists in all Lorentzian spacetimes, to construct a connection-independent symmetric tensor that represents the energy-momentum of the gravitational field. It solves the problem of the non-localization of gravitational energy-momentum in GR, preserves the ontology of the Einstein equation, and maintains the equivalence principle. The line element field provides MGR with the extra freedom required to describe dark energy and dark matter. An extended Schwarzschild solution for the matter-free Einstein equation of MGR is developed, from which the Tully-Fisher relation is derived, and the gravitational energy density is calculated. The mass of the invisible matter halo of galaxy NGC 3198 calculated with MGR is identical to the result obtained from GR using a dark matter profile. Although dark matter in MGR is described geometrically, it has an equivalent representation as a particle with the property of a vector boson or a pair of fermions; the geometry of spacetime and the quantum nature of matter are linked together by the unit line element covectors that belong to both the Lorentzian metric and the spin-1 Klein-Gordon wave equation. The three classic tests of GR provide a comparison of the theories in the solar system and several parts of the cosmos. MGR provides the flexibility to describe inflation after the Big Bang and galactic anisotropies.\n\n", "2304.09614": "2023-04-19, **Confronting strange stars with compact-star observations and new physics**, Shu-Hua Yang et.al., [2304.09614v1](http://arxiv.org/abs/2304.09614v1)\n\n Strange stars ought to exist in the universe according to the strange quark matter hypothesis, which states that matter made of roughly equal numbers of up, down, and strange quarks could be the true ground state of baryonic matter rather than ordinary atomic nuclei. Theoretical models of strange quark matter, such as the standard MIT bag model, the density-dependent quark mass model, or the quasi-particle model, however, appear to be unable to reproduce some of the properties (masses, radii and tidal deformabilities) of recently observed compact stars. This is different if alternative gravity theory (e.g., non-Newtonian gravity) or dark matter (e.g., mirror dark matter) are considered, which resolve these issues. The possible existence of strange stars could thus provide a clue to new physics, as discussed in this review.\n\n", "2304.09541": "2023-04-19, **Universality of Bose-Einstein Condensation and Quenched Formation Dynamics**, Nick P. Proukakis et.al., [2304.09541v1](http://arxiv.org/abs/2304.09541v1)\n\n The emergence of macroscopic coherence in a many-body quantum system is a ubiquitous phenomenon across different physical systems and scales. This Chapter reviews key concepts characterizing such systems (correlation functions, condensation, quasi-condensation) and applies them to the study of emerging non-equilibrium features in the dynamical path towards such a highly-coherent state: particular emphasis is placed on emerging universal features in the dynamics of conservative and open quantum systems, their equilibrium or non-equilibrium nature, and the extent that these can be observed in current experiments with quantum gases. Characteristic examples include symmetry-breaking in the Kibble-Zurek mechanism, coarsening and phase-ordering kinetics, and universal spatiotemporal scalings around non-thermal fixed points and in the context of the Kardar- Parisi-Zhang equation; the Chapter concludes with a brief review of the potential relevance of some of these concepts in modelling the large-scale distribution of dark matter in the universe.\n\n", "2304.09363": "2023-04-19, **Characteristic modes of thick brane model: resonances and quasinormal modes**, Qin Tan et.al., [2304.09363v1](http://arxiv.org/abs/2304.09363v1)\n\n In this work, we investigate the gravitational quasinormal modes (QNMs) and the gravitational resonances of a thick brane model. We use the asymptotic iteration and shooting methods to obtain the quasinormal frequencies (QNFs) of the brane. On the other hand, we investigate the resonances and their evolution numerically. The results show that the oscillations of the resonances equal (up to numerical error) to the real parts of the QNFs, while the damping rates of the resonances equal to the imaginary parts of the QNFs. The QNMs and resonances, both of them can be regarded as the characteristic modes of the thick brane, are closely related with each other. In addition, the lifetimes of the QNMs might reach the age of our universe. Such a long-lived Kaluza-Klein modes could be a candidate for dark matter.\n\n", "2304.09198": "2023-04-18, **Model-agnostic cosmological constraints from the baryon acoustic oscillation feature in redshift space**, Aseem Paranjape et.al., [2304.09198v1](http://arxiv.org/abs/2304.09198v1)\n\n We develop a framework for self-consistently extracting cosmological information from the clustering of tracers in redshift space, $\\textit{without}$ relying on model-dependent templates to describe the baryon acoustic oscillation (BAO) feature. Our approach uses the recently proposed Laguerre reconstruction technique for the BAO feature and its linear point $r\\_{\\rm LP}$, and substantially extends it to simultaneously model the multipoles $\\ell=0,2,4$ of the anisotropic galaxy 2-point correlation function (2pcf). The approach is `model-agnostic': it assumes that the non-linear growth of structure smears the BAO feature by an approximately Gaussian kernel with a smearing scale $\\sigma\\_{\\rm v}$, but does not assume any fiducial cosmology for describing the shape of the feature itself. Using mock observations for two realistic survey configurations assuming $\\Lambda$ cold dark matter ($\\Lambda$CDM), combined with Bayesian parameter inference, we show that the linear point $r\\_{\\rm LP}$ and smearing scale $\\sigma\\_{\\rm v}$ can be accurately recovered by our method in both existing and upcoming surveys. The precision of the recovery of $r\\_{\\rm LP}$ is always better than $1\\%$, while $\\sigma\\_{\\rm v}$ can be recovered with $\\lesssim10\\%$ uncertainty provided the linear galaxy bias $b$ is separately constrained, e.g., using weak lensing observations. Our method is also sensitive to the linear growth rate $f$, albeit with larger uncertainties and systematic errors, especially for upcoming surveys such as DESI. We discuss how our model can be modified to improve the recovery of $f$, such that the resulting constraints on $\\{f,\\sigma\\_{\\rm v},r\\_{\\rm LP}\\}$ can potentially be used as a test of cosmological models including and beyond $\\Lambda$CDM.\n\n", "2304.09194": "2023-04-18, **The Primordial Black Holes that Disappeared: Connections to Dark Matter and MHz-GHz Gravitational Waves**, Thomas C. Gehrman et.al., [2304.09194v1](http://arxiv.org/abs/2304.09194v1)\n\n In the post-LIGO era, there has been a lot of focus on primordial black holes (PBHs) heavier than $\\sim 10^{15}$g as potential dark matter (DM) candidates. We point out that the branch of the PBH family that disappeared - PBHs lighter than $\\sim 10^9$g that ostensibly Hawking evaporated away in the early Universe - also constitute an interesting frontier for DM physics. Hawking evaporation itself serves as a portal through which such PBHs can illuminate new physics, for example by emitting dark sector particles. Taking a simple DM scalar singlet model as a template, we compute the abundance and mass of PBHs that could have provided, by Hawking evaporation, the correct DM relic density. We consider two classes of such PBHs: those originating from curvature perturbations generated by inflation, and those originating from false vacuum collapse during a first-order phase transition. For PBHs of both origins we compute the gravitational wave (GW) signals emanating from their formation stage: from second-order effects in the case of curvature perturbations, and from sound waves in the case of phase transitions. The GW signals have peak frequencies in the MHz-GHz range typical of such light PBHs. We compute the strength of such GWs compatible with the observed DM relic density, and find that the GW signal morphology can in principle allow one to distinguish between the two PBH formation histories.\n\n", "2304.09035": "2023-04-18, **Evolution of matter and galaxy clustering in cosmological hydrodynamical simulations**, Jaan Einasto et.al., [2304.09035v1](http://arxiv.org/abs/2304.09035v1)\n\n We quantify the evolution of matter and galaxy clustering in cosmological hydrodynamical simulations via correlation and bias functions of matter and galaxies. We use simulations TNG100 and TNG300 with epochs from $z=5$ to $z=0$. We calculate spatial correlation functions of galaxies, $\\xi(r)$, for simulated galaxies and dark matter (DM) particles to characterise the evolving cosmic web. We find that bias parameters decrease during the evolution, confirming earlier results. At low and medium luminosities, bias parameters of galaxies, $b\\_0$, are equal, suggesting that dwarf galaxies reside in the same filamentary web as brighter galaxies. Bias parameters of the lowest luminosity galaxies estimated from CFs are lower relative to CFs of particle density-limited clustered samples of DM. We find that bias parameters $b\\_0$, estimated from CFs of clustered DM, agree with the expected values from the fraction of particles in the clustered population, $b=1/F\\_c$. The cosmic web contains filamentary structures of various densities, and fractions of matter in the clustered and the unclustered populations are both less than unity. Thus the CF amplitude of the clustered matter is always higher than for all matter, i.e. bias parameter must be $b>1$. Differences between CFs of galaxies and clustered DM suggest that these functions describe different properties of the cosmic web.\n\n", "2304.08888": "2023-04-18, **LIGO-VIRGO constraints on dark matter and leptogenesis triggered by a first order phase transition at high scale**, Debasish Borah et.al., [2304.08888v1](http://arxiv.org/abs/2304.08888v1)\n\n We study the possibility of constraining a scenario with high scale first order phase transition (FOPT) responsible for the cogenesis of baryon and dark matter using gravitational wave (GW) (non)-observations. While the FOPT at high scale is responsible for generating baryon asymmetry through leptogenesis and dark matter via the \\textit{mass-gain} mechanism, the resulting GW spectrum falls within the ongoing LIGO-VIRGO experimental sensitivity. The dark matter is preferred to be in the non-thermal ballpark with sub-GeV masses and the criteria of successful dark matter relic rules out a large portion of the parameter space consistent with high scale FOPT and successful leptogenesis. Some part of the parameter space allowed from dark matter and leptogenesis criteria also gives rise to a large signal-to-noise ratio at ongoing experiments and hence can be disfavoured in a conservative way from the non-observation of such stochastic GW background. Future data from ongoing and planned experiments will offer a complementary and indirect probe of the remaining parameter space which is typically outside the reach of any direct experimental probe.\n\n", "2304.08824": "2023-04-18, **A Dark Matter Probe in Accreting Pulsar-Black Hole Binaries**, Ali Akil et.al., [2304.08824v1](http://arxiv.org/abs/2304.08824v1)\n\n The accretion of dark matter (DM) into astrophysical black holes slowly increases their mass. The rate of this mass accretion depends on the DM model and the model parameters. If this mass accretion effect can be measured accurately enough, it is possible to rule out some DM models, and, with the sufficient technology and the help of other DM constraints, possibly confirm one model. We propose a DM probe based on accreting pulsar-black hole binaries, which provide a high-precision measurement on binary orbital phase shifts induced by DM accretion into black holes, and can help rule out DM models and study the nature of DM.\n\n", "2304.08731": "2023-04-18, **The impact of halo concentration on the Sunyaev Zel'dovich effect signal from massive galaxy clusters**, Eric J. Baxter et.al., [2304.08731v1](http://arxiv.org/abs/2304.08731v1)\n\n The Sunyaev Zel'dovich (SZ) effect is sensitive to the pressure of ionized gas inside galaxy clusters. The gas pressure responds to changes in the gravitational potential of the cluster, which is dominated by the host dark matter halo. Changes in halo concentration therefore impact the SZ signal, with implications for cosmological and other analyses of SZ-selected clusters. We investigate the concentration-SZ relation in theory and simulations. We find that the impact of concentration on the inner SZ profile ($R \\lesssim 0.75 R\\_{200c}$) can be captured with standard polytropic gas models. However, we find that such models do a poor job of reproducing the outer SZ profiles ($R \\gtrsim 0.75 R\\_{200c}$) and the relation between the integrated SZ signal, $Y$, and concentration. This disagreement results from a sharp truncation of the gas pressure profile near the splashback radius, likely caused by virial shocks. We develop a simple description of the truncation that leads to a good match with simulated SZ profiles out to several $R\\_{200c}$ for clusters of varying mass and concentration, and that also accurately predicts the concentration-$Y$ relationship. Finally, we determine how inference of the linear bias parameter and splashback radius for SZ-selected clusters can be biased by ignoring the concentration dependence of the SZ signal.\n\n", "2304.08686": "2023-04-18, **Graceful exit from inflation and reheating with twin waterfalls**, Hyun Min Lee et.al., [2304.08686v1](http://arxiv.org/abs/2304.08686v1)\n\n We study the hybrid inflation with a pseudo-Nambu-Goldstone boson inflaton and two waterfall scalar fields. The $Z\\_2$ symmetry for the waterfall fields keeps inflaton potential flat against quantum corrections coming from the waterfall couplings, and it is broken spontaneously in the vacuum without a domain wall problem within the Hubble horizon of our universe. We show that the $Z\\_2$ invariant Higgs portal couplings to the waterfall fields are responsible for the reheating process, leading to a sufficiently large reheating temperature after inflation. In the presence of an extra $Z'\\_2$ symmetry, one of the waterfall fields or another singlet scalar field becomes a dark matter candidate. In particular, we find that preheating is sufficient to account for the correct relic density of the waterfall dark matter.\n\n"}, "supernova": {"2304.09766": "2023-04-19, **On the energy flow of $λ$ in Hořava-Lifshitz cosmology**, Ewa Czuchry et.al., [2304.09766v1](http://arxiv.org/abs/2304.09766v1)\n\n Ho\\v{r}ava-Lifshitz gravity has been proposed as a ghost-free quantum gravity model candidate with an anisotropic UV-scaling between space and time. We present here a cosmological background analysis of two different formulations of the theory, with particular focus on the running of the parameter $\\lambda$. Using a large dataset consisting of Cosmic Microwave Background data from {\\it Planck}, Pantheon+ supernovae catalogue, SH0ES Cepheid variable stars, Baryon acoustic oscillations (BAO), Cosmic Chronometers, and gamma-ray bursts (GRB), we arrive at new bounds on the cosmological parameters, in particular $\\lambda$, which describes deviation from classical general relativity. For the detailed balance scenario we arrive at the bound $\\lambda=1.02726\\pm0.00012$, and for beyond detailed balance the limit reads $\\lambda=0.9949^{+0.0045}\\_{-0.0046}$. We also study the influence of different data sets and priors, and we find that removing low-redshift data generally moves $\\lambda$ closer towards UV values, whilst simultaneously widening the error bars. In the detailed balance scenario, this effect is more noticeable, and $\\lambda$ takes on values that are significantly below unity, which corresponds to the infrared limit of the theory.\n\n", "2304.09508": "2023-04-19, **POLAR -- I: linking the 21-cm signal from the epoch of reionization to galaxy formation**, Qing-Bo Ma et.al., [2304.09508v1](http://arxiv.org/abs/2304.09508v1)\n\n To self-consistently model galactic properties, reionization of the intergalactic medium, and the associated 21-cm signal, we have developed the algorithm polar by integrating the one-dimensional radiative transfer code grizzly with the semi-analytical galaxy formation code L-Galaxies 2020. Our proof-of-concept results are consistent with observations of the star formation rate history, UV luminosity function and the CMB Thomson scattering optical depth. We then investigate how different galaxy formation models affect UV luminosity functions and 21-cm power spectra, and find that while the former are most sensitive to the parameters describing the merger of halos, the latter have a stronger dependence on the supernovae feedback parameters, and both are affected by the escape fraction model.\n\n", "2304.09350": "2023-04-19, **Black holes as the end state of stellar evolution: Theory and simulations**, Alexander Heger et.al., [2304.09350v1](http://arxiv.org/abs/2304.09350v1)\n\n The collapse of massive stars is one of the most-studied paths to black hole formation. In this chapter, we review black hole formation during the collapse of massive stars in the broader context of single and binary stellar evolution and the theory of supernova explosions. We provide a concise overview of the evolutionary channels that may lead to black hole formation -- the classical route of iron core collapse, collapse due to pair instability in very massive stars, and the hypothetical scenario of supermassive star collapse. We then review the current understanding of the parameter space for black hole formation and black hole birth properties that has emerged from theoretical and computational modelling of supernova explosions and transient observations. Finally, we discuss what the intricate interplay between stellar evolution, stellar explosions, and binary interactions implies for the formation of stellar-mass black holes.\n\n", "2304.09749": "2023-04-18, **Some diagnostic analysis of dark energy models with $q(z)$ parametrizations**, Dhruv Arora et.al., [2304.09749v1](http://arxiv.org/abs/2304.09749v1)\n\n The presented paper represents some diagnostic analysis of three dark energy models resulting from the parametrization of the deceleration parameter. All the considered models are interesting as they show intriguing features, such as the late-time acceleration and cosmological phase transition from early deceleration to late acceleration. We use $q(z)$ parametrizations and found the best fitting values of the model parameters by constraining the models with Hubble datasets and Union 2.1 compilation Type Ia supernovae datasets. The evolution of some cosmological parameters is discussed. We aim to discuss the statefinder diagnostic analysis of the considered models and compare it with the $\\Lambda $CDM and SCDM models. Moreover, we have performed the Om diagnostics for the models.\n\n", "2304.09060": "2023-04-18, **Mass measurements and 3D orbital geometry of PSR J1933$-$6211**, M. Geyer et.al., [2304.09060v1](http://arxiv.org/abs/2304.09060v1)\n\n PSR J1933$-$6211 is a 3.5-ms pulsar in a 12.8-d orbit with a white dwarf (WD). Its high proper motion and low dispersion measure result in such significant interstellar scintillation that high signal-to-noise detections require long observing durations or fortuitous timing. We turn to the sensitive MeerKAT telescope and, combined with historic Parkes data, leverage PSR J1933$-$6211's kinematic and relativistic effects to constrain its 3D orbital geometry and the component masses. We obtain precise proper motion and parallax estimates, and measure their effects as secular changes in the Keplerian orbital parameters: a variation in orbital period of $7(1) \\times 10^{-13}$ s s$^{-1}$ and a change in projected semi-major axis of $1.60(5) \\times 10^{-14}$ s s$^{-1}$. A self-consistent analysis of all kinematic and relativistic effects yields a distance of $1.6^{+0.2}\\_{-0.3}$ kpc, an orbital inclination, $i = 55(1)$ deg and a longitude of the ascending node, $\\Omega = 255^{+8}\\_{-14}$ deg. The probability densities for $\\Omega$ and $i$ and their symmetric counterparts, ($180-i$, $360-\\Omega$), are seen to depend on the fiducial orbit used to measure the time of periastron passage. We investigate this unexpected dependence and rule out software-related causes using simulations. Nevertheless, we constrain the pulsar and WD masses to $1.4^{+0.3}\\_{-0.2}$ M$\\_\\odot$ and $0.43(5)$ M$\\_\\odot$ respectively. These strongly disfavour a helium-dominated WD. The orbital similarities between PSRs J1933$-$6211 and J1614$-$2230 suggest they underwent Case A Roche lobe overflow, an extended evolution while the companion star is still on the Main Sequence. However, with a mass of $\\sim 1.4$ M$\\_\\odot$, PSR J1933$-$6211 has not accreted significant matter. This highlights the low accretion efficiency of the spin-up process and suggests that observed neutron star masses are mostly a result of supernova physics.\n\n", "2304.08986": "2023-04-18, **Star formation in the dwarf Seyfert galaxy NGC 4395: Evidence for both AGN and SNe feedback?**, Payel Nandi et.al., [2304.08986v1](http://arxiv.org/abs/2304.08986v1)\n\n We present a detailed multi-wavelength study of star formation in the dwarf galaxy NGC 4395 which hosts an active galactic nucleus (AGN). From our observations with the Ultra-Violet Imaging Telescope, we have compiled a catalogue of 284 star forming (SF) regions, out of which we could detect 120 SF regions in H$\\alpha$ observations. Across the entire galaxy, we found the extinction corrected star formation rate (SFR) in the far ultra-violet (FUV) to range from 2.0 $\\times$ 10$^{-5}$ M$\\_\\odot$yr$^{-1}$ to 1.5 $\\times$ 10$^{-2}$ M$\\_\\odot$yr$^{-1}$ with a median of 3.0 $\\times$ 10$^{-4}$ M$\\_\\odot$yr$^{-1}$ and age to lie in the range of $\\sim$ 1 to 98 Myr with a median of 14 Myr. In H$\\alpha$ we found the SFR to range from 7.2 $\\times$ 10$^{-6}$ M$\\_\\odot$yr$^{-1}$ to 2.7 $\\times$ 10$^{-2}$ M$\\_\\odot$yr$^{-1}$ with a median of 1.7 $\\times$ 10$^{-4}$ M$\\_\\odot$yr$^{-1}$ and age to lie between 3 to 6 Myr with a median of 5 Myr. The stellar ages derived from H$\\alpha$ show a gradual decline with galactocentric distance. We found three SF regions close to the center of NGC~4395 with high SFR both from H$\\alpha$ and UV which could be attributed to feedback effects from the AGN. We also found six other SF regions in one of the spiral arms having higher SFR. These are very close to supernovae remnants which could have enhanced the SFR locally. We obtained a specific SFR (SFR per unit mass) for the whole galaxy 4.64 $\\times$ 10$^{-10}$ yr$^{-1}$.\n\n", "2304.08839": "2023-04-18, **The progenitors of Type Ia supernovae with asymptotic giant branch donors**, Luhan Li et.al., [2304.08839v1](http://arxiv.org/abs/2304.08839v1)\n\n Type Ia supernovae (SNe Ia) are among the most energetic events in the Universe. They are excellent cosmological distance indicators due to the remarkable homogeneity of their light curves. However, the nature of the progenitors of SNe Ia is still not well understood. In the single-degenerate model, a carbon-oxygen white dwarf (CO WD) could grow its mass by accreting material from an asymptotic giant branch (AGB) star, leading to the formation of SNe Ia when the mass of the WD approaches to the Chandrasekhar-mass limit, known as the AGB donor channel. In this channel, previous studies mainly concentrate on the wind-accretion pathway for the mass-increase of the WDs. In the present work, we employed an integrated mass-transfer prescription for the semidetached WD+AGB systems, and evolved a number of WD+AGB systems for the formation of SNe Ia through the Roche-lobe overflow process or the wind-accretion process. We provided the initial and final parameter spaces of WD+AGB systems for producing SNe Ia. We also obtained the density distribution of circumstellar matter at the moment when the WD mass reaches the Chandrasekhar-mass limit. Moreover, we found that the massive WD+AGB sample AT 2019qyl can be covered by the final parameter space for producing SNe Ia, indicating that AT 2019qyl is a strong progenitor candidate of SNe Ia with AGB donors.\n\n", "2304.08827": "2023-04-18, **The evolutionary route to form planetary nebulae with central neutron star - white dwarf binaries**, Iminhaji Ablimit et.al., [2304.08827v1](http://arxiv.org/abs/2304.08827v1)\n\n We present a possible evolutionary pathway to form planetary nebulae (PNe) with close neutron star (NS)-white dwarf (WD) binary central stars. By employing a comprehensive binary population synthesis technique we find that the evolution involves two common envelope evolution (CEE) phases and a core collapse supernova explosion between them that forms the NS. Later the lower mass star engulfs the NS as it becomes a red giant, a process that leads to the second CEE phase and to the ejection of the envelope. This leaves a hot horizontal branch star that evolves to become a helium WD and an expanding nebula. Both the WD and the NS power the nebula. The NS in addition might power a pulsar wind nebula inside the expanding PN. From our simulations we find that the Galactic formation rate of NS-WD PNe is $1.8 \\times 10^{-5} {\\rm yr}^{-1}$ while the Galactic formation rate of all PNe is $0.42 {\\rm yr}^{-1}$. There is a possibility that one of the observed Galactic PNe might be a NS-WD PN, and a few NS-WD PNe might exist in the Galaxy. The central binary systems might be sources for future gravitational wave detectors like LISA, and possibly of electromagnetic telescopes.\n\n", "2304.08776": "2023-04-18, **Hot and highly magnetized neutron star matter properties with Skyrme interactions**, Omar G. Benvenuto et.al., [2304.08776v1](http://arxiv.org/abs/2304.08776v1)\n\n We study the properties of hot and dense neutron star matter under the presence of strong magnetic fields using two Skyrme interactions, namely the LNS and the BSk21 ones. Asking for $\\beta$--stability and charge neutrality, we construct the equation of state of the system and analyze its composition for a range of densities, temperatures and magnetic field intensities of interest for the study of supernova and proto-neutron star matter, with a particular interest on the degree of spin-polarization of the different components. The results show that system configurations with larger fractions of spin up protons and spin down neutrons and electrons are energetically favored over those with larger fractions of spin down protons and spin up neutrons and electrons. The effective mass of neutrons and protons is found to be in general larger for the more abundant of their spin projection component, respectively, spin down neutrons and spin up protons. The effect of the magnetic field on the Helmhotz total free energy density, pressure and isothermal compressibility of the system is almost negligible for all the values of the magnetic field considered.\n\n"}}