{"neutrino": {"2602.02058": "2026-02-02, **Astro-COLIBRI: An Innovative Platform for Real-Time Multi-Messenger Astrophysics**, Bernardo Cornejo Avila et.al., [2602.02058v1](http://arxiv.org/abs/2602.02058v1)\n\n The discovery of transient phenomena, such as supernovae, novae, Fast Radio Bursts (FRBs), Gamma-Ray Bursts (GRBs), and stellar flares, together with the emergence of new cosmic messengers like high-energy neutrinos and Gravitational Waves (GWs), has revolutionized astrophysics in recent years. To fully exploit the scientific potential of multi-messenger and multi-wavelength follow-up observations, as well as serendipitous detections, researchers need a tool capable of rapidly compiling and contextualizing essential information for every new event. We present Astro-COLIBRI, an advanced platform designed to meet this challenge.   Astro-COLIBRI is a comprehensive platform that combines a public RESTful API, real-time databases, a cloud-based alert system, and user-friendly interfaces including a website and mobile app for iOS and Android. It ingests alerts from multiple sources in real time, applies user-defined filters, and situates each event within its multi-messenger and multi-wavelength context. The platform provides clear data visualization, concise summaries of key event properties, and evaluations of observing conditions across a wide network of observatories worldwide. We here detail the architecture of Astro-COLIBRI, from the data pipelines that manage real-time alert ingestion and processing to the design of the RESTful API, which enables seamless integration with other astronomical software and services.\n\n", "2602.01659": "2026-02-02, **Revisiting neutrino-driven magnetogenesis during stellar core collapse**, Fan Zhang et.al., [2602.01659v1](http://arxiv.org/abs/2602.01659v1)\n\n The literature has not converged onto a precise depiction of the magnetogenesis process for pulsars, and it is profitable to preliminarily but exhaustively assess the viability of the plethora of alternative proposals, before substantial efforts are invested into simulating them in detail. In this note, we tackle one of them, taking notice of an earlier work that suggests neutrino ponderomotive force could spawn a magnetic field not so far off from pulsar strengths. We reexamine this mechanism with more modern technology, accounting for actual core collapse dynamics, and show that this mechanism is likely less powerful than originally envisioned.\n\n", "2602.01596": "2026-02-02, **Bounds on the Tsallis Parameter from a deformed Neutrino Sector in the Early Universe**, Matias P. Gonzalez et.al., [2602.01596v1](http://arxiv.org/abs/2602.01596v1)\n\n We generalize neutrino energy density content in the early universe near BBN era $T\\simeq1$ MeV within Tsallis nonextensive statistics. By using Curado-Tsallis constraints we obtain generalized distribution functions $f\\_q(E)$. We compute the generalized thermodynamic integral for the energy density $ρ\\_q$. We define a reescaling $R^{(ξ= +1)}\\_ρ(q) = ρ\\_q/ρ^{\\rm std}$ which is a ratio between the deformed energy density and the standard extensive case. The last was used to directly map and deform neutrino content via the effective number of neutrinos $N\\_{\\rm eff}$. The deformation prediction was confronted against CMB$+$BAO and BBN data for $N\\_{\\rm eff}$ by a joint/combined $χ^2$ type-fit. We obtained the constraints $\\|q-1\\|\\le 1.09\\times 10^{-2}$ (95\\% CL) and $\\|q-1\\|\\le 1.32\\times 10^{-2}$ (99\\% CL) from the combined analysis by numerically calculating the best value of the Tsallis parameter $q\\_{\\rm best}$.\n\n", "2602.01181": "2026-02-01, **Measurements of electroweak penguin and lepton-flavour violating $B$ decays to final states with missing energy at Belle and Belle~II**, Meihong Liu et.al., [2602.01181v1](http://arxiv.org/abs/2602.01181v1)\n\n The Belle and Belle~II experiments have accumulated a data set of $1.2~\\mathrm{ab}^{-1}$ of $e^+e^- \\to B\\bar{B}$ collisions at the $Υ(4S)$ resonance. Owing to the clean event environment and well-constrained initial-state kinematics, these data are ideally suited for searches for rare electroweak penguin and lepton-flavour violating $B$ decays with missing energy from neutrinos. We report results on $b\\to sν\\barν$ processes and the interpretation, together with searches for $B\\to K^{*0}τ^+τ^-$ and for the LFV decays $B^0\\to K\\_S^0τ^\\pm\\ell^\\mp$ and $B^0\\to K^{*0}τ^\\pm\\ell^\\mp$ ($\\ell=e,μ$).\n\n"}, "dark matter": {"2602.01925": "2026-02-02, **Clustering of emission line galaxies with IllustrisTNG -- II. cosmology challenge with anisotropic correlation functions and ELG-halo connections**, Ken Osato et.al., [2602.01925v1](http://arxiv.org/abs/2602.01925v1)\n\n Emission line galaxies (ELGs) are the primary tracers of the large-scale structures of the Universe in ongoing Stage-IV cosmological spectroscopic surveys, which aim to measure the clustering statistics at higher redshifts $z \\simeq 1.5 \\text{--} 2$ with unprecedented precision. In this study, we construct realistic mock ELG samples with IllustrisTNG hydrodynamical simulations and stellar population synthesis framework. In order to validate the modelling of clustering, we measure the anisotropic correlation functions of mock ELGs and infer the linear growth rate, which is one of key cosmological parameters in galaxy clustering. As a control sample, we construct the mass-limited subhalo samples with the same number density as ELGs. The isotropic correlation functions in real space for both samples do not differ significantly. However, the quadrupole moment of the anisotropic correlation function, which is sensitive to the velocity of galaxies, is suppressed for ELGs, potentially due to the infalling motion of ELGs towards the centre of the hosting halos. The smaller amplitude leads to the underestimation of the linear growth rate and implies the velocity bias between ELGs and dark matter. When the analysis is limited to large scales $(\\gtrsim 15 \\, h^{-1} \\, \\mathrm{Mpc})$, the parameter bias vanishes. Next, we investigate the ELG-halo connection through the phase-space distribution of satellite ELGs within hosting halos and galactic conformity of star formation activity. The infalling motion is further confirmed by the phase-space distribution relative to the host halo, and this dynamics of ELGs challenges the assumption that the radial distribution of satellites follows that of dark matter.\n\n", "2602.01773": "2026-02-02, **Disappearing Track Signals from a Light Charged Higgs in the Alternative Left-Right Model**, Hrishikesh Deka et.al., [2602.01773v1](http://arxiv.org/abs/2602.01773v1)\n\n We study the phenomenology of a light charged Higgs boson in the framework of the Alternative Left--Right Symmetric Model (ALRM). In this model, stringent flavor constraints are evaded due to a non-conventional fermion spectrum in which the right-handed up-type quarks are paired with the exotic down-type quarks rather than the Standard Model down-type quarks, leading to the absence of tree-level flavor-changing neutral currents. Furthermore, a specific assignment of the global $U(1)\\_S$ symmetry and the resulting emergent $R$-parity prevent mixing between the right- and left-handed charged gauge bosons, $W\\_R$ and $W\\_L$, providing additional suppression of flavor-violating effects. The ALRM accommodates potentially viable dark matter candidates, both fermionic and scalar ones. In this context, an associated charged Higgs state, $H\\_2^\\pm$, belonging to the dark sector can naturally acquire a sub-TeV to TeV-scale mass without conflicting with any experimental constraints. We focus on scenarios in which $H\\_2^\\pm$ behaves as a long-lived particle due to a sub-GeV mass splitting with the dark matter candidate. We identify regions of parameter space consistent with the observed dark matter relic density and other experimental constraints. A detailed analysis of disappearing track signatures is performed, including realistic tracklet reconstruction efficiencies, and the existing ATLAS search are recast to assess the current limits and future sensitivities. We find that the HL-LHC has limited sensitivity to TeV-scale charged Higgs bosons in this scenario, while the 27 TeV HE-LHC can effectively probe the relevant parameter space, with a 100 TeV collider offering substantially enhanced discovery potential.\n\n", "2602.01543": "2026-02-02, **Partial Relief of the Hubble Tension and a Natural Self-Interacting Dark Matter Candidate From Staged Symmetry Breaking**, Zachary J. Hoelscher et.al., [2602.01543v1](http://arxiv.org/abs/2602.01543v1)\n\n The values of the Hubble constant ($\\rm{H\\_0}$) inferred from the cosmic microwave background (CMB) and local measurements via the distance ladder exhibit a $\\sim5σ$ tension. In this work we propose that the tension might be partially alleviated if a subcomponent of the dark matter undergoes decays triggered by spontaneous symmetry breaking in the dark sector, so that the equation of state parameter of the subcomponent shifts from $w \\approx 0$ at early times to $w \\approx -1/3$ at late times. We provide an effective field theory whose structure is partially motivated by the desire for a plausible UV completion. We find that such a construction naturally produces a possible self-interacting dark matter candidate with a velocity-dependent scattering cross section as a by-product of gauge invariance. This is relevant for addressing tensions between the predictions of $Λ$CDM and observations of small-scale structure, such as the core-cusp problem.\n\n", "2602.01343": "2026-02-01, **Resonant production of heavy particles during inflation and its gravitational wave signature**, Qi Chen et.al., [2602.01343v1](http://arxiv.org/abs/2602.01343v1)\n\n We show that a quadratic $U(1)$-breaking term, together with an effective chemical potential induced by a dimension five derivative coupling between the inflaton and the $U(1)$ current, can drive efficient particle production during inflation even when the $U(1)$ field is heavier than the Hubble scale. Notably, the chemical potential enables efficient production even when the $U(1)$-breaking mass is smaller than the effective diagonal mass. We compute the gravitational wave signal generated by this mechanism during inflation, derive the primordial tensor spectrum, and map it to the present day energy density $Ω\\_{\\mathrm GW}(f)$. Assuming the $U(1)$ field constitutes the dominant component of dark matter, this mapping fixes the characteristic frequency, which we compare with projected sensitivity curves of ongoing and proposed gravitational wave observatories. Finally, we argue that the same dynamics are accompanied by a cosmological collider signal, providing an independent cross validation of the framework.\n\n", "2602.01320": "2026-02-01, **A Variable-Slope Smooth-$k$ Filter for Modeling Halo Abundances with Damped and Oscillatory Power Spectra**, Andreu Rocamora Martorell et.al., [2602.01320v1](http://arxiv.org/abs/2602.01320v1)\n\n We introduce a variable-slope smooth-$k$ (VSMK) filter within the Press-Schechter formalism to model halo mass functions derived from damped and oscillatory matter power spectra. While the standard smooth-$k$ approach successfully captures small-scale suppression effects, it intrinsically couples these to oscillatory features at intermediate scales. The VSMK filter generalizes this framework by allowing the effective logarithmic slope of the $k$-space window function to vary smoothly between two asymptotic regimes, thereby decoupling the small-scale suppression of halo abundances from the intermediate-scale oscillatory features characteristic of dark acoustic oscillations. We compare the analytic predictions obtained with the VSMK filter to $N$-body simulations for warm dark matter and ETHOS-based models, showing that a single parameter set reproduces both regimes simultaneously. The VSMK filter thus provides a unified and flexible analytic framework for modeling halo abundances in non-cold dark matter scenarios with damped and oscillatory power spectra.\n\n"}, "supernova": {"2602.02069": "2026-02-02, **Universal Relations and Correlation Analysis of Proto-Neutron Star Properties in Energy-Momentum Squared Gravity**, Sayantan Ghosh et.al., [2602.02069v1](http://arxiv.org/abs/2602.02069v1)\n\n Proto-neutron stars (PNSs) are the hot, lepton-rich remnants of the core collapse supernovae, which go through a cooling phase and become cold, stable Neutron stars (NSs). Since PNSs are also superdense objects with strong gravitational fields, we can use them to probe general relativity (GR) in the high-curvature regime, similar to NSs. In this study, we analyze the macroscopic properties like mass, radius, compactness, tidal deformability, $f$-mode oscillations and gravitational binding energy of PNSs using four different relativistic mean-field (RMF) equations of state (EOSs) with fixed entropy per baryon ($S$ =1, 2) and varying the lepton fractions ($Y\\_l$). The variation of $S$ and $Y\\_l$ has a noticeable effect on these properties. Extending our study beyond GR, we explore these effects within the framework of Energy-Momentum Squared Gravity (EMSG). This modified gravity theory adds the squared energy-momentum terms to the field equations with a free parameter $α$. In the weak-field regimes, EMSG remains indistinguishable from GR, but in the strong-field regimes, such as PNSs or NSs, it shows measurable deviations. Varying the free parameter $α$, we observe significant changes in the macroscopic properties of the PNSs. After that, we focus on the universal relations of the macroscopic properties and the correlations of the universal relations. We find that, despite significant changes in the macroscopic properties induced by the variations of $S$, $Y\\_l$ and $α$, the correlations remain strong and nearly unaffected.\n\n"}}