{"neutrino": {"2401.14402": "2024-01-25, **Nucleosynthesis in magnetorotational supernovae: impact of the magnetic field configuration**, M. Reichert et.al., [2401.14402v1](http://arxiv.org/abs/2401.14402v1)\n\n The production of heavy elements is one of the main by-products of the explosive end of massive stars. A long sought goal is finding differentiated patterns in the nucleosynthesis yields, which could permit identifying a number of properties of the explosive core. Among them, the traces of the magnetic field topology are particularly important for \\emph{extreme} supernova explosions, most likely hosted by magnetorotational effects. We investigate the nucleosynthesis of five state-of-the-art magnetohydrodynamic models with fast rotation that have been previously calculated in full 3D and that involve an accurate neutrino transport (M1). One of the models does not contain any magnetic field and synthesizes elements around the iron group, in agreement with other CC-SNe models in literature. All other models host a strong magnetic field of the same intensity, but with different topology. For the first time, we investigate the nucleosynthesis of MR-SNe models with a quadrupolar magnetic field and a 90 degree tilted dipole. We obtain a large variety of ejecta compositions reaching from iron nuclei to nuclei up to the third r-process peak. We assess the robustness of our results by considering the impact of different nuclear physics uncertainties such as different nuclear masses, $\\beta^{-}$-decays and $\\beta^{-}$-delayed neutron emission probabilities, neutrino reactions, fission, and a feedback of nuclear energy on the temperature. We find that the qualitative results do not change with different nuclear physics input. The properties of the explosion dynamics and the magnetic field configuration are the dominant factors determining the ejecta composition.\n\n", "2401.14316": "2024-01-25, **Invisible neutrino decay at long-baseline neutrino oscillation experiments**, Christoph A. Ternes et.al., [2401.14316v1](http://arxiv.org/abs/2401.14316v1)\n\n We perform an updated analysis of long-baseline accelerator data in the framework of neutrino oscillations in presence of invisible neutrino decay. We analyze data from T2K, NOvA and MINOS/MINOS+ and show that the combined analysis of all experiments improves the previous bound from long-baseline data by approximately one order of magnitude.\n\n", "2401.14305": "2024-01-25, **$νe\\toνe$ scattering with massive Dirac or Majorana neutrinos and general interactions**, Juan Manuel Márquez et.al., [2401.14305v1](http://arxiv.org/abs/2401.14305v1)\n\n We calculate the neutrino-electron elastic scattering cross section, extending the results previously obtained in arXiv:1702.05721v2, in the presence of generic new interactions that take into account all the effects caused by finite neutrino masses. We address the potential significance of a heavy neutrino sector during precision measurements, particularly for tau neutrinos scattering with masses in the MeV range, for which the existing upper bounds on $\\|U\\_{\\tau 4}\\|^2$ would result in conceivably measurable contributions. Finally, we comment on the possibility to distinguish between Dirac and Majorana neutrinos, including the analysis of the new emerging parameters and its application to illustrative model-dependent scenarios.\n\n", "2401.14114": "2024-01-25, **Development of a Silicon Drift Detector Array to Search for keV-scale Sterile Neutrinos with the KATRIN Experiment**, Daniel Siegmann et.al., [2401.14114v1](http://arxiv.org/abs/2401.14114v1)\n\n Sterile neutrinos in the keV mass range present a viable candidate for dark matter. They can be detected through single $\\beta$ decay, where they cause small spectral distortions. The Karlsruhe Tritium Neutrino (KATRIN) experiment aims to search for keV-scale sterile neutrinos with high sensitivity. To achieve this, the KATRIN beamline will be equipped with a novel multi-pixel silicon drift detector focal plane array named TRISTAN. In this study, we present the performance of a TRISTAN detector module, a component of the eventual 9-module system. Our investigation encompasses spectroscopic aspects such as noise performance, energy resolution, linearity, and stability.\n\n", "2401.14054": "2024-01-25, **The Superscaling Variable and Neutrino Energy Reconstruction, From Theoretical Predictions to Experimental Limitations**, Dana Douqa et.al., [2401.14054v1](http://arxiv.org/abs/2401.14054v1)\n\n We introduce the novel approach of using the superscaling variable as an observable and an analysis tool in the context of charged current neutrino-nucleus interactions. We study the relation between the superscaling variable and the removal energy, in addition to other fundamental parameters of the neutrino-nucleus interaction models. In the second half of the paper, we discuss the experimental viability of this measurement following a study of neutrino energy and missing momentum reconstruction. We show that the superscaling variable is measurable in neutrino interaction experiments provided that the proton is detected in the final state. We discuss the resolution of this measurement, and the limitation imposed by the proton's detection threshold.\n\n"}, "dark matter": {"2401.14331": "2024-01-25, **Collapsing Domain Wall Networks: Impact on Pulsar Timing Arrays and Primordial Black Holes**, Ricardo Z. Ferreira et.al., [2401.14331v1](http://arxiv.org/abs/2401.14331v1)\n\n Unstable domain wall (DW) networks in the early universe are cosmologically viable and can emit a large amount of gravitational waves (GW) before annihilating. As such, they provide an interpretation for the recent signal reported by Pulsar Timing Array (PTA) collaborations. A related important question is whether such a scenario also leads to significant production of Primordial Black Holes (PBH). We investigate both GW and PBH production using 3D numerical simulations in an expanding background, with box sizes up to $N=3240$, including the annihilation phase. We find that: i) the network decays exponentially, i.e. the false vacuum volume drops as $\\sim \\exp(-\\eta^3)$, with $\\eta$ the conformal time; ii) the GW spectrum is larger than traditional estimates by more than one order of magnitude, due to a delay between DW annihilation and the sourcing of GWs. We then present a novel semi-analytical method to estimate the PBH abundances: rare false vacuum pockets of super-Hubble size collapse to PBHs if their energy density becomes comparable to the background when they cross the Hubble scale. Smaller (but more abundant) pockets will instead collapse only if they are close to spherical. This introduces very large uncertainties in the final PBH abundance. The first phenomenological implication is that within these uncertainties it is not possible to rule out the DW interpretation of the PTA signal. Second, in a different parameter region, there is the interesting possibility of producing all of the dark matter in the form of asteroid-mass PBHs from the DW collapse. Remarkably, this would also lead to a GW background in the observable range of LIGO-Virgo-KAGRA and future interferometers, i.e. Einstein Telescope and LISA.\n\n", "2401.14234": "2024-01-25, **Velocity acoustic oscillations on Cosmic Dawn 21 cm power spectrum as a probe of small-scale density fluctuations**, Xin Zhang et.al., [2401.14234v1](http://arxiv.org/abs/2401.14234v1)\n\n We investigate the feasibility of using the velocity acoustic oscillations (VAO) features on the Cosmic Dawn 21 cm power spectrum to probe small-scale density fluctuations. In the standard cold dark matter (CDM) model, Pop III stars form in minihalos and affect the 21 cm signal through Ly$\\alpha$ and X-ray radiation. Such a process is modulated by the relative motion between dark matter and baryons, generating the VAO wiggles on the 21 cm power spectrum. In the fuzzy or warm dark matter models for which the number of minihalos is reduced, the VAO wiggles are weaker or even fully invisible. We investigate the wiggle features in the CDM with different astrophysical models and in different dark matter models. We find: 1) In the CDM model the relative streaming velocities can generate the VAO wiggles for broad ranges of parameters $f\\_*$, $\\zeta\\_X$ and $f\\_{\\rm esc,LW}\\zeta\\_{\\rm LW}$, though for different parameters the wiggles would appear at different redshifts and have different amplitudes. 2) For the axion model with $m\\_{\\rm a} \\lesssim10^{-19}$ eV, the VAO wiggles are negligible. In the mixed model, the VAO signal is sensitive to the axion fraction. For example, the wiggles almost disappear when $f\\_{\\rm a} \\gtrsim 10\\%$ for $m\\_{\\rm a}=10^{-21}$ eV. Therefore, the VAO signal can be an effective indicator for small-scale density fluctuations and a useful probe of the nature of dark matter. The SKA-low with $\\sim$2000 hour observation time has the ability to detect the VAO signal and constraint dark matter models.\n\n", "2401.14195": "2024-01-25, **Sensitivity of two-mode SRF cavity to generic electromagnetic interactions of ultralight dark matter**, Chang-Jie Dai et.al., [2401.14195v1](http://arxiv.org/abs/2401.14195v1)\n\n The ultralight dark matter (ULDM) such as axion or wavelike scalar plays as a plausible DM candidate. Recently, the possible non-standard ULDM couplings draw much attention. In this work we investigate the detection of electromagnetic couplings in a few benchmark models of ULDM. For illustration, we consider the generic axion electrodynamics including CP violating coupling as well as the newly proposed axion electromagnetodynamics. The superconducting radio frequency (SRF) cavity with two-mode has more advantages than the traditional cavity approach with static background field. We utilize the two-mode SRF cavity to probe the generic couplings of ULDM with frequency lower than GHz. The choices of the transverse electromagnetic modes are explicitly specified for the detection. We show the sensitivity of the SRF cavity to the axion couplings in the above frameworks.\n\n", "2401.14072": "2024-01-25, **Gamma rays from dark matter spikes in EAGLE simulations**, J. Aschersleben et.al., [2401.14072v1](http://arxiv.org/abs/2401.14072v1)\n\n Intermediate Mass Black Holes (IMBHs) with a mass range between $100 \\, \\text{M}\\_\\odot$ and $10^6 \\, \\text{M}\\_\\odot$ are expected to be surrounded by high dark matter densities, so-called dark matter spikes. The high density of self-annihilating WIMPs in these spikes leads to copious gamma-ray production. Sufficiently nearby IMBHs could therefore appear as unidentified gamma-ray sources. However, the number of IMBHs and their distribution within our own Milky Way is currently unknown. In this work, we provide a mock catalogue of IMBHs and their dark matter spikes obtained from the EAGLE simulations, in which black holes with a mass of $10^5 \\, \\text{M}\\_\\odot/h$ are seeded into the centre of halos greater than $10^{10} \\, \\text{M}\\_\\odot/h$ to model black hole feedback influencing the formation of galaxies. The catalogue contains the coordinates and dark matter spike parameters for over 8700 IMBHs present in about 400 Milky Way-like galaxies. We expect about $19^{+13}\\_{-8}$ IMBHs within our own galaxy, mainly distributed in the Galactic Centre and the Galactic Plane. In the most optimistic scenario, we find that current and future gamma-ray observatories, such as Fermi-LAT, H.E.S.S. and CTA, would be sensitive enough to probe the cross section of dark matter self-annihilation around IMBHs down to many orders of magnitude below the thermal relic cross section for dark matter particles with masses from GeV to TeV. We have made the IMBH mock catalogue and the source code for our analysis publicly available, providing the resources to study dark matter self-annihilation around IMBHs with current and upcoming gamma-ray observatories.\n\n", "2401.14046": "2024-01-25, **Search for nearly mass-degenerate higgsinos using low-momentum mildly-displaced tracks in $pp$ collisions at $\\sqrt{s}$ = 13 TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2401.14046v1](http://arxiv.org/abs/2401.14046v1)\n\n Higgsinos with masses near the electroweak scale can solve the hierarchy problem and provide a dark matter candidate, while detecting them at the LHC remains challenging if their mass-splitting is $\\mathcal{O}$(1 GeV). This Letter presents a novel search for nearly mass-degenerate higgsinos in events with an energetic jet, missing transverse momentum, and a low-momentum track with a significant transverse impact parameter using 140 fb$^{-1}$ of proton-proton collision data at $\\sqrt{s}$ = 13 TeV collected by the ATLAS experiment. For the first time since LEP, a range of mass-splittings between the lightest charged and neutral higgsinos from 0.3 GeV to 0.9 GeV is excluded at 95% confidence level, with a maximum reach of approximately 170 GeV in the higgsino mass.\n\n", "2401.13876": "2024-01-25, **GammaBayes: a Bayesian pipeline for dark matter detection with CTA**, Liam Pinchbeck et.al., [2401.13876v1](http://arxiv.org/abs/2401.13876v1)\n\n We present GammaBayes, a Bayesian Python package for dark matter detection with the Cherenkov Telescope Array (CTA). GammaBayes takes as input the CTA measurements of gamma rays and a user-specified dark-matter particle model. It outputs the posterior distribution for parameters of the dark-matter model including the velocity-averaged cross section for dark-matter self interactions $\\langle\\sigma v\\rangle$ and the dark-matter mass $m\\_\\chi$. It also outputs the Bayesian evidence, which can be used for model selection. We demonstrate GammaBayes using 525 hours of simulated data, corresponding to $10^8$ observed gamma-ray events. The vast majority of this simulated data consists of noise, but $100000$ events arise from the annihilation of scalar singlet dark matter with $m\\_\\chi= 10$ TeV. We recover the dark matter mass within a 95% credible interval of $m\\_\\chi \\sim 5.9-11.2$ TeV. Meanwhile, the velocity averaged cross section is constrained to $\\langle\\sigma v\\rangle \\sim 1.3-2.3\\times10^{-25}$ cm$^3$ s$^{-1}$ (95% credibility). This is equivalent to measuring the number of dark-matter annihilation events to be $N\\_S \\sim 1.0\\_{-0.2}^{+0.2} \\times 10^5$. The no-signal hypothesis $\\langle \\sigma v \\rangle=0$ is ruled out with about $5\\sigma$ credibility. We discuss how GammaBayes can be extended to include more sophisticated signal and background models and the computational challenges that must be addressed to facilitate these upgrades. The source code is publicly available at https://github.com/lpin0002/GammaBayes.\n\n"}, "supernova": {"2401.14170": "2024-01-25, **No-go guide for the Hubble tension: late-time or local-scale new physics**, Lu Huang et.al., [2401.14170v1](http://arxiv.org/abs/2401.14170v1)\n\n The standard model of modern cosmology might be cracked by the recent persistent hot debate on the Hubble-constant ($H\\_0$) tension, which manifests itself as the sound-horizon ($r\\_s$) tension or absolute-magnitude ($M\\_B$) tension if deeming the origin of the Hubble tension from modifying the early or late Universe, respectively. In this Letter, we achieve a fully model-independent constraint (fitting a model-independent global parameterization to a model-independent inverse distant ladder with a model-independent high-redshift calibration) on late-time models with strong evidence against homogeneous new physics over the $\\Lambda$-cold-dark ($\\Lambda$CDM) model. Further using this model-independent constraint to calibrate sufficiently local supernovae with corresponding late-time models extrapolated below the homogeneity scale, we find surprisingly that, although both $H\\_0$ tension and $M\\_B$ tension are absent in our local Universe, a combination of $H\\_0$ and $M\\_B$ as the intercept $a\\_B$ of the magnitude-redshift relation exhibits $3\\sim 7\\sigma$ tension even for the $\\Lambda$CDM model. This $a\\_B$ tension seems to call for local-scale inhomogeneous new physics disguised as local observational systematics.\n\n", "2401.13993": "2024-01-25, **Universal relations for fundamental modes of rotating neutron stars with differential rotations**, Anson Ka Long Yip et.al., [2401.13993v1](http://arxiv.org/abs/2401.13993v1)\n\n Violent astrophysical events, including core-collapse supernovae and binary neutron star mergers, can result in rotating neutron stars with diverse degrees of differential rotation. Oscillation modes of these neutron stars could be excited and emit strong gravitational waves. Detecting these modes may provide information about neutron stars, including their structures and dynamics. Hence, dynamical simulations were employed to construct relations for quantifying the oscillation mode frequency in previous studies. Specifically, linear relations for the frequencies of fundamental $l=0$ quasi-radial mode $f\\_{F}$ and fundamental $l=2$ quadrupolar mode $f\\_{^2f}$ were constructed by simulations with the Cowling approximation. Nevertheless, these relations can overestimate $f\\_{F}$ and underestimate $f\\_{^2f}$ up to $\\sim 30\\%$. Furthermore, it has yet to be fully studied how the degree of differential rotation affects $f\\_{F}$ and $f\\_{^2f}$. Here, for the first time, we consider both various degrees of differential rotation $\\tilde{A}$ and dynamical spacetime to construct linear relations for quantifying $f\\_{F}$ and $f\\_{^2f}$. Through 2D axisymmetric simulations, we first show that both $f\\_{F}$ and $f\\_{^2f}$ scale almost linearly with the stellar compactness $M/R$ for different values of $\\tilde{A}$. We also observe the quasi-linear relations for both $f\\_{F}$ and $f\\_{^2f}$ with the kinetic-to-binding energy ratio $T/\\|W\\|$ for different $\\tilde{A}$ values. Finally, we constructed linear fits that can quantify $f\\_{F}$ and $f\\_{^2f}$ by $T/\\|W\\|$. Consequently, this work presented universal relations for the fundamental modes of rotating neutron stars with differential rotations in dynamical spacetime.\n\n"}}