{"neutrino": {"2408.14955": "2024-08-27, **De-excitations of highly excited $^{11}$B$^*$ and $^{15}$N$^*$ based on the GEMINI++ code**, Yujie Niu et.al., [2408.14955v1](http://arxiv.org/abs/2408.14955v1)\n\n Nuclear de-excitations associated with neutrino-nucleus interactions and nucleon decays are playing an increasingly significant role in neutrino experiments. We explore the GEMINI++ code and estimate its ability to account for the de-excitation processes of highly excited $^{11}$B$^*$ and $^{15}$N$^*$, which can be created in the liquid scintillator and water Cherenkov detectors respectively. It is found that GEMINI++ can not describe the nuclear experimental data of $^{11}$B$^*$ and $^{15}$N$^*$ well. To improve its performance for de-excitations of light nuclei, we modify GEMINI++ and then develop a code of GEMINI++4$\\nu$, which can give the best predictions compared with experimental measurements among some widely used statistical model codes.\n\n", "2408.14942": "2024-08-27, **Neutrino Masses and Mixing in an Axion Model**, Sin Kyu Kang et.al., [2408.14942v1](http://arxiv.org/abs/2408.14942v1)\n\n We propose a novel framework that addresses three critical issues: tiny neutrino masses and mixing, dark matter, and the strong CP problem. Our model extends the Peccei-Quinn (PQ) symmetry by incorporating modular $S\\_3$ symmetry to specifically address neutrino mixing. It features two vector-like colored fermions and three colored scalars as $S\\_3$ singlets, an isospin doublet inert scalar and a singlet PQ scalar with appropriate modular weights assigned. Tiny neutrino masses are generated radiatively through colored mediators, while the KSVZ-type axion appears to dynamically resolve the strong CP problem. We investigate the phenomenology of lepton flavor violation and the muon $g-2$ anomaly within this framework. Additionally, we explore the axion's properties and its role as dark matter.\n\n", "2408.14856": "2024-08-27, **Lepton flavour violation Signals of the singly charged scalar singlet at the ILC**, Chong-Xing Yue et.al., [2408.14856v1](http://arxiv.org/abs/2408.14856v1)\n\n The singly charged $SU(2)\\_L$ singlet scalar is one of the very interesting new particles, as it can generate neutrino masses at loop level, produce contributions to various flavour observables. We study the possibility of detecting this kind of scalar predicted by the singly-charged scalar model at ILC via the lepton flavour violation (LFV) process $e^+e^-\\rightarrow S^+S^-\\rightarrow \\mu e + {E\\mkern-10.5 mu/}$. Considering the constraints on the free parameters, we obtain the expected sensitivities of the ILC with the center of mass energy $\\sqrt{s}=1~\\mathrm{TeV}$ and the integrated luminosity $\\mathcal{L}=$ $1.5~\\mathrm{ab}^{-1}$ to the parameter space of the singly-charged scalar model. The prospective excluded mass range at $95\\%$ C.L. is $M\\_S \\gtrsim 470~\\mathrm{GeV}$, $410~\\mathrm{GeV}$ for the branching ratio $\\mathcal{B}\\_{\\mu e}$ = $100\\%$ , $50\\%$, respectively, while the scalar with $M\\_S \\gtrsim 300~\\mathrm{GeV}$ is excluded at $95\\%$ C.L. for $\\mathcal{B}\\_{\\mu e}$ = $30\\%$.\n\n", "2408.14628": "2024-08-26, **Investigating Late-Time Dark Energy and Massive Neutrinos in Light of DESI Y1 BAO**, João Rebouças et.al., [2408.14628v1](http://arxiv.org/abs/2408.14628v1)\n\n Baryonic Acoustic Oscillation (BAO) data from the Dark Energy Spectroscopic Instrument (DESI), in combination with Cosmic Microwave Background (CMB) data and Type Ia Supernovae (SN) luminosity distances, suggests a dynamical evolution of the dark energy equation of state with a phantom phase ($w < -1$) in the past when the so-called $w\\_0w\\_a$ parametrization $w(a) = w\\_0 + w\\_a(1-a)$ is assumed. In this work, we investigate more general dark energy models that also allow a phantom equation of state. We consider three cases: an equation of state with a transition feature, a model-agnostic equation of state with constant values in chosen redshift bins, and a k-essence model. Since the dark energy equation of state is correlated with neutrino masses, we reassess constraints on the neutrino mass sum focusing on the model-agnostic equation of state. We find that the combination of DESI BAO with Planck 2018 CMB data and SN data from Pantheon, Pantheon+, or Union3 is consistent with an oscillatory dark energy equation of state, while a monotonic behavior is preferred by the DESY5 SN data. Performing model comparison techniques, we find that the $w\\_0w\\_a$ parametrization remains the simplest dark energy model that can provide a better fit to DESI BAO, CMB, and all SN datasets than $\\Lambda$CDM. Constraints on the neutrino mass sum assuming dynamical dark energy are relaxed compared to $\\Lambda$CDM and we show that these constraints are tighter in the model-agnostic case relative to $w\\_0w\\_a$ model by $70\\%-90\\%$.\n\n", "2408.14548": "2024-08-26, **Collider and CMB complementarity of leptophilic dark matter with light Dirac neutrinos**, Debasish Borah et.al., [2408.14548v1](http://arxiv.org/abs/2408.14548v1)\n\n We study the discovery prospects of leptophilic dark matter (DM) in future lepton colliders by considering the light neutrinos to be of Dirac type. Adopting an effective field theory (EFT) approach, we write down dimension six operators connecting the standard model (SM) fields, light Dirac neutrinos and DM. Considering DM relic to be generated via the thermal freeze-out, we check the discovery prospects at future lepton colliders via mono-photon plus missing energy searches. The right chiral parts of light Dirac neutrinos get thermalised due to their interactions with the bath as well as leptophilic DM, leading to enhanced effective relativistic degrees of freedom $N\\_{\\rm eff}$ within reach of future cosmic microwave background (CMB) experiments. The interplay of existing bounds from cosmological observations related to DM relic and $N\\_{\\rm eff}$, direct and indirect detection of DM, astrophysics and collider observations leave promising discovery prospects at future electron and muon colliders along with complementary signatures at future CMB experiments.\n\n", "2408.14531": "2024-08-26, **Cosmological Parameter Estimation with a Joint-Likelihood Analysis of the Cosmic Microwave Background and Big Bang Nucleosynthesis**, Cara Giovanetti et.al., [2408.14531v1](http://arxiv.org/abs/2408.14531v1)\n\n We present the first joint-likelihood analysis of Big Bang Nucleosynthesis (BBN) and Cosmic Microwave Background (CMB) data. Bayesian inference is performed on the baryon abundance and the effective number of neutrino species, $N\\_{\\rm eff}$, using a CMB Boltzmann solver in combination with LINX, a new flexible and efficient BBN code. We marginalize over Planck nuisance parameters and nuclear rates to find $N\\_{\\rm{eff}} = 3.08\\_{-0.13}^{+0.13},\\,2.94 \\_{-0.16}^{+0.16},$ or $2.98\\_{-0.13}^{+0.14}$, for three separate reaction networks. This framework enables robust testing of the Lambda Cold Dark Matter paradigm and its variants with CMB and BBN data.\n\n", "2408.14166": "2024-08-26, **Dirac Neutrinos and Dark Matter within a Minimal Discrete Symmetry Model**, Yakefu Reyimuaji et.al., [2408.14166v1](http://arxiv.org/abs/2408.14166v1)\n\n We present a model that extends the standard model by incorporating the simplest discrete symmetry groups, $Z\\_2$ and $Z\\_3$. This model introduces vector-like leptons and a real scalar singlet. Based on this framework, we generate Dirac neutrino masses and explain the neutrino normal mass ordering. The model also aligns well with current oscillation data regarding theoretical values of the leptonic mixing angles and the Dirac CP-violating phase. Furthermore, it predicts that the atmospheric mixing angle falls in the higher octant and proposes a viable dark matter candidate. We discuss the phenomenological aspects and future testability of the model.\n\n", "2408.13990": "2024-08-26, **Spontaneous CP violation, sterile neutrino dark matter, and leptogenesis**, Yanjin Jiang et.al., [2408.13990v1](http://arxiv.org/abs/2408.13990v1)\n\n We constructed a model for spontaneous CP symmetry breaking in five-dimensional space-time that solves the strong CP problem. To explain the nature of dark matter and the baryon asymmetry of the universe, three right-handed neutrinos and $U(1)\\_{B-L}$ gauge interaction are introduced in the bulk, in addition to the field contents of the Bento-Branco-Parada model. The wave-function profiles in the fifth dimension can suppress dangerous operators allowed by symmetries, and the scale of spontaneous CP symmetry breaking can be sufficiently large to be consistent with thermal leptogenesis. In this model, the lightest right-handed neutrino serves as dark matter with a mass of $\\mathcal{O}(10)$ keV. This small mass and the necessarily small mixing are explained by the exponentially localized wave-function in the fifth dimension due to a bulk mass term. The correct relic abundance is achieved thanks to the $U(1)\\_{B-L}$ gauge interaction. The other heavy right-handed neutrinos explain the baryon asymmetry of the universe through leptogenesis, with the required CP violating phases generated by interactions involving heavy leptons.\n\n"}, "dark matter": {"2408.15227": "2024-08-27, **Axion Dark Matter eXperiment around 3.3 μeV with Dine-Fischler-Srednicki-Zhitnitsky Discovery Ability**, C. Bartram et.al., [2408.15227v1](http://arxiv.org/abs/2408.15227v1)\n\n We report the results of a QCD axion dark matter search with discovery ability for Dine-Fischler-Srednicki-Zhitnitsky (DFSZ) axions using an axion haloscope. Sub-Kelvin noise temperatures are reached with an ultra low-noise Josephson parametric amplifier cooled by a dilution refrigerator. This work excludes (with a 90% confidence level) DFSZ axions with masses between 3.27 to 3.34 {\\mu}eV, assuming a standard halo model with a local energy density of 0.45 GeV/cc made up 100% of axions.\n\n", "2408.15214": "2024-08-27, **EDGE: Predictable Scatter in the Stellar Mass--Halo Mass Relation of Dwarf Galaxies**, Stacy Y. Kim et.al., [2408.15214v1](http://arxiv.org/abs/2408.15214v1)\n\n The stellar-mass--halo-mass (SMHM) relation is central to our understanding of galaxy formation and the nature of dark matter. However, its normalisation, slope, and scatter are highly uncertain at dwarf galaxy scales. In this paper, we present DarkLight, a new semi-empirical dwarf galaxy formation model designed to robustly predict the SMHM relation for the smallest galaxies. DarkLight harnesses a correlation between the mean star formation rate of dwarfs and their peak rotation speed -- the $\\langle$SFR$\\rangle$-$v\\_{\\rm max}$ relation -- that we derive from simulations and observations. Given the sparsity of data for isolated dwarfs with $v\\_{\\rm max} \\lesssim 20$ km/s, we fit the $\\langle$SFR$\\rangle$-$v\\_{\\rm max}$ relation to observational data for dwarfs above this velocity scale and to the high-resolution EDGE cosmological simulations below. Reionisation quenching is implemented via distinct $\\langle$SFR$\\rangle$-$v\\_{\\rm max}$ relations before and after reionisation. We find that the SMHM scatter is small at reionisation, $\\sim$0.2 dex, but rises to $\\sim$0.5 dex ($1\\sigma$) at a halo mass of $\\sim$10$^9$ M$\\_\\odot$ as star formation is quenched by reionisation but dark matter halo masses continue to grow. While we do not find a significant break in the slope of the SMHM relation, one can be introduced if reionisation occurs early ($z\\_{\\rm quench} \\gtrsim 5$). Finally, we find that dwarfs can be star forming today down to a halo mass of $\\sim$2 $\\times 10^9$ M$\\_\\odot$. We predict that the lowest mass star forming dwarf irregulars in the nearby universe are the tip of the iceberg of a much larger population of quiescent isolated dwarfs.\n\n", "2408.14989": "2024-08-27, **Dynamical Systems Analysis of f(R,G) Cosmological Model with Dark Sector Coupling**, Shivani Sharma et.al., [2408.14989v1](http://arxiv.org/abs/2408.14989v1)\n\n In this article, we examine the dynamical system of $f(R,\\mathcal{G})$ gravity model. This $f(R,G)$ model framework is composed of the interactions between dark matter and scalar field through the linear coupling term. The key objective of present study is to describe the cosmological viability of modified gravity theory formulated with the $ f(R, \\mathcal{G}) $ gravity. We transform the cosmological equations into an autonomous system of ordinary differential equations by suitable transformation of variables. The $ f(R,\\mathcal{G})$ model governed by $ f(R, \\mathcal{G}) = \\alpha R^m + \\beta \\mathcal{G}^n $ has been investigated in detail to characterize the stability properties of the critical points of the autonomous system. The model may explain the late-time accelerating universe expansion corresponding to the attractor in model. Depending on the effective equation of state parameter values corresponding to the critical points, we study the observational viability of model using low-redshift observational data such as the observational Hubble data and Pantheon data. Furthermore, we investigate the effects of parameters by using the effective equation of state parameter and statefinder diagnostics.\n\n", "2408.14867": "2024-08-27, **The Fluorescence Camera of the POEMMA-Balloon with Radio (PBR): Design and Scientific goals**, Matteo Battisti et.al., [2408.14867v1](http://arxiv.org/abs/2408.14867v1)\n\n The POEMMA-Balloon with Radio (PBR) is a proposed payload to fly on a NASA Super Pressure Balloon (SPB). It will act as a pathfinder of the Probe Of Extreme Multi-Messenger Astrophysics (POEMMA) detector. PBR will consist of an innovative hybrid focal surface featuring a Fluorescence Camera (FC, based on Multi-Anode Photomultiplier Tubes [MAPMTs], 1.05 $\\mu$s time resolution) and a Cherenkov Camera (based on SiPMs, 10 ns time resolution), both mounted on the same tiltable frame that can point from nadir up to 13$^\\circ$ above the horizon. The FC's main scientific goal is to observe, for the first time, the fluorescence emission of Extensive Air Showers produced by Ultra-High Energy Cosmic Rays from sub-orbital altitudes. This measurement will validate the detection strategy for future space-based missions, such as POEMMA. As a secondary goal, the FC will perform a search for macroscopic dark matter through slowly evolving showers that will leave a signal similar to (but distinct from) a meteor. PBR targets a launch in 2027 as a payload of an ultra-long duration balloon flight with a duration of up to 100 days.\n\n", "2408.14730": "2024-08-27, **Search for lepton portal dark matter in the PandaX-4T experiment**, PandaX Collaboration et.al., [2408.14730v1](http://arxiv.org/abs/2408.14730v1)\n\n We report a search for a lepton-portal dark matter model, where dark matter couples to a charged lepton in the standard model. This simplified model naturally leads to photon-mediated dark matter interactions with nuclei, making it suitable for direct dark matter detection experiments. Matching to the framework of non-relativistic effective field theory for dark matter, we report the first sensitive search for this model using data from the PandaX-4T commissioning run. Our results yield strong constraints on Dirac fermion dark matter but relatively weaker constraints on Majorana dark matter due to the suppression of effective photon interactions. These constraints complement those obtained from the collider and indirect detection experiments.\n\n", "2408.14711": "2024-08-27, **The impact of dark matter on tidal signatures in neutron star mergers with Einstein Telescope**, Hauke Koehn et.al., [2408.14711v1](http://arxiv.org/abs/2408.14711v1)\n\n If dark matter (DM) accumulates inside neutron stars (NS), it changes their internal structure and causes a shift of the tidal deformability from the value predicted by the dense-matter equation of state (EOS). In principle, this shift could be observable in the gravitational-wave (GW) signal of binary neutron star (BNS) mergers. We investigate the effect of fermionic, non-interacting DM when observing a large number of GW events from DM-admixed BNSs with the precision of the proposed Einstein telescope (ET). Specifically, we study the impact on the recovery of the baryonic EOS and whether DM properties can be constrained. For this purpose, we create event catalogues of BNS mock events with DM fraction up to 1%, from which we reconstruct the posterior uncertainties with the Fisher matrix approach. Using this data, we perform joint Bayesian inference on the baryonic EOS, DM particle mass, and DM particle fraction in each event. Our results reveal that when falsely ignoring DM effects, the EOS posterior is biased towards softer EOSs, though the offset is rather small. Further, we find that within our assumptions of our DM model and population, ET will likely not be able to test the presence of DM in BNSs, even when combining many events and adding Cosmic Explorer (CE) to the next-generation detector network. Likewise, the potential constraints on the DM particle mass will remain weak because of degeneracies with the fraction and EOS.\n\n", "2408.14688": "2024-08-26, **Lowering threshold of NaI(Tl) scintillator to 0.7 keV in the COSINE-100 experiment**, G. H. Yu et.al., [2408.14688v1](http://arxiv.org/abs/2408.14688v1)\n\n COSINE-100 is a direct dark matter search experiment, with the primary goal of testing the annual modulation signal observed by DAMA/LIBRA, using the same target material, NaI(Tl). In previous analyses, we achieved the same 1 keV energy threshold used in the DAMA/LIBRA's analysis that reported an annual modulation signal with 11.6$\\sigma$ significance. In this article, we report an improved analysis that lowered the threshold to 0.7 keV, thanks to the application of Multi-Layer Perception network and a new likelihood parameter with waveforms in the frequency domain. The lower threshold would enable a better comparison of COSINE-100 with new DAMA results with a 0.75 keV threshold and account for differences in quenching factors. Furthermore the lower threshold can enhance COSINE-100's sensitivity to sub-GeV dark matter searches.\n\n", "2408.14614": "2024-08-26, **Cosmological Dynamics in Interacting Scalar-Torsion f(T,$φ$) Gravity: Investigating Energy and Momentum Couplings**, Carlos Rodriguez-Benites et.al., [2408.14614v1](http://arxiv.org/abs/2408.14614v1)\n\n We investigate the cosmological dynamics of a homogeneous scalar field non-minimally coupled to torsion gravity, which also interacts with cold dark matter through energy and momentum transfer. The matter and radiation perfect fluids are modeled using the Sorkin-Schutz formalism. We identify scaling regimes of the field during both the radiation and matter eras. Additionally, we discovered a field-dominated scaling attractor; however, it does not exhibit accelerated expansion, making it unsuitable for describing dark energy. Nevertheless, we find two attractor solutions that do exhibit accelerated expansion: one is a quintessence-like fixed point, and the other is a de Sitter fixed point.\n\n", "2408.14396": "2024-08-26, **Discovering an invisible Z' at the muon collider**, Anjan Kumar Barik et.al., [2408.14396v1](http://arxiv.org/abs/2408.14396v1)\n\n We show in this letter how a heavy $(\\mathcal{O}(TeV))$ invisible $Z'$ gauge boson that will practically be out of reach of the Large Hadron Collider (LHC), can be discovered at the future muon collider. The new force carrier has a relatively stronger coupling with the beyond standard model (BSM) sector, while its interaction with the SM fields is much weaker. This weaker coupling is induced through mixing mechanisms, specifically via gauge kinetic mixing and the $Z-Z'$ mixing. We consider a scenario where the new gauge boson decays mostly to charge-neutral long-lived particles and/or dark matter (DM). We show how producing and detecting this heavier invisible $Z'$, that will be beyond the reach of even the very high luminosity LHC, becomes possible if it is produced in association with an energetic photon at the future muon collider. The on-shell production of the $Z'$ will lead to a peak in the photon energy distribution, following the so-called radiative return phenomena and can lead to the accurate determination of the $Z'$ mass and its interaction with SM particles.\n\n", "2408.14353": "2024-08-26, **Constraints on primordial black holes in dSphs using radio observations**, Tian-Ci Liu et.al., [2408.14353v1](http://arxiv.org/abs/2408.14353v1)\n\n Primordial black holes (PBHs) are hypothetical objects formed at the early epoch of the universe, which could be a type of dark matter (DM) candidate without the need for new particles. The abundance of PBH DM has been constrained strictly by many observations.In this work, with the radio observations of Fornax and Segue I, we constrain the abundance of PBH in dwarf spheroidal galaxies through the synchrotron self-Compton (SSC) effect of Hawking radiation electrons. By selecting optimal sources, we obtain the constraints on the fraction of PBH DM down to $\\sim10^{-3}$ for Segue I and $\\sim10^{-5}$ for Fornax at asteroidal mass. We also predict that, with 100 hours of future observation by the Square Kilometer Array, the SSC approach could place constraints comparable to the current strictest results for PBHs of $<5\\times10^{15}\\,{\\rm g}$. Better projected constraints can be obtained by including the inverse Compton scattering on cosmic microwave background photons.\n\n", "2408.14287": "2024-08-26, **Cosmology and nuclear-physics implications of a subsolar gravitational-wave event**, Francesco Crescimbeni et.al., [2408.14287v1](http://arxiv.org/abs/2408.14287v1)\n\n Detecting a compact subsolar object would have profound implications in physics, the reach of which depends on the nature of the object. Here we explore such consequences for a putative subsolar-mass gravitational wave event detected by the LIGO-Virgo-KAGRA Collaboration. We forecast that the nature of a subsolar binary (made of light neutron stars, primordial black holes, or more exotic compact objects) can be inferred with a great statistical confidence level already during the ongoing fourth observing run, based on the large tidal deformability effects on the signal. The detection of a primordial black hole would have implications for cosmology and dark matter scenarios, while the measurement of the tidal deformability of a subsolar neutron star could rule out or confirm the existence of strange stars made of quarks.\n\n", "2408.14245": "2024-08-26, **GALPs! Composite heavy axion-like Dark Matter**, Pierluca Carenza et.al., [2408.14245v1](http://arxiv.org/abs/2408.14245v1)\n\n We propose a novel class of Dark Matter (DM) candidates in the form of a heavy composite Axion-Like Particle (ALP) with highly suppressed electromagnetic interactions, being stable even for masses exceeding the GeV scale. We argue that such a composite ALP emerges as a bound state -- the dark glueball -- due to confinement in a pure Yang-Mills dark sector. In a minimal ultraviolet complete QCD-like model, cosmological production of dark gluons as well as photons occurs via heavy fermion annihilation which effectively reheats both the dark and visible sectors setting up their temperature scales. Furthermore, effective interactions between glueballs and photons, resembling those of standard ALPs, are radiatively generated by heavy fermion loops. Consequently, DM glueballs interacting with photons are dubbed `Glueball ALPs' (GALPs). We uncover novel phenomenology of GALPs focusing on their unique astrophysical and cosmological signatures.\n\n", "2408.14071": "2024-08-26, **Benchmarking the design of the cryogenics system for the underground argon in DarkSide-20k**, DarkSide-20k Collaboration et.al., [2408.14071v1](http://arxiv.org/abs/2408.14071v1)\n\n DarkSide-20k (DS-20k) is a dark matter detection experiment under construction at the Laboratori Nazionali del Gran Sasso (LNGS) in Italy. It utilises ~100 t of low radioactivity argon from an underground source (UAr) in its inner detector, with half serving as target in a dual-phase time projection chamber (TPC). The UAr cryogenics system must maintain stable thermodynamic conditions throughout the experiment's lifetime of >10 years. Continuous removal of impurities and radon from the UAr is essential for maximising signal yield and mitigating background. We are developing an efficient and powerful cryogenics system with a gas purification loop with a target circulation rate of 1000 slpm. Central to its design is a condenser operated with liquid nitrogen which is paired with a gas heat exchanger cascade, delivering a combined cooling power of >8 kW. Here we present the design choices in view of the DS-20k requirements, in particular the condenser's working principle and the cooling control, and we show test results obtained with a dedicated benchmarking platform at CERN and LNGS. We find that the thermal efficiency of the recirculation loop, defined in terms of nitrogen consumption per argon flow rate, is 95 % and the pressure in the test cryostat can be maintained within $\\pm$(0.1-0.2) mbar. We further detail a 5-day cool-down procedure of the test cryostat, maintaining a cooling rate typically within -2 K/h, as required for the DS-20k inner detector. Additionally, we assess the circuit's flow resistance, and the heat transfer capabilities of two heat exchanger geometries for argon phase change, used to provide gas for recirculation. We conclude by discussing how our findings influence the finalisation of the system design, including necessary modifications to meet requirements and ongoing testing activities.\n\n", "2408.14020": "2024-08-26, **Implications of Fermionic Dark Matter Interactions on Anisotropic Neutron Stars**, Premachand Mahapatra et.al., [2408.14020v1](http://arxiv.org/abs/2408.14020v1)\n\n The presence of Dark matter (DM) within a neutron star (NS) can substantially influence the macroscopic properties. It is commonly assumed that the pressure inside an NS is isotropic, but in reality, pressure is locally anisotropic. This study explores the properties of anisotropic NS with a subfraction of DM (isotropic) trapped inside. Implementing a two-fluid formalism with three Equations of State (EOS): AP3 (a realistic nucleon-nucleon interaction model), BSk22 (modeling atomic nuclei and neutron-matter), and MPA1 (considering relativistic effects in nuclear interactions). The properties of NS, such as mass ($M$), radius ($R$), and dimensionless tidal deformability ($\\Lambda$), for various DM-anisotropic configurations, have been rigorously tested against observational constraints. These constraints include data from the binary NS merger GW170817, NICER x-ray measurements, and pulsar mass-radius observations. We observe that with increasing DM subfraction, higher anisotropies could also satisfy the observational constraints. Furthermore, increasing the coupling ($g$) between DM and its mediator leads to the formation of a core-halo structure, with a DM halo surrounding the baryonic matter (BM). Specifically, for coupling values of $g = 10^{-4}$, $10^{-3.7}$, and $10^{-3.5}$, we observe that the maximum radius ($R\\_{max}$) decreases with increasing anisotropy, which contrasts with the behavior at $g = 10^{-5}$ and in scenarios with no DM. Our analysis indicates that binary pulsar systems could potentially constrain the extent of admixed anisotropic NS or, more optimistically, provide evidence for the existence of DM-admixed anisotropic NS.\n\n"}, "supernova": {"2408.15175": "2024-08-27, **A Yebes W band Line Survey towards an Unshocked Molecular Cloud of Supernova Remnant 3C391: Evidence of Cosmic-Ray-Induced Chemistry**, Tian-Yu Tu et.al., [2408.15175v1](http://arxiv.org/abs/2408.15175v1)\n\n Cosmic rays (CRs) have strong influences on the chemistry of dense molecular clouds (MCs). To study the detailed chemistry induced by CRs, we conducted a Yebes W band line survey towards an unshocked MC (which we named as 3C391:NML) associated with supernova remnant (SNR) 3C391. We detected emission lines of 18 molecular species in total and estimated their column densities with local thermodynamic equilibrium (LTE) and non-LTE analysis. Using the abundance ratio N(HCO+)/N(CO) and an upper limit of N(DCO+)/N(HCO+), we estimated the CR ionization rate of 3C391:NML is $\\zeta\\gtrsim 2.7\\times 10^{-14}\\rm \\ s^{-1}$ with an analytic method. However, we caution on adopting this value because chemical equilibrium, which is a prerequisite of using the equations, is not necessarily reached in 3C391:NML. We observed lower N(HCO+)/N(HOC+), higher N(HCS+)/N(CS), and higher X($l$-C3H+) by an order of magnitude in 3C391:NML than the typical values in quiescent dense MCs. We found that an enhanced CR ionization rate (of order $\\sim 10^{-15}$ or $\\sim 10^{-14}\\rm \\ s^{-1}$) is needed to reproduce the observation with chemical model. This is higher than the values found in typical MCs by 2--3 orders of magnitude.\n\n", "2408.15086": "2024-08-27, **Sample of hydrogen-rich superluminous supernovae from the Zwicky Transient Facility**, P. J. Pessi et.al., [2408.15086v1](http://arxiv.org/abs/2408.15086v1)\n\n Hydrogen-rich superluminous supernovae (SLSNe II) are rare. The exact mechanism producing their extreme light curve peaks is not understood. Analysis of single events and small samples suggest that CSM interaction is the main responsible for their features. However, other mechanisms can not be discarded. Large sample analysis can provide clarification. We aim to characterize the light curves of a sample of 107 SLSNe II to provide valuable information that can be used to validate theoretical models. We analyze the gri light curves of SLSNe II obtained through ZTF. We study peak absolute magnitudes and characteristic timescales. When possible we compute g-r colors, pseudo-bolometric light curves, and estimate lower limits for their total radiated energy. We also study the luminosity distribution of our sample and estimate the percentage of them that would be observable by the LSST. Finally, we compare our sample to other H-rich SNe and to H-poor SLSNe I. SLSNe II are heterogeneous. Their median peak absolute magnitude is -20.3 mag in optical bands. Their rise can take from two weeks to over three months, and their decline from twenty days to over a year. We found no significant correlations between peak magnitude and timescales. SLSNe II tend to show fainter peaks, longer declines and redder colors than SLSNe I. We present the largest sample of SLSNe II light curves to date, comprising of 107 events. Their diversity could be explained by considering different CSM morphologies. Although, theoretical analysis is needed to explore alternative scenarios. Other luminous transients, such as Active Galactic Nuclei, Tidal Disruption Events or SNe Ia-CSM, can easily become contaminants. Thus, good multi-wavelength light curve coverage becomes paramount. LSST could miss 30 percent of the ZTF events in the its footprint in gri bands. Redder bands become important to construct complete samples.\n\n", "2408.15017": "2024-08-27, **Unveiling the central engine of core-collapse supernovae in the Local Universe: NS or BH?**, Maurice H. P. M. van Putten et.al., [2408.15017v1](http://arxiv.org/abs/2408.15017v1)\n\n The physical trigger powering supernovae following the core collapse of massive stars is believed to involve a neutron star (NS) or a black hole (BH), depending largely on progenitor mass. A potentially distinct signature is a long-duration gravitational wave (GW) burst from BH central engines by their ample energy reservoir $E\\_J$ in angular momentum, far more so than an NS can provide. A natural catalyst for this radiation is surrounding high-density matter in the form of a non-axisymmetric disk or torus. Here, we derive a detailed outlook on LVK probes of core-collapse supernovae CC-SNe during the present observational run O4 based on their event rate, an association with normal long GRBs and mass-scaling of GW170817B/GRB170817A. For BH central engines of mass $M$, GW170817B predicts a descending GW-chirp of energy ${\\cal E}\\_{GW}\\simeq 3.5\\% M\\_\\odot c^2 \\left(M/M\\_0\\right)$ at frequency $f\\_{GW}\\lesssim 700\\,{\\rm Hz}\\left(M\\_0/M\\right)$, where $M\\_0\\simeq 2.8\\,M\\_\\odot$. For a few tens of events per year well into the Local Universe within 50-100Mpc, probes at the detector-limited sensitivity are expected to break the degeneracy between their NS or BH central engines {by GW calorimetry.\n\n", "2408.14878": "2024-08-27, **Analysing Hubble Tension and Gravitational Waves for $f(Q,T)$ Gravity Theories**, Shreya Banerjee et.al., [2408.14878v1](http://arxiv.org/abs/2408.14878v1)\n\n In this work, we examine viable models of $f(Q,T)$ gravity theories against observational data with the aim to constrain the parameter space of these models. We have analysed five different models of $f(Q,T)$ gravity and tested them against Type Ia supernovae, Cosmic Chronometer data, Baryon Acoustic Oscillations data and Pantheon data. We put stringent constraints on the $f(Q,T)$ gravity models, $f(Q,T) = Q^{n} +\\beta T$ $(n=1,2,3)$, $f(Q,T)=-\\alpha Q-\\beta T^{2}$ and $f(Q,T)=Q^{-2}T^{2}$ along with other cosmological parameters such as deceleration parameter, equation of state parameter and demonstrate their alignment with the $\\Lambda CDM$ model and the observational data. We show that these models have the capability to alleviate the Hubble tension, by predicting the present value of the Hubble parameter close to $74$km/s/Mpc. $f(Q,T)$ gravity theory introduces alterations in the background evolution and imposes a friction term in the propagation of gravitational waves, this phenomenon has also been examined. We have shown their agreement with the Gravitational Wave (GW) luminosity distance with the Electromagnetic (EM) counter part data from Advanced LIGO and Advanced VIRGO across different observing runs capturing coalescence of Binary Neutron Stars (BNS), mergers of Binary Black Holes (BBHs), and Neutron Star-Black Hole (NSBH) binaries with EM counterparts.\n\n", "2408.14787": "2024-08-27, **Constraints on Redshift-Binned Dark Energy using DESI BAO Data**, Ye-Huang Pang et.al., [2408.14787v1](http://arxiv.org/abs/2408.14787v1)\n\n We parameterize the equation of state of late-time dark energy as $w\\_{\\mathrm{bin}}(z)$, with three redshift bins, characterized by a constant equation of state in each bin. Then, we constrain the parameters of the $w\\_{\\mathrm{bin}}$CDM model using datasets from DESI BAO data, Planck CMB power spectrum, ACT DR6 lensing power spectrum, and type Ia supernova distance-redshift data of Pantheon Plus/DES Y5/Union3. The significances for $w\\_1>-1$ is $1.9\\sigma$, $2.6\\sigma$ and $3.3\\sigma$, and $w\\_2$ is consistent with $-1$ within $1\\sigma$ level, while $1.6\\sigma$, $1.5\\sigma$ and $1.5\\sigma$ for $w\\_3<-1$ in these three data combinations with different choices of type Ia supernova datasets, respectively. Additionally, to alleviate $H\\_0$ tension, we incorporate the early dark energy (EDE) model in the early-time universe and add the SH0ES absolute magnitude $M\\_b$ prior (or $H\\_0$ prior) to further constrain the $w\\_{\\mathrm{bin}}$EDE model. In the $w\\_{\\mathrm{bin}}$EDE model, we find a $w\\_{\\mathrm{bin}}(z)$ pattern similar to that in the $w\\_{\\mathrm{bin}}$CDM model. The results of the three data combinations exhibit $w\\_1>-1$ at $1.9\\sigma$, $1.7\\sigma$ and $2.9\\sigma$ level, meanwhile $w\\_3<-1$ at $1.3\\sigma$, $1.3\\sigma$ and $1.3\\sigma$ level, respectively. In all, our results indicate that the transition of dark energy from phantom at high redshifts to quintessence at low redshifts is not conclusive.\n\n", "2408.14605": "2024-08-26, **New supernova remnant candidates in the LOFAR Two Metre Sky Survey**, K. Tsalapatas et.al., [2408.14605v1](http://arxiv.org/abs/2408.14605v1)\n\n In spite of their key role in galaxy evolution and several decades of observational efforts, the census of supernova remnants (SNRs) in our Galaxy remains incomplete. Theoretical predictions based on the local supernova rate estimate the expected number of SNRs in the Galaxy to be $\\gtrsim$ 1000. By contrast, the number of detected SNRs amounts to about 300. High-resolution, wide-area radio surveys at low frequencies are ideal tools with which to find missing SNRs, given the prominence of these sources at low radio frequencies. We aim to find missing SNRs using proprietary data from the LOFAR Two-Metre Sky Survey (LoTSS) at 144~MHz. We used LoTSS total intensity maps of two Galactic regions, one with $39^\\mathrm{o} < l < 66^\\mathrm{o}$ and $\\|b\\|< 2.5^\\mathrm{o}$, and the other with $145^\\mathrm{o} < l < 150^\\mathrm{o}$ and $\\|b\\| < 3^\\mathrm{o}$, in addition to mid-infrared (MIR) data from the Wide-field Infrared Survey Explorer (WISE) all-sky survey to search for SNR candidates. We report the discovery of 14 new SNR candidates selected on the basis of their morphology at 144 MHz and a lack of MIR emission. We also follow up on 24 previously reported SNR candidates, inferring their spectral index between the LoTSS frequency (144 MHz) and the frequency at which they were reported. The high resolution and sensitivity of LoTSS observations has resulted in the detection of 14 new SNR candidates. In order to unambiguously confirm the SNR nature of these candidates, follow-up X-ray observations are required with facilities such as eROSITA.\n\n", "2408.14592": "2024-08-26, **Massive star cluster formation III. Early mass segregation during cluster assembly**, Brooke Polak et.al., [2408.14592v1](http://arxiv.org/abs/2408.14592v1)\n\n Mass segregation is seen in many star clusters, but whether massive stars form in the center of a cluster or migrate there dynamically is still debated. N-body simulations have shown that early dynamical mass segregation is possible when sub-clusters merge to form a dense core with a small crossing time. However, the effect of gas dynamics on both the formation and dynamics of the stars could inhibit the formation of the dense core. We aim to study the dynamical mass segregation of star cluster models that include gas dynamics and self-consistently form stars from the dense substructure in the gas. Our models use the Torch framework, which is based on AMUSE and includes stellar and magnetized gas dynamics, as well as stellar evolution and feedback from radiation, stellar winds, and supernovae. Our models consist of three star clusters forming from initial turbulent spherical clouds of mass $10^{4,5,6}\\rm~M\\_\\odot$ and radius $11.7\\rm~pc$ that have final stellar masses of $3.6\\times10^3\\rm~M\\_\\odot$, $6.5\\times10^4\\rm~M\\_\\odot$, and $8.9\\times10^5\\rm~M\\_\\odot$, respectively. There is no primordial mass segregation in the model by construction. All three clusters become dynamically mass segregated at early times via collapse confirming that this mechanism occurs within sub-clusters forming directly out of the dense substructure in the gas. The dynamics of the embedded gas and stellar feedback do not inhibit the collapse of the cluster. We find that each model cluster becomes mass segregated within $2~$Myr of the onset of star formation, reaching the levels observed in young clusters in the Milky Way. However, we note that the exact values are highly time-variable during these early phases of evolution. Massive stars that segregate to the center during core collapse are likely to be dynamically ejected, a process that can decrease the overall level of mass segregation again.\n\n", "2408.14586": "2024-08-26, **Optical and Radio Analysis of Systemically Classified Broad-lined Type Ic Supernovae from the Zwicky Transient Facility**, Gokul P. Srinivasaragavan et.al., [2408.14586v1](http://arxiv.org/abs/2408.14586v1)\n\n We study a magnitude-limited sample of 36 Broad-lined Type Ic Supernovae (SNe Ic-BL) from the Zwicky Transient Facility Bright Transient Survey, detected between March 2018 and August 2021. We present the light curves (LCs) for each of the SNe, and analyze the shape of the LCs to derive empirical parameters, along with the explosion epochs for every event. The sample has an average absolute peak magnitude in the r band of $M\\_r^{max}$ = -18.51 $\\pm$ 0.15 mag. Using spectra obtained around peak light, we compute expansion velocities from the Fe II 5169 Angstrom line for each event with high enough signal-to-noise ratio spectra, and find an average value of $v\\_{ph}$ = 16,100 $\\pm$ 1,100 km $s^{-1}$. We also compute bolometric LCs, study the blackbody temperature and radii evolution over time, and derive the explosion properties of the SNe. The explosion properties of the sample have average values of $M\\_{Ni}$ = $0.37\\_{-0.06}^{+0.08}$ solar masses, $M\\_{ej}$ = $2.45\\_{-0.41}^{+0.47}$ solar masses, and $E\\_K$= $4.02\\_{-1.00}^{+1.37} \\times 10^{51}$ erg. Thirteen events have radio observations from the Very Large Array, with 8 detections and 5 non-detections. We find that the populations that have radio detections and radio non-detections are indistinct from one another with respect to their optically-inferred explosion properties, and there are no statistically significant correlations present between the events' radio luminosities and optically-inferred explosion properties. This provides evidence that the explosion properties derived from optical data alone cannot give inferences about the radio properties of SNe Ic-BL, and likely their relativistic jet formation mechanisms.\n\n", "2408.14573": "2024-08-26, **Deep Einstein@Home search for Continuous Gravitational Waves from the Central Compact Objects in the Supernova Remnants Vela Jr. and G347.3-0.5 using LIGO public data**, Jing Ming et.al., [2408.14573v1](http://arxiv.org/abs/2408.14573v1)\n\n We perform a search for continuous nearly monochromatic gravitational waves from the central compact objects associated with the supernova remnants Vela Jr. and G347.3 using LIGO O2 and O3 public data. Over $10^{18}$ different waveforms are considered, covering signal frequencies between 20-1300 Hz (20-400 Hz) for G347.3-0.5 (Vela Jr) and a very broad range of frequency derivatives. Thousands of volunteers donating compute cycles through the computing project Einstein@Home have made this endeavour possible. Following the Einstein@Home search, we perform multi-stage follow-ups of over 5 million waveforms. The selection threshold is set so that a signal could be confirmed using the first half of the LIGO O3 data. We find no significant signal candidate for either targets. Based on this null result, for G347.3-0.5, we set the most constraining upper limits to date on the amplitude of gravitational wave signals, corresponding to deformations below $10^{-6}$ in a large part of the search band. At the frequency of best strain sensitivity, near $161$ Hz, we set 90\\%\\ confidence upper limits on the gravitational wave intrinsic amplitude of $h\\_0^{90\\%}\\approx 6.2\\times10^{-26}$. Over most of the frequency range our upper limits are a factor of 10 smaller than the indirect age-based upper limit. For Vela Jr., near $163$ Hz, we set $h\\_0^{90\\%}\\approx 6.4\\times10^{-26}$. Over most of the frequency range our upper limits are a factor of 15 smaller than the indirect age-based upper limit. The Vela Jr. upper limits presented here are slightly less constraining than the most recent upper limits of \\cite{ligo\\_o3a\\_c\\_v} but they apply to a broader set of signals.\n\n", "2408.14560": "2024-08-26, **The Impact from Galaxy Groups on Cosmological Measurements with Type Ia Supernovae**, Erik R. Peterson et.al., [2408.14560v1](http://arxiv.org/abs/2408.14560v1)\n\n At the low-redshift end ($z<0.05$) of the Hubble diagram with Type Ia Supernovae (SNe Ia), the contribution to Hubble residual scatter from peculiar velocities is of similar size to that due to the standardization of the SN Ia light curve. A way to improve the redshift measurement of the SN host galaxy is to utilize the average redshift of the galaxy group, effectively averaging over small-scale/intracluster peculiar velocities. One limiting factor is the fraction of SN host galaxies in galaxy groups, previously found to be 30% using (relatively incomplete) magnitude-limited galaxy catalogs. Here, we do the first analysis of N-body simulations to predict this fraction, finding $\\sim$66% should have associated groups and group averaging should improve redshift precision by $\\sim$120 km s$^{-1}$. Furthermore, using spectroscopic data from the Anglo-Australian Telescope, we present results from the first pilot program to evaluate whether or not 23 previously unassociated SN Ia hosts belong in groups. We find that 91% of these candidates can be associated with groups, consistent with predictions from simulations given the sample size. Combining with previously assigned SN host galaxies in Pantheon+, we demonstrate improvement in Hubble residual scatter equivalent to 145 km s$^{-1}$, also consistent with simulations. For new and upcoming low-$z$ samples from, for example, the Zwicky Transient Facility and the Rubin Observatory's Legacy Survey of Space and Time, a separate follow-up program identifying galaxy groups of SN hosts is a highly cost-effective way to enhance their constraining power.\n\n", "2408.14537": "2024-08-26, **Confronting Cold New Early Dark Energy and its Equation of State with Updated CMB and Supernovae Data**, Aleksandr Chatrchyan et.al., [2408.14537v1](http://arxiv.org/abs/2408.14537v1)\n\n Cold New Early Dark Energy (Cold NEDE) addresses the Hubble tension through a triggered vacuum phase transition in the dark sector. In this paper, we constrain a phenomenological fluid model using recent cosmic microwave background likelihoods based on Planck NPIPE data alongside baryonic acoustic oscillations and supernovae data from Pantheon+. Exploiting the enhanced constraining power of the datasets, we introduce and study an extended version of the NEDE fluid model in which the equation of state parameter $w\\_\\mathrm{NEDE}$, characterizing the post-phase transition fluid, is allowed to evolve with non-vanishing derivatives ${d}w\\_\\mathrm{NEDE}/d\\ln a$ and ${d^2}w\\_\\mathrm{NEDE}/{d}(\\ln a)^2$. Our results indicate that data is compatible with a rather simple time dependence that could arise from a mixture of radiation and a stiff fluid. With the updated datasets, the base and extended models still show a significant reduction of the DMAP tension from $6.3 \\sigma$ in $\\Lambda$CDM down to $3.5\\sigma$ with a small simultaneous reduction of the $S\\_8$ tension, slightly improving over recent findings for the axion-like early dark energy model.\n\n", "2408.14351": "2024-08-26, **Can supernova from runaway stars mimic the signs of absorbing `super-virial' gas?**, Mukesh Singh Bisht et.al., [2408.14351v1](http://arxiv.org/abs/2408.14351v1)\n\n The recent detection of large column density absorption lines from highly ionized gas in a few directions through the circumgalactic medium (CGM) of the Milky Way (MW) has been puzzling. The inferred temperature from these absorption lines far exceeds the virial temperature of the MW, and the column densities are also too large to be easily explained. In this paper, we propose a novel idea to explain these observations and claim that they may not have originated from the CGM, but from a totally different type of source, namely, stellar ejecta from supernovae (SNe) above the Galactic disk that happen to lie in the line of sight to the background quasars. About $\\sim 20\\%$ of massive OB stars (progenitors of core-collapse supernovae) are known to be runaway stars that have high ejection velocities near the Galactic plane and can end up exploding as SNe above the Galactic disk. We show that the associated reverse shock in the supernova remnant in the early non-radiative phase can heat the ejecta to temperatures of $\\gtrsim 10^7\\,{\\rm K}$ and can naturally explain the observed high column density of ions in the observed `super-virial' phase along with $\\alpha$-enriched super-solar abundance that is typical of core-collapse supernovae. However, SNe from runaway stars has a covering fraction of $\\lesssim 0.7 \\%$ and thus can only explain the observations along limited sightlines.\n\n", "2408.14301": "2024-08-26, **The XRISM First Light Observation: Velocity Structure and Thermal Properties of the Supernova Remnant N132D**, XRISM Collaboration et.al., [2408.14301v1](http://arxiv.org/abs/2408.14301v1)\n\n We present an initial analysis of the XRISM first-light observation of the supernova remnant (SNR) N132D in the Large Magellanic Cloud. The Resolve microcalorimeter has obtained the first high-resolution spectrum in the 1.6-10 keV band, which contains K-shell emission lines of Si, S, Ar, Ca, and Fe. We find that the Si and S lines are relatively narrow, with a broadening represented by a Gaussian-like velocity dispersion of $\\sigma\\_v \\sim 450$ km s$^{-1}$. The Fe He$\\alpha$ lines are, on the other hand, substantially broadened with $\\sigma\\_v \\sim 1670$ km s$^{-1}$. This broadening can be explained by a combination of the thermal Doppler effect due to the high ion temperature and the kinematic Doppler effect due to the SNR expansion. Assuming that the Fe He$\\alpha$ emission originates predominantly from the supernova ejecta, we estimate the reverse shock velocity at the time when the bulk of the Fe ejecta were shock heated to be $-1000 \\lesssim V\\_{\\rm rs}~[{\\rm km s}^{-1}] \\lesssim 3300$ (in the observer frame). We also find that Fe Ly$\\alpha$ emission is redshifted with a bulk velocity of $\\sim 890$ km s$^{-1}$, substantially larger than the radial velocity of the local interstellar medium surrounding N132D. These results demonstrate that high-resolution X-ray spectroscopy is capable of providing constraints on the evolutionary stage, geometry, and velocity distribution of SNRs.\n\n"}}