{"neutrino": {"2304.12675": "2023-04-25, **Search for correlations of high-energy neutrinos detected in IceCube with radio-bright AGN and gamma-ray emission from blazars**, R. Abbasi et.al., [2304.12675v1](http://arxiv.org/abs/2304.12675v1)\n\n The IceCube Neutrino Observatory sends realtime neutrino alerts with high probability of being astrophysical in origin. We present a new method to correlate these events and possible candidate sources using $2,089$ blazars from the Fermi-LAT 4LAC-DR2 catalog and with $3,413$ AGNs from the Radio Fundamental Catalog. No statistically significant neutrino emission was found in any of the catalog searches. The result is compatible with a small fraction, $<1$%, of AGNs being neutrino emitters and prior evidence for neutrino emission presented by IceCube and other authors from sources such as TXS 0506+056 and PKS 1502+06. We also present cross-checks to other analyses that claim a significant correlation using similar data samples, and we find that adding more information on the neutrino events and more data overall makes the result compatible with background.\n\n", "2304.12546": "2023-04-25, **Analyzing the time spectrum of supernova neutrinos to constrain their effective mass or Lorentz Invariance Violation**, C. A. Moura et.al., [2304.12546v1](http://arxiv.org/abs/2304.12546v1)\n\n We analyze the expected arrival time spectrum of supernova neutrinos using simulated luminosity and computing the expected number of events in future detectors such as the DUNE Far Detector and Hyper-Kamiokande. We develop a general method using minimum square statistics that can compute the sensitivity to any variable affecting neutrino time of flight. We apply this method in two different situations: First, we compare the time spectrum changes due to different neutrino mass values to put limits in electron (anti)neutrino effective mass. Second, we constrain Lorentz Invariance Violation through the mass scale, $M\\_{QG}$, at which it would occur. We consider two main neutrino detection techniques: 1. DUNE-like liquid argon TPC, for which the main detection channel is $\\nu\\_e +\\, ^{40}\\mbox{Ar} \\rightarrow e^- +\\, ^{40}\\mbox{K}^*$, related to the supernova neutronization burst, and 2. HyperK-like water Cherenkov detector, for which $\\bar \\nu\\_e + p \\rightarrow e^+ + n$ is the main detection channel. We consider a fixed supernova distance of 10~kpc and two different masses of the progenitor star: (i) 15~$M\\_\\odot$ with neutrino emission time up to 0.3~s and (ii) 11.2~$M\\_\\odot$ with neutrino emission time up to 10~s.The best mass limits at 3$\\sigma$ are of $\\mathcal{O}(1)$~eV. For $\\nu\\_e$, the best limit comes from a DUNE-like detector if the mass ordering happens to be inverted. For $\\bar \\nu\\_e$, the best limit comes from a HyperK-like detector. The best limit for the Lorentz Invariance Violation mass scale at 3$\\sigma$ level, considering superluminal or subluminal effect, is $M\\_{QG} \\gtrsim 10^{13}$~GeV ($M\\_{QG} \\gtrsim 5 \\times 10^{5}$~GeV) for linear (quadratic) energy dependence.\n\n", "2304.12538": "2023-04-25, **Thermal neutrino self-energy beyond the contact approximation**, Andrea Erdas et.al., [2304.12538v1](http://arxiv.org/abs/2304.12538v1)\n\n Using the Schwinger proper time method I calculate exactly the bubble diagram contribution to the thermal neutrino self-energy, obtaining exact results that cannot be achieved using the contact approximation. These results allow me to obtain the dispersion relation for neutrino in a medium under several different conditions.\n\n", "2304.12527": "2023-04-25, **Type-II Majoron Dark Matter**, Carla Biggio et.al., [2304.12527v1](http://arxiv.org/abs/2304.12527v1)\n\n We discuss in detail the possibility that the \"type-II majoron\" -- that is, the pseudo Nambu-Goldstone boson that arises in the context of the type-II seesaw mechanism if the lepton number is spontaneously broken by an additional singlet scalar -- account for the dark matter (DM) observed in the universe. We study the requirements the model's parameters have to fulfill in order to reproduce the measured DM relic abundance through two possible production mechanisms in the early universe, freeze-in and misalignment, both during a standard radiation-dominated era and early matter domination. We then study possible signals of type-II majoron DM and the present and expected constraints on the parameter space that can be obtained from cosmological observations, direct detection experiments, and present and future searches for decaying DM at neutrino telescopes and cosmic-ray experiments. We find that -- depending on the majoron mass, the production mechanism, and the value of the vacuum expectation value of the type-II triplet -- all of the three decay modes (photons, electrons, neutrinos) of majoron DM particles can yield observable signals at future indirect searches for DM. Furthermore, in a corner of the parameter space, detection of majoron DM is possible through electron recoil at running and future direct detection experiments.\n\n", "2304.12338": "2023-04-24, **The MillenniumTNG Project: The impact of baryons and massive neutrinos on high-resolution weak gravitational lensing convergence maps**, Fulvio Ferlito et.al., [2304.12338v1](http://arxiv.org/abs/2304.12338v1)\n\n We study weak gravitational lensing convergence maps produced from the MillenniumTNG (MTNG) simulations by direct projection of the mass distribution on the past backwards lightcone of a fiducial observer. We explore the lensing maps over a large dynamic range in simulation mass and angular resolution, allowing us to establish a clear assessment of numerical convergence. By comparing full physics hydrodynamical simulations with corresponding dark-matter-only runs we quantify the impact of baryonic physics on the most important weak lensing statistics. Likewise, we predict the impact of massive neutrinos reliably far into the non-linear regime. We also demonstrate that the \"fixed & paired\" variance suppression technique increases the statistical robustness of the simulation predictions on large scales not only for time slices but also for continuously output lightcone data. We find that both baryonic and neutrino effects substantially impact weak lensing shear measurements, with the latter dominating over the former on large angular scales. Thus, both effects must explicitly be included to obtain sufficiently accurate predictions for stage IV lensing surveys. Reassuringly, our results agree accurately with other simulation results where available, supporting the promise of simulation modelling for precision cosmology far into the non-linear regime.\n\n", "2304.12316": "2023-04-24, **Constraining the onset density for the QCD phase transition with the neutrino signal from core-collapse supernovae**, Noshad Khosravi Largani et.al., [2304.12316v1](http://arxiv.org/abs/2304.12316v1)\n\n The occurrence of a first-order hadron-quark matter phase transition at high baryon densities is investigated in astrophysical simulations of core-collapse supernovae, to decipher yet incompletely understood properties of the dense matter equation of state using neutrinos from such cosmic events. It is found that the emission of a non-standard second neutrino burst, dominated by electron-antineutrinos, is not only a measurable signal for the appearance of deconfined quark matter but also reveals information about the state of matter at extreme conditions encountered at the supernova interior. To this end, a large set of spherically symmetric supernova models is investigated, studying the dependence on the equation of state and on the stellar progenitor. General relativistic neutrino-radiation hydrodynamics is employed featuring three-flavor Boltzmann neutrino transport and a microscopic hadron-quark hybrid matter equation of state class, that covers a representative range of parameters. This facilitates the direct connection between intrinsic signatures of the neutrino signal and properties of the equation of state. In particular, a set of novel relations have been found empirically. These potentially provide a constraint for the onset density of a possible QCD phase transition, which is presently one of the largest uncertainties in modern investigations of the QCD phase diagram, from the future neutrino observation of the next galactic core-collapse supernova.\n\n", "2304.12236": "2023-04-24, **Measurement of Atmospheric Neutrino Mixing with Improved IceCube DeepCore Calibration and Data Processing**, IceCube Collaboration et.al., [2304.12236v1](http://arxiv.org/abs/2304.12236v1)\n\n We describe a new data sample of IceCube DeepCore and report on the latest measurement of atmospheric neutrino oscillations obtained with data recorded between 2011-2019. The sample includes significant improvements in data calibration, detector simulation, and data processing, and the analysis benefits from a detailed treatment of systematic uncertainties, with significantly higher level of detail since our last study. By measuring the relative fluxes of neutrino flavors as a function of their reconstructed energies and arrival directions we constrain the atmospheric neutrino mixing parameters to be $\\sin^2\\theta\\_{23} = 0.51\\pm 0.05$ and $\\Delta m^2\\_{32} = 2.41\\pm0.07\\times 10^{-3}\\mathrm{eV}^2$, assuming a normal mass ordering. The resulting 40\\% reduction in the error of both parameters with respect to our previous result makes this the most precise measurement of oscillation parameters using atmospheric neutrinos. Our results are also compatible and complementary to those obtained using neutrino beams from accelerators, which are obtained at lower neutrino energies and are subject to different sources of uncertainties.\n\n", "2304.12153": "2023-04-24, **Analyzing the neutron and $γ$-ray emission properties of an americium-beryllium tagged neutron source**, Hiroshi Ito et.al., [2304.12153v1](http://arxiv.org/abs/2304.12153v1)\n\n Americium-beryllium (AmBe), a well-known tagged neutron source, is commonly used for evaluating the neutron detection efficiency of detectors used in ultralow background particle physics experiments, such as reactor neutrino and diffuse supernova neutrino background experiments. In particular, AmBe sources are used to calibrate neutron tagging by selecting the 4438-keV $\\gamma$-ray signal, which is simultaneously emitted with a neutron signal. Therefore, analyzing the neutron and $\\gamma$-ray emission properties of AmBe sources is crucial. In this study, we used the theoretical shape of a neutron energy spectrum, which was divided into three parts, to develop models of the energy spectrum and verify the results using experimental data. We used an AmBe source to measure the energy spectra of simultaneously emitted neutrons and $\\gamma$-rays and determine the emission ratio of the neutrons with and without $\\gamma$-ray emission. The measured spectrum was consistent with that obtained from the simulated result, whereas the measured emission ratio was significantly different from the corresponding simulated result. Here, we also discuss the feasibility of determining the neutron emission rates from the spectra divided into three parts.\n\n", "2304.12009": "2023-04-24, **Relativistic Configuration-interaction Density Functional Theory: Nuclear Matrix Elements for $ββ$ Decay**, Y. K. Wang et.al., [2304.12009v1](http://arxiv.org/abs/2304.12009v1)\n\n The relativistic configuration-interaction density functional theory is developed for even-even and odd-odd nuclei and is used to predict the nuclear matrix element of the neutrinoless $\\beta\\beta$ ($0\\nu\\beta\\beta$) decay in $^{76}$Ge, amongst the most promising $\\beta\\beta$-decay candidates. The spectroscopic properties of the $\\beta\\beta$-decay partners $^{76}$Ge and $^{76}$Se, and the nuclear matrix element governing the two-neutrino $\\beta\\beta$ ($2\\nu\\beta\\beta$) decay in $^{76}$Ge are well reproduced, providing solid benchmarks for the theoretical calculations. The inclusion of the triaxial degree of freedom slightly enhances the nuclear matrix element of the $2\\nu\\beta\\beta$ decay while raises that of the $0\\nu\\beta\\beta$ decay significantly by a factor around two. The present results highlight the importance of nuclear triaxial deformation for a better prediction of the $0\\nu\\beta\\beta$-decay nuclear matrix element.\n\n", "2304.11992": "2023-04-24, **Terzina on board NUSES: a pathfinder for EAS Cherenkov Light Detection from space**, Leonid Burmistrov et.al., [2304.11992v1](http://arxiv.org/abs/2304.11992v1)\n\n In this paper we introduce the Terzina telescope as a part of the NUSES space mission. This telescope aims to detect Ultra High Energy Cosmic Rays (UHECRs) through the Cherenkov light emission from the extensive air showers (EAS) that they create in the Earth's atmosphere. The Cherenkov photons are aligned along the shower axis inside about $\\sim 0.2-1^{\\circ}$, so that they become detectable by Terzina when it points towards the Earth's limb. A sun-synchronous orbit will allow the telescope to observe only the night side of the Earth's atmosphere. In this contribution, we focus on the description of the telescope detection goals, geometry, optical design and its photon detection camera composed of Silicon Photo-Multipliers (SiPMs). Moreover, we describe the full Monte Carlo simulation chain developed to estimate Terzina's performance for UHECR detection. The estimate of the radiation damage and light background rates, the readout electronics and trigger logic are briefly described. Terzina will be able to study the potential for future physics missions devoted to UHECR detection and to UHE neutrino astronomy. It is a pathfinder for missions like POEMMA or future constellations of similar satellites to NUSES.\n\n", "2304.12933": "2023-04-24, **Renormalization of Very Special Relativity gauge theories**, Jorge Alfaro et.al., [2304.12933v1](http://arxiv.org/abs/2304.12933v1)\n\n Mandelstam-Leibbrandt(ML) regularization of Very Special Relativity (VSR) amplitudes in momentum space depends on two fixed null vectors $n\\_\\mu,\\bar{n}\\_\\mu$ besides external momenta. ML is known to preserve gauge invariance and naive power counting. The second null vector $\\bar{n}\\_\\mu$ destroys the $Sim(2)$ symmetry of the VSR model. We devise a systematic procedure to take the $\\bar{n}\\_\\mu->0$ limit to recover the lost $Sim(2)$ symmetry. The procedure produces $Sim(2)$ and gauge invariant loop amplitudes. We show how to use this method to remove unphysical terms from the Non Relativistic Potential of Very Special Relativity Quantum Electrodynamics(VSR QED) with a massive photon. Then we compute the one loop renormalization of VSR QED. Finally we derive the anomalous magnetic moment of the electron, modified by neutrino and photon mass; and comments on the phenomenological implications.\n\n"}, "dark matter": {"2304.12621": "2023-04-25, **Evolution of Resonant Self-interacting Dark Matter Halos**, Ayuki Kamada et.al., [2304.12621v1](http://arxiv.org/abs/2304.12621v1)\n\n Recent analysis on the stellar kinematics of ultra-faint dwarf (UFD) galaxies has put a stringent upper limit on the self-scattering cross section of dark matter, i.e., $\\sigma/m<{\\cal O}(0.1)\\,{\\rm cm^2/g}$ at the scattering velocity of ${\\cal O}(10)\\,{\\rm km/s}$. Resonant self-interacting dark matter (rSIDM) is one possibility that can be consistent with the UFDs and explain the low central densities of rotation-supported galaxies; the cross section is resonantly enhanced to be $\\sigma/m = {\\cal O}(1)\\,{\\rm cm^2/g}$ around the scattering velocity of ${\\cal O}(100)\\,{\\rm km/s}$ while being suppressed at lower velocities. To further assess this possibility, since the inferred dark matter distribution of halos from astrophysical observations is usually compared to that in constant-cross section SIDM (cSIDM), whether the structures of rSIDM halos can be approximated by the cSIDM halo profiles needs to be clarified. In this work, we employ the grovothermal fluid method to investigate the structural evolution of rSIDM halos in a wide mass range. We find that except for halos in a specific mass range, the present structures of rSIDM halos are virtually indistinguishable from those of the cSIDM halos. For halos in the specific mass range, the resonant self-scattering renders a break in their density profile. We demonstrate how such a density-profile break appears in astrophysical observations, e.g., rotation curves and line-of-sight velocity dispersion profiles. We show that for halos above the specific mass range, the density-profile break thermalizes to disappear before the present. We demonstrate that such distinctive thermalization dynamics can leave imprints on the orbital classes of stars with similar ages and metallicities.\n\n", "2304.12613": "2023-04-25, **Can a variation of Fine Structure Constant influence the fate of Gravitational Collapse?**, Soumya Chakrabarti et.al., [2304.12613v1](http://arxiv.org/abs/2304.12613v1)\n\n We show that it is possible to steer clear of a spacetime singularity during gravitational collapse by considering the time-variation of a fundamental coupling, in this case, the fine structure constant {\\alpha}. We study a spherical distribution of cold dark matter coexisting with other fluid elements, collapsing under its own gravity. Dark matter is written as a scalar field interacting with electrically charged matter. This leads to a time variation of {\\alpha} and as a consequence, a breakdown of local charge conservation within the sphere. The exterior has no such field and therefore, Einstein's GR and standard equivalence principles remain valid. We derive the lowest possible bound on the collapse of this sphere beyond which there is a bounce and dispersal of most of the accumulated matter. We discuss the critical behavior of the system around this point and show that the bound is connected to a length scale of the order of Planck, introduced in theory for dimensional requirements.\n\n", "2304.12558": "2023-04-25, **Inflationary E-models revisited**, Daniel Frolovsky et.al., [2304.12558v1](http://arxiv.org/abs/2304.12558v1)\n\n The E-type $\\alpha$-attractor models of single-field inflation were generalized further in order to accommodate production of primordial black holes (PBH) via adding a near-inflection point to the inflaton scalar potential at smaller scales, in good agreement with measurements of the cosmic microwave background (CMB) radiation. A minimal number of new parameters was used but their fine-tuning was maximized in order to increase possible masses of PBH formed during an ultra-slow-roll phase leading to a large enhancement of the power spectrum of scalar (curvature) perturbations by 6 or 7 orders of magnitude against the power spectrum of perturbations observed in CMB. It was found that extreme fine-tuning of the parameters in our models can lead to a formation of the Earth-size PBH with the masses of approximately $10^{27}$ g, still in agreement with CMB observations. Quantum corrections are known to lead to the perturbative upper bound on the amplitude of large scalar perturbations responsible for PBH production. The quantum (one-loop) corrections in our models were found to be suppressed by one order of magnitude for PBH with the masses of approximately $10^{19}$ g, which may form the whole dark matter in the Universe.\n\n", "2304.12553": "2023-04-25, **Energy extraction from rotating hairy black hole via magnetic reconnection mechanism**, Zhen Li et.al., [2304.12553v1](http://arxiv.org/abs/2304.12553v1)\n\n The magnetic reconnection in the ergosphere has been shown to be a promising mechanism to extract energy from the rotating Kerr black hole. In this work, we investigate the role of magnetic reconnection in energy extraction from the newly suggested rotating hairy black holes which have an extra hair due to the additional surrounding sources, such as dark matter or dark energy. We examine how the hairy parameters characterized the hair affect the magnetic reconnection process in addition to other important variables of the magnetic reconnection process, including the parameter spaces that permit energy extraction, the power, efficiency and power ratios with respect to the Blandford-Znajek mechanism.\n\n", "2304.12407": "2023-04-24, **Exploring Models of Running Vacuum Energy with Viscous Dark Matter from a Dynamical System Perspective**, Norman Cruz et.al., [2304.12407v1](http://arxiv.org/abs/2304.12407v1)\n\n Running vacuum models and viscous dark matter scenarios beyond perfect fluid idealization are two appealing theoretical strategies that have been separately studied as alternatives to solve some problems rooted in the $\\Lambda$CDM cosmological model. In this paper, we combine these two notions in a single cosmological setting and investigate their cosmological implications, paying particular attention in the interplay between these two constituents in different cosmological periods. Specifically, we consider a well-studied running vacuum model inspired by renormalization group, and a recently proposed general parameterization for the bulk viscosity $\\xi$. By employing dynamical system analysis, we explore the physical aspects of the new phase space that emerges from the combined models and derive stability conditions that ensure complete cosmological dynamics. We identify four distinct classes of models and find that the critical points of the phase space are non-trivially renewed compared to the single scenarios. We then proceed, in a joint and complementary way to the dynamical system analysis, with a detailed numerical exploration to quantify the impact of both the running parameter and the bulk viscosity coefficient on the cosmological evolution. Thus, for some values of the model parameters, numerical solutions show qualitative differences from the $\\Lambda$CDM model, which is phenomenologically appealing in light of cosmological observations.\n\n", "2304.12362": "2023-04-24, **Charged resonances and MDM bound states at a multi-TeV muon collider**, Natascia Vignaroli et.al., [2304.12362v1](http://arxiv.org/abs/2304.12362v1)\n\n A multi-TeV muon collider proves to be very efficient not only for the search for new heavy neutral particles, but also for the discovery of charged bosons of the $W^\\prime$ type. We find that, by analyzing the associated production with a Standard Model W, charged resonances can be probed directly up to multi-TeV mass values close to the collision energy, and for very small couplings with the SM fermions, of the order of $10^{-3\\div 4}$ times smaller than the SM weak coupling. Additionally, charged bound states of WIMP Minimal Dark Matter can be discovered with low statistics by running above the kinematic threshold, at a center-of-mass energy just slightly above the mass of the MDM bound state. This opens up a very interesting possibility for the discovery of WIMPs, complementary to the search for the resonant production of the neutral MDM bound state component, which relies on an on-peak search, and, for 5-plet MDM, more efficient than the WIMP searches based on mono-X, missing-mass and disappearing tracks signatures.\n\n", "2304.12346": "2023-04-24, **The MillenniumTNG Project: Intrinsic alignments of galaxies and halos**, Ana Maria Delgado et.al., [2304.12346v1](http://arxiv.org/abs/2304.12346v1)\n\n The intrinsic alignment (IA) of observed galaxy shapes with the underlying cosmic web is a source of contamination in weak lensing surveys. Sensitive methods to identify the IA signal will therefore need to be included in the upcoming weak lensing analysis pipelines. Hydrodynamical cosmological simulations allow us to directly measure the intrinsic ellipticities of galaxies and thus provide a powerful approach to predict and understand the IA signal. Here we employ the novel, large-volume hydrodynamical simulation MTNG740, a product of the MillenniumTNG (MTNG) project, to study the IA of galaxies. We measure the projected correlation functions between the intrinsic shape/shear of galaxies and various tracers of large-scale structure, $w\\_{+g},\\ w\\_{+m},\\ w\\_{++}$ over the radial range $r\\_{\\rm p} \\in [0.02 , 200]\\,h^{-1}{\\rm Mpc}$ and at redshifts $z=0.0$, $0.5$ and $1.0$. We detect significant signal-to-noise IA signals with the density field for both elliptical and spiral galaxies. We also find significant intrinsic shear-shear correlations for ellipticals. We further examine correlations of the intrinsic shape of galaxies with the local tidal field. Here we find a significant IA signal for elliptical galaxies assuming a linear model. We also detect a weak IA signal for spiral galaxies under a quadratic tidal torquing model. Lastly, we measure the alignment between central galaxies and their host dark-matter halos, finding small to moderate misalignments between their principal axes that decline with halo mass.\n\n", "2304.12336": "2023-04-24, **How an era of kination impacts substructure and the dark matter annihilation rate**, M. Sten Delos et.al., [2304.12336v1](http://arxiv.org/abs/2304.12336v1)\n\n An era of kination occurs when the Universe's energy density is dominated by a fast-rolling scalar field. Dark matter that is thermally produced during an era of kination requires larger-than-canonical annihilation cross sections to generate the observed dark matter relic abundance. Furthermore, dark matter density perturbations that enter the horizon during an era of kination grow linearly with the scale factor prior to radiation domination. We show how the resulting enhancement to the small-scale matter power spectrum increases the microhalo abundance and boosts the dark matter annihilation rate. We then use gamma-ray observations to constrain thermal dark matter production during kination. The annihilation boost factor depends on the minimum halo mass, which is determined by the small-scale cutoff in the matter power spectrum. Therefore, observational limits on the dark matter annihilation rate imply a minimum cutoff scale for a given dark matter particle mass and kination scenario. For dark matter that was once in thermal equilibrium with the Standard Model, this constraint establishes a maximum allowed kinetic decoupling temperature for the dark matter. This bound on the decoupling temperature implies that the growth of perturbations during kination cannot appreciably boost the dark matter annihilation rate if dark matter was once in thermal equilibrium with the Standard Model.\n\n", "2304.12210": "2023-04-24, **A Cookbook of Self-Supervised Learning**, Randall Balestriero et.al., [2304.12210v1](http://arxiv.org/abs/2304.12210v1)\n\n Self-supervised learning, dubbed the dark matter of intelligence, is a promising path to advance machine learning. Yet, much like cooking, training SSL methods is a delicate art with a high barrier to entry. While many components are familiar, successfully training a SSL method involves a dizzying set of choices from the pretext tasks to training hyper-parameters. Our goal is to lower the barrier to entry into SSL research by laying the foundations and latest SSL recipes in the style of a cookbook. We hope to empower the curious researcher to navigate the terrain of methods, understand the role of the various knobs, and gain the know-how required to explore how delicious SSL can be.\n\n", "2304.12105": "2023-04-24, **EuCl$_3\\cdot 6$H$_2$O as the solid-state platform for searches for new P,T-odd physics**, Alexander O. Sushkov et.al., [2304.12105v1](http://arxiv.org/abs/2304.12105v1)\n\n Condensed matter systems offer the opportunity to maximize the number of spins, probed in magnetic resonance experiments that search for physics beyond the standard model. EuCl$\\_3\\cdot 6$H$\\_2$O is a promising solid-state platform for such searches. The narrow inhomogeneous linewidth of the Eu optical $^7\\hspace{-0.1em}F\\_0 \\leftrightarrow\\,^5\\hspace{-0.1em}D\\_0$ transition in this material opens the opportunity to optically pump the $^{153}$Eu nuclear spin ensemble into a single hyperfine sublevel. The closely-spaced opposite-parity nuclear energy levels, and the low-energy collective octupole mode, or a possible static octupole deformation, enhance the $^{153}$Eu nuclear Schiff moment. The optimistic estimate of the effective electric field is $E^*=10\\,$MV/cm. With this estimate, the CASPEr-electric search for the gluon interaction of axion dark matter can reach QCD axion sensitivity with a 3~cm sample.\n\n", "2304.11797": "2023-04-24, **Quantum Science and the Search for Axion Dark Matter**, Alexander O. Sushkov et.al., [2304.11797v1](http://arxiv.org/abs/2304.11797v1)\n\n The dark matter puzzle is one of the most important open problems in modern physics. The ultra-light axion is a well-motivated dark matter candidate, conceived to resolve the strong-CP problem of quantum chromodynamics. Numerous precision experiments are searching for the three non-gravitational interactions of axion-like dark matter. Some of the searches are approaching fundamental quantum limits on their sensitivity. This Perspective describes several approaches that use quantum engineering to circumvent these limits. Squeezing and single-photon counting can enhance searches for the axion-photon interaction. Optimization of quantum spin ensemble properties is needed to realize the full potential of spin-based searches for the electric-dipole-moment and the gradient interactions of axion dark matter. Several metrological and sensing techniques, developed in the field of quantum information science, are finding natural applications in this area of experimental fundamental physics.\n\n"}, "supernova": {"2304.12913": "2023-04-25, **Europium enrichment and hierarchical formation of the Galactic halo**, L. Cavallo et.al., [2304.12913v1](http://arxiv.org/abs/2304.12913v1)\n\n Context. The origin of the large star-to-star variation of the [Eu/Fe] ratios observed in the extremely metal-poor (at [Fe/H]$\\leq-3$) stars of the Galactic halo is still a matter of debate.\\\\ Aims. In this paper, we explore this problem by putting our stochastic chemical evolution model in the hierarchical clustering framework, with the aim of explaining the observed spread in the halo.\\\\ Methods. We compute the chemical enrichment of Eu occurring in the building blocks that have possibly formed the Galactic halo. In this framework, the enrichment from neutron star mergers can be influenced by the dynamics of the binary systems in the gravitational potential of the original host galaxy. In the least massive systems, the neutron stars can merge outside the host galaxy and so only a small fraction of newly produced Eu can be retained by the parent galaxy itself.\\\\ Results. In the framework of this new scenario, the accreted merging neutron stars are able to explain the presence of stars with sub-solar [Eu/Fe] ratios at [Fe/H]$\\leq-3$, but only if we assume a delay time distribution for merging of the neutron stars $\\propto t^{-1.5}$. We confirm the correlation between the dispersion of [Eu/Fe] at a given metallicity and the fraction of massive stars which give origin to neutron star mergers. The mixed scenario, where both neutron star mergers and magneto-rotational supernovae do produce Eu, can explain the observed spread in the Eu abundance also for a delay time distribution for mergers going either as $\\propto t^{-1}$ or $\\propto t^{-1.5}$.\n\n", "2304.12368": "2023-04-24, **Record-breaking polarization from the interacting superluminous supernova 2017hcc**, Jon C. Mauerhan et.al., [2304.12368v1](http://arxiv.org/abs/2304.12368v1)\n\n We present multiepoch spectropolarimetry of the superluminous interacting Type IIn supernova SN2017hcc, covering 16 to 391 days after explosion. In our first epoch we measure continuum polarization as high as 6%, making SN 2017hcc the most intrinsically polarized SN ever reported. During the first 29 days of coverage, when the polarization is strongest, the continuum polarization has a wavelength dependence that rises toward blue wavelengths, and becomes wavelength independent by day 45. The polarization strength drops rapidly during the first month, even as the SN flux is still climbing to peak brightness. Nonetheless, record-high polarization is maintained until day 68, at which point the source polarization declines to 1.9%, comparable to peak levels in previous well-studied SNe IIn. Thereafter the SN continues in polarization decline, while exhibiting only minor changes in position angle on the sky. The blue slope of the polarized continuum during the first month, accompanied by short-lived polarized flux for Balmer emission, suggests that an aspherical distribution of dust grains in pre-shock circumstellar material (CSM) is echoing the SN IIn spectrum and strongly influencing the polarization, while the subsequent decline during the wavelength-independent phase appears broadly consistent with electron scattering near the SN/CSM interface. The persistence of the polarization position angle between these two phases suggests that the pre-existing CSM responsible for the dust scattering at early times is part of the same geometric structure as the electron-scattering region that dominates the polarization at later times. SN2017hcc appears to be yet another, but much more extreme, case of aspherical yet well-ordered CSM in Type IIn SNe, possibly resulting from pre-SN mass loss shaped by a binary progenitor system.\n\n", "2304.12361": "2023-04-24, **SN 2020udy: a SN Iax with strict limits on interaction consistent with a helium-star companion**, Kate Maguire et.al., [2304.12361v1](http://arxiv.org/abs/2304.12361v1)\n\n Early observations of transient explosions can provide vital clues to their progenitor origins. In this paper we present the nearby Type Iax (02cx-like) supernova (SN), SN 2020udy that was discovered within hours ($\\sim$7 hr) of estimated first light. An extensive dataset of ultra-violet, optical, and near-infrared observations was obtained, covering out to $\\sim$150 d after explosion. SN 2020udy peaked at -17.86$\\pm$0.43 mag in the r band and evolved similarly to other 'luminous' SNe Iax, such as SNe 2005hk and 2012Z. Its well-sampled early light curve allows strict limits on companion interaction to be placed. Main-sequence companion stars with masses of 2 and 6 M$\\_\\odot$ are ruled out at all viewing angles, while a helium-star companion is allowed from a narrow range of angles (140-180$^\\circ$ away from the companion). The spectra and light curves of SN2020udy are in good agreement with those of the 'N5def' deflagration model of a near Chandrasekhar-mass carbon-oxygen white dwarf. However, as has been seen in previous studies of similar luminosity events, SN 2020udy evolves slower than the model. Broad-band linear polarisation measurements taken at and after peak are consistent with no polarisation, in agreement with the predictions of the companion-star configuration from the early light curve measurements. The host galaxy environment is low metallicity and is consistent with a young stellar population. Overall, we find the most plausible explosion scenario to be the incomplete disruption of a CO white dwarf near the Chandrasekhar-mass limit, with a helium-star companion.\n\n", "2304.12358": "2023-04-24, **Evidence for two distinct populations of kilonova-associated Gamma Ray Bursts**, Dimple et.al., [2304.12358v1](http://arxiv.org/abs/2304.12358v1)\n\n Identification of Gamma Ray Burst (GRB) progenitors based on the duration of their prompt emission ($T\\_{90}$) has faced several roadblocks recently. Long-duration GRBs (with $T\\_{90} > 2s$) have traditionally been thought to be originating from the collapse of massive stars, and the short-duration ones (with $T\\_{90} < 2s$) from compact binary mergers. However, recent observations of a long GRB associated with a kilonova (KN) and a short GRB with supernova (SN) association demand a more detailed classification of the GRB population. In this {\\it Letter}, we focus on GRBs associated with KNe, believed to be originating from mergers of binaries involving neutron stars (NS). We make use of the GRB prompt emission light curves of {\\it Swift}-BAT 2022 GRB catalog and employ machine learning algorithms to study the classification of GRB progenitors. Our analysis reveals that there are five distinct clusters of GRBs, of which the KN-associated GRBs are located in two separate clusters indicating they may have been produced by different progenitors. We argue that these clusters may be due to subclasses of binary neutron star (BNS) and/or neutron star--black hole (NS-BH) mergers. We also discuss the implications of these findings for future gravitational-wave (GW) observations and how those observations may help in understanding these clusters better.\n\n", "2304.12291": "2023-04-24, **Evolution of open clusters with or without black holes**, B. Shukirgaliyev et.al., [2304.12291v1](http://arxiv.org/abs/2304.12291v1)\n\n Binary black holes (BHs) can be formed dynamically in the centers of star clusters. The high natal kicks for stellar-mass BHs used in previous works made it hard to retain BHs in star clusters. Recent studies of massive star evolution and supernovae (SN) propose kick velocities that are lower due to the fallback of the SN ejecta. We study the impact of these updates by performing $N$-body simulations following instantaneous gas expulsion. For comparison, we simulate two additional model sets with the previous treatment of stars: one with high kicks and another with artificial removal of the kicks. Our model clusters initially consist of about one hundred thousand stars, formed with centrally-peaked efficiency. We find that the updated treatment of stars, due to the fallback-scaled lower natal kicks, allows clusters to retain SN remnants after violent relaxation. The mass contribution of the retained remnants does not exceed a few percent of the total bound cluster mass during the early evolution. For this reason, the first giga year of evolution is not affected significantly by this effect. Nevertheless, during the subsequent long-term evolution, the retained BHs accelerate mass segregation, leading to the faster dissolution of the clusters.\n\n", "2304.11819": "2023-04-24, **Progenitor constraint with circumstellar material for the magnetar-hosting supernova remnant RCW 103**, Takuto Narita et.al., [2304.11819v1](http://arxiv.org/abs/2304.11819v1)\n\n Stellar winds blown out from massive stars ($\\gtrsim 10M\\_{\\odot}$) contain precious information on the progenitor itself, and in this context, the most important elements are carbon (C), nitrogen (N), and oxygen (O), which are produced by the CNO cycle in the H-burning layer. Although their X-ray fluorescence lines are expected to be detected in swept-up shock-heated circumstellar materials (CSMs) in supernova remnants (SNRs), particularly those of C and N have been difficult to detect so far. Here, we present a high-resolution spectroscopy of a young magnetar-hosting SNR RCW~103 with the Reflection Grating Spectrometer (RGS) onboard XMM-Newton and report on the detection of \\ion{N}{7} Ly$\\alpha$ (0.50~keV) line for the first time. By comparing the obtained abundance ratio of N to O (N/O$=3.8 \\pm{0.1}$) with various stellar evolution models, we show that the progenitor of RCW~103 is likely to have a low-mass (10--12~$M\\_{\\odot}$) and medium-rotation velocities ($\\lesssim 100~\\rm{km~s^{-1}}$). The results also rule out the possibility of dynamo effects in massive ($\\geq35~M\\_{\\odot}$) stars as a formation mechanism of the associated magnetar 1E~161348$-$5055. Our method is useful for estimating various progenitor parameters for future missions with microcalorimeters such as XRISM and Athena.\n\n"}}