{"neutrino": {"2307.10126": "2023-07-19, **Neutrino spin oscillations in a magnetized Polish doughnut**, Maxim Dvornikov et.al., [2307.10126v1](http://arxiv.org/abs/2307.10126v1)\n\n We study the gravitational scattering of ultrarelativistic neutrinos off a rotating supermassive black hole (BH) surrounded by a thick magnetized accretion disk. Neutrinos interact electroweakly with background matter and with the magnetic field in the disk since neutrinos are supposed to possess nonzero magnetic moments. The interaction with external fields results in neutrino spin oscillations. We find that the toroidal magnetic field, inherent in the magnetized Polish doughnut, does not cause a significant spin-flip for any reasonable strengths of the toroidal component. The reduction of the observed neutrino flux, owing to neutrino spin oscillations, is predicted. A poloidal component of the magnetic field gives the main contribution to the modification of the observed flux. The neutrino interaction with matter, rotating with relativistic velocities, also changes the flux of neutrinos. We briefly discuss the idea of the neutrino tomography of magnetic field distributions in accretion disks near BHs.\n\n", "2307.09948": "2023-07-19, **FCNCs, Proton Stability, $ g_μ-2$ Discrepancy, Neutralino cold Dark Matter in Flipped $SU(5) \\times U(1)_χ$ from $F$ Theory based on $ A_{4} $ Symmetry**, Gayatri Ghosh et.al., [2307.09948v1](http://arxiv.org/abs/2307.09948v1)\n\n We predict the low energy signatures of a Flipped $SU(5) \\times U(1)\\_{\\chi}$ effective local model , constructed within the framework of F$-$theory based on $ A\\_{4} $ symmetry. The Flipped SU(5) model from F Theory in the field of particle physics is prominent due to its ability to construct realistic four-dimensional theories from higher-dimensional compactifications necessitates a uni ed description of the fundamental forces and particles of nature used for exploring various extensions of the Standard Model. We study Flipped $SU(5) \\times U(1)\\_{\\chi}$ Grand Unified Theories (GUTs) with $ A\\_{4} $ modular symmetry. In our model with different modular weights assignments, the fermion mass hierarchy exists due to different weighton fields. The constraints on the Dirac neutrino Yukawa matrix allows a good tuning to quark and charged lepton masses and mixings for each weighton field, with the neutrino masses and lepton mixing well determined by the type I seesaw mechanism, at the expense of some tuning which will be observed in charged lepton flavour violating decays which we explore here. The minimal ipped $SU(5$) model is supplemented with an extra right-handed type and its complex conjugate electron state, $ E\\_{c} + \\bar{E\\_{c}} $, as well as neutral singlet fields. The $ E\\_{c} + \\bar{E\\_{c}} $ pair gets masses of the order of TeV which solves the $ g\\_{\\mu}- 2$ discrepancy. The predictions of the model for charged lepton avour violation decay rate and proton decay could be tested in near future experiments.\n\n", "2307.09875": "2023-07-19, **Predictions of the ratio and asymmetry probes of the invisible $Z$-boson decay**, Kadir Saygin et.al., [2307.09875v1](http://arxiv.org/abs/2307.09875v1)\n\n Higher-order predictions through the combined accuracy including next-to-leading order (NLO) electroweak (EW) and next-to-NLO (NNLO) quantum chromodynamics (QCD) corrections in underlying perturbation theories are presented thoroughly for the invisible decay of the $Z$ boson into neutrino pair relative to its decay into charged-lepton pair (leptonic decay). The combined NNLO QCD+NLO EW predictions are achieved based on the fully-differential calculations of cross sections of both the invisible and leptonic processes in proton-proton ($pp$) collisions at 13 TeV center-of-mass energy. Differential distributions of cross-section ratios of the invisible process to the leptonic process are presented as a function of the transverse momentum of the $Z$ boson $p^{Z}\\_{\\rm{T}}$. For the first time, the predictions for differential distributions of cross-section asymmetries between the invisible process and the leptonic process are presented in bins of the $p^{Z}\\_{\\rm{T}}$. The cross-section ratio and asymmetry distributions, which are referred to as the invisible probes, are considered to be important for controlling the invisible process by the leptonic process of the $Z$ boson and probing deviation from the Standard Model (SM) for new-physics searches. The predictions are extensively presented beyond the $Z$-boson mass resonance region to assess the potential of the invisible ratio and asymmetry probes for new-phenomena searches in high-invariant mass region of the lepton-pair final states. Various tests with threshold requirements of transverse momenta of neutrino pair and leptons are performed to assess the impact on the combined predictions. The invisible ratio and asymmetry probes are proposed to be important probes for indirect searches of new-physics scenarios.\n\n", "2307.09863": "2023-07-19, **Testing the coupling of dark radiations in light of the Hubble tension**, Zhiyu Lu et.al., [2307.09863v1](http://arxiv.org/abs/2307.09863v1)\n\n Self-interacting dark radiations (SIdr) can have significant implications in the evolution of the universe, affecting the cosmic microwave background (CMB) and the clustering of large-scale structures. In this work, we analyze the implications of SIdr on the CMB power spectrum and explore its potential in resolving the Hubble tension. SIdr exhibits two distinct behaviors based on the interacting strength: strongly self-coupled and medium self-coupled. These behaviors are evident in the analysis of CMB data. According to Planck data, the dark radiation component consists of both free-streaming neutrinos and possible SIdr. The total contribution from these components yields relativistic species with $N\\_{\\rm eff}=3.046$. In the framework of universal coupling between dark radiations, a consistent value of $N\\_{\\rm eff}=3.27\\_{-0.31}^{+0.23}$ is obtained. Additionally, this coupling results in an increase in the Hubble constant ($H\\_0$) to $70.1\\_{-1.6}^{+1.3}, \\text{km/s/Mpc}$. However, when considering the number of free-streaming neutrinos as a parameter, the existence of SIdr is not supported. This makes its fraction in radiation to be $R\\_x=0.047^{+0.025}\\_{-0.053}$. Although the Hubble constant is still enhanced, it comes at the expense of a higher $N\\_{\\rm eff}=3.52\\pm0.25$. Our findings reveal that the ACT and SPT data provide support for the presence of SIdr, particularly when considering a variable number of free-streaming species. In this case, SIdr accounts for approximately 12.7\\% of the total radiation content. However, it is important to note that relying solely on SIdr is insufficient to completely resolve the Hubble tension. Finally, we investigate the constraints on SIdr imposed by future experiments, which improve the limits on scaled interacting strength $\\log\\_{10}\\tilde G\\_{\\rm eff}$ by a factor of 4.5 compared to the current constraints.\n\n", "2307.09737": "2023-07-19, **Probing for chiral $Z^\\prime$ gauge boson through scattering measurement experiments**, Kento Asai et.al., [2307.09737v1](http://arxiv.org/abs/2307.09737v1)\n\n Observation of tiny neutrino mass can not be explained within the framework of Standard Model (SM) and it allows us to construct beyond the SM (BSM) scenarios. We consider extra gauge extended scenarios which generate tiny neutrino mass through seesaw mechanism. These scenarios are equipped with a BSM neutral gauge boson called $Z^\\prime$ to cancel gauge and mixed gauge-gravity anomalies in the general $U(1)\\_X$ scenario which is a linear combination of $U(1)\\_Y$ and $U(1)\\_{\\rm B-L}$. In this case we find that left and right handed fermions interact differently with $Z^\\prime$. The $Z^\\prime$ gives rise to different processes involving neutrino-nucleon, neutrino-electron, electron-nucleus and electron-muon scattering processes and compared with FASER$\\nu(2)$, SND$@$LHC, COHERENT, NA64, JSNS2 and MUonE experiments, respectively. In addition to obtaining constraints on gauge coupling with respect to $Z^\\prime$ mass for different general $U(1)\\_X$ charges, we compare our results with those from proton, electron beam-dump experiments. Recasting data from the long-lived and dark photon searches at BaBaR, LHCb and CMS experiments, we estimate bounds on the gauge coupling and the corresponding gauge boson masses. We derive limits on the general $U(1)\\_X$ gauge coupling and $Z^\\prime$ mass from the electron and muon $g-2$ data for different $U(1)\\_X$ charges. We recast existing bounds from different beam-dump experiments at Orsay, KEK, E137, CHARM, Nomad, $\\nu-$cal, E141, E774, NA64, KEK in our cases in addition to the prospective limits form the future beam-dump scenarios at DUNE, FASER(2) and ILC. Finally we calculate bounds recasting the data of the dilepton and dijet searches from the LEP experiment for complementarity. Such parameter regions could be probed by scattering, beam-dump and collider experiments in future.\n\n", "2307.09600": "2023-07-18, **Offline Signal Identification with GRANDProto300**, Pragati Mitra et.al., [2307.09600v1](http://arxiv.org/abs/2307.09600v1)\n\n The GRANDProto300 (GP300) array is a pathfinder for the Giant Radio Array for Neutrino Detection (GRAND) project. Serving as a test bench, the GP300 array is expected to pioneer techniques of autonomous radio detection including identification and reconstruction of nearly horizontal cosmic-ray (CR) air showers, and shed light in understanding the interesting `transition region' from the galactic to extragalactic CR sources. An offline analysis of signal identification over ambient noise is crucial at this stage, where very relaxed self-triggering thresholds of radio antennas will be used for study purposes. In this work, we show results and efficiency of signal identification with classical approaches using a wide set of simulated realistic signal templates and also validated against measured background recorded by deployed prototypes.\n\n", "2307.09509": "2023-07-18, **Shedding light on the $Δm^2_{21}$ tension with supernova neutrinos**, Rasmi Hajjar et.al., [2307.09509v1](http://arxiv.org/abs/2307.09509v1)\n\n One long-standing tension in the determination of neutrino parameters is the mismatched value of the solar mass square difference, $\\Delta m\\_{21}^2$, measured by different experiments: the reactor antineutrino experiment KamLAND finds a best fit larger than the one obtained with solar neutrino data. Even if the current tension is mild ($\\sim 1.5\\sigma$), it is timely to explore if independent measurements could help in either closing or reassessing this issue. In this regard, we explore how a future supernova burst in our galaxy could be used to determine $\\Delta m\\_{21}^2$ at the future Hyper-Kamiokande detector, and how this could contribute to the current situation. We study Earth matter effects for different models of supernova neutrino spectra and supernova orientations. We find that, if supernova neutrino data prefers the KamLAND best fit for $\\Delta m\\_{21}^2$, an uncertainty similar to the current KamLAND one could be achieved. On the contrary, if it prefers the solar neutrino data best fit, the current tension with KamLAND results could grow to a significance larger than $5\\sigma$. Furthermore, supernova neutrinos could significantly contribute to reducing the uncertainty on $\\sin^2\\theta\\_{12}$.\n\n", "2307.09462": "2023-07-18, **NUTRIG: Towards an Autonomous Radio Trigger for GRAND**, Pablo Correa et.al., [2307.09462v1](http://arxiv.org/abs/2307.09462v1)\n\n One of the major challenges for large-scale radio surface arrays, such as the Giant Radio Array for Neutrino Detection (GRAND), is the requirement of an autonomous online trigger for radio signals induced by extensive air showers. The NUTRIG project lays the foundations for the development of a pure, efficient, and scalable trigger in the context of GRAND. For this purpose, a GRAND prototype setup of four detection units has been deployed at Nan\\c{c}ay, France, which currently serves as the main testing facility for the deployment of this autonomous trigger. This work provides a detailed description of the GRAND@Nan\\c{c}ay setup, and a first analysis of background data gathered on site. Initial tests of signal recovery in laboratory conditions are also presented. Finally, near-future plans are outlined to scale NUTRIG to larger pathfinder arrays such as GRANDProto300.\n\n", "2307.09460": "2023-07-18, **Probing Light Dark Matter through Cosmic-Ray Cooling in Active Galactic Nuclei**, Gonzalo Herrera et.al., [2307.09460v1](http://arxiv.org/abs/2307.09460v1)\n\n Recent observations of high-energy neutrinos from active galactic nuclei (AGN), NGC 1068 and TXS 0506+056, suggest that cosmic rays (CRs) are accelerated in the vicinity of the central supermassive black hole and high-energy protons and electrons can cool efficiently via interactions with ambient photons and gas. The dark matter density may be significantly enhanced near the central black hole, and CRs could lose energies predominantly due to scatterings with the ambient dark matter particles. We propose CR cooling in AGN as a new probe of dark matter-proton and dark matter-electron scatterings. Under plausible astrophysical assumptions, our constraints on sub-GeV dark matter can be the strongest derived to date. Some of the parameter space favored by thermal light dark matter models might already be probed with current multimessenger observations of AGN.\n\n", "2307.09241": "2023-07-18, **Neutrino Cross Sections: Interface of shallow- and deep-inelastic scattering for collider neutrinos**, Yu Seon Jeong et.al., [2307.09241v1](http://arxiv.org/abs/2307.09241v1)\n\n Neutrino experiments in a Forward Physics Facility at the Large Hadron Collider can measure neutrino and antineutrino cross sections for energies up to a few TeV. For neutrino energies below 100 GeV, the inelastic cross section evaluations have contributions from weak structure functions at low momentum transfers and low hadronic final state invariant mass. To evaluate the size of these contributions to the neutrino cross section, we use a parametrization of the electron-proton structure function, adapted for neutrino scattering, augmented with a correction to account for the partial conservation of the axial vector current, and normalized to structure functions evaluated at next-to-leading order in QCD, with target mass corrections and heavy quark corrections. We compare our results with other approaches to account for this kinematic region in neutrino cross section for energies between 10--1000 GeV on isoscalar nucleon and iron targets.\n\n", "2307.09170": "2023-07-18, **Hunting for bumps in the diffuse high-energy neutrino flux**, Damiano F. G. Fiorillo et.al., [2307.09170v1](http://arxiv.org/abs/2307.09170v1)\n\n The origin of the TeV--PeV astrophysical neutrinos seen by the IceCube telescope is unknown. If they are made in proton-photon interactions in astrophysical sources, their spectrum may show bump-like features. We search for such features in the 7.5-years High-Energy Starting Events (HESE), and forecast the power of such searches using larger data samples expected from upcoming telescopes. Present-day data reveals no evidence of bump-like features, which allows us to constrain candidate populations of photohadronic neutrino sources. Near-future forecasts show promising potential for stringent constraints or decisive discovery of bump-like features. Our results provide new insight into the origins of high-energy astrophysical neutrinos, complementing those from point-source searches.\n\n", "2307.08961": "2023-07-18, **Effect of Neutrinos on Angular Momentum of Dark Matter Halo**, Yu Chen et.al., [2307.08961v2](http://arxiv.org/abs/2307.08961v2)\n\n Massive neutrinos are expected to affect the large-scale structure formation, including the major component of solid substances, dark matter halos. How halos are influenced by neutrinos is vital and interesting, and angular momentum (AM) as a significant feature provides a statistical perspective for this issue. Exploring halos from TianNu N-body cosmological simulation with the co-evolving neutrino particles, we obtain some concrete conclusions. First, by comparing the same halos with and without neutrinos, in contrast to the neutrino-free case, over 89.71\\% of halos have smaller halo moduli, over 71.06\\% have smaller particle-mass-reduced (PMR) AM moduli, and over 95.44\\% change their orientations of less than $0.65^\\circ$. Moreover, the relative variation of PMR modulus is more visible for low-mass halos. Second, to explore the PMR moduli of halos in dense or sparse areas, we divide the whole box into big cubes, and search for halos within a small spherical cell in a single cube. From the two-level divisions, we discover that in denser cubes, the variation of PMR moduli with massive neutrinos decreases more significantly. This distinction suggests that neutrinos exert heavier influence on halos' moduli in compact regions. With massive neutrinos, most halos (86.60\\%) have lower masses than without neutrinos.\n\n"}, "dark matter": {"2307.10174": "2023-07-19, **A New Dissociative Galaxy Cluster Merger: RM J150822.0+575515.2**, Rodrigo Stancioli et.al., [2307.10174v1](http://arxiv.org/abs/2307.10174v1)\n\n Galaxy cluster mergers that exhibit clear dissociation between their dark matter, intracluster gas, and stellar components are great laboratories for probing dark matter properties. Mergers that are binary and in the plane of the sky have the additional advantage of being simpler to model, allowing for a better understanding of the merger dynamics. We report the discovery of a galaxy cluster merger with all these characteristics and present a multiwavelength analysis of the system, which was found via a search in the redMaPPer optical cluster catalog. We perform a galaxy redshift survey to confirm the two subclusters are at the same redshift (0.541, with $368\\pm519$ km s$^{-1}$ line-of-sight velocity difference between them). The X-ray morphology shows two surface-brightness peaks between the BCGs. We construct weak lensing mass maps that reveal a mass peak associated with each subcluster. Fitting NFW profiles to the lensing data, we find masses of $M\\_{\\rm 200c}=36\\pm11\\times10^{13}$ and $38\\pm11\\times10^{13}$ M$\\_\\odot/h$ for the southern and northern subclusters respectively. From the mass maps, we infer that the two mass peaks are separated by $520^{+162}\\_{-125}$ kpc along the merger axis, whereas the two BCGs are separated by 697 kpc. We also present deep GMRT 650 MHz data to search for a radio relic or halo, and find none. Using the observed merger parameters, we find analog systems in cosmological n-body simulations and infer that this system is observed between 96-236 Myr after pericenter, with the merger axis within $28^{\\circ}$ of the plane of the sky.\n\n", "2307.09963": "2023-07-19, **Action-based dynamical models of M31-like galaxies**, Paula Gherghinescu et.al., [2307.09963v1](http://arxiv.org/abs/2307.09963v1)\n\n In this work, we present an action-based dynamical equilibrium model to constrain the phase-space distribution of stars in the stellar halo, present-day dark matter distribution, and the total mass distribution in M31-like galaxies. The model comprises a three-component gravitational potential (stellar bulge, stellar disk, and a dark matter halo), and a double-power law distribution function (DF), $f(\\mathbf{J})$, which is a function of actions. A Bayesian model-fitting algorithm was implemented that enabled both parameters of the potential and DF to be explored.   After testing the model-fitting algorithm on mock data drawn from the model itself, it was applied to a set of three M31-like haloes from the Auriga simulations (Auriga 21, Auriga 23, Auriga 24). Furthermore, we tested the equilibrium assumption and the ability of a double-power law distribution function to represent the stellar halo stars. The model incurs an error in the total enclosed mass of around 10 percent out to 100 kpc, thus justifying the equilibrium assumption. Furthermore, the double-power law DF used proves to be an appropriate description of the investigated M31-like halos. The anisotropy profiles of the halos were also investigated and discussed from a merger history point of view.\n\n", "2307.09952": "2023-07-19, **Dark Matter Halo Spin of the Dwarf Galaxy UGC 5288: Insights from Observations, N-body and Cosmological Simulations**, Sioree Ansar et.al., [2307.09952v1](http://arxiv.org/abs/2307.09952v1)\n\n Dark matter (DM) halo angular momentum is very challenging to determine from observations of galaxies. In this study, we present a new hybrid method of estimating the dimensionless halo angular momentum, halo spin of a gas-rich dwarf barred galaxy UGC5288 using N-Body/SPH simulations. We forward model the galaxy disk properties: stellar and gas mass, surface densities, disk scalelengths, bar length and bar ellipticity from observations. We use the HI rotation curve to constrain the DM halo density profile and further use the bar properties to determine the models that best represent the observed baryonic disk. We compare the halo spin profile from our models to the halo spin profiles of similar mass dwarf galaxy analogues of UGC5288 in the TNG50 simulations. The halo spin profile from our simulated models matches within ballpark values of the median spin profile of UGC5288 analogues in the TNG50 simulations, although there are some uncertainties due to the DM halo evolutionary history.\n\n", "2307.09941": "2023-07-19, **Miniclusters from axion string simulations**, Giovanni Pierobon et.al., [2307.09941v1](http://arxiv.org/abs/2307.09941v1)\n\n The properties of axion miniclusters and of the voids between them can have very strong implications for the discovery of axions and the dark matter of the Universe. These properties can be strongly affected by axion dynamics in the early Universe, such as the axion string network and the non-linear dynamics around the QCD phase transition. Recently, improvements in numerical simulation techniques have allowed us to calculate the dark matter axion field from axion strings and QCD effects using different methods: directly with low-tension strings but high resolution, directly with effective high-tension strings, or indirectly by extrapolating an attractor solution. In this work, we study the properties of miniclusters in the different approaches used in the literature. We find that, while there are substantial differences in the mass distribution and internal density profiles, globally there is a similar energy distribution between minicluster halos and voids.\n\n", "2307.09522": "2023-07-18, **Exploration of the Pre-recombination Universe with a High-Dimensional Model of an Additional Dark Fluid**, Michael Meiers et.al., [2307.09522v1](http://arxiv.org/abs/2307.09522v1)\n\n We implement and explore high-dimensional generalized dark matter (HDGDM) with an arbitrary equation of state as a function of redshift as an extension to {\\Lambda}CDM.. Exposing this model to CMB, BAO, and supernova data, we demonstrate that the use of marginalized posterior distributions can easily lead to misleading conclusions on the viability of a high-dimensional model such as this one. We discuss such pitfalls and corresponding mitigation strategies, which can be used to search for an observationally favored region of the parameter space. We further show that the HDGDM model in particular does show promise in terms of its ability to ease the Hubble tension once such techniques are employed, and we find interesting features in the best-fitting equation of state that can serve as an inspiration for future model building.\n\n", "2307.09505": "2023-07-18, **Statistics of magnification for extremely lensed high redshift stars**, J. M. Palencia et.al., [2307.09505v1](http://arxiv.org/abs/2307.09505v1)\n\n Microlensing of stars in strongly lensed galaxies can lead to temporary extreme magnification factors ($\\mu\\!>\\!1000$), enabling their detection at high redshifts. Following the discovery of Icarus, several stars at cosmological distances ($z\\!>\\!1$) have been observed using the Hubble Space Telescope (HST) and the James Webb Space Telescope (JWST). This emerging field of gravitational lensing holds promise to study individual high redshift stars. Also offers the opportunity to study the substructure in the lens plane with implications for dark matter models, as more lensed stars are detected and analysed statistically. Due to the computational demands of simulating microlensing at large magnification factors, it is important to develop fast and accurate analytical approximations for the probability of magnification in such extreme scenarios. In this study, we consider different macro-model magnification and microlensing surface mass density scenarios and study how the probability of extreme magnification factors depends on these factors. To achieve this, we create state of the art large simulations of the microlensing effect in these scenarios. Through the analysis of these simulations, we derive analytical scaling relationships that can bypass the need for expensive numerical simulations. Our results are useful to interpret current observations of stars at cosmic distances which are extremely magnified and under the influence of microlenses.\n\n", "2307.09507": "2023-07-18, **Hooks & Bends in the Radial Acceleration Relation: Tests for Dark Matter and Challenges for MOND**, Francisco J. Mercado et.al., [2307.09507v1](http://arxiv.org/abs/2307.09507v1)\n\n The Radial Acceleration Relation (RAR) connects the total gravitational acceleration of a galaxy at a given radius, $a\\_{\\rm tot}(r)$, with that accounted for by baryons at the same radius, $a\\_{\\rm bar}(r)$. The shape and tightness of the RAR for rotationally-supported galaxies have characteristics in line with MOdified Newtonian Dynamics (MOND) and can also arise within the Cosmological Constant + Cold Dark Matter ($\\Lambda$CDM) paradigm. We use zoom simulations of 20 galaxies with stellar masses of $M\\_{\\star} \\, \\simeq \\, 10^{7-11} \\, M\\_{\\odot}$ to demonstrate that the observed average and scatter about the RAR is reproduced in FIRE-2 simulations. We highlight the existence of many observed galaxies with non-monotonic RAR tracks that ``hook'' down from the average relation. These hooks are challenging to explain in MOND, but we see them in all of our simulated galaxies that are dark-matter dominated and have feedback-induced cores in their dark matter haloes. We show analytically that downward hooks are expected in such cored haloes because they have non-monotonic acceleration profiles. We also make RAR predictions for the outer reaches of our simulated galactic haloes, extending the relation to accelerations below those traced by disc galaxy rotation curves. In this regime, our simulations predict ``bends'' off of the MOND-inspired extrapolation of the RAR, which, at large radii, approach $a\\_{\\rm tot}(r) \\, \\approx \\, a\\_{\\rm bar}(r)/f\\_{\\rm b}$, where $f\\_{\\rm b}$ is the cosmic baryon fraction. Future efforts to search for these bends at low accelerations around real galaxies will provide tests for MOND and \\lcdm.\n\n", "2307.09451": "2023-07-18, **The effect of pressure-anisotropy-driven kinetic instabilities on magnetic field amplification in galaxy clusters**, Y. Rappaz et.al., [2307.09451v1](http://arxiv.org/abs/2307.09451v1)\n\n The intracluster medium (ICM) is the low-density diffuse magnetized plasma in galaxy clusters, which reaches virial temperatures of up to 10^8 K. Under these conditions, the plasma is weakly collisional and therefore has an anisotropic pressure tensor with respect to the local direction of the magnetic field. This triggers very fast, Larmor-scale, pressure-anisotropy-driven kinetic instabilities that alter magnetic field amplification. We study magnetic field amplification through a turbulent small-scale dynamo, including the effects of the kinetic instabilities, during the evolution of a typical massive galaxy cluster. A specific aim of this work is to establish a redshift limit from which a dynamo has to start to amplify the magnetic field up to equipartition with the turbulent velocity field at redshift z=0. We implemented 1D radial profiles for various plasma quantities for merger trees generated with the Modified GALFORM algorithm. We assume that turbulence is driven by successive mergers of dark matter halos and construct effective models for the Reynolds number Re\\_eff dependence on the magnetic field in three different magnetization regimes, including the effects of kinetic instabilities. The magnetic field growth rate is calculated for the different Re\\_eff models. The model results in a higher magnetic field growth rate at higher redshift. For all scenarios considered, to reach equipartition at z=0, the amplification of the magnetic field has to start at redshift z\\_start=1.5 and above. The time to reach equipartition can be significantly shorter, in cases with systematically smaller turbulent forcing scales, and for the highest Re\\_eff models. Merger trees are useful tools for studying the evolution of magnetic fields in weakly collisional plasmas, and could also be used to constrain the different stages of the dynamo that potentially could be observed by future radio telescopes.\n\n", "2307.09245": "2023-07-18, **Axion dark matter with explicit Peccei-Quinn symmetry breaking in the axiverse**, Hai-Jun Li et.al., [2307.09245v1](http://arxiv.org/abs/2307.09245v1)\n\n It is shown that the required high quality of the Peccei-Quinn (PQ) symmetry can be a natural outcome of the multiple QCD axion models. In the axiverse, a hypothetical mass mixing between the QCD axions and axion-like particles (ALPs) can occur, which leads to an interesting phenomenon called the level crossing. In this paper, we investigate this mass mixing between one QCD axion and one ALP with the explicit PQ symmetry breaking in the early Universe. The dynamics of the axions and their cosmological evolutions when the level crossing occurs in this scenario are studied in detail. Then we focus our attention on the axion dark matter (DM) abundance. With several typical parameter sets for level crossing, we find that in the presence of the explicit PQ symmetry breaking term in the mixing, the total axion DM abundance is dominated by ALP and significantly suppressed.\n\n", "2307.09197": "2023-07-18, **Sensitivity of Space-based Gravitational-Wave Interferometers to Ultralight Bosonic Fields and Dark Matter**, Jiang-Chuan Yu et.al., [2307.09197v1](http://arxiv.org/abs/2307.09197v1)\n\n Ultralight bosonic fields (ULBFs) are predicted by various theories beyond the standard model of particle physics and are viable candidates of cold dark matter. There have been increasing interests to search for the ULBFs in physical and astronomical experiments. In this paper, we investigate the sensitivity of several planned space-based gravitational-wave interferometers to ultralight scalar and vector fields. Using time-delay interferometry (TDI) to suppress the overwhelming laser frequency noise, we derive the averaged transfer functions of different TDI combinations to scalar and vector fields, and estimate the impacts of bosonic field's velocities. We obtain the sensitivity curves for LISA, Taiji and TianQin, and explore their projected constraints on the couplings between ULBFs and standard model particles, illustrating with the ULBFs as dark matter.\n\n", "2307.09130": "2023-07-18, **Fundamental sensitivity limit of lossy cavity-enhanced interferometers with external and internal squeezing**, Mikhail Korobko et.al., [2307.09130v1](http://arxiv.org/abs/2307.09130v1)\n\n Quantum optical sensors are ubiquitous in various fields of research, from biological or medical sensors to large-scale experiments searching for dark matter or gravitational waves. Gravitational-wave detectors have been very successful in implementing cavities and quantum squeezed light for enhancing sensitivity to signals from black hole or neutron star mergers. However, the sensitivity to weak forces is limited by available energy and optical decoherence in the system. Here, we derive the fundamental sensitivity limit of cavity and squeezed-light enhanced interferometers with optical loss.This limit is attained by the optimal use of an additional internal squeeze operation, which allows to mitigate readout loss. We demonstrate the application of internal squeezing to various scenarios and confirm that it indeed allows to reach the best sensitivity in cavity and squeezed-light enhanced linear force sensors. Our work establishes the groundwork for the future development of optimal sensors in real-world scenarios where, up until now, the application of squeezed light was curtailed by various sources of decoherence.\n\n", "2307.09015": "2023-07-18, **Is the correlation between the bulge-to-total stellar mass ratio and the number of dwarf galaxies in tension with $Λ$CDM?**, Oliver Müller et.al., [2307.09015v1](http://arxiv.org/abs/2307.09015v1)\n\n Previous results suggest that there exists a correlation between the size of the bulge of a galaxy and the number of its dwarf galaxy satellites. This was found to be inconsistent with the standard model of cosmology based on comparisons to semi-analytical dark matter-only simulations, where no such correlation was found. In this work, we extend these studies using the volume-complete ELVES dwarf galaxy catalog, which increases the number of systems compared to previous work by a factor of four. For each giant galaxy we compile the bulge-to-total baryonic mass (B/T) ratio and put it as a function of the number of dwarf galaxies surrounding them within 250 kpc (N$\\_{250}$). For the 29 galaxy systems in the ELVES catalog, we find a linear relation between B/T and N$\\_{250}$ which is consistent with previous data. However, for a given stellar mass of the host galaxy this relation is mainly driven by their morphology, where early-type galaxies have a larger B/T ratio and a larger N$\\_{250}$ than late type galaxies. By investigating spiral galaxies in Illustris-TNG100, we tested whether the inclusion of baryons in the simulations will change the results based on Millennium-II. Contrary to dark matter-only simulations, we do find a correlation between B/T and N$\\_{250}$, indicating that the standard model of cosmology does predict a correlation. The empirical relation between the number of satellites and the bulge to total stellar mass is therefore not necessarily in tension with $\\Lambda$CDM.\n\n"}, "supernova": {"2307.09917": "2023-07-19, **Photospheric velocity evolution of SN 2020bvc: signature of $r$-process nucleosynthesis from a collapsar**, Long Li et.al., [2307.09917v1](http://arxiv.org/abs/2307.09917v1)\n\n Whether binary neutron star mergers are the only astrophysical site of rapid neutron-capture process ($r$-process) nucleosynthesis remains unknown. Collapsars associated with long gamma-ray bursts (GRBs) and hypernovae are promising candidates. Simulations have shown that outflows from collapsar accretion disks can produce enough $r$-process materials to explain the abundances in the universe. However, there is no observational evidence to confirm this result at present. SN 2020bvc is a broad-lined type Ic (Ic-BL) supernova (SN) possibly associated with a low-luminosity GRB. Based on semi-analytic SN emission models with and without $r$-process materials, we perform a fitting to the multi-band light curves and photospheric velocities of SN 2020bvc. We find that in a $r$-process-enriched model the mixing of $r$-process materials slows down the photospheric recession and therefore matches the velocity evolution better. The fitting results show that $r$-process materials with mass of $\\approx0.36~M\\_\\odot$ and opacity of $\\approx4~\\rm cm^2~g^{-1}$ is needed to mix with about half of the SN ejecta. Our fitting results are weakly dependent on the nebular emission. Future statistical analysis of a sample of type Ic-BL SNe helps us understand the contribution of collapsars to the $r$-process abundance.\n\n", "2307.09646": "2023-07-18, **Neutron star binaries produced by binary-driven hypernovae, their mergers, and the link between long and short GRBs**, L. M. Becerra et.al., [2307.09646v1](http://arxiv.org/abs/2307.09646v1)\n\n The binary-driven hypernova (BdHN) model explains long gamma-ray bursts (GRBs) associated with supernovae (SNe) Ic through physical episodes that occur in a binary composed of a carbon-oxygen (CO) star and a neutron star (NS) companion in close orbit. The CO core collapse triggers the cataclysmic event, originating the SN and a newborn NS (hereafter $\\nu$NS) at its center. The $\\nu$NS and the NS accrete SN matter. BdHNe are classified based on the NS companion fate and the GRB energetics, mainly determined by the orbital period. In BdHNe I, the orbital period is of a few minutes, so the accretion causes the NS to collapse into a Kerr black hole (BH), explaining GRBs of energies $>10^{52}$ erg. BdHN II, with longer periods of tens of minutes, yields a more massive but stable NS, accounting for GRBs of $10^{50}$--$10^{52}$ erg. BdHNe III have still longer orbital periods (e.g., hours), so the NS companion has a negligible role, which explains GRBs with a lower energy release of $<10^{50}$ erg. BdHN I and II might remain bound after the SN, so they could form NS-BH and binary NS (BNS), respectively. In BdHN III, the SN likely disrupts the system. We perform numerical simulations of BdHN II to compute the characteristic parameters of the BNS left by them, their mergers, and the associated short GRBs. We obtain the mass of the central remnant, whether it is likely to be a massive NS or a BH, the conditions for disk formation and its mass, and the event's energy release. The role of the NS nuclear equation of state is outlined.\n\n", "2307.09522": "2023-07-18, **Exploration of the Pre-recombination Universe with a High-Dimensional Model of an Additional Dark Fluid**, Michael Meiers et.al., [2307.09522v1](http://arxiv.org/abs/2307.09522v1)\n\n We implement and explore high-dimensional generalized dark matter (HDGDM) with an arbitrary equation of state as a function of redshift as an extension to {\\Lambda}CDM.. Exposing this model to CMB, BAO, and supernova data, we demonstrate that the use of marginalized posterior distributions can easily lead to misleading conclusions on the viability of a high-dimensional model such as this one. We discuss such pitfalls and corresponding mitigation strategies, which can be used to search for an observationally favored region of the parameter space. We further show that the HDGDM model in particular does show promise in terms of its ability to ease the Hubble tension once such techniques are employed, and we find interesting features in the best-fitting equation of state that can serve as an inspiration for future model building.\n\n", "2307.09501": "2023-07-18, **Addressing the Hubble tension with cosmic chronometers**, Michele Moresco et.al., [2307.09501v1](http://arxiv.org/abs/2307.09501v1)\n\n Twenty years after the discovery that the expansion of the Universe is accelerating, a new finding is now challenging our understanding of the cosmos. Recent studies have shown that the Hubble constant, the speed of expansion measured today, provides values in significant tension when measured from the Cosmic Microwave Background in the primordial Universe or from Cepheids and Supernovae Type Ia in the local Universe. Whether this tension is hinting towards new physics or some issue in the measurements, is still under debate; but it is clearly calling for new independent cosmological probes to provide additional pieces of evidence to solve this puzzle. This chapter introduces the method of cosmic chronometers, a new emerging cosmological probe that can provide cosmology-independent estimates of the Universe's expansion history. This method is based on the fact that the expansion rate of the Universe can be directly derived from measuring how much the Universe has changed in age between two different redshifts, i.e. by estimating the slope of the age--redshift relation. First, the main ingredients of the method will be discussed, presenting the main equations involved and how to estimate from the observables the needed quantities. After, it will be presented how to reliably select a sample of tracers to map the age evolution of the Universe coherently. Next, different methods to robustly measure the differential age of a population, the fundamental quantity involved in the method, will be reviewed. Finally, the main measurements obtained will be presented, providing forecasts for future surveys and discussing how these data can provide useful feedback to address the Hubble tension.\n\n", "2307.09418": "2023-07-18, **Influence of the tetraneutron on the EoS under core-collapse supernovae and heavy-ion collisions conditions**, Helena Pais et.al., [2307.09418v1](http://arxiv.org/abs/2307.09418v1)\n\n Recently, a resonant state of four neutrons (tetraneutron) with an energy of $E\\_{4n}=2.37\\pm 0.38 \\rm{(stat)} \\pm 0.44 \\rm{(sys)}$ MeV and a width of $\\Gamma=1.75\\pm 0.22 \\rm{(stat)} \\pm 0.30 \\rm{(sys)}$ MeV was reported. In this work, we analyse the effect of including such an exotic state on the yields of other light clusters, that not only form in astrophysical sites, such as core-collapse supernovae and neutron star mergers, but also in heavy-ion collisions. To this aim, we use a relativistic mean-field formalism, where we consider in-medium effects in a two-fold way, via the couplings of the clusters to the mesons, and via a binding energy shift, to compute the low-density equation of state for nuclear matter at finite temperature and fixed proton fraction. We consider five light clusters, deuterons, tritons, heliums, $\\alpha$-particles, and $^6$He, immersed in a gas of protons and neutrons, and we calculate their abundances and chemical equilibrium constants with and without the tetraneutron. We also analyse how the associated energy of the tetraneutron would influence such results. We find that the low-temperature, neutron-rich systems, are the ones most affected by the presence of the tetraneutron, making neutron stars excellent environments for their formation. Moreover, its presence in strongly asymmetric matter may increase considerably the proton and the $\\alpha$-particle fractions. This may have an influence on the dissolution of the accretion disk of the merger of two neutron stars.\n\n", "2307.08967": "2023-07-18, **New estimation of the nuclear de-excitation line emission from the supernova remnant Cassiopeia A**, Bing Liu et.al., [2307.08967v1](http://arxiv.org/abs/2307.08967v1)\n\n MeV nuclear de-excitation lines serve as a unique tool to study low-energy cosmic rays (CRs), containing both spectral and elemental information of the interacting material. In this paper, we estimated the possible nuclear de-excitation lines from the young supernova remnant Cassiopeia A. Given different CR spectral shapes and interacting materials, we found the predicted fluxes of strong narrow line emissions from the remnant are highly model-dependent, ranging from about $1\\times10^{-10}\\,{\\rm \\,cm^{-2}\\,s^{-1}}$ to $1\\times10^{-6}\\, {\\rm \\,cm^{-2}\\,s^{-1}}$ for the 4.44 MeV narrow line and from about $4\\times10^{-11}\\,{\\rm \\,cm^{-2}\\,s^{-1}}$ to $2\\times10^{-7}{\\rm \\,cm^{-2}\\,s^{-1}}$ for the 6.13 MeV narrow line, respectively. Based on the new estimation, we also discussed the detection probability of these line emissions against the MeV diffuse Galactic background under different assumptions of instrument response functions.\n\n"}}