{"neutrino": {"2601.18781": "2026-01-26, **Another relation among the neutrino mass-squared differences?**, I. Alikhanov et.al., [2601.18781v1](http://arxiv.org/abs/2601.18781v1)\n\n Determining absolute neutrino masses remains a central challenge in particle physics. Relations among the neutrino mass-squared differences could facilitate this determination and shed additional light on the underlying mass-generation mechanism. Inspired by recent global fits of neutrino oscillation parameters, we propose a simple algebraic relation between $Δm^2\\_{21}$ and $Δm^2\\_{31}$. It provides a framework to analytically manipulate these parameters and admits specific physical interpretations. In particular, the results may point toward a vanishing $ν\\_1$ mass.\n\n", "2601.18668": "2026-01-26, **tilepy: A Flexible Open-Source Scheduling Engine for Time-Domain and Multi-Messenger Astronomy**, Fabian Schüssler et.al., [2601.18668v1](http://arxiv.org/abs/2601.18668v1)\n\n The era of multi-messenger astrophysics requires rapid and efficient follow-up of transient events, many of which, such as gravitational waves (GW), gamma-ray bursts (GRB), and high-energy neutrinos, suffer from poor sky localisation. We present tilepy, a Python-based software designed to optimize observation schedules for these events. We here detail the modular architecture of tilepy, which separates high-level scheduling logic from low-level tiling and pointing tools, enabling full adaptability for ground- and space-based observatories. Furthermore, we describe the integration of tilepy into the Astro-COLIBRI platform, providing the community with a user-friendly interface and API for triggering complex observation campaigns in real time.\n\n", "2601.18666": "2026-01-26, **The phase structure of QCD: Fluctuations and Correlations**, Peter Braun-Munzinger et.al., [2601.18666v1](http://arxiv.org/abs/2601.18666v1)\n\n The strong interaction - governed by Quantum Chromodynamics (QCD) - shapes the structure of the visible universe. At about 10 $μ$s after the big bang, the primordial matter made up of quarks and gluons plus leptons, photons and neutrinos, the quark-gluon plasma (QGP), became cool enough to create, in a phase transition, the protons and neutrons of ordinary matter, along with other strongly interacting unstable hadrons. This phase transition was predicted within the framework of QCD and has been studied in accelerator laboratories world-wide since about 40 years. This review will explore recent breakthroughs in the study of the QCD phase diagram. We will highlight measurements of particle production and fluctuations, and compare them to theoretical predictions. We summarize our current understanding of the QCD structure and outline future experimental opportunities with high energy nuclear collisions at fixed-target and collider facilities world-wide.\n\n", "2601.18601": "2026-01-26, **Geometrical Constraints On Leptonic Unitarity Triangles**, Mathieu Guigue et.al., [2601.18601v1](http://arxiv.org/abs/2601.18601v1)\n\n The precision of the neutrino oscillation parameters measurements has improved and will continue to improve as the next-generation experiments become online. Beyond the more precise measurements of the mixing angles and phases used to parametrize the lepton mixing matrix, tests of its unitarity are of great interest. This paper studies how the amplitudes of the oscillation patterns can be used and combined to construct leptonic unitarity triangles.\n\n", "2601.18421": "2026-01-26, **Meson-exchange currents and nuclear correlations in neutrino and electron scattering with nuclei**, Paloma Rodríguez Casalé et.al., [2601.18421v1](http://arxiv.org/abs/2601.18421v1)\n\n This thesis is dedicated to the study of electron and neutrino scattering on nuclei, with special emphasis on meson-exchange currents (MEC) and short-range correlations (SRC) between nucleon pairs in one-particle emission processes. In chapter 2, the SuSAM* model is improved by redefining the single nucleon hadronic tensor, averaging it over a Fermi distribution instead of using the previous extrapolation from the relativistic Fermi gas. This formulation removes the inconsistency associated with negative contributions in kinematics far from the QE peak. The new definition allows extending the SuSAM* formalism to include MEC, which is the focus of chapter 3. In chapter 3, a scaling analysis of 12C data is performed incorporating MEC explicitly at the single nucleon level, leading to a new phenomenological scaling function. Using this model, the effect of MEC on EM responses is studied and compared with the relativistic Fermi gas (RFG) and the relativistic mean field (RMF) models. Chapter 4 presents a detailed analysis of the interference between 1b2b in the RT. It is shown that this interference is always negative within the independent-particle approximation. Chapter 5 extends the study of MEC to the CCQE neutrino scattering within the RFG, RMF, and SuSAM* frameworks. It is found that OB-MEC interference reduces both the RT and the neutrino cross section. Chapter 6 addresses SRC in the wave function of a nucleon pair in nuclear matter. The BG equation is solved using the NN potential developed by the Granada group, allowing for the calculation of high-momentum components. Finally, chapter 7 combined the effect of MEC and SRC, which extends the FG by including the high-momentum components of nucleon pairs affected by MEC. It is found that SRC enhance the RT, in contrast with what is observed in uncorrelated models.\n\n", "2601.18397": "2026-01-26, **Testing residual-symmetry-fixed columns of $U_{\\rm PMNS}$ at DUNE and T2HK with initial JUNO constraints**, Debajyoti Dutta et.al., [2601.18397v1](http://arxiv.org/abs/2601.18397v1)\n\n We study fixed-column predictions of the lepton mixing matrix that arise from residual symmetries originating in a class of discrete flavour and modular symmetries. While the recent high-precision determination of $\\sin^{2}θ\\_{12}$ by JUNO already constrains part of these predictions, the remaining ones are primarily characterized by non-trivial correlations between $\\sin^{2}θ\\_{23}$ and the Dirac CP phase $δ\\_{\\rm CP}$, which are currently only weakly constrained. This motivates a detailed investigation using next-generation long-baseline neutrino experiments. For the viable scenarios, we derive precise $\\sin^{2}θ\\_{23}$-$δ\\_{\\rm CP}$ correlations and use them to generate test-event samples, marginalising over the remaining oscillation parameters. We perform detailed simulations for DUNE and T2HK, presenting allowed regions in the $\\sin^{2}θ\\_{23}$-$δ\\_{\\rm CP}$ plane and evaluating the CP-violation fraction as a function of exposure. Our results show that the combined sensitivity of DUNE and T2HK provides a robust test of fixed-column lepton-mixing predictions.\n\n", "2601.18357": "2026-01-26, **Resolution Dependence in Magnetohydrodynamic Simulations of Neutrino-Driven Core-Collapse Supernovae**, Vishnu Varma et.al., [2601.18357v1](http://arxiv.org/abs/2601.18357v1)\n\n We investigate the role of resolution and initial magnetic field strength on core-collapse supernovae in simulations of a non-rotating $13 \\mathrm{M\\_\\odot}$ progenitor. Specifically, we study the effect on shock revival, explosion dynamics, and the properties of the compact remnant. We run four models with different numerical grid resolutions with an initial central dipole field strength of $\\mathord{\\approx}10^{12}\\, \\mathrm{G}$. Two of those resolutions are also run with a weaker central magnetic field of $\\mathord{\\approx}10^{10}\\, \\mathrm{G}$ . The shock revival time for all models is largely independent of resolution and initial magnetic field strength, but we find higher explosion energies when the initial magnetism is stronger and at higher resolutions. We find that models with strong magnetic fields have lower neutrino luminosity and energies, due to a proto-neutron star (PNS) that is deformed by the strong magnetic fields. At higher resolutions, magnetic fields are amplified more efficiently in the gain region and in the PNS via the small-scale dynamo. Although the strong magnetic fields do not directly drive the explosion, they have a subsidiary impact on the explosion mechanism and compensate for the reduced neutrino heating. Stronger magnetic energies in the PNS also affect energy and angular momentum redistribution, leading to more extended and vigorous PNS convection zones at higher resolutions.\n\n", "2601.18237": "2026-01-26, **Revisiting $μ$-$e$ conversion in $R$-parity violating SUSY**, Yu-Qi Xiao et.al., [2601.18237v1](http://arxiv.org/abs/2601.18237v1)\n\n The $μ$-$e$ conversion process is one of the most powerful ways to test lepton-flavor-violating (LFV) interactions involving charged leptons. The standard model with massive neutrinos predicts an extremely low rate for $μ$-$e$ conversion, making this process an excellent probe for testing LFV arising from new physics. Among many theoretical models that can induce LFV, the Supersymmetric model with R-parity violating interactions is one of the most studied for $μ$-$e$ conversion. In this work, we revisit trilinear R-parity violating interactions for $μ$-$e$ conversion, considering renormalization group (RG) running effects from high to low energy scales. The $μ$-$e$ conversion, $μ\\to e γ$, and $μ\\to eee$ experimental data are compared to give upper limits on the relevant 15 combinations of the trilinear $λ^{\\prime}$ couplings and 6 combinations of the $λ$ couplings, certain of which are underexplored in previous studies. We find that RG running effects influence the limits by no more than 30\\% in most cases, but can improve constraints by $\\sim$80\\% in certain combinations, which cannot be neglected. In the near future, COMET and Mu2e are expected to begin data-taking and aim to provide the most stringent constraints on $μ$-$e$ conversion. These next-generation $μ$-$e$ experiments have the ability to give much more comprehensive examinations on most trilinear coupling combinations than the $μ\\to eγ$ and $μ\\to 3e$ decay experiments. The $μ$-$e$ experiments will not only deepen our understanding of LFV but also provide a crucial way to examine the underlying new physics contributions.\n\n", "2601.18209": "2026-01-26, **Lattice determination of the neutrino background for $J/ψ\\rightarrow γ+ \\textrm{invisible}$**, Yu Meng et.al., [2601.18209v1](http://arxiv.org/abs/2601.18209v1)\n\n Searching for dark matter is a primary goal of modern astronomy and particle physics. Invisible decays of heavy quarkonia are particularly promising for probing light dark matter, attracting broad interest due to their unique sensitivity. Experiments searching for radiative invisible decays of the $J/ψ$ have steadily improved upper limits, and upcoming facilities will push sensitivity further -- making the precise determination and subtraction of the neutrino background indispensable. Here, we present the first lattice QCD calculation of the Standard Model decay $J/ψ\\to γν\\barν$, an irreducible background to $J/ψ\\to γ+ \\textrm{invisible}$. Our result for the branching fraction is $\\operatorname{Br}(J/ψ\\to γν\\barν)=1.00(9)(7)\\times 10^{-10}$, where the first uncertainty is statistical and the second is our systematic estimate. This work advances lattice-based determinations of neutrino backgrounds to quarkonium invisible decays, delivering an ab initio benchmark for $J/ψ\\to γ+ \\textrm{invisible}$. Our approach generalizes to other quarkonium channels (e.g., $Υ/φ\\to γ+\\textrm{invisible}$) and provides critical theoretical support for dark matter searches at colliders.\n\n", "2601.18114": "2026-01-26, **Mitigating Deadtime in Distributed Optical Arrays: A Liveness-Aware Trigger Approach for High-Energy Neutrino Detection**, Thammarat Yawisit et.al., [2601.18114v1](http://arxiv.org/abs/2601.18114v1)\n\n Large-scale neutrino observatories operate under unavoidable detector deadtime arising from photomultiplier saturation, digitizer limits, and front-end readout constraints. Conventional coincidence-based trigger logic implicitly assumes continuous sensor availability and therefore suffers systematic efficiency loss when channels become temporarily non-live. This work presents the design of a liveness-aware trigger architecture targeting low-latency FPGA deployment in distributed optical arrays. We introduce a recursive Infinite Impulse Response (IIR) update law implemented as a fully synthesizable pipeline that constructs a continuity-preserving effective observable at each sensor node. Rather than collapsing during non-liveness intervals, the observable decays smoothly while retaining phase and amplitude information relevant for network-level coherence estimation. By explicitly separating continuous measurement construction from discrete trigger decision logic, the proposed architecture enables graceful degradation under partial channel non-liveness. Performance is evaluated using a hybrid validation framework that combines representative event topologies derived from IceCube Open Data with a hardware-accurate signal and noise model spanning a wide dynamic range. Simulation results demonstrate that the proposed trigger sustains high event recovery efficiency in regimes of elevated deadtime probability, where conventional coincidence logic degrades substantially. Furthermore, the continuity-preserving observable yields up to a two-order-of-magnitude improvement in effective signal-to-noise ratio, enabling robust detection under strong saturation and non-ideal operating conditions. This method provides a robust foundation for next-generation firmware-level trigger strategies in large-scale, noise-dominated detector systems.\n\n", "2601.18051": "2026-01-26, **Neutrino opacities in magnetic fields for binary neutron star merger simulations**, Mia Kumamoto et.al., [2601.18051v1](http://arxiv.org/abs/2601.18051v1)\n\n Neutrino interactions play a central role in transport and flavor evolution in the ejecta of binary neutron star mergers. Simulations suggest that neutron star mergers may produce magnetic fields as strong as $10^{17}$ G, but computational difficulties have hampered the inclusion of magnetic field effects in neutrino interaction rates. In this paper we give approximate interaction rates for neutrinos in the presence of strong magnetic fields, including the effects of Landau quantization and anomalous magnetic moments with errors of order $\\sqrt{T/M}$. We also comment on a neutrino production channel from individual neutrons that can produce low-energy $ν\\barν$ pairs even at low density.\n\n", "2601.17696": "2026-01-25, **The neutrino behavior in the Einstein$\\text{-}$Hilbert$\\text{-}$Bumblebee gravity around global monopole field**, B. Q. Wang et.al., [2601.17696v1](http://arxiv.org/abs/2601.17696v1)\n\n In this work, we study the phase of neutrino oscillation propagating along radial and non-radial paths in the Einstein$\\text{-}$Hilbert$\\text{-}$Bumblebee (EHB) gravity around global monopole field, by using the quantummechanical treatment, the expression of the corrected neutrino of probability of oscillation is obtained. Our results show that neutrino oscillation in the EHB gravity around global monopole field is different from that in Schwarzschild black hole, the Lorentz-violating parameter $a$ mainly affects the peak of the oscillation probability, and the global monopole $\\overline { μ}$ and the lightest neutrino mass both affect the frequency of the oscillations of probabilities, which means that studying the neutrino oscillation phenomenon in curved spacetime may not only become a new technology for probing the properties of compact celestial bodies, but also help deepen our understanding of neutrinos.\n\n"}, "dark matter": {"2601.18693": "2026-01-26, **Intracluster light as a dark matter tracer: how their spatial and kinematic relationship is shaped by satellite demographics**, G Martin et.al., [2601.18693v1](http://arxiv.org/abs/2601.18693v1)\n\n We investigate how the orbital evolution and mass distribution of infalling satellite galaxies shape the phase-space and radial distributions of intracluster light (ICL) relative to the underlying cluster dark matter (DM) halo. Using N-body simulations, we follow the tidal stripping and orbital evolution of satellite galaxies as they are accreted into a live cluster halo, systematically varying satellite-to-host mass ratio and orbital circularity. We measure the specific orbital energy and angular momentum of stripped stellar and DM material, finding that the stripped stars consistently occupy lower-energy and lower-angular momentum regions of phase-space than the stripped DM. The magnitude of this difference increases strongly towards more equal satellite--to--host mass ratios, while the dependence on orbital circularity is weak. We construct a predictive model for the phase-space properties of stripped stars and DM from a whole infalling satellite population and find that the resulting phase-space difference between the components are driven primarily by the characteristic mass of the infalling satellite stellar mass function. We find that the ICL is always more centrally concentrated than the DM. The magnitude of this offset depends on the characteristic mass and increases towards higher characteristic masses. Comparisons with four independent cosmological hydrodynamical simulations show that, once the infalling satellite stellar mass function is matched, the model reproduces the radial stellar-to-DM density profile offsets to better than the inter-simulation scatter. This demonstrates that the radial relationship between the ICL and the DM distribution is largely governed by satellite demographics. With adequate constraints on the infalling satellite population, ICL density profiles can therefore be used as informative tracers of the underlying radial DM distribution in clusters.\n\n", "2601.18652": "2026-01-26, **Impact of Rastall gravity on hydrostatic mass of galaxy clusters**, M. Lawrence Pattersons et.al., [2601.18652v1](http://arxiv.org/abs/2601.18652v1)\n\n Galaxy clusters are the largest virialized structures in the Universe and are predominantly dominated by dark matter. The hydrostatic mass and the mass obtained from gravitational lensing measurements generally differ, a discrepancy known as the hydrostatic mass bias. In this work, we derive the hydrostatic mass of galaxy clusters within the framework of Rastall gravity and investigate its implications under two scenarios: (i) the absence of dark matter and (ii) the existence of dark matter. In the first scenario, Rastall gravity effectively reduces the hydrostatic mass, bringing it closer to the observed baryonic mass. The best linear fit yields a slope $\\mathbf{M}=1.07\\pm0.11$, indicating a near one-to-one correspondence between the two masses. In the second scenario, Rastall gravity helps to alleviate the hydrostatic mass bias. The linear fit between the Rastall hydrostatic mass and the observed lensing mass results in a best-fit slope $\\mathbf{M}=1.01\\pm0.16$, which is very close to unity. These results suggest that Rastall gravity provides a statistically favorable framework for addressing mass discrepancies in galaxy clusters.\n\n", "2601.18578": "2026-01-26, **The AIDA-TNG project: gas distributions inside and around haloes**, Chi Zhang et.al., [2601.18578v1](http://arxiv.org/abs/2601.18578v1)\n\n The nature of Dark Matter (DM) is one of the most outstanding mysteries of modern astrophysics. While the standard Cold DM (CDM) model successfully explains observations on most astrophysical scales, DM particles have not yet been detected, leaving room for a plethora of different models. In order to identify their observable signatures, we use the AIDA-TNG cosmological simulation suite to predict the distributions of gas and neutral hydrogen (HI) in the CDM, Self-Interacting DM (SIDM), velocity-dependent SIDM (vSIDM), and Warm DM (WDM) models.   We find that the DM models investigated have very limited impact on the median gas and HI profile of haloes. In particular, for the most massive haloes ($M\\_{\\rm vir}\\sim10^{14}\\,\\mathrm{M}\\_\\odot$), we find that DM self-interactions can shallow the central potential and thereby enhance gas cooling. We find that, in all models, the halo-to-halo variation in the HI profiles is explained by AGN feedback, and that the specific characteristics of DM model is largely subdominant. Nevertheless, we detect some systematic difference in the case of SIDM, with more HI surviving close to the centre with respect to other models. We provide fitting functions for the gas and HI profiles.   We investigate the galaxy-Ly$α$ cross-correlation function (\\galacc) for different halo masses, redshift and observation strategies. We find that at $z=0$ vSIDM can be distinguished from CDM in haloes with $10^{12}\\lesssim M\\_{\\rm vir}\\lesssim10^{13}\\,{\\rm M}\\_\\odot$, while SIDM1 can be distinguished from CDM in haloes with $M\\_{\\rm vir}\\gtrsim10^{13}\\,{\\rm M}\\_\\odot$. We estimate that statistically-robust detection requires sampling $\\sim160$ haloes with $\\sim20$ sightlines each, a task that can be achieved with current and future facilities like WEAVE, 4MOST, PFS, ELT and WST.\n\n", "2601.18379": "2026-01-26, **Analysis of freeze-in scenario with a scalar Leptoquark and a scalar Dark Matter**, Joydeep Roy et.al., [2601.18379v1](http://arxiv.org/abs/2601.18379v1)\n\n Dark Matter relic density generation through \\textit{freeze-in} mechanism where dark matter particles interact feebly with visible sector particles, is an alternative approach to well-studied and most popular \\textit{freeze-out} paradigm. We study this \\textit{freeze-in} scenario in the presence of a scalar leptoquark interacting with both dark matter and Standard Model particles with renormalizable interactions. We discuss the effect of the presence of such heavy particle, a scalar leptoquark with mass $\\geq 1.5 \\TeV$, in the thermal bath and subsequent relic density generation. We explore the parameter space of such framework, consisting of two masses and three dimensionless couplings. We numerically study the interaction rates and relic density as a function of these parameters and determine their values consistent with the dark matter constraints.\n\n", "2601.18176": "2026-01-26, **Rotating black holes in the Hernquist galactic halo and its accretion disk luminosity**, Malihe Heydari-Fard et.al., [2601.18176v1](http://arxiv.org/abs/2601.18176v1)\n\n Static, spherically symmetric black holes immersed in a dark matter halo with a Hernquist-type density profile have been derived by Cardoso et. al. in Ref. \\redcite{Cardoso:2021wlq}. Using the Newman-Janis algorithm, we construct the metric for a stationary and axially symmetric rotating black hole in this environment. Then, we obtain the electromagnetic properties of thin accretion disks around such rotating black holes by utilizing the steady-state Novikov-Thorne model, and study the effects of spin parameter and halo compactness parameter on the disk properties. Finally, by comparison the results of the rotating Cardoso black hole with that of Kerr black hole in the absence of dark matter, we find that the presence of dark matter can not significantly affect the disk properties and thus for astrophysical black holes with large spin parameter, the distinction of rotating Cardoso black holes becomes more difficult than the Kerr black hole.\n\n", "2601.18079": "2026-01-26, **Vanishing Compactness Gap and Fermionic Compact Dark Matter in Hořava-Lifshitz Gravity**, Edwin J. Son et.al., [2601.18079v1](http://arxiv.org/abs/2601.18079v1)\n\n We show that the gap in the compactness between black holes and neutron stars witnessed in general relativity may be vanishing in Hořava-Lifshitz (HL) gravity. Assuming a fermion equation-of-state for simplicity, and solving the Tolman-Oppenheimer-Volkoff equation within the HL gravity framework, we see that there exists a minimum fermion mass $m\\_f^\\text{(min)}(q,y)$, above which the gap of the compactness between black hole and fermionic compact object vanishes, for a given deformation parameter $q$ of HL and interaction strength $y$ between fermions. Thus, in HL gravity, the mass and radius of an object found in the lower mass gap by LIGO-Virgo-KAGRA observations might not be able to classify it as a black hole or a neutron star. It is interesting to note that a fermion of mass $\\sim 40\\ \\text{GeV}$ can form a highly compact object of mass $\\sim 10^{-4}\\ \\msun$ and radius $\\sim 1\\ \\text{m}$ that may play the role of the cold dark matter. In addition, we find the possible existence of another class of compact objects whose compactness is comparable to that of a black hole.\n\n", "2601.17914": "2026-01-25, **Three-point intrinsic alignments of galaxies and haloes in the FLAMINGO simulations**, Casper Vedder et.al., [2601.17914v1](http://arxiv.org/abs/2601.17914v1)\n\n Third-order statistics provide information beyond two-point measures, but extracting this information requires accurate and consistent modelling. We measure and detect the three-point correlation function and third-order aperture-mass statistics of intrinsic alignments (IA) for galaxies and for haloes with $M\\_{\\rm halo} > 10^{13}\\,{\\rm M}\\_\\odot$ in the $(2.8\\,\\mathrm{Gpc})^3$ simulation volume of the FLAMINGO hydrodynamical simulation suite. We model the third-order aperture-mass statistics and show that on large scales both the galaxy and halo samples are well described by the tree-level effective field theory (EFT) of IA across the three dark matter density-shape combinations and a wide range of triangle configurations, with the alignment amplitude consistent with that inferred from two-point statistics. We compare the full EFT to several other models: a version neglecting the velocity-shear term, the non-linear alignment model (NLA), and to a reduced EFT assuming co-evolution relations that follow from the assumption that alignment is linear in Lagrangian space. The first two models yield biased constraints on the alignment amplitude, but the reduced EFT performs remarkably well, achieving a low reduced chi-squared and minimal bias. We examine the redshift and mass dependence of the higher-order bias parameters, finding that the linear Lagrangian bias assumption is approximately satisfied across the explored halo mass and redshift ranges for both galaxies and haloes, suggesting that the galaxies broadly follow the alignment properties of their host haloes. These co-evolution relations can be valuable for photometric shear surveys, where limited constraining power on IA parameters favours models with fewer free parameters.\n\n"}, "supernova": {"2601.18542": "2026-01-26, **XFit: Global Optimization and Degeneracy Mapping in X-ray Spectral Modeling**, Austin MacMaster et.al., [2601.18542v1](http://arxiv.org/abs/2601.18542v1)\n\n The standard approach to modeling X-ray spectral data relies on local optimization methods, such as the Levenberg-Marquardt algorithm. While effective for simple models and speedy spectral fitting, these local optimizers are prone to becoming trapped in local minima, particularly in high-dimensional or degenerate parameter spaces, and typically require extensive user intervention. In this work, we introduce XFit, a global optimization method for fitting X-ray data, which makes extensive use of the Ferret evolutionary algorithm. XFit enables automated exploration of complex parameter spaces, efficient mapping of confidence intervals, and identification of degenerate solutions that may be overlooked by local methods. We demonstrate the performance of XFit using two representative X-ray sources: the Central Compact Object in Cassiopeia A and the supernova remnant G41.1-0.3. These examples span both low- and high-dimensional models, allowing us to illustrate the advantages of global optimization. In both cases, XFit produces solutions that are consistent with or improve upon those found with traditional methods, while also revealing alternative fits or degenerate solutions within statistically acceptable confidence levels. The automated mapping of parameter space offered by XFit makes it a powerful complement to existing spectral fitting tools, particularly as models and data quality become increasingly complex. Future work will expand the application of XFit to broader datasets and more physically motivated models.\n\n", "2601.18040": "2026-01-25, **Gas Kinematics and Cosmic-Ray Acceleration in the Gamma-ray SNRs W41 and G22.7-0.2**, Takeru Murase et.al., [2601.18040v1](http://arxiv.org/abs/2601.18040v1)\n\n We present a study of the interstellar medium associated with the two middle-aged supernova remnants (SNRs) W41 and G22.7-0.2, both detected in TeV gamma-rays. Using high-angular-resolution $^{12}$CO($J$ = 1-0) data from the Nobeyama 45-m telescope and HI data from the VLA, we investigated the spatial and kinematic properties of molecular and atomic gas that interact with the SNRs. We identified associated clouds in the velocity ranges of +50-+80 km s$^{-1}$ for W41 and +76-+110 km s$^{-1}$ for G22.7-0.2. Column density analysis indicates that target protons are dominated by molecular hydrogen, while atomic hydrogen contributes less than $\\sim$10-15% even after correction for self-absorption. The mean proton densities are $\\sim$1.2$\\times$10$^{3}$ cm$^{-3}$ for W41 and $\\sim$5.3$\\times$10$^{2}$ cm$^{-3}$ for G22.7-0.2. From the gamma-ray luminosities, we estimate the total energy of accelerated cosmic-ray protons as $W\\_\\mathrm{p}$ $\\sim$3$\\times$10$^{47}$~erg for W41 and $\\sim$1$\\times$10$^{48}$ erg for G22.7-0.2, corresponding to 0.03-0.1% of the canonical supernova explosion energy. hese $W\\_\\mathrm{p}$ values agree with the decreasing trend in $W\\_\\mathrm{p}$ observed in the middle-aged SNRs within the previously reported SNR age-$W\\_\\mathrm{p}$ relation.\n\n"}}