{"neutrino": {"2402.16498": "2024-02-26, **Results of the follow-up of ANTARES neutrino alerts**, A. Albert et.al., [2402.16498v1](http://arxiv.org/abs/2402.16498v1)\n\n High-energy neutrinos could be produced in the interaction of charged cosmic rays with matter or radiation surrounding astrophysical sources. To look for transient sources associated with neutrino emission, a follow-up program of neutrino alerts has been operating within the ANTARES Collaboration since 2009. This program, named TAToO, has triggered robotic optical telescopes (MASTER, TAROT, ROTSE and the SVOM ground based telescopes) immediately after the detection of any relevant neutrino candidate and scheduled several observations in the weeks following the detection. A subset of ANTARES events with highest probabilities of being of cosmic origin has also been followed by the Swift and the INTEGRAL satellites, the Murchison Widefield Array radio telescope and the H.E.S.S. high-energy gamma-ray telescope. The results of twelve years of observations are reported. No optical counterpart has been significantly associated with an ANTARES candidate neutrino signal during image analysis. Constraints on transient neutrino emission have been set. In September 2015, ANTARES issued a neutrino alert and during the follow-up, a potential transient counterpart was identified by Swift and MASTER. A multi-wavelength follow-up campaign has allowed to identify the nature of this source and has proven its fortuitous association with the neutrino. The return of experience is particularly important for the design of the alert system of KM3NeT, the next generation neutrino telescope in the Mediterranean Sea.\n\n", "2402.16491": "2024-02-26, **On Lepton Flavor Violation and Dark Matter in Scotogenic model with Trimaximal Mixing**, Tapender et.al., [2402.16491v1](http://arxiv.org/abs/2402.16491v1)\n\n We examine the Scotogenic model employing the TM$\\_2$ mixing matrix, $U\\_{\\text{TM}\\_2}$, for neutrinos and parameterize the Yukawa coupling matrix $y$ based on the diagonalization condition for the neutrino mass matrix, $m\\_{\\nu}$. Our investigation centers on analyzing the relic density of cold dark matter ($\\Omega h^2$) and possible lepton flavor violation (LFV) in the model. While analyzing, we have taken into consideration respective experimental constraints on $\\Omega h^2$ and LFV alongside neutrino oscillation data. In the second part, we have extended the analysis incorporating extended magic symmetry in $m\\_\\nu$ enabling us to completely determine Yukawa coupling matrix ($y$). We observe a notable exclusion of the effective Majorana mass $\\|m\\_{ee}\\|$ parameter space by cosmological bound on sum of neutrino masses, particularly in the normal hierarchy while inverted hierarchy scenario is excluded due to constraints coming from extended magic symmetry. These findings shed light on the interplay among the Scotogenic model, TM$\\_2$ mixing, and extended magic symmetry, offering insights into the permitted parameter space and hierarchy exclusion.\n\n", "2402.16441": "2024-02-26, **Neutrino oscillations with atmospheric neutrinos at large liquid argon TPCs**, Animesh Chatterjee et.al., [2402.16441v1](http://arxiv.org/abs/2402.16441v1)\n\n We propose to study atmospheric neutrino interactions with a unique event topology to distinguish neutrinos and anti-neutrinos using a liquid argon time projection chamber in an experiment such as DUNE. The detection of CC1P and CC0P events will allow to access neutrino oscillation physics complementary to accelerator based beam neutrinos. Our analysis shows that a sensitivity to the mass-ordering can be achieved with a significance close to 4{\\sigma} and a CP violation sensitivity with more than 2{\\sigma} with a data sample of 140 kt-yr of atmospheric neutrinos in the DUNE detector.\n\n", "2402.16395": "2024-02-26, **Quantum Decoherence effects on precision measurements at DUNE and T2HK**, G. Barenboim et.al., [2402.16395v1](http://arxiv.org/abs/2402.16395v1)\n\n We investigate the potential impact of neutrino quantum decoherence on the precision measurements of standard neutrino oscillation parameters in the DUNE and T2HK experiments. We show that the measurement of $\\delta\\_\\text{CP}$, $\\sin^2\\theta\\_{13}$ and $\\sin^2\\theta\\_{23}$ is stronger effected in DUNE than in T2HK. On the other hand, DUNE would have a better sensitivity than T2HK to observe decoherence effects. By performing a combined analysis of DUNE and T2HK we show that a robust measurement of standard parameters would be possible, which is not guaranteed with DUNE data alone.\n\n", "2402.16272": "2024-02-26, **Mass production and performance study on the 20-inch PMT acrylic protection covers in JUNO**, Miao He et.al., [2402.16272v1](http://arxiv.org/abs/2402.16272v1)\n\n The Jiangmen Underground Neutrino Observatory is a neutrino experiment that incorporates 20,012 20-inch photomultiplier tubes (PMTs) and 25,600 3-inch PMTs. A dedicated system was designed to protect the PMTs from an implosion chain reaction underwater. As a crucial element of the protection system, over 20,000 acrylic covers were manufactured through injection molding, ensuring high dimensional precision, mechanical strength, and transparency. This paper presents the manufacturing technology, mass production process, and performance characteristics of the acrylic covers.\n\n", "2402.16243": "2024-02-26, **The Cosmic Neutrino Background**, Douglas Scott et.al., [2402.16243v1](http://arxiv.org/abs/2402.16243v1)\n\n The cosmic neutrino background is like the cosmic microwave background, but less photon-y and more neutrino-ey. The CNB is also less talked about than the CMB, mostly because it's nearly impossible to detect directly. But if it could be detected, it would be interesting in several ways that are discussed.\n\n"}, "dark matter": {"2402.16234": "2024-02-26, **Phase-Space Delaunay Tessellation Field Estimator**, Job Feldbrugge et.al., [2402.16234v1](http://arxiv.org/abs/2402.16234v1)\n\n The reconstruction of density and velocity fields is of central importance to the interpretation of $N$-body simulations. We propose a phase-space extension of the Delaunay tessellation field estimator (DTFE) that tracks the dark matter fluid in phase-space. The new reconstruction scheme removes several artifacts from the conventional DTFE in multi-stream regions, while preserving the adaptive resolution in high-density regions and yielding continuous fields. The estimator also removes tessellation artifacts of a previously proposed phase-space reconstruction scheme.\n\n"}, "supernova": {}}