{"neutrino": {"2407.11925": "2024-07-16, **Calibration and simulation of ionization signal and electronics noise in the ICARUS liquid argon time projection chamber**, ICARUS collaboration et.al., [2407.11925v1](http://arxiv.org/abs/2407.11925v1)\n\n The ICARUS liquid argon time projection chamber (LArTPC) neutrino detector has been taking physics data since 2022 as part of the Short-Baseline Neutrino (SBN) Program. This paper details the equalization of the response to charge in the ICARUS time projection chamber (TPC), as well as data-driven tuning of the simulation of ionization charge signals and electronics noise. The equalization procedure removes non-uniformities in the ICARUS TPC response to charge in space and time. This work leverages the copious number of cosmic ray muons available to ICARUS at the surface. The ionization signal shape simulation applies a novel procedure that tunes the simulation to match what is measured in data. The end result of the equalization procedure and simulation tuning allows for a comparison of charge measurements in ICARUS between Monte Carlo simulation and data, showing good performance with minimal residual bias between the two.\n\n", "2407.11912": "2024-07-16, **The CONUS+ experiment**, The CONUS+ Collaboration et.al., [2407.11912v1](http://arxiv.org/abs/2407.11912v1)\n\n The CONUS+ experiment aims to detect coherent elastic neutrino-nucleus scattering (CEvNS) of reactor antineutrinos on germanium nuclei in the fully coherent regime, continuing on this way the CONUS physics program started at the Brokdorf nuclear power plant, Germany. The CONUS+ setup is installed in the nuclear power plant in Leibstadt, Switzerland, at a distance of 20.7 m from the 3.6 GW thermal power reactor core. The CEvNS signature will be measured with the same four point-contact high-purity germanium (HPGe) detectors produced for the former experiment, however refurbished and with optimized low energy thresholds. To suppress the background in the CONUS+ detectors, the passive and active layers of the original CONUS shield were modified such to fit better to the significantly changed background conditions at the new experimental location. New data acquisition and monitoring systems were developed. A direct network connection between the experiment and the Max-Planck-Institut fur Kernphysik (MPIK) makes it possible to control and monitor data acquisition in real time. The impact of all these modifications is discussed with particular emphasis on the resulting CEvNS signal prediction for the first data collection phase of CONUS+. Prospects of the planned upgrade in a second phase integrating new larger HPGe detectors are also discussed.\n\n", "2407.11892": "2024-07-16, **A Generic Analysis of Nucleon Decay Branching Fractions in Flipped SU(5) Grand Unification**, Koichi Hamaguchi et.al., [2407.11892v1](http://arxiv.org/abs/2407.11892v1)\n\n In flipped SU(5) grand unified theories, the partial decay lifetimes of certain nucleon decay channels depend generically on an unknown unitary matrix, which arises when left-handed lepton fields are embedded into anti-fundamental representations of SU(5). This dependency is particularly relevant when the neutrino mass matrix has a generic structure, introducing uncertainty in the prediction of nucleon decay branching fractions within flipped SU(5). In this paper, we demonstrate that this uncertainty can be parametrized using two parameters, which can be determined by measuring the partial lifetimes of $p \\to \\pi^0 e^+$, $p \\to \\pi^0 \\mu^+$, and $n \\to \\pi^0 \\bar{\\nu}$. In addition, we establish upper limits on the ratios of the decay widths of these channels, offering a potential method to test flipped SU(5) in future nucleon decay experiments.\n\n", "2407.11731": "2024-07-16, **Tying knots in particle physics**, Minoru Eto et.al., [2407.11731v1](http://arxiv.org/abs/2407.11731v1)\n\n Lord Kelvin's pioneering hypothesis that the identity of atoms is knots of vortices of the aether had a profound impact on the fields of mathematics and physics despite being subsequently refuted by experiments. While knot-like excitations emerge in various systems of condensed matter physics, the fundamental constituents of matter have been revealed to be elementary particles such as electrons and quarks, seemingly leaving no room for the appearance of knots in particle physics. Here, we show that knots indeed appear as meta-stable solitons in a realistic extension of the standard model of particle physics that provides the QCD axion and right-handed neutrinos. This result suggests that during the early Universe, a \"knot dominated era\" may have existed, where knots were a dominant component of the Universe, and this scenario can be tested through gravitational wave observations. Furthermore, we propose that the end of this era involves the collapse of the knots via quantum tunneling, leading to the generation of matter-antimatter asymmetry in the Universe. Our findings exhibit the significant role of knots in particle physics and represent a modern version of Kelvin's hypothesis.\n\n", "2407.11410": "2024-07-16, **High-energy neutrino emission from tidal disruption event outflow-cloud interactions**, Hanji Wu et.al., [2407.11410v1](http://arxiv.org/abs/2407.11410v1)\n\n Tidal disruption events (TDEs), characterized by their luminous transients and high-velocity outflows, have emerged as plausible sources of high-energy neutrinos contributing to the diffuse neutrino. In this study, we calculate the contribution of TDEs to the diffuse neutrino by employing the outflow-cloud model within the TDE framework. Our analysis indicates that the contribution of TDEs becomes negligible when the redshift $Z$ exceeds 2. Employing a set of fiducial values, which includes outflow energy $E\\_{\\rm kin}=10^{51}$ erg, a proton spectrum cutoff energy $E\\_{\\rm p,max}=100$ PeV, a volume TDE rate $\\dot{N}=8 \\times 10^{-7}\\ \\rm Mpc^{-3}\\ year^{-1}$, covering fraction of clouds $C\\_V=0.1$, energy conversion efficiency in the shock $\\eta =0.1$, and a proton spectrum index $\\Gamma=-1.7$, we find that TDEs can account for approximately 80\\% of the contribution at energies around 0.3 PeV. Additionally, TDEs still contribute around 18\\% to the IceCube data below 0.1 PeV and the total contribution is $\\sim 24^{+2}\\_{-15}\\%$. In addition, we also discuss the potential influence of various parameter values on the results in detail. With the IceCube data, we impose constraints on the combination of the physical parameters, i.e., $C\\_{f}=\\dot{N}E\\_{\\rm kin}C\\_{\\rm v}\\eta$. Future observations or theoretical considerations would fix some physical parameters, which will help to constrain some individual parameters of TDEs.\n\n", "2407.10965": "2024-07-15, **Negative neutrino masses as a mirage of dark energy**, Willem Elbers et.al., [2407.10965v1](http://arxiv.org/abs/2407.10965v1)\n\n The latest cosmological constraints on the sum of the neutrino masses depend on prior physical assumptions about the mass spectrum. To test the accordance of cosmological and laboratory constraints in the absence of such priors, we introduce an effective neutrino mass parameter that extends consistently to negative values. For the $\\Lambda$CDM model, we analyze data from Planck, ACT, and DESI and find a $2.8-3.3\\sigma$ tension with the constraints from oscillation experiments. Motivated by recent hints of evolving dark energy, we analyze the $w\\_0w\\_a$ and mirage dark energy models, showing that they favour larger masses consistent with laboratory data, respectively $\\sum m\\_{\\nu,\\mathrm{eff}} = 0.06\\_{-0.10}^{+0.15}\\,\\mathrm{eV}$ and $\\sum m\\_{\\nu,\\mathrm{eff}} = 0.04\\_{-0.11}^{+0.15}\\,\\mathrm{eV}$ (both at 68\\%).\n\n", "2407.10962": "2024-07-15, **Benchmarking neutrino interaction models via a comparative analysis of kinematic imbalance measurements from the T2K, MicroBooNE and MINERvA experiments**, Wissal Filali et.al., [2407.10962v1](http://arxiv.org/abs/2407.10962v1)\n\n Recent neutrino-nucleus cross-section measurements of observables characterising kinematic imbalance from the T2K, MicroBooNE and MINERvA experiments are used to benchmark predictions from widely used neutrino interaction event generators. Given the different neutrino energy spectra and nuclear targets employed by the three experiments, comparisons of model predictions to their measurements breaks degeneracies that would be present in any single measurement. In particular, the comparison of T2K and MINERvA measurements offers a probe of energy dependence, whilst a comparison of T2K and MicroBooNE investigates scaling with nuclear target. In order to isolate the impact of individual nuclear effects, model comparisons are made following systematic alterations to: the nuclear ground state; final state interactions and multi-nucleon interaction strength. The measurements are further compared to the generators used as an input to DUNE/SBN and T2K/Hyper-K analyses. Whilst no model is able to quantitatively describe all the measurements, evidence is found for mis-modelling of A-scaling in multi-nucleon interactions and it is found that tight control over how energy is distributed among hadrons following final state interactions is likely to be crucial to achieving improved agreement. Overall, this work provides a novel characterisation of neutrino interactions whilst offering guidance for refining existing generator predictions.\n\n", "2407.10892": "2024-07-15, **First Measurement of Solar $^8$B Neutrino Flux through Coherent Elastic Neutrino-Nucleus Scattering in PandaX-4T**, PandaX Collaboration et.al., [2407.10892v1](http://arxiv.org/abs/2407.10892v1)\n\n The PandaX-4T liquid xenon detector at the China Jinping Underground Laboratory is used to measure the solar $^8$B neutrino flux by detecting neutrinos through coherent scattering with xenon nuclei. Data samples requiring the coincidence of scintillation and ionization signals (paired), as well as unpaired ionization-only signals (US2), are selected with energy threshold of approximately 1.1 keV (0.33 keV) nuclear recoil energy. Combining the commissioning run and the first science run of PandaX-4T, a total exposure of 1.25 and 1.04 tonne$\\cdot$year are collected for the paired and US2, respectively. After unblinding, 3 and 332 events are observed with an expectation of 2.8$\\pm$0.5 and 251$\\pm$32 background events, for the paired and US2 data, respectively. A combined analysis yields a best-fit $^8$B neutrino signal of 3.5 (75) events from the paired (US2) data sample, with $\\sim$37\\% uncertainty, and the background-only hypothesis is disfavored at 2.64$\\sigma$ significance. This gives a solar $^8$B neutrino flux of ($8.4\\pm3.1$)$\\times$10$^6$ cm$^{-2}$s$^{-1}$, consistent with the standard solar model prediction. This is the first indication of solar $^8$B neutrino ``fog'' in a dark matter direct detection experiment.\n\n", "2407.10879": "2024-07-15, **Measurement of the Lund jet plane in hadronic decays of top quarks and W bosons with the ATLAS detector**, ATLAS Collaboration et.al., [2407.10879v1](http://arxiv.org/abs/2407.10879v1)\n\n The Lund jet plane (LJP) is measured for the first time in $t\\overline{t}$ events, using 140 fb$^{-1}$ of $\\sqrt{s}$ = 13 TeV pp collision data collected with the ATLAS detector at the LHC. The LJP is a two-dimensional observable of the sub-structure of hadronic jets that acts as a proxy for the kinematics of parton showers and hadron formation. The observable is constructed from charged particles and is measured for R = 1.0 anti-$k\\_t$ jets with transverse momentum above 350 GeV containing the full decay products of either a top quark or a daughter $W$ boson. The other top quark in the event is identified from its decay into a b-quark, an electron or a muon and a neutrino. The measurement is corrected for detector effects and compared with a range of Monte Carlo predictions sensitive to different aspects of the hadronic decays of the heavy particles. In the $W$-boson-initiated jets, all the predictions are incompatible with the measurement. In the top quark initiated jets, disagreement with all predictions is observed in smaller subregions of the plane, and with a subset of the predictions across the fiducial plane. The measurement could be used to improve the tuning of Monte Carlo generators, for better modelling of hadronic decays of heavy quarks and bosons, or to improve the performance of jet taggers.\n\n", "2407.10821": "2024-07-15, **Astro-COLIBRI: Empowering Citizen Scientists in Time Domain Astronomy**, Fabian Schüssler et.al., [2407.10821v1](http://arxiv.org/abs/2407.10821v1)\n\n In recent decades, astronomy and astrophysics have experienced several fundamental changes. On one hand, there has been a significant increase in the observation of transient phenomena, which are short-lived events such as supernova explosions, fast radio bursts, and gamma-ray bursts. In addition, the detection of a growing number of different cosmic messengers provides researchers with crucial information about these objects. For example, the detection of high-energy neutrinos and gravitational waves regularly complements traditional astronomical observations in the electromagnetic spectrum. This trend is expected to intensify in the coming years with the commissioning of a wide variety of next-generation observatories, which will enable more in-depth studies of the transient sky.   To enhance our understanding and optimize the observations of these phenomena, we have developed the Astro-COLIBRI platform. It is freely available to amateur and professional astronomers in the form of a smartphone application (iOS and Android), a web interface, an API, and a chatbot 'Astro-COLIBRI GPT', among many other features. Astro-COLIBRI serves as a central access point for information on astrophysical sources and transient events, allowing a wide network of observers to track and receive real-time alerts.   Here we highlight the key features of Astro-COLIBRI, with a particular emphasis on recent innovations. These include a discussion forum that facilitates user interactions and our strengthened collaboration with various networks of amateur astronomers.\n\n", "2407.10741": "2024-07-15, **Optimizing the light output of a plastic scintillator and SiPM based detector through optical characterization and simulation: A case study for POLAR-2**, Nicolas De Angelis et.al., [2407.10741v1](http://arxiv.org/abs/2407.10741v1)\n\n The combination of plastic scintillators with Silicon Photo-Multipliers (SiPMs) is widely used for detecting radiation in high-energy astrophysics, particle physics, neutrino physics, or medical physics. An example of application for this kind of detectors are Compton polarimeters such as POLAR-2 or LEAP, for which a low-Z material is needed for the Compton effect to be dominant down to as low energy as possible. Such detectors aim to measure low energy Compton depositions which produce small amounts of optical light, and for which optimizing the instrumental optical properties consequently imperative.   The light collection efficiency of such a device was studied with a focus on the POLAR-2 GRB polarimeter, in which the conversion of incoming $\\gamma$-rays into readable signal goes through the production and collection of optical light, which was to be optimized both through measurements and simulations. The optical elements of the POLAR-2 polarimeter prototype module were optically characterized and an optical simulation based on Geant4 was developed to fully model its optical performances. The results from simulations were used to optimize the design and finally to verify its performance. The study resulted in a detector capable of measuring energy depositions of several keV. In addition an important finding of this work is the impact of the plastic scintillator surface roughness on the light collection. It was found that a plastic scintillator with a higher scintillation efficiency but made of a softer material, hence with a rougher surface, was not necessarily the best option to optimize the light collection. Furthermore, in order to optimize the optical crosstalk between different channels, a production technique for very thin ($\\sim$150$~\\mu$m) and reusable silicone-based optical coupling pads, which can be applied for other experiments, was developed.\n\n", "2407.10717": "2024-07-15, **Search for long-lived heavy neutral leptons in proton-proton collision events with a lepton-jet pair associated with a secondary vertex at $\\sqrt{s}$ = 13 TeV**, CMS Collaboration et.al., [2407.10717v1](http://arxiv.org/abs/2407.10717v1)\n\n A search for long-lived heavy neutral leptons (HNLs) using proton-proton collision data corresponding to an integrated luminosity of 138 fb$^{-1}$ collected at $\\sqrt{s}$ = 13 TeV with the CMS detector at the CERN LHC is presented. Events are selected with a charged lepton originating from the primary vertex associated with the proton-proton interaction, as well as a second charged lepton and a hadronic jet associated with a secondary vertex that corresponds to the semileptonic decay of a long-lived HNL. No excess of events above the standard model expectation is observed. Exclusion limits at 95% confidence level are evaluated for HNLs that mix with electron and/or muon neutrinos. Limits are presented in the mass range of 1-16.5 GeV, with excluded square mixing parameter values reaching as low as 2 $\\times$ 10$^{-7}$. For masses above 11 GeV, the presented limits exceed all previous results in the semileptonic decay channel, and for some of the considered scenarios are the strongest to date.\n\n", "2407.10692": "2024-07-15, **Vacuum energy density from the form factor bootstrap**, André LeClair et.al., [2407.10692v1](http://arxiv.org/abs/2407.10692v1)\n\n The form-factor bootstrap is incomplete until one normalizes the zero-particle form factor. For the stress energy tensor we describe how to obtain the vacuum energy density $\\rho\\_{\\rm vac}$, defined as $\\langle 0\\| T\\_{\\mu\\nu} \\| 0 \\rangle = \\rho\\_{\\rm vac} \\, g\\_{\\mu\\nu}$, from the form-factor bootstrap. Even for integrable QFT's in D=2 spacetime dimensions, this prescription is new, although it reproduces previously known results obtained in a different and more difficult thermodynamic Bethe ansatz computation. We propose a version of this prescription in D=4 dimensions. For these even dimensions, the vacuum energy density has the universal form $\\rho\\_{\\rm vac} \\propto m^D/\\mathfrak{g}$ where $\\mathfrak{g}$ is a dimensionless interaction coupling constant which can be determined from the high energy behavior of the S-matrix. In the limit $\\mathfrak{g} \\to 0$, $\\rho\\_{\\rm vac} $ diverges due to well understood UV divergences in free quantum field theories. If we assume the the observed Cosmological Constant originates from the vacuum energy density $\\rho\\_{\\rm vac}$ computed as proposed here, then this suggests there must exist a particle which does not obtain its mass from spontaneous symmetry breaking in the electro-weak sector, which we designate as the ``zeron\". A strong candidate for the zeron is a massive Majorana neutrino.\n\n", "2407.10604": "2024-07-15, **Muon-induced collisional flavor instability in core-collapse supernova**, Jiabao Liu et.al., [2407.10604v1](http://arxiv.org/abs/2407.10604v1)\n\n Neutrinos are known to undergo flavor conversion among their three flavors. In the theoretical modeling of core-collapse supernova (CCSN), there has been a great deal of attention to recent discoveries of a new type of neutrino flavor conversions, namely collisional flavor instability (CFI), in which the instability is induced by the flavor-dependent decoherence due to the disparity of neutrino-matter interactions among flavors. In this paper, we study how the appearance of on-shell muons and associated neutrino-matter interactions can impact CFIs based on linear stability analysis of flavor conversions. Some striking results emerge from the present study. First, we analytically show that breaking beta- and pair equilibrium is a necessary condition to trigger CFIs. This also indicates that CFIs with on-shell muons could appear in $e \\tau$ and $\\mu \\tau$ neutrino mixing sectors in very high-density region ($\\gtrsim 10^{13} {\\rm g/cm^{3}}$), exhibiting a possibility of large impacts of CFIs on CCSN. Second, resonance-like CFIs, having a much higher growth rate than normal CFIs, can be triggered by muons. The resonance point of CFIs is different between $e \\tau$ and $\\mu \\tau$ sectors; the former (latter) occurs at $\\mu\\_{e (\\mu)} = \\mu\\_{n} - \\mu\\_{p}$, where $\\mu\\_{i}$ denotes the chemical potential of $i$ constitute ($n$ and $p$ represent neutrons and protons, respectively). Our result suggests that the non-linear evolution of CFI with on-shell muons would induce flavor conversions with the complex interplay among all three different neutrino-mixing sectors.\n\n", "2407.10560": "2024-07-15, **Confronting the low-scale seesaw and leptogenesis with neutrinoless double beta decay**, J. de Vries et.al., [2407.10560v1](http://arxiv.org/abs/2407.10560v1)\n\n We revisit the impact of heavy neutrinos with masses in the MeV-GeV range on neutrinoless double beta decay ($0\\nu\\beta\\beta$) in view of updated results for the lifetime of this process. Working in a minimal realistic extension of the Standard Model by two right-handed neutrino flavours, we show that the non-observation of $0\\nu\\beta\\beta$ will impose strong bounds on the heavy neutrino properties that are complementary to the limits obtained from Big Bang Nucleosynthesis and collider searches. For an inverted mass hierarchy of the light neutrinos we find that improved limits on $0\\nu\\beta\\beta$ from next-generation experiments will restrict the allowed parameter space for fixed mass splitting to narrow bands in the mass-mixing plane. Further combining this with the requirement to explain the baryon asymmetry of the universe via leptogenesis reduces these bands to windows in parameter space that are constrained in all directions and can be targeted by direct searches at accelerators. For a normal mass hierarchy, only parts of the parameter space can be probed by such experiments.\n\n", "2407.10422": "2024-07-15, **A Semi-Empirical Formula for Two-Neutrino Double-Beta Decay**, Ovidiu Niţescu et.al., [2407.10422v1](http://arxiv.org/abs/2407.10422v1)\n\n We propose a semi-empirical formula for calculating the nuclear matrix elements for two-neutrino double-beta decay. The proposed model (PM) dependence on the proton and neutron numbers, the pairing, isospin, and deformation properties of the initial and final nuclei is inspired by the insights offered by nuclear many-body methods. Compared with the previous phenomenological and nuclear models, the PM yields the best agreement with the experimental data. Its stability and predictive power are cross-validated, and predictions for nuclear systems of experimental interest are provided.\n\n", "2407.10365": "2024-07-15, **Implications of scattering for CMB foreground emission modelling**, Jia-Rui Li et.al., [2407.10365v1](http://arxiv.org/abs/2407.10365v1)\n\n Context. The extreme precision and accuracy of forthcoming observations of CMB temperature and polarization anisotropies, aiming to detect the tiny signatures of primordial gravitational waves or of light relic particles beyond the standard three light neutrinos, requires commensurate precision in the modelling of foreground Galactic emission that contaminates CMB observations.   Aims. We evaluate the impact of second-order effects in Galactic foreground emission due to Thomson scattering off interstellar free electrons and to Rayleigh scattering off interstellar dust particles.   Methods. We use existing sky survey data and models of the distribution of free electrons and dust within the Milky Way to estimate the amplitude and power spectra of the emission originating from radiation scattered either by free electrons or by dust grains at CMB frequencies.   Results. Both processes generate corrections to the total emission that are small compared to direct emission, and are small enough not to pose problems for current-generation observations.   Conclusions. However, B-modes generated by Thomson scattering of incoming radiation by interstellar free electrons at CMB frequencies are within an order of magnitude of the sensitivity of the most advanced forthcoming CMB telescopes, and might require more precise evaluation in the future.\n\n"}, "dark matter": {"2407.11737": "2024-07-16, **A $\\sim 43$ GeV $γ$-ray line signature in the directions of a group of nearby massive galaxy clusters**, Yi-Zhong Fan et.al., [2407.11737v1](http://arxiv.org/abs/2407.11737v1)\n\n As the largest gravitationally bound objects in the Universe, galaxy clusters have provided the first piece of evidence for the presence of dark matter and may be suitable targets for indirect dark matter searches. Among various signals, the GeV-TeV $\\gamma$-ray line has been taken as the smoking-gun signal of the dark matter annihilation/decay since no known astrophysical/physical process(es) could generate such a peculiar spectrum. With 15.5 years of Fermi-LAT P8R3 publicly available data, we search for the $\\gamma$-ray line emission in the directions of a group of 13 nearby massive galaxy clusters with an unbinned likelihood analysis. A $\\gamma$-ray line signal at $\\sim 43.2$ GeV has a net TS value of $\\approx 30$ if we only take into account the data in the directions of Virgo, Fornax and Ophiuchus clusters, three massive clusters with the highest J-factors expected to generate the dark matter annihilation signal. The signal still presents when the data of other 10 nearby massive clusters have also been included, though the TS value decreases to $\\approx 21$ likely because of their lower signal-to-noise ratios. The absence of this signal in the inner Galaxy disfavors both the instrumental effect and the canonical dark matter annihilation interpretation, and a more sophisticated dark matter model or very peculiar astrophysical scenario might be needed. This $\\gamma$-ray line signal, if intrinsic, could be unambiguously verified by the Very Large Area $\\gamma$-ray Space Telescope in its first two years of performance.\n\n", "2407.11653": "2024-07-16, **Particle Conversions Beyond the WKB Approximation and Solar-Induced Gravitational Waves from Dark Photon Dark Matter**, Tengyu Ai et.al., [2407.11653v1](http://arxiv.org/abs/2407.11653v1)\n\n We investigate the conversion of kinetic mixing dark photon dark matter into gravitational waves within the magnetic field of the Sun. Our study reveals that the WKB approximation is invalid in this scenario. We derive an analytic solution for the conversion probability with unitary evolution feature. This solution aligns in form with previous studies on photon-gravitational wave conversion. Interestingly, it is applicable in situations where the WKB approximation fails. We extend the unitary evolution solution to other conversion processes, such as axion-photon and dark photon-photon conversions. When the WKB approximation conditions are met, this solution reduces to the WKB result. We compute the characteristic strain of gravitational waves resulting from dark photon conversion in the solar magnetic field, spanning frequencies from $10^{-5}$ Hz to $10^3$ Hz. Our findings indicate that the characteristic strain derived from the unitary evolution solution differs significantly from that of the WKB solution. The resulting strain signal is far below the sensitivity of current gravitational wave interferometers. Nevertheless, we have proposed an exotic gravitational wave source, especially at high frequencies, from the dark photon dark matter local conversion inside the Sun.\n\n", "2407.11535": "2024-07-16, **Tidal Disruption of Stars by Supermassive Black Holes and Naked Singularities with Scalar Hair**, Eduardo Andre et.al., [2407.11535v1](http://arxiv.org/abs/2407.11535v1)\n\n In this paper we study tidal forces near strongly gravitating objects at the centers of galaxies. In our approach, dark matter surrounding the centers of galaxies is modeled by a nonlinear scalar field. We focus on static, asymptotically flat, spherically symmetric black holes and naked singularities supported by a real self-gravitating scalar field minimally coupled to gravity. We consider the influence of dark matter on the tidal forces caused by the central objects and some features of the motion of matter near these configurations. It turns out, first, that the event horizon radius of a scalar field black hole can be arbitrarily small as well as the radius of the innermost stable circular orbit, and tidal forces near this orbit can be very large. Second, we show that if strongly gravitating objects in the centers of galaxies are naked singularities, then bright flares (tidal disruption events) in the nuclei of galaxies can be explained in different way. In the vicinity of a scalar field naked singularity, baryonic matter is concentrated in the gravitational potential well forming a \"gray shell\" consisting of cold compressed matter. In this case, the flares are caused by the collisions of stars with this shell.\n\n", "2407.11246": "2024-07-15, **Robust Quantum Control via Multipath Interference for Thousandfold Phase Amplification in a Resonant Atom Interferometer**, Yiping Wang et.al., [2407.11246v1](http://arxiv.org/abs/2407.11246v1)\n\n We introduce a novel technique for enhancing the robustness of light-pulse atom interferometers against the pulse infidelities that typically limit their sensitivities. The technique uses quantum optimal control to favorably harness the multipath interference of the stray trajectories produced by imperfect atom-optics operations. We apply this method to a resonant atom interferometer and achieve thousand-fold phase amplification, representing a fifty-fold improvement over the performance observed without optimized control. Moreover, we find that spurious interference can arise from the interplay of spontaneous emission and many-pulse sequences and demonstrate optimization strategies to mitigate this effect. Given the ubiquity of spontaneous emission in quantum systems, these results may be valuable for improving the performance of a diverse array of quantum sensors. We anticipate our findings will significantly benefit the performance of matter-wave interferometers for a variety of applications, including dark matter, dark energy, and gravitational wave detection.\n\n", "2407.11169": "2024-07-15, **Supermassive black hole formation in the initial collapse of axion dark matter**, Pierre Sikivie et.al., [2407.11169v1](http://arxiv.org/abs/2407.11169v1)\n\n Axion dark matter thermalizes by gravitational self-interactions and forms a Bose-Einstein condensate. We show that the rethermalization of the axion fluid during the initial collapse of large scale overdensities near cosmic dawn transports angular momentum outward sufficientlly fast that black holes form with masses ranging from approximately $10^5$ to a few times $10^{10}~M\\_\\odot$.\n\n", "2407.11154": "2024-07-15, **Pattern speed evolution of barred galaxies in TNG50**, Marcin Semczuk et.al., [2407.11154v1](http://arxiv.org/abs/2407.11154v1)\n\n Galactic bars are found in the majority of disc galaxies. They rotate nearly rigidly with an angular frequency called pattern speed. Previous idealised simulations have shown that bar pattern speed decreases with time due to dynamical friction exerted by the dark matter halo, while cold gas can reduce or even reverse this trend. We want to understand how different galaxy properties affect the evolution of the bar pattern speed in more realistic situations, including ongoing star formation, mass infall, AGN feedback and galaxy interactions. We used the high-resolution run TNG50-1 of the magnetohydrodynamical cosmological simulations suite IllustrisTNG to trace the pattern speed of simulated bars and see how it depends on various galaxy properties. Simulated bars with initially high pattern speed and a subsequent rapid slowdown are more likely found in more massive galaxies. Lower mass galaxies, on the other hand, preferentially host bars that start at relatively low pattern speeds and retain the same value until the end of the simulation. More massive barred galaxies are also more affected by the AGN feedback, which removes (or heats up) the cold gas that could have prevented the slowdown. We find that bars grow and strengthen with slowdown, in agreement with higher resolution simulations. We find that strong correlations between the bar slowdown rate and galaxy mass weaken considerably when we use dimensionless measures to quantify the slowdown. In TNG50, the AGN feedback prescription amplifies the mass dependence. Turned around, this provides an interesting statistic to constrain subgrid physics by bar growth/slowing.\n\n", "2407.11139": "2024-07-15, **Globular cluster orbital decay in dwarf galaxies with MOND and CDM: Impact of supernova feedback**, M. Bílek et.al., [2407.11139v1](http://arxiv.org/abs/2407.11139v1)\n\n Dynamical friction works very differently for Newtonian gravity with dark matter and in modified Newtonian dynamics (MOND). While the absence of dark matter considerably reduces the friction in major galaxy mergers, analytic calculations indicate the opposite for very small perturbations, such as globular clusters (GCs) sinking in dwarf galaxies. Here, we study the decay of GCs in isolated gas-rich dwarf galaxies using simulations with the Phantom of Ramses code, which enables both the Newtonian and the QUMOND MOND gravity. We modeled the GCs as point masses, and we simulated the full hydrodynamics, with star formation and supernovae feedback. We explored whether the fluctuations in gravitational potential caused by the supernovae can prevent GCs from sinking toward the nucleus. For GCs of typical mass or lighter, we find that this indeed works in both Newtonian and MOND simulations. The GC can even make a random walk. However, we find that supernovae cannot prevent massive GCs ($M\\geq 4\\times10^5\\,M\\_\\odot$) from sinking in MOND. The resulting object looks similar to a galaxy with an offset core, which embeds the sunk GC. The problem is much milder in the Newtonian simulations. This result thus favors Newtonian over QUMOND gravity, but we note that it relies on the correctness of the difficult modeling of baryonic feedback. We propose that the fluctuations in the gravitational potential could be responsible for the thickness of the stellar disks of dwarf galaxies and that strong supernova winds in modified gravity can transform dwarf galaxies into ultra-diffuse galaxies.\n\n", "2407.11112": "2024-07-15, **A Nuclear Interferometer for Ultra-Light Dark Matter Detection**, Hannah Banks et.al., [2407.11112v1](http://arxiv.org/abs/2407.11112v1)\n\n We propose the nuclear interferometer - a single-photon interferometry experiment based upon the thorium-229 nuclear clock transition - as a novel detector for ultra-light dark matter (ULDM). Thanks to the enhanced sensitivity of this transition to the variation of fundamental constants, we find that possible realisations of such an experiment deploying either single ions or clouds of atoms have the potential to be complementary to advanced very-long-baseline terrestrial clock atom interferometers in the search for ultra-light dark matter with scalar couplings to photons. Nuclear interferometry may also offer an unparalleled window to new physics coupling to the QCD sector via quarks or gluons, with a discovery reach that could enhance existing and proposed experiments over a range of frequencies in the direction of well-motivated parameter space.\n\n", "2407.10900": "2024-07-15, **Accelerated by Dark Matter: a High-redshift Pathway to Efficient Galaxy-scale Star Formation**, Michael Boylan-Kolchin et.al., [2407.10900v1](http://arxiv.org/abs/2407.10900v1)\n\n In the local Universe, star formation is typically inefficient both globally and when considered as the fraction of gas converted into stars per local free-fall time. An important exception to this inefficiency is regions of high gravitational accelerations $g$, or equivalently surface densities $\\Sigma = g/(\\pi\\,G)$, where stellar feedback is insufficient to overcome the self-gravity of dense gas clouds. In this paper, I explore whether dark matter can play an analogous role in providing the requisite accelerations on the scale of entire galaxies in the early cosmos. The key insight is that characteristic accelerations in dark matter halos scale as $(1+z)^2$ at fixed halo mass. I show this is sufficient to make dark matter the source of intense accelerations that might induce efficient star formation on galactic scales at cosmic dawn in sufficiently massive halos. The mass characterizing this regime scales as $(1+z)^{-6}$ and corresponds to a relatively constant comoving number density of $n(>\\!M\\_{\\rm vir}) \\approx 10^{-4}\\,{\\rm Mpc}^{-3}$ at $z \\gtrsim 8$. For somewhat rarer halos, this model predicts stellar masses of $M\\_{\\star} \\sim 10^{9}\\,M\\_{\\odot}$ can form in regions that end up with sizes $\\mathcal{O}(100\\,{\\rm pc})$ over $40\\,{\\rm Myr}$ time-scales at $z\\approx 12-14$; these numbers compare well to measurements for some of the brightest galaxies at that epoch from James Webb Space Telescope (JWST) observations. Dark matter and standard cosmological evolution may therefore be crucial for explaining the surprisingly high levels of star formation in the early Universe revealed by JWST.\n\n", "2407.10716": "2024-07-15, **First mechanical realization of a tunable dielectric haloscope for the MADMAX axion search experiment**, The MADMAX Collaboration et.al., [2407.10716v1](http://arxiv.org/abs/2407.10716v1)\n\n MADMAX, a future experiment to search for axion dark matter, is based on a novel detection concept called the dielectric haloscope. It consists of a booster composed of several dielectric disks positioned with $\\mu$m precision. A prototype composed of one movable disk was built to demonstrate the mechanical feasibility of such a booster in the challenging environment of the experiment: high magnetic field to convert the axions into photons and cryogenic temperature to reduce the thermal noise. It was tested both inside a strong magnetic field up to 1.6 T and at cryogenic temperatures down to 35K. The measurements of the velocity and positioning accuracy of the disk are shown and are found to match the MADMAX requirements.\n\n", "2407.10618": "2024-07-15, **Novel bounds on decaying axion-like-particle dark matter from the cosmic background**, S. Porras-Bedmar et.al., [2407.10618v1](http://arxiv.org/abs/2407.10618v1)\n\n The Cosmic Background (CB) is defined as the isotropic diffuse radiation field with extragalactic origin found across the electromagnetic spectrum. Different astrophysical sources dominate the CB emission at different energies, such as stars in the optical or active galactic nuclei in X-rays. Assuming that dark matter consists of axions or axion-like particles with masses on the order of electron volts or higher, we expect an additional contribution to the CB due to their decay into two photons. Here, we model the CB between the optical and X-ray regimes, and include the contribution of decaying axions. Through a comparison with the most recent direct and indirect CB measurements, we constrain the axion parameter space between masses $0.5\\, \\mathrm{eV}\\, - 10^7\\,\\mathrm{eV}$ and improve previous limits on axion-photon coupling derived from the CB by roughly an order of magnitude, also reaching the QCD band. We further study the contribution of axions decaying in the Milky Way halo and characterize the axion parameters that would explain the tentative excess CB emission observed with the LORRI instrument on-board the New Horizons probe.\n\n", "2407.10585": "2024-07-15, **Efficient hybrid technique for generating sub-grid haloes in reionization simulations**, Ankur Barsode et.al., [2407.10585v1](http://arxiv.org/abs/2407.10585v1)\n\n Simulating the distribution of cosmological neutral hydrogen (HI) during the epoch of reionization requires a high dynamic range and is hence computationally expensive. The size of the simulation is dictated by the largest scales one aims to probe, while the resolution is determined by the smallest dark matter haloes capable of hosting the first stars. We present a hybrid approach where the density and tidal fields of a large-volume, low-resolution simulation are combined with small haloes from a small-volume, high-resolution box. By merging these two boxes of relatively lower dynamic range, we achieve an effective high-dynamic range simulation using only 13% of the computational resources required for a full high-dynamic range simulation. Our method accurately reproduces the one- and two-point statistics of the halo field, its cross-correlation with the dark matter density field, and the two-point statistics of the HI field computed using a semi-numerical code, all within 10% accuracy at large scales and across different redshifts. Our technique, combined with semi-numerical models of reionization, provides a resource-efficient tool for modeling the HI distribution at high redshifts.\n\n", "2407.10549": "2024-07-15, **Search for dark matter produced in association with a dark Higgs boson in the $b\\bar{b}$ final state using $pp$ collisions at $\\sqrt{s}=13$ TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2407.10549v1](http://arxiv.org/abs/2407.10549v1)\n\n A search is performed for dark matter particles produced in association with a resonantly produced pair of $b$-quarks with $30< m\\_{bb}<150$ GeV using 140 fb$^{-1}$ of proton-proton collisions at a center-of-mass energy of 13 TeV recorded by the ATLAS detector at the LHC. This signature is expected in extensions of the Standard Model predicting the production of dark matter particles, in particular those containing a dark Higgs boson $s$ that decays into $b\\bar{b}$. The highly boosted $s \\rightarrow b\\bar{b}$ topology is reconstructed using jet reclustering and a new identification algorithm. This search places stringent constraints across regions of the dark Higgs model parameter space that satisfy the observed relic density, excluding dark Higgs bosons with masses between $30$ and $150$ GeV in benchmark scenarios with $Z'$ mediator masses up to $4.8$ TeV at 95% confidence level.\n\n"}, "supernova": {"2407.11428": "2024-07-16, **Dynamical system analysis in modified Galileon cosmology**, L. K. Duchaniya et.al., [2407.11428v1](http://arxiv.org/abs/2407.11428v1)\n\n In this paper, we have investigated the phase space analysis in modified Galileon cosmology, where the Galileon term is considered a coupled scalar field, $F(\\phi)$. We focus on the exponential type function of $F(\\phi)$ and the three well-motivated potential functions $V(\\phi)$. We obtain the critical points of the autonomous system, along with their stability conditions and cosmological properties. The critical points of the autonomous system describe different phases of the Universe. In the results of our analysis, we have found the scaling solution for critical points, which determine different evolutionary eras for the Universe. The dark-energy-dominated critical points show stable behavior and indicate the Universe's late-time cosmic acceleration phase. Further, the results are examined with the cosmological data sets of the Hubble rate $H(z)$ and the Supernovae Ia.\n\n", "2407.11341": "2024-07-16, **SN 2021dbg: A Luminous Type IIP-IIL Supernova Exploding from a Massive Star with a Layered Shell**, Zeyi Zhao et.al., [2407.11341v1](http://arxiv.org/abs/2407.11341v1)\n\n We present extensive observations and analysis of supernova (SN) 2021dbg, utilizing optical photometry and spectroscopy. For approximately 385 days following the explosion, SN 2021dbg exhibited remarkable luminosity, surpassing most SNe II. This initial high luminosity is potentially attributed to the interaction between the ejected material and the surrounding circumstellar material (CSM), as evidenced by the pronounced interaction signatures observed in its spectra. The subsequent high luminosity is primarily due to the significant $^{56}$Ni ($0.17 \\pm 0.05$ M$\\_{\\odot}$) produced in the explosion. Based on the flux of flash emission lines detected in the initial spectra, we estimate that the CSM mass near the progenitor amounted to $\\sim$(1.0--2.0) $\\times 10^{-3}$ M$\\_{\\odot}$, likely resulting from intense stellar wind activity 2--3 yr preceding the explosion. Considering the bolometric light curve, nebular spectrum modeling, and mass-loss rate, we suggest that the progenitor of SN 2021dbg was a red supergiant (RSG) with a mass of $\\sim 20$ M$\\_{\\odot}$ and a radius of 1200 R$\\_{\\odot}$. This RSG featured a thick hydrogen shell, which may have contained a region with a sharp decrease in material density, electron density, and temperature, contributing to its layered structure. This object demonstrates mixed features of SNe IIP and SNe IIL, making it as a transitional event linking the above two subclasses of SNe II.\n\n", "2407.11139": "2024-07-15, **Globular cluster orbital decay in dwarf galaxies with MOND and CDM: Impact of supernova feedback**, M. Bílek et.al., [2407.11139v1](http://arxiv.org/abs/2407.11139v1)\n\n Dynamical friction works very differently for Newtonian gravity with dark matter and in modified Newtonian dynamics (MOND). While the absence of dark matter considerably reduces the friction in major galaxy mergers, analytic calculations indicate the opposite for very small perturbations, such as globular clusters (GCs) sinking in dwarf galaxies. Here, we study the decay of GCs in isolated gas-rich dwarf galaxies using simulations with the Phantom of Ramses code, which enables both the Newtonian and the QUMOND MOND gravity. We modeled the GCs as point masses, and we simulated the full hydrodynamics, with star formation and supernovae feedback. We explored whether the fluctuations in gravitational potential caused by the supernovae can prevent GCs from sinking toward the nucleus. For GCs of typical mass or lighter, we find that this indeed works in both Newtonian and MOND simulations. The GC can even make a random walk. However, we find that supernovae cannot prevent massive GCs ($M\\geq 4\\times10^5\\,M\\_\\odot$) from sinking in MOND. The resulting object looks similar to a galaxy with an offset core, which embeds the sunk GC. The problem is much milder in the Newtonian simulations. This result thus favors Newtonian over QUMOND gravity, but we note that it relies on the correctness of the difficult modeling of baryonic feedback. We propose that the fluctuations in the gravitational potential could be responsible for the thickness of the stellar disks of dwarf galaxies and that strong supernova winds in modified gravity can transform dwarf galaxies into ultra-diffuse galaxies.\n\n", "2407.10929": "2024-07-15, **Evidence of gradients of density and magnetic field in the remnant of Tycho's supernova**, Oleh Petruk et.al., [2407.10929v1](http://arxiv.org/abs/2407.10929v1)\n\n By using surface brightness maps of Tycho's supernova remnant (SNR) in radio and X-rays, along with the properties of thermal and synchrotron emission, we have derived the post-shock density and magnetic field strength distributions over the projection of this remnant. Our analysis reveals a density gradient oriented towards the north-west, while the magnetic field strength gradient aligns with the Galactic plane, pointing eastward. Additionally, utilizing this magnetic field map, we have derived the spatial distributions of the cut-off frequency and maximum energy of electrons in Tycho's SNR. We further comment on the implications of these findings for interpreting the gamma-ray emission from Tycho's SNR.\n\n", "2407.10845": "2024-07-15, **Inferring dark energy properties from the scale factor parametrisation**, Upala Mukhopadhayay et.al., [2407.10845v1](http://arxiv.org/abs/2407.10845v1)\n\n We propose and implement a novel test to assess deviations from well-established concordance $\\Lambda$CDM cosmology while inferring dark energy properties. In contrast to the commonly implemented parametric forms of the dark energy equation-of-state (EoS), we test the validity of the cosmological constant on the more fundamental scale factor [$a(t)$] which determines the expansion rate of the Universe. We constrain our extended `general model' for the expansion history using the late-time cosmological observables, namely Baryon Acoustic Oscillations (BAO) and Supernovae. As a primary inference, we contrast the BAO compilations from the completed SDSS and the more recent DESI. We find that the former deviates from the $\\Lambda$CDM scenario at a mild $\\sim 2\\sigma$ level while the latter is completely consistent with the standard picture when the dark energy properties are inferred. We find that the posterior of the dark energy EoS is mainly constrained to be quintessence-like, however, we demonstrate the rich phenomenology of dark energy behaviour that can be obtained in our general model wrt to the $\\Lambda$CDM.\n\n", "2407.10729": "2024-07-15, **Testing the Molecular Cloud Paradigm for Ultra-High-Energy Gamma Ray Emission from the Direction of SNR G106.3+2.7**, R. Alfaro et.al., [2407.10729v1](http://arxiv.org/abs/2407.10729v1)\n\n Supernova remnants (SNRs) are believed to be capable of accelerating cosmic rays (CRs) to PeV energies. SNR G106.3+2.7 is a prime PeVatron candidate. It is formed by a head region, where the pulsar J2229+6114 and its boomerang-shaped pulsar wind nebula are located, and a tail region containing SN ejecta. The lack of observed gamma ray emission from the two regions of this SNR has made it difficult to assess which region would be responsible for the PeV CRs. We aim to characterize the very-high-energy (VHE, 0.1-100 TeV) gamma ray emission from SNR G106.3+2.7 by determining the morphology and spectral energy distribution of the region. This is accomplished using 2565 days of data and improved reconstruction algorithms from the HAWC Observatory. We also explore possible gamma ray production mechanisms for different energy ranges. Using a multi-source fitting procedure based on a maximum-likelihood estimation method, we evaluate the complex nature of this region. We determine the morphology, spectrum, and energy range for the source found in the region. Molecular cloud information is also used to create a template and evaluate the HAWC gamma ray spectral properties at ultra-high-energies (UHE, >56 TeV). This will help probe the hadronic nature of the highest-energy emission from the region. We resolve one extended source coincident with all other gamma ray observations of the region. The emission reaches above 100~TeV and its preferred log-parabola shape in the spectrum shows a flux peak in the TeV range. The molecular cloud template fit on the higher energy data reveals that the SNR's energy budget is fully capable of producing a purely hadronic source for UHE gamma rays.\n\n", "2407.10470": "2024-07-15, **Forecast of strongly lensed supernovae rates in the China Space Station Telescope surveys**, Jiang Dong et.al., [2407.10470v1](http://arxiv.org/abs/2407.10470v1)\n\n Strong gravitationally lensed supernovae (SNe) are a powerful probe for cosmology and stellar physics. The relative time delays between lensed SN images provide an independent way of measuring a fundamental cosmological parameter -- the Hubble constant -- , the value of which is currently under debate. The time delays also serve as a ``time machine'', offering a unique opportunity to capture the extremely early phase of the SN explosion, which can be used to constrain the SN progenitor and explosion mechanism. Although there are only a handful of strongly lensed SN discoveries so far, which greatly hinders scientific applications, the sample size is expected to grow substantially with next-generation surveys. In this work, we investigate the capability of detecting strongly lensed SNe with the China Space Station Telescope (CSST), a two-meter space telescope to be launched around 2026. Through Monte Carlo simulations, we predict that CSST can detect 1008.53 and 51.78 strongly lensed SNe from its Wide Field Survey (WFS, covering 17,500 deg$^2$) and Deep Field Survey (DFS, covering 400 deg$^2$) over the course of ten years. In both surveys, about 35\\% of the events involve Type Ia SNe as the background sources. Our results suggest that the WFS and DFS of CSST, although not designed or optimized for discovering transients, can still make a great contribution to the strongly lensed SNe studies.\n\n"}}