{"neutrino": {"2306.00960": "2023-06-01, **Hard X-ray emission from blazars associated with high-energy neutrinos**, A. V. Plavin et.al., [2306.00960v1](http://arxiv.org/abs/2306.00960v1)\n\n Bright blazars were found to be prominent neutrino sources, and a number of IceCube events were associated with them. Evaluating high-energy photon emission of such blazars is crucial for better understanding of the processes and regions where neutrinos are produced. Here, we focus on hard X-ray emission observed by the SRG/ART-XC telescope, by the Swift/BAT imager, and by the INTEGRAL/IBIS telescope. Their energy range ~10 keV and above is well-suited for probing photons that potentially participate in neutrino production by interacting with ultrarelativistic protons. We find that neutrino-associated blazars tend to demonstrate remarkably strong X-ray emission compared to other VLBI blazars in the sky, chance coincidence probability is p=0.5%. Both neutrinos and hard X-rays are found to come from blazars at cosmological distances z ~ 1, and are boosted by relativistic beaming that makes it possible to detect them on Earth. Our results suggest that neutrinos are produced within compact blazar jets, with target X-ray photons emitted from accelerated jet regions.\n\n", "2306.00767": "2023-06-01, **Neutrino mass and nature through its mediation in atomic clock interference**, José Bernabeu et.al., [2306.00767v1](http://arxiv.org/abs/2306.00767v1)\n\n The absolute mass of neutrinos and their nature are presently unknown. Aggregate matter has a coherent weak charge leading to a repulsive interaction mediated by a neutrino pair. Near its range at micron distances the virtual neutrinos are non-relativistic, giving a distinct behavior for Dirac versus Majorana mass terms. The magnitude and the distance dependence of the effective potential disentangle these fundamental properties of neutrinos. We propose an experiment to search for this potential based on the concept that the density dependent interaction of an atomic probe with a material source in one arm of an atomic clock interferometer generates a differential phase. The appropriate geometry of the device is selected using the saturation of the weak potential as a guide. The proposed experiment has the added benefit of being sensitive to gravity at micron distances. A strategy to suppress the competing Casimir-Polder interaction, depending on the electronic structure of the material source, as well as a way to compensate the gravitational interaction in the two arms of the interferometer is discussed.\n\n", "2306.00657": "2023-06-01, **Associated Production of Fermionic Dark Matter and Neutrino at the Future Lepton Colliders**, Shao-Feng Ge et.al., [2306.00657v1](http://arxiv.org/abs/2306.00657v1)\n\n In light of the fermionic dark matter absorption on electron target that can be observed by direct detection experiments, we study its complementary searches at the future $e^+ e^-$ colliders such as CEPC, FCC-ee, ILC, and CLIC. Two typical processes, the mono-photon and electron-positron pair production associated with missing energy, can serve the purpose. While the mono-photon search prevails at CEPC, FCC-ee, and ILC, the $e^+ e^-E\\_{T}^{\\rm miss}$ channel has more significant contributions at CLIC with much higher collision energy $\\sqrt s$. The beam polarizations can help further suppressing the SM backgrounds to enhance the signal significance while differential cross sections can distinguish the Lorentz structure of various effective operators. The combined sensitivity can reach well above 1 TeV at CEPC/FCC-ee and ILC while it further touches 30 TeV at CLIC. Comparing with the updated results from the dark matter direct detection experiments (XENON1T, PandaX-II, PandaX-4T, LZ, and XENONnT), astrophysical $X/\\gamma$ observations, and cosmological constraints, the collider searches can not just provide better sensitivity for light dark matter mass but also scan much wider mass range.\n\n", "2306.00517": "2023-06-01, **Exploring the dark sectors via the cooling of white dwarfs**, Jaime Hoefken Zink et.al., [2306.00517v1](http://arxiv.org/abs/2306.00517v1)\n\n As dense and hot bodies with a well-understood equation of state, white dwarfs offer a unique opportunity to investigate new physics. In this paper, we examine the role of dark sectors, which are extensions of the Standard Model of particle physics that are not directly observable, in the cooling process of white dwarfs. Specifically, we examine the role of a dark photon, within the framework of a three-portal Model, in enhancing the neutrino emission during the cooling process of white dwarfs. We compare this scenario to the energy release predicted by the Standard Model. By analyzing the parameter space of dark sectors, our study aims to identify regions that could lead to significant deviations from the expected energy release of white dwarfs.\n\n", "2306.00368": "2023-06-01, **Dynamical Inflation Stimulated Cogenesis**, Debasish Borah et.al., [2306.00368v1](http://arxiv.org/abs/2306.00368v1)\n\n We propose a minimal setup that realises dynamical inflection point inflation, and, using the same field content, generates neutrino masses, a baryon asymmetry of the universe, and dark matter. A dark $SU(2)\\_D$ gauge sector with a dark scalar doublet playing the role of inflaton is considered along with several doublet and singlet fermions sufficient to realise multiple inflection points in the inflaton potential. The singlet fermions couple to SM leptons and generate neutrino masses via the inverse seesaw mechanism. Those fermions also decay asymmetrically and out of equilibrium, generating a baryon asymmetry via leptogenesis. Some of the fermion doublets are dark matter, and they are produced via freeze-in annihilation of the same fermions that generate the lepton asymmetry. Reheating, leptogenesis, and dark matter are all at the TeV scale.\n\n", "2306.00332": "2023-06-01, **Gravitational Wave Signatures of Gauged Baryon and Lepton Number**, Jessica Bosch et.al., [2306.00332v1](http://arxiv.org/abs/2306.00332v1)\n\n We demonstrate that novel types of gravitational wave signatures arise in theories with new gauge symmetries broken at high energy scales. For concreteness, we focus on models with gauged baryon number and lepton number, in which neutrino masses are generated via the type I seesaw mechanism, leptogenesis occurs through the decay of a heavy right-handed neutrino, and one of the new baryonic fields is a good dark matter candidate. Depending on the scalar content of the theory, the gravitational wave spectrum consists of contributions from cosmic strings, domain walls, and first order phase transitions. We show that a characteristic double-peaked signal from domain walls or a sharp domain wall peak over a flat cosmic string background may be generated. Those new signatures are within the reach of future experiments, such as Cosmic Explorer, Einstein Telescope, DECIGO, Big Bang Observer, and LISA.\n\n", "2306.00277": "2023-06-01, **Neutrino-induced reactions on 18O and implications of 18O mixture in water Cherenkov detectors on supernova neutrino events**, Toshio Suzuki et.al., [2306.00277v1](http://arxiv.org/abs/2306.00277v1)\n\n Neutrino-nucleus reaction cross sections on 18O are evaluated by shell-model calculations and compared with those on 16O. Important contributions from Gamow-Teller transitions are noticed for 18O (\\nu\\_e, e^{-})18F in contrary to the case for 16O, where spin-dipole transitions are dominant contributions. Calculated cross sections for 18O(\\nu\\_e, e^{-})18F are shown to be larger than for 16O at low neutrino energies below 20 MeV in natural water with the 0.205% admixture of 18O due to the lower threshold energy (1.66 MeV) for 18O than that for 16O (15.42 MeV). The resulting electron spectra, that is, the cross sections as functions of emitted electron energy Te, are also shown to be quite different, reflecting the different threshold energies. The electron spectra from (\\nu\\_e, e^{-}) reactions on 18O and 16O in water Cherenkov detectors for supernova neutrino detection are investigated for both the cases with and without the neutrino oscillation and compared with those of the neutrino-electron scattering. It has been shown that the contribution from 18O (0.205% mixture) enhances the rates from 16O by 60% for the case without the oscillation and by 20-30% for the case with the oscillation below Te =20 MeV. For the case with the neutrino oscillation, the event rates for 18O and 16O become comparable to those of the neutrino-electron scattering. However, their rates at low energy (Te < 20 MeV) are much smaller than those of the neutrino-electron scattering, which is important for the pointing accuracy to the supernova direction.\n\n"}, "dark matter": {"2306.00805": "2023-06-01, **Gravitational collapse of matter in the presence of Quintessence and Phantom-like scalar fields**, Priyanka Saha et.al., [2306.00805v1](http://arxiv.org/abs/2306.00805v1)\n\n In this work, we propose a model of the gravitational collapse of dark matter in the presence of quintessence or phantom-like scalar fields. Our treatment is based on the principles of general relativity up to virialization. We have chosen a spherical patch that starts to collapse gravitationally as it happens in top-hat collapse. It is seen that although the dark matter sector collapses the dark energy sector does keep a profile that is almost similar to the dark energy profile for the background expanding Friedmann-Lemaitre-Robertson-Walker (FLRW) universe for suitable model parameters. It is observed that in order to formulate the problem in the general relativistic setting one has to abandon the idea of a closed FLRW isolated collapsing patch. General relativity requires an external generalized Vaidya spacetime to be matched with the internal spherical patch whose dynamics is guided by the FLRW metric. It is shown that almost all collapses are accompanied by some flux of matter and radiation in the generalized Vaidya spacetime. Some of the spherical regions of the universe are seen not to collapse but expand eternally, producing void-like structures. Whether a spherical region will collapse or expand depends upon the initial values of the system and other model parameters. As this work shows that collapsing structures must emit some form of radiation, this may be taken as an observational signature of our proposal.\n\n", "2306.00646": "2023-06-01, **Stability, quasinormal modes in a charged black hole in perfect fluid dark matter**, Anish Das et.al., [2306.00646v1](http://arxiv.org/abs/2306.00646v1)\n\n In this work, we study time-like and null geodesics in a charged black hole background immersed in perfect fluid dark matter (PFDM). Using the condition for circular geodesics, we evaluate the energy ($E$) and angular momentum ($L$) in terms of the radius ($r\\_c$) of the circular orbits. The existence and finite-ness of $E$ and $L$ constrain the possible range of PFDM parameter ($\\chi$) and the radius of the circular orbit ($r\\_c$). We then use the Lyapunov exponent ($\\lambda$) to study the stability of the geodesics. Then we analyze the critical exponent ($\\gamma$) useful for determining the possibility of detection of gravitational wave signals. After that, we study the perturbation due to a massless scalar field in such a background and calculate the quasinrmal mode (QNM) frequencies and their dependence on PFDM parameter $\\chi$ and black hole charge $Q$. Also, we compare the obtained QNM frequencies both in the exact case and in the eikonal limit. We also calculate the quality factor of the oscillating system and study its dependence on $\\chi$ and $Q$. Finally, we evaluate the black hole shadow radius $R\\_s$ and graphically observe the effect of $\\chi$ and $Q$ on it.\n\n", "2306.00641": "2023-06-01, **Combination and summary of ATLAS dark matter searches interpreted in a 2HDM with a pseudo-scalar mediator using 139 fb$^{-1}$ of $\\sqrt{s} = 13$ TeV $pp$ collision data**, ATLAS Collaboration et.al., [2306.00641v1](http://arxiv.org/abs/2306.00641v1)\n\n Results from a wide range of searches targeting different experimental signatures with and without missing transverse momentum ($E\\_{\\mathrm{T}}^{\\mathrm{miss}}$) are used to constrain a Two-Higgs-Doublet Model (2HDM) with an additional pseudo-scalar mediating the interaction between ordinary and dark matter (2HDM+$a$). The analyses use up to 139 fb$^{-1}$ of proton-proton collision data at a centre-of-mass energy $\\sqrt{s}=13$ TeV recorded with the ATLAS detector at the Large Hadron Collider between 2015-2018. The results from three of the most sensitive searches are combined statistically. These searches target signatures with large $E\\_{\\mathrm{T}}^{\\mathrm{miss}}$ and a leptonically decaying $Z$ boson; large $E\\_{\\mathrm{T}}^{\\mathrm{miss}}$ and a Higgs boson decaying to bottom quarks; and production of charged Higgs bosons in final states with top and bottom quarks, respectively. Constraints are derived for several common as well as new benchmark scenarios within the 2HDM+$a$.\n\n", "2306.00322": "2023-06-01, **Search for Boosted Dark Matter in COSINE-100**, G. Adhikari et.al., [2306.00322v1](http://arxiv.org/abs/2306.00322v1)\n\n We search for energetic electron recoil signals induced by boosted dark matter (BDM) from the galactic center using the COSINE-100 array of NaI(Tl) crystal detectors at the Yangyang Underground Laboratory. The signal would be an excess of events with energies above 4MeV over the well-understood background. Because no excess of events are observed in a 97.7 kg$\\cdot$years exposure, we set limits on BDM interactions under a variety of hypotheses. Notably, we explored the dark photon parameter space, leading to competitive limits compared to direct dark photon search experiments, particularly for dark photon masses below 4MeV and considering the invisible decay mode. Furthermore, by comparing our results with a previous BDM search conducted by the Super- Kamionkande experiment, we found that the COSINE-100 detector has advantages in searching for low-mass dark matter. This analysis demonstrates the potential of the COSINE-100 detector to search for MeV electron recoil signals produced by the dark sector particle interactions.\n\n"}, "supernova": {"2306.00287": "2023-06-01, **The evolutionary stage of Betelgeuse inferred from its pulsation periods**, Hideyuki Saio et.al., [2306.00287v1](http://arxiv.org/abs/2306.00287v1)\n\n Betelgeuse is a well known bright red supergiant that shows semi-regular variations with four approximate periods of 2200, 420, 230, and 185 days. While the longest period was customarily regarded as LSP (long secondary period) of unknown origin, we identify the ~2200-d period as the radial fundamental mode, and the three shorter periods as the radial first, second, and third overtones. From a nonadiabatic pulsation analysis including the pulsation/convection coupling, we have found that these radial pulsation modes are all excited in the envelope of a model in a late stage of the core-carbon burning. Models with similar pulsation property have masses around 11M\\_\\odot (19M\\_\\odot at ZAMS) with luminosities (log L/L\\_\\odot =5.27~5.28) and effective temperatures (log T\\_{eff}\\approx 3.53) that are consistent with the range of the observational determinations. We also find that a synthetic light curve obtained by adding the fundamental and the first-overtone mode qualitatively agrees with the light curve of Betelgeuse up to the Great Dimming. We conclude that Betelgeuse is in the late stage of core carbon burning, and a good candidate for the next Galactic supernova.\n\n", "2306.00263": "2023-06-01, **Bright Type II SN 2023ixf in M101: A Quick Analysis of the Early-Stage Spectroscopic and Near-Infrared Light Curves**, Masayuki Yamanaka et.al., [2306.00263v1](http://arxiv.org/abs/2306.00263v1)\n\n We present the early-stage analysis of the low-resolution ($R=1000$) optical spectra and the near-infrared light curves of the bright Type II supernova (SN II) 2023ixf in the notable nearby face-on spiral galaxy M101, which are obtained since $t=1.7$ until $8.0$ d. Our first spectrum shows remarkable emission features of Balmer series, He~{\\sc ii}, N~{\\sc iv}, and C~{\\sc iv} with a strong blue continuum. Compared with SNe II showing the flash-ionized features, we suggest that this SN could be categorized into high-luminosity SNe II with a nitrogen/helium-rich circumstellar material (CSM), e.g., SNe 2014G, 2017ahn, and 2020pni. The H~{$\\alpha$} emission line is composed of broad (~2800 km~s$^{-1}$), intermediate (520 km~s$^{-1}$), and narrow ($<200$ km~s$^{-1}$) components. The near-infrared light curves are well consistent with those of another luminous SN II 2017ahn, and the absolute magnitudes locate on the bright end in the lumosity distribution of SNe II. These observational facts support that SN 2023ixf is well consistent with a high-luminosity SN II with the dense nitrogen/helium-rich CSM.\n\n"}}