{"neutrino": {"2508.04274": "2025-08-06, **A neutrino data analysis of extra-dimensional theories with massive bulk fields**, Philipp Eller et.al., [2508.04274v1](http://arxiv.org/abs/2508.04274v1)\n\n We present a global neutrino oscillation analysis of models with a single large extra dimension in which right-handed neutrinos possess bulk Dirac masses. Two scenarios are considered: Large Extra Dimensions with bulk masses and the Dark Dimension framework, both predicting a tower of sterile Kaluza-Klein states that mix with active neutrinos. Using data from MINOS/MINOS+, KamLAND, and Daya Bay, we perform a joint likelihood analysis. No signatures of these theories were found. Therefore, we constrain the compactification radius under different bulk mass and Yukawa coupling assumptions. Large positive bulk masses or sizable Yukawas lead to strong bounds, while small couplings or negative bulk masses remain less constrained.\n\n", "2508.04264": "2025-08-06, **Magnetized Proto-Neutron Stars: Structure and Stability**, Harsh Chandrakar et.al., [2508.04264v1](http://arxiv.org/abs/2508.04264v1)\n\n This study examines the evolution of the global properties of magnetized proto-neutron stars (PNSs) across four key stages: neutrino-trapping, deleptonization, the neutrino-transparent phase, and the formation of a cold, catalyzed neutron star (NS). We perform general relativistic magnetohydrodynamic simulations with strong magnetic fields of approximately 10^17 Gauss. The stellar matter is modeled using equations of state (EoS) derived from relativistic mean-field theory, employing density-dependent couplings calibrated by the DDME2 parameterization. We analyze how the gravitational mass, equatorial radius, shape deformation, magnetic flux, and the magnetic-to-binding energy ratio evolve in response to changes in internal composition, thermodynamic conditions, and magnetic field configuration. Our results show that as PNSs evolve, increasing entropy per baryon and decreasing lepton fractions lead to higher core temperatures. These thermodynamic changes enhance the star's susceptibility to magnetic field-induced deformation, facilitate greater magnetic flux confinement, and increase the magnetic-to-binding energy ratio, especially during the deleptonization and neutrino-transparent phases. The PNS's core temperature also determines the efficiency of magnetic field decay. We find that dissipation is fastest during the deleptonization and neutrino-transparent phases, a process that ultimately defines the observable magnetic field of the mature NS.\n\n", "2508.04040": "2025-08-06, **Benchmarks and applications of the nuclear deexcitation event generator \\textsc{NucDeEx}**, Seisho Abe et.al., [2508.04040v1](http://arxiv.org/abs/2508.04040v1)\n\n Neutron multiplicity is a key observable in recent neutrino experiments that can enhance the sensitivity of various neutrino physics searches. Nuclear deexcitation plays a significant role in neutron emissions associated with neutrino-nucleus interactions; therefore, precise prediction of this process is eessential. To address this need, a general-purpose nuclear deexcitation event generator \\textsc{NucDeEx} was developed and released as an open-source package. The treatment of low-lying discrete excited states was updated to better reproduce experimental data. Benchmarks were conducted using existing nuclear deexcitation event generators and experimental data. Application to other simulators, neutrino event generator \\textsc{NEUT} and general particle simulation tool \\textsc{Geant4}, are also presented.\n\n", "2508.03822": "2025-08-05, **The LED calibration systems for the mDOM and D-Egg sensor modules of the IceCube Upgrade**, R. Abbasi et.al., [2508.03822v1](http://arxiv.org/abs/2508.03822v1)\n\n The IceCube Neutrino Observatory, instrumenting about 1 km$^3$ of deep, glacial ice at the geographic South Pole, is due to be enhanced with the IceCube Upgrade. The IceCube Upgrade, to be deployed during the 2025/26 Antarctic summer season, will consist of seven new strings of photosensors, densely embedded near the bottom center of the existing array. Aside from a world-leading sensitivity to neutrino oscillations, a primary goal is the improvement of the calibration of the optical properties of the instrumented ice. These will be applied to the entire archive of IceCube data, improving the angular and energy resolution of the detected neutrino events. For this purpose, the Upgrade strings include a host of new calibration devices. Aside from dedicated calibration modules, several thousand LED flashers have been incorporated into the photosensor modules. We describe the design, production, and testing of these LED flashers before their integration into the sensor modules as well as the use of the LED flashers during lab testing of assembled sensor modules.\n\n"}, "dark matter": {"2508.04636": "2025-08-06, **Extension of the Einstein-Dirac-axion-aether theory based on an effective metric with a spinor kernel**, Alexander B. Balakin et.al., [2508.04636v1](http://arxiv.org/abs/2508.04636v1)\n\n We consider an axionic extension of the Einstein-Dirac-aether theory, which is based on the spinor modification of the kinetic term of the pseudoscalar field and describes the backreaction of the spinor field on the axionic dark matter. The main instrument of this extension is the effective metric constructed using the aether velocity four-vector and a kernel, which depends on the basic spinor scalar and on the square of the basic spinor pseudoscalar. The periodic potential of the axion field includes a guiding function, which regulates the dynamics of axions and predetermines the properties of their equilibrium states. This guiding function and the kernel of the effective metric, as well, are considered to be functions of the expansion scalar of the aether flow. The master equation for the guiding function is obtained as a consequence of the Lagrangian invariance with respect to the discrete transformations prescribed by the axion field shift symmetry. The self-consistent set of coupled master equations is derived, which includes new source-terms in the modified master equations for the spinor, axion, vector and gravitational fields. Cosmological applications of the extended theory are considered; new exact solutions of these equations are presented for the isotropic homogeneous model of the Universe evolution. Discussion is focused on the mechanism of backreaction of the spinor field on the axionic dark matter evolution.\n\n", "2508.04593": "2025-08-06, **A new constraint on the $y$-distortion with FIRAS: robustness of component separation methods**, Alina Sabyr et.al., [2508.04593v1](http://arxiv.org/abs/2508.04593v1)\n\n The sky-averaged Compton-$y$ distortion in the cosmic microwave background (CMB) energy spectrum, $\\langle y \\rangle$, provides information about energy injection in the Universe occurring at $z \\lesssim 5\\times10^{4}$. It is primarily sourced by the thermal Sunyaev-Zeldovich effect -- the up-scattering of CMB photons on free electrons in collapsed dark matter halos. In this work and our companion paper, Ref. [1], we perform a re-analysis of the archival COBE/FIRAS data to constrain $\\langle y \\rangle$. We utilize two analysis approaches: (i) fitting the sky-averaged intensity spectrum (frequency monopole) and (ii) fitting the sky spectrum in each pixel (pixel-by-pixel). We obtain the baseline upper limits $\\langle y \\rangle < 31\\times 10^{-6}$ and $\\langle y \\rangle < 8.3\\times 10^{-6}$ (both at $95\\%$ C.L.) for these two approaches, respectively. We present the first detailed comparison of these analysis methods on both mock skies and real data. Our findings suggest that accounting for the spatial variability of foregrounds via pixel-by-pixel fitting allows for tighter constraints on $\\langle y \\rangle$ by a factor of $\\approx 3-5$ as compared to the frequency monopole method. We show that our frequency monopole results agree well with predictions from Fisher forecast techniques based on the sky-averaged signal, which have been used for forecasting future spectral distortion experiments. Our results thus suggest that the scientific reach of future spectral distortion experiments can potentially be enhanced by a factor of a few via more optimal component separation methods, and we identify the pixel-by-pixel method as one such robust way to achieve this. We discuss the implications of our improved constraints on $\\langle y \\rangle$ from the pixel-by-pixel method in Ref. [1].\n\n", "2508.04410": "2025-08-06, **Bursting at the seams: the star-forming main sequence and its scatter at z=3-9 using NIRCam photometry from JADES**, C. Simmonds et.al., [2508.04410v1](http://arxiv.org/abs/2508.04410v1)\n\n We present a comprehensive study of the star-forming main sequence (SFMS) and its scatter at redshifts $3 \\leq z \\leq 9$, using NIRCam photometry from the JADES survey in the GOODS-S and GOODS-N fields. Our analysis is based on a sample of galaxies that is stellar mass complete down to $\\log \\left(M\\_{\\star}/M\\_{\\odot}\\right) \\approx 8.1$. The redshift evolution of the SFMS at an averaging timescale of 10 Myr follows a relation, quantified by the specific star-formation rates (sSFR$\\_{10}$), of $\\mathrm{sSFR}\\propto(1+z)^{\\mu}$ with $\\mu = 2.30^{+0.03}\\_{-0.01}$, in good agreement with theoretical predictions and the specific mass accretion rate of dark matter halos. We find that the SFMS normalisation varies in a complex way with the SFR averaging timescale, reflecting the combined effects of bursty star formation and rising star formation histories (SFHs). We quantify the scatter of the SFMS, revealing that it decreases with longer SFR averaging timescales, from $\\sigma\\_{\\rm{int}} \\approx 0.4-0.5~\\mathrm{dex}$ at 10 Myr to $\\sigma\\_{\\rm{int}} \\approx 0.2~\\mathrm{dex}$ at 100 Myr, indicating that shorter-term fluctuations dominate the scatter, although long-term variations in star formation activity are also present. Our findings suggest that bursty SFHs are more pronounced at lower stellar masses. Furthermore, we explore the implications of our results for the observed over-abundance of UV-bright galaxies at $z > 10$, concluding that additional mechanisms, such as top-heavy initial mass functions, increased star-formation efficiencies, or increased burstiness in star formation are needed to explain these observations. Finally, we emphasize the importance of accurate stellar mass completeness limits when fitting the SFMS, especially for galaxies with bursty SFHs.\n\n", "2508.04312": "2025-08-06, **Probing the Type 3 interacting dark-energy model using matter pairwise velocity**, Kin Ho Luo et.al., [2508.04312v1](http://arxiv.org/abs/2508.04312v1)\n\n Dark sector interactions can be explored via the so-called Type 3 model where dark matter and dark energy exchange momentum only, so as to minimize deviations from the $\\Lambda$CDM background expansion history. Using N-body simulations, we analyze the imprint of Type 3 model parameters, the momentum exchange coupling constant $\\beta$ and the slope of scalar field potential $\\lambda$, on large-scale structure (LSS) observables, particularly the matter pairwise velocity statistics. We find that the effects of $\\beta$ ($< 0$) and $\\lambda$ on the mean matter peculiar pairwise velocity and velocity dispersion are degenerate. Our results highlight the potential of velocity statistics as a probe of dark sector interactions and underscore the importance of disentangling $\\beta$ and $\\lambda$ in cosmological analyses.\n\n", "2508.04018": "2025-08-06, **The Milky Way and M31 rotation curves in Yukawa gravity: phenomenology and Bayesian analysis**, Davendra S. Hassan et.al., [2508.04018v1](http://arxiv.org/abs/2508.04018v1)\n\n Yukawa gravity provides a generalized framework for modeling gravity modification. We investigate the rotation curve profiles of spiral galaxies under Yukawa-like theories governed by the coupling strength $\\beta$ and the interaction range $\\lambda$. We develop a unified analytical and numerical framework to calculate rotational velocities under Yukawa gravity, which includes contributions from all major galactic components: stellar bulge, disk, dark matter (DM) halo, and central supermassive black hole. The calculations show that $\\beta$ and $\\lambda$ strongly influence velocity distributions, shifting peaks, creating double-peak structures, or enhancing dark matter dominance in the bulge or disk. To assess observational implications, we perform Bayesian analyses using data from the Milky Way (MW) and Andromeda (M31), which offer complementary characteristics: MW provides precise velocity profiles across multiple scales, while M31 includes broader morphological constraints. We examine four scenarios: Yukawa gravity without dark matter, dark matter with non-trivial coupling, fully modified gravity, and standard Newtonian gravity. Results show that MW models with $\\lambda < 1$ kpc yield high Bayes factors but risk overfitting, as dark matter mimics baryonic kinematics, while M31's photometric priors from conjugate observations mitigate this, yielding robust parameter estimates. However, in M31, Bayes factors favor Newtonian gravity, suggesting that current data lack the precision to resolve more complex models. This finding highlights two key needs: (i) realistic, physically or empirically informed priors to avoid biased constraints, and (ii) high-precision data with independent photometry to guard against overfitting. Our framework offers a scalable approach for testing gravity with large galactic rotation curve datasets.\n\n", "2508.03842": "2025-08-05, **LAP1-B is the First Observed System Consistent with Theoretical Predictions for Population III Stars**, Eli Visbal et.al., [2508.03842v1](http://arxiv.org/abs/2508.03842v1)\n\n Recently, Nakajima et al. (2025) presented James Webb Space Telescope observations of the $z=6.6$ Population III (Pop III) candidate LAP1-B, which is gravitationally lensed by galaxy cluster MACS J0416. We argue that this is the first object to agree with three key theoretical predictions for Pop III stars: (1) formation in extremely low-metallicity halos with virial temperatures ranging from $T\\_{\\rm vir}\\sim 10^3-10^4~{\\rm K}$, (2) a top-heavy initial mass function, and (3) formation of low-mass clusters with ${\\sim}{\\rm a ~few}\\times 1000~M\\_\\odot$ in massive Pop III stars. LAP1-B is consistent with recently formed Pop III stars hosted in a $\\sim 5\\times 10^7~M\\_\\odot$ dark matter halo, some of which have enriched their surrounding gas either with supernovae or stellar winds. We use the semi-analytic model of Visbal et al. (2020) to predict the abundance of Pop III clusters observable at the high magnification provided by the foreground galaxy cluster MACS J0416. Using fiducial parameters unmodified from previous work, we expect about one observable Pop III galaxy similar to LAP1-B in the range $z=6-7$. At earlier times, the intrinsic abundance is higher, but Pop III systems would not have been detected because of their increased luminosity distance and lower mass dark matter halos, which would host fewer stars. Thus, we find that LAP1-B was found at the redshift theoretically expected, given current observable limits, despite the fact that most Pop III systems form much earlier.\n\n", "2508.03823": "2025-08-05, **Scaling Relations for Dark Matter Halos Hosting Ultra-Faint Dwarf Galaxies**, Levi K. C. Fisher et.al., [2508.03823v1](http://arxiv.org/abs/2508.03823v1)\n\n We consider the extraction of parameters of dark matter halos hosting ultra-faint dwarf galaxies, in the case where there are only ${\\cal O}(10)$ identified member stars with measured line-of-sight velocities. This scenario is likely to be increasingly common, as upcoming newly discovered dwarf galaxies in the Milky Way, by e.g. the Rubin Observatory, will likely (at least initially) have only a few identified members. Assuming an NFW dark matter profile, equilibrium modeling likely can only robustly extract one halo parameter ($\\rho\\_s r\\_s$), but the scale radius itself will typically be unconstrained. In these cases, the results obtainable from Jeans modeling can be well replicated by a simple scaling relation motivated by the half-light mass estimator. As a application, we examine the recently discovered stellar system Ursa Major III, which has been optimistically assessed to have the largest $J$-factor of any known object. We suggest that, because of the presence of outlier stars, the $J$-factor obtained from modeling of Ursa Major III is likely inflated, as it is inconsistent with the half-light mass estimator, while removal of the outliers will leave the $J$-factor unconstrained from below.\n\n", "2508.03819": "2025-08-05, **Indirect searches for realistic sub-GeV Dark Matter models**, Marco Cirelli et.al., [2508.03819v1](http://arxiv.org/abs/2508.03819v1)\n\n Indirect searches for Dark Matter (DM) particles with mass in the MeV -- GeV scale have received significant attention lately. Pair-annihilations of such DM particles in the Galaxy can give rise to (at the same time) MeV to GeV $\\gamma$-rays via prompt emission, sub-GeV $e^\\pm$ in cosmic-rays, as well as a broad photon spectrum ranging from $X$-rays to soft $\\gamma$-rays, produced by the DM induced $e^\\pm$ via inverse Compton scattering, bremsstrahlung and in-flight annihilation processes (collectively called `secondary emissions'). We focus on two representative realistic sub-GeV DM models, namely, the vector-portal kinetic-mixing model and the higgs-portal model, and perform a detailed study of the indirect detection constraints from existing $X$-rays, $\\gamma$-rays and cosmic-ray observations, based on all of the above-mentioned signals. We also estimate the future prospects from the upcoming MeV photon telescope COSI, including all possible types of prompt and secondary emission signals. We compare our results with the constraints and (or) projections from cosmological and terrestrial observations. We find that, for both the sub-GeV DM models, the current observations constrain the annihilation cross-section at the level of $\\langle \\sigma v \\rangle \\lesssim 10^{-27} {\\rm cm}^3/{\\rm s}$, or lower for some specific mass ranges or under optimistic assumptions. Moreover, new unconstrained DM parameter space can be probed at the upcoming instruments like COSI, thanks to the inclusion of secondary photons which in many cases provide the dominant signal.\n\n", "2508.03805": "2025-08-05, **Warm Dark Matter meets Cold Dark Matter Isocurvature**, Sai Chaitanya Tadepalli et.al., [2508.03805v1](http://arxiv.org/abs/2508.03805v1)\n\n Isocurvature fluctuations can be generated in various scenarios in the early Universe. In particular, some specific models predict those with a blue-tilted spectrum, which is consistent with the constraints from cosmic microwave background such as Planck, although isocurvature fluctuations with an almost scale-invariant spectrum are severely constrained. We argue that cold dark matter (CDM) isocurvature fluctuations with blue-tilted spectrum are not only consistent with current cosmological data, but also can loosen the bound on the masses of warm dark matter (WDM), which suppresses small-scale power. In pure thermal WDM models with the adiabatic initial condition, a combination of the data from Lyman-$\\alpha$, gravitational lensing, and Milky Way satellites gives a lower bound on the WDM mass as $6~{\\rm keV}$ at $95\\%$ C.L. while mixed WDM+CDM models loosen these bounds to $m\\_{\\rm WDM}\\sim1$ keV for a warm-fraction $f\\_{\\rm WDM}\\lesssim0.14$ and $m\\_{\\rm WDM}\\sim600$ eV for $f\\_{\\rm WDM}\\lesssim0.08$. On the other hand, as we demonstrate, WDM scenarios with a blue-tilted CDM isocurvature power spectrum, even with only $1\\%$ CDM contribution ($f\\_{\\rm WDM}\\sim0.99$), can allow WDM masses as low as $600$ eV. We further assess the implications of this ``warm + cold-isocurvature'' extension for the small-scale structure by performing $N$-body simulations, particularly focusing on nonlinear matter power spectrum and halo mass function.\n\n", "2508.03803": "2025-08-05, **Profiling Dark Matter Spikes with Gravitational Waves from Accelerated Binaries**, Avinash Tiwari et.al., [2508.03803v1](http://arxiv.org/abs/2508.03803v1)\n\n Dark matter halos can develop a density spike, e.g., around a galactic supermassive black hole, with the profile $\\rho \\propto r^{-\\gamma\\_{\\rm sp}}$ determined both by the galaxy's formation history and the microphysics of dark matter. We show that future LISA/DECIGO observations, of intermediate/stellar-mass binary mergers inside the spike around the supermassive black hole, can measure $\\gamma\\_{\\rm sp}$ at a few-percent--level precision. The spike induces a distinctive time-dependent acceleration along the non-circular orbit taken by the binary's center of mass, which is observable as a secular modulation of the gravitational wave signal. This method -- insensitive to confounding astrophysical effects (dynamical friction, tidal effects, etc.) and not reliant on unknown dark matter particle physics -- provides a clean diagnostic of density spikes and a new probe of dark matter.\n\n", "2508.03795": "2025-08-05, **Hot New Early Dark Energy: Dark Radiation Matter Decoupling**, Mathias Garny et.al., [2508.03795v1](http://arxiv.org/abs/2508.03795v1)\n\n We present a microscopic model of the dark sector that resolves the Hubble tension within standard current datasets based on well-known fundamental principles, gauge symmetry and spontaneous symmetry breaking. It builds on the Hot New Early Dark Energy (Hot NEDE) setup, featuring a dark $SU(N)$ gauge symmetry broken to $SU(N-1)$ in a supercooled phase transition that creates a thermal bath of self-interacting dark radiation in the epoch between Big Bang Nucleosynthesis and recombination. Adding a fermion multiplet charged under the gauge symmetry provides a naturally stable component of dark matter that interacts with dark radiation. Spontaneous symmetry breaking predicts a decoupling of this interaction once the dark sector cools down, that we refer to as dark radiation matter decoupling (DRMD). We find agreement between the SH${}\\_0$ES determination of $H\\_0$ as well as combined Planck 2018, Pantheon+ and DESI baryon acoustic oscillation (BAO) data at 1.4$\\sigma$ level, compared to a 5.7$\\sigma$ tension in the $\\Lambda$ Cold Dark Matter model. We also provide a simplified three-parameter DRMD model encoding the essential features, while the full model offers additional falsifiable predictions.\n\n", "2508.03582": "2025-08-05, **Detectability of compact intermediate-mass black hole binaries as low-frequency gravitational wave sources: the influence of dynamical friction of dark matter**, Wen-Qing Jia et.al., [2508.03582v2](http://arxiv.org/abs/2508.03582v2)\n\n The black hole (BH) spin could significantly change the density of dark matter (DM) in its vicinity, creating a mini-spike of the density of DM. The dynamical friction (DF) between DM and the companion star of a BH can provide an efficient loss of angular momentum, driving the BH-main sequence (MS) star binary to evolve toward a compact orbit system. We investigate the influence of the DF of DM on the detectability of intermediate-mass black hole (IMBH)-MS binaries as low-frequency gravitational wave (GW) sources. Taking into account the DF of DM, we employ the detailed binary evolution code MESA to model the evolution of a large number of IMBH-MS binaries. Our simulation shows that the DF of DM can drive those IMBH-MS binaries to evolve toward low-frequency GW sources for a low donor-star mass, a high spike index, or a short initial orbital period. When the spike index $\\gamma=1.60$, those IMBH-MS binaries with donor-star masses of $1.0-3.4~ M\\_{\\odot}$ and initial orbital periods of $0.65-16.82~ \\rm days$ could potentially evolve into visible LISA sources within a distance of $10~\\rm kpc$. The DF of DM can enlarge the initial parameter space and prolong the bifurcation periods. In the low-frequency GW source stage, the X-ray luminosities of those IMBH X-ray binaries are $\\sim 10^{35}-10^{36}~\\rm erg\\,s^{-1}$, hence they are ideal multimessenger objects.\n\n", "2508.03569": "2025-08-05, **Renzo's rule revisited: A statistical study of galaxies' baryon - dark matter coupling**, Enoch Ko et.al., [2508.03569v1](http://arxiv.org/abs/2508.03569v1)\n\n We present a systematic statistical analysis of an informal astrophysical phenomenon known as Renzo's rule (or Sancisi's law), which states that \"for any feature in a galaxy's luminosity profile, there is a corresponding feature in the rotation curve, and vice versa.\" This is often posed as a challenge for the standard LCDM model while supporting alternative theories such as MOND. Indeed, we identify clear features in the dwarf spiral NGC 1560 -- a prime example for Renzo's rule -- and find correlation statistics which support Renzo's rule with a slight preference for MOND over LCDM halo fits. However, a broader analysis on galaxies in the SPARC database reveals an excess of features in rotation curves that lack clear baryonic counterparts, with correlation statistics deviating up to $3\\sigma$ on average from that predicted by both MOND and LCDM haloes, challenging the validity of Renzo's rule. Thus we do not find clear evidence for Renzo's rule in present galaxy data overall. We additionally perform mock tests, which show that a definitive test of Renzo's rule is primarily limited by the lack of clearly resolved baryonic features in current galaxy data.\n\n", "2508.03770": "2025-08-05, **Description of CRESST-III lithium aluminate data**, G. Angloher et.al., [2508.03770v1](http://arxiv.org/abs/2508.03770v1)\n\n Two detector modules with lithium aluminate targets were operated in the CRESST underground setup between February and June 2021. The data collected in this period was used to set the currently strongest cross-section upper limits on the spin-dependent interaction of dark matter (DM) with protons and neutrons for the mass region between 0.25 and 1.5 GeV/c$^2$. The data are available online. In this document, we describe how the data set should be used to reproduce our dark matter results.\n\n", "2508.03078": "2025-08-05, **Description of CRESST-II and CRESST-III pulse shape data**, G. Angloher et.al., [2508.03078v1](http://arxiv.org/abs/2508.03078v1)\n\n A set of data from 68 cryogenic detectors operated in the CRESST dark matter search experiment between 2013 and 2019 was collected and labeled to train binary classifiers for data cleaning. Here, we describe the data set and how the trained models can be applied to new data. The data and models are available online.\n\n"}, "supernova": {"2508.04497": "2025-08-06, **Dance to Demise -- How Massive Stars May Form Dense Circumstellar Shells Before Explosion**, Sutirtha Sengupta et.al., [2508.04497v1](http://arxiv.org/abs/2508.04497v1)\n\n We investigate the evolution of red supergiant (RSG) progenitors of core-collapse (CC) supernovae (SNe) with initial masses between 12-20 Msun focusing on effects of enhanced mass loss due to pulsation-driven instabilities in their envelopes and subsequent dynamical ejections during advanced stages of nuclear burning. Using time-dependent mass loss rates from detailed MESA stellar evolution models, including prescriptions for both pulsation-driven superwinds and shock-induced ejections, we construct the circumstellar medium (CSM) before the SN explosion. We calculate resulting CSM density profiles and column densities considering the radiation-driven acceleration of the stellar wind. Our models produce episodes of enhanced mass loss ~10^-4-10^-2 Msun/yr in the last centuries-decades before explosion forming dense CSM (>~10^-15 g/cm^3 at distances <~10^15 cm) - consistent with multi-wavelength observations of Type II SNe such as SN 2023ixf, SN 2020ywx, SN 2017hcc, SN 2005ip and SN 1998S. The formation of such dense CS shells, as predicted by our single star RSG models, provides a natural explanation for observed flash-ionization signatures, X-ray and radio emission, and has important implications for dust formation around Type II SNe.\n\n", "2508.04487": "2025-08-06, **Spectral Energy Correlations of Gamma-Ray Bursts from Structured Jets**, X. L. Zhang et.al., [2508.04487v1](http://arxiv.org/abs/2508.04487v1)\n\n Using 148 out-axis gamma-ray bursts, we build their spectrum-energy relations of peak energy versus isotropic energy, peak energy versus peak luminosity and peak energy versus jet-calibrated energy which are corrected for a structured jet model. These relations are found to depend on the observer's viewing angle as long as the observer is within the jet cone. After converting the out-axis energy relations to the in-axis situations, we find that the corresponding in-axis energy relations are universally steeper, of which all of them can be roughly interpreted by the Synchrotron radiation mechanism as shown in Xu et al.. Meanwhile, we notice that the in-axis means of isotropic energies are about one order of magnitude larger than the out-axis means for both short and long bursts except the Supernova-associated gamma-ray bursts. Furthermore, we apply all the newly-found energy relations to construct the Hubble diagrams of out/in-axis bursts. It is found that the in-axis Hubble diagrams are better cosmological indicators.\n\n", "2508.04277": "2025-08-06, **Stringent constraint on the CCC+TL cosmology with $H(z)$ Measurements**, Lei Lei et.al., [2508.04277v1](http://arxiv.org/abs/2508.04277v1)\n\n Recently, the Covarying Coupling Constants and Tired Light (CCC+TL) hybrid model was proposed to explain the unexpectedly small angular diameters of high-redshift galaxies observed by the James Webb Space Telescope (JWST) that are challenging to reconcile with the $\\Lambda$CDM model. In this work, we test the CCC+TL model against model-independent Hubble parameter [$H(z)$] measurements obtained from cosmic chronometers. It turns out that the parameter set optimized for the type-Ia supernova (SN Ia) dataset within the CCC+TL model fails to reproduce the $H(z)$ data, but the $\\Lambda$CDM model works well. Statistical comparison using the Bayesian Information Criterion (BIC) strongly favors $\\Lambda$CDM over CCC+TL for the $H(z)$ data, with $\\Delta \\mathrm{BIC} = 60.85$. Additionally, the fit of the CCC+TL model to the $H(z)$ data results in a best-fit value for the speed-of-light variation index parameter $\\alpha$ disagreeing with that for the SN Ia data at the $\\sim 6\\sigma$ level, demonstrating significant internal tension within the CCC+TL framework.\n\n", "2508.04053": "2025-08-06, **A second-generation star in a relic dwarf galaxy**, Anirudh Chiti et.al., [2508.04053v1](http://arxiv.org/abs/2508.04053v1)\n\n Stars that contain only trace amounts of elements heavier than helium, referred to as having low \"metallicity\", preserve the chemical fingerprints of the first generation of stars and supernovae. In the Milky Way, the lowest metallicity stars show an extreme over-abundance of carbon relative to other elements, which has been hypothesized to be a unique result of the first low-energy supernovae. However, the origin of this signature has remained a mystery, since no such stars have been discovered in the ancient dwarf galaxies where they are thought to have formed. Here, we present observations of a star in the >10 billion year old ultra-faint dwarf galaxy Pictor II, that shows the lowest iron and calcium abundances outside the Milky Way (<1/43,000th solar and ~1/160,000th solar), with a factor of >3000x relative carbon enhancement. As the first unambiguous second-generation star in a relic dwarf galaxy, this object demonstrates that carbon-enhanced second-generation stars can originate in primordial small-scale systems. This star supports the hypothesis that carbon-enhancement is produced by low-energy-supernovae, since the yields of energetic supernovae are harder to retain in small-scale environments. This key local signature of chemical enrichment by the first stars traces a regime inaccessible to current high-redshift observations, which cannot detect the early enrichment of the smallest galaxies.\n\n", "2508.03932": "2025-08-05, **Hot springs and dust reservoirs: JWST reveals the dusty, molecular aftermath of extragalactic stellar mergers**, Viraj Karambelkar et.al., [2508.03932v1](http://arxiv.org/abs/2508.03932v1)\n\n We present James Webb Space Telescope (JWST) observations of four Luminous Red Novae (LRNe): dusty, extragalactic transients from stellar mergers following common-envelope evolution (CEE) in massive binary stars. Our targets - AT2021blu, AT2021biy, AT2018bwo, and M31-LRN-2015 - span a broad range in progenitor primary masses ($\\approx$3-24M$\\_{\\odot}$) and post-merger ages ($\\approx$1100-3700 days). All four were observed with the Mid-Infrared Instrument (MIRI) from 5-25$\\mu$m; AT2021blu and AT2021biy additionally have 5-12$\\mu$m spectra from the Low-Resolution Spectrometer. These spectra show strong features of oxygen-rich molecules, including water vapor, supporting the recent association of water fountain sources with CEE. Radiative transfer modeling of the spectral energy distributions yields dust masses of $\\approx$4.2$\\times10^{-5}$, 3$\\times10^{-4}$, 7.5$\\times10^{-5}$, and 7.7$\\times10^{-4}$M$\\_{\\odot}$ respectively - corresponding to $\\approx10$%, 60%, 6% and 12% of median dust masses in core-collapse supernovae (CCSNe) at similar phases. Accounting for their occurrence rates, we estimate that LRNe can contribute $\\sim$25% as much dust as CCSNe to the cosmic dust budget. Furthermore, the lower expansion velocities of LRNe may reduce dust destruction by reverse shocks compared to CCSNe, potentially increasing this contribution. In addition to dust masses, we use our \\emph{JWST} observations to measure late-time properties such as the luminosities, temperatures, radii, and dust-to-gas ratios of the merger remnants. Our results highlight the need for broader infrared studies of LRNe to quantify their contribution to the cosmic dust budget, study the evolution of oxygen-rich molecules, and probe the final fates of CEE.\n\n", "2508.03842": "2025-08-05, **LAP1-B is the First Observed System Consistent with Theoretical Predictions for Population III Stars**, Eli Visbal et.al., [2508.03842v1](http://arxiv.org/abs/2508.03842v1)\n\n Recently, Nakajima et al. (2025) presented James Webb Space Telescope observations of the $z=6.6$ Population III (Pop III) candidate LAP1-B, which is gravitationally lensed by galaxy cluster MACS J0416. We argue that this is the first object to agree with three key theoretical predictions for Pop III stars: (1) formation in extremely low-metallicity halos with virial temperatures ranging from $T\\_{\\rm vir}\\sim 10^3-10^4~{\\rm K}$, (2) a top-heavy initial mass function, and (3) formation of low-mass clusters with ${\\sim}{\\rm a ~few}\\times 1000~M\\_\\odot$ in massive Pop III stars. LAP1-B is consistent with recently formed Pop III stars hosted in a $\\sim 5\\times 10^7~M\\_\\odot$ dark matter halo, some of which have enriched their surrounding gas either with supernovae or stellar winds. We use the semi-analytic model of Visbal et al. (2020) to predict the abundance of Pop III clusters observable at the high magnification provided by the foreground galaxy cluster MACS J0416. Using fiducial parameters unmodified from previous work, we expect about one observable Pop III galaxy similar to LAP1-B in the range $z=6-7$. At earlier times, the intrinsic abundance is higher, but Pop III systems would not have been detected because of their increased luminosity distance and lower mass dark matter halos, which would host fewer stars. Thus, we find that LAP1-B was found at the redshift theoretically expected, given current observable limits, despite the fact that most Pop III systems form much earlier.\n\n", "2508.03811": "2025-08-05, **A hot white dwarf merger remnant revealed by an ultraviolet detection of carbon**, Snehalata Sahu et.al., [2508.03811v1](http://arxiv.org/abs/2508.03811v1)\n\n Atmospheric carbon has been detected in the optical spectra of six hydrogen-rich ultra-massive white dwarfs, revealing large carbon abundances (log C/H > $-$0.5) attributable to the convective dredge-up of internal carbon into thin hydrogen surface layers. These rare white dwarfs likely originate from stellar mergers, making them \"smoking guns\" for one of the binary evolution channels leading to thermonuclear supernovae. However, optical spectroscopy can uncover only the most carbon-enriched objects, suggesting that many more merger remnants may masquerade as normal pure-hydrogen atmosphere white dwarfs. Here, we report the discovery of atmospheric carbon in a Hubble Space Telescope far-ultraviolet spectrum of WD$\\,$0525+526, a long-known hydrogen-rich ultra-massive white dwarf. The carbon abundance (log C/H = $-$4.62) is 4$-$5 dex lower than in the six counterparts and thus detectable only at ultraviolet wavelengths. We find that the total masses of hydrogen and helium in the envelope ($10^{-13.8}$ and $10^{-12.6}$ of the total white dwarf mass) are substantially lower than those expected from single-star evolution, implying that WD$\\,$0525+526 is a merger remnant. Our modelling indicates that the low surface carbon abundance arises from an envelope structure in which a thin hydrogen-rich layer floats atop a semi-convection zone$-$a process that has been largely overlooked in white dwarfs. Our study highlights the importance of ultraviolet spectroscopy in identifying and characterising merger remnants.\n\n", "2508.03800": "2025-08-05, **Beta Canis Majoris: The Other Major Ionization Source of the Local Interstellar Clouds**, J. Michael Shull et.al., [2508.03800v1](http://arxiv.org/abs/2508.03800v1)\n\n Two nearby B-type stars, $\\epsilon$ CMa ($124\\pm2$ pc) and $\\beta$ CMa ($151\\pm5$ pc), are important contributors to the photoionization of the local interstellar clouds. At spectral type B1 II-III, $\\beta$ CMa is slightly hotter than $\\epsilon$ CMa (B2 II-III), but its ionizing flux at Earth is attenuated by a much larger H I column density. At the external surface of the clouds, the two stars produce similar fluxes in the Lyman continuum (LyC). From the $\\beta$ CMa angular diameter, bolometric flux, and position on the Hertzsprung-Russell diagram, we obtain a consistent set of stellar parameters: $T\\_{\\rm eff} = 25,180\\pm1120$ K, $\\log g = 3.70\\pm0.08$, radius $R = 8.44\\pm0.56\\,R\\_{\\odot}$, mass $M = 13\\pm1\\,M\\_{\\odot}$, and luminosity $L = 10^{4.41\\pm0.06}\\, L\\_{\\odot}$. The EUVE-observed fluxes and non-LTE model atmospheres are used to determine the ionizing photon production rate $Q\\_{\\rm H} = 10^{46.0}$ photons s$^{-1}$ and fluxes incident on the local clouds, $\\Phi\\_{\\rm HI} \\approx 3700$ cm$^{-2}$ s$^{-1}$ and $\\Phi\\_{\\rm HeI} \\approx 110$ cm$^{-2}$ s$^{-1}$ in the H I and He I continua. The corresponding photoionization rates are $\\Gamma\\_{\\rm HI} \\approx 1.5\\times10^{-14}$ s$^{-1}$ and $\\Gamma\\_{\\rm HeI} \\approx 7.3\\times10^{-16}$ s$^{-1}$. Within the local cloud, the LyC flux is attenuated by an H I column density $N\\_{\\rm HI} = (1.9\\pm0.1)\\times10^{18}$ cm$^{-2}$, with optical depth $\\tau\\_{\\rm LL} = 12.0\\pm 0.6$ at the Lyman limit. The radial velocities and proper motions of $\\beta$ CMa and $\\epsilon$ CMa indicate that both stars passed within $10\\pm1$ pc of the Sun approximately 4.4 Myr ago, with incident ionizing fluxes 180-200 times larger. Their EUV radiation photoionized and heated the tunnel in the local interstellar gas, associated dynamically with past supernova explosions in the Sco-Cen OB association.\n\n", "2508.03689": "2025-08-05, **On the Efficiency of Producing Gamma-Ray Bursts from Isolated Population III Stars**, Gibran Morales-Rivera et.al., [2508.03689v1](http://arxiv.org/abs/2508.03689v1)\n\n The rate of long-duration gamma-ray bursts (GRBs) from isolated Pop III stars is not well known, as it depends on our poor understanding of their initial mass function (IMF), rotation rates, stellar evolution, and mass loss. A sub-population of massive ($M\\_{\\rm ZAMS}\\gtrsim20M\\_\\odot$) Pop III stars is expected to suffer core-collapse and launch a relativistic jet that would power a GRB. In the collapsar scenario, a key requirement is that the pre-supernova star imparts sufficient angular momentum to the remnant black hole to form an accretion disc and launch a relativistic jet, which demands rapid initial rotation of the progenitor star and suppression of line-driven mass loss during its chemically homogeneous evolution. Here we explore a grid of stellar evolution models of Pop III stars with masses $20\\leq M\\_{\\rm ZAMS}/M\\_\\odot \\leq 100$, which are initially rotating with surface angular velocities $0.6\\leq \\Omega\\_0/\\Omega\\_{\\rm crit}\\leq 0.9$, where centrifugally-driven mass loss ensues for $\\Omega>\\Omega\\_{\\rm crit}$. Realistic accretion and jet propagation models are used to derive the initial black hole masses and spins, and jet breakout times for these stars. The GRB production efficiency is obtained over a phase space comprising progenitor initial mass, rotation, and wind efficiency. For modest wind efficiency of $\\eta\\_{\\rm wind}=0.45-0.35$, the Pop III GRB production efficiency is $\\eta\\_{\\rm GRB}\\sim10^{-5}-3\\times10^{-4}\\,M\\_\\odot^{-1}$, respectively, for a top-heavy IMF. This yields an observable all-sky equivalent rate of $\\sim2-40\\,{\\rm yr}^{-1}$ by \\textit{Swift}, with 75\\% of the GRBs located at $z\\lesssim8$. If the actual observed rate is much lower, then this would imply $\\eta\\_{\\rm wind}>0.45$, which leads to significant loss of mass and angular momentum that renders isolated Pop III stars incapable of producing GRBs and favours a binary scenario instead.\n\n", "2508.03602": "2025-08-05, **Testing Gauss-Bonnet Gravity with DESI BAO Data**, Praveen Kumar Dhankar et.al., [2508.03602v1](http://arxiv.org/abs/2508.03602v1)\n\n In the present paper, we observationally constrain f (G) gravity at the background level using Type Ia supernovae from the Pantheon Plus (PP) sample, cosmic chronometer (CC) data, and the recent Baryon Acoustic Oscillation (BAO) measurements released by DESI. For the analysis, we consider two combinations of datasets: (i) PP + CC, and (ii) PP + CC + DESI BAO. In both cases, we determine the best-fit parameters by numerically solving the modified Friedmann equations for two distinct f (G) models, namely the power-law and exponential forms. This is achieved through Markov Chain Monte Carlo (MCMC) simulations. To assess the statistical significance of the f (G) models, we employ both the Akaike Information Criterion (AIC) and the Bayesian Information Criterion (BIC). Our results show that both f (G) models are statistically favored over the standard {\\Lambda}CDM model. Notably, the exponential model exhibits an additional future transition at redshift closer to -0.1, indicating a possible return to a decelerating phase. This distinctive behavior sets it apart from both the power-law model and the {\\Lambda}CDM scenario, which predict continued acceleration into the future.\n\n"}}