{"neutrino": {"2512.02854": "2025-12-02, **From Dark Sectors to the Axion-Neutrino Connection**, H. B. Câmara et.al., [2512.02854v1](http://arxiv.org/abs/2512.02854v1)\n\n The Standard Model (SM) of particle physics provides a successful description of fundamental particles and their interactions but fails to explain phenomena such as neutrino oscillations, dark matter (DM), and the baryon asymmetry of the Universe. These clear signs of BSM physics motivate extensions introducing new particles and symmetries. Theoretical questions like the flavor puzzle and the strong CP problem further guide BSM frameworks. This thesis explores BSM scenarios based on two guiding principles: constructing unified frameworks that address multiple open problems in (astro)particle physics and cosmology, and emphasizing their experimental testability through detailed phenomenological analyses. This approach uncovers deep connections between seemingly disconnected sectors, offering a more complete view of fundamental physics. We investigate dark sector models for the origin of neutrino masses, proposing a novel setup: dark linear seesaw, which radiatively links neutrino mass generation to DM candidates and predicts charged lepton flavor violation. In these scenarios, dark sector particles can constitute WIMP DM, testable via direct detection experiments. We study spontaneous CP violation induced by a complex scalar singlet, acting as a common origin of low- and high-energy CP violating effects relevant for leptogenesis. We also analyze a Nelson-Barr model that solves the strong CP problem, generates a realistic CKM matrix radiatively, and yields scalar WIMP DM. Additionally, we present unified axion frameworks in which a colored sector radiatively generates neutrino masses. These models predict distinctive axion couplings to photons and fermions and accommodate axion DM in both pre- and post-inflationary cosmologies. Finally, we explore minimal flavored Peccei-Quinn symmetries that link the flavor puzzle, neutrino masses and DM within a predictive and testable framework.\n\n", "2512.02773": "2025-12-02, **Leptophilic Gauge Interactions in the SMEFT Era**, Seyit Okan Kara et.al., [2512.02773v1](http://arxiv.org/abs/2512.02773v1)\n\n We develop a \"precision-ready\", model-independent EFT framework that connects general leptophilic gauge interactions to their low-energy manifestations in SMEFT and LEFT. Starting from a broad U(1)'\\_ell extension in which leptons carry family-dependent charges (q\\_e, q\\_mu, q\\_tau) while quarks remain neutral, quantum consistency is ensured through a minimal set of vectorlike leptons, chiral under U(1)'\\_ell but vectorlike under the SM, together with singlet scalars responsible for symmetry breaking and the masses of both Z\\_ell and the heavy leptons. In the heavy-mediator limit, we integrate out Z\\_ell at tree level and derive compact, analytic SMEFT Wilson coefficients for four-lepton operators and Higgs-current structures, including hypercharge-U(1)'\\_ell kinetic mixing proportional to Tr(Y Q'). Renormalization-group evolution down to the electroweak scale and matching onto LEFT produce closed-form expressions directly applicable to e+e- -> l+l-, neutrino trident production, nu e scattering, parity-violating Moeller observables, and muon-decay parameters. A single parameter combination, Lambda\\_eff = M\\_Zell / (g\\_ell * sqrt(\\|q q'\\|)), governs all leading EFT signatures, offering a unified way to map UV charge assignments onto precision observables. We delineate the validity domain of this EFT and outline its use as a \"plug-and-play\" interface for global fits, collider recasts, and future-collider projections.\n\n", "2512.02733": "2025-12-02, **Heavy sterile neutrinos in $B$ decays and new QCD corrections to their semi-hadronic decay rates**, Tim Kretz et.al., [2512.02733v1](http://arxiv.org/abs/2512.02733v1)\n\n In modern experiments on flavour physics it is possible to search for the decays of $B$ or $D$ mesons or $τ$ leptons into final states with heavy neutrinos $N$ (a.k.a. heavy neutral leptons). I present a common study of theorists and experimentalists from Belle II on constraints on $B \\rightarrow D^{*} \\ell N$. Next I discuss the status of the theory predictions of the various $N$ decay rates. In scenarios in which $N$ interacts with SM particles only through sterile-active neutrino mixing, the dependence of the lifetime on the relevant mixing angles is important to determine whether $N$ decays in the detector or outside. To calculate the inclusive decay rate into semi-hadronic final states reliably one needs to include radiative QCD corrections. I present analytic results for the QCD-corrected decay rates and discuss their phenomenological impact.\n\n", "2512.02672": "2025-12-02, **Exploring Leptogenesis, WIMP Dark Matter, and Gravitational Waves in an extended Scalar Framework**, Subhaditya Bhattacharya et.al., [2512.02672v1](http://arxiv.org/abs/2512.02672v1)\n\n We explore extensions of type I seesaw framework with a scalar mediator ($Φ$) connecting to a complex scalar dark field ($S$), and right handed neutrinos ($N\\_i$), with an aim to correlate neutrino mass generation, leptogenesis, and dark matter. $\\mathcal{Z}\\_4\\times CP$ turns out to be a phenomenologically viable choice of the extended symmetry, which can accommodate a dimension five effective interaction $\\bar{l}\\_L^α\\tilde{H}ΦN\\_i$, involving the SM lepton isodoublet ${l}\\_L$, and Higgs $H$; prohibiting the canonical Yukawa term $\\bar{l}\\_L^α\\tilde{H} N\\_i$. The $\\mathcal{Z}\\_{4}$ symmetry is spontaneously broken via the vacuum expectation value (VEV) of the $Φ$ filed, which directly affects neutrino mass generation and leptogenesis; while the $CP$ symmetry stabilises one component of $S$, making it a viable dark matter candidate. The discrete symmetry breaking creates domain wall, which needs to be annihilated before the over-closure of the Universe. This paves the way for gravitational wave signal associated with the model set up, which probes the symmetry breaking scale, and indirectly connects to the other phenomena.\n\n", "2512.02656": "2025-12-02, **KM3NeT/ARCA stacking search for high-energy neutrinos from blazars**, Francesco Carenini et.al., [2512.02656v1](http://arxiv.org/abs/2512.02656v1)\n\n Blazars are promising targets for neutrino astronomy, as highlighted by IceCube's identification of TXS 0506+056 as a cosmic neutrino source candidate. High-frequency-peaked BL Lacs (HBLs) stand out due to their characteristic electromagnetic high-energy emission properties, which makes them as well promising candidates for the production of high-energy neutrinos. Such neutrinos could be detected by KM3NeT/ARCA, a next-generation deep-sea Cherenkov detector under construction in the Mediterranean Sea. This contribution presents the results of a binned likelihood stacking analysis investigating high-energy neutrino emissions from a subset of HBLs. A total of 232 sources have been selected from the 3HSP catalogue and targeted in the analysis of KM3NeT/ARCA data taken with several detector configurations, specifically in the period in which from 6 to 21 detection units were deployed. The analysis is based on neutrino emission models of blazars developed using the LeHa-Paris numerical code, which simulates the spectral energy distribution of jetted active galactic nuclei.\n\n", "2512.02317": "2025-12-02, **Rare Event Searches Using Cryogenic Detectors via Direct Detection Methods**, S. Das et.al., [2512.02317v1](http://arxiv.org/abs/2512.02317v1)\n\n Cryogenic detectors are at the forefront of rare-event search experiments, including direct detection of dark matter, coherent elastic neutrino-nucleus scattering, neutrinoless double-beta decay, and searches for fractionally charged particles. Their unique ability to achieve ultra-low energy thresholds, typically O(eV-100 eV), together with excellent energy resolution and effective background suppression, makes them sensitive to extremely faint signals from rare interactions. These rare particle interactions produce phonons, ionization, or scintillation, depending on the target medium, which are registered by specialized sensors and converted into measurable signals. This review summarizes the underlying detection principles, surveys major experiments and recent results, examines forthcoming initiatives, and outlines the evolving role of cryogenic detectors in advancing the frontiers of rare-event physics.\n\n", "2512.02128": "2025-12-01, **Vacuum Structure of the BNT Model of Neutrino Mass Generation**, Saiyad Ashanujjaman et.al., [2512.02128v1](http://arxiv.org/abs/2512.02128v1)\n\n We analyze the vacuum structure of the Babu--Nandi--Tavartkiladze (BNT) model of neutrino mass generation, in which the Standard Model is extended by an $SU(2)\\_L$ scalar quadruplet with hypercharge $Y=3/2$ and a vector-like $SU(2)\\_L$ triplet fermion with $Y=1$, generating neutrino masses via an effective dimension-seven operator. We delineate the theoretical constraints on the model, requiring the scalar potential to be bounded from below in all field directions, ensuring perturbative unitarity of scattering amplitudes, and demanding that the electroweak vacuum corresponds to the global minimum of the potential. We find that the electroweak vacuum is not generically guaranteed to be the global minimum: several charge-breaking stationary points may coexist with -- and potentially lie below -- it in potential depth. For the electroweak-like vacuum with vanishing quadruplet expectation value, the condition of global stability reduces to two simple mass inequalities involving the doubly- and triply-charged scalars. In contrast, for the general electroweak vacuum with nonzero doublet and quadruplet expectation values -- compatible with neutrino-mass generation -- no comparably simple analytic condition emerges, and the stability must be assessed for each specific choice of scalar couplings. Nonetheless, by combining the analytic condition governing the relative depth of the two electroweak stationary points with the mass inequalities ensuring the stability of the electroweak-like configuration against charge breaking, we obtain a practical criterion for determining when the general electroweak vacuum is globally stable.\n\n", "2512.02101": "2025-12-01, **Do neutrinos dream in 5D? Towards a comprehensive extra-dimensional neutrino phenomenology**, Arturo de Giorgi et.al., [2512.02101v1](http://arxiv.org/abs/2512.02101v1)\n\n This paper provides a comprehensive overview of neutrino masses and mixing in Large Extra Dimension scenarios, focusing on the phenomenological impact of a five-dimensional (5D) bulk fermion. In a flat extra dimension compactified on an $S^1/\\mathbb{Z}\\_2$ orbifold, this fermion manifests as a Kaluza-Klein tower of right-handed neutrinos in the 4D effective theory. We systematically investigate four distinct scenarios for mass generation, considering both Dirac and Majorana mass terms originating from either the bulk or the 3-brane. For each case, we analyse the consequences for neutrino oscillations in a vacuum and in matter, deriving the resulting mass spectra and mixing patterns. By comparing these theoretical predictions with experimental data, we explore the constraints on the large extra dimensions' parameters.\n\n", "2512.02099": "2025-12-01, **Possible $ν$ Source Class: 3-sigma Detection of High-Energy Neutrinos from Supermassive Black Hole Binary Candidates**, Pugazhendhi A D et.al., [2512.02099v1](http://arxiv.org/abs/2512.02099v1)\n\n Identifying the sources of high-energy (TeV-PeV) astrophysical neutrinos is crucial for studies in both astrophysics and particle physics. Despite extensive searches for more than a decade, which revealed several individual potential sources and only one potential source class, the origins of these neutrinos remain largely unresolved; thus, more source classes should be investigated. In this work, we conduct the first search for high-energy neutrino emission from a new source class, supermassive black hole binaries (SMBHBs), which are also theoretically motivated. We perform an unbinned maximum-likelihood-ratio analysis on our constructed catalog of 693 SMBHB candidates and 10 years of IceCube public data. Our results show positive correlations, with higher significance in more physically motivated scenarios and the highest significance at 3.0$σ$. In addition, we also study potential connections between SMBHBs' high-energy neutrino and nano-Hz gravitational-wave emissions, the latter being the main target of pulsar timing arrays. Our results provide the first evidence of SMBHBs being high-energy neutrino emitters.\n\n", "2512.01947": "2025-12-01, **Probing Neutrino-Light-Quark Effective Scalar Interactions from Neutrino Masses**, Feng-Zhi Chen et.al., [2512.01947v1](http://arxiv.org/abs/2512.01947v1)\n\n In this work, we use neutrino masses as a probe of the neutrino-light-quark effective scalar interactions. It is found that neutrinos can acquire masses not only from the usual light quark loop corrections but also from the light quark condensates. The latter contribution has been overlooked in the literature. We show that both contributions are comparable for operators involving $u$ and $d$ quarks, while quark loop corrections dominate for operators involving the $s$ quark. Using the low-energy effective field theory extended with light right-handed neutrinos and matching to chiral perturbation theory, we systematically analyze these contributions, deriving constraints on the corresponding Wilson coefficients from neutrino mass bounds, coherent elastic neutrino-nucleus scattering, and light pseudoscalar meson invisible decays. Our analysis shows that electron neutrino mass measurements provide the most stringent constraints on these scalar couplings, significantly improving upon limits from other observables. The results highlight the importance of including both perturbative and nonperturbative contributions in complete phenomenological analyses of neutrino mass generation mechanisms.\n\n", "2512.01851": "2025-12-01, **Classical Reconstruction of the PMNS Matrix Using a Mechanical Neutrino Oscillator**, Nishil Savla et.al., [2512.01851v1](http://arxiv.org/abs/2512.01851v1)\n\n Neutrino oscillations arise from quantum interference between neutrino mass eigenstates and are governed by the PMNS matrix. Although this is an intrinsically quantum phenomenon, its mathematical structure is analogous to systems of coupled classical oscillators. In this work, a three--pendulum system connected by springs is constructed as a classical analog of three--flavor neutrino oscillations. Measurements of amplitude transfer, normal--mode structure, and beat frequencies are used to extract a mechanical mixing matrix, which is compared with the structure of the PMNS matrix under the assumption of zero CP violation. A scaling relation linking mechanical time evolution to the neutrino \\(L/E\\) behavior is derived, clarifying the scope and limitations of the analogy. The experiment demonstrates how abstract concepts of neutrino mixing can be visualized using simple and accessible classical systems, offering both pedagogical value and a qualitative understanding of flavor oscillation dynamics.\n\n", "2512.01752": "2025-12-01, **The effect of Coulomb interactions on relic neutrino detection via beta decaying impurities in (semi)metals**, Karel van der Marck et.al., [2512.01752v1](http://arxiv.org/abs/2512.01752v1)\n\n Measuring the electron neutrino mass is a long-standing objective and requires a high energy resolution of certain $β$-decay experiments, as well as a visible cosmic neutrino background ($CνB$) spectrum. Many quantum mechanical and chemical effects could potentially impair the required resolution/visibility, e.g., the Coulomb interactions between the electrons in the \\b{eta}-decaying impurity and in the solid-state environment. We analyze the effect when hybridization is suppressed completely using a dielectric spacer, and also when hybridization is present up to the lowest nontrivial order in perturbation theory.\n\n", "2512.01721": "2025-12-01, **Electron-induced single-pion production to constrain the neutron structure in $^{40}$Ar. A proof of concept**, J. García-Marcos et.al., [2512.01721v1](http://arxiv.org/abs/2512.01721v1)\n\n We study electron-induced single-pion production as a way to constrain the neutron structure of $^{40}$Ar, information that is necessary for neutrino experiments using argon detectors. The proposed experimental signal consists in detecting in coincidence the scattered electron, a proton and a $π^-$. We performed simulations compatible with the experimental conditions of the MAMI (University of Mainz) and CLAS (Jefferson Lab) facilities. We have computed cross sections and evaluated the main backgrounds. MAMI is a three-spectrometer system with extremely good energy resolution and small acceptances. We found that, by choosing specific values of the final particle's momenta, the shell structure can be well resolved, with negligible background contributions. CLAS is a large solid angle detector with poorer energy resolution. In both cases, the background can be kept under control by performing cuts in missing energy and missing momentum; however, in CLAS, the shell structure cannot be resolved due to the energy resolution. We conclude that MAMI is particularly appropriate for the proposed experiment, whereas CLAS is better suited for other studies.\n\n", "2512.01403": "2025-12-01, **The impact of Solar magnetic field configurations on the production of gamma rays at the Solar disk**, Julien Dörner et.al., [2512.01403v1](http://arxiv.org/abs/2512.01403v1)\n\n The Sun produces a steady signal of high-energy gamma rays through interactions of Galactic cosmic rays (GCRs) with its atmosphere. Observations with Fermi-LAT and HAWC have revealed a gamma-ray flux significantly higher than early theoretical predictions, with unexpected temporal and spectral features that suggest a crucial role of the solar magnetic field. In this work, we model GCR-induced gamma-ray emission at the solar disk using the CRPropa framework with realistic hadronic interactions, chromospheric density profiles, and several magnetic field configurations over the solar cycle. This allows us to quantify the gamma-ray emission of the entire solar disk for different phases of the solar activity cycle and we present, for the first time, maps of the production locations of gamma rays on the solar surface. We consider both mono-energetic and realistic power-law injection spectra in a simplified dipole-quadrupole current sheet model and potential-field source surface (PFSS) extrapolations for Carrington rotations during solar maximum and minimum. Our results show that magnetic mirroring and large-scale field topology strongly affect the spectral shape and spatial distribution of the emission, with slightly enhanced fluxes predicted at solar minimum. While our simulated baseline fluxes remain below observations, additional effects, such as heavier nuclei, Parker-field mirroring, and deeper atmospheric interactions, could result in further enhancements of fluxes closer to observational values. Hadronic interactions do not only produce gamma rays but also neutrinos. We estimate the expected neutrino flux from the Sun based on our gamma-ray predictions. We find that the expected flux is slightly below current upper limits from IceCube.\n\n", "2512.01324": "2025-12-01, **Panda: Self-distillation of Reusable Sensor-level Representations for High Energy Physics**, Samuel Young et.al., [2512.01324v1](http://arxiv.org/abs/2512.01324v1)\n\n Liquid argon time projection chambers (LArTPCs) provide dense, high-fidelity 3D measurements of particle interactions and underpin current and future neutrino and rare-event experiments. Physics reconstruction typically relies on complex detector-specific pipelines that use tens of hand-engineered pattern recognition algorithms or cascades of task-specific neural networks that require extensive, labeled simulation that requires a careful, time-consuming calibration process. We introduce \\textbf{Panda}, a model that learns reusable sensor-level representations directly from raw unlabeled LArTPC data. Panda couples a hierarchical sparse 3D encoder with a multi-view, prototype-based self-distillation objective. On a simulated dataset, Panda substantially improves label efficiency and reconstruction quality, beating the previous state-of-the-art semantic segmentation model with 1,000$\\times$ fewer labels. We also show that a single set-prediction head 1/20th the size of the backbone with no physical priors trained on frozen outputs from Panda can result in particle identification that is comparable with state-of-the-art (SOTA) reconstruction tools. Full fine-tuning further improves performance across all tasks.\n\n"}, "dark matter": {"2512.03006": "2025-12-02, **Modeling dark matter halos with self-interacting fermions**, Fabian Hernandez-Gutierrez et.al., [2512.03006v1](http://arxiv.org/abs/2512.03006v1)\n\n In this work we study the possibility of modeling the dark matter content in galaxies as a core-halo model consisting of self-gravitating, self-interacting fermions. For the core of the halo, the dark matter fermions are degenerate, while for the halo we have considered two possibilities: the fermions have thermalized as a perfect fluidor they will follow a standard cold dark matter Navarro-Frenk-White profile. The core density profile is obtained by solving the Tolman-Oppenheimer-Volkoff equations, and their properties are determined by the fermion mass, the central density and the interaction strength. The mass of the fermion and the strength of the fermion self-interaction is fixed by doing a $χ^2$ analysis to fit that fit the rotational curves of Low Surface Brightness galaxies. It was found that the fermion mass should be in the range $38.73~\\rm{eV}< m\\_{f} < 42.11~\\rm{eV}$ and the interparticle strength in the range $269.69 < y <348.48$ at $68$ C.L. in order to reproduce the rotational curves adequately, in the case when the halo is modeled as a thermalized ideal gas. Similar values are obtained if the halo is modeled following a Navarro-Frenk-White case, namely $41.54 ~\\rm{eV} < m\\_{f} <49.87 ~\\rm{eV}$ and $5606.06< y < 17484.84$. Once fixed the values of the mass of the fermion $m\\_f$ and the interaction strength $y$, we tested the core-halo model with data from the Milky Way and the SPARC database. We have found good agreement between the data and the core-halo models, varying only one free parameter: the central density. Thus a single fermion can fit hundreds of galaxies. Nevertheless, the dark matter halo surface density relation or the halo total mass and radius depend strongly on the model for the halo.\n\n", "2512.02954": "2025-12-02, **The suppression of the matter power spectrum: strong feedback from X-ray gas mass fractions, kSZ effect profiles, and galaxy-galaxy lensing**, Jared Siegel et.al., [2512.02954v1](http://arxiv.org/abs/2512.02954v1)\n\n Baryon feedback redistributes gas relative to the underlying dark matter distribution and suppresses the matter power spectrum on small scales, but the amplitude and scale dependence of this effect are uncertain. We constrain the impact of baryon feedback on the matter power spectrum by jointly analysing X-ray gas mass fractions from the eROSITA and HSC-XXL samples and SDSS/DESI+ACT kinetic Sunyaev-Zel'dovich (kSZ) effect profiles; the samples are characterised with galaxy-galaxy lensing and together span group and cluster masses at $0<z<1$. Using the baryonification framework, our joint eROSITA and kSZ model gives precise constraints on the suppression of the matter power spectrum: $10 \\pm 2\\%$ at $k=1~h~\\mathrm{Mpc}^{-1}$. The inferred gas profiles are more extended and the power suppression is stronger than predicted by the fiducial models of recent hydrodynamical simulation suites, including FLAMINGO and BAHAMAS. The HSC-XXL gas mass fractions, which the fiducial simulations were calibrated to reproduce, prefer more moderate power suppression than the kSZ and eROSITA data: $5 \\pm 4\\%$ at $k=1~h~\\mathrm{Mpc}^{-1}$. With a simulated LSST Year 1 weak lensing analysis, we demonstrate a framework for next-generation surveys: calibrating feedback models with multi-wavelength gas observables to recover the small-scale statistical power of cosmic shear.\n\n", "2512.02900": "2025-12-02, **Interacting Generalized Chaplygin-Jacobi gas: Thermodynamics approach**, Gilberto Aguilar-Pérez et.al., [2512.02900v1](http://arxiv.org/abs/2512.02900v1)\n\n This work investigates a cosmological model featuring an interaction between dark energy and dark matter, where the dark energy component is described by the Generalized Chaplygin-Jacobi gas (GCJG). In this study, we establish a system in which the GCJG and a pressureless dark matter fluid exchange energy via a linear interaction term, $Q \\propto ρ\\_x$, being $ρ\\_{x}$ the dark energy density. By solving the conservation equations, we derive analytical expressions for the evolution of the dark energy and dark matter densities. The thermodynamic properties of this interacting system are then thoroughly analyzed. The thermodynamic analysis reveals that both dark components maintain positive temperatures, ensuring stability. Notably, the dark energy component transitions to a phantom regime in the past, a feature of interest for recent cosmological observations, without violating thermodynamic principles. The total entropy production is shown to be in agreement with the second law of thermodynamics. Furthermore, an analysis of the specific heats suggests that while the dark matter sector remains thermodynamically stable, the dark energy sector undergoes a late-time phase transition, consistent with its entering into the phantom domain at effective level.\n\n", "2512.02885": "2025-12-02, **Exciton spin structure in lead halide perovskite semiconductors explored via the spin dynamics in magnetic field**, Vladimir L. Zhiliakov et.al., [2512.02885v1](http://arxiv.org/abs/2512.02885v1)\n\n We theoretically investigate the spin structure and spin dynamics of excitons in bulk lead halide perovskite semiconductors with cubic, tetragonal, and orthorhombic crystal symmetry. The exciton spin structure and its modification by an external magnetic field are modeled for different regimes defined by the relative magnitude of the electron-hole exchange interaction (splitting between dark and bright states) and the Zeeman spin splitting. The effects of crystal symmetry and magnetic field orientation with respect to the crystal axes are considered for lead halide perovskite crystals with band gaps in the range 1.4 - 3.5 eV, having different ratios of electron and hole g-factors. For cubic symmetry, in a longitudinal magnetic field, our theory predicts quantum beats between the bright exciton states under linearly polarized excitation and detection, while the dark exciton remains optically inactive. In a transverse magnetic field, all exciton spin states become optically active and can be excited by circularly polarized light. Reduction of the crystal symmetry leads to a zero-field offset of the exciton Larmor precession frequencies, modifying the Zeeman splitting energy dependence on magnetic field. This theoretical framework allows for the extraction of the strength of the exchange interaction and the crystal symmetry. Experimentally, we measure the exciton spin coherence via time-resolved photoluminescence at a temperature of 1.6 K in longitudinal and transverse magnetic fields in orthorhombic MAPbI3 crystals. Polarization beats at the frequency of the bright exciton are observed in both configurations. Comparison with theory indicates that the excitons are in the strong exchange interaction regime, and the reduction of symmetry does not lead to a significant splitting of the exciton spin levels.\n\n", "2512.02871": "2025-12-02, **Limiting Reduction and Modified Gravity**, Antonis Antoniou et.al., [2512.02871v1](http://arxiv.org/abs/2512.02871v1)\n\n Modified Newtonian Dynamics (MOND) is a framework of theories that adjust Newton's laws of gravity to explain effects such as galactic rotation anomalies, offering an alternative to dark matter. This essay examines the justification of MOND by assessing its inter-theoretical relationship to established theories across relevant scales, in particular its connection to Newtonian gravitation. We argue that MOND fails a key condition for a theory's justification--what we call 'reduction-wise justification'--since it does not adequately reduce to Newtonian gravity in a fully non-arbitrary way. More precisely, despite satisfying the standard formal criteria for successful limiting reduction, MOND does not properly reduce to Newtonian gravitation because of (i) the absence of a fundamental theoretical framework to justify the interpolating function introduced in MOND and (ii) the lack of a unified mathematical structure working across all scales, independent of Newtonian theory. Hence, the case study of MOND provides crucial results for the general debate on inter-theoretic reduction in science: MOND's failure as a case of reduction highlights important limitations in standard accounts of limiting reduction. We respond by proposing a more refined framework for limiting reduction that introduces two additional criteria to better distinguish successful from pathological reductions. More broadly, this case illustrates how analysing reduction-wise justification can serve as a powerful tool for evaluating the validity of novel theories that are not yet empirically established.\n\n", "2512.02703": "2025-12-02, **Lepton Flavor Physics in the flipped 3-3-1-1 Model: Non-Universality and Violation**, D. T. Huong et.al., [2512.02703v1](http://arxiv.org/abs/2512.02703v1)\n\n We investigate the flavor violation (FV) of Z decays to leptons at tree level and flavor conserving Z decays to leptons in the frame work of the flipped $ SU(3)\\_C\\otimes SU(3)\\_L \\otimes U(1)\\_X\\otimes U(1)\\_N$,(F3311) model. In addition, we analyze the processes $l\\_i\\rightarrow l\\_j γ$ and the leptonic three-body decay. Using the experimental bounds on these decays we set the constraint on $\\sin φ$ which represents the mixing between Z-Z' boson. The most stringent limits arises from $μ\\rightarrow e γ$ decay where $\\sin φ\\sim \\mathcal{ O}(10^{-3})$. The leptonic three-body decay set lower bound on the mass of the new neural gauge boson $m\\_{Z'} \\geq 3.2TeV$. Using the LUX-ZEPLIN (LZ) experiment data we set bounds to the mass of the dark matter candidates.   Subsequently, we investigate the lepton non-universality in B decays within the $F3311$ model by calculating the generic one-loop contribution to the process $u\\_i\\rightarrow d\\_j e\\_b \\barν\\_a$ in the unitary gauge as well as numerical evaluating the branching ratio $R\\_D, R\\_{D^{(*)}},R(X\\_c)$. We demonstrate that the $F3311$ model can address the $3.3 σ$ discrepancies between Standard Model and experimental data. To reaffirm our results, we also analyze the $d \\to u$ transitions and $s\\to u$ transitions. These two transitions also give consistent result with experiment data. Combine all experiment dat a we obtain the operating region for the mass of the model   specifically $m\\_E \\in [6.5, 9 ]TeV$, $m\\_Q \\in [6,11]TeV$ and the dark matter candidate $m\\_ξ\\in [1.5,2 ]TeV$.\n\n", "2512.02434": "2025-12-02, **The exotic black hole-neutron star binaries in our Galaxy**, Man Ho Chan et.al., [2512.02434v1](http://arxiv.org/abs/2512.02434v1)\n\n It has been suggested that there are $\\sim 10^5$ black hole-neutron star (BH-NS) binaries in our Galaxy. However, despite the effort of intensive radio search for decades, none of these binaries has been found to date. These binaries are regarded as a holy grail of astronomy because they can greatly improve our understanding about relativistic systems of compact objects and fundamental physics. In this article, we propose the existence of exotic BH-NS binaries which can open a new way in searching the missing BH-NS binaries in our Galaxy. By considering the possible dark matter density spikes formed around the primordial black holes in the BH-NS binaries, we show that extremely high temperature ($\\sim 10^6$ K) could be maintained on the surface of the neutron stars due to effective dark matter capture. This interesting feature can also help reveal the nature of dark matter and possibly further improve the upper limit of dark matter scattering cross section well below $10^{-47}$ cm$^2$.\n\n", "2512.02177": "2025-12-01, **$S^5$: Tidal Disruption in Crater 2 and Formation of Diffuse Dwarf Galaxies in the Local Group**, Guilherme Limberg et.al., [2512.02177v1](http://arxiv.org/abs/2512.02177v1)\n\n We present results of a spectroscopic campaign around the diffuse dwarf galaxy Crater 2 (Cra2) and its tidal tails as part of the Southern Stellar Stream Spectroscopic Survey ($S^5$). Cra2 is a Milky Way dwarf spheroidal satellite with extremely cold kinematics, but a huge size similar to the Small Magellanic Cloud, which may be difficult to explain within collisionless cold dark matter. We identify 143 Cra2 members, of which 114 belong to the galaxy's main body and 29 are deemed part of its stellar stream. We confirm that Cra2 is dynamically cold (central velocity dispersion $2.51^{+0.33}\\_{-0.30}\\,{\\rm km\\,s^{-1}}$) and also discover a $\\approx$7$σ$ velocity gradient consistent with its tidal debris track. We separately estimate the stream velocity dispersion to be $5.74^{+0.98}\\_{-0.83}\\,{\\rm km\\,s^{-1}}$. We develop a suite of $N$-body simulations with both cuspy and cored density profiles on a realistic Cra2 orbit to compare with $S^5$ observations. We find that the velocity dispersion ratio between Cra2 stream and galaxy ($2.30^{+0.41}\\_{-0.35}$) is difficult to reconcile with a cuspy halo with fiducial concentration and an initial mass predicted by standard stellar mass$-$halo mass relationships. Instead, either a cored halo with relatively small core radius or a low-concentration cuspy model can reproduce this ratio. Despite tidal mass loss, Cra2 is metal-poor ($\\langle \\rm[Fe/H]\\rangle=-2.16\\pm0.04$) compared to the stellar mass$-$metallicity relation for its luminosity. Other diffuse dwarf galaxies similar to Cra2 in the Local Group (Antlia 2 and Andromeda 19) also challenge galaxy formation models. Finally, we discuss possible formation scenarios for Cra2, including ram-pressure stripping of a gas-rich progenitor combined with tides.\n\n", "2512.02155": "2025-12-01, **SE+BSF4DM - A micrOMEGAs package for Sommerfeld Effect and Bound State Formation in colored Dark Sectors**, Mathias Becker et.al., [2512.02155v1](http://arxiv.org/abs/2512.02155v1)\n\n We present SE+BSF4DM, a novel add-on package for micrOMEGAs that includes the Sommerfeld effect and bound state formation in the numerical evaluation of the dark matter relic density for QCD colored dark sectors. Including these non-perturbative effects in the relic density calculation is crucial for achieving accurate predictions in a broad class of models and SE+BSF4DM seamlessly integrates them into the standard micrOMEGAs workflow, requiring minimal user modification. The package is applicable to any model mappable onto a simplified t-channel framework, making it a versatile tool. This paper details the implementation, assets, and scope of SE+BSF4DM, serving as both a comprehensive introduction and a practical user guide.\n\n", "2512.02127": "2025-12-01, **Ripples in the baryon to dark matter ratio in $Λ$CDM: implications for galaxy formation**, Owen Jessop et.al., [2512.02127v1](http://arxiv.org/abs/2512.02127v1)\n\n We use the FLAMINGO galaxy formation model to quantify the impact of baryon-CDM isocurvature perturbations on galaxy formation in $Λ$CDM. In linear theory, these perturbations represent local, compensated variations in the ratio between the baryon and CDM densities; they freeze in amplitude at late times, with an RMS amplitude of $1.5\\%$ on the Lagrangian scale of a $10^{11}\\,\\rm M\\_\\odot$ halo ($0.85\\, \\rm{Mpc}$). Although such perturbations arise naturally within $Λ$CDM, most cosmological simulations and semi-analytic models to date omit them. These perturbations are strongly anti-correlated with the matter overdensity field such that halos form with baryon fractions below the cosmic mean, with earlier-collapsing halos exhibiting stronger baryonic suppression. To isolate the galaxy response, we analyse three hydrodynamical simulations with identical initial matter overdensity fields that: i) include isocurvature modes, ii) omit them, or iii) invert their amplitude. At $z=8$, isocurvature perturbations reduce the mean baryon fraction and star formation rates of resolved halos by $ 5\\%$ and $ 12\\%$, respectively, relative to the null-isocurvature case. These effects are almost independent of halo mass and diminish steadily with time, reaching $ 0.1\\%$ and $ 1\\%$ by $z=0$. We develop a model based on spherical collapse that accurately reproduces the mean baryon fraction suppression. As high-redshift observations become increasingly routine, incorporating isocurvature perturbations into simulations and semi-analytic models will be important for robust predictions of early galaxy and black hole formation in the JWST era.\n\n", "2512.02115": "2025-12-01, **Determining the Milky Way gravitational potential without selection functions**, Taavet Kalda et.al., [2512.02115v1](http://arxiv.org/abs/2512.02115v1)\n\n Selection effects, such as interstellar extinction and varying survey depth, complicate efforts to determine the gravitational potential - and thus the distribution of baryonic and dark matter - throughout the Milky Way galaxy using stellar kinematics. We present a new variant of the \"Deep Potential\" method of determining the gravitational potential from a snapshot of stellar positions and velocities that does not require any modeling of spatial selection functions. Instead of modeling the full six-dimensional phase-space distribution function $f\\left(\\vec{x},\\vec{v}\\right)$ of observed kinematic tracers, we model the conditional velocity distribution $p\\left(\\vec{v}\\mid\\vec{x}\\right)$, which is unaffected by a purely spatial selection function. We simultaneously learn the gravitational potential $Φ\\left(\\vec{x}\\right)$ and the underlying spatial density of the entire tracer population $n\\left(\\vec{x}\\right)$ - including unobserved stars - using the collisionless Boltzmann equation under the stationarity assumption. The advantage of this method is that unlike the spatial selection function, all of the quantities we model, $p\\left(\\vec{v}\\mid\\vec{x}\\right)$, $Φ\\left(\\vec{x}\\right)$, and $n\\left(\\vec{x}\\right)$, typically vary smoothly in both position and velocity. We demonstrate that this \"conditional\" Deep Potential method is able to accurately recover the gravitational potential in a mock dataset with a complex three-dimensional dust distribution that imprints fine angular structure on the selection function. Because we do not need to model the spatial selection function, our new method can effectively scale to large, complex datasets while using relatively few parameters, and is thus well suited to Gaia data.\n\n", "2512.02095": "2025-12-01, **The DREAMS Project: Disentangling the Impact of Halo-to-Halo Variance and Baryonic Feedback on Milky Way Satellite Galaxies**, Jonah C. Rose et.al., [2512.02095v1](http://arxiv.org/abs/2512.02095v1)\n\n We analyze the properties of satellite galaxies around 1,024 Milky Way-mass hosts from the DREAMS Project, simulated within a $Λ$CDM cosmology. Utilizing the TNG galaxy-formation model, the DREAMS simulations incorporate both baryonic physics and cosmological uncertainties for a large sample of galaxies with diverse environments and formation histories. We investigate the relative impact of the physical uncertainty from the galaxy-formation model on predicted satellite properties using four metrics: the satellite stellar mass function, radial distribution, inner slope of dark matter density profile, and stellar half-light radius. We compare these predictions to observations from the SAGA Survey and the DREAMS N-body simulations and find that uncertainties from baryonic physics modeling are subdominant to the scatter arising from halo-to-halo variance. Where baryonic modeling does affect satellites, the supernova wind energy has the largest effect on the satellite properties that we investigate. Specifically, increased supernova wind energy suppresses the stellar mass of satellites and results in more extended stellar half-light radii. The adopted wind speed has only a minor impact, and other astrophysical and cosmological parameters show no measurable effect. Our findings highlight the robustness of satellite properties against uncertainties in baryonic physics modeling.\n\n", "2512.02097": "2025-12-01, **Unitarizing non-relativistic scattering**, Marcos M. Flores et.al., [2512.02097v1](http://arxiv.org/abs/2512.02097v1)\n\n Unitarity imposes coupled constraints on elastic and inelastic amplitudes. Satisfying them requires resummation of the self-energy contributions from both elastic and inelastic channels. Inelastic channels generate anti-Hermitian contributions that can be consistently deduced from the unitarity relation underlying the optical theorem, leading to non-local separable potentials and a compact unitarization scheme in the non-relativistic regime. We present two alternative derivations of the anti-Hermitian kernel, from the continuity equation and by integrating out inelastic channels. We further extend this framework to treat non-analytic and non-convergent behavior of inelastic amplitudes in the complex momentum plane and to incorporate bound states. For non-convergent amplitudes, we demonstrate a simple renormalization procedure in which anti-Hermitian separable potentials necessarily induce Hermitian separable counterterms, yielding finite cross sections consistent with unitarity. These results provide a general tool for non-relativistic scattering problems, with clear applications to dark-matter phenomenology.\n\n", "2512.01998": "2025-12-01, **Constraining Dark Acoustic Oscillations with the High-Redshift UV Luminosity Function**, Jared Barron et.al., [2512.01998v1](http://arxiv.org/abs/2512.01998v1)\n\n Dark acoustic oscillations (DAOs) in the matter power spectrum can arise in many different dark sector models, and can imprint on a variety of cosmological observables. In this work we use measurements of the galactic UV luminosity function (UVLF) at high redshifts to constrain the dark acoustic oscillation feature at small scales in a model-agnostic way. We introduce a phenomenological transfer function model for a dark sector with a species undergoing DAOs which can accommodate sub-dominant dark matter abundances, and obtain constraints on its parameters. In order to predict the UVLF, we employ an Extended Press-Schechter formalism which we calibrate using N-body simulations with initial conditions featuring DAOs. Using measurements from the Hubble Space Telescope, James Webb Space Telescope, Subaru Telescope, and Canada-France-Hawaii Telescope, we constrain the wave number of the first DAO peak to be at $k \\gtrsim 50\\ h/\\mathrm{Mpc}$, unless the fraction of dark matter undergoing DAOs is less than $0.07$.\n\n", "2512.01641": "2025-12-01, **Stability of Neutron-Dark Matter Mixed Stars and Hybrid Stars**, Xiao-Ding Zhou et.al., [2512.01641v1](http://arxiv.org/abs/2512.01641v1)\n\n Concerning the stability of two-fluid star models, we prove the rigorous equivalence of two independent determining methods for mixed stars, after a brief review of the hybrid star case. Our derivations apply to general multi-fluid cases, and here we take dark matter admixed neutron star models for example, demonstrating a stability boundary distinct from the single-fluid case. Stable configurations form a surface in the three-dimensional parameter space of (either) central pressure, mass, and radius, which yields a group containing stable mixed stars. This group includes twin stars with identical masses and radii but different interior structures. These results can help interpret compact star observations and constrain dark matter properties through astrophysics.\n\n", "2512.01640": "2025-12-01, **Equivalence of Stability Criteria for Multi-Fluid Stars**, Tian-Shun Chen et.al., [2512.01640v1](http://arxiv.org/abs/2512.01640v1)\n\n We present a rigorous proof establishing the mathematical equivalence between two independent criteria for the marginal stability of multi-fluid relativistic stars: the dynamical criterion based on the vanishing of the fundamental radial pulsation mode's eigenfrequency, and the static criterion derived from the geometric alignment of mass and particle number gradients in the parameter space. Leveraging this equivalence, we introduce a powerful and computationally efficient framework as an upgraded version of the critical curve method, to systematically map the stability boundaries for multi-fluid mixed stars across the entire parameter space of central pressures. Our analysis, applied to a variety of nuclear and dark matter equations of state, reveals the existence of stable region in the observable mass-radius diagram. By resolving degeneracies with 3-dimensional Mass-Radius-Pressure diagrams, we provide a complete topological view of the ensemble. This work supplies a robust theoretical foundation for interpreting multi-messenger astronomical observations and constraining the properties of dark matter.\n\n", "2512.01622": "2025-12-01, **Analytical Emulator for the Baryon EoM inside the Fuzzy Dark Matter Soliton from Machine Learning**, Ke Wang et.al., [2512.01622v1](http://arxiv.org/abs/2512.01622v1)\n\n An empirical baryon density profile can be included in the Schrödinger-Poisson (SP) equations to influence the fuzzy dark matter (FDM) soliton formation. However, to probe the effects of baryon on the other dynamical evolutions of the FDM soliton, its equation of motion (EoM) inside the corresponding FDM soliton is needed. In this paper, given an empirical baryon density profile, we first provide the cylinderical symmetric FDM soliton solution about the FDM density and the total potential of FDM and baryon. Then, we build an analytical baryon EoM from the obtained FDM density and total potential by machine learning. Finally, we check that this baryon EoM works as well as an empirical baryon density profile for the FDM soliton formation, with the fractional errors $\\lesssim0.04$. It should also work well for some other simple FDM soliton evolutions.\n\n", "2512.01547": "2025-12-01, **Exploring the ultra-faint dwarf Bootes I using JWST and HST: Metallicity distribution and binaries**, F. Muratore et.al., [2512.01547v1](http://arxiv.org/abs/2512.01547v1)\n\n Ultra-faint dwarf galaxies (UFDs) are among the oldest and most metal-poor stellar systems in the Universe. Their metallicity distribution encodes the fossil record of the earliest star formation, feedback, and chemical enrichment, providing crucial tests of models of the first stars, galaxy assembly, and dark matter halos. However, due to their faint luminosities and the limited number of bright giants, spectroscopic studies of UFDs typically probe only small stellar samples. Here, we present an analysis of multi-epoch Hubble Space Telescope and James Webb Space Telescope observations of the UFD Bootes I. Using deep color-magnitude diagram in the F606W and F322W2 bands, extending from the subgiant branch to the M-dwarfs, and stellar proper motions to identify likely members, we obtained an unprecedentedly clean census of the system. The exquisite quality of the diagram, combined with the sensitivity of M-dwarf colors to metallicity, allowed us to constrain the metallicity distribution in a large stellar sample. As a first step, we derived the binary fraction in Bootes I. This is crucial, since binaries can bias kinematic mass estimates, affect stellar population analyses, and shape the photometric signatures used to infer metallicity. We find that 20$\\pm$2% of stellar systems in Bootes I are binaries with mass ratios larger than 0.4, corresponding to a total binary fraction of $\\sim$30%. This value is comparable to the binary fractions observed in globular clusters of similar stellar mass, suggesting that the presence of dark matter does not significantly affect the binary properties of Bootes I. We then exploited the metallicity sensitivity of M-dwarf colors to derive the metallicity distribution function. We find that most of the stars $\\sim$85% have [Fe/H]<-2, and that roughly $\\sim$17% have [Fe/H]<-3.\n\n", "2512.01471": "2025-12-01, **Accretion of Generalized Chaplygin Gas onto Cosmologically Coupled Black Holes**, Luis F. Reis et.al., [2512.01471v1](http://arxiv.org/abs/2512.01471v1)\n\n We study the accretion of cosmic dark fluids, responsible for driving the accelerated expansion of the universe, onto cosmologically coupled black holes. More specifically, we focus on the accretion of the Generalized Chaplygin Gas (GCG). To incorporate the global features of the GCG into this analysis, we employ the McVittie metric, which describes a black hole embedded in an expanding cosmological background. Within this framework, accretion is studied while consistently accounting for the backreaction on the metric components. Using a perturbative approach, we derive an expression for the effective black hole mass and for the evolution of both the black hole and cosmological apparent horizons under accretion. The analysis is performed in two distinct cosmological regimes: first, a matter-dominated era, and subsequently, a de Sitter era. In both cases, it is possible to determine analytically the instant in which accretion begins. For the matter-dominated era, the analytical expression shows that the greater the amount of matter available for accretion, the longer the accretion takes to start.\n\n", "2512.01404": "2025-12-01, **Resonant Annihilation of WIMP Dark Matter for Halo Gamma Ray Signal**, Hitoshi Murayama et.al., [2512.01404v1](http://arxiv.org/abs/2512.01404v1)\n\n We propose a resonant annihilation as a way to reconcile the WIMP annihilation cross sections in a recently reported gamma ray signal from the Milky Way halo with that for the freeze-out and the upper limit from dwarf galaxies. We perform a simple model-independent analysis based on this hypothesis and determine the required parameters. We also present a simple particle-physics model that can accommodate them.\n\n", "2512.01361": "2025-12-01, **Joint Constraints on Fuzzy and Warm Dark Matter from Satellite Populations of the Milky Way and Andromeda**, Jianxiang Liu et.al., [2512.01361v1](http://arxiv.org/abs/2512.01361v1)\n\n We perform a joint analysis of the Milky Way (MW) and Andromeda (M31) satellite populations to constrain the properties of fuzzy dark matter (FDM) and thermal-relic warm dark matter (WDM). We combine MW satellite observations from the Dark Energy Survey (DES) and Pan-STARRS1 (PS1) with M31 satellite data from the Pan-Andromeda Archaeological Survey (PAndAS), and model the corresponding observable satellite populations using the galaxy--halo connection model together with the appropriate selection functions. Uncertainties in the virial masses of the MW and M31 are incorporated through host-mass priors that linearly scale the relevant model parameters, allowing us to infer the full posterior distributions of all parameters. For the FDM case, we obtain $m\\_{\\mathrm{FDM}} > 1.75 \\times 10^{-20}~\\mathrm{eV}$ (95% CL) and $m\\_{\\mathrm{FDM}} > 1.41 \\times 10^{-20}~\\mathrm{eV}$ (20:1 posterior ratio). For thermal-relic WDM, we find $m\\_{\\mathrm{WDM}} > 6.22~\\mathrm{keV}$ (95% CL) and $m\\_{\\mathrm{WDM}} > 5.75~\\mathrm{keV}$ (20:1 posterior ratio). These results represent a moderate improvement over MW-only constraints, and provide the strongest constraints to date on the FDM and WDM derived from satellite galaxy populations in the Local Group.\n\n"}, "supernova": {"2512.02680": "2025-12-02, **Peculiar SN Ic 2022esa: An explosion of a massive Wolf-Rayet star in a binary as a precursor to a BH-BH binary?**, Keiichi Maeda et.al., [2512.02680v1](http://arxiv.org/abs/2512.02680v1)\n\n A class of supernovae (SNe) termed `SN Ic-CSM' are characterized by late-time emergence of narrow emission lines of elements formed in the oxygen core of a massive star. A popular scenario is the interaction of the SN ejecta and O-rich circumstellar medium (CSM), i.e., Circumstellar Interaction (CSI). Uncovering the progenitor system of SNe Ic-CSM plays a critical role in understanding the final evolution of a massive star to a bare C+O star. In this Letter, we present observations of SN 2022esa which we show is an SN Ic-CSM. Surprisingly, a stable periodicity of ~32 days is found in its light-curve evolution with a hint of a slowly increasing period over ~200 days. We argue that the main power source is likely the interaction of the SN ejecta and O-rich CSM, while the energy input by the post-SN eccentric binary interaction within the SN ejecta is another possibility. In either case, we propose a massive Wolf-Rayet (WR) star as the progenitor, in a WR-WR or WR-BH (black hole) binary that will eventually evolve to a BH-BH binary. Specifically, in the CSI scenario, the progenitor system is an eccentric binary system with an orbital period of about a year, leading to the observed periodicity through the modulation in the CSM density structure. We also show that some other objects, superluminous SN I 2018ibb (a pair-instability SN candidate) and peculiar SN Ic 2022jli (the first example showing stable periodic modulation), show observational similarities to SNe Ic-CSM and may be categorized as SN Ic-CSM variants. Complemented with a large diversity in their light-curve evolution, we propose that SNe Ic-CSM (potentially linked to SNe Ibn/Icn) are a mixture of multiple channels that cover a range of properties in the progenitor star, the binary companion, and the binary orbit.\n\n", "2512.02391": "2025-12-02, **\"SNe Ia twins\" in the Hubble flow, and the determination of H0**, Pilar Ruiz-Lapuente et.al., [2512.02391v1](http://arxiv.org/abs/2512.02391v1)\n\n We have applied our approach of using ''SNe Ia twins''in the Hubble flow to obtain distances to SNe Ia at z $>$ 0.015 and derive H$\\_{0}$.   Our results, taking a single step between the low z domain and the Hubble flow, validate the three rung classical method.   We find, however, that the full compilation of distances, both in Pantheon+ and in the Carnegie-Chicago Hubble Program (CCHP),   contain some inaccurate values in the colors due to an underestimate of reddening by dust. This produces odd individual values for H$\\_{0}$   from single SNe Ia.   On the average, those erroneous estimates do not affect the mean value of H$\\_{0}$, which is characterized by the bulk of well--modeled SNe Ia.   Our sample of carefully addressed SNe Ia in the Hubble flow contains a dozen supernovae, for which the distances are determined with high accuracy.   Three of these SNe Ia are of the Broad Line subtype and can be compared with SN 1989B in M66, a host galaxy with a unique convergence of the   Cepheid distance determination and the Tip of the Red Giant Branch stars (TRGB) determination by the CCHP group. They point to a weighted average of   H$\\_{0}$ $=$ 73.556 $\\pm$ 2.084 (stat) km s$^{-1}$ Mpc $^{-1}$.   There is as well a very good agreement on the distances to NGC 7250 and NGC 5643 between those derived with Cepheids by SH0ES and those derived with   the use of J-Asymptotic Giant Branch stars (JAGB stars) by the CCHP, which makes them very good anchors.   The sample of 12 SNe Ia gives a value of H$\\_{0}$ $=$ 72.833 $\\pm$ 1.306(stat) $\\pm$ 1.151 (sys) km s$^{-1}$ Mpc$^{-1}$, when anchored in Cepheids,   and of H$\\_{0}$ $=$ 72.388 $\\pm$ 1.272 (stat) $\\pm$ 1.015 (sys) km s$^{-1}$ Mpc$^{-1}$, when anchored in JAGBs by the CCHP. We take a mean of the two   values of H$\\_{0}$ and obtain H$\\_{0}$ $=$ 72.610 $\\pm$ 1.289(stat) $\\pm$ 1.085 (sys) km s$^{-1}$ Mpc$^{-1}$.\n\n", "2512.02122": "2025-12-01, **Untangling the Sources of Abundance Dispersion in Low-metallicity Stars II: Neutron Capture Elements**, Emily J. Griffith et.al., [2512.02122v1](http://arxiv.org/abs/2512.02122v1)\n\n We present the abundances of 23 elements, including 11 heavy elements (Cu, Zn, Sr, Y, Zr, Ba, La, Ce, Nd, Sm, Eu) for up to 86 metal-poor (-2 < [Fe/H] < -1) subgiants. We use KORG, a state of the art spectral synthesis package, to derive 1D-LTE abundances from high-SNR and high-resolution spectra taken by the Large Binocular Telescope with the Potsdam Echelle Polarimetric and Spectroscopic Instrument. These precise spectra and abundance measurements minimize the impact of photon-noise (<0.06 dex), allowing us to robustly measure the intrinsic abundance scatter in [X/Fe]. After removing two stars with exceptional s-process enhancement, we find that the intrinsic scatter among the s- and r-process elements tends to be larger than for the lighter elements, with heavy element scatter ranging from 0.11 (Zn) to 0.27 (Eu) dex. Intrinsic abundance scatter could have multiple origins, including star-to-star variations in the ratios of nucleosynthetic sources as well as stochastic sampling of the progenitor supernovae properties, such as mass, rotation, and magnetic field strength. We explore the expected abundance scatter signature caused by stochastic sampling, finding that a fraction of both rapidly rotating CCSN and magnetorotationally driven SN are needed to reach the observed abundances and intrinsic scatter. This analysis is limited by the restrictive parameter spaces spanned by existing yield sets. A diverse, finely sampled grid of supernovae yields is needed to robustly model stochastic abundance scatter.\n\n", "2512.02109": "2025-12-01, **Cosmic chronometers with galaxy clusters: a new avenue for multi-probe cosmology**, E. Tomasetti et.al., [2512.02109v1](http://arxiv.org/abs/2512.02109v1)\n\n We provide a new measurement of the expansion history of the Universe at $z=0.54$ with the cosmic chronometers (CC) method, exploiting the high-quality spectroscopic VLT/MUSE data for three galaxy clusters in close-by redshift bins: SDSS J2222+2745 ($z=0.49$), MACS J1149.5+2223 ($z=0.54$), and SDSS J1029+2623 ($z=0.59$). The central one, MACS J1149.5+2223, hosts the well-known supernova 'Refsdal', which allowed for $H\\_0$ measurements via time delay cosmography (TDC). This represents the first step for a self-consistent probe combination, where different methods are applied to the same data sample. After selecting the most passive and massive cluster members (38 CCs), we derive their age and physical parameters via full spectrum fitting. We use the code Bagpipes, specifically modified to remove the cosmological prior on ages. On average, the CC sample shows super-solar metallicities $Z/Z\\_{\\odot} = 1.3 \\pm 0.7$, low dust extinction $A\\_{\\rm{V}} = 0.3 \\pm 0.3$ mag and to have formed in short bursts $τ= 0.6 \\pm 0.2$ Gyr. We also observe both an ageing trend in redshift and a mass-downsizing pattern. From the age-redshift trend, implementing the CC method through a bootstrap approach, we derive a new $H(z)$ measurement: $H$($z$=0.542) = $66\\_{-29}^{+81}$ (stat) $\\pm$13 (syst) km/s/Mpc. We also simulate the impact of increased statistics and extended redshift coverage, finding that $H$($z$) uncertainties can be reduced by up to a factor of 4 with $\\sim$100 CCs and a slightly broader redshift range (d$z\\sim$0.2).\n\n", "2512.02095": "2025-12-01, **The DREAMS Project: Disentangling the Impact of Halo-to-Halo Variance and Baryonic Feedback on Milky Way Satellite Galaxies**, Jonah C. Rose et.al., [2512.02095v1](http://arxiv.org/abs/2512.02095v1)\n\n We analyze the properties of satellite galaxies around 1,024 Milky Way-mass hosts from the DREAMS Project, simulated within a $Λ$CDM cosmology. Utilizing the TNG galaxy-formation model, the DREAMS simulations incorporate both baryonic physics and cosmological uncertainties for a large sample of galaxies with diverse environments and formation histories. We investigate the relative impact of the physical uncertainty from the galaxy-formation model on predicted satellite properties using four metrics: the satellite stellar mass function, radial distribution, inner slope of dark matter density profile, and stellar half-light radius. We compare these predictions to observations from the SAGA Survey and the DREAMS N-body simulations and find that uncertainties from baryonic physics modeling are subdominant to the scatter arising from halo-to-halo variance. Where baryonic modeling does affect satellites, the supernova wind energy has the largest effect on the satellite properties that we investigate. Specifically, increased supernova wind energy suppresses the stellar mass of satellites and results in more extended stellar half-light radii. The adopted wind speed has only a minor impact, and other astrophysical and cosmological parameters show no measurable effect. Our findings highlight the robustness of satellite properties against uncertainties in baryonic physics modeling.\n\n", "2512.01607": "2025-12-01, **Accurate cosmological emulator for the probability distribution function of gravitational lensing of point sources**, Tunç Türker et.al., [2512.01607v1](http://arxiv.org/abs/2512.01607v1)\n\n We develop an accurate and computationally efficient emulator to model the gravitational lensing magnification probability distribution function (PDF), enabling robust cosmological inference of point sources such as supernovae and gravitational-wave observations. We construct a pipeline utilizing cosmological $N$-body simulations, creating past light cones to compute convergence and shear maps. Principal Component Analysis (PCA) is employed for dimensionality reduction, followed by an eXtreme Gradient Boosting (XGBoost) machine learning model to interpolate magnification PDFs across a broad cosmological parameter space ($Ω\\_m$, $σ\\_8$, $w$, $h$) and redshift range ($0.2 \\le z \\le 6$). We identify the optimal number of PCA components to balance accuracy and stability. Our emulator, publicly released as ace\\_lensing, accurately reproduces lensing PDFs with a median Kullback-Leibler divergence of $0.007$. Validation on the test set confirmed that the model reliably reproduces the detailed shapes and statistical properties of the PDFs across the explored parameter range, showing no significant degradation for specific parameter combinations or redshifts. Future work will focus on incorporating baryonic physics through hydrodynamical simulations and expanding the training set to further enhance model accuracy and generalizability.\n\n", "2512.01552": "2025-12-01, **Type IIP SN 2024bch: Hydrodynamic model, shock breakout, and circumstellar interaction**, V. P. Utrobin et.al., [2512.01552v1](http://arxiv.org/abs/2512.01552v1)\n\n The well-observed type IIP SN 2024bch with the short plateau is shown to be an outcome of the red supergiant explosion with the presupernova mass of 14-15 Msun, the explosion energy of 2x10^{51} erg, and presupernova radius of 1250 Rsun. The early gamma-ray escape demonstrated by the radioactive tail is due to the large Ni-56 extension up to 7400 km/s. The early-time spectral evolution indicates the presence of the circumstellar dense confined envelope with the mass of 0.003-0.006 Msun within 6x10^{14} cm. The deceleration of the outermost ejecta implies the wind with the mass-loss rate of about 6x10^{-4} Msun/yr. The inferred mass-loss rate is by one-two order larger compared to most of type IIP supernovae, but comparable to the wind of type IIL SN 1998S. The asymmetry of the broad H-alpha component on day 144 powered by the circumstellar interaction is the outcome of the Thomson scattering and absorption in the Paschen continuum in the unshocked ejecta.\n\n", "2512.01221": "2025-12-01, **Multi-frequency radio-continuum study of the LMC SNR N206 (Goat's Eye) and its \"zig-zag\" PWN**, M. Ghavam et.al., [2512.01221v1](http://arxiv.org/abs/2512.01221v1)\n\n We present new radio-continuum observations of the Large Magellanic Cloud (LMC) supernova remnant (SNR) N206, which we give the name \"Goat's Eye\". Goat's Eye contains an interior radio structure that is likely a pulsar wind nebula (PWN), which we analyse in further detail. We use new radio observations from the Australia Telescope Compact Array (ATCA) telescope, as well as several archival radio observations, to calculate spectral indices, and find a steep spectral index for the whole SNR ($α= -0.60\\pm0.02$), and a flatter spectral index for the PWN ($α= -0.16\\pm0.03$). We also measure the polarisation and magnetic field properties of the PWN. Previously reported as a linear structure, the new observations show an unusual \"zig-zag\"-like structure, visible in radio-continuum total intensity, linear polarisation, and magnetic field orientations. The origin of this zig-zag structure is unclear, but we propose some origin scenarios that will require further observations to differentiate between.\n\n", "2512.01176": "2025-12-01, **Revisiting the Supernova Engines in the 3C 397 and W49B Supernova Remnants**, Cole Treyturik et.al., [2512.01176v1](http://arxiv.org/abs/2512.01176v1)\n\n The nature of the supernova remnants (SNRs) 3C 397 and W49B has long been a subject of debate, with prior studies offering conflicting interpretations between thermonuclear and core-collapse scenarios. To help settle this debate, we present a systematic, spatially resolved, spectroscopic analysis of both remnants using XMM-Newton. By applying multi-component thermal models, we derive key physical properties including elemental abundances, ejecta temperatures, ambient densities, and explosion energetics. We compare the inferred metal abundance ratios to a wide range of core-collapse and thermonuclear nucleosynthesis models, including new models whose explosion energies differ from the canonical value of $10^{51}$ ergs. We find that the observed Fe/Si and Ca/Si ratios in both SNRs are best matched by certain thermonuclear models. However, no model fully reproduces the complete set of observed abundance patterns. In 3C 397, high Fe enrichment and spatial abundance variations suggest interaction with a dense progenitor environment, and W49B's composition is overall consistent with a thermonuclear origin; however both require a low energy ($\\sim 10^{50}$ erg) supernova explosion. We additionally map the Fe K$α$ line centroid energies and find a spread, with W49B falling within the core-collapse region -- highlighting both environmental complexity and the limitations of this diagnostic for supernova classification. Our results highlight the need for caution in relying on any single diagnostic or nucleosynthesis model for supernova typing, underscore the need for improved nucleosynthesis models, and motivate future high-resolution, high-throughput observations.\n\n"}}