{"neutrino": {"2411.04877": "2024-11-07, **Aspects of Non-local QED and the Weak Gravity Conjecture**, Fayez Abu-Ajamieh et.al., [2411.04877v1](http://arxiv.org/abs/2411.04877v1)\n\n We use the Weak Gravity Conjecture (WGC) to investigate the impact of charge dequantization arising from non-local QED on the scale of non-locality of neutrinos. We find this scale to be <= 87 TeV, which could be probed in future colliders. We also investigate the electric force and potential in non-local QED and use them to reformulate the Weak Gravity Conjecture (WGC) in non-local QED.\n\n", "2411.04793": "2024-11-07, **Rubin ToO 2024: Envisioning the Vera C. Rubin Observatory LSST Target of Opportunity program**, Igor Andreoni et.al., [2411.04793v1](http://arxiv.org/abs/2411.04793v1)\n\n The Legacy Survey of Space and Time (LSST) at Vera C. Rubin Observatory is planned to begin in the Fall of 2025. The LSST survey cadence has been designed via a community-driven process regulated by the Survey Cadence Optimization Committee (SCOC), which recommended up to 3% of the observing time to carry out Target of Opportunity (ToO) observations. Experts from the scientific community, Rubin Observatory personnel, and members of the SCOC were brought together to deliver a recommendation for the implementation of the ToO program during a workshop held in March 2024. Four main science cases were identified: gravitational wave multi-messenger astronomy, high energy neutrinos, Galactic supernovae, and small potentially hazardous asteroids possible impactors. Additional science cases were identified and briefly addressed in the documents, including lensed or poorly localized gamma-ray bursts and twilight discoveries. Trigger prioritization, automated response, and detailed strategies were discussed for each science case. This document represents the outcome of the Rubin ToO 2024 workshop, with additional contributions from members of the Rubin Science Collaborations. The implementation of the selection criteria and strategies presented in this document has been endorsed in the SCOC Phase 3 Recommendations document (PSTN-056). Although the ToO program is still to be finalized, this document serves as a baseline plan for ToO observations with the Rubin Observatory.\n\n", "2411.04338": "2024-11-07, **Comment on \"Neutrino interaction with matter in a noninertial frame\"**, R. R. S. Oliveira et.al., [2411.04338v1](http://arxiv.org/abs/2411.04338v1)\n\n In this comment, we obtain the complete energy levels for Dvornikov's paper, that is, the energy levels dependent on two quantum numbers, namely, the radial quantum number (given by $N$) and the angular quantum number (given by $J\\_z$). In particular, what motivated us to do this was the fact that the quantized energy levels for particles (fermions or bosons) in polar, cylindrical, or spherical coordinates depend on two quantum numbers: a radial quantum number and an angular quantum number. From this, the following question/doubt arose: Why do the energy levels in Dvornikov's paper only depend on one quantum number? That is, Where did the angular quantum number given by $J\\_z$ go? So, using Studenikin's paper as a starting point (as well as others in the literature), we write one of the equations from Dvornikov's paper in a matrix form. Next, we use the four-component Dirac spinor and obtain a set/system of four coupled first-order differential equations. From the first two equations with $m\\simeq 0$, we obtain a (compact) second-order differential equation for two spinor components. So, solving this equation, we obtain the neutrino energy levels, which explicitly depend on both $N$ and $J\\_z$. Finally, we note that for $J\\_z>0$ (positive angular momentum) with $u=+1$ (component $\\psi\\_3$), we obtain exactly the particular energy levels of Dvornikov's paper.\n\n"}, "dark matter": {"2411.04901": "2024-11-07, **Dark energy reconstructions combining BAO data with galaxy clusters and intermediate redshift catalogs**, Orlando Luongo et.al., [2411.04901v1](http://arxiv.org/abs/2411.04901v1)\n\n Cosmological parameters and dark energy (DE) behavior are generally constrained assuming \\textit{a priori} models. We work out a model-independent reconstruction to bound the key cosmological quantities and the DE evolution. Through the model-independent \\textit{B\\'ezier interpolation} method, we reconstruct the Hubble rate from the observational Hubble data and derive analytic expressions for the distances of galaxy clusters, type Ia supernovae, and uncorrelated baryonic acoustic oscillation (BAO) data. In view of the discrepancy between Sloan Digital Sky Survey (SDSS) and Dark Energy Spectroscopic Instrument (DESI) BAO data, they are kept separate in two distinct analyses. Correlated BAO data are employed to break the baryonic--dark matter degeneracy. All these interpolations enable us to single out and reconstruct the DE behavior with the redshift $z$ in a totally model-independent way. In both analyses, with SDSS-BAO or DESI-BAO data sets, the constraints agree at $1$--$\\sigma$ confidence level (CL) with the flat $\\Lambda$CDM model. The Hubble constant tension appears solved in favor of the Planck satellite value. The reconstructed DE behavior exhibits deviations at small $z$ ($>1$--$\\sigma$ CL), but agrees ($<1$--$\\sigma$ CL) with the cosmological constant paradigm at larger $z$. Our method hints for a slowly evolving DE, consistent with a cosmological constant at early times.\n\n", "2411.04815": "2024-11-07, **Nailing down the theoretical uncertainties of $\\overline{\\rm D}$ spectrum produced from dark matter**, Mattia Di Mauro et.al., [2411.04815v1](http://arxiv.org/abs/2411.04815v1)\n\n The detection of cosmic antideuterons ($\\overline{\\rm D}$) at kinetic energies below a few GeV/n could provide a smoking gun signature for dark matter (DM). However, the theoretical uncertainties of coalescence models have represented so far one of the main limiting factors for precise predictions of the $\\overline{\\rm D}$ flux. In this Letter we present a novel calculation of the $\\overline{\\rm D}$ source spectra, based on the Wigner formalism, for which we implement the Argonne $v\\_{18}$ antideuteron wavefunction that does not have any free parameters related to the coalescence process. We show that the Argonne Wigner model excellently reproduces the $\\overline{\\rm D}$ multiplicity measured by ALEPH at the $Z$-boson pole, which is usually adopted to tune the coalescence models based on different approaches. Our analysis is based on Pythia~8 Monte Carlo event generator and the state-of-the-art Vincia shower algorithm. We succeed, with our model, to reduce the current theoretical uncertainty on the prediction of the $\\overline{\\rm D}$ source spectra to a few percent, for $\\overline{\\rm D}$ kinetic energies relevant to DM searches with GAPS and AMS, and for DM masses above a few tens of GeV. This result implies that the theoretical uncertainties due to the coalescence process are no longer the main limiting factor in the predictions. We provide the tabulated source spectra for all the relevant DM annihilation/decay channels and DM masses between 5 GeV and 100 TeV, on the CosmiXs github repository (https://github.com/ajueid/CosmiXs.git).\n\n", "2411.04435": "2024-11-07, **Extending the Dark Matter Reach of Water Cherenkov Detectors using Jupiter**, Sandra Robles et.al., [2411.04435v1](http://arxiv.org/abs/2411.04435v1)\n\n We propose the first method for water Cherenkov detectors to constrain GeV-scale dark matter (DM) below the solar evaporation mass. While previous efforts have highlighted the Sun and Earth as DM capture targets, we demonstrate that Jupiter is a viable target. Jupiter's unique characteristics, such as its lower core temperature and significant gravitational potential, allow it to capture and retain light DM more effectively than the Sun, particularly in the mass range below 4 GeV where direct detection sensitivity diminishes. Our calculations provide the first bounds on GeV-scale annihilating DM within Jupiter, showing that these bounds surpass current solar limits and direct detection results.\n\n"}, "supernova": {"2411.04968": "2024-11-07, **No rungs attached: A distance-ladder free determination of the Hubble constant through type II supernova spectral modelling**, Christian Vogl et.al., [2411.04968v1](http://arxiv.org/abs/2411.04968v1)\n\n The ongoing discrepancy in the Hubble constant ($H\\_0$) estimates obtained through local distance ladder methods and early universe observations poses a significant challenge to the $\\Lambda$CDM model, suggesting potential new physics. Type II supernovae (SNe II) offer a promising technique for determining $H\\_0$ in the local universe independently of the traditional distance ladder approach, opening up a complimentary path for testing this discrepancy. We aim to provide the first $H\\_0$ estimate using the tailored expanding photosphere method (EPM) applied to SNe II, made possible by recent advancements in spectral modelling that enhance its precision and efficiency. Our tailored EPM measurement utilizes a spectral emulator to interpolate between radiative transfer models calculated with TARDIS, allowing us to fit supernova spectra efficiently and derive self-consistent values for luminosity-related parameters. We apply the method on public data for ten SNe II at redshifts between 0.01 and 0.04. Our analysis demonstrates that the tailored EPM allows for $H\\_0$ measurements with precision comparable to the most competitive established techniques, even when applied to literature data not designed for cosmological applications. We find an independent $H\\_0$ value of $74.9\\pm1.9$ (stat) km/s/Mpc, which is consistent with most current local measurements. Considering dominant sources of systematic effects, we conclude that our systematic uncertainty is comparable to or less than the current statistical uncertainty. This proof-of-principle study highlights the potential of the tailored EPM as a robust and precise tool for investigating the Hubble tension independently of the local distance ladder. Observations of SNe II tailored to $H\\_0$ estimation can make this an even more powerful tool by improving the precision and by allowing us to better understand and control systematic uncertainties.\n\n", "2411.04901": "2024-11-07, **Dark energy reconstructions combining BAO data with galaxy clusters and intermediate redshift catalogs**, Orlando Luongo et.al., [2411.04901v1](http://arxiv.org/abs/2411.04901v1)\n\n Cosmological parameters and dark energy (DE) behavior are generally constrained assuming \\textit{a priori} models. We work out a model-independent reconstruction to bound the key cosmological quantities and the DE evolution. Through the model-independent \\textit{B\\'ezier interpolation} method, we reconstruct the Hubble rate from the observational Hubble data and derive analytic expressions for the distances of galaxy clusters, type Ia supernovae, and uncorrelated baryonic acoustic oscillation (BAO) data. In view of the discrepancy between Sloan Digital Sky Survey (SDSS) and Dark Energy Spectroscopic Instrument (DESI) BAO data, they are kept separate in two distinct analyses. Correlated BAO data are employed to break the baryonic--dark matter degeneracy. All these interpolations enable us to single out and reconstruct the DE behavior with the redshift $z$ in a totally model-independent way. In both analyses, with SDSS-BAO or DESI-BAO data sets, the constraints agree at $1$--$\\sigma$ confidence level (CL) with the flat $\\Lambda$CDM model. The Hubble constant tension appears solved in favor of the Planck satellite value. The reconstructed DE behavior exhibits deviations at small $z$ ($>1$--$\\sigma$ CL), but agrees ($<1$--$\\sigma$ CL) with the cosmological constant paradigm at larger $z$. Our method hints for a slowly evolving DE, consistent with a cosmological constant at early times.\n\n", "2411.04757": "2024-11-07, **Quintessence phase of the late-time Universe in $f(Q,T)$ gravity**, Shambel Sahlu et.al., [2411.04757v1](http://arxiv.org/abs/2411.04757v1)\n\n In this paper, we have studied the late-time accelerating expansion of the Universe using the matter-geometry coupled $ f(Q, T) $ gravity model, where $ Q $ is the non-metricity scalar and $ T $ represents the trace of the energy-momentum tensor. We constrain the best-fit values of cosmological parameters $\\Omega\\_{m0}, H\\_0, \\alpha\\_0~\\mbox{and}~ \\beta\\_0$ through the Monte Carlo Markov Chain (MCMC) simulation {using 31 Hubble parameter data points from cosmic chronometers (CC) and 26 data points from baryon acoustic oscillations (BAO), making a total of 57 datasets (labeled \\texttt{CC+BAO}), as well as SNIa distance moduli measurements from the Pantheon+ sample, which consists of 1701 light curves of 1550 distinct supernovae (labeled \\texttt{Pantheon +SHOES}), and their combination (labeled \\texttt{CC+BAO+Pantheon +SHOES)}}. {We compare our constrained Hubble constant $H\\_0$ value with different late-time and early-time cosmological measurements.} Deceleration {parameter} \\(q(z)\\), effective equation of state parameters \\(w\\_{eff}(z)\\), Hubble parameter $H(z)$, and distance modulus \\(\\mu(z)\\) are numerical results of dynamical quantities that show that the $f(Q, T)$ gravity model is compatible with a transition towards a quintessence-like phase in the late-time. In conformity with \\(\\Lambda\\)CDM, we moreover take into account the geometrical interpretations by considering the state-finder parameters \\(r-s\\) and \\(r-q\\), which are crucial parameters for additional analysis. Additionally, the statistical analysis has been carried out for further investigation.\n\n", "2411.04654": "2024-11-07, **Identifying a point-symmetrical morphology in the core-collapse supernova remnant W44**, Noam Soker et.al., [2411.04654v1](http://arxiv.org/abs/2411.04654v1)\n\n I identify a point-symmetrical morphology in the core-collapse supernova remnant (CCSNR) W44 compatible with shaping by three or more pairs of jets in the jittering jet explosion mechanism (JJEM). Motivated by recent identifications of point-symmetrical morphologies in CCSNRs and their match to the JJEM, I revisit the morphological classification of CCSNR W44. I examine a radio map of W44 and find the outer bright rim of the radio map to possess a point-symmetric structure compatible with shaping by two energetic pairs of opposite jets rather than an S-shaped morphology shaped by a precessing pair of jets. An inner pair of filaments might hint at a third powerful pair of jets. More pairs of jets were involved in the explosion process. This study adds to the growing evidence that the JJEM is the primary explosion mechanism of core-collapse supernovae.\n\n"}}