{"neutrino": {"2303.12792": "2023-03-22, **Resonant neutrino self-interactions and the $H_0$ tension**, Jorge Venzor et.al., [2303.12792v1](http://arxiv.org/abs/2303.12792v1)\n\n In this work, we study the previously unexplored resonant region of neutrino self-interactions. Current disagreement on late and early time observations of the Universe expansion could be solved with new physics acting before the recombination era. Nonstandard neutrino self-interactions are among the most appealing candidates to solve this issue since they could be testable in the near (or middle) future. We use linear cosmological datasets to test neutrino self-interactions for a sample of fixed scalar mediator masses in the range $10^{-2}$ eV $\\leq m\\_{\\varphi}\\leq 10^{2}$ eV. The resonant behavior produces observable effects at lower couplings than those reported in the literature for heavy and light mediators. We observe that in the best case scenario, using the Planck + BAO dataset, the tension with local measurements of $H\\_0$ eases from 4.9$\\sigma$ (for $\\Lambda$CDM) down to 2.8$\\sigma$. The joint data set which includes Planck, BAO, and $H\\_0$ prefers a non-zero interaction with at least 2.3$\\sigma$ significance in the range $0.5$ eV $\\leq m\\_{\\varphi}\\leq 10$ eV. These results add the last piece in the parameter space of neutrino self-interactions at the linear perturbation regime.\n\n", "2303.12673": "2023-03-22, **All-sky limits on Sterile Neutrino Galactic Dark Matter obtained with SRG/ART-XC after two years of operations**, E. I. Zakharov et.al., [2303.12673v1](http://arxiv.org/abs/2303.12673v1)\n\n Dark matter sterile neutrinos radiatively decay in the Milky Way, which can be tested with searches for almost monochromatic photons in the X-ray cosmic spectrum. We analyse the data of ART-XC telescope operated for two years in the all-sky survey mode. With no significant hints in the Galactic diffuse X-ray spectrum we explore models with sterile neutrino masses in 12-40 keV range and exclude corresponding regions of sterile-active neutrino mixing.\n\n", "2303.12458": "2023-03-22, **Nucleosynthesis in jet-driven and jet-associated supernovae**, M. Obergaulinger et.al., [2303.12458v1](http://arxiv.org/abs/2303.12458v1)\n\n In contrast to regular core-collapse supernovae, explosions of rapidly rotating massive stars can develop jets, fast collimated outflows directed along the rotational axis. Depending on the rate of rotation and the magnetic field strength before collapse as well as on possible mechanisms amplifying the magnetic field, such a core can explode magnetorotationally rather than via the standard supernova mechanism based on neutrino heating. This scenario can explain the highest kinetic energies observed in the class of hypernovae. On longer time scales, rotation and magnetic fields can play an important role in the engine of long gamma-ray burst powered by proto-magnetars or hyperaccreting black holes in collapsars. Both classes of events are characterized by relativistic jets and winds driven by neutrinos or magnetic spin-down of the central objects. The nucleosynthesis in these events includes the production of Fe group elements, including a possibly enhanced synthesis of radioactive 56Ni leading to high peak luminosities. Additionally, these events are, out of all stellar core-collapse events the ones most likely to allow for the formation of the heaviest nuclei via rapid neutron captures. Increasingly sophisticated numerical simulations indicate that at least a limited r-process is possible, though it remains open how robust this result is against variations in the numerical methods and the initial conditions. If so, supernovae with jets could contribute to the observed galactic chemical enrichment, in particular at early times before neutron-star mergers might be able to set in.\n\n", "2303.12284": "2023-03-22, **Jets from neutron-star merger remnants and massive blue kilonovae**, Luciano Combi et.al., [2303.12284v1](http://arxiv.org/abs/2303.12284v1)\n\n We perform high-resolution three-dimensional general-relativistic magnetohydrodynamic simulations with neutrino transport of binary neutron star (BNS) mergers resulting in a long-lived remnant neutron star, with properties typical of galactic BNS and consistent with those inferred for the first observed BNS merger GW170817. We demonstrate self-consistently that within $\\lesssim\\!30$ ms post-merger magnetized ($\\sigma\\sim 5-10$) twin polar jets emerge with asymptotic Lorentz factor $\\Gamma\\sim 5-10$, which successfully break out from the merger debris within $\\lesssim\\!20$ ms. A fast ($v\\lesssim 0.6c$), magnetized ($\\sigma\\sim 0.1$) wind surrounds the jet core and generates a UV/blue kilonova precursor on timescales of hours, similar to the precursor signal due to free neutron decay in fast dynamical ejecta. Post-merger ejecta are quickly dominated by MHD-driven outflows from an accretion disk. We demonstrate that within only 50 ms post-merger, $\\gtrsim 2\\times 10^{-2}M\\_\\odot$ of lanthanide-free, quasi-spherical ejecta with velocity $\\sim\\!0.1c$ is launched, yielding a kilonova signal consistent with GW170817 on timescales of $\\lesssim\\!5$\\,d.\n\n", "2303.12232": "2023-03-21, **Beyond the Inert Doublet: imprints of Scotogenic Yukawa interactions at FCC-ee**, Carlo Marzo et.al., [2303.12232v1](http://arxiv.org/abs/2303.12232v1)\n\n It is tempting to interpret the minuscule scale of neutrino masses as a symptom of its radiative origin. In light of the notable leap in precision expected at the Future Circular Collider, we explore areas of the parameter space that can simultaneously support the detectable Higgs-strahlung signal with parallel ones from forthcoming measurements in low-energy observables. We pinpoint the role that the extra fermions have in shaping a signal distinct from the pure Inert Doublet one. The details of the full one-loop computation and on-shell renormalization are presented. Both normal and inverted hierarchies for the radiatively generated neutrino masses and angles are investigated.\n\n", "2303.12143": "2023-03-21, **Flavor solitons in dense neutrino gases**, Damiano F. G. Fiorillo et.al., [2303.12143v1](http://arxiv.org/abs/2303.12143v1)\n\n We consider a dense neutrino gas in the \"fast-flavor limit\" (vanishing neutrino masses). For the first time, we identify exact solutions of the nonlinear wave equation in the form of solitons. They can propagate with both sub- or superluminal speed, the latter not violating causality. The soliton with infinite speed is a homogeneous solution and coincides with the usual fast-flavor pendulum except that it swings only once instead of being periodic. The subluminal soliton in the static limit corresponds to a one-swing \"spatial pendulum\". A necessary condition for such solutions to exist is a ``crossed'' neutrino angle distribution. Based on the Nyquist criterion, we derive a new sufficient condition without solving the dispersion relation. The solitons are very fragile: they are as unstable as the homogeneous neutrino gas alone. Moreover, in the presence of matter, only the solution survives that is homogeneous in a frame comoving with the matter current. Generally, the matter effect cannot be eliminated by transformations in flavor space, but instead has a real physical impact.\n\n", "2303.12055": "2023-03-21, **Cyclotron Radiation Emission Spectroscopy of Electrons from Tritium Beta Decay and $^{83\\rm m}$Kr Internal Conversion**, Project 8 Collaboration et.al., [2303.12055v1](http://arxiv.org/abs/2303.12055v1)\n\n Project 8 has developed a novel technique, Cyclotron Radiation Emission Spectroscopy (CRES), for direct neutrino mass measurements. A CRES-based experiment on the beta spectrum of tritium has been carried out in a small-volume apparatus. We provide a detailed account of the experiment, focusing on systematic effects and analysis techniques. In a Bayesian (frequentist) analysis, we measure the tritium endpoint as $18553^{+18}\\_{-19}$ ($18548^{+19}\\_{-19}$) eV and set upper limits of 155 (152) eV (90% C.L.) on the neutrino mass. No background events are observed beyond the endpoint in 82 days of running. We also demonstrate an energy resolution of $1.66\\pm0.19$ eV in a resolution-optimized magnetic trap configuration by measuring $^{83\\rm m}$Kr 17.8-keV internal-conversion electrons. These measurements establish CRES as a low-background, high-resolution technique with the potential to advance neutrino mass sensitivity.\n\n", "2303.11820": "2023-03-21, **Asymmetric dark matter with a spontaneously broken $U(1)'$: self-interaction and gravitational waves**, Zien Chen et.al., [2303.11820v1](http://arxiv.org/abs/2303.11820v1)\n\n Motivated by the collisionless cold dark matter small scale structure problem, we propose an asymmetric dark matter model where dark matter particle interact with each other via a massive dark gauge boson. This model easily avoid the strong limits from cosmic microwave background (CMB) observation, and have a large parameter space to be consistent with small scale structure data. We focus on a special scenario where portals between dark sector and visible sector are too weak to be detected by traditional methods. We find that this scenario can increase the effective number of neutrinos ($N\\_{\\text{eff}}$).In addition, the spontaneous $U(1)'$ symmetry breaking process, which makes dark gauge boson massive, can generate stochastic gravitational waves with peak frequency around $10^{-6} - 10^{-7} \\text{ Hz}$.\n\n"}, "dark matter": {"2303.12530": "2023-03-22, **Inhomogeneous Galactic Chemical Evolution: Modelling Ultra-Faint Dwarf Galaxies of the Large Magellanic Cloud**, Ryan K. Alexander et.al., [2303.12530v1](http://arxiv.org/abs/2303.12530v1)\n\n Ultra-faint dwarf galaxies are among the oldest and most metal-poor galaxies in the cosmos, observed to contain no traces of gas at the present time and a high dark matter mass fraction. Understanding the chemical abundance dispersion in such extreme environments could shed light on the properties of the first generations of stars in the cosmos. We present a novel inhomogeneous chemical evolution model, i-GEtool, that we apply to two ultra-faint dwarf galaxies, Carina II (Car II) and Reticulum II (Ret II), which are satellites of the Large Magellanic Cloud. In summary, our model is based on the Monte Carlo sampling of the initial mass function as star formation proceeds in different gas cells of the simulated galaxy volume. We account for the chemical enrichment of Supernova bubbles as they spread in the interstellar medium, which causes dispersion in the predicted elemental abundances. We recreate the elemental abundance patterns by focusing on $\\alpha$- and odd-$\\textit{Z}$ elements, predicting two sequences in [C/Fe] and [N/Fe] at all metallicities. Our models systematically underestimate [C/Fe] and [Ti/Fe] because of the large uncertainty in the adopted stellar nucleosynthesis yields. We discuss that the observed C and N abundances had likely been affected by internal mixing processes, which changed the initial surface abundances in the red giants. Our Supernova feedback scheme is responsible for driving galactic outflows, which quench the star formation activity in the simulated galaxies at early times. The average outflow mass-loading factor as predicted by our models is $\\approx 10^{3}$, which extrapolates towards very low galaxy stellar masses the trend observed at high stellar masses. Finally, by combining our model with the MIST isochrone database, we draw synthetic colour-magnitude diagrams of Car II and Ret II and compare them to observations.\n\n", "2303.12155": "2023-03-21, **WIMP cross-section limits from LOFAR observations of dwarf spheroidal galaxies**, L. Gajović et.al., [2303.12155v1](http://arxiv.org/abs/2303.12155v1)\n\n Weakly interacting massive particles (WIMPs) can self-annihilate and thus provide us with the possibility for an indirect detection of Dark Matter (DM). Dwarf spheroidal (dSph) galaxies are excellent places to search for annihilation signals because they are rich in DM and background emission is low. If magnetic fields in dSph exist, the particles produced in DM annihilation emit synchrotron radiation. We use the non-detection of 150 MHz radio continuum emission from dSph galaxies with the LOw Frequency ARray (LOFAR) to derive constraints on the annihilation cross-section of WIMPs into electron-positron pairs. Our main underlying assumption is that the transport of the CRs can be described by the diffusion approximation which necessitates the existence of magnetic fields. We use observations of six dSph galaxies in the LOFAR Two-metre Sky Survey (LoTSS). The data are re-imaged and a radial profile is generated for each galaxy. We also use stacking to increase the sensitivity. In order to derive upper limits on the WIMP cross-section, we inject fake Gaussian sources into the data which are then detected with 2$\\sigma$ significance in the radial profile. These sources represent the lowest emission we would have been able to detect.   We present limits from the observations of individual galaxies as well as from stacking. We explore the uncertainty due to the choice of diffusion and magnetic field parameters by constructing three different model scenarios: optimistic (OPT), intermediate (INT), and pessimistic (PES). Assuming monochromatic annihilation into electron-positron pairs, the limits from the INT scenario exclude thermal WIMPs below 20 GeV and the limits from the OPT scenario even exclude WIMPs below 70 GeV. The INT limits can compete with limits set by Fermi-LAT using $\\gamma$-ray observations of multiple dwarf galaxies and they are especially strong for low WIMP masses.\n\n", "2303.12129": "2023-03-21, **Dark Exoplanets**, Yang Bai et.al., [2303.12129v1](http://arxiv.org/abs/2303.12129v1)\n\n The prevailing assumption is that all exoplanets are made of ordinary matter. However, we propose an unconventional possibility that some exoplanets could be made of dark matter, which we name \"dark exoplanets.\" In this paper, we explore methods to search for dark exoplanets, including the mass-radius relation, spectroscopy, missing transit, and transit light curve. Specifically, we focus on the transit light curve method and demonstrate how to distinguish partially transparent dark exoplanets from fully opaque ordinary exoplanets using both observed exoplanet data and dark exoplanet mock data. Our analysis shows that dark exoplanets with a large radius (above around 10% of the star radius) and a small optical depth (below around one) can be identified with current telescope sensitivities.\n\n", "2303.12107": "2023-03-21, **Dark Matter spikes around Sgr A* in $γ$-rays**, Shyam Balaji et.al., [2303.12107v1](http://arxiv.org/abs/2303.12107v1)\n\n We use H.E.S.S. $\\gamma$-ray observations of Sgr A* to derive novel limits on the Dark Matter (DM) annihilation cross-section. We quantify their dependence on uncertainties i) in the DM halo profile, which we vary from peaked to cored, and ii) in the shape of the DM spike around Sgr A*, dynamically heated by the nuclear star cluster. For peaked halo profiles and depending on the heating of the spike, our limits are the strongest existing ones for DM masses above a few TeV. Our study contributes to assessing the influence of the advancements in our knowledge of the Milky Way on determining the properties of DM particles.\n\n", "2303.11861": "2023-03-21, **Dark Matter Minihalos from Primordial Magnetic Fields**, Pranjal Ralegankar et.al., [2303.11861v1](http://arxiv.org/abs/2303.11861v1)\n\n Primordial magnetic fields (PMF) can enhance baryon perturbations on scales below the photon mean free path. However, a magnetically driven baryon fluid becomes turbulent near recombination, thereby damping out baryon perturbations below the turbulence scale. In this letter, we show that the growth of baryon perturbations is imprinted in the dark matter perturbations, which are unaffected by turbulence and eventually collapse to form $10^{-11}-10^3\\ M\\_{\\odot}$ dark matter minihalos. In the process, we analytically derive the evolution of the PMF power spectrum in the viscous drag regime. If the magnetic fields purportedly detected in the blazar observations are PMFs generated after inflation and have a Batchelor spectrum, then such PMFs should also produce minihalos.\n\n", "2303.11824": "2023-03-21, **On the simulation of gravitational lensing**, Hans Georg Schaatun et.al., [2303.11824v1](http://arxiv.org/abs/2303.11824v1)\n\n Gravitational lensing refers to the deflection of light by the gravity of celestial bodies, often predominantly composed of dark matter. Seen through a gravitational lens, the images of distant galaxies appear distorted. In this paper we discuss simulation of the image distortion by gravitational lensing. The objective is to enhance our understanding of how gravitational lensing works through a simple tool to visualise hypotheses. The simulator can also generate synthetic data for the purpose of machine learning, which will hopefully allow us to invert the distortion function, something which is not analytically possible at present.\n\n", "2303.11792": "2023-03-21, **Searching for Time-Dependent Axion Dark Matter Signals in Pulsars**, R. A. Battye et.al., [2303.11792v1](http://arxiv.org/abs/2303.11792v1)\n\n Axion dark matter can be converted into photons in the magnetospheres of neutron stars leading to a spectral line centred on the Compton wavelength of the axion. Due to the rotation of the star and the plasma effects in the magnetosphere the signal is predicted to be periodic with significant time variation - a unique smoking gun for axion dark matter. As a proof of principle and to develop the methodology, we carry out the first time domain search of the signal using data from PSR J2144$-$3933 taken as part of the MeerTIME project on MeerKAT telescope. We search for specific signal templates using a matched filter technique and discuss when a time-domain analysis (as is typically the case in pulsar observations) gives greater sensitivity to the axion-coupling to photons in comparison to a simple time-averaged total flux study. We do not find any candidate signals and, hence, impose an upper limit on the axion-to-photon coupling of $g\\_{a\\gamma\\gamma}<4\\times 10^{-11}\\,{\\rm GeV}^{-1}$ over the mass range $m\\_{\\rm a}=3.9-4.7\\,\\mu{\\rm eV}$ using this data. This limit relies on PSR J2144$-$3933 not being an extremely aligned rotator, as strongly supported by simple arguments based on the observed pulse profile width. We discuss the possibilities of improving this limit using future observations with MeerKAT and also SKA1-mid and the possibility of using other objects. Finally, to evade modelling uncertainties in axion radio signals, we also carry out a generic ``any periodic-signal search\" in the data, finding no evidence for an axion signal.\n\n", "2303.11677": "2023-03-21, **Exact solution of Kerr-like traversable wormhole in dark matter halo**, Zhaoyi Xu et.al., [2303.11677v1](http://arxiv.org/abs/2303.11677v1)\n\n Dark matter halos are common in galaxies and globular clusters, making it possible to use dark matter density profiles to construct transverse wormholes. In reference [1], an approximate solution of the traversable wormhole satisfying the isotropic pressure condition is constructed by using the dark matter density profile. However, approximate solutions limit the discussion of traversable wormholes to a large extent. In this work, we construct the exact solution of the traversable wormhole in the case of rotation in the dark matter halo. We have written analytical expressions for the Kerr-like traversable wormhole metric for the dark matter density profile in galaxies corresponding to different dark matter models, respectively. These rotating traversable wormholes are jointly determined by the dark matter characteristic density and the scale radius. At the same time, we have also analyzed the energy conditions satisfied by these rotationally traversable wormholes.\n\n", "2303.11645": "2023-03-21, **On the possibility of mixed axion/neutralino dark matter in specific SUSY DFSZ axion models**, Zhong-Jun Yang et.al., [2303.11645v1](http://arxiv.org/abs/2303.11645v1)\n\n We introduce four supersymmetric (SUSY) axion models in which the strong CP problem and the $\\mu$ problem are solved with the help of the Peccei-Quinn mechanism and the Kim-Nilles mechanism, respectively. The axion physics enriches the SUSY model by introducing axion as a dark matter candidate and, therefore, the lightest supersymmetric particle (LSP) could just be a part of the total dark matter. For this reason, axion relieves the tensions between SUSY models and numerous experimental measurements, such as the dark matter direct detection experiments and the precise measurements of anomalous magnetic moment of the muon $a\\_\\mu$. In the present paper, we consider the constraints from the latest $a\\_\\mu$ data and the XENON-1T bound on the relic density of higgsino-like LSP, and discuss the possibility that axion is the rest of dark matter. We study the production mechanism for axion, and it turns out that the conventional misalignment mechanism can give the correct dark matter relic density observed by the Planck satellite.\n\n"}, "supernova": {"2303.12686": "2023-03-22, **SRG/eROSITA and XMM-Newton observations of Vela Jr**, Francesco Camilloni et.al., [2303.12686v1](http://arxiv.org/abs/2303.12686v1)\n\n The Vela supernova remnant complex is a region containing at least three supernova remnants: Vela, Puppis A, and Vela Jr. With the launch of the spectro-imaging X-ray telescope eROSITA on board the Spectrum Roentgen Gamma (SRG) mission, it became possible to observe the one degree wide Vela Jr in its entirety. Although several previous pointed Chandra and XMM-Newton observations are available, it is only the second time after the ROSAT all-sky survey that the whole remnant was observed in X-rays with homogeneous sensitivity. Vela Jr is one of the few remnants emitting in the TeV band, making it an important object in shock acceleration studies. However, the age and distance determination using X-ray emission is largely hampered by the presence of the Vela SNR along the same line. With the eROSITA data set our aim is to characterize the emission of Vela Jr and distinguish it from Vela emission, and also to characterize the spectral emission of the inner remnant. We processed the eROSITA data dividing the whole remnant into seven different regions. In addition, images of the whole remnant were employed to pinpoint the position of the geometric center and constrain the proper motion of the CCO. We also employed archival XMM-Newton pointed observations of the NW rim to determine the cutoff energy of the electrons and the expansion velocity. We find the magnetic field can vary between 2 $\\mu$G and 16 $\\mu$G in the NW rim. We also find that the remnant spectrum is uniformly featureless in most regions, except for two inner regions where an extra thermal model component improves the fit. We obtain new coordinates for the geometric remnant center, resulting in a separation of only 35.2 $\\pm$ 15.8\" from the position of the CCO. As a result, we reinforce the association between the CCO and a proposed faint optical/IR counterpart.\n\n", "2303.12674": "2023-03-22, **Constraining f(Q) Cosmology with Standard Sirens**, José Ferreira et.al., [2303.12674v1](http://arxiv.org/abs/2303.12674v1)\n\n In this dissertation, we study two cosmological models based on $f(Q)$ gravity. We resort to mock catalogs of standard siren (SS) events to see whether data from future gravitational wave (GWs) observatories will be able to distinguish these models from $\\Lambda$CDM.   The first model is the most general $f(Q)$ formulation that replicates a $\\Lambda$CDM background, with deviations appearing only at the perturbative level. It has one additional free parameter compared to $\\Lambda$CDM, $\\alpha$, which when set to zero falls back to $\\Lambda$CDM. We show that LIGO-Virgo is unable to constrain $\\alpha$, due to the high error and low redshift of the measurements, whereas LISA and the ET will, with the ET outperforming LISA. The catalogs for both LISA and LIGO-Virgo show non-negligible statistical fluctuations, where we consider three representative catalogs (the best, median and worst), whereas for the ET, only a single catalog is considered, as the number of events is large enough for statistical fluctuations to be neglected. The best LISA catalog is the one with more low redshift events, while the worst LISA catalog features fewer low redshift events. Additionally, if we are to observe a bad LISA catalog, we can rely on data from LIGO-Virgo to improve the quality of the constrains, bringing it closer to a median LISA catalog.   The second model attempts to replace dark energy by making use of a specific form of the function $f(Q)$. We study this model resorting to dynamical system techniques to show the regions in parameter space with viable cosmologies. Using model selection criteria, we show that no number of SS events is, by itself, able to tell this model and $\\Lambda$CDM apart. We then show that if we add current type Ia Supernova (SnIa) data, tensions in this model arise when compared to the constrains set by the SS events.\n\n", "2303.12616": "2023-03-22, **The orbital and physical properties of five southern Be+sdO binary systems**, Luqian Wang et.al., [2303.12616v1](http://arxiv.org/abs/2303.12616v1)\n\n Close binary interactions may play a critical role in the formation of the rapidly rotating Be stars. Mass transfer can result in a mass gainer star spun up by the accretion of mass and angular momentum, while the mass donor is stripped of its envelope to form a hot and faint helium star. FUV spectroscopy has led to the detection of about 20 such binary Be+sdO systems. Here we report on a three-year program of high quality spectroscopy designed to determine the orbital periods and physical properties of five Be binary systems. These binaries are long orbital period systems with $P =$ 95 to 237 days and with small semi-amplitude $K\\_1<11$ km s$^{-1}$. We combined the Be star velocities with prior sdO measurements to obtain mass ratios. A Doppler tomography algorithm shows the presence of the He II $\\lambda 4686$ line in the faint spectrum of the hot companion in four of the targets. We discuss the observed line variability and show evidence of phased-locked variations in the emission profiles of HD 157832, suggesting a possible disk spiral density wave due to the presence of the companion star. The stripped companions in HD 113120 and HD 137387 may have a mass larger than the 1.4 $M\\_\\odot$ indicating that they could be progenitors of Type Ib and Ic supernovae.\n\n", "2303.12579": "2023-03-22, **Mixing of materials in magnetised core-collapse supernova remnants**, Meyer D. M. -A. et.al., [2303.12579v1](http://arxiv.org/abs/2303.12579v1)\n\n Core-collapse supernova remnants are structures of the interstellar medium (ISM) left behind the explosive death of most massive stars (smaller or equal to 40 Mo). Since they result in the expansion of the supernova shock wave into the gaseous environment shaped by the star wind history, their morphology constitutes an insight into the past evolution of their progenitor star. Particularly, fast-moving massive stars can produce asymmetric core-collapse supernova remnants. We investigate the mixing of materials in core-collapse supernova remnants generated by a moving massive 35 Mo star, in a magnetised ISM. Stellar rotation and the wind magnetic field are time-dependently included into the models which follow the entire evolution of the stellar surroundings from the zero age main sequence to 80 kyr after the supernova explosion. It is found that very little main sequence material is present in remnants from moving stars, that the Wolf-Rayet wind mixes very efficiently within the 10 kyr after the explosion, while the red supergiant material is still unmixed by 30 per cent within 50 kyr after the supernova. Our results indicate that the faster the stellar motion, the more complex the internal organisation of the supernova remnant and the more effective the mixing of ejecta therein. In contrast, the mixing of stellar wind material is only weakly affected by progenitor motion, if at all.\n\n", "2303.12530": "2023-03-22, **Inhomogeneous Galactic Chemical Evolution: Modelling Ultra-Faint Dwarf Galaxies of the Large Magellanic Cloud**, Ryan K. Alexander et.al., [2303.12530v1](http://arxiv.org/abs/2303.12530v1)\n\n Ultra-faint dwarf galaxies are among the oldest and most metal-poor galaxies in the cosmos, observed to contain no traces of gas at the present time and a high dark matter mass fraction. Understanding the chemical abundance dispersion in such extreme environments could shed light on the properties of the first generations of stars in the cosmos. We present a novel inhomogeneous chemical evolution model, i-GEtool, that we apply to two ultra-faint dwarf galaxies, Carina II (Car II) and Reticulum II (Ret II), which are satellites of the Large Magellanic Cloud. In summary, our model is based on the Monte Carlo sampling of the initial mass function as star formation proceeds in different gas cells of the simulated galaxy volume. We account for the chemical enrichment of Supernova bubbles as they spread in the interstellar medium, which causes dispersion in the predicted elemental abundances. We recreate the elemental abundance patterns by focusing on $\\alpha$- and odd-$\\textit{Z}$ elements, predicting two sequences in [C/Fe] and [N/Fe] at all metallicities. Our models systematically underestimate [C/Fe] and [Ti/Fe] because of the large uncertainty in the adopted stellar nucleosynthesis yields. We discuss that the observed C and N abundances had likely been affected by internal mixing processes, which changed the initial surface abundances in the red giants. Our Supernova feedback scheme is responsible for driving galactic outflows, which quench the star formation activity in the simulated galaxies at early times. The average outflow mass-loading factor as predicted by our models is $\\approx 10^{3}$, which extrapolates towards very low galaxy stellar masses the trend observed at high stellar masses. Finally, by combining our model with the MIST isochrone database, we draw synthetic colour-magnitude diagrams of Car II and Ret II and compare them to observations.\n\n", "2303.12500": "2023-03-22, **The first stars: formation, properties, and impact**, Ralf S. Klessen et.al., [2303.12500v1](http://arxiv.org/abs/2303.12500v1)\n\n The first generation of stars, often called Population III (or Pop III), form from metal-free primordial gas at redshifts 30 and below. They dominate the cosmic star formation history until redshifts 15 to 20, at which point the formation of metal-enriched Pop II stars takes over. We review current theoretical models for the formation, properties and impact of Pop III stars, and discuss existing and future observational constraints. Key takeaways from this review include the following: (1) Primordial gas is highly susceptible to fragmentation and Pop III stars form as members of small clusters with a logarithmically flat mass function. (2) Feedback from massive Pop III stars plays a central role in regulating subsequent star formation, but major uncertainties remain regarding its immediate impact. (3) In extreme conditions, supermassive Pop III stars can form, reaching masses of several 10^5 Msun. Their remnants may be the seeds of the supermassive black holes observed in high-redshift quasars. (4) Direct observations of Pop III stars in the early Universe remain extremely challenging. Indirect constraints from the global 21cm signal or gravitational waves are more promising. (5) Stellar archeological surveys allow us to constrain both the low-mass and the high-mass ends of the Pop III mass distribution. Observations suggest that most massive Pop III stars end their lives as core-collapse supernovae rather than as pair-instability supernovae.\n\n", "2303.12437": "2023-03-22, **Vela pulsar wind nebula x-rays are polarized to near the synchrotron limit**, Fei Xie et.al., [2303.12437v1](http://arxiv.org/abs/2303.12437v1)\n\n Pulsar wind nebulae are formed when outflows of relativistic electrons and positrons hit the surrounding supernova remnant or interstellar medium at a shock front. The Vela pulsar wind nebula is powered by a young pulsar (B0833-45, age 11 kyr) and located inside an extended structure called Vela X, itself inside the supernova remnant. Previous X-ray observations revealed two prominent arcs, bisected by a jet and counter jet. Radio maps have shown high linear polarization of 60 per cent in the outer regions of the nebula. Here we report X-ray observation of the inner part of the nebula, where polarization can exceed 60 per cent at the leading edge, which approaches the theoretical limit of what can be produced by synchrotron emission. We infer that, in contrast with the case of the supernova remnant, the electrons in the pulsar wind nebula are accelerated with little or no turbulence in a highly uniform magnetic field.\n\n", "2303.12432": "2023-03-22, **Inferring the progenitor mass-kinetic energy relation of stripped-envelope core-collapse supernovae from nebular spectroscopy**, Qiliang Fang et.al., [2303.12432v1](http://arxiv.org/abs/2303.12432v1)\n\n The relation between the progenitor mass and the kinetic energy of the explosion is a key toward revealing the explosion mechanism of stripped-envelope (SE) core-collapse (CC) supernovae (SNe). Here, we present a method to derive this relation using the nebular spectra of SESNe, based on the correlation between the [O~I]/[Ca~II], which is an indicator of the progenitor mass, and the width of [O~I], which measures the expansion velocity of the oxygen-rich material. To explain the correlation, the kinetic energy ($E\\_{\\rm K}$) is required to be positively correlated with the progenitor mass as represented by the CO core mass ($M\\_{\\rm CO}$). We demonstrate that SNe IIb/Ib and SNe Ic/Ic-BL follow the same $M\\_{\\rm CO}$-$E\\_{\\rm K}$ scaling relation, which suggests the helium-rich and helium-deficient SNe share the same explosion mechanism. The $M\\_{\\rm CO}$-$E\\_{\\rm K}$ relation derived in this work is compared with the ones from early phase observations. The results are largely in good agreement. Combined with early phase observation, the method presented in this work provides a chance to scan through the ejecta from the outermost region to the dense inner core, which is important to reveal the global properties of the ejecta and constrain the explosion mechanism of core-collapse supernovae.\n\n"}}