{"neutrino": {"2507.18482": "2025-07-24, **Three-flavor neutrino oscillations using the Phase Space Approach**, Mariane Mangin-Brinet et.al., [2507.18482v1](http://arxiv.org/abs/2507.18482v1)\n\n The Phase-Space Approximation (PSA) approach, originally applied in [Phys. Rev. D 106, 123006 (2022)] to describe neutrino oscillations from a stellar object in the two-flavor limit, is extended here to describe the more realistic case where neutrinos can oscillate between three different flavors. The approach is successfully validated against the exact solutions up to eight neutrinos. In all cases where the exact solution is feasible, the PSA provides excellent reproduction of the neutrino oscillation dynamics. By replacing the full problem with a set of simple mean-field equations, the PSA offers a versatile, predictive, and easily parallelizable approach for tackling three-flavor problems. This enables the simulation of large-scale neutrino oscillations, as illustrated here with simulations involving up to 300 neutrinos. Additionally, the method provides insight into the system's equilibration properties.\n\n", "2507.18304": "2025-07-24, **Quark and lepton mixing in the asymptotically safe Standard Model**, Astrid Eichhorn et.al., [2507.18304v1](http://arxiv.org/abs/2507.18304v1)\n\n The quark mixing (CKM) matrix is near-diagonal, whereas the lepton mixing (PMNS) matrix is not. We learn that both observations can generically be explained within an ultraviolet completion of the Standard Model with gravity. We find that certain relations between CKM matrix elements should hold approximately because of asymptotically safe regimes, including $\\|V\\_{ud}\\|^2+\\|V\\_{us}\\|^2 \\approx 1$ and $\\|V\\_{cd}\\|^2+\\|V\\_{cs}\\|^2\\approx 1$. Theoretically, the accuracies of these relations determine the length of the asymptotically safe regimes. Experimental data confirms these relations with an accuracy of $10^{-5}$ and $10^{-3}$, respectively. This difference in accuracies is also expected, because the ultraviolet completion consists in a fixed-point cascade during which one relation is established already much deeper in the ultraviolet. This results in $\\|V\\_{ub}\\|^2 < \\|V\\_{cb}\\|^2$ and translates into measurable properties of $B$-mesons.   Similar results would hold for the PMNS matrix, if neutrino Yukawa couplings were large. The ultraviolet complete theory therefore must -- and in fact can -- avoid such an outcome. It contains a mechanism that dynamically limits the size of neutrino Yukawa couplings. Below an upper bound on the sum of Dirac neutrino masses, this allows the PMNS matrix to avoid a near-diagonal structure like the CKM matrix. Thus, large neutrino mixing is intimately tied to small Dirac neutrino masses, $\\sum m\\_{\\nu} \\lesssim {\\mathcal{O}} (1)\\, \\rm eV$ and a mass gap in the Standard Model fermion masses.\n\n", "2507.17908": "2025-07-23, **Flat Spectrum Radio Quasars as high-energy neutrino sources**, Alberto Moretti et.al., [2507.17908v1](http://arxiv.org/abs/2507.17908v1)\n\n The astrophysical sources responsible for the production of high energy neutrinos remain largely uncertain. The strongest associations suggest a correlation between neutrinos and active galactic nuclei (AGN). However, it is still unclear which specific regions and mechanisms of the accreting supermassive black hole (SMBH) are responsible for their production. In this paper we investigate the correlation between the positions of IceCat-1 neutrino events and a large, optically selected QSO catalog extracted from the Sloan Digital Sky Survey. Within this sample, we distinguish radio-quiet QSOs from flat-spectrum radio QSOs (FSRQs)based on radio emission data from the Cosmic Lens All Sky Survey (CLASS) catalog. While the associations between neutrino events and radio-quiet QSOs are consistent with being all random matches, FSRQs exhibit a moderately significant correlation (2.7 sigma) with neutrino positions. Additionally we observe that the distribution of minimum distances between neutrino events and FSRQs differs significantly for events at declinations above and below 20 deg. In particular, using the KS test, we find that the high-declination event distribution shows a strong deviation (4 sigma) from a random distribution. We interpret all these results as an indication that a large fraction (> 60%) of the neutrino events observed by IceCube could be produced by the FSRQ and that the emission mechanism is likely related to the relativistic jets rather than the \"radio-quiet\" (RQ) component of these sources, such as the accretion disk or corona.\n\n", "2507.17836": "2025-07-23, **Collapsar Disk Outflows III: Detectable Neutrino and Gravitational Wave Signatures**, Rodrigo Fernández et.al., [2507.17836v1](http://arxiv.org/abs/2507.17836v1)\n\n We investigate the neutrino and gravitational wave (GW) signals from accretion disks formed during the failed collapse of a rotating massive star (a collapsar). Following black hole formation, a neutrino-cooled, shocked accretion disk forms, which displays non-spherical oscillations for a period of seconds before becoming advective and exploding the star. We compute the neutrino and GW signals (matter quadrupole) from collapsar disks using global axisymmetric, viscous hydrodynamic simulations. The neutrino signal with typical energies of O$(10)$ MeV is maximal during the neutrino-cooled (NDAF) phase that follows shock formation. This phase lasts for a few seconds and is easily detectable within O$(10-100)$ kpc by the IceCube Neutrino Telescope. Additional neutrino signatures from a precursor equatorial shock and by stochastic accretion plumes during the advective phase are detectable within the galaxy. The GW signal during the NDAF phase is detectable in the galaxy by current and next-generation ground-based observatories. The explosion (memory) GW signal is similar to that of standard core-collapse supernovae and can be probed with a deci-Hertz space-based detector. Shock oscillations during the NDAF phase impart time variations with frequency O$(10-100)$ Hz to the neutrino and GW signals, encoding information about the shock dynamics and inner disk. These time variations can be detectable in neutrinos by IceCube within O$(1-10)$ kpc depending on progenitor model, flavor transformation scenario, and detailed properties of the angular momentum transport mechanism.\n\n", "2507.17830": "2025-07-23, **Multiple Populations of Same Sterile Neutrino as Dark Matter**, Muping Chen et.al., [2507.17830v1](http://arxiv.org/abs/2507.17830v1)\n\n Sterile neutrinos produced in the early Universe that mix with active neutrinos of the Standard Model are typically considered to consist of a single population resulting from one dominant production mechanism. We show that the same sterile neutrino species can naturally emerge with multiple population components, yielding a multi-modal relic momentum spectrum. We consider this with four distinct production scenarios: active-sterile non-resonant oscillations following resonant oscillations in the presence of a primordial lepton asymmetry, gravitational production through sterile neutrinogenesis from populations of evaporating primordial black holes, and heavy singlet Higgs or inflaton decays combined with non-resonant active-sterile oscillations or neutrinogenesis. We identify sterile neutrino mass ranges where a colder and a hotter population can be present with similar contributions and can also contribute non-negligibly to the dark matter relic abundance. We discuss some potential consequences of such a multi-population framework.\n\n", "2507.17676": "2025-07-23, **Effect of Group-V Impurities on the Electronic Properties of Germanium Detectors: An Insight from First-Principles Calculations**, Sandip Aryal et.al., [2507.17676v1](http://arxiv.org/abs/2507.17676v1)\n\n The outstanding properties of high-purity germanium (HPGe) detectors, such as excellent energy resolution, high energy sensitivity, and a low background-to-signal ratio, make them essential and ideal candidates for detecting particle signatures in nuclear processes such as neutrino-less double beta decay. However, the presence of defects and impurities in HPGe crystals can lead to charge trapping, which affects carrier mobility and results in significant energy resolution degradation. In this work, we employ density functional theory with a hybrid functional to study the energetics of possible point defects in Ge. Our findings indicate that n-type group-V impurities, such as phosphorus (P), arsenic (As), and antimony (Sb), form more readily in Ge compared to nitrogen (N), Ge vacancies, and Ge interstitials. Unlike N dopants, which yield deep trap states, P, As, and Sb create shallow traps close to the conduction band edge of Ge. Furthermore, we predict that n-type defects can condense into defect complexes with Ge vacancies. These vacancy-impurity complexes form deep traps in Ge, similar to Ge vacancies, suggesting that both vacancies and vacancy-impurity complexes contribute to charge trapping in these detectors, thereby diminishing their performance.\n\n", "2507.17425": "2025-07-23, **Readout electronics for low occupancy High-Pressure Gas TPCs**, N. Khan et.al., [2507.17425v1](http://arxiv.org/abs/2507.17425v1)\n\n HPgTPCs have benefits such as low energy threshold, magnetisability, and 4$\\pi$ acceptance, making them ideal for neutrino experiments such as DUNE. We present the design of an FPGA-based solution optimised for ND-GAr, which is part of the Phase-II more capable near detector for DUNE. These electronics reduce the cost significantly compared to using collider readout electronics which are typically designed for much higher occupancy and therefore, for example, need much larger numbers of FPGAs and power per channel. We demonstrate the performance of our electronics with the TOAD at Fermilab in the US at a range of pressures and gas mixtures up to 4.5barA, reading out ~10000 channels from a multi-wire proportional chamber. The operation took place between April and July of 2024. We measure the noise characteristics of the system to be sufficiently low and we identify sources of noise that can be further mitigated in the next iteration. We also note that the cooling scheme used in the test requires improvement before full-scale deployment. Despite these necessary improvements, we show that the system can fulfil the needs of a HPgTPC for a fraction of the price of collider readout electronics.\n\n", "2507.17315": "2025-07-23, **Prospects for searching for sterile neutrinos in dynamical dark energy cosmologies using joint observations of gravitational waves and $γ$-ray bursts**, Lu Feng et.al., [2507.17315v1](http://arxiv.org/abs/2507.17315v1)\n\n In the era of third-generation (3G) gravitational-wave (GW) detectors, GW standard siren observations from binary neutron star mergers provide a powerful tool for probing the expansion history of the universe. Since sterile neutrinos can influence cosmic evolution by modifying the radiation content and suppressing structure formation, GW standard sirens offer promising prospects for constraining sterile neutrino properties within a cosmological framework. Building on this, we investigate the prospects for detecting sterile neutrinos in dynamical dark energy (DE) models using joint observations from 3G GW detectors and a future short gamma-ray burst detector, such as a THESEUS-like telescope. We consider three DE models: the $w$CDM, holographic DE (HDE), and Chevallier-Polarski-Linder (CPL) models. Our results show that the properties of DE can influence the constraints on sterile neutrino parameters. Moreover, the inclusion of GW data significantly improves constraints on both sterile neutrino parameters and other cosmological parameters across all three models, compared to the current limits derived from CMB+BAO+SN (CBS) observations. When GW data are included into the CBS dataset, a preference for $\\Delta N\\_{\\rm eff} > 0$ emerges at approximately the $1\\sigma$ level in the $w$CDM and CPL models, and reaches about $3\\sigma$ in the HDE model. Moreover, the upper limits on $m\\_{\\nu,{\\rm sterile}}^{\\rm eff}$ are reduced by approximately 13%, 75%, and 3% in the $w$CDM, HDE, and CPL models, respectively.\n\n", "2507.17283": "2025-07-23, **Pictorial and Documentary Guide for Research, Teaching, and Education through Astronomy, Physics, and Mathematics Pursued under the Umbrella of the United Nations (1974-2024)**, Hans J. Haubold et.al., [2507.17283v1](http://arxiv.org/abs/2507.17283v1)\n\n This paper was prepared for Open-Access-only publication as a guide reporting on Education (all aspects of space science and technology), Teaching (remote sensing and GIS, satellite meteorology and global climate, satellite communication, space and atmospheric sciences, global navigation satellite systems), and Research (solar neutrino problem, formation of structure in the Universe) in astronomy (solar physics, cosmology), physics (nuclear physics, neutrino physics), and mathematics (fractional calculus, special functions of mathematical physics) exercised over 50 years (1974-2024). In this period, more than twenty workshops were held and seven regional centres for space science and technology education were established in all regions of the world: Asia and the Pacific, Latin America and the Caribbean, Africa, Western Asia, and Europe. This effort was undertaken in cooperation with ESA, NASA, JAXA, and 193 member states of the United Nations under the auspices of the UN, also supported by the Committee on Space Research (COSPAR) and the International Astronomical Union (IAU). The paper provides access to most of the documents in the six official languages of the United Nations (Arabic, Chinese, English, French, Russian, and Spanish), proceedings, and published papers and books focusing on education, teaching, and research (listed in Google Scholar and Research Gate).\n\n", "2507.17266": "2025-07-23, **End-to-end reconstruction of ultra-high energy particle observables from radio detection of extensive air showers**, Kewen Zhang et.al., [2507.17266v1](http://arxiv.org/abs/2507.17266v1)\n\n The radio detection of very inclined air showers offers a promising avenue for studying ultra-high-energy cosmic rays (UHECRs) and neutrinos. Accurate reconstruction methods are essential for investigating the properties of primary particles. Recently, we developed an analytical least-squares method to reconstruct the electric field using three polarization components. The reconstruction yields no bias, with a 68\\% confidence interval of [-0.02, 0.02], and a standard deviation of 0.04. Using this reconstructed electric field, we perform a realistic reconstruction of the the properties of primary particles. We employ a spherical wave model combined with an angular distribution function (ADF) for arrival direction reconstruction, achieving an angular resolution of 0.04$^\\circ$. This paper also presents an energy reconstruction in which we account for the effects of geosynchrotron radiation in inclined air showers, we implement an air density correction in the energy reconstruction, resulting in a 10\\% resolution in energy estimation. These findings demonstrate the reliability and effectiveness of our reconstruction methodology, paving the way for future detection experiments using sparse antenna arrays.\n\n"}, "dark matter": {"2507.18508": "2025-07-24, **Resonant enhancement of axion dark matter decay**, Bilal Ahmad et.al., [2507.18508v1](http://arxiv.org/abs/2507.18508v1)\n\n The axion is particularly well motivated candidate for the dark matter comprising most of the mass of our visible Universe, leading to worldwide experimental and observational efforts towards its discovery. As is well known, resonant cavities are a primary tool in this search, where they are used to enhance the conversion rate of axions into photons in a background electromagnetic field. What is perhaps less well appreciated is that resonant cavities can also enhance the rate at which axions decay to two photons, a manifestation of the Purcell effect. We explore this possibility and show that it offers a novel method to search the axion parameter space in a way that is competitive and complimentary to other approaches, with the capability to probe the most-favoured region for QCD axion dark matter. Furthermore, we establish that this method can be implemented via pre-existing axion heterodyne detection schemes, enabling such experiments to perform these searches with minimal modification.\n\n", "2507.18389": "2025-07-24, **Topological dark energy from spacetime foam: A challenge for $Λ$CDM**, Fotios K. Anagnostopoulos et.al., [2507.18389v1](http://arxiv.org/abs/2507.18389v1)\n\n Using only the standard considerations of spacetime foam and the Euclidean Quantum Gravity techniques known long ago, we result to a model of Topological Dark Energy (TDE) that outperforms the standard $\\Lambda$CDM paradigm with regard to data fitting efficiency. Specifically, it is known that at the foam level, topologically non-trivial solutions such as instantons appear. In the particular case of Einstein-Gauss-Bonnet gravity, we obtain an effective dynamical dark energy term proportional to the instanton density, and the latter can be easily calculated through standard techniques. Hence, we can immediately extract the differential equation that determines the evolution of the topologically induced effective dark energy density. Significantly, this TDE scenario allows for changing sign of dark energy during the cosmic evolution and also exhibits Dark Energy interaction with Dark Matter. We confront the TDE scenario, in both flat and non-flat cases, with Pantheon+/SH0ES Supernovae Type Ia (SNIa), Baryonic Accoustic Oscillations (BAO), and Cosmic Chronometers (CC) datasets. By applying standard model selection methods (AIC and DevIC information criteria), we find a moderate but statistically significant preference over $\\Lambda$CDM scenario. Finally, we show that the TDE scenario passes constraints from Big Bang Nucleosynthesis (BBN) and thus does not spoil the thermal history of the Universe.\n\n", "2507.18322": "2025-07-24, **New models of nonsingular black hole dark matter from limiting curvature**, Selin Aşmanoğlu et.al., [2507.18322v1](http://arxiv.org/abs/2507.18322v1)\n\n We consider phenomenological models for nonsingular black hole that satisfy the limiting curvature condition (i.e., that have curvatures that are always sub-Planckian in size) while having a more general dependence on the black hole mass than the most studied examples. These models allow black holes to exist while having regulators that are larger than the horizon scale; it has been shown previously that this can lead to observable consequences in an astrophysical setting, for allowed choices for the regulator scale. Noting that substantial horizon-scale modifications of the metric will affect black hole thermodynamics and Hawking radiation, we study these metrics in the context of primordial black hole dark matter. Considering examples with de\\,Sitter and Minkowski cores, respectively, we study the effect of the regulator in these metrics on the allowed black hole mass ranges (or ``bands\"), the black hole temperature, specific heat and lifetime, and the bounds on the primordial black hole fraction of the total dark matter density from the observed extragalactic gamma ray background.\n\n", "2507.18292": "2025-07-24, **The Tremaine-Weinberg method at high redshift**, Mahmood Roshan et.al., [2507.18292v1](http://arxiv.org/abs/2507.18292v1)\n\n This paper examines the reliability of the Tremaine-Weinberg (TW) method in measuring the pattern speed of barred galaxies at high redshifts. Measuring pattern speeds at high redshift may help to shed light on the time evolution of interactions between galactic bars and dark matter halos. The TW method has been extensively employed for nearby galaxies, and its accuracy in determining bar pattern speeds has been validated through numerical simulations. For nearby galaxies, the method yields acceptable results when the inclination angle of the galaxy and the position angle of the bar fall within appropriate ranges. However, the application of the TW method to high-redshift galaxies remains unexplored in both observations and simulations. In this study, we generate mock observations of barred galaxies from the TNG50 cosmological simulation. These simulated observations are tailored to mimic the Integral Field Unit (IFU) spectroscopy data that the Near-Infrared Spectrograph (NIRSpec) on the James Webb Space Telescope (JWST) would capture at a redshift of $z\\simeq 1.2$. By applying the TW method to these mock observations and comparing the results with the known pattern speeds, we demonstrate that the TW method performs adequately for barred galaxies with bars sufficiently long to be detected by JWST at high redshifts. This work opens a new avenue for applying the TW method to investigate the properties of high-redshift barred galaxies.\n\n", "2507.18274": "2025-07-24, **Phantom crossing or dark interaction?**, Sêcloka L. Guedezounme et.al., [2507.18274v1](http://arxiv.org/abs/2507.18274v1)\n\n Recent results from DESI BAO measurements, together with Planck CMB and Pantheon+ data, suggest that there may be a `phantom' phase ($w\\_{\\rm de}<-1$) in the expansion of the Universe. This inference follows when the $w\\_0, w\\_a$ parametrization for the dark energy equation of state $w\\_{\\rm de}$ is used to fit the data. Since phantom dark energy in general relativity is unphysical, we investigate the possibility that the phantom behaviour is not intrinsic, but effective -- due to a non-gravitational interaction between dark matter and non-phantom dark energy. To this end, we assume a physically motivated thawing quintessence-like form of the intrinsic dark energy equation of state $w\\_{\\rm de}$. Then we use a $w\\_0, w\\_a$ model for the \\emph{effective} equation of state of dark energy. We find that the data favours a phantom crossing for the effective dark energy, but only at low significance. The intrinsic equation of state of dark energy is non-phantom, without imposing any non-phantom priors. A nonzero interaction is favoured at more than $3\\sigma$ at $z\\sim0.3$. The energy flows from dark matter to dark energy at early times and reverses at later times.\n\n", "2507.18164": "2025-07-24, **Evaluation of PID Performance at CEPC and Optimization with Combined dN/dx and Time-of-Flight Data**, Dian Yu et.al., [2507.18164v1](http://arxiv.org/abs/2507.18164v1)\n\n This work presents a comprehensive study of charged-hadron particle identification (PID) at the Circular Electron-Positron Collider (CEPC), based on full simulation of hadronic $Z$-pole events. A unified PID strategy is developed by combining energy loss measurements (dN/dx) from the time projection chamber (TPC) and time-of-flight (ToF) information from both the inner (ITK) and outer (OTK) silicon trackers. The PID discriminant is constructed using residuals between measured and expected observables under multiple particle hypotheses, with identification regions optimized to maximize kaon efficiency and purity across bins of momentum and polar angle. Results show that the TPC alone, while highly efficient (99.3%), suffers from severe pion-induced contamination, yielding only 14.3% purity. Incorporating ToF from OTK improves the purity to 25.7%. A full combination of ITK, TPC, and OTK significantly enhances performance, achieving 96.8% efficiency and 87.4% purity (product: 84.6%). Furthermore, a momentum-dependent strategy that dynamically selects the optimal detector combination achieves the best overall performance, with 99.4% efficiency and 92.4% purity, corresponding to a 91.8% kaon identification quality. These results demonstrate that the CEPC baseline detector fulfills the requirements for precision flavor tagging and provide clear guidance for future optimization of timing detector configurations.\n\n", "2507.18054": "2025-07-24, **Variational autoencoder for generating realistic $N$-body simulations for dark matter halos**, Jazhiel Chacón-Lavanderos et.al., [2507.18054v1](http://arxiv.org/abs/2507.18054v1)\n\n In this paper, we explore the use of a variational autoencoder (VAE), a deep generative model, to compress and generate images of dark matter density fields from $\\Lambda$CDM like cosmological simulations. The VAE learns a compact, low-dimensional representation of the large-scale structure, enabling both accurate reconstruction and generation of statistically realistic samples. We evaluated the generated images by comparing their power spectra to those of real simulations and the theoretical $\\Lambda$CDM prediction, finding strong agreement with the state-of-the-art simulations. In addition, the VAE provides a fast and scalable method for generating synthetic cosmological data, making it a valuable tool for data augmentation. These capabilities can accelerate the development and training of more advanced machine learning models for cosmological analysis, particularly in scenarios where large-scale simulations are computationally expensive. Our results highlight the potential for generative artificial intelligence as a practical bridge between physical modeling and modern deep learning in cosmology.\n\n", "2507.17955": "2025-07-23, **Constraints on millicharged particles from nuclear gamma-decays**, Ting Gao et.al., [2507.17955v1](http://arxiv.org/abs/2507.17955v1)\n\n We consider nuclear gamma decays and $\\gamma$-emitting reactions that can be an efficient source of hypothetical millicharged particles ($\\chi$). In particular, we revisit the production of millicharged particles in nuclear reactor environment, pointing out that $\\gamma$ cascades from $^{239}$U is an overlooked yet a powerful source of $\\chi\\bar\\chi$ pairs. This leads to an increased flux compared to previous studies. We then apply new estimates of the flux to derive novel limits on the value of millicharge, $\\varepsilon = Q\\_\\chi/e$, from the electron recoil searched for in a variety of experiments placed in proximity to the reactor cores. The derived limits on $\\varepsilon$ are the strongest in the interval of masses $\\sim 0.7-2 $\\,MeV. We also derive the MCP flux from the Sun and point out potential sensitivity of the low-threshold dark matter search experiments.\n\n", "2507.17833": "2025-07-23, **Not-quite-primordial black holes seeded by cosmic string loops**, Bryce Cyr et.al., [2507.17833v1](http://arxiv.org/abs/2507.17833v1)\n\n Cosmic strings appear in many well-motivated extensions to the standard model of particle physics. If they exist, an abundant population of compact objects known as cosmic string loops permeate the Universe at all times, providing a secondary source of density perturbations that are large amplitude and non-gaussian in nature. In general, these loops are not stationary in the rest frame of the dark matter, thus their relative velocities will typically seed both spherical and filamentary overdensities in the matter era. Building upon previous work, we provide an improved framework to compute the complete halo mass function for these string seeded overdensities, valid for any loop velocity distribution. Using this mass function, we also compute the subset of halos capable of undergoing a direct collapse, forming a population of black holes with initial mass $10^{4-5} \\, M\\_{\\odot}$ at high redshifts. Interestingly, for reasonable values of the string parameters, one can reproduce the abundance of ``Little Red Dots\" as inferred by JWST.\n\n", "2507.17831": "2025-07-23, **On Focusing Statistical Power for Searches and Measurements in Particle Physics**, James Carzon et.al., [2507.17831v1](http://arxiv.org/abs/2507.17831v1)\n\n Particle physics experiments rely on the (generalised) likelihood ratio test (LRT) for searches and measurements, which consist of composite hypothesis tests. However, this test is not guaranteed to be optimal, as the Neyman-Pearson lemma pertains only to simple hypothesis tests. Any choice of test statistic thus implicitly determines how statistical power varies across the parameter space. An improvement in the core statistical testing methodology for general settings with composite tests would have widespread ramifications across experiments. We discuss an alternate test statistic that provides the data analyzer an ability to focus the power of the test on physics-motivated regions of the parameter space. We demonstrate the improvement from this technique compared to the LRT on a Higgs $\\rightarrow\\tau\\tau$ dataset simulated by the ATLAS experiment and a dark matter dataset inspired by the LZ experiment. We also employ machine learning to efficiently perform the Neyman construction, which is essential to ensure statistically valid confidence intervals.\n\n", "2507.17825": "2025-07-23, **Ultralight dark matter detection with trapped-ion interferometry**, Leonardo Badurina et.al., [2507.17825v1](http://arxiv.org/abs/2507.17825v1)\n\n We explore how recent advances in the manipulation of single-ion wave packets open new avenues for detecting weak magnetic fields sourced by ultralight dark matter. A trapped ion in a ``Schr\\\"odinger cat'' state can be prepared with its spin and motional degrees of freedom entangled and be used as a matter-wave interferometer that is sensitive to the Aharonov-Bohm-like phase shift accumulated by the ion over its trajectory. The result of the spin-motion entanglement is a parametrically-enhanced sensitivity to weak magnetic fields as compared with an un-entangled ion in a trap. Taking into account the relevant boundary conditions, we demonstrate that a single trapped ion can probe unexplored regions of kinetically-mixed dark-photon dark matter parameter space in the $10^{-15}~\\text{eV} \\lesssim m\\_{A'} \\lesssim 10^{-14}$~eV mass window. We also show how such a table-top quantum device will also serve as a complementary probe of axion-like particle dark matter in the same mass window.\n\n", "2507.17803": "2025-07-23, **The Dark Side of a Tera-Z Factory**, Pablo Olgoso et.al., [2507.17803v1](http://arxiv.org/abs/2507.17803v1)\n\n The future circular $e^+e^-$ collider (FCC-ee or CEPC) will provide unprecedented sensitivity to indirect new physics signals emerging as small deviations from the Standard Model predictions in electroweak precision tests. Assuming new physics scenarios containing a dark matter candidate and a $t$-channel mediator, we analyse the synergy and interplay of future Tera-$Z$ factories and non-collider tests conducted through direct and indirect searches of dark matter. Our results highlight the excellent prospect for a Tera-$Z$ run to indirectly probe the presence and nature of dark matter.\n\n", "2507.17804": "2025-07-23, **On the Energy Distribution of the Galactic Center Excess' Sources**, Florian List et.al., [2507.17804v1](http://arxiv.org/abs/2507.17804v1)\n\n The Galactic Center Excess (GCE) remains one of the defining mysteries uncovered by the Fermi $\\gamma$-ray Space Telescope. Although it may yet herald the discovery of annihilating dark matter, weighing against that conclusion are analyses showing the spatial structure of the emission appears more consistent with a population of dim point sources. Technical limitations have restricted prior analyses to studying the point-source hypothesis purely spatially. All spectral information that could help disentangle the GCE from the complex and uncertain astrophysical emission was discarded. We demonstrate that a neural network-aided simulation-based inference approach can overcome such limitations and thereby confront the point source explanation of the GCE with spatial and spectral data. The addition is profound: energy information drives the putative point sources to be significantly dimmer, indicating either the GCE is truly diffuse in nature or made of an exceptionally large number of sources. Quantitatively, for our best fit background model, the excess is essentially consistent with Poisson emission as predicted by dark matter. If the excess is instead due to point sources, our median prediction is ${\\cal O}(10^5)$ sources in the Galactic Center, or more than 35,000 sources at 90% confidence, both significantly larger than the hundreds of sources preferred by earlier point-source analyses of the GCE.\n\n", "2507.17693": "2025-07-23, **Estimating the baryon fraction in the IGM from well-localized FRBs and DESI data**, Thais Lemos et.al., [2507.17693v1](http://arxiv.org/abs/2507.17693v1)\n\n Current measurements of Baryon Acoustic Oscillations (BAO) from the Dark Energy Spectroscopic Survey (DESI DR2), when combined with data from Type Ia supernovae (SNe), challenge the observational viability of the $\\Lambda$-Cold Dark Matter ($\\Lambda$CDM) model, motivating combinations of independent datasets to estimate cosmological quantities. In a previous communication, we presented a cosmological independent method to constrain the baryon fraction in the IGM ($f\\_{\\mathrm{IGM}}$), where we derived relevant expressions for the dispersion measure ($\\mathrm{DM}$) in terms of luminosity distance, allowing us to estimate $f\\_{\\mathrm{IGM}}$ combining directly measurements of 17 well-localized FRBs and 1048 SNe from the Pantheon catalog. Here we revisit this method to constrain $f\\_{\\mathrm{IGM}}$, considering two parameterizations for the $f\\_{\\mathrm{IGM}}$: constant and time-dependent. We expand our sample by combining 107 well-localized Fast Radio Bursts (FRBs) with BAO measurements from DESI DR2 and SNe observations from DESY5, and the Pantheon+ catalog. We find through a Bayesian model selection analysis that a conclusive answer about the evolution of $f\\_{\\mathrm{IGM}}$ cannot be achieved from the current FRBs observational data. In particular, our results show weak evidence in favor of the constant case.\n\n", "2507.17607": "2025-07-23, **Minimal Dark Matter in the sky: updated Indirect Detection probes**, Mohammad Aghaie et.al., [2507.17607v1](http://arxiv.org/abs/2507.17607v1)\n\n Minimal Dark Matter is among the simplest and most predictive Dark Matter frameworks, with the Majorana SU(2) 5-plet as its smallest accidentally stable real representation. We present a comprehensive reassessment of its indirect-detection signals. The $\\gamma$-ray flux from both Sommerfeld-enhanced annihilations and bound-state formation is calculated, incorporating next-to-leading-order corrections and next-to-leading-log resummation of the relevant electroweak effects. In the Milky Way halo, bound-state formation dominates the flux near 100 GeV. The corresponding low-energy spectrum is used to place constraints based on Fermi-LAT observations of Galactic diffuse emission, while the high-energy part of the spectrum is employed to forecast the required observation time for several of the Milky Way's dwarf spheroidal galaxies using the Cherenkov Telescope Array Observatory (CTAO). Fermi-LAT data strongly disfavor the lower edge of the thermal mass window, even under conservative assumptions about the inner Galaxy density profile. Furthermore, several hundred hours of forthcoming CTAO observations of northern dwarfs should be sufficient to probe the central mass value.\n\n", "2507.17794": "2025-07-23, **Accelerating Expansion of the Universe in modified gravity with quadratic terms**, Aaqid Bhat et.al., [2507.17794v1](http://arxiv.org/abs/2507.17794v1)\n\n Chapter1 introduces cosmic acceleration and outlines key features and limitations of GR and its alternatives, including teleparallel and symmetric teleparallel gravity. In Chapter2, we analyze the cosmological implications of $f(T,\\mathcal{T})$ theory by considering the squared-torsion model $f(T,\\mathcal{T})= \\alpha \\mathcal{T}+ \\beta T^2$, where $T$ represents torsion and $\\mathcal{T}$ is the trace of the energy-momentum tensor. In Chapter3, we explore the inflationary scenario within the framework of torsion-trace coupling gravity, utilizing a Lagrangian density derived from a function denoted as $f(T,\\mathcal{T})$. In Chapter4, we aim to investigate the dark sector of the Universe, which encompasses the enigmatic components of the Dark Matter (DM) and Dark Energy (DE). We consider an extended form of the Equation of State (EoS) for DM, widely known as the Extended Bose-Einstein Condensation (EBEC) EoS for DM. In Chapter5, we propose an extended formulation of symmetric teleparallel gravity by generalizing the gravitational Lagrangian through the inclusion of an arbitrary function of $f(Q,\\mathcal{T\\_{\\mu\\nu}} \\mathcal{T^{\\mu\\nu}})$. We derived the FRW equations for a flat, homogeneous, and isotropic spacetime. In Chapter6, we delved into the dark sector of the Universe, specifically focusing on DM and DE. We examine an extended version of the EoS for DM, commonly referred to EBEC EoS for DM, given as $p=\\alpha \\rho + \\beta \\rho^2$, alongside the modified $f(Q)$ Lagrangian given by $f(Q)= \\gamma Q^2$.\n\n", "2507.17340": "2025-07-23, **Implications of the recent neutron decay measurements on the properties of compact objects -- a dark star with nucleonic shell ?**, M. Veselský et.al., [2507.17340v1](http://arxiv.org/abs/2507.17340v1)\n\n Recent experimental observation suggests that neutron decay is always accompanied by emission of electron while in 1% of cases proton is not emitted. We develop a scenario kinematically compatible with experimental observation, where neutron decay results in production of two dark matter particles of about half the mass of neutron and test properties of neutron stars with admixture of such particles. Constraints on mass and coupling to vector dark boson are obtained. The structure of the compact object is modified to a dark star with a shell of nucleonic matter around the nuclear saturation density.\n\n", "2507.17782": "2025-07-23, **SPLENDOR: a novel detector platform to search for light dark matter with narrow-gap semiconductors**, P. Abbamonte et.al., [2507.17782v1](http://arxiv.org/abs/2507.17782v1)\n\n We present the design and current status of SPLENDOR, a novel detector platform that combines narrow-gap semiconductor targets with low-noise charge readout to achieve sensitivity to dark matter energy deposits well below the eV scale. SPLENDOR is designed to be a modular and scalable system able to accommodate different target materials and signal readout technologies. SPLENDOR's present strategy entails: (i) the use of strongly correlated f-electron semiconductors with anisotropic electronic structures to enable not only sub-eV energy thresholds, but also directional sensitivity to the incoming dark matter flux, allowing for signal-background discrimination via daily modulation, and (ii) custom charge readout based on cryogenic high-electron-mobility transistor (cryoHEMT) amplifiers approaching single-electron resolution. We report on the selection and characterization of Eu$\\_5$In$\\_2$Sb$\\_6$ as the target material for SPLENDOR's first prototype detector, as well as the development and calibration of the prototype amplifier chain, achieving a measured charge resolution of 20$\\pm$7 electrons in silicon test samples, consistent with predicted performance. This provides a demonstration of the detector architecture, which is now ready for deployment in a dark matter search campaign to deliver SPLENDOR's first science results. Finally, we present estimates of sensitivity reach in the parameter space of athermally produced relic dark matter under high- and low-background environments, and for various amplifier technology upgrades with increasing performance, including planned quantum sensing upgrades in order to achieve our ultimate goal of sub-electron resolution in optimized systems. SPLENDOR provides a novel approach to dark matter detection, combining quantum sensing with material's design to open new avenues of exploration in the sub-MeV mass range of dark matter parameter space.\n\n", "2507.17148": "2025-07-23, **Constraints on Axion Dark Matter by Spin-Dependent Macroscopic Force**, Dongyi Yang et.al., [2507.17148v1](http://arxiv.org/abs/2507.17148v1)\n\n Axion-like particles (ALPs) are hypothetical particles that serve as promising candidates for cold dark matter. Portals like inelastic axion scattering and axion propagated force have been employed to search for the upper limit of the ALPs' coupling with standard model particles. Other methods, like the axion-fermion interaction in the CASPEr experiment, integrate the dark matter motion into the measurement. We suggest a new method for detecting dark matter axions based on axionelectron elastic scattering. In the pseudoscalar axion model, this interaction can be seen as an effective magnetic field, so high-sensitivity atomic magnetometers can be utilized to measure this interaction. The scattering cross section of this process is significantly amplified by the high number density and occupation number of axion dark matter. The upper limit of the electron-axion coupling coefficient obtained from this process can reach two orders of magnitude higher than previous results at low axion mass, and will exceed the astrophysics limits by using a developing magnetometer. This scattering process also provides an efficient way to detect local structures of dark matter.\n\n"}, "supernova": {"2507.18544": "2025-07-24, **EP250108a/SN2025kg: A Magnetar-powered Gamma-Ray Burst Supernova Originating from a Close Helium-star Binary via Isolated Binary Evolution**, Jin-Ping Zhu et.al., [2507.18544v1](http://arxiv.org/abs/2507.18544v1)\n\n SN\\,2025kg, linked to EP250108a, is among the brightest broad-lined Type Ic supernova (SN Ic-BL) known, showing unique helium absorptions, a late-time broad H$\\alpha$, and an early bump. In this {\\em{Letter}}, we propose a jet-cocoon origin to explain EP250108a as off-axis cooling emission from a mildly relativistic inner cocoon viewed at $\\sim45^\\circ$ and the early bump of SN\\,2025kg as the outer cocoon cooling emission, both constraining an energy of $\\sim(1-2)\\times10^{52}{\\rm{erg}}$ and a progenitor radius of $\\sim5\\,R\\_\\odot$. To explain SN\\,2025kg's exceptionally luminous peak, potential energy injection into the $\\sim2.5\\,M\\_\\odot$ ejecta from a magnetar with initial period $\\sim1.7\\,{\\rm{ms}}$ and magnetic field $\\sim2\\times10^{15}{\\rm{G}}$ may be required, implying a rapidly rotating $\\sim4\\,M\\_\\odot$ progenitor. Thus, the progenitor may be a low-mass helium star with an extended helium envelope, supported by helium absorption lines and an inferred weak pre-SN wind. Hydrogen-rich material may reside in the inner ejecta layers, as suggested by the late-time broad H$\\alpha$, possibly originating from main-sequence companion material evaporated by the magnetar wind. Since the observed near-solar metallicity challenges the popular quasi-chemically homogeneous evolution channel, the rapidly rotating helium-star progenitor of EP250108a/SN\\,2025kg might attain angular momentum by being tidally spun up by a main-sequence companion in a close binary formed through isolated binary evolution.\n\n", "2507.18389": "2025-07-24, **Topological dark energy from spacetime foam: A challenge for $Λ$CDM**, Fotios K. Anagnostopoulos et.al., [2507.18389v1](http://arxiv.org/abs/2507.18389v1)\n\n Using only the standard considerations of spacetime foam and the Euclidean Quantum Gravity techniques known long ago, we result to a model of Topological Dark Energy (TDE) that outperforms the standard $\\Lambda$CDM paradigm with regard to data fitting efficiency. Specifically, it is known that at the foam level, topologically non-trivial solutions such as instantons appear. In the particular case of Einstein-Gauss-Bonnet gravity, we obtain an effective dynamical dark energy term proportional to the instanton density, and the latter can be easily calculated through standard techniques. Hence, we can immediately extract the differential equation that determines the evolution of the topologically induced effective dark energy density. Significantly, this TDE scenario allows for changing sign of dark energy during the cosmic evolution and also exhibits Dark Energy interaction with Dark Matter. We confront the TDE scenario, in both flat and non-flat cases, with Pantheon+/SH0ES Supernovae Type Ia (SNIa), Baryonic Accoustic Oscillations (BAO), and Cosmic Chronometers (CC) datasets. By applying standard model selection methods (AIC and DevIC information criteria), we find a moderate but statistically significant preference over $\\Lambda$CDM scenario. Finally, we show that the TDE scenario passes constraints from Big Bang Nucleosynthesis (BBN) and thus does not spoil the thermal history of the Universe.\n\n", "2507.17969": "2025-07-23, **DESIgning concordant distances in the age of precision cosmology: the impact of density fluctuations**, David Camarena et.al., [2507.17969v1](http://arxiv.org/abs/2507.17969v1)\n\n Discrepancies between distance measurements and $\\Lambda$CDM predictions reveal notable features in the distance-redshift relation, possibly suggesting the presence of an evolving dark energy component. Given the central role of the Friedmann-Lema\\^itre-Robertson-Walker (FLRW) metric in modeling cosmological distances, we investigate here whether these features instead point to a possible departure from the fundamental FLRW symmetries. Exploiting the transverse and line-of-sight distances provided by baryonic acoustic oscillations (BAO) observations, we demonstrate that observed distances hint at a slight but systematic preference for an anisotropic expansion rate emerging regardless of the dark energy model considered. Leveraging this non-FLRW feature, we investigate an inhomogeneous extension of the $\\Lambda$CDM model that naturally provides an anisotropic expansion rate. Our analysis demonstrates that models featuring spherical overdensities can explain BAO, supernova, and cosmic microwave background data, providing fits statistically indistinguishable from those obtained with a phantom dark energy scenario. When Pantheon+ data is considered, our analysis challenges the FLRW framework at $2.8\\sigma$ and yields scenarios that can be interpreted as subtle but non-negligible deviations from the FLRW metric. When DESY5 supernovae are considered instead, deviations are notably more significant, yielding scenarios that mildly violate the Copernican principle and exclude the FLRW assumption at $5.2\\sigma$. Overall, our results motivate a more in-depth investigation of whether the perfectly homogeneous and isotropic FLRW paradigm can still be assumed to accurately predict cosmological distances in the era of precision cosmology.\n\n", "2507.17708": "2025-07-23, **Do Multi-Structural One-Off FRBs Trace Similar Cosmology History with Repeaters?**, Yu-Hao Zhu et.al., [2507.17708v1](http://arxiv.org/abs/2507.17708v1)\n\n Fast Radio Bursts (FRBs) are millisecond-duration transient events that are typically observed at radio wavelengths and cosmological distances but their origin remains unclear. Furthermore, most FRB origin models are related to the processes at stellar scales, involving neutron stars, blackholes, supernovae, etc. In this paper, our purpose is to determine whether multi-structural one-off FRBs and repeaters share similarities. To achieve this, we focus on analyzing the relationship between the FRB event rate and the star formation rate, complemented by statistical testing methods. Based on the CHIME/FRB Catalog 1, we calculate the energy functions for four subsamples, including apparent non-repeating FRBs (one-offs), repeaters, multi-structural one-offs, and the joint repeaters and multi-structural events, respectively. We then derive the FRB event rates at different redshifts for all four subsamples, all of which were found to share a similar cosmological evolution trend. However, we find that the multi-structural one-offs and repeaters are distinguishable from the KS and MWW tests.\n\n", "2507.17693": "2025-07-23, **Estimating the baryon fraction in the IGM from well-localized FRBs and DESI data**, Thais Lemos et.al., [2507.17693v1](http://arxiv.org/abs/2507.17693v1)\n\n Current measurements of Baryon Acoustic Oscillations (BAO) from the Dark Energy Spectroscopic Survey (DESI DR2), when combined with data from Type Ia supernovae (SNe), challenge the observational viability of the $\\Lambda$-Cold Dark Matter ($\\Lambda$CDM) model, motivating combinations of independent datasets to estimate cosmological quantities. In a previous communication, we presented a cosmological independent method to constrain the baryon fraction in the IGM ($f\\_{\\mathrm{IGM}}$), where we derived relevant expressions for the dispersion measure ($\\mathrm{DM}$) in terms of luminosity distance, allowing us to estimate $f\\_{\\mathrm{IGM}}$ combining directly measurements of 17 well-localized FRBs and 1048 SNe from the Pantheon catalog. Here we revisit this method to constrain $f\\_{\\mathrm{IGM}}$, considering two parameterizations for the $f\\_{\\mathrm{IGM}}$: constant and time-dependent. We expand our sample by combining 107 well-localized Fast Radio Bursts (FRBs) with BAO measurements from DESI DR2 and SNe observations from DESY5, and the Pantheon+ catalog. We find through a Bayesian model selection analysis that a conclusive answer about the evolution of $f\\_{\\mathrm{IGM}}$ cannot be achieved from the current FRBs observational data. In particular, our results show weak evidence in favor of the constant case.\n\n", "2507.17551": "2025-07-23, **GW231123: a product of successive mergers from $\\sim 10 $ stellar-mass black holes**, Yin-Jie Li et.al., [2507.17551v1](http://arxiv.org/abs/2507.17551v1)\n\n GW231123 is an exceptionally massive binary black hole (BBH) merger with unusually high component spins. Such extreme properties challenge conventional stellar evolution models predicting a black hole mass gap due to pair-instability supernovae. We analyze GW231123 using population-informed priors on BH mass and spin distributions to test possible formation scenarios: first-generation stellar collapse, hierarchical (multi-generation) mergers, and primordial origin. Our analysis strongly prefers scenarios where at least one component is a higher-generation BH. Both components are favored to have high spins, which rules out scenarios in which they are both first-generation (low spin) or primordial (nearly non-spin). We conclude that GW231123 is a hierarchical merger, with components plausibly originate from the successive mergers of $\\sim 6$ and $\\sim 4$ first-generation BHs, respectively. This suggests that repeated mergers can be frequent and even more massive intermediate-mass black holes may be produced. Thus mechanisms that can efficiently harden the BBHs' orbits are required, e.g., gas dynamical fraction in the disks of active galactic nucleus.\n\n"}}