{"neutrino": {"2409.12145": "2024-09-18, **Probing the cosmic sterile-neutrino background with IceCube**, Bhavesh Chauhan et.al., [2409.12145v1](http://arxiv.org/abs/2409.12145v1)\n\n In this paper, we take a close look at the interaction between the TeV--PeV energy astrophysical neutrinos and a hypothetical cosmic sterile-neutrino background. These interactions yield absorption features, also called ``dips\", in the astrophysical neutrino spectrum, which are studied using the deposited energy distribution of high-energy starting events (HESE) in the IceCube detector. We improve upon the previous analysis by including the effects of regeneration and a realistic source distribution on the propagation of astrophysical neutrinos. We use the latest 7.5-year HESE dataset and include the observation of Glashow resonance in our analysis. We evaluate the impact of these dips on the inferred spectral index and overall normalization of the astrophysical neutrinos. We find a mild preference for dips in the 300--800 TeV range, and the best-fit parameters for the mass of sterile-neutrino and the mediator are 0.5 eV and 23 MeV, respectively. We find that the inclusion of these absorption features lowers the spectral index of astrophysical neutrinos to $2.60^{+0.19}\\_{-0.16}$. The lower spectral index can reduce the disagreement with the Northern Tracks sample but requires dedicated analysis. We also forecast the event spectrum for IceCube-Gen2 for the two different fits.\n\n", "2409.11888": "2024-09-18, **Likelihood reconstruction of radio signals of neutrinos and cosmic rays**, Martin Ravn et.al., [2409.11888v1](http://arxiv.org/abs/2409.11888v1)\n\n Ultra-high-energy neutrinos and cosmic rays are excellent probes of astroparticle physics phenomena. For astroparticle physics analyses, robust and accurate reconstruction of signal parameters like arrival direction and energy is essential. Current reconstruction methods ignore bin-to-bin noise correlations, which limits reconstruction resolution and so far has prevented calculations of event-by-event uncertainties. In this work, we present a likelihood description of neutrino or cosmic-ray signals in a radio detector with correlated noise, as present in all neutrino and cosmic-ray radio detectors. We demonstrate with a toy-model reconstruction that signal parameters such as energy and direction, including event-by-event uncertainties with correct coverage, can be obtained. Additionally, by correctly accounting for correlations, the likelihood description constrains the best-fit parameters better than alternative methods and thus improves experimental reconstruction capabilities.\n\n", "2409.11824": "2024-09-18, **On Precision of the Leptonic Mixing Angle $θ_{23}$ and its Implications for the Flavor Models**, Son Cao et.al., [2409.11824v1](http://arxiv.org/abs/2409.11824v1)\n\n Among three leptonic mixing angles, $\\theta\\_{23}$ angle, which characterizes the fractional contribution of two flavor eigenstates $\\nu\\_{\\mu}$ and $\\nu\\_{\\tau}$ to the third mass eigenstate $\\nu\\_3$, is known to be the largest but the least precisely measured. The work investigates possible reach of $\\theta\\_{23}$ precision with two upcoming gigantic accelerator-based long-baseline neutrino experiments, namely Hyper-Kamiokande and DUNE experiments as well as a possible joint analyses of future neutrino facilities. Our simulation yields that each experiment will definitely establish the octant of $\\theta\\_{23}$ angle for all values within 1$\\sigma$ parameter interval, while considering the current limitation. However, if the actual value is $0.48\\leq \\sin^2\\theta\\_{23}\\leq 0.54$, it becomes challenging for these two experiments to reject the maximal ($\\theta\\_{23}=\\pi/4$) hypothesis and conclude its octant. This octant-blind region can be further explored with the proposed facilities ESSnuSB and a neutrino factory. Accurate determination of the mixing angle $\\theta\\_{23}$, as well as the accuracy of $\\delta\\_{CP}$, is crucial for examining a certain category of discrete non-Abelian leptonic flavor models. Specifically if CP is conserved in leptonic sector, the combined analysis of Hyper-K and DUNE will rule out the majority of these models. However, if the CP is maximally violated, higher precision of $\\delta\\_{CP}$ is necessary for testing these flavor models.\n\n", "2409.11818": "2024-09-18, **Multimessenger astronomy**, V. Rozhkov et.al., [2409.11818v1](http://arxiv.org/abs/2409.11818v1)\n\n This brief review is based on a lecture given by one of the authors at the international youth conference AYSS-2023. It is devoted to multimessenger astronomy, which studies astrophysical objects and phenomena using various particles and waves that bring information from space. The messengers include electromagnetic and gravitational waves, neutrinos, and cosmic rays. We discuss new opportunities that open up with the combined use of several carriers of information. Combination of data obtained through various observation channels allows one to obtain more complete and accurate information about the processes occurring in the Universe, and even to use it for studying fundamental physics.\n\n"}, "dark matter": {"2409.12004": "2024-09-18, **First confirmation of anisotropic bias from statistically anisotropic matter distributions**, Shogo Masaki et.al., [2409.12004v1](http://arxiv.org/abs/2409.12004v1)\n\n We confirm for the first time the existence of distinctive halo bias associated with the quadrupolar type of statistical anisotropy (SA) of the linear matter density field using cosmological $N$-body simulations. We find that the coefficient of the SA-induced bias for cluster-sized halos takes negative values and exhibits a decreasing trend with increasing halo mass. This results in the quadrupole halo power spectra in a statistically anisotropic universe being less amplified compared to the monopole spectra. The anisotropic feature in halo bias that we found presents a promising new tool for testing the hypothesis of a statistically anisotropic universe, with significant implications for the precise verification of anisotropic inflation scenarios and vector dark matter and dark energy models.\n\n", "2409.11777": "2024-09-18, **First search for axion dark matter with a Madmax prototype**, B. Ary dos Santos Garcia et.al., [2409.11777v1](http://arxiv.org/abs/2409.11777v1)\n\n This paper presents the first search for dark matter axions with mass in the ranges 76.56 to 76.82 $\\mu$eV and 79.31 to 79.53 $\\mu$eV using a prototype setup for the MAgnetized Disk and Mirror Axion eXperiment (MADMAX). The experimental setup employs a dielectric haloscope consisting of three sapphire disks and a mirror to resonantly enhance the axion-induced microwave signal within the magnetic dipole field provided by the 1.6 T Morpurgo magnet at CERN. Over 14.5 days of data collection, no axion signal was detected. A 95% CL upper limit on the axion-photon coupling strength down to $\\|g\\_{a\\gamma}\\| \\sim 2 \\times 10^{-11} \\mathrm{GeV}^{-1}$ is set in the targeted mass ranges, surpassing previous constraints, assuming a local axion dark matter density $\\rho\\_{a}$ of $0.3~\\mathrm{GeV}/\\mathrm{cm}^3$. This study marks the first axion dark matter search using a dielectric haloscope.\n\n"}, "supernova": {"2409.12185": "2024-09-18, **Disruption of a massive molecular cloud by a supernova in the Galactic Centre: Initial results from the ACES project**, M. Nonhebel et.al., [2409.12185v1](http://arxiv.org/abs/2409.12185v1)\n\n The Milky Way's Central Molecular Zone (CMZ) differs dramatically from our local solar neighbourhood, both in the extreme interstellar medium conditions it exhibits (e.g. high gas, stellar, and feedback density) and in the strong dynamics at play (e.g. due to shear and gas influx along the bar). Consequently, it is likely that there are large-scale physical structures within the CMZ that cannot form elsewhere in the Milky Way. In this paper, we present new results from the Atacama Large Millimeter/submillimeter Array (ALMA) large programme ACES (ALMA CMZ Exploration Survey) and conduct a multi-wavelength and kinematic analysis to determine the origin of the M0.8$-$0.2 ring, a molecular cloud with a distinct ring-like morphology. We estimate the projected inner and outer radii of the M0.8$-$0.2 ring to be 79\" and 154\", respectively (3.1 pc and 6.1 pc at an assumed Galactic Centre distance of 8.2 kpc) and calculate a mean gas density $> 10^{4}$ cm$^{-3}$, a mass of $\\sim$ $10^6$ M$\\_\\odot$, and an expansion speed of $\\sim$ 20 km s$^{-1}$, resulting in a high estimated kinetic energy ($> 10^{51}$ erg) and momentum ($> 10^7$ M$\\_\\odot$ km s$^{-1}$). We discuss several possible causes for the existence and expansion of the structure, including stellar feedback and large-scale dynamics. We propose that the most likely cause of the M0.8$-$0.2 ring is a single high-energy hypernova explosion. To viably explain the observed morphology and kinematics, such an explosion would need to have taken place inside a dense, very massive molecular cloud, the remnants of which we now see as the M0.8$-$0.2 ring. In this case, the structure provides an extreme example of how supernovae can affect molecular clouds.\n\n", "2409.12118": "2024-09-18, **The Low-Redshift Lyman Continuum Survey: The Roles of Stellar Feedback and ISM Geometry in LyC Escape**, Sophia R. Flury et.al., [2409.12118v1](http://arxiv.org/abs/2409.12118v1)\n\n One of the fundamental questions of cosmology is the origin and mechanism(s) responsible for the reionization of the Universe beyond $z\\sim6$. To address this question, many studies over the past decade have focused on local ($z\\sim0.3$) galaxies which leak ionizing radiation (Lyman continuum or LyC). However, line-of-sight effects and data quality have prohibited deeper insight into the nature of LyC escape. To circumvent these limitations, we analyze stacks of a consolidated sample of {\\it HST}/COS observations of the LyC in 89 galaxies at $z\\sim0.3$. From fitting of the continuum, we obtain information about the underlying stellar populations and neutral ISM geometry. We find that most LyC non-detections are not leaking appreciable LyC ($f\\_{esc}^{\\rm LyC}<1$\\%) but also that exceptional cases point to spatial variations in the LyC escape fraction $f\\_{esc}^{\\rm LyC}$. Stellar populations younger than 3 Myr lead to an increase in ionizing feedback, which in turn increases the isotropy of LyC escape. Moreover, mechanical feedback from supernovae in 8-10 Myr stellar populations is important for anisotropic gas distributions needed for LyC escape. While mechanical feedback is necessary for any LyC escape, high $f\\_{esc}^{\\rm LyC}$ ($>5$\\%) also requires a confluence of young stars and ionizing feedback. A two-stage burst of star formation could facilitate this optimal LyC escape scenario.\n\n", "2409.11991": "2024-09-18, **Multi-field TDiff theories for cosmology**, Diego Tessainer et.al., [2409.11991v1](http://arxiv.org/abs/2409.11991v1)\n\n We consider theories which break the invariance under diffeomorphisms (Diff) down to transverse diffeomorphisms (TDiff) in the matter sector, consisting of multiple scalar fields. In particular, we regard shift-symmetric models with two free TDiff scalar fields in a flat Robertson-Walker spacetime and use the perfect fluid approach to study their dynamics. As a consequence of the symmetry breaking, an effective interaction between the fields is induced from the conservation of the total energy-momentum tensor, without the necessity to introduce any explicit interacting term in the Lagrangian. We study the different single-field domination regimes and analyze the energy exchange between the fields. Thereupon, we introduce an application of these models for the description of interactions in the dark sector, and compare the theoretical predictions of our model to observational data from Type Ia supernovae.\n\n"}}