{"neutrino": {"2403.19574": "2024-03-28, **Measurement of double-differential cross sections for mesonless charged-current muon neutrino interactions on argon with final-state protons using the MicroBooNE detector**, MicroBooNE collaboration et.al., [2403.19574v1](http://arxiv.org/abs/2403.19574v1)\n\n Charged-current neutrino interactions with final states containing zero mesons and at least one proton are of high interest for current and future accelerator-based neutrino oscillation experiments. Using the Booster Neutrino Beam and the MicroBooNE detector at Fermi National Accelerator Laboratory, we have obtained the first double-differential cross section measurements of this channel for muon neutrino scattering on an argon target with a proton momentum threshold of 0.25 GeV/c. We also report a flux-averaged total cross section of $\\sigma = (11.8 \\pm 1.2) \\times 10^{-38}$ cm$^2$ / Ar and several single-differential measurements which extend and improve upon previous results. Statistical and systematic uncertainties are quantified with a full treatment of correlations across 359 kinematic bins, including correlations between distributions describing different observables. The resulting data set provides the most detailed information obtained to date for testing models of mesonless neutrino-argon scattering.\n\n", "2403.19532": "2024-03-28, **Measuring Solar Neutrinos in the SNO+ Detector**, Daniel Cookman et.al., [2403.19532v1](http://arxiv.org/abs/2403.19532v1)\n\n The SNO+ experiment is a large multi-purpose neutrino detector, currently filled with liquid scintillator. For the first time in a single experiment, SNO+ is able to measure the neutrino oscillation parameters $\\theta\\_{12}$ and $\\Delta m^{2}\\_{21}$ simultaneously through both reactor anti-neutrinos and $^{8}B$ solar neutrinos. The latter approach is demonstrated here, with an analysis of an initial 80 days of scintillator phase data. A Bayesian statistical approach via Markov Chain Monte Carlo is used, allowing for the simultaneous fitting of the oscillation parameters, $^{8}B$ neutrino flux, background components with constraints, and systematic uncertainties. The neutrino oscillation parameter $\\theta\\_{12}$ was measured to be $38.9^{\\circ+8.0^{\\circ}}\\_{-7.9^{\\circ}}$, assuming the current global fit flux of $^{8}B$ solar neutrinos. This is consistent with the current global fit result for $\\theta\\_{12}$. A sensitivity study shows that this measurement is statistics-limited, and precision could be improved by a factor of two with two years of livetime, assuming the same backgrounds and selections.\n\n", "2403.19384": "2024-03-28, **Impact of JLab data on the determination of GPDs at zero skewness and new insights from transition form factors $ N\\rightarrow Δ$**, The MMGPDs Collaboration et.al., [2403.19384v1](http://arxiv.org/abs/2403.19384v1)\n\n It is well established now that the generalized parton distributions (GPDs) at zero skewness are playing important roles in some physical process such as elastic electron-nucleon scattering, elastic (anti)neutrino-nucleon scattering, and wide-angle Compton scattering (WACS) via various types of form factors (FFs). In this study, we are going to utilize the recent JLab measurements of the elastic electron-nucleon scattering reduced cross-section, namely GMp12, as a touchstone to unravel the tension observed between the measurements of the WACS cross-section and the data of the proton magnetic FF $ G\\_M^p $. We also investigate the impact of GMp12 data on valence unpolarized GPDs $ H\\_v^q $ and $ E\\_v^q $ at zero skewness by performing some $ \\chi^2 $ analyses of the related experimental data. By calculating the electric and scalar quadrupole ratios, $ R\\_{EM} $ and $ R\\_{SM} $, and magnetic transition FF $ G^*\\_M/3G\\_D $ related to the nucleon-to-delta ($ N\\rightarrow \\Delta $) transition using the extracted GPDs and comparing the results with corresponding experimental measurements, we show that our results are in an excellent consistency with experiments, indicating the universality property of GPDs. We emphasize that the inclusion of these data in the future analysis of GPDs can significantly the extracted GPDs especially their uncertainties at smaller values of $ Q^2 $.\n\n", "2403.19351": "2024-03-28, **The SNO+ Journey to 0νββ**, A. S. Inácio et.al., [2403.19351v1](http://arxiv.org/abs/2403.19351v1)\n\n SNO+ is a large multipurpose experiment with the ultimate goal of searching for the neutrinoless double beta decay in $^{130}\\mathrm{Te}$. After a commissioning phase with water as the target medium, during which acquired data allowed for measurements of solar neutrinos and the detection of reactor antineutrinos, SNO+ is now filled with 780 tonnes of liquid scintillator. The higher light yield of the scintillator enhances the physics capabilities of the experiment, and a physics program including reactor, geo and solar neutrinos is currently underway. The water and unloaded scintillator phases provide crucial commissioning milestones in preparation for the tellurium loading, such as calibrating the detector and making extensive background constraint measurements as components of the final scintillator cocktail are gradually added. In a first phase, 3900~kg of natural tellurium (0.5\\%) will be added to the scintillator for a predicted sensitivity of about $2\\times20^{26}$ years (90\\% CL) with 3 years of livetime. Higher tellurium loading will follow for predicted sensitivities above $1\\times10^{27}$ years (3\\% loading).\n\n", "2403.19338": "2024-03-28, **Introducing scalar leptoquarks into a 3-3-1 model to solve the $(g-2)_μ$ puzzle**, A. Doff et.al., [2403.19338v1](http://arxiv.org/abs/2403.19338v1)\n\n In this work we introduce scalar leptoquarks into the 3-3-1 model with right-handed neutrinos with the aim of solving the $(g-2)\\_{\\mu}$ puzzle. We show that besides the model supports leptoquarks in the octet, sextet, triplet and singlet representations, we identified that only one specif leptoquark in the singlet representation leads to flip of chirality as required to generate positive and robust contribution to the $(g-2)\\_\\mu$. Then we calculate its contributions to $(g-2)\\_\\mu$ and to the decay process $\\mu \\rightarrow e \\gamma$ and discuss the results.\n\n", "2403.19038": "2024-03-27, **Cosmic Neutrino Decoupling and its Observable Imprints: Insights from Entropic-Dual Transport**, J. Richard Bond et.al., [2403.19038v1](http://arxiv.org/abs/2403.19038v1)\n\n Very different processes characterize the decoupling of neutrinos to form the cosmic neutrino background (C$\\nu$B) and the much later decoupling of photons from thermal equilibrium to form the cosmic microwave background (CMB). The C$\\nu$B emerges from the fuzzy, energy-dependent neutrinosphere and encodes the physics operating in the early universe in the temperature range $T\\sim 10\\,{\\rm MeV}$ to $T\\sim10\\,{\\rm keV}$. This is the epoch where beyond Standard Model (BSM) physics may be influential in setting the light element abundances and the necessarily distorted fossil neutrino energy spectra. Here we use techniques honed in extensive CMB studies to analyze the C$\\nu$B as calculated in detailed neutrino energy transport and nuclear reaction simulations. Our moment method, relative entropy, and differential visibility approach can leverage future high precision CMB and primordial abundance measurements to provide new insights into the C$\\nu$B and any BSM physics it encodes. We demonstrate that the evolution of the energy spectrum of the C$\\nu$B throughout the weak decoupling epoch is accurately captured in the Standard Model by only three parameters per species, a non-trivial conclusion given the deviation from thermal equilibrium. Furthermore, we can interpret each of the three parameters as physical characteristics of a non-equilibrium system. The success of our compact description within the Standard Model motivates its use also in BSM scenarios. We demonstrate how observations of primordial light element abundances can be used to place constraints on the C$\\nu$B energy spectrum, deriving response functions that can be applied for general C$\\nu$B spectral distortions. Combined with the description of those deviations that we develop here, our methods provide a convenient and powerful framework to constrain the impact of BSM physics on the C$\\nu$B.\n\n", "2403.18952": "2024-03-27, **Supernova Simulations**, Bernhard Müller et.al., [2403.18952v1](http://arxiv.org/abs/2403.18952v1)\n\n Magnetohydrodynamic simulations of core-collapse supernovae have become increasingly mature and important in recent years. Magnetic fields take center stage in scenarios for explaining hypernova explosions, but are now also considered in supernova theory more broadly as an important factor even in neutrino-driven explosions, especially in the context of neutron star birth properties. Here we present an overview of simulation approaches currently used for magnetohydrodynamic supernova simulations and sketch essential physical concepts for understanding the role of magnetic fields in supernovae of slowly or rapidly rotating massive stars. We review progress on simulations of neutrino-driven supernovae, magnetorotational supernovae, and the relevant field amplification processes. Recent results on the nucleosynthesis and gravitational wave emission from magnetorotational supernovae are also discussed. We highlight efforts to provide better initial conditions for magnetohydrodynamic supernova models by simulating short phases of the progenitor evolution in 3D to address uncertainties in the treatment of rotation and magnetic fields in current stellar evolution models.\n\n", "2403.18732": "2024-03-27, **Identifying CP Basis Invariants in SMEFT**, Neda Darvishi et.al., [2403.18732v1](http://arxiv.org/abs/2403.18732v1)\n\n Building on our automated framework that uses ring diagrams for classifying CP basis invariants [1], this paper broadens the application of the methodology with more extensive examples and a wider scope of theoretical frameworks. Here, we showcase its versatility through detailed analyses in the Standard Model Effective Field Theory (SMEFT) up to dim-2n, and SMEFT with sterile neutrinos ({\\nu}SMEFT) up to dimension-7. By integrating the ring-diagram technique with the Cayley-Hamilton theorem, we have developed a system that not only simplifies the process of identifying basic and joint invariants but also enables the automatic differentiation between CP-even and CP-odd invariants from the lowest orders. Additionally, this work presents a comparison of our results with those derived using the traditional Hilbert-Poincar\\'e series and its Plethystic logarithm. While these conventional approaches primarily yield the numerical count of invariants, our framework provides a complete structure of invariants, thereby surpassing the limitations of these traditional methods.\n\n", "2403.18656": "2024-03-27, **Late-forming black holes and the antiproton, gamma-ray, and anti-helium excesses**, Mrunal Korwar et.al., [2403.18656v1](http://arxiv.org/abs/2403.18656v1)\n\n Black holes long-lived enough to be the dark matter have temperatures below the MeV. Since Hawking evaporation is a quasi-thermal process, no GeV emission is predicted to be produced by black holes if they are part, or all, of the cosmological dark matter. However, black holes could be ``spawned'' at late times with masses that correspond to short lifetimes, and as such be significantly hotter and produce particles well in excess of the GeV. Here, we show that such late-forming black holes could, at once, explain the tantalizing excesses found in the gamma radiation from the Galactic center, in the flux of cosmic-ray antiproton, and in the few tentative antihelium events reported by the anti-matter spectrometer AMS-02. We compute accurate predictions for the anti-deuteron, high-energy neutrino, and positron fluxes if this scenario is realized in nature. We find that while the neutrino and positron fluxes are too small compared to the expected background, a significant number of anti-deuteron events is expected both at AMS-02 and at the future General AntiParticle Spectrometer (GAPS).\n\n", "2403.18630": "2024-03-27, **Flavored leptogenesis from a sudden mass gain of right-handed neutrinos**, Zhen-hua Zhao et.al., [2403.18630v1](http://arxiv.org/abs/2403.18630v1)\n\n In this paper, we would like to point out that in the scenario that the right-handed neutrinos suddenly gain some masses much larger than the temperature of the Universe at that time so that the washout effects for the generated lepton asymmetry can be safely neglected, the flavored leptogenesis (which crucially rely on the flavor non-universality of the washout effects) cannot work in the usual way any more. For this problem, we put forward that the flavor non-universality of the conversion efficiencies from the lepton asymmetry to the baryon asymmetry via the sphaleron processes may play a crucial role. And we will study if the requisite baryon asymmetry can be successfully reproduced from such a mechanism in the scenarios that the right-handed neutrino masses are hierarchical and nearly degenerate, respectively. A detailed study shows that this mechanism can be viable in both these two scenarios.\n\n"}, "dark matter": {"2403.19604": "2024-03-28, **More on Black Holes Perceiving the Dark Dimension**, Luis A. Anchordoqui et.al., [2403.19604v1](http://arxiv.org/abs/2403.19604v1)\n\n In the last two years the dark dimension scenario has emerged as focal point of many research interests. In particular, it functions as a stepping stone to address the cosmological hierarchy problem and provides a colosseum for dark matter contenders. We reexamine the possibility that primordial black holes (PBHs) perceiving the dark dimension could constitute all of the dark matter in the universe. We re-assess limits on the abundance of PBHs as dark matter candidates from $\\gamma$-ray emission resulting from Hawking evaporation. We re-evaluate constraints from the diffuse $\\gamma$-ray emission in the direction of the Galactic center which offer the best and most solid upper limits on the dark matter fraction composed of PBHs. The revised mass range which allows PBHs to assemble all cosmological dark matter is estimated to be $10^{15} \\alt M\\_{\\rm BH}/{\\rm g} \\alt 10^{21}$. We demonstrate that due to the constraints from $\\gamma$-ray emission, quantum corrections due to the speculative memory burden effect do not modify this mass range. We also investigate the main characteristics of PBHs which are localized in the bulk. We show that PBHs localized in the bulk can make all cosmological dark matter if $10^{11} \\alt M\\_{\\rm BH}/{\\rm g} \\alt 10^{21}$. Finally, we comment on the black holes that could be produced if one advocates a space with two boundaries for the dark dimension.\n\n", "2403.19598": "2024-03-28, **Implications of purity constraints on light higgsinos**, Stephen P. Martin et.al., [2403.19598v1](http://arxiv.org/abs/2403.19598v1)\n\n The lightest supersymmetric particles could be higgsinos that have a small mixing with gauginos. If the lightest higgsino-like state makes up some or all of the dark matter with a thermal freezeout density, then its mass must be between about 100 and 1150 GeV, and dark matter searches put bounds on the amount of gaugino contamination that it can have. Motivated by the generally good agreement of flavor- and CP-violating observables with Standard Model predictions, I consider models in which the scalar particles of minimal supersymmetry are heavy enough to be essentially decoupled, except for the 125 GeV Higgs boson. I survey the resulting purity constraints as lower bounds on the gaugino masses and upper bounds on the higgsino mass splittings. I also discuss the mild excesses in recent soft lepton searches for charginos and neutralinos at the LHC, and show that they can be accommodated in these models if $\\tan\\beta$ is small and $\\mu$ is negative.\n\n", "2403.19590": "2024-03-28, **Non-Linear Matter Power Spectrum Modeling in Interacting Dark Energy Cosmologies**, Emanuelly Silva et.al., [2403.19590v1](http://arxiv.org/abs/2403.19590v1)\n\n Understanding the behavior of the matter power spectrum on non-linear scales beyond the $\\Lambda$CDM model is crucial for accurately predicting the large-scale structure (LSS) of the Universe in non-standard cosmologies. In this work, we present an analysis of the non-linear matter power spectrum within the framework of interacting dark energy-dark matter cosmologies (IDE). We employ N-body simulations and theoretical models to investigate the impact of IDE on these non-linear scales. Beginning with N-body simulations characterized by a fixed parameter space delineated by prior observational research, we adeptly fit the simulated spectra with a simple parametric function, achieving accuracy within 5\\%. Subsequently, we refine a modified halo model tailored to the IDE cosmology, exhibiting exceptional precision in fitting the simulations down to scales of approximately 1 h/Mpc. To assess the model's robustness, we conduct a forecast analysis for the Euclid survey, employing our refined model. We find that the coupling parameter $\\xi$ will be constrained to $\\sigma(\\xi) = 0.0046$. This marks a significant improvement by an order of magnitude compared to any other current observational tests documented in the literature. These primary findings pave the way for a novel preliminary approach, enabling the utilization of IDE models for observational constraints concerning LSS data on non-linear scales.\n\n", "2403.19552": "2024-03-28, **Probing the dark Universe with gravitational waves**, Antonio Enea Romano et.al., [2403.19552v1](http://arxiv.org/abs/2403.19552v1)\n\n Gravitational waves (GW) are expected to interact with dark energy and dark matter, affecting their propagation on cosmological scales. In order to model this interaction, we derive a gauge invariant effective equation and action valid for all GWs polarizations, based on encoding the effects of the interaction of GWs at different order in perturbations, in a polarization, frequency and time dependent effective speed. The invariance of perturbations under time dependent conformal transformations and the gauge invariance of the GWs allow to obtain the unitary gauge effective action in any conformally related frame, making transparent the relation between Einstein and Jordan frame. The propagation time and luminosity distance of different GWs polarizations allow to probe at different frequencies and redshift the dark Universe, which act as an effective medium, whose physical properties can be modeled by the GWs effective speed.\n\n", "2403.19337": "2024-03-28, **The Hierarchical Cosmic Web and Assembly Bias**, J. M. Coloma-Nadal et.al., [2403.19337v1](http://arxiv.org/abs/2403.19337v1)\n\n Accurate modeling of galaxy distributions is paramount for cosmological analysis using galaxy redshift surveys. However, this endeavor is often hindered by the computational complexity of resolving the dark matter halos that host these galaxies. To address this challenge, we propose the development of effective assembly bias models down to small scales, i.e., going beyond the local density dependence capturing non-local cosmic evolution. We introduce a hierarchical cosmic web classification that indirectly captures up to third-order long- and short-range non-local bias terms. This classification system also enables us to maintain positive definite parametric bias expansions. Specifically, we subdivide the traditional cosmic web classification, which is based on the eigenvalues of the tidal field tensor derived, with an additional classification based on the Hessian matrix of the negative density contrast. We obtain the large-scale dark matter field on a mesh with $\\sim3.9\\,h^{-1}$ Mpc cell side resolution through Augmented Lagrangian Perturbation Theory. To assess the effectiveness of our model, we conduct tests using a reference halo catalogue extracted from the UNIT project simulation, which was run within a cubical volume of 1 $h^{-1}$ Gpc side. The resulting mock halo catalogs, generated trough our approach, exhibit a high level of accuracy in terms of the one-, two- and three-point statistics. They reproduce the reference power spectrum within better than 2 percent accuracy up to wavenumbers $k\\sim0.8\\,h$ Mpc$^{-1}$ and provide accurate bispectra within the scales that are crucial for cosmological analysis. This effective bias approach provides a forward model appropriate for field-level cosmological inference and holds significant potential for facilitating cosmological analysis of galaxy redshift surveys, particularly in the context of projects such as DESI, EUCLID, and LSST.\n\n", "2403.19236": "2024-03-28, **Measuring the baryon fraction using galaxy clustering**, Alex Krolewski et.al., [2403.19236v1](http://arxiv.org/abs/2403.19236v1)\n\n The amplitude of the baryon signature in galaxy clustering depends on the cosmological baryon fraction. We consider two ways to isolate this signal in galaxy redshift surveys. First, we extend standard template-based Baryon Acoustic Oscillation (BAO) models to include the amplitude of the baryonic signature by splitting the transfer function into baryon and cold dark matter components with freely varying proportions. Second, we include the amplitude of the split as an extra parameter in Effective Field Theory (EFT) models of the full galaxy clustering signal. We find similar results from both approaches. For the Baryon Oscillation Spectroscopic Survey (BOSS) data we find $f\\_b\\equiv\\Omega\\_b/\\Omega\\_m=0.173\\pm0.027$ for template fits post-reconstruction, $f\\_b=0.153\\pm0.029$ for template fits pre-reconstruction, and $f\\_b=0.154\\pm0.022$ for EFT fits, with an estimated systematic error of 0.013 for all three methods. Using reconstruction only produces a marginal improvement for these measurements. Although significantly weaker than constraints on $f\\_b$ from the Cosmic Microwave Background, these measurements rely on very simple physics and, in particular, are independent of the sound horizon. In a companion paper we show how they can be used, together with Big Bang Nucleosynthesis measurements of the physical baryon density and geometrical measurements of the matter density from the Alcock-Paczynski effect, to constrain the Hubble parameter. While the constraints on $H\\_0$ based on density measurements from BOSS are relatively weak, measurements from DESI and Euclid will lead to errors on $H\\_0$ that are competitive with those from local distance ladder measurements.\n\n", "2403.19015": "2024-03-27, **Constraints on Primordial Black Holes from $N$-body simulations of the Eridanus II Stellar Cluster**, Julia Monika Koulen et.al., [2403.19015v1](http://arxiv.org/abs/2403.19015v1)\n\n The tidal disruption of old, compact stellar structures provides strong constraints on macroscopic dark matter candidates such as primordial black holes. In view of recent, new observational data on the Eridanus II dwarf galaxy and on its central stellar cluster, we employ, for the first time, $N$-body simulations to assess the impact of compact massive dark matter candidates on the gravitational stability of the cluster. We find evidence that such candidates must be lighter than about one solar mass if they constitute the totality of the dark matter. We additionally derive robust constraints on the fraction of the dark matter in macroscopic objects as a function of mass, by suitably modeling the remainder of the dark matter as standard fluid-like cold dark matter.\n\n", "2403.18895": "2024-03-27, **Feedback in the dark: a critical examination of CMB bounds on primordial black holes**, Dominic Agius et.al., [2403.18895v1](http://arxiv.org/abs/2403.18895v1)\n\n If present in the early universe, primordial black holes (PBHs) will accrete matter and emit high-energy photons, altering the statistical properties of the {Cosmic Microwave Background (CMB)}. This mechanism has been used to constrain the fraction of dark matter that is in the form of PBHs to be much smaller than unity for PBH masses well above one solar mass. Moreover, the presence of dense dark matter mini-halos around the PBHs has been used to set even more stringent constraints, as these would boost the accretion rates. In this work, we critically revisit CMB constraints on PBHs taking into account the role of the local ionization of the gas around them. We discuss how the local increase in temperature around PBHs can prevent the dark matter mini-halos from strongly enhancing the accretion process, in some cases significantly weakening previously derived CMB constraints. We explore in detail the key ingredients of the CMB bound and derive a conservative limit on the cosmological abundance of massive PBHs.\n\n", "2403.18893": "2024-03-27, **Limits on Early Matter Domination from the Isotropic Gamma-Ray Background**, Himanish Ganjoo et.al., [2403.18893v1](http://arxiv.org/abs/2403.18893v1)\n\n In cosmologies with hidden sector dark matter, the lightest hidden sector species can come to dominate the energy budget of the universe and cause an early matter-dominated era (EMDE). EMDEs amplify the matter power spectrum on small scales, leading to dense, early-forming microhalos which massively boost the dark matter annihilation signal. We use the Fermi-LAT measurement of the isotropic gamma-ray background to place limits on the parameter space of hidden sector models with EMDEs. We calculate the amplified annihilation signal by sampling the properties of prompt cusps, which reside at the centers of these microhalos and dominate the signal on account of their steep $\\rho\\propto r^{-3/2}$ density profiles. We also include the portions of the parameter space affected by the gravitational heating that arises from the formation and subsequent destruction of nonlinear structure during the EMDE. We are able to rule out significant portions of the parameter space, particularly at high reheat temperatures. Long EMDEs remain poorly constrained despite large structure-induced boosts to the annihilation signal.\n\n", "2403.18789": "2024-03-27, **Constraining primordial non-Gaussianity from the large scale structure two-point and three-point correlation functions**, Z. Brown et.al., [2403.18789v1](http://arxiv.org/abs/2403.18789v1)\n\n Surveys of cosmological large-scale structure (LSS) are sensitive to the presence of local primordial non-Gaussianity (PNG), and may be used to constrain models of inflation. Local PNG, characterized by fNL, the amplitude of the quadratic correction to the potential of a Gaussian random field, is traditionally measured from LSS two-point and three-point clustering via the power spectrum and bi-spectrum. We propose a framework to measure fNL using the configuration space two-point correlation function (2pcf) monopole and three-point correlation function (3pcf) monopole of survey tracers. Our model estimates the effect of the scale-dependent bias induced by the presence of PNG on the 2pcf and 3pcf from the clustering of simulated dark matter halos. We describe how this effect may be scaled to an arbitrary tracer of the cosmological matter density. The 2pcf and 3pcf of this tracer are measured to constrain the value of fNL. Using simulations of luminous red galaxies observed by the Dark Energy Spectroscopic Instrument (DESI), we demonstrate the accuracy and constraining power of our model, and forecast the ability to constrainfNL to a precision of sigma(fNL) = 22 with one year of DESI survey data.\n\n", "2403.18740": "2024-03-27, **Effects of Dark Matter on $f$-mode oscillations of Neutron Stars**, Swarnim Shirke et.al., [2403.18740v1](http://arxiv.org/abs/2403.18740v1)\n\n The aim of this study is to investigate the effect of dark matter (DM) on $f$-mode oscillations in DM admixed neutron stars (NSs). We consider hadronic matter modeled by the relativistic mean field model and the DM model based on the neutron decay anomaly. We study the non-radial $f$-mode oscillations for such DM admixed NS in a full general relativistic framework. We investigate the impact of DM, DM self-interaction, and DM fraction on the $f$-mode characteristics. We derive relations encoding the effect of DM on $f$-mode parameters. We then perform a systematic study by varying all the model parameters within their known uncertainty range and obtain a universal relation for the DM fraction based on the total mass of the star and DM self-interaction strength. We also perform a correlation study among model parameters and NS observables, in particular, $f$-mode parameters. Finally, we check the $f$-mode universal relations (URs) for the case of DM admixed NSs and demonstrate the existence of a degeneracy between purely hadronic NSs and DM admixed NSs.\n\n", "2403.18648": "2024-03-27, **Can the splashback radius be an observable boundary of galaxy clusters?**, Théo Lebeau et.al., [2403.18648v1](http://arxiv.org/abs/2403.18648v1)\n\n The splashback radius was proposed as a physically motivated boundary of clusters as it sets the limit between the infalling and the orbitally dominated regions. However, galaxy clusters are complex objects connected to filaments of the cosmic web from which they accrete matter that disturbs them and modifies their morphology. In this context, estimating the splashback radius and the cluster boundary becomes challenging. In this work, we use a constrained hydrodynamical simulation of the Virgo cluster's replica embedded in its large-scale structure to investigate the impact of its local environment on the splashback radius estimate. We identify the splashback radius from 3D radial profiles of dark matter density, baryons density, and pressure in three regions representative of different dynamical states: accretion from spherical collapse, filaments, and matter outflow. We also identify the splashback radius from 2D-projected radial profiles of observation-like quantities: mass surface density, emission measure, and Compton-y. We show that the splashback radius mainly depends on the dynamics in each region and the physical processes traced by the different probes. We find multiple values for the splashback radius ranging from 3.3$\\pm$0.2 to 5.5$\\pm$0.3 Mpc. Particularly, in the regions of collapsing and outflowing material, the splashback radii estimated from baryon density and pressure radial profiles overestimate that of the dark matter density profiles, which is considered the reference value originally defined from dark matter simulations. Consequently, caution is required when using the splashback radius as a boundary of clusters, particularly in the case of highly disturbed clusters like Virgo. We also discuss the detection of the splashback radius from pressure radial profiles, which could be more related to an accretion shock, and its detection from stacked radial profiles.\n\n", "2403.18529": "2024-03-27, **Velocity Distribution of Dark Matter Spike around Schwarzschild Black Holes and Effects on Gravitational Waves from EMRIs**, Zi-Chang Zhang et.al., [2403.18529v1](http://arxiv.org/abs/2403.18529v1)\n\n Dark matter (DM) constitutes the predominant portion of matter in our universe. Despite compelling evidence, the precise characteristics of DM remain elusive. Among the leading DM candidates are weakly interacting massive particles, which may aggregate into steep concentrations around the central black holes of galaxies, forming dense spikes. Employing Schwarzschild geometry, we assess the density and velocity distribution of DM within such spikes. Through variations in black hole masses and dark halo parameters, we identify universal features in the density profile of DM and fit them with Gaussian distributions. Additionally, we investigate the impact of dynamical friction on gravitational waves (GWs) generated by extreme-mass-ratio inspirals (EMRIs) within DM spikes. Our findings uncover phase shifts in the time-domain waveform, potentially providing significant insights for the GW-based detection of DM in galactic centers.\n\n"}, "supernova": {"2403.19357": "2024-03-28, **Radio imaging of gravitationally lensed radio-quiet quasars**, Neal Jackson et.al., [2403.19357v1](http://arxiv.org/abs/2403.19357v1)\n\n We present 6-GHz Very Large Array radio images of 70 gravitational lens systems at 300-mas resolution, in which the source is an optically-selected quasar, and nearly all of which have two lensed images. We find that about in half of the systems (40/70, with 33/70 secure), one or more lensed images are detected down to our detection limit of 20microJy/beam, similar to previous investigations and reinforcing the conclusion that typical optically-selected quasars have intrinsic GHz radio flux densities of a few microJy ($\\sim10^{23}$WHz$^{-1}$) at redshifts of 1--2. In addition, for ten cases it is likely that the lensing galaxies are detected in the radio. Available detections of, and limits on the far-infrared luminosities from the literature, suggest that nearly all of the sample lie on the radio-FIR correlation typical of star-forming galaxies, and that their radio luminosities are at least compatible with the radio emission being produced by star formation processes. One object, WISE2329$-$1258, has an extra radio component that is not present in optical images, and is difficult to explain using simple lens models. In-band spectral indices, where these can be determined, are generally moderately steep and consistent with synchrotron processes either from star-formation/supernovae or AGN. Comparison of the A/B image flux ratios at radio and optical wavelengths suggests a 10 per cent level contribution from finite source effects or optical extinction to the optical flux ratios, together with sporadic larger discrepancies that are likely to be due to optical microlensing.\n\n", "2403.19227": "2024-03-28, **A new method to determine $H_0$ from cosmological energy-density measurements**, Alex Krolewski et.al., [2403.19227v1](http://arxiv.org/abs/2403.19227v1)\n\n We introduce a new method for measuring the Hubble parameter from low-redshift large-scale observations that is independent of the comoving sound horizon. The method uses the baryon-to-photon ratio determined by the primordial deuterium abundance, together with Big Bang Nucleosynthesis (BBN) calculations and the present-day CMB temperature to determine the physical baryon density $\\Omega\\_b h^2$. The baryon fraction $\\Omega\\_b/\\Omega\\_m$ is measured using the relative amplitude of the baryonic signature in galaxy clustering measured by the Baryon Oscillation Spectroscopic Survey, scaling the physical baryon density to the physical matter density. The physical density $\\Omega\\_mh^2$ is then compared with the geometrical density $\\Omega\\_m$ from Alcock-Paczynski measurements from Baryon Acoustic Oscillations (BAO) and voids, to give $H\\_0$. Including type Ia supernovae and uncalibrated BAO, we measure $H\\_0 = 67.1^{+6.3}\\_{-5.3}$ km s$^{-1}$ Mpc$^{-1}$. We find similar results when varying analysis choices, such as measuring the baryon signature from the reconstructed correlation function, or excluding supernovae or voids. This measurement is currently consistent with both the distance-ladder and CMB $H\\_0$ determinations, but near-future large-scale structure surveys will obtain 3--4$\\times$ tighter constraints.\n\n", "2403.19029": "2024-03-27, **JWST Spectroscopy of SN H0pe: Classification and Time Delays of a Triply-imaged Type Ia Supernova at z = 1.78**, Wenlei Chen et.al., [2403.19029v1](http://arxiv.org/abs/2403.19029v1)\n\n SN H0pe is a triply imaged supernova (SN) at redshift $z=1.78$ discovered using the James Webb Space Telescope (JWST). In order to classify the SN spectroscopically and measure the relative time delays of its three images (designated A, B, and C), we acquired NIRSpec follow-up spectroscopy spanning 0.6 to 5 microns. From the high signal-to-noise spectra of the two bright images B and C, we first classify the SN, whose spectra most closely match those of SN 1994D and SN 2013dy, as a Type Ia SN. We identify prominent blueshifted absorption features corresponding to Si II $\\lambda6355$ and Ca II H $\\lambda3970$ and K $\\lambda3935$. We next measure the absolute phases of the three images from our spectra, which allows us to constrain their relative time delays. The absolute phases of the three images, determined by fitting the three spectra to Hsiao07 SN templates, are $6.5\\_{-1.8}^{+2.4}$d, $24.3\\_{-3.9}^{+3.9}$d, and $50.6\\_{-15.3}^{+16.1}$d for the brightest to faintest images. These correspond to relative time delays between Image A and Image B and between Image B and Image C of $-122.3\\_{-43.8}^{+43.7}$d and $49.3\\_{-14.7}^{+12.2}$d, respectively. The SALT3-NIR model yields phases and time delays consistent with these values. After unblinding, we additionally explored the effect of using Hsiao07 template spectra for simulations through eighty instead of sixty days past maximum, and found a small (11.5 and 1.0 days, respectively) yet statistically insignificant ($\\sim$0.25$\\sigma$ and $\\sim$0.1$\\sigma$) effect on the inferred image delays.\n\n", "2403.18954": "2024-03-27, **JWST Photometric Time-Delay and Magnification Measurements for the Triply-Imaged Type Ia \"Supernova H0pe\" at z = 1.78**, J. D. R. Pierel et.al., [2403.18954v1](http://arxiv.org/abs/2403.18954v1)\n\n Supernova (SN) H0pe is a gravitationally lensed, triply-imaged, Type Ia SN (SN Ia) discovered in James Webb Space Telescope imaging of the PLCK G165.7+67.0 cluster of galaxies. Well-observed multiply-imaged SNe provide a rare opportunity to constrain the Hubble constant ($H\\_0$), by measuring the relative time delay between the images and modeling the foreground mass distribution. SN H0pe is located at $z=1.783$, and is the first SN Ia with sufficient light curve sampling and long enough time delays for an $H\\_0$ inference. Here we present photometric time-delay measurements and SN properties of SN H0pe. Using JWST/NIRCam photometry we measure time delays of $\\Delta t\\_{ab}=-116.6^{+10.8}\\_{-9.3}$ and $\\Delta t\\_{cb}=-48.6^{+3.6}\\_{-4.0}$ observer-frame days relative to the last image to arrive (image 2b; all uncertainties are $1\\sigma$), which corresponds to a $\\sim5.6\\%$ uncertainty contribution for $H\\_0$ assuming $70 \\rm{km s^{-1} Mpc^{-1}}$. We also constrain the absolute magnification of each image to $\\mu\\_{a}=4.3^{+1.6}\\_{-1.8}$, $\\mu\\_{b}=7.6^{+3.6}\\_{-2.6}$, $\\mu\\_{c}=6.4^{+1.6}\\_{-1.5}$ by comparing the observed peak near-IR magnitude of SN H0pe to the non-lensed population of SNe Ia.\n\n", "2403.18911": "2024-03-27, **Ephemeral Flaring Transients Following Supernova Explosions in Black-Hole Binary Systems**, Davide Lazzati et.al., [2403.18911v1](http://arxiv.org/abs/2403.18911v1)\n\n The majority of massive stars are members of binary systems, a fraction of which is expected to remain bound after the first star goes off as a supernova. When the second star also explodes, the SN ejecta are bound to interact with the compact object companion. We explore the consequences of this interaction in the case of a black hole (BH) companion. We show that accretion of the SN ejecta by the BH generally occurs with highly super-Eddington rates, which can be strongly modulated if the ejecta are clumpy, as typically observed in supernova remnants. This late accretion produces transient flaring activity with a time delay from the SN explosion of days to months, depending on the orbital separation and the velocity of the ejecta. The flares are expected to have a non-thermal, broad band spectrum, but their high-frequency emission (UV and X-rays) would be absorbed within the remnant. Observed flares should therefore be in the optical and near-infrared. We propose this model as an explanation to the late-time flaring activity observed in the fast blue optical transient AT2022tsd.\n\n", "2403.18902": "2024-03-27, **SN H0pe: The First Measurement of $H_0$ from a Multiply-Imaged Type Ia Supernova, Discovered by JWST**, Massimo Pascale et.al., [2403.18902v1](http://arxiv.org/abs/2403.18902v1)\n\n The first James Webb Space Telescope ({\\it JWST}) Near InfraRed Camera (NIRCam) imaging in the field of the galaxy cluster PLCK G165.7+67.0 ($z=0.35$) uncovered a Type Ia supernova (SN~Ia) at $z=1.78$, called ``SN H0pe.\" Three different images of this one SN were detected as a result of strong gravitational lensing, each one traversing a different path in spacetime, thereby inducing a relative delay in the arrival of each image. Follow-up {\\it JWST} observations of all three SN images enabled photometric and rare spectroscopic measurements of the two relative time delays. Following strict blinding protocols which oversaw a live unblinding and regulated post-unblinding changes, these two measured time delays were compared to the predictions of seven independently constructed cluster lens models to measure a value for the Hubble constant, $H\\_0=71.8^{+9.8}\\_{-7.6}$~km~s$^{-1}$~Mpc$^{-1}$. The range of admissible $H\\_0$ values predicted across the lens models limits further precision, reflecting the well-known degeneracies between lens model constraints and time delays. It has long been theorized that a way forward is to leverage a standard candle, however this has not been realized until now. For the first time, the lens models are evaluated by their agreement with the SN absolute magnification, breaking these degeneracies and producing our best estimate, $H\\_0=75.4^{+8.1}\\_{-5.5}$~km~s$^{-1}$~Mpc$^{-1}$. This is the first precision measurement of $H\\_0$ from a multiply-imaged SN~Ia, and provides a measurement in a rarely utilized redshift regime. This result agrees with other local universe measurements, yet exceeds the value of $H\\_0$ derived from the early Universe with $\\gtrsim90\\%$ confidence, increasing evidence of the Hubble tension. With the precision provided by only four more events, this approach could solidify this disagreement to $>3\\sigma$.\n\n", "2403.18689": "2024-03-27, **Supernova Archaeology with X-Ray Binary Winds -- The Case of GRO J1655-40**, Noa Keshet et.al., [2403.18689v1](http://arxiv.org/abs/2403.18689v1)\n\n Supernovae are responsible for the elemental enrichment of the galaxy and some are postulated to leave behind a black hole. In a stellar binary system the supernova pollutes its companion, and the black hole can accrete back its own debris and emit X-rays. In this sequence of events, which is only poorly understood, winds are ejected, and observed through X-ray absorption lines. Measuring abundances of elements in the wind can lead to inferences about the historical explosion and possibly identify the long-gone progenitor of the compact object. Here, we re-analyze the uniquely rich X-ray spectrum of the 2005 outburst of GRO J1655-40. We reconstruct the absorption measure distribution (AMD) of the wind, and find that it increases sharply with ionization from H-like O up to H-like Ca, and then flattens out. The AMD is then used to measure relative abundances of 18 different elements. The present abundances are in partial agreement with a previous work with discrepancies mostly for low-Z elements. The overabundance of odd-Z elements hints at a high-metallicity, high-mass ($\\simeq25\\,M\\_\\odot$) progenitor. Interestingly, the abundances are different from those measured in the companion atmosphere, indicating that the wind entrains lingering ambient supernova debris. This can be expected since the current total stellar mass of the binary ($<10\\,M\\_\\odot$) is much less than the progenitor mass.\n\n"}}