{"neutrino": {"2407.03174": "2024-07-03, **$ν_μ$ and $ν_τ$ elastic scattering in Borexino**, Kevin J. Kelly et.al., [2407.03174v1](http://arxiv.org/abs/2407.03174v1)\n\n We perform a detailed study of neutrino-electron elastic scattering using the mono-energetic $^{7}$Be neutrinos in Borexino, with an emphasis on exploring the differences between the contributions of $\\nu\\_e$, $\\nu\\_\\mu$, and $\\nu\\_\\tau$. We find that current data are capable of measuring these components such that the contributions from $\\nu\\_\\mu$ and $\\nu\\_\\tau$ cannot be zero, although distinguishing between them is challenging -- the differences stemming from Standard Model radiative corrections are insufficient without significantly more precise measurements. In studying these components, we compare predicted neutrino-electron scattering event rates within the Standard Model (accounting for neutrino oscillations), as well as going beyond the Standard Model in two ways. We allow for non-unitary evolution to modify neutrino oscillations, and find that with a larger exposure (${\\sim}30$x), Borexino may provide relevant information for constraining non-unitarity, and that JUNO may be able to accomplish this with its data collection of $^{7}$Be neutrinos. We also consider novel $\\nu\\_\\mu$- and $\\nu\\_\\tau$-electron scattering from a gauged $U(1)\\_{L\\_\\mu - L\\_\\tau}$ model, showing consistency with previous analyses of Borexino and this scenario, but also demonstrating the impact of uncertainties on Standard Model mixing parameters on these results.\n\n", "2407.02795": "2024-07-03, **Nuclear shell model study of neutrinoless double beta decay under Left-Right symmetric model**, Dong-Liang Fang et.al., [2407.02795v1](http://arxiv.org/abs/2407.02795v1)\n\n We use the large scale nuclear shell model to calculate the nuclear matrix elements for the neutrino mediated neutrinoless double beta decay within the Left-Right symmetric model for four nuclei: $^{76}$Ge, $^{82}$Se, $^{130}$Te and $^{136}$Xe. We perform a systematic analysis on the general magnitude of different terms for related mechanisms. For the $\\eta$ mechanism, we find that the weak magnetism $R$ term dominates the decay rate while the $p$-wave effect is suppressed. While for the $\\lambda$ mechanism, the $\\omega$ and the $q$ terms are with equal importance. For the latter $q$ term, important contributions from weak-magnetism MM part are observed. Finally, we give the constraints on the new physics parameters $m\\_{\\beta\\beta}$, $\\lambda$ and $\\eta$ from current experiments.\n\n", "2407.02729": "2024-07-03, **Neutrino Lorentz invariance violation and ultralight axion-like dark matter searches at the European Spallation Source**, Rubén Cordero et.al., [2407.02729v1](http://arxiv.org/abs/2407.02729v1)\n\n The dark matter conundrum stands out as one of the central challenges to understand in both particle physics and cosmology. The ultralight axion-like particle (UALP) is an appealing dark matter candidate that can be searched for in neutrino oscillation experiments. In this work, we examined the interaction among neutrinos and a UALP; such interaction might induce violations of the Lorentz and $CPT$ symmetries. We assessed the sensitivity to both the isotropic $CPT-$odd Standard Model Extension (SME) coefficients $(a\\_{L})^T$ and effective neutrino-UALP couplings $\\tilde{g}$ at the next-to-next generation neutrino oscillation experiment at the European Spallation Source (ESS).\n\n"}, "dark matter": {"2407.02991": "2024-07-03, **Shaping Galaxies from the Beginning: Shaking the Cusp by Non-power-law Primordial Spectra**, M. V. Tkachev et.al., [2407.02991v1](http://arxiv.org/abs/2407.02991v1)\n\n We consider three cosmological models with non-power-law spectra of primordial density perturbations and test them against $\\Lambda$CDM in density profiles. We found that, despite the significant difference in initial conditions, the mean density profiles of all models are still close to the Navarro-Frenk-White one, albeit with some dispersion. We demonstrate that the density profile slopes in the innermost part of halo have a significant evolution with $z$, which can be used to identify the cosmological model. We also present a toy model resulting in the appearance of core in the central part of gravitationally bound dark matter halo.\n\n", "2407.02973": "2024-07-03, **NOEMA formIng Cluster survEy (NICE): Characterizing eight massive galaxy groups at $1.5 < z < 4$ in the COSMOS field**, Nikolaj B. Sillassen et.al., [2407.02973v1](http://arxiv.org/abs/2407.02973v1)\n\n The NOEMA formIng Cluster survEy (NICE) is a large program targeting 69 massive galaxy group candidates at $z>2$ in six deep fields. We report spectroscopic confirmation of eight groups at $1.65\\leq z\\leq3.61$ in COSMOS. Homogeneously selected as significant overdensities of red IRAC sources with red Herschel colors, four groups are confirmed by CO and [CI] with NOEMA 3mm observations, three are confirmed with ALMA, and one is confirmed by H$\\alpha$ from Subaru/FMOS. We constructed the integrated FIR SEDs for the eight groups, obtaining total IR SFR $=260-1300~{\\rm M\\_\\odot}$~yr$^{-1}$. We adopted six methods to estimate the dark matter masses, including stellar mass to halo mass relations, overdensity with galaxy bias, and NFW profile fitting to radial stellar mass density. We found the radial stellar mass density are consistent with a NFW profile, supporting that they are collapsed structures hosted by a single dark matter halo. The best halo mass estimates are $\\log(M\\_{\\rm h}/{\\rm M\\_\\odot})=12.8-13.7$ with uncertainty of 0.3 dex. From halo mass estimates, we derive baryonic accretion rate ${\\rm BAR}=(1-8)\\times10^{3}\\,{\\rm M\\_{\\odot}/yr}$ for this sample. We find a quasi-linear correlation between the integrated SFR/BAR and the theoretical halo mass limit for cold streams, $M\\_{\\rm stream}/M\\_{\\rm h}$, with ${\\rm SFR/BAR}=10^{-0.46\\pm0.22}\\left({M\\_{\\rm stream}/M\\_{\\rm h}}\\right)^{0.71\\pm0.16}$ with a scatter of $0.40\\,{\\rm dex}$. Further, we compare halo masses and stellar masses with simulations, and find all structures are consistent with being progenitors of $M\\_{\\rm h}(z=0)>10^{14}\\,{\\rm M\\_{\\odot}}$ galaxy clusters, and the most massive central galaxies have stellar masses consistent with brightest cluster galaxies (BCGs) progenitors in the TNG300 simulation. The results strongly suggest these structures are forming massive galaxy clusters via baryonic and dark matter accretion.\n\n", "2407.02954": "2024-07-03, **Simulations for direct dark matter searches using ALPS II's TES detection system**, Christina Schwemmbauer et.al., [2407.02954v1](http://arxiv.org/abs/2407.02954v1)\n\n Transition Edge Sensors (TES) are superconducting microcalorimeters that can be used for single-photon detection with extremely low backgrounds. When they are within their superconducting transition region, small temperature fluctuations - like the energy deposited by single photons - lead to large resistance variations. These variations can be measured using Superconducting Quantum Interference Devices (SQUIDs). This technology is planned to be used as a single-photon detector for later runs of the ALPS II experiment, a light-shining-through-walls experiment at DESY Hamburg, searching for Axion-Like Particles (ALPs), which are possible Dark Matter (DM) candidates. Due to the very low dark count rates in our setup, our TES system might be viable for direct DM searches at sub-MeV masses through electron-scattering of DM in the superconducting chip, as well. Simulations concerning background rejection and calibration methods demonstrate the needed sub-eV sensitivity already.\n\n", "2407.02916": "2024-07-03, **How does a low surface brightness galaxy form spiral arms?**, Ganesh Narayanan et.al., [2407.02916v1](http://arxiv.org/abs/2407.02916v1)\n\n The formation and evolution of spiral arms in low surface brightness galaxies (LSBs) are not well-understood. We study the dynamics of spiral arms in two prototypical LSBs, F568-VI and F568-01, using both analytical models and N-body + hydrodynamical simulations. We first consider the disk as a 2-component system of gravitationally-coupled stars and gas in the force field of a \\emph{spherical} dark matter halo, subjected to local, non-axisymmetric perturbations. However, no local spirals are formed. We next assume the disk to be a 1-component system of stars in the net gravitational potential of a galaxy with a \\emph{spherical} dark matter halo perturbed by a global $m=2$ instability. In this case, the growth time for spiral formation was low, equal to 0.78 and 0.96 Gyrs, respectively, corresponding to a few dynamical times of the galaxies. Finally, we simulate the LSBs using the N-body + hydrodynamical simulation code RAMSES. \\emph{Our results show that a quadrupolar field associated with an oblate halo with an axial ratio of 0.7} is necessary to drive a long-lived global spiral in the LSB disks. Further, feedback corresponding to a supernova mass fraction of $\\sim$ 0.05 is essential to comply with the observed stellar surface density. The simulated spirals survives for about ten dynamical times and the average pattern speed lies between 10 - 15 $\\rm{kms^{-1}{kpc}^{-1}}$. The spiral arm thus formed is therefore a transient global pattern driven by the tidal field of the oblate dark matter halo.\n\n", "2407.02872": "2024-07-03, **Thermodynamics and Null Geodesics of a Schwarzschild Black Hole Surrounded by a Dehnen Type Dark Matter Halo**, Mrinnoy M. Gohain et.al., [2407.02872v1](http://arxiv.org/abs/2407.02872v1)\n\n In this work, we derive a novel black hole solution surrounded by a Dehnen-(1,4,0) type dark matter halo by embedding a Schwarzschild black hole within the halo, constituting a composite dark matter-black hole system. The thermodynamics of the resulting effective black hole spacetime is then studied with particular attention to the influence of the dark matter parameters on various thermodynamic properties. We examine the specific heat and free energy to assess the thermodynamic stability of the model. Furthermore, the null geodesics and the effective potential of light rays are studied to investigate how the dark matter parameters affect these geodesics and the radii of circular orbits. The stability of circular null geodesics is analyzed using dynamical systems and Lyapunov exponents, which represents the dynamical behaviour of the circular photon orbits.\n\n"}, "supernova": {"2407.02916": "2024-07-03, **How does a low surface brightness galaxy form spiral arms?**, Ganesh Narayanan et.al., [2407.02916v1](http://arxiv.org/abs/2407.02916v1)\n\n The formation and evolution of spiral arms in low surface brightness galaxies (LSBs) are not well-understood. We study the dynamics of spiral arms in two prototypical LSBs, F568-VI and F568-01, using both analytical models and N-body + hydrodynamical simulations. We first consider the disk as a 2-component system of gravitationally-coupled stars and gas in the force field of a \\emph{spherical} dark matter halo, subjected to local, non-axisymmetric perturbations. However, no local spirals are formed. We next assume the disk to be a 1-component system of stars in the net gravitational potential of a galaxy with a \\emph{spherical} dark matter halo perturbed by a global $m=2$ instability. In this case, the growth time for spiral formation was low, equal to 0.78 and 0.96 Gyrs, respectively, corresponding to a few dynamical times of the galaxies. Finally, we simulate the LSBs using the N-body + hydrodynamical simulation code RAMSES. \\emph{Our results show that a quadrupolar field associated with an oblate halo with an axial ratio of 0.7} is necessary to drive a long-lived global spiral in the LSB disks. Further, feedback corresponding to a supernova mass fraction of $\\sim$ 0.05 is essential to comply with the observed stellar surface density. The simulated spirals survives for about ten dynamical times and the average pattern speed lies between 10 - 15 $\\rm{kms^{-1}{kpc}^{-1}}$. The spiral arm thus formed is therefore a transient global pattern driven by the tidal field of the oblate dark matter halo.\n\n", "2407.02801": "2024-07-03, **Cosmological tests of the dark energy models in Finsler-Randers Space-time**, Z. Nekouee et.al., [2407.02801v1](http://arxiv.org/abs/2407.02801v1)\n\n The Finsler-Randers space-time offers a novel perspective on cosmic dynamics, departing from the constraints of General Relativity. This paper thoroughly investigates two dark energy models resulting from the parametrization of $H$ within this geometric framework. We have conducted some geometrical and physical analysis of the dark energy models in Finslerian geometry. First, We have derived the field equations governing the universe's evolution within the Finsler-Randers formalism, incorporating the presence of dark energy. Through this, we explore its implications on cosmological phenomena, including cosmic expansion, late-time behavior of the universe, cosmological phase transition, and a few more. Also, we employ observational data such as Cosmic Chronometer, Supernovae, Gamma-Ray Bursts, Quasar, and baryon acoustic oscillations to constrain the parameters associated with dark energy in the Finsler-Randers universe. Comparing theoretical predictions with empirical observations, we assess the model viability and discern any deviations from the standard $\\Lambda$CDM cosmology. Our findings offer intriguing insights into the nature of dark energy within this alternative gravitational framework, providing a deeper understanding of its role in shaping cosmic evolution. The implications of our results extend to fundamental cosmology, hinting at new avenues for research to unravel the mysteries surrounding dark energy and the geometric structure of the universe within non-standard gravitational theories.\n\n"}}