{"neutrino": {"2312.02045": "2023-12-04, **Fast Posterior Probability Sampling with Normalizing Flows and Its Applicability in Bayesian analysis in Particle Physics**, Mathias El Baz et.al., [2312.02045v1](http://arxiv.org/abs/2312.02045v1)\n\n In this study, we use Rational-Quadratic Neural Spline Flows, a sophisticated parametrization of Normalizing Flows, for inferring posterior probability distributions in scenarios where direct evaluation of the likelihood is challenging at inference time. We exemplify this approach using the T2K near detector as a working example, focusing on learning the posterior probability distribution of neutrino flux binned in neutrino energy. The predictions of the trained model are conditioned at inference time by the momentum and angle of the outgoing muons released after neutrino-nuclei interaction. This conditioning allows for the generation of personalized posterior distributions, tailored to the muon observables, all without necessitating a full retraining of the model for each new dataset. The performances of the model are studied for different shapes of the posterior distributions.\n\n", "2312.02022": "2023-12-04, **Neutrino emission of neutron-star superbursts**, A. D. Kaminker et.al., [2312.02022v1](http://arxiv.org/abs/2312.02022v1)\n\n Superbursts of neutron stars are rare but powerful events explained by the explosive burning of carbon in the deep layers of the outer envelope of the star. In this paper we perform a simulation of superbursts and propose a simple method for describing the neutrino stage of their cooling, as well as a method for describing the evolution of the burst energy on a scale of several months. We note a universal relation for the temperature distribution in the burnt layer at its neutrino cooling stage, as well as the unification of bolometric light curves and neutrino heat loss rates for deep and powerful bursts. We point out the possibility of long-term retention of the burst energy in the star's envelope. The results can be useful for interpretation of superburst observations.\n\n", "2312.01975": "2023-12-04, **Thermal twin stars within a hybrid equation of state based on a nonlocal chiral quark model compatible with modern astrophysical observations**, J. P. Carlomagno et.al., [2312.01975v1](http://arxiv.org/abs/2312.01975v1)\n\n We investigate the extension to finite temperatures and neutrino chemical potentials of a recently developed nonlocal chiral quark model approach to the equation of state of neutron star matter. We consider two light quark flavors and current-current interactions in the scalar-pseudoscalar, vector, and diquark pairing channels, where the nonlocality of the currents is taken into account by a Gaussian form factor that depends on the spatial components of the 4-momentum. Within this framework, we analyze order parameters, critical temperatures, phase diagrams, equation of state, and mass-radius relations for different temperatures and neutrino chemical potentials. For parameters of the model that are constrained by recent multi-messenger observations of neutron stars, we find that the mass-radius diagram for isothermal hybrid star sequences exhibits the thermal twin phenomenon for temperatures above 30 MeV.\n\n", "2312.01718": "2023-12-04, **Type-II Seesaw Leptogenesis along the Ridge**, Chengcheng Han et.al., [2312.01718v1](http://arxiv.org/abs/2312.01718v1)\n\n Type-II seesaw leptogenesis is a model that integrates inflation, baryon number asymmetry, and neutrino mass simultaneously. It employs the Affleck-Dine mechanism to generate lepton asymmetry, with the Higgs bosons serving as the inflaton. Previous studies assumed inflation to occur in a valley of the potential, employing the single-field approximation. In this work, we explore an alternative scenario for the type-II seesaw leptogenesis, where the inflation takes place along a ridge of the potential. Firstly, we conduct a comprehensive numerical calculation in the canonical scenario, where inflation occurs in a valley, confirming the effectiveness of the single-field approximation. Then, we introduce a novel scenario wherein inflation initiates along the potential's ridge and transitions to the valley in the late stages. In this case, the single-field inflation approximation is no longer valid, yet leptogenesis is still successfully achieved. We find that this scenario can generate a significant non-Gaussianity signature, offering testable predictions for future experiments.\n\n", "2312.01693": "2023-12-04, **Chiral perturbative evaluation for the (second) lightest mass $M_{1,2}$ of right-handed neutrino $ν_{R 1,2}$ in unified theories with sequential dominance**, Masaki J. S. Yang et.al., [2312.01693v1](http://arxiv.org/abs/2312.01693v1)\n\n In this paper, we evaluate the (second) lightest mass $M\\_{1,2}$ of right-handed neutrino $\\nu\\_{R1,2}$ in grand unified theories with the type-I seesaw mechanism that predicts an almost massless neutrino $m\\_{1 \\, \\rm or \\, 3} \\sim 0$. By chiral perturbative treatment, the masses $M\\_{1,2}$ are expressed as $M\\_{1} = m\\_{D1}^{2}/m\\_{11} , \\, M\\_{2} = m\\_{D2}^{2} m\\_{11} / (m\\_{11} m\\_{22} - m\\_{12}^{2})$ with the mass matrix of left-handed neutrinos $m$ in the diagonal basis of the Dirac mass matrix $m\\_{D}$.   Assuming $m\\_{Di}$ and the unitary matrix $V$ in the singular value decomposition $(m\\_{D})\\_{ij} = V\\_{ik} m\\_{D k} U^{\\dagger}\\_{kj}$ are close to observed fermion masses and the CKM matrix, $M\\_{1,2}$ and their allowed regions are expressed by parameters in the low energy and unknown phases. As a result, for $m\\_{D1} \\simeq 0.5$ MeV and $m\\_{D2} \\simeq 100$ MeV, we obtain $M\\_{1}^{\\rm NH} \\simeq 3 \\times 10^{4 - 6}$ GeV and $M\\_{2}^{\\rm NH} \\simeq 3 \\times 10^{6-8}$ GeV in the NH, $M\\_{1}^{\\rm IH} \\simeq 5 \\times 10^{3 - 4}$ GeV and $M\\_{2}^{\\rm IH} \\simeq 4 \\times 10^{8-9}$ GeV in the IH. These upper and lower bounds are proportional to $m\\_{Di}^{2}$ or $m\\_{D1} m\\_{D2}$.\n\n"}, "dark matter": {"2312.02115": "2023-12-04, **Exact solutions of Cotton Gravity**, Roberto A Sussman et.al., [2312.02115v1](http://arxiv.org/abs/2312.02115v1)\n\n We examine various exact solutions in \"Cotton Gravity\" (CG), a new gravity theory that provides an extension of General Relativity (GR) based on the Cotton tensor. Using an alternative formulation of the field equations in terms of a Codazzi tensor, we obtain various non-trivial CG exact solutions that generalize known GR solutions: FLRW cosmologies, Lemaitre-Tolman-Bondi (LTB) and Szekeres dust solutions, as well as static perfect fluid spheres and solutions with a shear-free 4 velocity. We show that CG modifies the spatial curvature of the nonstatic GR solutions. Demanding a well posed initial value formulation keeps the same dynamics of FLRW models of GR, but with the cosmological constant interpreted as constant spatial curvature. In other solutions the modification of spatial curvature allows for self-consistent significant changes in the dynamics, an time and spece dependent evolution from decelerated to accelerated expansion driven by negative spatial curvature and without necessarily assuming a dark energy source or imposing a cosmological constant. The $\\Lambda$CDM model naturally emerges as the unique FLRW dust model of CG with constant negative spatial curvature. Static fluid spheres in the weak field regime of CG allow for modeling the flattening of rotation velocities in galactic systems without assuming dark matter. The methods we have presented can be improved to be able to obtain more general solutions that will facilitate the application of CG to current open problems in gravitational systems in general.\n\n", "2312.02086": "2023-12-04, **Ruling out models of vector dark matter in asymptotically safe quantum gravity**, Gustavo P. de Brito et.al., [2312.02086v1](http://arxiv.org/abs/2312.02086v1)\n\n The nature of dark matter is a problem with too many potential solutions. We investigate whether a consistent embedding into quantum gravity can decimate the number of solutions to the dark-matter problem. Concretely, we focus on a hidden sector composed of a gauge field and a charged scalar, with gauge group U(1)$\\_{\\textmd{D}}$ or SU(2)$\\_\\textmd{D}$. The gauge field is the dark-matter candidate, if the gauge symmetry is broken spontaneously. Phenomenological constraints on the couplings in this model arise from requiring that the correct dark matter relic density is produced via thermal freeze-out and that recent bounds from direct-detection experiments are respected. We find that the consistent embedding into asymptotically safe quantum gravity gives rise to additional constraints on the couplings at the Planck scale, from which we calculate corresponding constraints at low energy scales. We discover that phenomenological constraints cannot be satisfied simultaneously with theoretical constraints from asymptotically safe quantum gravity, ruling out these dark-matter models.\n\n", "2312.02046": "2023-12-04, **Stellar mass is not the best predictor of galaxy metallicity. The gravitational potential-metallicity relation $Φ\\rm ZR$**, Laura Sánchez-Menguiano et.al., [2312.02046v1](http://arxiv.org/abs/2312.02046v1)\n\n Interpreting the scaling relations followed by galaxies is a fundamental tool for assessing how well we understand galaxy formation and evolution. Several scaling relations involving the galaxy metallicity have been discovered through the years, the foremost of which is the scaling with stellar mass. This so-called mass-metallicity relation is thought to be fundamental and has been subject to many studies in the literature. We study the dependence of the gas-phase metallicity on many different galaxy properties to assess which of them determines the metallicity of a galaxy. We applied a random forest regressor algorithm on a sample of more than 3000 nearby galaxies from the SDSS-IV MaNGA survey. Using this machine-learning technique, we explored the effect of 148 parameters on the global oxygen abundance as an indicator of the gas metallicity. $M\\_{\\rm \\star}$/$R\\_e$, as a proxy for the baryonic gravitational potential of the galaxy, is found to be the primary factor determining the average gas-phase metallicity of the galaxy ($Z\\_g$). It outweighs stellar mass. A subsequent analysis provides the strongest dependence of $Z\\_g$ on $M\\_\\star / R\\_e^{\\,0.6}$. We argue that this parameter traces the total gravitational potential, and the exponent $\\alpha\\simeq 0.6$ accounts for the inclusion of the dark matter component. Our results reveal the importance of the relation between the total gravitational potential of the galaxy and the gas metallicity. This relation is tighter and likely more primordial than the widely known mass-metallicity relation.\n\n", "2312.02005": "2023-12-04, **Remote sensing of backward reflection from stimulated axion decay**, Kensuke Homma et.al., [2312.02005v1](http://arxiv.org/abs/2312.02005v1)\n\n We propose a method for remotely detecting backward reflection via induced decay of cold dark matter such as axion in the background of a propagating coherent photon field. This method can be particularly useful for probing concentrated dark matter streams by Earth's gravitational lensing effect. Formulae for the stimulated reflection process and the expected sensitivities in local and remote experimental approaches are provided for testing eV scale axion models using broad band lasers. The generic axion-photon coupling is expected to be explorable up to ${\\cal O}(10^{-12})$ GeV${}^{-1}$ and ${\\cal O}(10^{-22})$ GeV${}^{-1}$ for the idealized local and remote setups, respectively.\n\n", "2312.01889": "2023-12-04, **Prospects for probing small-scale dark matter models with pulsars around Sagittarius A***, Zexin Hu et.al., [2312.01889v1](http://arxiv.org/abs/2312.01889v1)\n\n Future observations with next-generation large-area radio telescopes are expected to discover radio pulsars (PSRs) closely orbiting around Sagittarius~A* (Sgr~A*), the supermassive black hole (SMBH) dwelling at our Galactic Center (GC). Such a system can provide a unique laboratory for testing General Relativity (GR), as well as the astrophysics around the GC. In this paper, we provide a numerical timing model for PSR-SMBH systems based on the post-Newtonian (PN) equation of motion, and use it to explore the prospects of measuring the black hole (BH) properties with pulsar timing. We further consider the perturbation caused by the dark matter (DM) distribution around Sgr~A*, and the possibility of constraining DM models with PSR-SMBH systems. Assuming a 5-year observation of a normal pulsar in an eccentric ($e=0.8$) orbit with an orbital period $P\\_b = 0.5\\,$yr, we find that -- with weekly recorded times of arrival (TOAs) and a timing precision of 1 ms -- the power-law index of DM density distribution near the GC can be constrained to about 20%. Such a measurement is comparable to those measurements at the Galactic length scale but can reveal small-scale properties of the DM.\n\n", "2312.01762": "2023-12-04, **MusE GAs FLOw and Wind (MEGAFLOW) X. The cool gas and covering fraction of MgII in galaxy groups**, Maxime Cherrey et.al., [2312.01762v1](http://arxiv.org/abs/2312.01762v1)\n\n We present a study of the cool gas ($\\approx 10^4$ K) traced by MgII absorptions around groups of galaxies in the MEGAFLOW survey. Using a combination of two algorithms we blindly identify 32 groups of more than 5 galaxies at $0.3 < z < 1.5$ with $10.7 < \\log\\_{10}(M/\\rm M\\_{\\odot}) < 13.7$. Among them 26 can be used to study potential counterpart MgII absorptions. We report that 21 out of the total 120 MgII absorption systems present in MEGAFLOW are associated with groups. We observe that the MgII rest-frame equivalent width ($W^{2796}\\_r$) drops at an impact parameter of $\\approx 150$ projected kpc from the closest galaxy and $\\approx$ one virial radius from the identified group center indicating that MgII halos scale with the mass of the groups.The impact parameter where the covering fraction exceeds $50\\%$ is $\\log\\_{10}(b/\\rm kpc) = 2.17 \\pm 0.47$ $(2 \\sigma)$ and $(b/R\\_{\\rm vir}) = 1.67 \\pm 0.98$, which is $\\approx 3$ times larger than for field galaxies ($\\log\\_{10}(b/\\rm kpc)=1.67\\pm0.15$). Finally, we estimate the cool gas column density profile in groups (from the $W^{2796}\\_r$) and show that its shape follows closely the typical dark matter column density profile for halos at similar redshift and masses.\n\n", "2312.01594": "2023-12-04, **Impact of the LZ Experiment on DM Phenomenology and Naturalness in the MSSM**, Li Dongwei et.al., [2312.01594v2](http://arxiv.org/abs/2312.01594v2)\n\n Taking the bino-dominated dark matter (DM) as an example, through approximate analytical formulas and numerical results, this paper analyzes impact of the LUX-ZEPLIN (LZ) Experiment on DM phenomenology and naturalness in Minimal Super-symmetric Standard Model(MSSM). It concluded that under the limitation of the latest LZ experiment, MSSM suffers unattractive fine-tunings. The reason is that the latest LZ experiment results improve $\\mu$ bounds, e.g., for the cases of the Z- or h-mediated resonant annihilations to achieve the measured dark matter density, the LZ experiment require $\\mu$ should be larger than about $500~{\\rm GeV}$ or TeV magnitude, which imply a tuning to predict the $Z$-boson mass and simultaneously worsen the naturalness of the $Z$- and $h$-mediated resonant annihilations to achieve the measured dark matter density.\n\n"}, "supernova": {"2312.02075": "2023-12-04, **Non-Gaussian Likelihoods for Type Ia Supernovae Cosmology: Implications for Dark Energy and $H_0$**, Toby Lovick et.al., [2312.02075v1](http://arxiv.org/abs/2312.02075v1)\n\n The latest improvements in the scale and calibration of Type Ia supernovae catalogues allow us to constrain the specific nature and evolution of dark energy through its effect on the expansion history of the universe. We present the results of Bayesian cosmological model comparison on the SNe~Ia catalogue Pantheon+, where Flat $\\Lambda$CDM is preferred by the data over all other models and we find moderate evidence ($\\Delta \\log \\mathcal{Z} \\sim 2.5$) to reject a number of the alternate dark energy models. The effect of peculiar velocity corrections on model comparison is analysed, where we show that removing the peculiar velocity corrections results in a varying fit on non-$\\Lambda$CDM parameters. As well as comparing cosmological models, the Bayesian methodology is extended to comparing the scatter model of the data, testing for non-gaussianity in the Pantheon+ Hubble residuals. We find that adding a scale parameter to the Pantheon+ covariances, or alternately using a multivariate Student's t-distribution fits the data better than the fiducial analysis, producing a cosmology independent evidence increase of $\\Delta \\log \\mathcal{Z} = 2.29 $ and $2.46$ respectively. This improved treatment of the scatter decreases the uncertainty in the constraint on the Hubble constant, finding $H\\_0 = 73.67 \\pm 0.99 $ km s$^{-1}$ Mpc$^{-1}$, in $ 5.7 \\sigma$ tension with Planck. We also explore $M\\_B$ transition models as a potential solution for the Hubble tension, finding no evidence to support these models among the SNe data.\n\n", "2312.02026": "2023-12-04, **The jets and the neutron star kick velocity of the supernova remnant CTB 1**, Ealeal Bear et.al., [2312.02026v1](http://arxiv.org/abs/2312.02026v1)\n\n We identify jet-shaped morphology in the core-collapse supernova remnant (SNR) CTB 1 that includes two opposite structural features. We identify these as the imprints of a pair of jets that were among the last jets to explode the massive stellar progenitor of CTB 1. We find the projected angle between the jets' axis and the direction of the pulsar velocity, which is the neutron star natal kick, to be 78 degrees. We tentatively identify possible signatures of a second pair of opposite jets along a different direction. If holds, SNR CTB 1 has a point-symmetric structure. The morphology and large angle of the jets' axis to kick velocity are the expectations of the jittering jets explosion mechanism (JJEM) of core-collapse supernovae.\n\n", "2312.01977": "2023-12-04, **Cosmological constraints on early dark energy from the full shape analysis of eBOSS DR16**, Rafaela Gsponer et.al., [2312.01977v1](http://arxiv.org/abs/2312.01977v1)\n\n We evaluate the effectiveness of Early Dark Energy (EDE) in addressing the Hubble tension using data from the completed eBOSS survey, focusing on luminous red galaxies (LRGs), quasars (QSOs), and emission line galaxies (ELGs). We perform cosmological parameter measurements based on full shape analysis of the power spectrum of all three tracers. We conduct this full shape analysis with the effective field theory of large-scale structure (EFTofLSS). EDE is known to strongly suffer from volume projection effects, which makes the interpretation of cosmological constraints challenging. To quantify the volume projection effects within an EDE full shape analysis, we explore the impact of different prior choices on the nuisance parameters of EFTofLSS through an extensive mock study. We compare classical Gaussian priors to the non-informative Jeffreys prior, known to mitigate volume projection effects in $\\Lambda$CDM. Our full shape analysis combines eBOSS and BOSS data with Planck, external Baryon Acoustic Oscillation (BAO), PantheonPlus, and SH0ES supernova data. EDE demonstrates to reduce the tension from $5.2\\sigma$ to $3\\sigma$ compared to $\\Lambda$CDM. The derived values at a 68\\% credible interval with Gaussian and Jeffreys priors are $H\\_0=71.73\\_{-0.86}^{+0.82}$ km/s/Mpc with $f\\_\\mathrm{EDE} = 0.1179\\_{-0.022}^{+0.025}$ and $H\\_0=72.03\\_{-0.87}^{+0.82}$ km/s/Mpc with $f\\_\\mathrm{EDE} = 0.1399\\_{-0.022}^{+0.023}$, respectively. Although the Hubble tension is mitigated compared to $\\Lambda$CDM, the inclusion of eBOSS data amplifies the tension within EDE from $2\\sigma$ to $3\\sigma$, in contrast to the full shape analysis of BOSS data with Planck, external BAO, PantheonPlus, and SH0ES. This highlights the significance of incorporating additional large-scale structure data in discussions concerning models aiming to resolve the Hubble tension.\n\n", "2312.01948": "2023-12-04, **Impact of Supernova Explosions on the Proto-Solar System under Suitable Conditions as $^{26}$Al Source: The Case of Direct Injection into the Proto-Solar Disk**, Ryo Sawada et.al., [2312.01948v1](http://arxiv.org/abs/2312.01948v1)\n\n The early solar system contained short-lived radionuclides such as $^{26}$Al (its half-life time $t\\_{1/2} = 0.7$ Myr), and many hypotheses have been proposed for their origin. One of the possible hypotheses is that when the protoplanetary disk of the solar system had already formed, a very close $(<1\\,\\mathrm{pc})$ supernova (SN) injected radioactive material directly into the disk. Such a $^{26}$Al injection hypothesis has been tested so far with very limited setups for disk structure and supernova distance, and then by comparing disruption and injection conditions separately. We extend this problem to analytically investigate whether there are conditions under which the surviving disk radius can confine enough $^{26}$Al for planet formation while allowing some disk disruption. We also consider a variety of i) disk mass and structure, ii) $^{26}$Al yields from SNs, and iii) large dust mass fraction $\\eta\\_\\mathrm{d}$. We find that $^{26}$Al yields of SN are required as $\\gtrsim 2.1\\times10^{-3}M\\_\\odot(\\eta\\_\\mathrm{d}/0.2)^{-1}$, which is difficult to reproduce given the diversity of ejected $^{26}$Al mass and large dust mass fractions from the supernovae. Furthermore, we find that even if the above conditions are met, the SN shock changes the disk temperature. Our results place a strong constraint on the 'disk injection scenario'; a scenario in which fresh $^{26}$Al of the early Solar System is injected from a supernova into an already formed protosolar nebula is quite challenging. Rather, we suggest that the fresh $^{26}$Al of the early solar system must have been synthesized/injected in other ways.\n\n", "2312.01892": "2023-12-04, **PSR J0210+5845; An ultra wide binary pulsar with a B6V main-sequence star companion**, E. van der Wateren et.al., [2312.01892v1](http://arxiv.org/abs/2312.01892v1)\n\n We report on radio timing observations of PSR J0210+5845 which reveal large deviations from typical pulsar spin-down behaviour. We interpret these deviations as being due to binary motion around the $V=13.5$ star 2MASS J02105640$+$5845176, which is coincident in celestial position and distance with the pulsar. Archival observations and new optical spectroscopy identify this star as a B6V star with a temperature of $T\\_\\mathrm{eff}\\approx 14\\,000$K and a mass of $M\\_\\mathrm{c}= 3.5$ to $3.8$M$\\_\\odot$, making it the lowest mass main-sequence star known orbiting a non-recycled pulsar. We found that the timing observations constrain the binary orbit to be wide and moderately eccentric, with an orbital period of $P\\_\\mathrm{b}=47^{+40}\\_{-14}$yr and eccentricity $e=0.46^{+0.10}\\_{-0.07}$. We predict that the next periastron passage will occur between 2030 and 2034. Due to the low companion mass, we find that the probability for a system with the properties of PSR J0210+5845 and its binary companion to survive the supernova is low. We show that a low velocity and fortuitously directed natal kick is required for the binary to remain bound during the supernova explosion, and argue that an electron-capture supernova is a plausible formation scenario for the pulsar.\n\n", "2312.01854": "2023-12-04, **Galaxy to cloud scales**, Clare Dobbs et.al., [2312.01854v1](http://arxiv.org/abs/2312.01854v1)\n\n Simulations from the scales of isolated galaxies to clouds have been instrumental in informing us about molecular cloud formation and evolution. Simulations are able to investigate the roles of gravity, feedback, turbulence, heating and cooling, and magnetic fields on the physics of the interstellar medium, and star formation. Compared to simulations of individual clouds, galactic and sub-galactic scale simulations can include larger galactic scale processes such as spiral arms, bars, and larger supernovae bubbles, which may influence star formation. Simulations show cloud properties and lifetimes in broad agreement with observations. Gravity and spiral arms are required to produce more massive GMCs, whilst stellar feedback, likely photoionisation, leads to relatively short cloud lifetimes. On larger scales, supernovae may be more dominant in driving the structure and dynamics, but photoionisation may still have a role. In terms of the dynamics, feedback is probably the main driver of velocity dispersions, but large scale processes such as gravity and spiral arms may also be significant. Magnetic fields are generally found to decrease star formation on galaxy or cloud scales, and simulations are ongoing to study whether clouds are sub or supercritical on different scales in galaxy scale simulations. Simulations on subgalactic scales, or zoom in simulations, allow better resolution of feedback processes, filamentary structure within clouds, and the study of stellar clusters.\n\n"}}