{"neutrino": {"2502.13439": "2025-02-19, **Neutrino Oscillation in Core Collapse Supernova: The Impact of Spacetime Geometry**, Indrajit Ghose et.al., [2502.13439v1](http://arxiv.org/abs/2502.13439v1)\n\n Neutrino flavor evolution inside a core-collapse supernova is a topic of active research. The core of a supernova is an intense source of neutrinos and antineutrinos. Self-interaction among neutrinos (as well as antineutrinos) gives rise to a rich phenomenology not seen in terrestrial situations. In studies of the dynamics of flavor evolution in such environments, the gravitational effects are generally ignored. Although the curvature outside a dense core does not deviate much from a flat space, the spin of the neutrinos can still couple to the torsion of the spacetime. These extra degrees of freedom of curved spacetime have interaction strengths that are proportional to the density of the neutrinos and the other fermions \\cite{Chakrabarty:2019cau} \\cite{Barick:2023qjq} as well as the coupling constants of the spin-torsion interaction. We have studied the effects of such interactions in flavor evolution inside a core-collapse supernova \\cite{Ghose:Manuscript}. The self-interaction gets modified by the spin-torsion interaction and the oscillation dynamics is modified. We have seen that there are noticeable changes in the flavor dynamics when the neutrino density is uniform. We have also studied the effects of such interaction in a realistic core-collapse supernova (CCSN). As neutrino astronomy enters the precision era, this study will shed light on the potential of neutrino fluxes from CCSN to probe the neutrino-neutrino interaction.\n\n"}, "dark matter": {"2502.13858": "2025-02-19, **Quantifying the Detectability of Milky Way Satellites with Image Simulations: a Case Study with KiDS**, Shiyang Zhang et.al., [2502.13858v1](http://arxiv.org/abs/2502.13858v1)\n\n Ultra-faint dwarf galaxies, which can be detected as resolved satellite systems of the Milky Way, are critical to understanding galaxy formation, evolution, and the nature of dark matter, as they are the oldest, smallest, most metal-poor, and most dark matter-dominated stellar systems known. Quantifying the sensitivity of surveys is essential for understanding their capability and limitations in searching for ultra-faint satellites. In this paper, we present the first study of the image-level observational selection function for Kilo-Degree Survey (KiDS) based on the Synthetic UniveRses For Surveys (surfs)-based KiDS-Legacy-Like Simulations. We generate mock satellites and simulate images that include resolved stellar populations of the mock satellites and the background galaxies, capturing realistic observational effects such as source blending, photometric uncertainties, and star-galaxy separation. The matched-filter method is applied to recover the injected satellites. We derive the observational selection function of the survey in terms of the luminosity, half-light radius, and heliocentric distance of the satellites. Compared to a catalogue-level simulation as used in previous studies, the image-level simulation provides a more realistic assessment of survey sensitivity, accounting for observational limitations that are neglected in catalogue-level simulations. The image-level simulation shows a detection loss for compact sources with a distance $d \\gtrsim 100~\\rm kpc$. We argue that this is because compact sources are more likely to be identified as single sources rather than being resolved during the source extraction process.\n\n", "2502.13761": "2025-02-19, **Astrophysical signals from the neighboring brane**, Sergey G. Rubin et.al., [2502.13761v1](http://arxiv.org/abs/2502.13761v1)\n\n In this paper, we consider the two-brane model and show that any field is settled on both neighboring branes, thus forming two independent effective fields with different masses. The hierarchy of the energy scales and the subsequent fine-tuning can be achieved for a brane populated by observers. The neighboring brane is thus populated by extremely massive fields. The electromagnetic field is uniformly distributed over the extra dimensions, preserving charge universality in 4D physics.   It is shown that the particles on different branes interact by exchanging photons and gravitons, which could explain the phenomena such as ultra-high-energy cosmic rays and dark matter. The latter consists of heavy electrons that are located on a brane free of the observers.\n\n", "2502.13635": "2025-02-19, **Production of Dark Photons through Higher Electromagnetic Moments at LDMX: Simulations and Model Discrimination**, Riccardo Catena et.al., [2502.13635v1](http://arxiv.org/abs/2502.13635v1)\n\n We extend the projected sensitivity of LDMX for sub-GeV dark matter (DM) to the case of dark photons produced through higher order electromagnetic moments. These moments arise from loop diagrams involving portal matter fields, along with the gauge fields of new symmetry groups. Due to the Lorentz structures, in particular the momentum dependence, of these additional interactions, the kinematic distributions expected at missing momentum/energy experiments vary with model in addition to dark photon mass. By considering four additional types of interactions -- magnetic and electric dipole, charge radius, and anapole moment -- we show that LDMX Phase-II is expected to probe the relic target of these additional dark photon models. We compare the analytic with the numerical methods for calculating the dark bremsstrahlung cross section, and compute the kinematic distributions for each model. The potential for model discrimination in the scenario of non-zero signal events at LDMX is discussed. We find that there is a degeneracy between the dark photon mass and model, which can be partially broken by considering both the energy and the transverse momentum of the recoil electron.\n\n", "2502.13397": "2025-02-19, **Thermodynamic analysis and shadow bound of black holes surrounded by a dark matter halo**, Yun Soo Myung et.al., [2502.13397v1](http://arxiv.org/abs/2502.13397v1)\n\n We perform the thermodynamic analysis of a black hole (BH) immersed in a dark matter halo (DMH), showing that the BH could not be in thermal equilibrium with the DMH in any regions outside the event horizon. This means that the thermodynamic influence of the environment (DMH) is relatively small on the BH and it does not alter the nature of BH with negative heat capacity. The Newtonian ($1/a\\_0$) approximation gives us a correct thermodynamic description for the BH surrounded by DMH because the first law of thermodynamics and Smarr formula are satisfied. We use the Newtonian Helmholtz free energy to show that there is no phase transition to other BH with positive heat capacity surrounded by a DMH. We investigate the shadow bound of favored region for the BH immersed in the DMH by introducing three critical impact parameters.\n\n", "2502.13393": "2025-02-19, **Searching Axion-like Dark Matter by Amplifying Weak Magnetic Field with Quantum Zeno effect**, J. Dong et.al., [2502.13393v1](http://arxiv.org/abs/2502.13393v1)\n\n The enhancement of weak signals and the detection of hypothetical particles, facilitated by quantum amplification, are crucial for advancing fundamental physics and its practical applications. Recently, it was experimentally observed that magnetic field can be amplified by using nuclear spins under Markovian noise, [H. Su, et al., Phys. Rev. Lett. 133, 191801 (2024)]. Here, we theoretically propose amplifying the magnetic-field signal by using nuclear spins by the quantum Zeno effect (QZE). Under identical conditions, we demonstrate that compared to the Markovian case the amplification of the weak magnetic field can be enhanced by a factor about $e^{1/2}$ under a Gaussian noise. Moreover, through numerical simulations we determine the optimal experimental parameters for amplification conditions. This work shows that the combination of the QZE and spin amplification effectively enhances the amplification of the weak magnetic field. Our findings may provide valuable guidance for the design of experiments on establishing new constraints of dark matter and exotic interactions in the near future.\n\n"}, "supernova": {}}