{"neutrino": {"2304.10373": "2023-04-20, **Self-consistent calculations for atomic electron capture**, V. A. Sevestrean et.al., [2304.10373v1](http://arxiv.org/abs/2304.10373v1)\n\n This paper presents a comprehensive study of electron capture (EC) ratios across a wide range of nuclei using a self-consistent computational method. We have incorporated important effects such as overlap and exchange corrections, shake-up and shake-off effects in the EC formalism. The electronic wave functions were computed in the Dirac-Hartree-Fock-Slater (DHFS) framework, accounting for electron screening and correlations in the atomic structure description. The DHFS framework was chosen based on the systematic comparison of binding energies and Coulomb amplitudes with previous theoretical models and experimental data. The main feature of this paper is the refined determination of the emitted neutrino energy, which requires extensive atomic structure calculations but leads to much better agreement between theoretical predictions and experimental values, especially for low-energy transitions. Detailed results are presented for nuclei of practical interest ($^{67}\\mathrm{Ga}$, $^{111}\\mathrm{In}$, $^{123}\\mathrm{I}$, $^{125}\\mathrm{I}$ and $^{125}\\mathrm{Xe}$) in nuclear medicine and exotic physics searches involving liquid Xenon detectors. This study provides a robust and comprehensive understanding of EC ratios, with significant implications for astrophysical, nuclear, and medical applications.\n\n", "2304.10231": "2023-04-20, **Particles and antiparticles**, Dezső Horváth et.al., [2304.10231v1](http://arxiv.org/abs/2304.10231v1)\n\n We review the concept of chirality and charge for particles and antiparticles. We point out that the commonly accepted equivalence of particles and antiparticles - with difference only in the opposite signs of their charges, which follows from the CPT invariance - is valid only for free non-chiral particles. We show that with the weak interaction turned on the equivalence of particles and antiparticles is violated. We also discuss that within the Standard Model even free neutrinos are exceptions, they can be produced only in chiral states. We conclude that in spite of a long history of antiparticles, interesting theoretical and experimental challenges remain in their complete understanding.\n\n", "2304.10100": "2023-04-20, **Dai-Freed anomaly in the standard model and topological inflation**, Masahiro Kawasaki et.al., [2304.10100v1](http://arxiv.org/abs/2304.10100v1)\n\n When we impose the discrete symmetry in the standard model we have Dai-Freed global anomalies. However, interestingly if we introduce three right-handed neutrinos we can have an anomaly-free discrete $Z\\_4$ gauge symmetry. This $Z\\_4$ symmetry should be spontaneously broken down to the $Z\\_2$ symmetry to generate the heavy Majorana masses for the right-handed neutrinos. We show that this symmetry breaking naturally generates topological inflation, which is consistent with the CMB observations at present and predicts a significant tensor mode with scalar-tensor ratio $r > 0.03$. The right-handed neutrinos play an important role in reheating processes. The reheating temperature is as high as $\\sim 10^8$GeV, and non-thermal leptogenesis successfully takes place.\n\n", "2304.09893": "2023-04-19, **Novel aspects of Dirac leptogenesis**, Julian Heeck et.al., [2304.09893v1](http://arxiv.org/abs/2304.09893v1)\n\n The neutrino-mass suppressed Yukawa couplings of Dirac neutrinos to the Higgs boson leave the right-handed neutrino partners out of equilibrium in the early universe. Creating an asymmetry in this decoupled sector leads to a matter--antimatter asymmetry due to lepton number conservation. In this letter, we emphasize several overlooked aspects of this Dirac leptogenesis mechanism by thoroughly exploring simple realizations and their viable parameter space. The underlying Boltzmann equations have an interesting structure that allows for highly efficient baryogenesis in a variety of ways. In many of them, the number of relativistic degrees of freedom, $N\\_\\text{eff}$, is severely enhanced compared to standard cosmology and offers a handle to constrain Dirac leptogenesis with upcoming measurements of the cosmic microwave background. Some realizations also allow for low-scale post-sphaleron baryogenesis and predict proton decay.\n\n", "2304.09877": "2023-04-19, **Neutrino Constraints and the ATOMKI X17 Anomaly**, Peter B. Denton et.al., [2304.09877v1](http://arxiv.org/abs/2304.09877v1)\n\n Recent data from the ATOMKI group continues to confirm their claim of the existence of a new $\\sim17$ MeV particle. We review and numerically analyze the data and then put into context constraints from other experiments, notably neutrino scattering experiments such as the latest reactor anti-neutrino coherent elastic neutrino nucleus scattering data and unitarity constraints from solar neutrino observations. We show that minimal scenarios are disfavored and discuss the model requirements to evade these constraints.\n\n", "2304.09553": "2023-04-19, **Search for heavy Majorana or Dirac neutrinos and right-handed $W$ gauge bosons in final states with charged leptons and jets in $pp$ collisions at $\\sqrt{s}=13$ TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2304.09553v1](http://arxiv.org/abs/2304.09553v1)\n\n A search for heavy right-handed Majorana or Dirac neutrinos $N\\_{\\mathrm{R}}$ and heavy right-handed gauge bosons $W\\_{\\mathrm{R}}$ is performed in events with energetic electrons or muons, with the same or opposite electric charge, and energetic jets. The search is carried out separately for topologies of clearly separated final-state products (``resolved'' channel) and topologies with boosted final states with hadronic products partially overlapping and reconstructed as a large-radius jet (``boosted'' channel). The events are selected from $pp$ collision data at the LHC with an integrated luminosity of 139 fb$^{-1}$ collected by the ATLAS detector at $\\sqrt{s}$ = 13 TeV. No significant deviations from the Standard Model predictions are observed. The results are interpreted within the theoretical framework of a left-right symmetric model, and lower limits are set on masses in the heavy right-handed $W\\_{\\mathrm{R}}$ boson and $N\\_{\\mathrm{R}}$ plane. The excluded region extends to about $m(W\\_{\\mathrm{R}}) = 6.4$ TeV for both Majorana and Dirac $N\\_{\\mathrm{R}}$ neutrinos at $m(N\\_{\\mathrm{R}})<1$ TeV. $N\\_{\\mathrm{R}}$ with masses of less than 3.5 (3.6) TeV are excluded in the electron (muon) channel at $m(W\\_{\\mathrm{R}})=4.8$ TeV for the Majorana neutrinos, and limits of $m(N\\_{\\mathrm{R}})$ up to 3.6 TeV for $m(W\\_{\\mathrm{R}}) = 5.2$ ($5.0$) TeV in the electron (muon) channel are set for the Dirac neutrinos.\n\n"}, "dark matter": {"2304.10437": "2023-04-20, **A Mixture of LBG Overdensities in the Fields of Three $6 < z < 7$ Quasars: Implications for the Robustness of Photometric Selection**, Jaclyn B. Champagne et.al., [2304.10437v1](http://arxiv.org/abs/2304.10437v1)\n\n The most luminous quasars at $z > 6$ are suspected to be both highly clustered and reside in the most massive dark matter halos in the early Universe, making them prime targets to search for galaxy overdensities and/or protoclusters. We search for Lyman-break dropout-selected galaxies using HST WFC3/ACS broadband imaging in the fields of three $6 < z < 7$ quasars, as well as their simultaneously observed coordinated-parallel fields, and constrain their photometric redshifts using EAZY. One field, J0305-3150, shows a volume density 10$\\times$ higher than the blank-field UV luminosity function (UVLF) at M$\\_{UV} < -20$, with tentative evidence of a 3$\\sigma$ overdensity in its parallel field located 15 cMpc away. Another field, J2054-0005, shows an angular overdensity within 500 ckpc from the quasar but still consistent with UVLF predictions within 3$\\sigma$, while the last field, J2348-3054, shows no enhancement. We discuss methods for reducing uncertainty in overdensity measurements when using photometric selection and show that we can robustly select LBGs consistent with being physically associated with the quasar, corroborated by existing JWST/NIRCam WFSS data in the J0305 field. Even accounting for incompleteness, the overdensities in J0305 and J2054 are higher for brighter galaxies at short angular separations, suggesting preferential enhancement of more massive galaxies in the immediate vicinity of the quasar. Finally, we compare the LBG population with previously-identified [CII] and mm-continuum companions; the LBG overdensities are not accompanied by an enhanced number of dusty galaxies, suggesting that the overdense quasar fields are not in the bursty star-forming phase sometimes seen in high-redshift protoclusters.\n\n", "2304.10403": "2023-04-20, **Anisotropic Satellite Galaxy Quenching: A Unique Signature of Energetic Feedback by Supermassive Black Holes?**, Juliana S. M. Karp et.al., [2304.10403v1](http://arxiv.org/abs/2304.10403v1)\n\n The quenched fraction of satellite galaxies is aligned with the orientation of the halo's central galaxy, such that on average, satellites form stars at a lower rate along the major axis of the central. This effect, called anisotropic satellite galaxy quenching (ASGQ), has been found in observational data and cosmological simulations. Analyzing the IllustrisTNG simulation, Mart\\'in-Navarro et al. (2021) recently argued that ASGQ is caused by anisotropic energetic feedback and constitutes \"compelling observational evidence for the role of black holes in regulating galaxy evolution.\" In this letter, we study the causes of ASGQ in state-of-the-art galaxy formation simulations to evaluate this claim. We show that cosmological simulations predict that on average, satellite galaxies along the major axis of the dark matter halo tend to have been accreted at earlier cosmic times and are hosted by subhalos of larger peak halo masses. As a result, a modulation of the quenched fraction with respect to the major axis of the central galaxy is a natural prediction of hierarchical structure formation. We show that ASGQ is predicted by the UniverseMachine galaxy formation model, a model without anisotropic feedback. Furthermore, we demonstrate that even in the IllustrisTNG simulation, anisotropic satellite accretion properties are the main cause of ASGQ. Ultimately, we argue that ASGQ is not a reliable indicator of supermassive black hole feedback in galaxy formation simulations and, thus, should not be interpreted as such in observational data.\n\n", "2304.10301": "2023-04-20, **No evidence for p- or d-wave dark matter annihilation from local large-scale structure**, Andrija Kostić et.al., [2304.10301v1](http://arxiv.org/abs/2304.10301v1)\n\n If dark matter annihilates into standard model particles with a cross-section which is velocity dependent, then Local Group dwarf galaxies will not be the best place to search for the resulting gamma ray emission. A greater flux would be produced by more distant and massive halos, with larger velocity dispersions. We construct full-sky predictions for the gamma-ray emission from galaxy- and cluster-mass halos within $\\sim 200 \\, {\\mathrm{Mpc}}$ using a suite of constrained $N$-body simulations (CSiBORG) based on the Bayesian Origin Reconstruction from Galaxies algorithm. Comparing to observations from the Fermi Large Area Telescope and marginalising over reconstruction uncertainties and other astrophysical contributions to the flux, we obtain constraints on the cross-section which are two (seven) orders of magnitude tighter than those obtained from dwarf spheroidals for $p$-wave ($d$-wave) annihilation. We find no evidence for either type of annihilation from dark matter particles with masses in the range $m\\_\\chi = 2-500 \\, {\\mathrm{GeV}}/c^2$, for any channel. As an example, for annihilations producing bottom quarks with $m\\_\\chi = 10 \\, {\\mathrm{GeV}}/c^2$, we find $a\\_{1} < 2.4 \\times 10^{-21} \\, {\\mathrm{cm^3 s^{-1}}}$ and $a\\_{2} < 3.0 \\times 10^{-18} \\, {\\mathrm{cm^3 s^{-1}}}$ at 95% confidence, where the product of the cross-section, $\\sigma$, and relative particle velocity, $v$, is given by $\\sigma v = a\\_\\ell (v/c)^{2\\ell}$ and $\\ell=1, 2$ for $p$-, $d$-wave annihilation, respectively. Our bounds, although failing to exclude the thermal relic cross-section for velocity-dependent annihilation channels, are among the tightest to date.\n\n", "2304.10221": "2023-04-20, **Solitons and halos for self-interacting scalar dark matter**, Raquel Galazo García et.al., [2304.10221v1](http://arxiv.org/abs/2304.10221v1)\n\n We study the formation and evolution of solitons supported by repulsive self-interactions inside extended halos, for scalar-field dark matter scenarios. We focus on the semiclassical regime where the quantum pressure is typically much smaller than the self-interactions. We present numerical simulations, with initial conditions where the halo is described by the WKB approximation for its eigenfunction coefficients. We find that when the size of the system is of the order of the Jeans length associated with the self-interactions, a central soliton quickly forms and makes about 50% of the total mass. However, if the halo is ten times greater than this self-interaction scale, a soliton only quickly forms in cuspy halos where the central density is large enough to trigger the self-interactions. If the halo has a flat core, it takes a longer time for a soliton to appear, after small random fluctuations on the de Broglie wavelength size build up to reach a large enough density. In some cases, we observe the co-existence of several narrow density spikes inside the larger self-interaction-supported soliton. All solitons appear robust and slowly grow, unless they already make up 40% of the total mass. We develop a kinetic theory, valid for an inhomogeneous background, to estimate the soliton growth rate for low masses. It explains the fast falloff of the growth rate as resonances between the ground state and halo excited states disappear. Our results suggest that cosmological halos would show a large scatter for their soliton mass, depending on their assembly history.\n\n", "2304.10128": "2023-04-20, **Examining the Self-Interaction of Dark Matter through Central Cluster Galaxy Offsets**, Dane Cross et.al., [2304.10128v1](http://arxiv.org/abs/2304.10128v1)\n\n While collisionless cold dark matter models have been largely successful in explaining a wide range of observational data, some tensions still exist, and it remains possible that dark matter possesses a non-negligible level of self interactions. In this paper, we investigate a possible observable consequence of self-interacting dark matter: offsets between the central galaxy and the center of mass of its parent halo. We examine 23 relaxed galaxy clusters in a redshift range of 0.1 to 0.3 drawn from clusters in the Dark Energy Survey and the Sloan Digital Sky Survey which have archival Chandra X-ray data of sufficient depth for center and relaxation determination. We find that most clusters in our sample show non-zero offsets between the X-ray center, taken to be the centroid within the cluster core, and the central galaxy position. All of the measured offsets are larger, typically by an order of magnitude, than the uncertainty in the X-ray position due to Poisson noise. In all but six clusters, the measured offsets are also larger than the estimated, combined astrometric uncertainties in the X-ray and optical positions. A more conservative cut on concentration to select relaxed clusters marginally reduces but does not eliminate the observed offset. With our more conservative sample, we find an estimated mean X-ray to central galaxy offset of $\\mu = 5.5 \\pm 1.0$ kpc. Comparing to recent simulations, this distribution of offsets is consistent with some level of dark matter self interaction, though further simulation work is needed to place constraints.\n\n", "2304.10096": "2023-04-20, **Analyzing cancellation mechanism of the DM-quark scattering in a complex singlet extension of the Standard Model**, Gi-Chol Cho et.al., [2304.10096v1](http://arxiv.org/abs/2304.10096v1)\n\n We investigate a suppression mechanism of dark matter and quark scattering amplitudes in a complex singlet extension of the Standard Model. It has been pointed out that, in a some variant of the model, the scattering amplitudes cancel each other in the limit in which two mediator scalars degenerate in their masses. We study the origin of such the cancellation mechanism and show that the operators describing the Higgs-singlet scalar mixing play essential role. We derive sum rules for couplings in the general scalar potential of the model, which guarantee the cancellation of the scattering amplitudes in the tree and the 1-loop level.\n\n", "2304.09895": "2023-04-19, **Anomalies in Gravitational-Lensed Images Revealing Einstein Rings Modulated by Wavelike Dark Matter**, Alfred Amruth et.al., [2304.09895v1](http://arxiv.org/abs/2304.09895v1)\n\n Elucidating the nature of Dark Matter (DM), which does not interact with light and which interacts with known matter primarily or only through gravity, is one of the principal quests in physics. Leading candidates for DM are weakly interacting massive particles (WIMPs) or ultralight bosons (axions), at opposite extremes in mass scales, that have been postulated by competing theories to solve deficiencies in the Standard Model of particle physics. Whereas DM WIMPs behave like discrete particles ($\\varrho$DM), quantum interference between DM axions is manifested as waves ($\\psi$DM). Here, we show that gravitational lensing leaves signatures in multiply-lensed images of background galaxies that reveal whether the foreground lensing galaxy inhabits a $\\varrho$DM or $\\psi$DM halo. Whereas $\\varrho$DM lens models leave well documented anomalies between the predicted and observed brightnesses and positions of multiply-lensed images, $\\psi$DM lens models correctly predict the level of anomalies left over by $\\varrho$DM lens models. More challengingly, when subjected to a battery of tests for reproducing the quadruply-lensed triplet images in the system HS 0810+2554, $\\psi$DM is able to reproduce all aspects of this system whereas $\\varrho$DM often fails. The growing success of $\\psi$DM in reproducing astrophysical observations tilt the balance toward new physics invoking axions.\n\n", "2304.09878": "2023-04-19, **Simulating Atomic Dark Matter in Milky Way Analogues**, Sandip Roy et.al., [2304.09878v1](http://arxiv.org/abs/2304.09878v1)\n\n Dark sector theories naturally lead to multi-component scenarios for dark matter where a sub-component can dissipate energy through self-interactions, allowing it to efficiently cool inside galaxies. We present the first cosmological hydrodynamical simulations of Milky Way analogues where the majority of dark matter is collisionless Cold Dark Matter (CDM), but a sub-component (6%) is strongly dissipative minimal Atomic Dark Matter (ADM). The simulations, implemented in GIZMO and utilizing FIRE-2 galaxy formation physics to model the standard baryonic sector, demonstrate that the addition of even a small fraction of dissipative dark matter can significantly impact galactic evolution despite being consistent with current cosmological constraints. We show that ADM gas with roughly Standard-Model-like masses and couplings can cool to form a rotating \"dark disk\" with angular momentum closely aligned with the visible stellar disk. The morphology of the disk depends sensitively on the parameters of the ADM model, which affect the cooling rates in the dark sector. The majority of the ADM gas gravitationally collapses into dark \"clumps\" (regions of black hole or mirror star formation), which form a prominent bulge and a rotating thick disk in the central galaxy. These clumps form early and quickly sink to the inner ~kpc of the galaxy, affecting the galaxy's star-formation history and present-day baryonic and CDM distributions.\n\n", "2304.09880": "2023-04-19, **Halo assembly bias from a deep learning model of halo formation**, Luisa Lucie-Smith et.al., [2304.09880v1](http://arxiv.org/abs/2304.09880v1)\n\n We build a deep learning framework that connects the local formation process of dark matter halos to the halo bias. We train a convolutional neural network (CNN) to predict the final mass and concentration of dark matter halos from the initial conditions. The CNN is then used as a surrogate model to derive the response of the halos' mass and concentration to long-wavelength perturbations in the initial conditions, and consequently the halo bias parameters following the \"response bias\" definition. The CNN correctly predicts how the local properties of dark matter halos respond to changes in the large-scale environment, despite no explicit knowledge of halo bias being provided during training. We show that the CNN recovers the known trends for the linear and second-order density bias parameters $b\\_1$ and $b\\_2$, as well as for the local primordial non-Gaussianity linear bias parameter $b\\_\\phi$. The expected secondary assembly bias dependence on halo concentration is also recovered by the CNN: at fixed mass, halo concentration has only a mild impact on $b\\_1$, but a strong impact on $b\\_\\phi$. Our framework opens a new window for discovering which physical aspects of the halo's Lagrangian patch determine assembly bias, which in turn can inform physical models of halo formation and bias.\n\n", "2304.09810": "2023-04-19, **Warm dark Matter constraints from the joint analysis of CMB, Lyman-α, and global 21 cm data**, Atrideb Chatterjee et.al., [2304.09810v1](http://arxiv.org/abs/2304.09810v1)\n\n With the help of our previously built MCMC-based parameter estimation package \\texttt{CosmoReionMC}, we investigate in detail the potential of 21~cm global signal, when combined with CMB and observations related to the QSO absorption spectra, to constraint the mass of Warm Dark Matter (WDM) particle. For the first time, we simultaneously vary all the free parameters (mass of WDM particle, cosmological parameters, and astrophysical parameters) to address the long-overlooked issue of the possible degeneracies between the Dark Matter particle mass $m\\_X$ and cosmological/astrophysical parameters. From the existing CMB and QSO absorption spectra data, we can rule out $m\\_X < 2.8$~keV at 95\\% confidence level. Including the mock 21~cm global signal data expected in the future, the forecasted constraint is found to be much tighter $m\\_X > 7.7$~keV, assuming that the true dark matter model is the usual cold dark matter. In case the mock 21~cm signal is constructed for dark matter particles having $m\\_X = 7$~keV, our forecasts indicate that $\\left(m\\_X / \\text{keV}\\right)^{-1}$ is in the range $[0.1, 0.2]$ ($95\\%$ confidence level). This implies that the future 21~cm data should allow detection of the WDM particle mass if $m\\_X \\sim 7$~keV\n\n", "2304.09671": "2023-04-19, **Modified General Relativity and dark matter**, Gary Nash et.al., [2304.09671v1](http://arxiv.org/abs/2304.09671v1)\n\n Modified General Relativity (MGR) is the natural extension of General Relativity (GR). MGR explicitly uses the smooth regular line element vector field $(\\bm{X},-\\bm{X}) $, which exists in all Lorentzian spacetimes, to construct a connection-independent symmetric tensor that represents the energy-momentum of the gravitational field. It solves the problem of the non-localization of gravitational energy-momentum in GR, preserves the ontology of the Einstein equation, and maintains the equivalence principle. The line element field provides MGR with the extra freedom required to describe dark energy and dark matter. An extended Schwarzschild solution for the matter-free Einstein equation of MGR is developed, from which the Tully-Fisher relation is derived, and the gravitational energy density is calculated. The mass of the invisible matter halo of galaxy NGC 3198 calculated with MGR is identical to the result obtained from GR using a dark matter profile. Although dark matter in MGR is described geometrically, it has an equivalent representation as a particle with the property of a vector boson or a pair of fermions; the geometry of spacetime and the quantum nature of matter are linked together by the unit line element covectors that belong to both the Lorentzian metric and the spin-1 Klein-Gordon wave equation. The three classic tests of GR provide a comparison of the theories in the solar system and several parts of the cosmos. MGR provides the flexibility to describe inflation after the Big Bang and galactic anisotropies.\n\n", "2304.09614": "2023-04-19, **Confronting strange stars with compact-star observations and new physics**, Shu-Hua Yang et.al., [2304.09614v1](http://arxiv.org/abs/2304.09614v1)\n\n Strange stars ought to exist in the universe according to the strange quark matter hypothesis, which states that matter made of roughly equal numbers of up, down, and strange quarks could be the true ground state of baryonic matter rather than ordinary atomic nuclei. Theoretical models of strange quark matter, such as the standard MIT bag model, the density-dependent quark mass model, or the quasi-particle model, however, appear to be unable to reproduce some of the properties (masses, radii and tidal deformabilities) of recently observed compact stars. This is different if alternative gravity theory (e.g., non-Newtonian gravity) or dark matter (e.g., mirror dark matter) are considered, which resolve these issues. The possible existence of strange stars could thus provide a clue to new physics, as discussed in this review.\n\n", "2304.09541": "2023-04-19, **Universality of Bose-Einstein Condensation and Quenched Formation Dynamics**, Nick P. Proukakis et.al., [2304.09541v1](http://arxiv.org/abs/2304.09541v1)\n\n The emergence of macroscopic coherence in a many-body quantum system is a ubiquitous phenomenon across different physical systems and scales. This Chapter reviews key concepts characterizing such systems (correlation functions, condensation, quasi-condensation) and applies them to the study of emerging non-equilibrium features in the dynamical path towards such a highly-coherent state: particular emphasis is placed on emerging universal features in the dynamics of conservative and open quantum systems, their equilibrium or non-equilibrium nature, and the extent that these can be observed in current experiments with quantum gases. Characteristic examples include symmetry-breaking in the Kibble-Zurek mechanism, coarsening and phase-ordering kinetics, and universal spatiotemporal scalings around non-thermal fixed points and in the context of the Kardar- Parisi-Zhang equation; the Chapter concludes with a brief review of the potential relevance of some of these concepts in modelling the large-scale distribution of dark matter in the universe.\n\n", "2304.09363": "2023-04-19, **Characteristic modes of thick brane model: resonances and quasinormal modes**, Qin Tan et.al., [2304.09363v1](http://arxiv.org/abs/2304.09363v1)\n\n In this work, we investigate the gravitational quasinormal modes (QNMs) and the gravitational resonances of a thick brane model. We use the asymptotic iteration and shooting methods to obtain the quasinormal frequencies (QNFs) of the brane. On the other hand, we investigate the resonances and their evolution numerically. The results show that the oscillations of the resonances equal (up to numerical error) to the real parts of the QNFs, while the damping rates of the resonances equal to the imaginary parts of the QNFs. The QNMs and resonances, both of them can be regarded as the characteristic modes of the thick brane, are closely related with each other. In addition, the lifetimes of the QNMs might reach the age of our universe. Such a long-lived Kaluza-Klein modes could be a candidate for dark matter.\n\n"}, "supernova": {"2304.10416": "2023-04-20, **A Superluminous Supernova Lightened by Collisions with Pulsational Pair-instability Shells**, Weili Lin et.al., [2304.10416v1](http://arxiv.org/abs/2304.10416v1)\n\n Superluminous supernovae are among the most energetic stellar explosions in the Universe, but their energy sources remain an open question. Here we present long-term observations of one of the closest examples of the hydrogen-poor subclass (SLSNe-I), SN~2017egm, revealing the most complicated known luminosity evolution of SLSNe-I. Three distinct post-peak bumps were recorded in its light curve collected at about $100$--350\\,days after maximum brightness, challenging current popular power models such as magnetar, fallback accretion, and interaction between ejecta and a circumstellar shell. However, the complex light curve can be well modelled by successive interactions with multiple circumstellar shells with a total mass of about $6.8$--7.7\\,M$\\_\\odot$. In this scenario, large energy deposition from interaction-induced reverse shocks results in ionization of neutral oxygen in the supernova ejecta and hence a much lower nebular-phase line ratio of [O\\,\\textsc{i}] $\\lambda6300$/([Ca\\,\\textsc{ii}] + [O\\,\\textsc{ii}]) $\\lambda7300$ ($\\sim 0.2$) compared with that derived for other superluminous and normal stripped-envelope SNe. The pre-existing multiple shells indicate that the progenitor of SN~2017egm experienced pulsational mass ejections triggered by pair instability within 2 years before explosion, in robust agreement with theoretical predictions for a pre-pulsation helium-core mass of 48--51\\,M$\\_{\\odot}$.\n\n", "2304.10160": "2023-04-20, **Bayesian evidence and model selection approach for time-dependent dark energy**, Mohsen Khorasani et.al., [2304.10160v1](http://arxiv.org/abs/2304.10160v1)\n\n We use parameterized post-Friedmann (PPF) description for dark energy and apply ellipsoidal nested sampling to perform the Bayesian model selection method on different time-dependent dark energy models using a combination of $Planck$ and data based on distance measurements, namely baryon acoustic oscillations and supernovae luminosity distance. Models with two and three free parameters described in terms of linear scale factor $a$, or scaled in units of e-folding $\\ln a$ are considered. Our results show that parameterizing dark energy in terms of $\\ln a$ provides better constraints on the free parameters than polynomial expressions. In general, two free-parameter models are adequate to describe the dynamics of the dark energy compared to their three free-parameter generalizations. According to the Bayesian evidence, determining the strength of support for cosmological constant $\\Lambda$ over polynomial dark energy models remains inconclusive. Furthermore, considering the $R$ statistic as the tension metric shows that one of the polynomial models gives rise to a tension between $Planck$ and distance measurements data sets. The preference for the logarithmic equation of state over $\\Lambda$ is inconclusive, and the strength of support for $\\rm \\Lambda$CDM over the oscillating model is moderate.\n\n", "2304.10129": "2023-04-20, **Early-time spectroscopic modelling of the transitional Type Ia Supernova 2021rhu with TARDIS**, Luke Harvey et.al., [2304.10129v1](http://arxiv.org/abs/2304.10129v1)\n\n An open question in SN Ia research is where the boundary lies between 'normal' Type Ia supernovae (SNe Ia) that are used in cosmological measurements and those that sit off the Phillips relation. We present the spectroscopic modelling of one such '86G-like' transitional SN Ia, SN 2021rhu, that has recently been employed as a local Hubble Constant calibrator using a tip of the red-giant branch measurement. We detail its modelling from -12 d until maximum brightness using the radiative-transfer spectral-synthesis code tardis. We base our modelling on literature delayed-detonation and deflagration models of Chandrasekhar mass white dwarfs, as well as the double-detonation models of sub-Chandrasekhar mass white dwarfs. We present a new method for 'projecting' abundance profiles to different density profiles for ease of computation. Due to the small velocity extent and low outer densities of the W7 profile, we find it inadequate to reproduce the evolution of SN 2021rhu as it fails to match the high-velocity calcium components. The host extinction of SN 2021rhu is uncertain but we use modelling with and without an extinction correction to set lower and upper limits on the abundances of individual species. Comparing these limits to literature models we conclude that the spectral evolution of SN 2021rhu is also incompatible with double-detonation scenarios, lying more in line with those resulting from the delayed detonation mechanism (although there are some discrepancies, in particular a larger titanium abundance in SN 2021rhu compared to the literature). This suggests that SN 2021rhu is likely a lower luminosity, and hence lower temperature, version of a normal SN Ia.\n\n", "2304.09766": "2023-04-19, **On the energy flow of $λ$ in Hořava-Lifshitz cosmology**, Ewa Czuchry et.al., [2304.09766v1](http://arxiv.org/abs/2304.09766v1)\n\n Ho\\v{r}ava-Lifshitz gravity has been proposed as a ghost-free quantum gravity model candidate with an anisotropic UV-scaling between space and time. We present here a cosmological background analysis of two different formulations of the theory, with particular focus on the running of the parameter $\\lambda$. Using a large dataset consisting of Cosmic Microwave Background data from {\\it Planck}, Pantheon+ supernovae catalogue, SH0ES Cepheid variable stars, Baryon acoustic oscillations (BAO), Cosmic Chronometers, and gamma-ray bursts (GRB), we arrive at new bounds on the cosmological parameters, in particular $\\lambda$, which describes deviation from classical general relativity. For the detailed balance scenario we arrive at the bound $\\lambda=1.02726\\pm0.00012$, and for beyond detailed balance the limit reads $\\lambda=0.9949^{+0.0045}\\_{-0.0046}$. We also study the influence of different data sets and priors, and we find that removing low-redshift data generally moves $\\lambda$ closer towards UV values, whilst simultaneously widening the error bars. In the detailed balance scenario, this effect is more noticeable, and $\\lambda$ takes on values that are significantly below unity, which corresponds to the infrared limit of the theory.\n\n", "2304.09508": "2023-04-19, **POLAR -- I: linking the 21-cm signal from the epoch of reionization to galaxy formation**, Qing-Bo Ma et.al., [2304.09508v1](http://arxiv.org/abs/2304.09508v1)\n\n To self-consistently model galactic properties, reionization of the intergalactic medium, and the associated 21-cm signal, we have developed the algorithm polar by integrating the one-dimensional radiative transfer code grizzly with the semi-analytical galaxy formation code L-Galaxies 2020. Our proof-of-concept results are consistent with observations of the star formation rate history, UV luminosity function and the CMB Thomson scattering optical depth. We then investigate how different galaxy formation models affect UV luminosity functions and 21-cm power spectra, and find that while the former are most sensitive to the parameters describing the merger of halos, the latter have a stronger dependence on the supernovae feedback parameters, and both are affected by the escape fraction model.\n\n", "2304.09350": "2023-04-19, **Black holes as the end state of stellar evolution: Theory and simulations**, Alexander Heger et.al., [2304.09350v1](http://arxiv.org/abs/2304.09350v1)\n\n The collapse of massive stars is one of the most-studied paths to black hole formation. In this chapter, we review black hole formation during the collapse of massive stars in the broader context of single and binary stellar evolution and the theory of supernova explosions. We provide a concise overview of the evolutionary channels that may lead to black hole formation -- the classical route of iron core collapse, collapse due to pair instability in very massive stars, and the hypothetical scenario of supermassive star collapse. We then review the current understanding of the parameter space for black hole formation and black hole birth properties that has emerged from theoretical and computational modelling of supernova explosions and transient observations. Finally, we discuss what the intricate interplay between stellar evolution, stellar explosions, and binary interactions implies for the formation of stellar-mass black holes.\n\n"}}