{"neutrino": {"2402.09362": "2024-02-14, **Long-Distance Nuclear Matrix Elements for Neutrinoless Double-Beta Decay from Lattice QCD**, Zohreh Davoudi et.al., [2402.09362v1](http://arxiv.org/abs/2402.09362v1)\n\n Neutrinoless double-beta ($0\\nu\\beta\\beta$) decay is a heretofore unobserved process which, if observed, would imply that neutrinos are Majorana particles. Interpretations of the stringent experimental constraints on $0\\nu\\beta\\beta$-decay half-lives require calculations of nuclear matrix elements. This work presents the first lattice quantum-chromodynamics (LQCD) calculation of the matrix element for $0\\nu\\beta\\beta$ decay in a multi-nucleon system, specifically the $nn \\rightarrow pp ee$ transition, mediated by a light left-handed Majorana neutrino propagating over nuclear-scale distances. This calculation is performed with quark masses corresponding to a pion mass of $m\\_\\pi = 806$ MeV at a single lattice spacing and volume. The statistically cleaner $\\Sigma^- \\rightarrow \\Sigma^+ ee$ transition is also computed in order to investigate various systematic uncertainties. The prospects for matching the results of LQCD calculations onto a nuclear effective field theory to determine a leading-order low-energy constant relevant for $0\\nu\\beta\\beta$ decay with a light Majorana neutrino are investigated. This work, therefore, sets the stage for future calculations at physical values of the quark masses that, combined with effective field theory and nuclear many-body studies, will provide controlled theoretical inputs to experimental searches of $0\\nu\\beta\\beta$ decay.\n\n", "2402.09301": "2024-02-14, **Exploring semi-inclusive two-nucleon emission in neutrino scattering: a factorized approximation approach**, V. L. Martinez-Consentino et.al., [2402.09301v1](http://arxiv.org/abs/2402.09301v1)\n\n The semi-inclusive cross section of two-nucleon emission induced by neutrinos and antineutrinos is computed employing the relativistic mean field model of nuclear matter and the dynamics of meson exchange currents. Within this model we explore a factorization approximation based on the product of an integrated two-hole spectral function and a two-nucleon cross section averaged over hole pairs. We demonstrate that the integrated spectral function of the uncorrelated Fermi gas can be analytically computed, and we derive a simple fully relativistic formula for this function, showcasing its dependency solely on both missing momentum and missing energy. A prescription for the average momenta of the two holes in the factorized two-nucleon cross section is provided, assuming that these momenta are perpendicular to the missing momentum in the center-of-mass system. The validity of the factorized approach is assessed by comparing it with the unfactorized calculation. Our investigation includes the study of the semi-inclusive cross section integrated over the energy of one of the emitted nucleons and the cross section integrated over the emission angles of the two nucleons and the outgoing muon kinematics. A comparison is made with the pure phase-space model and other models from the literature. The results of this analysis offer valuable insights into the influence of the semi-inclusive hadronic tensor on the cross section, providing a deeper understanding of the underlying nuclear processes.\n\n", "2402.09274": "2024-02-14, **Neutrino flavor transformation with moments: application to fast flavor instabilities in neutron star mergers**, Julien Froustey et.al., [2402.09274v1](http://arxiv.org/abs/2402.09274v1)\n\n Neutrino evolution, of great importance in environments such as neutron star mergers (NSMs) because of their impact on explosive nucleosynthesis, is still poorly understood due to the high complexity and variety of possible flavor conversion mechanisms. In this study, we focus on so-called \"fast flavor oscillations\", which can occur on timescales of nanoseconds and are connected to the existence of a crossing between the angular distributions of electron (anti)neutrinos. Based on the neutrino radiation field drawn from a three dimensional neutron star merger simulation, we use an extension of the two-moment formalism of neutrino quantum kinetics, and perform a linear stability analysis to determine the characteristics of fast flavor instabilities across the simulation. We compare the results to local (centimeter-scale) three-dimensional two-flavor simulations using either a moment method or a particle-in-cell architecture. We get generally good agreement in the instability growth rate and typical instability lengthscale, although the imperfections of the closure used in moment methods remain to be better understood.\n\n", "2402.09088": "2024-02-14, **Differential Sensitivity of the KM3NeT/ARCA detector to a diffuse neutrino flux and to point-like source emission: exploring the case of the Starburst Galaxies**, KM3NeT Collaboration et.al., [2402.09088v1](http://arxiv.org/abs/2402.09088v1)\n\n KM3NeT/ARCA is a Cherenkov neutrino telescope under construction in the Mediterranean sea, optimised for the detection of astrophysical neutrinos with energies above $\\sim$1~TeV. In this work, using Monte Carlo simulations including all-flavour neutrinos, the integrated and differential sensitivities for KM3NeT/ARCA are presented considering the case of a diffuse neutrino flux as well as extended and point-like neutrino sources. This analysis is applied to Starburst Galaxies demonstrating that the detector has the capability of tracing TeV neutrinos from these sources. Remarkably, after eight years, a hard power-law spectrum from the nearby Small Magellanic Cloud can be constrained. The sensitivity and discovery potential for NGC 1068 is also evaluated showing that KM3NeT/ARCA will discriminate between different astrophysical components of the measured neutrino flux after 3 years of data taking.\n\n", "2402.08896": "2024-02-14, **Ergodicity demystifies fast neutrino flavor instability**, Lucas Johns et.al., [2402.08896v1](http://arxiv.org/abs/2402.08896v1)\n\n Flavor ergodicity implies that angular crossings are necessary and sufficient for fast instability.\n\n"}, "dark matter": {"2402.09310": "2024-02-14, **Phase transition catalyzed by primordial black holes**, Zhen-Min Zeng et.al., [2402.09310v1](http://arxiv.org/abs/2402.09310v1)\n\n We investigate the first-order phase transition catalyzed by primordial black holes~(PBHs) in the early Universe. We find that super-horizon curvature perturbations generated in this scenario lead to the production of gravitational waves when the scalar modes re-enter the horizon. If PBHs with masses about $10^{-13}M\\_{\\odot}$ constitute all dark matter, the first-order electroweak phase transition catalyzed by PBHs can explain the gravitational wave signal observed by pulsar timing array collaborations without the overproduction of PBHs.\n\n", "2402.08935": "2024-02-14, **Search for ultralight vector dark matter with a Torsion Pendulum Dual Oscillator**, Ling Sun et.al., [2402.08935v1](http://arxiv.org/abs/2402.08935v1)\n\n Ultralight bosons with masses in the range from $\\sim 10^{-22}$ eV to $\\sim 1$ eV, are well-motivated, wave-like dark matter candidates. Particles on the lower-mass end are less explored in experiments due to their vanishingly small mass and weak coupling to the Standard Model. We propose to search for U(1)$\\_{B\\!-\\!L}$ gauge boson dark matter using a Torsion Pendulum Dual Oscillator (TorPeDO), a sensor originally designed to detect Newtonian gravitational field fluctuations with an enhanced differential torque sensitivity in a frequency band of $\\sim 10^{-2}$-$10$ Hz. We describe the experiment setup of a modified TorPeDO sensor, equipped with four 5-kg end test masses (two made from beryllium and two from aluminium). We present the estimated sensitivity to an ultralight dark matter field coupled to baryon minus lepton ($B\\!-\\!L$) number, in a mass range of $\\sim 10^{-17}$-$10^{-13}$ eV. The projected constraints on the coupling constant $g\\_{B\\!-\\!L} (\\hbar c)^{-1/2}$ can reach $\\sim 10^{-29}$ for a boson mass of $\\sim 10^{-15}$ eV in the most sensitive frequency band.\n\n", "2402.08865": "2024-02-14, **New constraints on ultraheavy dark matter from the LZ experiment**, J. Aalbers et.al., [2402.08865v1](http://arxiv.org/abs/2402.08865v1)\n\n Searches for dark matter with liquid xenon time projection chamber experiments have traditionally focused on the region of the parameter space that is characteristic of weakly interacting massive particles, ranging from a few GeV/$c^2$ to a few TeV/$c^2$. Models of dark matter with a mass much heavier than this are well motivated by early production mechanisms different from the standard thermal freeze-out, but they have generally been less explored experimentally. In this work, we present a re-analysis of the first science run (SR1) of the LZ experiment, with an exposure of $0.9$ tonne$\\times$year, to search for ultraheavy particle dark matter. The signal topology consists of multiple energy deposits in the active region of the detector forming a straight line, from which the velocity of the incoming particle can be reconstructed on an event-by-event basis. Zero events with this topology were observed after applying the data selection calibrated on a simulated sample of signal-like events. New experimental constraints are derived, which rule out previously unexplored regions of the dark matter parameter space of spin-independent interactions beyond a mass of 10$^{17}$ GeV/$c^2$.\n\n"}, "supernova": {}}