{"neutrino": {"2305.05184": "2023-05-09, **Flavor-dependent long-range neutrino interactions in DUNE & T2HK: alone they constrain, together they discover**, Masoom Singh et.al., [2305.05184v1](http://arxiv.org/abs/2305.05184v1)\n\n Discovering new neutrino interactions would represent evidence of physics beyond the Standard Model. We focus on new flavor-dependent long-range neutrino interactions mediated by ultra-light mediators, with masses below $10^{-10}$ eV, introduced by new lepton-number gauge symmetries $L\\_e-L\\_\\mu$, $L\\_e-L\\_\\tau$, and $L\\_\\mu-L\\_\\tau$. Because the interaction range is ultra-long, nearby and distant matter - primarily electrons and neutrons - in the Earth, Moon, Sun, Milky Way, and the local Universe, may source a large matter potential that modifies neutrino oscillation probabilities. The upcoming Deep Underground Neutrino Experiment (DUNE) and the Tokai-to-Hyper-Kamiokande (T2HK) long-baseline neutrino experiments will provide an opportunity to search for these interactions, thanks to their high event rates and well-characterized neutrino beams. We forecast their probing power. Our results reveal novel perspectives. Alone, DUNE and T2HK may strongly constrain long-range interactions, setting new limits on their coupling strength for mediators lighter than $10^{-18}$ eV. However, if the new interactions are subdominant, then both DUNE and T2HK, together, will be needed to discover them, since their combination lifts parameter degeneracies that weaken their individual sensitivity. DUNE and T2HK, especially when combined, provide a valuable opportunity to explore physics beyond the Standard Model.\n\n", "2305.05135": "2023-05-09, **Search for astrophysical electron antineutrinos in Super-Kamiokande with 0.01wt% gadolinium loaded water**, M. Harada et.al., [2305.05135v1](http://arxiv.org/abs/2305.05135v1)\n\n We report the first search result for the flux of astrophysical electron antineutrinos for energies O(10) MeV in the gadolinium-loaded Super-Kamiokande (SK) detector. In June 2020, gadolinium was introduced to the ultra-pure water of the SK detector in order to detect neutrons more efficiently. In this new experimental phase, SK-Gd, we can search for electron antineutrinos via inverse beta decay with efficient background rejection and higher signal efficiency thanks to the high efficiency of the neutron tagging technique. In this paper, we report the result for the initial stage of SK-Gd with a $22.5\\times552$ $\\rm kton\\cdot day$ exposure at 0.01% Gd mass concentration. No significant excess over the expected background in the observed events is found for the neutrino energies below 31.3 MeV. Thus, the flux upper limits are placed at the 90% confidence level. The limits and sensitivities are already comparable with the previous SK result with pure-water ($22.5 \\times 2970 \\rm kton\\cdot day$) owing to the enhanced neutron tagging.\n\n", "2305.04943": "2023-05-08, **Dark Matter Direct Detection on the Moon**, Andrea Gaspert et.al., [2305.04943v1](http://arxiv.org/abs/2305.04943v1)\n\n Direct searches for dark matter with large-scale noble liquid detectors have become sensitive enough to detect the coherent scattering of local neutrinos. This will become a very challenging background to dark matter discovery in planned future detectors. For dark matter with mass above 10 GeV, the dominant neutrino backgrounds on the Earth are atmospheric neutrinos created by cosmic ray collisions with the atmosphere. In contrast, the Moon has almost no atmosphere and nearly all cosmic rays incident on the Moon first collide with the lunar surface, producing a very different neutrino spectrum. In this work we estimate the total flux and spectrum of neutrinos near the surface of the Moon. We then use this to show that a large-scale liquid xenon or argon detector located on the Moon could potentially have significantly greater sensitivity to dark matter compared to an equivalent detector on the Earth due to effectively reduced neutrino backgrounds.\n\n", "2305.04916": "2023-05-08, **Neutrino many-body correlations**, Lucas Johns et.al., [2305.04916v1](http://arxiv.org/abs/2305.04916v1)\n\n This paper responds to suggestions that the standard approach to collective neutrino oscillations leaves out potentially important quantum many-body correlations. Arguments in favor of this idea have been based on calculations that, on close scrutiny, offer no evidence either way. Inadequacies of the usual quantum-kinetic formalism are not currently supported by the literature.\n\n", "2305.04795": "2023-05-08, **Non-thermal emissions from a head-tail radio galaxy in 3D magnetohydrodynamic simulations**, Takumi Ohmura et.al., [2305.04795v1](http://arxiv.org/abs/2305.04795v1)\n\n We present magnetohydrodynamic simulations of a jet-wind interaction in a galaxy cluster and the radio to gamma-ray and the neutrino emissions from this \"head-tail galaxy\". Our simulation follows the evolution of cosmic-ray (CR) particle spectra with energy losses and the stochastic turbulence acceleration. We find that the reacceleration is essential to explain the observed radio properties of head-tail galaxies, in which the radio flux and spectral index do not drastically change. Our models suggest that hard X-ray emissions can be detected around the head-tail galaxy in the Perseus cluster by the hard X-ray satellites, such as FORCE, and it will potentially constrain the acceleration efficiency. We also explore the origin of the collimated synchrotron threads, which are found in some head-tail galaxies by recent high-quality radio observations. Thin and elongated flux tubes, connecting the two tails, are formed by strong backflows at an early phase. We find that these threads advect with the wind for over 300 Myr without disrupting. The radio flux from the flux tubes is much lower than the typical observed flux. An efficient CR diffusion process along the flux tubes, however, may solve this discrepancy.\n\n", "2305.04681": "2023-05-08, **Minimal model inspired by family number and dark matter**, Duong Van Loi et.al., [2305.04681v1](http://arxiv.org/abs/2305.04681v1)\n\n We consider a gauge symmetry extension of the standard model given by $SU(3)\\_C\\otimes SU(2)\\_L\\otimes U(1)\\_X\\otimes U(1)\\_N\\otimes Z\\_2$ with minimal particle content, where $X$ and $N$ are family dependent but determining the hypercharge as $Y=X+N$, while $Z\\_2$ is an exact discrete symmetry. In our scenario, $X$ (while $N$ is followed by $X-Y$) and $Z\\_2$ charge assignments are inspired by the number of fermion families and the stability of dark matter, as observed, respectively. We examine the mass spectra of fermions, scalars, and gauge bosons, as well as their interactions, in presence of a kinetic mixing term between $U(1)\\_{X,N}$ gauge fields. We discuss in detail the phenomenology of the new gauge boson and the right-handed neutrino dark matter stabilized by $Z\\_2$ conservation. We obtain parameter spaces simultaneously satisfying the recent CDF $W$-boson mass, electroweak precision measurements, particle colliders, as well as dark matter observables, if the kinetic mixing parameter is not necessarily small.\n\n"}, "dark matter": {"2305.05667": "2023-05-09, **New MGCAMB tests of gravity with CosmoMC and Cobaya**, Zhuangfei Wang et.al., [2305.05667v1](http://arxiv.org/abs/2305.05667v1)\n\n We present a new version of MGCAMB, a patch for the Einstein-Boltzmann solver CAMB for cosmological tests of gravity. New features include a new cubic-spline parameterization allowing for a simultaneous reconstruction of $\\mu$, $\\Sigma$ and the dark energy density fraction $\\Omega\\_X$ as functions of redshift, the option to work with a direct implementation of $\\mu$, $\\Sigma$ (instead of converting to $\\mu$, $\\gamma$ first), along with the option to test models with a scalar field coupled only to dark matter, and the option to include dark energy perturbations when working with $w\\ne -1$ backgrounds, to restore consistency with CAMB in the GR limit. This version of MGCAMB comes with a python wrapper to run it directly from the python interface, an implementation in the latest version of CosmoMC, and can be used with Cobaya.\n\n", "2305.05664": "2023-05-09, **R-modes as a New Probe of Dark Matter in Neutron Stars**, Swarnim Shirke et.al., [2305.05664v1](http://arxiv.org/abs/2305.05664v1)\n\n In this work, we perform the first systematic investigation of effects of the presence of dark matter on r-mode oscillations in neutron stars (NSs). Using a self-interacting dark matter (DM) model based on the neutron decay anomaly and a hadronic model obtained from the posterior distribution of a recent Bayesian analysis, we impose constraints on the DM self-interaction strength using recent multimessenger astrophysical observations. The constrained DM interaction strength is then used to estimate DM self-interaction cross section and shear viscosity resulting from DM, which is found to be several orders of magnitude smaller than shear viscosity due to hadronic matter. Assuming that the DM fermion is in chemical equilibrium with the neutrons in the neutron star, we estimate the bulk viscosity resulting from the dark decay of neutrons, and find it to be much smaller than the hadronic bulk viscosity. We also conclude that the instability window with minimal hadronic damping mechanisms can become smaller when including DM shear and bulk viscosity but remains incompatible with the X-ray and pulsar observational data for the chosen DM model.\n\n", "2305.05155": "2023-05-09, **Constraining $p$-wave Dark Matter Annihilation with Gamma-ray Observations of M87**, Katharena Christy et.al., [2305.05155v1](http://arxiv.org/abs/2305.05155v1)\n\n We consider constraints on $p$-wave dark matter in a dark matter spike surrounding the supermassive black hole at the center of M87. Owing to the large mass of the black hole, and resulting large velocity dispersion for the dark matter particles in the spike, it is possible for Fermi-LAT and MAGIC data to place tight constraints on $p$-wave annihilation, which would be far more stringent than those placed by observations of dwarf spheroidal galaxies. Indeed, for optimistic choices of the spike parameters, gamma-ray data would exclude thermal $p$-wave dark matter models with a particle mass $\\lesssim {10}~\\rm TeV$. But there is significant uncertainty in the properties and parameters of the spike, and for less optimistic scenarios, thermal dark matter candidates would be completely unconstrained. In addition to better understanding the spike parameters, a second key to improving constraints on dark matter annihilation is an accurate astrophysical background model.\n\n", "2305.05125": "2023-05-09, **Accurate electron-recoil ionization factors for dark matter direct detection in xenon, krypton and argon**, A. R. Caddell et.al., [2305.05125v1](http://arxiv.org/abs/2305.05125v1)\n\n While most scintillation-based dark matter experiments search for Weakly Interacting Massive Particles (WIMPs), a sub-GeV WIMP-like particle may also be detectable in these experiments. While dark matter of this type and scale would not leave appreciable nuclear recoil signals, it may instead induce ionization of atomic electrons. Accurate modelling of the atomic wavefunctions is key to investigating this possibility, with incorrect treatment leading to a large suppression in the atomic excitation factors. We have calculated these atomic factors for argon, krypton and xenon and present the tabulated results for use with a range of dark matter models. This is made possible by the separability of the atomic and dark matter form factor, allowing the atomic factors to be calculated for general couplings; we include tables for vector, scalar, pseudovector, and pseudoscalar electron couplings. Additionally, we calculate electron impact total ionization cross sections for xenon using the tabulated results as a test of accuracy. Lastly, we provide an example calculation of the event rate for dark matter scattering on electrons in XENON1T and show that these calculations depend heavily on how the low-energy response of the detector is modelled.\n\n", "2305.05067": "2023-05-08, **Constraining SIDM cross section models with a joint analysis of galaxies and clusters**, Shengqi Yang et.al., [2305.05067v1](http://arxiv.org/abs/2305.05067v1)\n\n One necessary step for probing the nature of self-interacting dark matter (SIDM) particles with astrophysical observations is to pin down any possible velocity dependence in the SIDM cross section. Major challenges for achieving this goal include eliminating, or mitigating, the impact of the baryonic components and tidal effects within the dark matter halos of interest -- the effects of these processes can be highly degenerate with those of dark matter self-interactions at small scales. In this work we select 9 isolated galaxies and brightest cluster galaxies (BCGs) with baryonic components small enough such that the baryonic gravitational potentials do not significantly influence the halo gravothermal evolution processes. We then constrain the parameters of a cross section model $\\sigma(v)=\\sigma\\_0/(1+v^2/\\omega^2)^2$ with the measured rotation curves and stellar kinematics through the gravothermal fluid formalism and isothermal method. We are able to constrain a best-fit double power-law result with the gravothermal fluid formalism $\\log(\\sigma\\_0/[\\mathrm{cm^2/g}])=2.6/[(\\log(\\omega/[\\mathrm{km/s}])/1.9)^{0.85}+(\\log(\\omega/[\\mathrm{km/s}])/1.9)^{5.5}]-1.1$ with $\\log(\\omega/[\\mathrm{km/s}])\\leq3.7$ and a scatter of 0.5 dex at a 68% confidence level. The constraint given by the isothermal model is $\\log(\\sigma\\_0/[\\mathrm{cm^2/g}])=3.9/[(\\log(\\omega/[\\mathrm{km/s}])/1.6)^{0.29}+(\\log(\\omega/[\\mathrm{km/s}])/1.6)^{5.1}]-0.34$ with $1.4\\leq\\log(\\omega/[\\mathrm{km/s}])\\leq3.5$ and a scatter of 0.34 dex at 68% confidence level. Cross sections constrained by the two methods are consistent at $2\\sigma$ confidence level, but the isothermal method prefers cross sections greater than the gravothermal approach constraints by a factor of $\\sim4$.\n\n", "2305.04949": "2023-05-08, **The Impact of Cosmic Variance on Inferences of Global Neutral Fraction Derived from Ly$α$ Luminosity Functions During Reionization**, Sean Bruton et.al., [2305.04949v1](http://arxiv.org/abs/2305.04949v1)\n\n We investigate the impact of field-to-field variation, deriving from cosmic variance, in measured Lyman-$\\alpha$ emitter (LAE) luminosity functions (LFs) and this variation's impact on inferences of the neutral fraction of the intergalactic medium (IGM) during reionization. We post-process a z=7 IGM simulation to populate the dark matter halos with LAEs. These LAEs have realistic UV magnitudes, Ly$\\alpha$ fluxes, and Ly$\\alpha$ line profiles. We calculate the attenuation of Ly$\\alpha$ emission in universes with varying IGM neutral fraction, $\\bar{\\rm{x}}\\_{\\rm{HI}}$. In a $\\bar{\\rm{x}}\\_{\\rm{HI}}=0.3$ simulation, we perform 100 realizations of a mock 2 square degree survey with a redshift window $\\Delta z = 0.5$ and flux limit $\\rm{f}\\_{Ly\\alpha}>1\\times10^{-17}\\:\\rm{ergs}\\:\\: \\rm{s}^{-1} \\: \\rm{cm}^{-2}$; such a survey is typical in depth and volume of the largest LAE surveys conducted today. For each realization, we compute the LAE LF and use it to recover the input $\\bar{\\rm{x}}\\_{\\rm{HI}}$. Comparing the inferred values of $\\bar{\\rm{x}}\\_{\\rm{HI}}$ across the ensemble of the surveys, we find that cosmic variance, deriving from large-scale structure and variation in the neutral gas along the sightline, imposes a floor in the uncertainty of $\\Delta \\bar{\\rm{x}}\\_{\\rm{HI}} \\sim 0.2$ when $\\bar{\\rm{x}}\\_{\\rm{HI}}$ $=0.3$. We explore mitigation strategies to decrease this uncertainty, such as increasing the volume, decreasing the flux limit, or probing the volume with many independent fields. Increasing the area and/or depth of the survey does not mitigate the uncertainty, but composing a survey with many independent fields is effective. This finding highlights the best strategy for LAE surveys aiming at constraining $\\bar{\\rm{x}}\\_{\\rm{HI}}$ of the universe during reionization.\n\n", "2305.04924": "2023-05-08, **Primordial black holes from strong first-order phase transitions**, Marek Lewicki et.al., [2305.04924v1](http://arxiv.org/abs/2305.04924v1)\n\n We study the formation of primordial black holes (PBHs) in strongly supercooled first-order phase transitions. The mechanism is based on the presence of remnants dominated by the false vacuum that scale slower with the expansion of the Universe than their surroundings where this energy was already converted into radiation. We compute the PBH formation from these remnants including the contribution from the false vacuum and the bubble walls, by estimating the collapse using the hoop conjecture and by considering both regions collapsing immediately when entering the horizon and sub-horizon regions that collapse as their compactness grows. We show that for exponential bubble nucleation rate, $\\Gamma \\propto e^{\\beta t}$, the primordial black hole formation implies $\\beta/H \\gtrsim 3.8$, where $H$ denotes the Hubble rate, if the potential energy of the false vacuum is $\\Delta V \\lesssim (10^{12} {\\rm GeV})^4$, as otherwise a too large abundance of long-lived PBHs forms. The observed dark matter abundance can be formed in asteroid mass PBHs if $\\beta/H \\simeq 3.8$ and $10^5 {\\rm GeV} \\lesssim \\Delta V^{1/4} \\lesssim 10^8 {\\rm GeV}$. Finally, we consider also the effect of the second order correction to the exponential nucleation rate showing that the PBH abundance is mainly determined by the average radius of the true vacuum bubbles.\n\n", "2305.04690": "2023-05-08, **Exploring light dark matter with the Migdal effect in hydrogen-doped liquid xenon**, Nicole F. Bell et.al., [2305.04690v1](http://arxiv.org/abs/2305.04690v1)\n\n An ongoing challenge in dark matter direct detection is to improve the sensitivity to light dark matter in the MeV--GeV mass range. One proposal is to dope a liquid noble-element direct detection experiment with a lighter element such as hydrogen. This has the advantage of enabling larger recoil energies compared to scattering on a heavy target, while leveraging existing detector technologies. Direct detection experiments can also extend their reach to lower masses by exploiting the Migdal effect, where a nuclear recoil leads to electronic ionisation or excitation. In this work we combine these ideas to study the sensitivity of a hydrogen-doped LZ experiment (HydroX), and a future large-scale experiment such as XLZD. We find that HydroX could have sensitivity to dark matter masses as low as 5~MeV for both spin-independent and spin-dependent scattering, with XLZD extending that reach to lower cross sections. Notably, this technique substantially enhances the sensitivity of direct detection to spin-dependent proton scattering, well beyond the reach of any current experiments.\n\n", "2305.04520": "2023-05-08, **Minkowski Functionals of the Large-Scale Structure as a Powerful Tool to Constrain the Modified Gravity**, Aoxiang Jiang et.al., [2305.04520v1](http://arxiv.org/abs/2305.04520v1)\n\n Modifications in the law of gravity can leave signatures on the large-scale structure, especially on the non-linear and quasi-linear scales. In this work, we propose that the four Minkowski functionals (MFs), which fully encapsulate the morphological information of the large-scale structure, are a powerful tool to constrain modified gravity(MG). With the assistance of N-body simulations, we quantify the MFs' constraining power on the Hu-Sawicki $f(R)$ gravity model by the Fisher matrix technique. The cosmic variance from the finite simulation volume is discussed. By measuring the MFs from the density field of dark matter with different smoothing scales and at different redshifts, we systematically evaluate how much information can be extracted from the MFs in these situations, and try to combine them to improve the constraint. Furthermore, we study the MG signatures imprinted in the MFs of the large-scale structures (LSS) when the biased tracer -- dark matter halo -- is used. And find the response to the fifth force is different from the matter. We also study how the constraints on modified gravity parameters change when using biased tracers of LSS. We expect that the MFs of LSS can provide us with a stringent constraint on modified gravity in the near future.\n\n"}, "supernova": {"2305.05104": "2023-05-09, **Fisher matrix forecasts on the astrophysics of galaxies during the epoch of reionisation from the 21-cm power spectra**, Sreedhar Balu et.al., [2305.05104v1](http://arxiv.org/abs/2305.05104v1)\n\n The hyperfine 21-cm transition of neutral hydrogen from the early Universe ($z>5$) is a sensitive probe of the formation and evolution of the first luminous sources. Using the Fisher matrix formalism we explore the complex and degenerate high-dimensional parameter space associated with the high-$z$ sources of this era and forecast quantitative constraints from a future 21-cm power spectrum (21-cm PS) detection. This is achieved using MERAXES, a coupled semi-analytic galaxy formation model and reionisation simulation, applied to an $N$-body halo merger tree with a statistically complete population of all atomically cooled galaxies out to $z\\sim20$. Our mock observation assumes a 21-cm detection spanning $z \\in [5, 24]$ from a 1000 h mock observation with the forthcoming Square Kilometre Array and is calibrated with respect to ultraviolet luminosity functions (UV LFs) at $z\\in[5, 10]$, the optical depth of CMB photons to Thompson scattering from Planck, and various constraints on the IGM neutral fraction at $z > 5$. In this work, we focus on the X-ray luminosity, ionising UV photon escape fraction, star formation and supernova feedback of the first galaxies. We demonstrate that it is possible to recover 5 of the 8 parameters describing these properties with better than $50$ per cent precision using just the 21-cm PS. By combining with UV LFs, we are able to improve our forecast, with 5 of the 8 parameters constrained to better than 10 per cent (and all below 50 per cent).\n\n", "2305.05015": "2023-05-08, **A Low-Mass Helium Star Progenitor Model for the Type Ibn SN 2020nxt**, Qinan Wang et.al., [2305.05015v1](http://arxiv.org/abs/2305.05015v1)\n\n A growing number of supernovae (SNe) are now known to exhibit evidence for significant interaction with a dense, pre-existing, circumstellar medium (CSM). SNe Ibn comprise one such class that can be characterised by both rapidly evolving light curves and persistent narrow He I lines. The origin of such a dense CSM in these systems remains a pressing question, specifically concerning the progenitor system and mass-loss mechanism. In this paper, we present multi-wavelength data of the Type Ibn SN 2020nxt, including $HST$/STIS ultraviolet spectra. We fit the data with recently updated CMFGEN models designed to handle configurations for SNe Ibn. The UV coverage yields strong constraints on the energetics and, when combined with the CMFGEN models, offer new insight on potential progenitor systems. We find the most successful model is a $\\lesssim4 {\\rm M}\\_\\odot$ helium star that lost its $\\sim 1\\,{\\rm M}\\_\\odot$ He-rich envelope in the years preceding core collapse. We also consider viable alternatives, such as a He white dwarf merger. Ultimately, we conclude at least some SNe Ibn do not arise from single, massive ($>30 {\\rm M}\\_\\odot$) Wolf-Rayet-like stars.\n\n", "2305.04997": "2023-05-08, **Stellar Collisions in Galactic Nuclei: Impact on Destructive Events Near a Supermassive Black Hole**, Shmuel Balberg et.al., [2305.04997v1](http://arxiv.org/abs/2305.04997v1)\n\n Centers of galaxies host both a supermassive black hole and a dense stellar cluster. Such an environment should lead to stellar collisions, possibly at very high velocities so that the total energy involved is of the same order as supernovae explosions. We present a simplified numerical analysis of the destructive stellar collision rate in a cluster similar to that of the Milky Way. The analysis includes an effective average two-body relaxation Monte-Carlo scheme and general relativistic effects, as used by Sari and Fragione (2019), to which we added explicit tracking of local probabilities for stellar collisions. We also consider stars which are injected into the stellar cluster after being disrupted from a binary system by the supermassive black hole. Such stars are captured in the vicinity of the black hole and enhance the expected collision rate. In our results we examine the rate and energetic distribution function of high velocity stellar collisions, and compare them self-consistently with the other destructive processes which occur in the galactic center, namely tidal disruptions and extreme mass ratio inspirals.\n\n", "2305.04946": "2023-05-08, **Possible hints of decreasing dark energy from supernova data**, Mark Van Raamsdonk et.al., [2305.04946v1](http://arxiv.org/abs/2305.04946v1)\n\n The potential energy from a time-dependent scalar field provides a possible explanation for the observed cosmic acceleration. In this paper, we investigate how the redshift vs brightness data from the recent Pantheon+ survey of type Ia supernovae constrain the possible evolution of a single scalar field for the period of time (roughly half the age of the universe) over which supernova data are available. Taking a linear approximation to the potential, we find that models providing a good fit to the data typically have a decreasing potential energy at present (accounting for over 99% of the allowed parameter space) with a significant variation in scalar potential ($\\langle {\\rm Range}(V)/V\\_0 \\rangle \\approx 0.97$) over the period of time corresponding to the available data ($z < 2.3$). Including quadratic terms in the potential, the data can be fit well for a wide range of possible potentials including those with positive or negative $V\\_2$ of large magnitude, and models where the universe has already stopped accelerating. We describe a few degeneracies and approximate degeneracies in the model that help explain the somewhat surprising range of allowed potentials.\n\n", "2305.04753": "2023-05-08, **Evolution of radioactive elements in the LMC: predictions for future gamma-ray surveys**, Arianna Vasini et.al., [2305.04753v1](http://arxiv.org/abs/2305.04753v1)\n\n Short-lived radionuclides, such as 26Al and 60Fe, are tracers of star formation. Therefore, their abundances can unravel the recent star formation history of the host galaxy. In view of future gamma-ray surveys, we predict the masses and fluxes of these two elements in the Large Magellanic Cloud (LMC) using new chemical evolution models. Our best model reproduces the abundance patterns of alpha/Fe ratios, the gas mass, the average metallicity, the present time supernova and nova rates observed in LMC. We show three main results: i) the best model for the LMC suggests a star formation rate very mild at the beginning with a recent burst, and a Salpeter-like initial mass function. ii) The predicted mass of 26Al is 0.33 M\\_Sun, 2/3 produced by massive stars and 1/3 by novae. iii) The predicted mass of 60Fe is 0.44 M\\_Sun, entirely produced by massive stars. This result suggests a larger fraction of 60Fe, at variance with the Milky Way. The explanation for this lies in the adopted initial mass function, that for the LMC contains more massive stars than for the Milky Way. These predictions can be useful for the COSI-SMEX mission planned for launch in 2027. The expected gamma-ray line fluxes for the 1.809 MeV line of 26Al and the 1.173 and 1.332 MeV lines of 60Fe are in the range of (0.2-2.7)x10^-6 ph cm^-2 s^-1 and (0.7-2.8)x10^-7 ph cm^-2 s^-1, respectively. This new instrument could have the sensitivity to detect the upper end of the predicted 1.8 MeV flux within its nominal two-year mission.\n\n", "2305.04484": "2023-05-08, **Near-Infrared Spectroscopy of Dense Ejecta Knots in the Outer Eastern Area of the Cassiopeia A Supernova Remnant**, Bon-Chul Koo et.al., [2305.04484v1](http://arxiv.org/abs/2305.04484v1)\n\n The Cassiopeia A supernova remnant has a complex structure, manifesting the multidimensional nature of core-collapse supernova explosions. To further understand this, we carried out near-infrared multi-object spectroscopy on the ejecta knots located in the \"northeastern (NE) jet\" and the \"Fe K plume\" regions, which are two distinct features in the outer eastern area of the remnant. Our study reveals that the knots exhibit varying ratios of [S II] 1.03 $\\mu$m, [P II] 1.189 $\\mu$m, and [Fe II] 1.257 $\\mu$m lines depending on their locations within the remnant, suggesting regional differences in elemental composition. Notably, the knots in the NE jet are mostly 'S-rich' with weak or no [P II] lines, implying that they originated below the explosive Ne burning layer, consistent with the results of previous studies. We detected no ejecta knots exhibiting only [Fe II] lines in the NE jet area that are expected in the jet-driven SN explosion model. Instead, we discovered a dozen 'Fe-rich' knots in the Fe K plume area. We propose that they are dense knots produced by a complete Si burning with $\\alpha$-rich freezeout in the innermost region of the progenitor and ejected with the diffuse X-ray emitting Fe ejecta but decoupled after crossing the reverse shock. In addition to these metal-rich ejecta knots, several knots emitting only He I 1.083 $\\mu$m lines were detected, and their origin remains unclear. We also detected three extended H emission features of circumstellar or interstellar origin in this area and discuss its association with the supernova remnant.\n\n"}}