{"neutrino": {"2405.08724": "2024-05-14, **Revisiting Reactor Anti-Neutrino 5 MeV Bump with $^{13}$C Neutral-Current Interaction**, Pouya Bakhti et.al., [2405.08724v1](http://arxiv.org/abs/2405.08724v1)\n\n For the first time, we systematically investigate the potential of neutrino-nucleus neutral current interactions with $^{13}$C to identify the origin of the 5 MeV bump observed in reactor anti-neutrino spectra in the inverse beta decay process. The distinctive signal is obtained from the de-excitation of $^{13}$C$^*$ into the ground state emitting a 3.685 MeV photon in various liquid scintillator detectors. Such an interaction predominantly occurs for the reactor anti-neutrinos within the energy range coinciding with the 5 MeV bump. For a detector that has a capability of 95\\% level photon and electron separation and small thorium contamination below $5 \\times 10^{-17}$ gr/gr located in a site with an overburden of about a few hundred m.w.e, such as the location of near detectors of RENO and Daya Bay will have a great sensitivity to resolve the 5 MeV bump. In addition, we propose a novel approach to track the time evolution of reactor isotopes by analyzing our $^{13}$C signal shedding light on the contributions from $^{235}$U or $^{239}$Pu to the observed bump. This provides an extra powerful tool in both discriminating the flux models and testing any new physics possibilities for the 5 MeV bump at 3$\\sigma$ to 5$\\sigma$ level with much less systematic uncertainties and assuming 10 kt.year of data collection. Our detector requirements are realistic, aligning well with recent studies conducted for existing or forthcoming experiments.\n\n", "2405.08508": "2024-05-14, **Tau polarization in neutrino-nucleus interactions at the LHC energy range**, Reinaldo Francener et.al., [2405.08508v1](http://arxiv.org/abs/2405.08508v1)\n\n Considering that the study of neutrino-nucleus interactions with incident neutrino energy ranges in the GeV-TeV range is feasible at the Large Hadron Collider, we investigate in this paper the degree of polarization ${\\cal{P}}$ of the (anti) tau lepton produced in (anti) tau neutrino - tungsten interactions. We estimate the differential cross-sections and the longitudinal and transverse components of the tau lepton polarization as a function of the tau lepton energy and distinct values of the scattering angle, assuming different values for the energy of the incoming (anti) tau neutrino. Different models for the treatment of the nuclear effects in the parton distribution functions are assumed as input in the calculations. Our results indicate that $ {\\cal{P}} < 1$ for the neutrino energies reached at the LHC and are almost insensitive to the nuclear effects.\n\n", "2405.08495": "2024-05-14, **A randomly generated Majorana neutrino mass matrix using Adaptive Monte Carlo method**, Y Monitar Singh et.al., [2405.08495v1](http://arxiv.org/abs/2405.08495v1)\n\n A randomly generated complex symmetric matrix using Adaptive Monte Carlo method, is taken as a general form of Majorana neutrino mass matrix, which is diagonalized by the use of eigenvectors. We extract all the neutrino oscillation parameters i.e. two mass-squared differences ($\\Delta m\\_{21}^2$ and $\\Delta m\\_{32}^2$ ), three mixing angles ($\\theta\\_{12}$, $\\theta\\_{13}$, $\\theta\\_{23}$) and three phases i.e. one Dirac CP violating phase ($\\delta\\_{CP}$) and two Majorana phases ($\\alpha$ and $\\beta$). The charge-parity (CP) violating phases are extracted from the mixing matrix constructed with the eigenvectors of the Hermitian matrix formed by the complex symmetric matrix. All the neutrino oscillation parameters within 3$\\sigma$ bound are allowed in both normal hierarchy (NH) and inverted hierarchy (IH) consistent with the latest Planck cosmological upper bound, $\\sum\\vert m\\_i\\vert<0.12$ eV. This latest cosmological upper bound is allowed only in three cases of zero texture for $m\\_{11}=0$; $m\\_{11},m\\_{12}=0$ and $m\\_{11},m\\_{13}=0$ in normal hierarchy whereas none of zero texture is allowed in inverted hierarchy. We also study effective neutrino masses $m\\_{\\beta}$ in tritium beta decay and $m\\_{\\beta\\beta}$ in neutrinoless double beta decay.\n\n", "2405.08482": "2024-05-14, **$γ$ rays from in-flight positron annihilation as a probe of new physics**, Pedro De la Torre Luque et.al., [2405.08482v1](http://arxiv.org/abs/2405.08482v1)\n\n The $\\gamma$ ray emission originating from in-flight annihilation (IA) of positrons is a powerful observable for constraining high-energy positron production from exotic sources. By comparing diffuse $\\gamma$ ray observations of INTEGRAL, COMPTEL and EGRET to theoretical predictions, we set the most stringent constraints on electrophilic feebly interacting particles (FIPs), thereby proving IA as a valuable probe of new physics. In particular, we extensively discuss the case of MeV-scale sterile neutrinos, where IA sets the most stringent constraints, excluding $\\|U\\_{\\mu4}\\|^{2} \\gtrsim 10^{-13}$ and $\\|U\\_{\\tau4}\\|^{2} \\gtrsim 2\\times 10^{-13}$ for sterile neutrinos mixed with $\\mu$ and $\\tau$ neutrinos respectively. These constraints improve existing limits by more than an order of magnitude. We briefly discuss the application of these results to a host of exotic positron sources such as dark photons, axion-like particles, primordial black holes (PBHs) and sub-GeV dark matter (DM).\n\n", "2405.08367": "2024-05-14, **Three-dimensional Magneto-hydrodynamic Simulations of Core-collapse Supernovae: I. Hydrodynamic evolution and protoneutron star properties**, Ko Nakamura et.al., [2405.08367v1](http://arxiv.org/abs/2405.08367v1)\n\n We present results from three-dimensional, magnetohydrodynamic, core-collapse simulations of sixteen progenitors following until 0.5 s after bounce. We use non-rotating solar-metallicity progenitor models with zero-age main-sequence mass between 9 and 24 $M\\_{\\odot}$. The examined progenitors cover a wide range of the compactness parameter including a peak around $23 M\\_{\\odot}$. We find that neutrino-driven explosions occur for all models within 0.3 s after bounce. We also find that the properties of the explosions and the central remnants are well correlated with the compactness. Early shock evolution is sensitive to the mass accretion rate onto the central core, reflecting the density profile of the progenitor stars. The most powerful explosions with diagnostic explosion energy $E\\_{\\rm exp} \\sim 0.75 \\times 10^{51}$ erg are obtained by 23 and 24 $M\\_{\\odot}$ models, which have the highest compactness among the examined models. These two models exhibit spiral SASI motions during 150-230 ms after bounce preceding a runaway shock expansion and leave a rapidly rotating neutron star with spin periods $\\sim 50$ ms. Our models predict the gravitational masses of the neutron star ranging between $1.22 M\\_{\\odot}$ and $1.67 M\\_{\\odot}$ and their spin periods 0.04-4 s. The number distribution of these values roughly matches observation. On the other hand, our models predict small hydrodynamic kick velocity (15-260 km/s), although they are still growing at the end of our simulations. Further systematic studies, including rotation and binary effects, as well as long-term simulations up to several seconds, will enable us to explore the origin of various core-collapse supernova explosions.\n\n", "2405.08262": "2024-05-14, **Quasinormal modes of charged black holes in Asymptotically Safe Gravity**, Alexey Dubinsky et.al., [2405.08262v1](http://arxiv.org/abs/2405.08262v1)\n\n We calculate quasinormal modes of scalar and neutrino perturbations around the charged black hole in Asymptotically Safe Gravity. We show that the charge and coupling constant change the quasinormal spectrum considerably. We show that previous calculations of scalar quasinormal modes in this background [F. Javed, Phys. Dark Univ., 44, 101450 (2024)] suffer from a large numerical error exceeding the effect, that is, the deviations of the frequencies from their Schwarzschild limits. In the high frequency (eikonal) limit an explicit analytic formula for quasinormal modes is derived, which confirms the correspondence between the null circular geodesics and eikonal quasinormal frequencies.\n\n", "2405.08077": "2024-05-13, **Methods and stability tests associated with the sterile neutrino search using improved high-energy $ν_μ$ event reconstruction in IceCube**, IceCube Collaboration et.al., [2405.08077v1](http://arxiv.org/abs/2405.08077v1)\n\n We provide supporting details for the search for a 3+1 sterile neutrino using data collected over eleven years at the IceCube Neutrino Observatory. The analysis uses atmospheric muon-flavored neutrinos from 0.5 to 100\\, TeV that traverse the Earth to reach the IceCube detector, and finds a best-fit point at $\\sin^2(2\\theta\\_{24}) = 0.16$ and $\\Delta m^{2}\\_{41} = 3.5$ eV$^2$ with a goodness-of-fit p-value of 12\\% and consistency with the null hypothesis of no oscillations to sterile neutrinos with a p-value of 3.1\\%. Several improvements were made over past analyses, which are reviewed in this article, including upgrades to the reconstruction and the study of sources of systematic uncertainty. We provide details of the fit quality and discuss stability tests that split the data for separate samples, comparing results. We find that the fits are consistent between split data sets.\n\n", "2405.08070": "2024-05-13, **A search for an eV-scale sterile neutrino using improved high-energy $ν_μ$ event reconstruction in IceCube**, IceCube Collaboration et.al., [2405.08070v1](http://arxiv.org/abs/2405.08070v1)\n\n This Letter presents the result of a 3+1 sterile neutrino search using 10.7 years of IceCube data. We analyze atmospheric muon neutrinos that traverse the Earth with energies ranging from 0.5 to 100 TeV, incorporating significant improvements in modeling neutrino flux and detector response compared to earlier studies. Notably, for the first time, we categorize data into starting and through-going events, distinguishing neutrino interactions with vertices inside or outside the instrumented volume, to improve energy resolution. The best-fit point for a 3+1 model is found to be at $\\sin^2(2\\theta\\_{24}) = 0.16$ and $\\Delta m^{2}\\_{41} = 3.5$ eV$^2$, which agrees with previous iterations of this study. The result is consistent with the null hypothesis of no sterile neutrinos with a p-value of 3.1\\%.\n\n", "2405.08064": "2024-05-13, **Dark Matter-Radiation Scattering Enhances CMB Phase Shift through Dark Matter-loading**, Subhajit Ghosh et.al., [2405.08064v1](http://arxiv.org/abs/2405.08064v1)\n\n A phase shift in the acoustic oscillations of cosmic microwave background (CMB) spectra is a characteristic signature for the presence of non-photon radiation propagating differently from photons, even when the radiation couples to the Standard Model particles solely gravitationally. It is well-established that compared to the presence of free-streaming radiation, CMB spectra shift to higher $\\ell$-modes in the presence of self-interacting non-photon radiation such as neutrinos and dark radiation. In this study, we further demonstrate that the scattering of non-photon radiation with dark matter can further amplify this phase shift. We show that when the energy density of the interacting radiation surpasses that of interacting dark matter around matter-radiation equality, the phase shift enhancement is proportional to the interacting dark matter abundance and remains insensitive to the radiation energy density. Given the presence of dark matter-radiation interaction, this additional phase shift emerges as a generic signature of models featuring an interacting dark sector or neutrino-dark matter scattering. Using neutrino-dark matter scattering as an example, we numerically calculate the amplified phase shift and offer an analytical interpretation of the result by modeling photon and neutrino perturbations with coupled harmonic oscillators. This framework also explains the phase shift contrast between self-interacting and free-streaming neutrinos. Fitting models with neutrino-dark matter or dark radiation-dark matter interactions to CMB and large-scale structure data, we validate the presence of the enhanced phase shift, affirmed by the linear dependence observed between the preferred regions of the sound horizon angle $\\theta\\_s$ and interacting dark matter abundance.\n\n", "2405.07952": "2024-05-13, **White paper on ($α$, n) neutron yields calculation**, D. Cano-Ott et.al., [2405.07952v1](http://arxiv.org/abs/2405.07952v1)\n\n Understanding the radiogenic neutron production rate through the (${\\alpha}$, n) reaction is essential in many fields of physics like dark matter searches, neutrino studies, nuclear astrophysics and medical physics. This white paper provides a review of the current landscape of (${\\alpha}$, n) yields, neutron spectra and correlated ${\\gamma}$-rays calculations, and describes the existing tools and the available cross-sections. The uncertainties that contribute to (${\\alpha}$, n) yield calculations are also discussed with plans for a program to improve the accuracy of these estimates. Novel ideas to measure (${\\alpha}$, n) cross-sections for a variety of materials of interest are presented. The goal of this study is to reduce the uncertainty in the expected sensitivity of next-generation physics experiments in the keV--MeV regime.\n\n", "2405.07900": "2024-05-13, **Latest results from Super-Kamiokande**, Andrew D. Santos et.al., [2405.07900v1](http://arxiv.org/abs/2405.07900v1)\n\n Super-Kamiokande is the world's largest water Cherenkov experiment with its 50-kton tank of ultrapure water, recently doped with gadolinium to enhance neutron capture identification. It is a highly versatile, multi-purpose experiment in the MeV-TeV range, and here we will summarize the latest results and advancements in the atmospheric-$\\nu$, solar-$\\nu$, and Diffuse Supernova Neutrino Background analyses.\n\n", "2405.07894": "2024-05-13, **Neutrinos from captured dark matter in galactic stars**, Debajit Bose et.al., [2405.07894v1](http://arxiv.org/abs/2405.07894v1)\n\n Sub-GeV neutrinos produced in a stellar core may emerge from main sequence stars, white dwarfs and brown dwarfs producing possible observable signals of dark matter capture. A distribution of these stars near the Milky Way galactic center will produce a neutrino flux that can be probed at Earth based neutrino observatories like Super-Kamiokande. We demonstrate that this can provide a handle to probe dark matter masses in the 100 MeV - 2 GeV mass scales that compares favourably with present day direct detection bounds.\n\n", "2405.07695": "2024-05-13, **High-energy neutrinos from late-time jets of gamma-ray bursts with cocoon photons**, Riki Matsui et.al., [2405.07695v1](http://arxiv.org/abs/2405.07695v1)\n\n In gamma-ray bursts (GRBs), $\\sim$ 100 - 1000 s after the prompt emission, afterglow observations have consistently shown X-ray excesses detected in the form of flares (XFs; in long GRBs) or extended emission (EEs; in short GRBs). These observations are interpreted as emissions from jets launched by late central engine activity. However, the characteristics of these late-time jets, particularly the dissipation radius ($r\\_{\\rm diss}$), Lorentz factor ($\\Gamma$), and cosmic-ray loading factor ($\\xi\\_p$), remain unknown despite their importance. Here, in order to understand the properties of the late-time jets with future multi-messenger observations, we estimate the detectability of neutrinos associated with late-time emissions for a wide range of $r\\_{\\rm diss}$ and $\\Gamma$, assuming $\\xi\\_p=10$. We take into account external seed photons from the cocoon around the jets, which can enhance the neutrino production through photohadronic interaction in the jet dissipation region. Our results are still consistent with the upper limit obtained by IceCube. Our calculations indicate a promising prospect for neutrino detection with IceCube-Gen2 through the stacking of $\\sim 1000-2000$ events, for a wide range of $r\\_{\\rm diss}$ and $\\Gamma$. We found that setting an optimal energy threshold of 10 TeV can significantly reduce noise without negatively affecting neutrino detection. Furthermore, even in the case of non-detection, we show that meaningful constraints on the characteristics of the late-time jets can be obtained.\n\n"}, "dark matter": {"2405.08758": "2024-05-14, **Low Mass Naked Singularities from Dark Core Collapse**, Chandrachur Chakraborty et.al., [2405.08758v1](http://arxiv.org/abs/2405.08758v1)\n\n Near-solar mass black holes (BHs) could have been involved in the two recent gravitational wave events, GW190425 and GW190814. Since such a low mass BH cannot be formed via stellar evolution, a model has been proposed based on the core collapse of a neutron star initiated by a certain number of dark matter (DM) particles. In this process, the accumulated DM particles collapse to form a tiny BH inside the neutron star, and the entire neutron star is transmuted into a BH after a certain time due to the accretion of matter by the endoparasitic BH from its host. Here, we argue that, depending on the initial conditions, a dark core collapse could give rise to either a BH or a naked singularity. For example, if the accumulated cloud of DM particles in the core of a neutron star can be modeled as an anisotropic fluid and it fulfils the criterion for collapse, an endoparasitic naked singularity could form instead of an endoparasitic BH. Immediately after its formation, the naked singularity should begin accreting matter from the host neutron star, thus eventually transmuting the entire host into a near-solar mass, relatively slowly-spinning naked singularity. We also propose a general technique to constrain the DM particle--neutron scattering cross section using the lack of pulsars near the Galactic centre and assuming that these missing pulsars have already been transmuted into BHs and/or naked singularities. Thus, the missing pulsars also indicate the existence of many such singularities near the Galactic center.\n\n", "2405.08744": "2024-05-14, **Universal Acceleration and Fuzzy Dark Matter**, Douglas Edmonds et.al., [2405.08744v1](http://arxiv.org/abs/2405.08744v1)\n\n Observations of velocity dispersions of galactic structures over a wide range of scales point to the existence of a universal acceleration scale $a\\_0\\sim 10^{-10}$ m/s$^2$. Focusing on the fuzzy dark matter paradigm, which proposes ultralight dark matter with mass around $10^{-22}$ eV and de Broglie wavelength $\\lambda\\sim {\\rm few}\\times10^{2}$ parsecs, we highlight the emergence of the observed acceleration scale from quantum effects in a fluid-like description of the dark matter dynamics. We then suggest the possibility of a natural connection between the acceleration scale and dark energy within the same paradigm.\n\n", "2405.08624": "2024-05-14, **Primordial black holes, a small review**, Alexandre Arbey et.al., [2405.08624v1](http://arxiv.org/abs/2405.08624v1)\n\n With the direct discovery of gravitational waves, black holes have regain interest in the recent years. In particular primordial black holes (PBHs), which originate from the very early Universe, may constitute (at least in part) dark matter. The possibility that dark matter is made of black holes is particularly appealing, and multi-messenger searches are important to probe this hypothesis. In this paper I will discuss the concept of primordial black holes, their origins, their characteristics and the current constraints. In addition I will explain that the study of black holes is of utmost interest since they may constitute portals to new physics and to quantum gravity.\n\n", "2405.08563": "2024-05-14, **Primordial black holes generated by fast-roll mechanism in non-canonical natural inflation**, Soma Heydari et.al., [2405.08563v1](http://arxiv.org/abs/2405.08563v1)\n\n In this work, a new fast-roll (FR) mechanism to generate primordial black holes (PBHs) and their coeval gravitational waves (GWs) in generalized non-canonical natural inflation is introduced. In this model, choosing a suitable function for non-canonical mass scale parameter $M(\\phi)$ gives rise to produce a cliff-like region in field evolution path. When inflaton rolls down the steep cliff, its kinetic energy during the FR stage is amplified in comparison with slow-roll (SR) stage. Hence, seeds of PBHs production are born in this transient FR stage. Depending on the position of the cliff, appropriate cases of PBHs for explaining total dark matter (DM), microlensing effects, LIGO-VIRGO events and NANOGrav 15 year data can be formed. The density spectrum of GWs related to one case of the model lies in the NANOGrav 15 year domain and behaves like $\\Omega\\_{\\rm GW\\_0}\\sim f^{5-\\gamma}$. The spectral index $\\gamma=3.42$ for this case satisfies the NANOGrav 15 year constraint. Moreover, regarding reheating considerations, it is demonstrated that PBHs are born in radiation-dominated (RD) era. Furthermore, viability of the model in light of theoretical swampland criteria and observational constraints on cosmic microwave background (CMB) scales are illustrated.\n\n", "2405.08557": "2024-05-14, **Galaxy clusters in Milgromian dynamics: Missing matter, hydrostatic bias, and the external field effect**, Ruth Kelleher et.al., [2405.08557v1](http://arxiv.org/abs/2405.08557v1)\n\n We study the mass distribution of galaxy clusters in Milgromian dynamics, or modified Newtonian dynamics (MOND). We focus on five galaxy clusters from the X-COP sample, for which high-quality data are available on both the baryonic mass distribution (gas and stars) and internal dynamics (from the hydrostatic equilibrium of hot gas and the Sunyaev-Zeldovich effect). We confirm that galaxy clusters require additional `missing matter' in MOND, although the required amount is drastically reduced with respect to the non-baryonic dark matter in the context of Newtonian dynamics. We studied the spatial distribution of the missing matter by fitting the acceleration profiles of the clusters with a Bayesian method, finding that a physical density profile with an inner core and an outer $r^{-4}$ decline (giving a finite total mass) provide good fits within $\\sim$1 Mpc. At larger radii, the fit results are less satisfactory but the combination of the MOND external field effect and hydrostatic bias (quantified as 10$\\%$-40$\\%$) can play a key role. The missing mass must be more centrally concentrated than the intracluster medium (ICM). For relaxed clusters (A1795, A2029, A2142), the ratio of missing-to-visible mass is around $1-5$ at $R\\simeq200-300$ kpc and decreases to $0.4-1.1$ at $R\\simeq2-3$ Mpc, showing that the total amount of missing mass is smaller than or comparable to the ICM mass. For clusters with known merger signatures (A644 and A2319), this global ratio increases up to $\\sim$5 but may indicate out-of-equilibrium dynamics rather than actual missing mass. We discuss various possibilities regarding the nature of the extra mass, in particular `missing baryons' in the form of pressure-confined cold gas clouds with masses of $<10^5$ M$\\_\\odot$ and sizes of $< 50$ pc.\n\n", "2405.08476": "2024-05-14, **Cosmological constraints on mass-varying dark matter**, Amlan Chakraborty et.al., [2405.08476v1](http://arxiv.org/abs/2405.08476v1)\n\n Light mass warm dark matter is an interesting and viable alternative to the cold dark matter paradigm. An intriguing variation of this scenario is the mass-varying dark matter model where the dark matter mass varies with time during its cosmic history. This is realized in multiple particle physics models. In this work, we study the cosmological constraints on such a model where the dark matter mass transitions from zero to a finite value in the early Universe. In this model, the matter power spectrum exhibits power suppression below a scale that depends on the epoch of transition, and the angular power spectrum of the cosmic microwave background show a distinctive phase shift. We use the latest cosmic microwave background and the weak lensing data to place lower limit on the transition redshift and ease the $S\\_8$ tension, unlike the warm dark matter model. This analysis also facilitates a marginal detection of the dark matter (DM) mass. Our findings reveal that while Planck data alone reduces the $S\\_8$ tension to approximately $2\\sigma$, it does not sufficiently constrain the DM mass. However, when combined with the $S\\_8$ measurement from KIDS1000+BOSS+2dfLenS, the tension significantly decreases to roughly $1.3\\sigma$, and we observe the detection of a DM mass at $41.7^{+7.81}\\_{-27.5}\\,\\mathrm{eV}$. Further analysis incorporating a combined data set from ACT and weak lensing results in an even more pronounced reduction in the tension to approximately $0.4\\sigma$, alongside a higher detected mass of $51.2^{+16}\\_{-33.5}\\,\\mathrm{eV}$. We also find a better fit to the combined data compared to the $\\Lambda$CDM model.\n\n", "2405.08413": "2024-05-14, **Bootstrapping Lagrangian Perturbation Theory for the Large Scale Structure**, Marco Marinucci et.al., [2405.08413v1](http://arxiv.org/abs/2405.08413v1)\n\n We develop a model-independent approach to lagrangian perturbation theory for the large scale structure of the universe. We focus on the displacement field for dark matter particles, and derive its most general structure without assuming a specific form for the equations of motion, but implementing a set of general requirements based on symmetry principles and consistency with the perturbative approach. We present explicit results up to sixth order, and provide an algorithmic procedure for arbitrarily higher orders. The resulting displacement field is expressed as an expansion in operators built up from the linear density field, with time-dependent coefficients that can be obtained, in a specific model, by solving ordinary differential equations. The derived structure is general enough to cover a wide spectrum of models beyond $\\Lambda$CDM, including modified gravity scenarios of the Hordenski type and models with multiple dark matter species. This work is a first step towards a complete model-independent lagrangian forward model, to be employed in cosmological analyses with power spectrum and bispectrum, other summary statistics, and field-level inference.\n\n", "2405.08354": "2024-05-14, **Fuzzy Dark Matter Less-complex Wormhole Structures in Extended Theories of Gravity**, Z. Yousaf et.al., [2405.08354v1](http://arxiv.org/abs/2405.08354v1)\n\n Fuzzy dark matter wormhole solutions coupled with anisotropic matter distribution are explored in 4D Einstein-Gauss-Bonnet and $f(R)$ gravity, where $R$ is the Ricci scalar. We derive the shape function for fuzzy wormholes and explore their possible stability. We study the embedding diagrams of the active gravitational mass associated with fuzzy dark matter wormholes by taking a certain shape function. Aiming to highlight the role of Einstein-Gauss-Bonnet and $f(R)$ gravity in the modeling of less complex fuzzy wormhole structures, we evaluate the complexity factor, the conservation equation, and null energy conditions. Our study reinforces more importance of uniformly distributed pressure effects throughout the less complex region than to the emergence of energy density homogeneity in the stability of fuzzy wormholes. It is shown that the active gravitational mass of the fuzzy wormhole structures varies inversely with the radial distance thereby suggesting the breaching of energy conditions at some arena of Einasto index. Furthermore, it is revealed that stable fuzzy dark matter wormhole structures exist in nature in the surroundings of cold dark matter halos and galactic bulges. The important physics understood from our analysis is that in both four-dimensional Einstein-Gauss-Bonnet and $f(R)$ gravity, feasible geometries of fuzzy dark matter wormholes exist naturally in the environments of different galactic haloes.\n\n", "2405.08178": "2024-05-13, **A Theoretical Framework for Self-Gravitating k-Form Boson Stars with Internal Symmetries**, Jakob Hoffmann et.al., [2405.08178v1](http://arxiv.org/abs/2405.08178v1)\n\n Current boson star models are largely restricted to global symmetries and lower spin fields. In this work, we generalize these systems of self-gravitating bosonic fields to allow for arbitrary totally antisymmetric tensor fields and arbitrary internal gauge symmetries. We construct a generalized formalism for Yang-Mills-like theories, which allows for arbitrary k-form fields, instead of just vector fields. The k-form fields have gauge symmetries described by semisimple, compact Lie groups. We further derive equations of motion for the k-form fields and connection coefficients of the Lie group. Extensions and applications are also discussed. We present a novel way to fix the group connection using a spacetime connection. As an example, we derive explicitly the connection coefficients for SU(2) in a spherically symmetric spacetime using rectangular vielbeins. The combination of methods presented leads to a powerful, adaptable and practical framework. As a proof of concept, we derive ordinary differential equations for a 0-form field with a SU(2) symmetry. Our framework can be used to model self-gravitating (multi) particle states with internal symmetries, such as pion condensates or dark matter. It is also suited as a tool to approach open problems in modified gravity and string theory.\n\n", "2405.08113": "2024-05-13, **Orbital motion of primordial black holes crossing Solar-type stars**, Vitorio A. De Lorenci et.al., [2405.08113v1](http://arxiv.org/abs/2405.08113v1)\n\n Primordial black holes (PBHs) are hypothetical objects that could have originated from density fluctuations in a very early phase of our Universe. Recent observations restrict the masses that such PBHs could have, if they are to constitute all of dark matter today: $10^{17} \\, {\\rm g} \\leq m \\leq 10^{23} \\, {\\rm g}$. With such low masses, general relativity predicts that the corresponding radii for the PBHs would be atomic or subatomic in size. When captured by a star, such a tiny PBH could exhibit an orbit completely or partially inside the body of the star, without significantly changing its mass for quite a long time. Here we examine the possible trajectories of a PBH that is captured by a Sun-like star. When in motion in the interior of the star, the amount of stellar mass that effectively interacts with the PBH will be a function of its distance to the center of the star. As a consequence, a strong effect on the shape of the orbits emerges, leading to PBH trajectories that could be open or closed, and exhibiting a rich variety of patterns.\n\n", "2405.08081": "2024-05-13, **Not-so-inelastic Dark Matter**, Giovani Dalla Valle Garcia et.al., [2405.08081v1](http://arxiv.org/abs/2405.08081v1)\n\n Models of inelastic (or pseudo-Dirac) dark matter commonly assume an accidental symmetry between the left-handed and right-handed mass terms in order to suppress diagonal couplings. We point out that this symmetry is unnecessary, because for Majorana fermions the diagonal couplings are not strongly constrained. Removing the requirement of such an ad-hoc symmetry instead relaxes the relic density constraint due to additional annihilation modes. We consider a simple UV-complete model realising this setup and study constraints from (in)direct detection, beam dump experiments and colliders. We identify two viable mass regions for the dark matter mass, around a few hundred MeV and around a few GeV, respectively. The former region will be fully tested by near-future analyses of NA64 and Belle II data, while the latter turns out to be challenging to explore even with future experiments.\n\n", "2405.07915": "2024-05-13, **Discovery of highly anisotropic dielectric crystals with equivariant graph neural networks**, Yuchen Lou et.al., [2405.07915v1](http://arxiv.org/abs/2405.07915v1)\n\n Anisotropy in crystals plays a pivotal role in many technological applications. For example, anisotropic electronic and thermal transport are thought to be beneficial for thermoelectric applications, while anisotropic mechanical properties are of interest for emerging metamaterials, and anisotropic dielectric materials have been suggested as a novel platform for dark matter detection. Understanding and tailoring anisotropy in crystals is therefore essential for the design of next-generation functional materials. To date, however, most data-driven approaches have focused on the prediction of scalar crystal properties, such as the spherically averaged dielectric tensor or the bulk and shear elastic moduli. Here, we adopt the latest approaches in equivariant graph neural networks to develop a model that can predict the full dielectric tensor of crystals. Our model, trained on the Materials Project dataset of c.a. 6,700 dielectric tensors, achieves state-of-the-art accuracy in scalar dielectric prediction in addition to capturing the directional response. We showcase the performance of the model by discovering crystals with almost isotropic connectivity but highly anisotropic dielectric tensors, thereby broadening our knowledge of the structure-property relationships in dielectric crystals.\n\n", "2405.07546": "2024-05-13, **Dynamical systems of modified Gauss-Bonnet gravity: cosmological implications**, Ashutosh Singh et.al., [2405.07546v1](http://arxiv.org/abs/2405.07546v1)\n\n In this paper, we derive the field equations of modified Gauss-Bonnet gravity termed as $f(R,G)$ gravity for the non-flat Friedmann-Robertson-Walker (FRW) spacetime. We utilize the dynamical system approach to study the cosmic dynamics of two different class of $f(R,G)$ models composed of radiation and matter (cold dark matter and baryonic matter). The linear perturbations around the fixed points are studied to explore the corresponding stability of points. The cosmological implications are studied in $f(R,G)=f\\_0R^nG^{1-n}$ and $f(R,G)=f\\_0R^\\alpha+f\\_1G^\\beta$ models to identify the qualitative evolution of universe with the flat-FRW spacetime. The qualitative differences between the considered class of models are discussed in detail. The fixed points corresponding to the late-time accelerated and radiation phase of the universe will exist in the model but, the existence of fixed point corresponding to the matter dominated phase will depend on the functional form of $f(R,G)$. Furthermore, the autonomous systems are utilized to study the cosmographic parameters along with the statefinder diagnostic.\n\n", "2405.07531": "2024-05-13, **Apparent and emergent dark matter around a Schwarzschild black hole**, Reggie C. Pantig et.al., [2405.07531v1](http://arxiv.org/abs/2405.07531v1)\n\n Inspired by the two different dark matter frameworks that were studied recently: one that arises from the non-local effects of entanglement entropy as emergent gravity (characterized by the parameter $\\xi(M)$, and zero-point scale length $l$), and one from dark energy viewed as a superconducting medium (characterized by $\\eta(M)$, and screening length parameter $\\lambda\\_{\\rm G}$), two black hole solutions spherically surrounded with these dark matter models were derived. The effect of these two frameworks on SMBH was analyzed through the resulting deviations in the null regions and the black hole shadow. In addition, constraints to the parameters $\\xi$ and $\\eta$ (at $3\\sigma$ level) were found using the available EHT data for Sgr. A* and M87*. These constraints allow one to deduce the effective mass $M$, which causes uncertainties in the measurement. On the other hand, if the effective mass is known, one can also deduce the constants associated with $\\xi$, and $\\eta$. The former framework also introduces an Appell function, a hypergeometric function of two variables that separately allows the analysis of macroscopic and (hypothetical) microscopic black holes. This first framework was found to decrease the radii of the null regions respective to the Schwarzschild counterpart. The shadow radius, however, behaves reversibly. The result of the numerical analysis for the latter framework revealed increased values for the photonsphere and shadow radii. Remarkably, the study also showed that for SMBHs, the amplifying effects of $\\lambda\\_{\\rm G}$ are stronger than the scale length $l$. Finally, results of constraints, as an example, for the upper bound in $\\xi$ for M87* indicated that the effective mass causing the deviation was around $2.4\\times 10^{20} M\\_{\\odot}$ given that the observed Milgrom's constant is $5.4\\times 10^{-10} \\text{ m/s}^2$.\n\n", "2405.07484": "2024-05-13, **Extended Bose-Einstein condensate dark matter in $f(Q)$ gravity**, Aaqid Bhat et.al., [2405.07484v1](http://arxiv.org/abs/2405.07484v1)\n\n In this article, we attempt to explore the dark sector of the universe i.e. dark matter and dark energy, where the dark energy components are related to the modified $f(Q)$ Lagrangian, particularly a power law function $f(Q)= \\gamma \\left(\\frac{Q}{Q\\_0}\\right)^n$, while the dark matter component is described by the Extended Bose-Einstein Condensate (EBEC) equation of state for dark matter, specifically, $p = \\alpha \\rho + \\beta \\rho^2$. We find the corresponding Friedmann-like equations and the continuity equation for both dark components along with an interacting term, specifically $\\mathcal{Q} = 3b^2H \\rho$, which signifies the energy exchange between the dark sector of the universe. Further, we derive the analytical expression of the Hubble function, and then we find the best-fit values of free parameters utilizing the Bayesian analysis to estimate the posterior probability and the Markov Chain Monte Carlo (MCMC) sampling technique corresponding to CC+Pantheon+SH0ES samples. In addition, to examine the robustness of our MCMC analysis, we perform a statistical assessment using the Akaike Information Criterion (AIC) and Bayesian Information Criterion (BIC). Further from the evolutionary profile of the deceleration parameter and the energy density, we obtain a transition from the decelerated epoch to the accelerated expansion phase, with the present deceleration parameter value as $q(z=0)=q\\_0=-0.56^{+0.04}\\_{-0.03}$ ($68 \\%$ confidence limit), that is quite consistent with cosmological observations. In addition, we find the expected positive behavior of the effective energy density. Finally, by examining the sound speed parameter, we find that the assumed theoretical $f(Q)$ model is thermodynamically stable.\n\n"}, "supernova": {"2405.08385": "2024-05-14, **Regions of suppressed diffusion around supernova remnants?**, Yiwei Bao et.al., [2405.08385v1](http://arxiv.org/abs/2405.08385v1)\n\n The recent discovery of the so-called TeV halos has attracted much attention. The morphology of the emission requires that the region is characterized by severe suppression of the diffusion coefficient. This finding raises many questions as to its origin: 1) is the suppressed diffusion {\\bf to be} attributed to instabilities induced by the same radiating particles? 2) or does it actually show that the diffusion coefficient is small throughout the disc of the Galaxy? In both cases, one would expect that the surroundings of supernova remnants (SNRs) should also show evidence of reduced diffusion coefficient, since most remnants are located in the disc and are expected to be sites of effective particle acceleration. Should we expect the existence of regions of extended $\\gamma$-ray emission from these regions as well? {\\bf Here we investigate the transport of cosmic rays (CRs) escaped from SNRs in order to assess the viability of the idea of having a cocoon of suppressed diffusion around them. A comparison of our results with the $\\gamma$-ray emission from the regions around HB9 and W28 does not provide solid evidence of reduced diffusivity. However, if indeed the phenomenon of reduced diffusivity occurs around SNRs surrounded by molecular clouds, our calculations show that the effects on the grammage of Galactic CRs can be significant.}\n\n", "2405.08327": "2024-05-14, **Multiband Simultaneous Photometry of Type II SN 2023ixf with Mephisto and the Twin 50-cm Telescopes**, Yuan-Pei Yang et.al., [2405.08327v1](http://arxiv.org/abs/2405.08327v1)\n\n SN 2023ixf, recently reported in the nearby galaxy M101 at a distance of $6.85~{\\rm Mpc}$, was one of the closest and brightest core-collapse supernovae (CCSNe) in the last decade. In this work, we present multi-wavelength photometric observation of SN 2023ixf with the Multi-channel Photometric Survey Telescope (Mephisto) in $uvgr$ bands and with the twin 50-cm telescopes in $griz$ bands. We find that the bolometric luminosity reached the maximum value of $3\\times10^{43}~{\\rm erg~s^{-1}}$ at 3.9 days after the explosion and fully settled onto the radioactive tail at $\\sim90$ days. The effective temperature decreased from $3.2\\times10^4~{\\rm K}$ at the first observation and approached to a constant of $\\sim(3000-4000)~{\\rm K}$ after the first two months. The evolution of the photospheric radius is consistent with a homologous expansion with a velocity of $8700~{\\rm km~s^{-1}}$ in the first two months, and it shrunk subsequently. Based on the radioactive tail, the initial nickel mass is about $M\\_{\\rm Ni}\\sim 0.098M\\_\\odot$. The explosion energy and the ejecta mass are estimated to be $E\\simeq(1.0-5.7)\\times10^{51}~{\\rm erg}$ and $M\\_{\\rm ej}\\simeq(3.8-16)M\\_\\odot$, respectively. The peak bolometric luminosity is proposed to be contributed by the interaction between the ejecta and the circumstellar medium (CSM). We find a shocked CSM mass of $M\\_{\\rm CSM}\\sim0.013M\\_\\odot$, a CSM density of $\\rho\\_{\\rm CSM}\\sim2.5\\times10^{-13}~{\\rm g~cm^{-3}}$ and a mass loss rate of the progenitor of $\\dot M\\sim0.022M\\_\\odot~{\\rm yr^{-1}}$.\n\n", "2405.08231": "2024-05-13, **Ten Supernova-rise in Binary Driven Gamma-ray Bursts**, R. Ruffini et.al., [2405.08231v1](http://arxiv.org/abs/2405.08231v1)\n\n The observation of a gamma-ray burst (GRB) associated with a supernova (SN) coincides remarkably with the energy output from a binary system comprising a very massive carbon-oxygen (CO) core and an associated binary neutron star (NS) by the Binary-Driven Hypernova (BdHN) model. The dragging effect in the late evolution of such systems leads to co-rotation, with binary periods on the order of minutes, resulting in a very fast rotating core and a binary NS companion at a distance of $\\sim 10^5$ km. Such a fast-rotating CO core, stripped of its hydrogen and helium, undergoes gravitational collapse and, within a fraction of seconds, leads to a supernova (SN) and a newly born, fast-spinning neutron star ($\\nu$NS), we name the emergence of the SN and the $\\nu$NS as the SN-rise and $\\nu$NS-rise. Typically, the SN energies range from $10^{51}$ to $10^{53}$ erg. We address this issue by examining 10 cases of Type-I BdHNe, the most energetic ones, in which SN accretion onto the companion NS leads to the formation of a black hole (BH). In all ten cases, the energetics of the SN events are estimated, ranging between $0.18$ and $12 \\times 10^{52}$ erg. Additionally, in all 8 sources at redshift $z$ closer than $4.61$, a clear thermal blackbody component has been identified, with temperatures between $6.2$ and $39.99$ keV, as a possible signature of pair-driven SN. The triggering of the X-ray afterglow induced by the $\\nu$NS-rise are identified in three cases at high redshift where early X-ray observations are achievable, benefits from the interplay of cosmological effects.\n\n", "2405.07964": "2024-05-13, **Early phase simultaneous multi-band observations of Type II supernova SN 2024ggi with Mephisto**, Xinlei Chen et.al., [2405.07964v1](http://arxiv.org/abs/2405.07964v1)\n\n We present early-phase good cadence simultaneous multi-band ($ugi$, $vrz$--bands) imaging of nearby supernova SN 2024ggi, which exploded in the nearby galaxy, NGC~3621. A quick follow-up was conducted within less than a day after the explosion and continued $\\sim$23 days. The $uvg$-band light curves display a rapid rise ($\\sim$1.4 mag day$^{-1}$) to maximum in $\\sim$4 days and absolute magnitude $M\\_{g}\\sim$--17.75 mag. The post-peak decay rate in redder bands is $\\sim$0.01 mag day$^{-1}$. Different colors (e.g., $u-g$ and $v-r$) of SN~2024ggi are slightly redder than SN~2023ixf. A significant rise ($\\sim$12.5 kK) in black-body temperature (optical) was noticed within $\\sim$2 days after the explosion, which successively decreased, indicating shock break out inside a dense circumstellar medium (CSM) surrounding the progenitor. Using semi-analytical modeling, the ejecta mass and progenitor radius were estimated as 1.2 M$\\_{\\odot}$ and $\\sim$550 R$\\_{\\odot}$, respectively. The archival deep images ($g,r,i,z$-bands) from the Dark Energy Camera Legacy Survey (DECaLS) were examined, and a possible progenitor was detected in each band ($\\sim$22--22.5 mag) and had a mass range of 14--17 M$\\_{\\odot}$.\n\n", "2405.07856": "2024-05-13, **The oldest stars with low neutron-capture element abundances and origins in ancient dwarf galaxies**, Hillary Diane Andales et.al., [2405.07856v1](http://arxiv.org/abs/2405.07856v1)\n\n We present a detailed chemical abundance and kinematic analysis of six extremely metal-poor ($-4.2 \\leq$ [Fe/H] $\\leq-$2.9) halo stars with very low neutron-capture abundances ([Sr/H] and [Ba/H]) based on high-resolution Magellan/MIKE spectra. Three of our stars have [Sr/Ba] and [Sr/H] ratios that resemble those of metal-poor stars in ultra-faint dwarf galaxies (UFDs). Since early UFDs may be the building blocks of the Milky Way, extremely metal-poor halo stars with low, UFD-like Sr and Ba abundances may thus be ancient stars from the earliest small galactic systems that were accreted by the proto-Milky Way. We label these objects as Small Accreted Stellar System (SASS) stars, and we find an additional 61 similar ones in the literature. A kinematic analysis of our sample and literature stars reveals them to be fast-moving halo objects, all with retrograde motion, indicating an accretion origin. Because SASS stars are much brighter than typical UFD stars, identifying them offers promising ways towards detailed studies of early star formation environments. From the chemical abundances of SASS stars, it appears that the earliest accreted systems were likely enriched by a few supernovae whose light element yields varied from system to system. Neutron-capture elements were sparsely produced and/or diluted, with $r$-process nucleosynthesis playing a role. These insights offer a glimpse into the early formation of the Galaxy. Using neutron-capture elements as a distinguishing criterion for early formation, we have access to a unique metal-poor population that consists of the oldest stars in the universe.\n\n", "2405.07783": "2024-05-13, **The $γ$-process nucleosynthesis in core-collapse supernovae II. Effect of the explosive recipe**, Lorenzo Roberti et.al., [2405.07783v1](http://arxiv.org/abs/2405.07783v1)\n\n The $\\gamma$-process in core-collapse supernovae (CCSNe) can produce a number of neutron-deficient stable isotopes heavier than iron (p-nuclei). However, current model predictions do to not fully reproduce the solar abundances. We investigate the impact of different explosion energies and parameters on the nucleosynthesis of p-nuclei, by studying stellar models with different initial masses and CCSN explosions. We find that the total p-nuclei yields are only marginally affected by the CCSN explosion prescriptions if the $\\gamma$-process production is already efficient in the stellar progenitors due to a C-O shell merger. In most of CCSN explosions from progenitors without C-O shell merger, the $\\gamma$-process yields increase with the explosion energy up to an order of magnitude, depending on the progenitor structure and the CCSN prescriptions. The trend of the p-nuclei production with the explosion energy is more complicated if we look at the production of single p-nuclei. The light p-nuclei tend to be the most enhanced with increasing the explosion energy. In particular, for the CCSN models where the $\\alpha$-rich freeze-out component is ejected, the yields of the lightest p-nuclei increase by up to three orders of magnitude. We provide the first extensive study using different sets of massive stars of the impact of varying CCSN explosion prescriptions on the production of the p-nuclei. Unlike previous expectations and recent results in the literature, we find that the average production of p-nuclei tends to increase with the explosion energy. We also confirm that the pre-explosive production of p-nuclei in C-O shell mergers is a robust result, independently from the subsequent explosive nucleosynthesis. A realistic range of variations in the evolution of stellar progenitors and in the CCSN explosions might boost the CCSN contribution to the galactic chemical evolution of p-nuclei.\n\n", "2405.07743": "2024-05-13, **The interaction of gravitational waves with matter**, Nigel T. Bishop et.al., [2405.07743v1](http://arxiv.org/abs/2405.07743v1)\n\n It is well-known that gravitational waves (GWs) undergo no absorption or dissipation when traversing through a perfect fluid. However, in the presence of a viscous fluid, GWs transfer energy to the fluid medium. In this essay, we present a review of our recent series of results regarding the interaction between gravitational waves and surrounding matter. Additionally, we examine the impact of a viscous fluid shell on gravitational wave propagation, focusing particularly on GW damping and GW heating. Furthermore, we explore the significance of these effects in various astrophysical scenarios such as core-collapse Supernovae and primordial gravitational waves.\n\n", "2405.07699": "2024-05-13, **The Red Supergiant Progenitor of Type II Supernova 2024ggi**, Danfeng Xiang et.al., [2405.07699v1](http://arxiv.org/abs/2405.07699v1)\n\n We present a detailed analysis of the progenitor and its local environment for the recently discovered type II supernova (SN) 2024ggi at a distance of about 6.7~Mpc, by utilizing the pre-explosion images from the Hubble Space Telescope (HST) and \\textit{Spitzer} Space Telescope. The progenitor is identified as a red, bright variable star, with absolute $F814W$-band magnitudes being $-$6.2 mag in 1995 to $-$7.2 mag in 2003, respectively, consistent with that of a normal red supergiant (RSG) star. Combining with the historical mid-infrared light curves, a pulsational period of about 379~days can be inferred for the progenitor star. Fitting its spectral energy distribution with stellar spectral models yields the stellar parameters of temperature, radius and bolometric luminosity as $T\\_*=3290\\_{-27}^{+19}$~K, $R\\_*=887\\_{-51}^{+60}$~R$\\_{\\odot}$, and log($L$/L$\\_{\\odot}$)$=4.92\\_{-0.04}^{+0.05}$, respectively. The above parameters indicate that the progenitor of SN 2024ggi is consistent with the stellar evolutionary track of a solar-metallicity massive star with an initial mass of $13\\_{-1}^{+1}$~M$\\_{\\odot}$. Moreover, our analysis indicates a relatively low mass loss rate (i.e., $< 3\\times10^{-6}$~M$\\_{\\odot}$~yr$^{-1}$) for the progenitor compared to that inferred from the flashed spectra and X-ray detection (i.e., $10^{-2}$$-$$ 10$$^{-5}$~M$\\_{\\odot}$~yr$^{-1}$), implying a significant enhancement in mass loss within a few years prior to the explosion.\n\n", "2405.07577": "2024-05-13, **Discovery of a shock-compressed magnetic field in the north-western rim of the young supernova remnant RX J1713.7-3946 with X-ray polarimetry**, Riccardo Ferrazzoli et.al., [2405.07577v1](http://arxiv.org/abs/2405.07577v1)\n\n Supernova remnants (SNRs) provide insights into cosmic-ray acceleration and magnetic field dynamics at shock fronts. Recent X-ray polarimetric measurements by the Imaging X-ray Polarimetry Explorer (IXPE) have revealed radial magnetic fields near particle acceleration sites in young SNRs, including Cassiopeia A, Tycho, and SN 1006. We present here the spatially-resolved IXPE X-ray polarimetric observation of the northwestern rim of SNR RX J1713.7-3946. For the first time, our analysis shows that the magnetic field in particle acceleration sites of this SNR is oriented tangentially with respect to the shock front. Because of the lack of precise Faraday-rotation measurements in the radio band, this was not possible before. The average measured polarization degree (PD) of the synchtrotron emission is 12.5 {\\pm} 3.3%, lower than the one measured by IXPE in SN 1006, comparable to the Tycho one, but notably higher than the one in Cassiopeia A. On sub-parsec scales, localized patches within RX J1713.7-3946 display PD up to 41.5 {\\pm} 9.5%. These results are compatible with a shock-compressed magnetic field. However, in order to explain the observed PD, either the presence of a radial net magnetic field upstream of the shock, or partial reisotropization of the turbulence downstream by radial magneto-hydrodynamical instabilities, can be invoked. From comparison of PD and magnetic field distribution with {\\gamma}-rays and 12 CO data, our results provide new inputs in favor of a leptonic origin of the {\\gamma}-ray emission.\n\n", "2405.07485": "2024-05-13, **The Energy Sources, the Physical Properties, and the Mass-loss History of SN 2017dio**, Deng-Wang Shi et.al., [2405.07485v1](http://arxiv.org/abs/2405.07485v1)\n\n We study the energy sources, the physical properties of the ejecta and the circumstellar medium (CSM), as well as the mass-loss history of the progenitor of SN 2017dio which is a broad-lined Ic (Ic-BL) supernova (SN) having unusual light curves (LCs) and signatures of hydrogen-rich CSM in its early spectrum. We find that the temperature of SN 2017dio began to increase linearly about 20 days after the explosion. We use the $^{56}$Ni plus the ejecta-CSM interaction (CSI) model to fit the LCs of SN 2017dio, finding that the masses of the ejecta, the $^{56}$Ni, and the CSM are $\\sim$ 12.41 M$\\_\\odot$, $\\sim$ 0.17 M$\\_\\odot$, and $\\sim$ 5.82 M$\\_\\odot$, respectively. The early-time photosphere velocity and the kinetic energy of the SN are respectively {$\\sim$ 1.89 $\\times 10^4$ km s$^{-1}$} and $\\sim$ 2.66 $\\times 10^{52}$ erg, which are respectively comparable to those of SNe Ic-BL and hypernovae (HNe). We suggest that the CSM of SN 2017dio might be {from an luminous-blue-variable-like outburst or} pulsational pair instability $\\sim$ 1.2$-$11.4 yr prior to the SN explosion{, or binary mass transfer}. {Moreover,} we find that its ejecta mass is larger than those of many SNe Ic-BL, and that its $^{56}$Ni mass ($M\\_{\\rm Ni}$) is approximately equal to the mean (or median) value of $M\\_{\\rm Ni}$ of SNe Ic-BL in the literature, but lower than $M\\_{\\rm Ni}$ of prototype HNe (e.g., SN 1998bw and SN 2003dh).\n\n", "2405.07446": "2024-05-13, **A Generic Model for Persistent Radio Source around Fast Radio Bursts**, Yushan Chen et.al., [2405.07446v1](http://arxiv.org/abs/2405.07446v1)\n\n The repeated fast radio burst FRB 121102A and FRB 190520B has been reported, along with a spatially coincident, compact, persistent radio emission. In this paper, we present a parameterized one-zone model, with a basic scenario that a relativistic magnetized wind from the pulsar sweeps up the surroundings, e.g. freely expanding supernova ejecta, giving rise to a power-law distribution of electron filled between the forward shock and the termination shock. We show that via appropriate adjustment of the model parameters, we can obtain the synchrotron radio emission properties from the one-zone model bright enough to account for observation, simply and analytically fitting the observed spectra well. Through dynamical evolution of the model, we can also obtain time-varying of relevant properties. This parameterized model does not depend on concrete physical models such as central engine, instead we can constraint physical model via comparison between parameters and observation, indicating the information about the central engine and surroundings. We also discuss the synchrotron self-Compton emission in our scenario in the end, but find no clue on the counterparts at other waveband.\n\n"}}