{"neutrino": {"2504.20960": "2025-04-29, **MINER Reactor Based Search for Axion-Like Particles Using Sapphire (Al2O3) Detectors**, M. Mirzakhani et.al., [2504.20960v1](http://arxiv.org/abs/2504.20960v1)\n\n The absence of definitive results for WIMP dark matter has sparked growing interest in alternative dark matter candidates, such as axions and Axion-Like Particles (ALPs), which also provide insight into the strong CP problem. The Mitchell Institute Neutrino Experiment at Reactor (MINER), conducted at the Nuclear Science Center of Texas A&M University, investigated ALPs near a 1 MW TRIGA nuclear reactor core, positioned approximately 4 meters away. This experiment employed cryogenic sapphire detectors with a low detection threshold (approximately 100 eV), equipped with a Transition Edge Sensor capable of detecting athermal phonons. Due to the low-background environment, we were able to exclude ALPs with axion-photon coupling and axion-electron coupling as small as \\(g\\_{a\\gamma\\gamma} = 10^{-5}\\) and \\(g\\_{aee} = 10^{-7}\\), respectively. Energy depositions below 3 keV were not considered and remain blinded for our Coherent Elastic Neutrino Nucleus Scattering (CEvNS) analysis. This is the first result demonstrating the MINER experiment's potential to probe low-mass ALPs, enabled by its low-threshold detector and proximity to a reactor.\n\n", "2504.20338": "2025-04-29, **Positive neutrino masses with DESI DR2 via matter conversion to dark energy**, S. Ahlen et.al., [2504.20338v1](http://arxiv.org/abs/2504.20338v1)\n\n The Dark Energy Spectroscopic Instrument (DESI) is a massively parallel spectroscopic survey on the Mayall telescope at Kitt Peak, which has released measurements of baryon acoustic oscillations determined from over 14 million extragalactic targets. We combine DESI Data Release 2 with CMB datasets to search for evidence of matter conversion to dark energy (DE), focusing on a scenario mediated by stellar collapse to cosmologically-coupled black holes (CCBH). In this physical model, which has the same number of free parameters as $\\Lambda$CDM, DE production is determined by the cosmic star formation rate density (SFRD), allowing for distinct early- and late-time cosmologies. Using two SFRDs to bracket current observations, we find that the CCBH model: accurately recovers the cosmological expansion history, agrees with early-time baryon abundance measured by BBN, reduces tension with the local distance ladder, and relaxes constraints on the summed neutrino mass $\\sum m\\_\\nu$. For these SFRDs, we find a peaked positive $\\sum m\\_\\nu < 0.149\\,\\rm eV$ (95\\% confidence) and $\\sum m\\_\\nu = 0.106^{+0.050}\\_{-0.069}\\,\\rm eV$ respectively, in good agreement with lower limits from neutrino oscillation experiments. A peak in $\\sum m\\_\\nu > 0$ results from late-time baryon consumption in the CCBH scenario and is expected to be a general feature of any model that converts sufficient matter to dark energy during and after reionization.\n\n", "2504.20236": "2025-04-28, **Probing the Quantum Speed Limit and Entanglement in Flavor Oscillations of Neutrino-Antineutrino System in Curved Spacetime**, Abhishek Kumar Jha et.al., [2504.20236v1](http://arxiv.org/abs/2504.20236v1)\n\n We consider a spinning primordial black hole (PBH) described by the Kerr metric in Kerr-Schild polar coordinates (KSP). We derive an analytical expression for the four-vector gravitational potential in the underlying Hermitian Dirac Hamiltonian using these coordinates. This gravitational potential introduces an axial vector term in the Dirac equation in curved spacetime. We find that the magnitudes of the temporal and spatial components of the four-vector gravitational potential are significantly affected by the angle of the position vector of the spinor with respect to the spin axis of the PBH, its radial distance from the PBH, and the strength of the specific angular momentum of the PBH. These potentials modify the effective mass matrix of the neutrino-antineutrino system and significantly affect the transition probabilities during the flavor oscillation of the neutrino-antineutrino system. We then use the transition probability to investigate the quantum speed limit time (QSLT) bound ratio for the two-flavor oscillation of the neutrino-antineutrino system in curved spacetime. This helps us estimate how quickly the initial neutrino flavor state evolves over time under the influence of the gravitational field. Finally, we discuss quantum correlations such as entanglement entropy during the two-flavor oscillation of the neutrino-antineutrino system near a spinning PBH.\n\n", "2504.20163": "2025-04-28, **Implications of the KM3NeT Ultrahigh-energy Event on Neutrino Self-interactions**, Yuxuan He et.al., [2504.20163v1](http://arxiv.org/abs/2504.20163v1)\n\n Neutrino self-interactions ({\\nu}SI) mediated by light bosonic particles can produce characteristic spectral dips in astrophysical neutrino fluxes, thereby modifying the expected energy spectrum. The high-energy astrophysical neutrino spectrum has been extensively used to probe {\\nu}SI models through these distinctive features. The recent detection of the ultrahigh-energy event KM3-230213A offers a new opportunity to explore {\\nu}SI phenomenology at extreme energies. In this work, we investigate two implications of this observation under the assumption that the event originates from a diffuse power-law spectrum. First, we find that {\\nu}SI induces spectral distortions that can mildly alleviate tensions between the KM3-230213A detection and the previous non-observation of PeV-scale neutrinos in IceCube data. Second, we derive new constraints on the {\\nu}SI coupling strength for mediator masses around 100 MeV. Our analysis shows that neutrino telescopes can surpass existing collider constraints in this mass range. In the near future, IceCube-Gen2 is expected to substantially enhance the sensitivity to {\\nu}SI over a broader range of parameter space.\n\n", "2504.20143": "2025-04-28, **Neutrino flavor instabilities in a binary neutron star merger remnant: Roles of a long-lived hypermassive neutron star**, Hiroki Nagakura et.al., [2504.20143v1](http://arxiv.org/abs/2504.20143v1)\n\n Understanding the post-merger evolution of binary neutron star merger (BNSM) requires accurate modeling of neutrino transport and microphysics including neutrino flavor conversions. Many previous studies have suggested that fast flavor instability (FFI) and collisional flavor instability (CFI) pervade inner regions of BNSM remnant, and they could impact on fluid dynamics and r-process nucleosynthesis. In this work, we re-examine prospects of occurrences of FFI and CFI using Boltzmann neutrino transport, assuming a frozen fluid background obtained from a numerical relativity simulation of BNSM. We pay special attention to a case involving a long-lived ($>1\\,$ s) hypermassive neutron star (HMNS). Apart from confirming the claim that these flavor instabilities can occur in BNSM remnants, some new insights are revealed. We identify multiple mechanisms responsible for generating electron neutrino lepton number angular crossings, corresponding to a key indicator of FFI onset, which differ notably from those in black hole (BH) accretion disk systems. We also find that the appearance of positive chemical potential of electron-type neutrinos is a necessary, though not sufficient, condition for FFI, which offers a valuable diagnostic tool for predicting FFI based solely on fluid properties. For CFI, their growth rates are generally lower than FFI, but they can persistently occur in most of the accretion disk up to $\\sim 1\\,$ s. We also find that neglecting contributions of heavy-leptonic neutrinos results in overestimating growth rate and area of unstable regions of CFI. Our result suggests that FFI (CFI) tends to occur transiently (persistently) and locally (widespread in the disk), and FFI is more sensitive to the central compact object (HMNS or BH) than CFI, though more self-consistent simulations with incorporating effects of flavor conversions are needed to confirm these claims.\n\n", "2504.20044": "2025-04-28, **How Charged Can Neutrinos Be?**, Sudip Jana et.al., [2504.20044v1](http://arxiv.org/abs/2504.20044v1)\n\n We investigate how neutrinos may acquire small electric charges within the Standard Model framework while preserving electromagnetic gauge invariance. Instead of gauging the standard hypercharge generator $Y$, a linear combination of $Y$ and a new generator $X$ from a gaugable global $U(1)\\_X$ symmetry is embedded, under which neutrinos transform non-trivially. We demonstrate that minimal scenarios based on flavor-dependent $U(1)\\_X$ symmetries, such as $X = L\\_\\alpha - L\\_\\beta$, are incompatible with current neutrino oscillation data. In contrast, we have shown that only flavor-universal $U(1)\\_X$ symmetries-such as $U(1)\\_{B-L}$, which shifts both quark and lepton charges, and $U(1)\\_L$, which modifies only the lepton sector-can generate tiny neutrino charges consistent with observed masses and mixing. We also discuss the necessary connection between such charges and the Dirac nature of neutrinos. By analyzing the phenomenological implications in detail, our findings emphasize that constraints on neutrino charges should be evaluated within the specific framework of the $U(1)\\_X$ symmetry under consideration, rather than assuming a generic approach, as is often the case.\n\n", "2504.20038": "2025-04-28, **Unified and consistent structure growth measurements from joint ACT, SPT and \\textit{Planck} CMB lensing**, Frank J. Qu et.al., [2504.20038v1](http://arxiv.org/abs/2504.20038v1)\n\n We present the tightest cosmic microwave background (CMB) lensing constraints to date on the growth of structure by combining CMB lensing measurements from the Atacama Cosmology Telescope (ACT), the South Pole Telescope (SPT) and \\textit{Planck}. Each of these surveys individually provides lensing measurements with similarly high statistical power, achieving signal-to-noise ratios of approximately 40. The combined lensing bandpowers represent the most precise CMB lensing power spectrum measurement to date with a signal-to-noise ratio of 61 and an amplitude of $A\\_\\mathrm{lens}^\\mathrm{recon} = 1.025 \\pm 0.017$ with respect to the theory prediction from the best-fit CMB \\textit{Planck}-ACT cosmology. The bandpowers from all three lensing datasets, analyzed jointly, yield a $1.6\\%$ measurement of the parameter combination $S\\_8^\\mathrm{CMBL} \\equiv \\sigma\\_8\\,(\\Omega\\_m/0.3)^{0.25} = 0.825^{+0.015}\\_{-0.013}$. Including Dark Energy Spectroscopic Instrument (DESI) Baryon Acoustic Oscillation (BAO) data improves the constraint on the amplitude of matter fluctuations to $\\sigma\\_8 = 0.829 \\pm 0.009$ (a $1.1\\%$ determination). When combining with uncalibrated supernovae from \\texttt{Pantheon+}, we present a $4\\%$ sound-horizon-independent estimate of $H\\_0=66.4\\pm2.5\\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}} $. The joint lensing constraints on structure growth and present-day Hubble rate are fully consistent with a $\\Lambda$CDM model fit to the primary CMB data from \\textit{Planck} and ACT. While the precise upper limit is sensitive to the choice of data and underlying model assumptions, when varying the neutrino mass sum within the $\\Lambda\\mathrm{CDM}$ cosmological model, the combination of primary CMB, BAO and CMB lensing drives the probable upper limit for the mass sum towards lower values, comparable to the minimum mass prior required by neutrino oscillation experiments.\n\n", "2504.19896": "2025-04-28, **Tracing the ejecta structure of SN 1987A: Insights and diagnostics from 3D MHD simulations**, S. Orlando et.al., [2504.19896v1](http://arxiv.org/abs/2504.19896v1)\n\n Supernova (SN) 1987A provides a unique window into the aftermath of a massive stellar explosion, offering key insights into the ejecta's morphology, composition, explosion mechanism, progenitor system, and circumstellar medium (CSM) interaction. We investigate large-scale ejecta asymmetries in SN 1987A. By comparing the simulations with JWST observations and making predictions for XRISM, we aim to refine our understanding of the explosion mechanism and the remnant's evolution. We performed 3D MHD simulations that trace the evolution of SN 1987A from the SN to the SNR, extending our predictions up to 5000 years into the future and considering the Ni-bubble effects. The simulation results are compared with JWST observations and used to predict XRISM spectra, to evaluate the accuracy of the modeled ejecta structure. Our simulations reproduce the large-scale Fe-rich ejecta morphology seen by JWST, revealing two clumps suggestive of a bipolar explosion. Ni-bubble effects in the first year boost Fe-rich ejecta expansion and their interaction with the reverse shock. However, discrepancies with JWST observations in clump velocities and spatial distribution suggest stronger explosion asymmetries than modeled. Since 2021, our models predict that shocked ejecta have contributed increasingly to X-ray emission, now rivaling shocked CSM and soon dominating as the latter fades. Future XRISM observations will trace the evolution of these ejecta structures, refining constraints on explosion geometry. Early remnant asymmetries from CSM interaction may persist for at least 100 years. Our results underscore the role of asymmetric core-collapse mechanisms in shaping SN 1987A's ejecta and constraining its explosion geometry. Future studies should explore more extreme asymmetries, in neutrino-driven core collapse or magneto-rotational SN models, to identify the origin of its bipolar Fe-rich structure.\n\n", "2504.19697": "2025-04-28, **Rescuing leptogenesis in inverse seesaw models with the help of non-Abelian flavor symmetries**, Yan Shao et.al., [2504.19697v1](http://arxiv.org/abs/2504.19697v1)\n\n The inverse seesaw (ISS) model provides an attractive framework that can naturally explain the smallness of neutrino masses while accommodating some sterile neutrinos potentially accessible at present or future experiments. However, in generic ISS models with hierarchical pseudo-Dirac (PD) sterile neutrino pairs, the generation of the observed baryon asymmetry of the Universe via the leptogenesis mechanism is extremely challenging. In this paper, we investigate rescuing leptogenesis in the ISS model with the help of non-Abelian flavor symmetries which have the potential to explain the observed peculiar neutrino mixing pattern: we first implement non-Abelian flavor symmetries to naturally enforce mass degeneracies among different pseudo-Dirac sterile neutrino pairs and then break them in a proper way so that resonant leptogenesis among different PD sterile neutrino pairs can arise, thus enhancing the generated baryon asymmetry. To be specific, we have considered the following two well-motivated approaches for generating the tiny mass splittings among different PD sterile neutrino pairs: one approach makes use of the renormalization-group corrections to the sterile neutrino masses, while the other approach invokes non-trivial flavor structure of the $\\mu^{}\\_{\\rm s}$ matrix. For these two scenarios, we aim to explore the viability of leptogenesis and to identify the conditions under which the observed baryon asymmetry can be successfully reproduced.\n\n", "2504.19510": "2025-04-28, **Neutrino Constraints on Black Hole Formation in M31**, Yudai Suwa et.al., [2504.19510v1](http://arxiv.org/abs/2504.19510v1)\n\n We investigate neutrino signals associated with black hole formation resulting from the gravitational collapse of massive stars, motivated by the candidate failed supernova M31-2014-DS1 in the Andromeda Galaxy (M31). By compiling numerical simulation results for stellar collapse, we predict the expected neutrino emission and compare these predictions with observational limits from Super-Kamiokande (SK). The simulations reveal a characteristic precursor signal consisting of a short, intense burst whose average neutrino energy rises rapidly and then ceases abruptly once the black hole forms. We examine several nuclear equations of state, specifically the Lattimer \\& Swesty, Shen, Togashi, and SFHo models, to evaluate how the emission depends on neutron-star properties and nuclear-physics uncertainties. Comparison of the predicted event counts with SK's non-detection of neutrinos coincident with M31-2014-DS1 already rules out part of the model space and highlights the sensitivity of current neutrino detectors to both progenitor mass and the EOS. These findings demonstrate the capability of neutrino astronomy to probe core collapse and black hole formation in failed supernova scenarios.\n\n"}, "dark matter": {"2504.20857": "2025-04-29, **MIGHTEE-HI: The radial acceleration relation with resolved stellar mass measurements**, Andreea Varasteanu et.al., [2504.20857v1](http://arxiv.org/abs/2504.20857v1)\n\n The radial acceleration relation (RAR) is a fundamental relation linking baryonic and dark matter in galaxies by relating the observed acceleration derived from dynamics to the one estimated from the baryonic mass. This relation exhibits small scatter, thus providing key constraints for models of galaxy formation and evolution -- allowing us to map the distribution of dark matter in galaxies -- as well as models of modified dynamics. However, it has only been extensively studied in the very local Universe with largely heterogeneous samples. We present a new measurement of the RAR, utilising a homogeneous, unbiased sample of H{\\sc i}-selected galaxies. We introduce a novel approach of measuring resolved stellar masses using spectral energy distribution (SED) fitting across 10 photometric bands to determine the resolved mass-to-light ratio, which we show is essential for measuring the acceleration due to baryons in the low-acceleration regime. We find that the stellar mass-to-light ratio varies across galaxies and radially, favouring lower mass-to-light ratios compared to previous studies. Our results reveal a tight RAR with a low-acceleration power-law slope of $\\sim 0.5$, consistent with previous studies. Adopting a spatially varying mass-to-light ratio yields the tightest RAR with an intrinsic scatter of only $0.045 \\pm 0.022$ dex. We also find the first tentative evidence for redshift evolution in the acceleration scale, but more data will be required to confirm this. These results highlight the importance of resolved stellar mass measurements in accurately characterizing the gravitational contribution of the baryons in low-mass, gas-rich galaxies.\n\n", "2504.20825": "2025-04-29, **Numerical Relativity Simulations of Dark Matter Admixed Binary Neutron Stars**, Edoardo Giangrandi et.al., [2504.20825v1](http://arxiv.org/abs/2504.20825v1)\n\n Binary neutron star mergers provide insight into strong-field gravity and the properties of ultra-dense nuclear matter. These events offer the potential to search for signatures of physics beyond the standard model, including dark matter. We present the first numerical-relativity simulations of binary neutron star mergers admixed with dark matter, based on constraint-solved initial data. Modeling dark matter as a non-interacting fermionic gas, we investigate the impact of varying dark matter fractions and particle masses on the merger dynamics, ejecta mass, post-merger remnant properties, and the emitted gravitational waves. Our simulations suggest that the dark matter morphology - a dense core or a diluted halo - may alter the merger outcome. Scenarios with a dark matter core tend to exhibit a higher probability of prompt collapse, while those with a dark matter halo develop a common envelope, embedding the whole binary. Furthermore, gravitational wave signals from mergers with dark matter halo configurations exhibit significant deviations from standard models when the tidal deformability is calculated in a two-fluid framework. This highlights the need for refined models in calculating the tidal deformability when considering mergers with extended dark matter structures. These initial results provide a basis for further exploration of dark matter's role in binary neutron star mergers and their associated gravitational wave emission and can serve as a benchmark for future observations from advanced detectors and multi-messenger astrophysics.\n\n", "2504.20765": "2025-04-29, **MUSE observations of dwarf galaxies and a stellar stream in the M83 group**, Oliver Müller et.al., [2504.20765v1](http://arxiv.org/abs/2504.20765v1)\n\n Spectroscopy for faint dwarf galaxies outside of our own Local Group is challenging. Here, we present MUSE spectroscopy to study the properties of four known dwarf satellites and one stellar stream (KK208) surrounding the nearby grand spiral M83, which resides together with the lenticular galaxy Cen A in the Centaurus group. This data complete the phase-space information for all known dwarf galaxies around M83 down to a completeness of $-$10 mag in the $V$ band. All studied objects have an intermediate to old and metal-poor stellar population and follow the stellar luminosity-metallicity relation as defined by the Local Group dwarfs. For the stellar stream we serendipitously identify a previously unknown globular cluster, which is old and metal-poor. Two dwarf galaxies (NGC5264 and dw1341-29) may be a bound satellite of a satellite system due to their proximity and shared velocities. Having access to the positions and velocities of 13 dwarfs around M83, we estimate the mass of the group with different estimators. Ranging between 1.3 and $3.0 \\times 10^{12}$ M$\\_\\odot$ for the halo mass we find it to be larger than previously assumed. This may impact the previously reported tension for cold dark matter cosmology with the count of dwarf galaxies. In contrast to Cen A, we do not find a co-rotating plane-of-satellites around M83.\n\n", "2504.20184": "2025-04-28, **Holographic cosmology with logarithmic equation of state based on a new generalized entropy**, I. Brevik et.al., [2504.20184v1](http://arxiv.org/abs/2504.20184v1)\n\n The cosmological application of a dark viscous fluid in a spatially flat Friedmann-Robertson-Walker (FRW) universe with a modified logarithmic equation of state (EoS), being an analogue of the equation associated with the isotropic deformation of crystalline solids, is explored. This formalism represents a class of the so-called logotropic fluids, and allows explaining an accelerating late-time universe. Our research is based on a new generalized entropy function proposed by Nojiri-Odintsov-Faraoni [1]. We consider entropic cosmology and describe the evolution of the late time universe in the presence of dark matter coupled with viscous dark energy. In order to obtain a more detailed picture of its evolution, we add in our model a coupling of the log-corrected power-law fluid with dark matter, and study various interacting forms between them. We solve the system of dynamic equations for viscous dark fluid coupled with dark matter and obtain expressions for the log-corrected power-law dark energy density, and the energy density for dark matter. The research results are presented in holographic form in terms of generalized holographic cut-offs introduced by Nojiri and Odintsov [2, 3]. In the asymptotic case an expression for the Hubble function, and the energy density for dark matter in the entropic cosmology, are obtained.\n\n", "2504.20159": "2025-04-28, **The differences of baryonic and dark matter scaling relations in galaxy clusters between IllustrisTNG simulations and observations**, Daniel Miller et.al., [2504.20159v1](http://arxiv.org/abs/2504.20159v1)\n\n We compare the self-similar baryonic mass fraction scaling relations between galaxy clusters from the South Pole Telescope Sunyaev-Zel'dovich (SPT-SZ) survey and the IllustrisTNG state-of-the-art magnetohydrodynamical cosmological simulations. Using samples of 218 (TNG100) and 1605 (TNG300) friends-of-friends (FoF) haloes within $0.0 \\leq z \\leq 1.5$ and $M\\_{200c} \\geq 7 \\times 10^{13} M\\_{\\odot}$, we fit the scaling relations using Simple Power Law (SPL), Broken Power Law (BPL), and General Double Power Law (GDPL) models through non-linear least squares regression. The SPL model reveals null slopes for the baryonic fraction as a function of redshift, consistent with self-similarity. Observations and simulations agree within $1{-}2\\sigma$, suggesting comparable baryonic scaling slopes. We identify $\\sim$13.8$-$14.1 per cent of baryons as \"missing\", primarily in the form of intracluster light (ICL) across all halo masses and warm gas in low-mass haloes. High-mass haloes ($\\log\\_{10}(M\\_{500c}/M\\_{\\odot}) \\geq 14$) adhere to self-similarity, while low-mass haloes exhibit deviations, with the breakpoint occurring at $\\log\\_{10}(M\\_{500c}/M\\_{\\odot}) \\sim 14$, where baryons are redistributed to the outskirts. Our findings suggest that the undetected warm-hot intergalactic medium (WHIM) and baryon redistribution by feedback mechanisms are complementary solutions to the \"missing baryon\" problem.\n\n", "2504.20144": "2025-04-28, **How black hole mimickers and Shapiro-free lenses signal effective dark matter**, Lirui Yang et.al., [2504.20144v1](http://arxiv.org/abs/2504.20144v1)\n\n We report the existence of two exotic compact objects in the leading relativistic model of modified Newtonian dynamics, namely aether-scalar-tensor theory. This model is consistent with precision cosmology and gravitational wave constraints on tensor speed. Black hole mimickers could subtly change observations: gravitational waves from their mergers might show unusual echoes or altered ringdown patterns, and images of their horizon-scale shadows might be slightly different from those of a true black hole. Shapiro-free lenses are massless objects that deflect light without any gravitational time delay, producing distinctive lensing events. These predictions connect to ongoing and future gravitational-wave searches, horizon-scale imaging, and time-domain lensing surveys.\n\n", "2504.20133": "2025-04-28, **Shaping the Milky Way: The interplay of mergers and cosmic filaments**, Arpit Arora et.al., [2504.20133v1](http://arxiv.org/abs/2504.20133v1)\n\n The large-scale morphology of Milky Way (MW)-mass dark matter (DM) halos is shaped by two key processes: filamentary accretion from the cosmic web and interactions with massive satellites. Disentangling their contributions is essential for understanding galaxy evolution and constructing accurate mass models of the MW. We analyze the time-dependent structure of MW-mass halos from zoomed cosmological-hydrodynamical simulations by decomposing their mass distribution into spherical harmonic expansions. We find that the dipole ($\\ell=1$) and quadrupole ($\\ell=2$) moments dominate the gravitational power spectrum, encoding key information about the halo's shape and its interaction with the cosmic environment. While the dipole reflects transient perturbations from infalling satellites and damps on dynamical timescales, the quadrupole -- linked to the halo's triaxiality -- is a persistent feature. We show that the quadrupole's orientation aligns with the largest filaments, imprinting a long-lived memory on the halo's morphology even in its inner regions ($\\sim30$ kpc). At the virial radius, the quadrupole distortion can reach 1-2 times the spherical density, highlighting the importance of environment in shaping MW-mass halos. Using multivariate Singular Spectrum Analysis, we successfully disentangle the effects of satellite mergers and filamentary accretion on quadrupole. We find that the quadrupolar response induced by LMC-mass satellites has an order of magnitude larger gravitational power than in spherically symmetric MW models. This highlights the need for models that incorporate the MW's asymmetry and time-evolution, with direct consequences for observable structures such as disk warps, the LMC-induced wake, and stellar tracers -- particularly in the era of precision astrometry.\n\n", "2504.20045": "2025-04-28, **Up-type FCNC in presence of Dark Matter**, Subhaditya Bhattacharya et.al., [2504.20045v1](http://arxiv.org/abs/2504.20045v1)\n\n Dark Matter (DM) is a known unknown. Apart, current experimental constraints on flavor-changing neutral current (FCNC) processes involving up-type quarks also provide scope to explore physics beyond the Standard Model (SM). In this article, we establish a connection between the flavor sector and the DM sector with minimal extension of the SM. Here a singlet complex scalar field, stable under $\\mathbb{Z}\\_3$ symmetry, acts as DM and couples to SM up-type quarks through a heavy Dirac vector-like quark (VLQ), which shares the same $\\mathbb{Z}\\_3$ charge as of the DM. The model thus addresses the observed $D^0-\\bar{D^0}$ mixing, top-FCNC interactions, and $D^0$ meson decays, together with DM relic density, while evading the direct and indirect DM search bounds. The model can be probed at the future high-energy muon collider, through distinctive signatures of VLQ production, where the VLQ decays into DM and SM particles, abiding by the existing bounds.\n\n", "2504.20043": "2025-04-28, **Starlight from JWST: Implications for star formation and dark matter models**, John Ellis et.al., [2504.20043v1](http://arxiv.org/abs/2504.20043v1)\n\n We confront the star formation rate in different dark matter (DM) models with UV luminosity data from JWST up to $z\\simeq25$ and legacy data from HST. We find that a transition from a Salpeter population to top-heavy Pop-III stars is likely at $z\\simeq10$ and that beyond $z=10-15$ the feedback from supernovae and active galactic nuclei is progressively reduced, so that at $z\\simeq25$ the production of stars is almost free from any feedback. We compare fuzzy and warm DM models that suppress small-scale structures with the CDM paradigm, finding that the fuzzy DM mass $> 4.5 \\times 10^{-22}{\\rm eV}$ and the warm DM mass $> 1.5\\, {\\rm keV}$ at the 95\\% CL. The fits of the star formation rate parametrization do not depend strongly on the DM properties within the allowed range. We find no preference over CDM for enhanced matter perturbations associated with axion miniclusters or primordial black holes. The scale of the enhancement of the power spectrum should be $> 27\\,{\\rm Mpc}^{-1}$ at the 95\\% CL, excluding axion miniclusters produced for $m\\_a < 7.5 \\times 10^{-17}\\,{\\rm eV}$ or heavy primordial black holes that constitute a fraction $f\\_{\\rm PBH}$ of DM in the range $10^{-4} (m\\_{\\rm PBH}/10^4 \\,M\\_{\\odot})^{-0.09} < f\\_{\\rm PBH} < 8.7\\times 10^{-3} (m\\_{\\rm PBH}/10^4\\, M\\_{\\odot})^{-1}$.\n\n", "2504.19958": "2025-04-28, **Machine Learning Identification of Gravimentally Microlensed Gamma-Ray Bursts**, Mohammad H. Zhoolideh Haghighi et.al., [2504.19958v1](http://arxiv.org/abs/2504.19958v1)\n\n Gravitational microlensing of gamma-ray bursts (GRBs) provides a unique opportunity to probe compact dark matter and small-scale structures in the universe. However, identifying such microlensed GRBs within large datasets is a significant challenge. In this study, we develop a machine learning approach to distinguish Lensed GRBs from their Non-lensed counterparts using simulated light curves. A comprehensive dataset was generated, comprising labeled light curves for both categories. Features were extracted using the Cesium package, capturing critical temporal properties of the light curves. Multiple machine learning models were trained on the extracted features, with Random Forest achieving the best performance, delivering an accuracy of 94\\% and an F1 score of 95\\% (94\\%) for Non-Lensed (Lensed) class. This approach successfully demonstrates the potential of machine learning for identifying gravitational lensing in GRBs, paving the way for future observational applications.\n\n", "2504.19886": "2025-04-28, **Pseudo-Nambu-Goldstone-boson Dark Matter from Three Complex Scalars**, Riasat Sheikh et.al., [2504.19886v1](http://arxiv.org/abs/2504.19886v1)\n\n This study explores a dark matter model in which a pseudo-Nambu-Goldstone boson arises as a viable dark matter candidate from the spontaneous and soft breaking of global $U(1)$ symmetries and stabilized by a residual $\\mathbb{Z}\\_3$ discrete symmetry. The model introduces three complex scalar fields, singlets under the Standard Model gauge group, and charged under a dark $U(1)\\_V$ gauge symmetry together with a permutative exchange symmetry among three scalars. These features naturally suppress the dark matter--nucleon scattering cross section by its Nambu-Goldstone boson nature. In addition to conventional annihilation channels, the $\\mathbb{Z}\\_3$ structure allows semi-annihilation processes, potentially leading to new phenomenological signatures. We analyze theoretical and experimental constraints, including relic abundance, Higgs invisible decays, and perturbative unitarity, and evaluate the elastic scattering cross section for boosted dark matter.\n\n", "2504.19714": "2025-04-28, **Fast numerical evaluation of dark matter direct detection event rates**, Sebastian Sassi et.al., [2504.19714v1](http://arxiv.org/abs/2504.19714v1)\n\n The mathematical expression for the dark matter nuclear recoil event rate in a detector consists of a six dimensional integral over the velocity distribution of dark matter in the detector frame, and over the recoil momentum of the nucleus. While a significant part of this integral can be solved in closed form under traditional assumptions of the standard halo model and/or isotropic detector response, analysis of alternate assumptions is conventionally impeded by the inefficiency of multidimensional numerical integration methods. In this work we introduce a novel, fast and efficient algorithm for direct detection event rate computations. This algorithm takes advantage of a closed form expression for the Radon transform of three dimensional Zernike functions, which are used as basis functions for the velocity distribution. We demonstrate an implementation of this algorithm ZebraDM (https://github.com/sebsassi/zebradm), which is typically faster than an optimized numerical integration approach by a factor between $10^2$ and $10^4$.\n\n", "2504.20120": "2025-04-28, **Interaction of domain walls with scalar particles in the early Universe**, D. P. Filippov et.al., [2504.20120v1](http://arxiv.org/abs/2504.20120v1)\n\n The formation of solitons (such as closed domain walls) in the super-Early Universe is predicted in a number of theories of the formation of primordial black holes. However, the interaction of particles of the surrounding medium with the solitons should affect their dynamics. In the paper, we consider the interaction between domain walls and scalar particles which can play a role of dark matter. It is shown that when the temperature of the scalar particle gas, caused by the expansion of the Universe, decreases below a certain threshold value, the wall abruptly becomes opaque and locks particles inside itself. We discuss the dynamics of a single domain wall taking into account pressure of scalar particles locked inside a closed wall. It is shown, this effect leads to a time delay of domain wall collapse and the deferred formation of primordial black holes.\n\n", "2504.19505": "2025-04-28, **Exploring Ultralight Dark Matter Self-Coupling via the Gravitational Wave Background**, Pratick Sarkar et.al., [2504.19505v1](http://arxiv.org/abs/2504.19505v1)\n\n Supermassive black hole binary mergers serve as prominent sources of the stochastic gravitational wave background (SGWB), detectable by pulsar timing arrays (PTAs). If dark matter-induced friction is present in the vicinity of these mergers, it can lead to suppression in the nanohertz frequency range of the SGWB spectrum. In particular, ultralight dark matter (ULDM) forming compact solitonic cores around supermassive black holes can imprint signatures in PTA observations. Our analysis places limits on the mass and self-interaction strength of ULDM, demonstrating that soliton-induced dynamical friction can significantly alter the SGWB spectrum. PTAs have the potential to exclude certain ULDM mass ranges while probing the effects of self-interactions, offering a novel avenue to investigate the fundamental properties of ULDM.\n\n", "2504.19422": "2025-04-28, **Constraints on the galaxy formation models during epoch of reionization with high redshift observations**, Qing-Bo Ma et.al., [2504.19422v1](http://arxiv.org/abs/2504.19422v1)\n\n We use high resolution N-body dark matter simulations and L-Galaxies semi-analytical galaxy formation models to explore the high-$z$ galaxy properties and estimate the budget of ionizing photons. The parameters within L-Galaxies are obtained using a Markov Chain Monte Carlo (MCMC) method with high-$z$ galaxy observations from JWST and other telescopes. We consider two versions of L-Galaxies with and without dust correction on galaxy UV luminosities. With the best-fit parameters, both L-Galaxies 2015 and L-Galaxies 2020 reproduce well observations of UV luminosity functions, stellar mass functions, star formation rate densities and ionizing photon emission efficiency. With the assumption of escape fraction of $20\\%$, all models produce more ionizing photons than the number of Hydrogen atoms in the Universe at $z>6$. The inclusion of dust correction within MCMC results in higher star formation efficiency, which predicts $\\sim 50\\%$ more ionizing photons, with better consistency between the predicted stellar mass functions and observations.\n\n"}, "supernova": {"2504.20664": "2025-04-29, **Challenging $Λ$CDM: 5$σ$ Evidence for a Dynamical Dark Energy Late-Time Transition**, Mateus Scherer et.al., [2504.20664v1](http://arxiv.org/abs/2504.20664v1)\n\n Recently, there has been considerable debate regarding potential evidence for the dynamical nature of dark energy (DE), particularly in light of Baryon Acoustic Oscillations (BAO) measurements released by DESI survey. In this work, we propose an agnostic test that simultaneously constrains the dark energy (DE) equation of state (EoS) and probes the possibility of a transition between the quintessence and phantom regimes, or vice versa. Our initial approach is independent of physical priors, allowing the data to determine which behavior best fits the parameters. We then consider a minimally modified gravity theory known as VCDM, into which we can map our initial approximation, placing it within a theoretically stable framework. To this end, we incorporate the most up-to-date datasets available, including BAO measurements from DESI-DR2, Type Ia Supernovae from the PantheonPlus, DESY5, and Union3 samples, as well as Cosmic Microwave Background (CMB) data from Planck. Our analysis reveals strong and statistically significant evidence for a quintessence-phantom transition across various data combinations. \\textit{The strongest evidence is found for Planck+DESI+DESY5, with a significance exceeding $\\sim$5$\\sigma$ in favor of a quintessence-phantom transition at $z\\_{\\dag} = 0.493^{+0.063}\\_{-0.081}$}. Beyond this redshift, the EoS remains within the phantom regime, while for $z < z\\_{\\dag}$, it favors the quintessence regime. Despite this strong indication, \\textit{we find that such transitions do not resolve the $H\\_0$ tension}.\n\n", "2504.20601": "2025-04-29, **How to turn a Supernova into a PeVatron**, Robert Brose et.al., [2504.20601v1](http://arxiv.org/abs/2504.20601v1)\n\n Context. It is important to determine which Galactic cosmic-ray sources can accelerate particles to the knee of the cosmic ray spectrum at a few PeV, and in particular whether supernova remnants may contribute. Current models for particle acceleration in very young remnants assume the circumstellar material consists of smooth, freely expanding winds. There is strong evidence that some supernovae expand into much denser circumstellar material including dense shells ejected by eruptions shortly before explosion.   Aims. We investigate the effects of dense circumstellar shells on particle acceleration in supernova shocks during the first few years post-explosion, to quantify whether such interaction supernovae may act as PeVatrons.   Methods. We used the pion code to model the circumstellar medium around Luminous Blue Variables after having a brief episode with a mass-loss rate of up to dM/dt = 2Msol/yr. Consequently, we performed spherically symmetric 1-D simulations using our time-dependent acceleration-code RATPaC in which we simultaneously solve the transport equations for cosmic-rays, magnetic turbulence, and the hydrodynamical flow of the thermal plasma in the test-particle limit.   Results. We find that the interaction with the circumstellar shells can significantly boost the maximum energy by enhancing particle escape during the onset of the shock-shell interaction followed by the reacceleration of the shock propagating into a medium with a pre-amplified field. Early interactions boost the maximum energy to a greater degree and interactions within the first 5 months after explosion can increase Emax to more then 1 PeV.\n\n", "2504.20574": "2025-04-29, **Two Decades of Dust Evolution in SN 2005af through JWST, Spitzer, and Chemical Modeling**, Arkaprabha Sarangi et.al., [2504.20574v1](http://arxiv.org/abs/2504.20574v1)\n\n The evolution of dust in core-collapse supernovae (SNe), in general, is poorly constrained owing to a lack of infrared observations after a few years from explosion. Most theories of dust formation in SNe heavily rely only on SN 1987A. In the last two years, the James Webb Space Telescope (JWST) has enabled us to probe the dust evolution in decades-old SNe, such as SN 2004et, SN 2005ip, and SN 1980K. In this paper, we present two decades of dust evolution in SN 2005af, combining early-time infrared observations with Spitzer Space Telescope and recent detections by JWST. We have used a chemical kinetic model of dust synthesis in SN ejecta to develop a template of dust evolution in SN 2005af. Moreover, using this approach, for the first time, we have separately quantified the dust formed in the pre-explosion wind that survived after the explosion, and the dust formed in the metal-rich SN ejecta post-explosion. We report that in SN 2005af, predominantly carbon-rich dust is formed in the ejecta, where the total mass of ejecta dust is about 0.02-0.03 Msun, while in the circumstellar medium the amount of surviving oxygen-rich dust is 0.001-0.004 Msun.\n\n", "2504.20407": "2025-04-29, **Discovery of a variable yellow supergiant progenitor for the Type IIb SN 2024abfo**, Zexi Niu et.al., [2504.20407v1](http://arxiv.org/abs/2504.20407v1)\n\n We report the discovery of a progenitor candidate for the Type IIb SN 2024abfo using multi-epoch pre-explosion images from the Hubble Space Telescope and the Dark Energy Camera Legacy Survey. The progenitor exhibited a ~0.7 mag decline in F814W from 2001 to 2013, followed by significant brightness and color fluctuations in the g, r and z bands. This is the first time that a variable progenitor has been found for a SN IIb. We suggest that the variability is caused by intrinsic changes in the progenitor star instead of varying obscuration by circumstellar dust. Our results show that the progenitor of SN 2024abfo was likely a yellow supergiant star with an initial mass of 12--14, 14--15 and 15--18 Msun for different assumed values of circumstellar reddening of E(B-V)\\_CSM = 0, 0.1 and 0.2 mag. Our study underscores the critical role of multi-epoch imaging surveys in revealing the final stages of core-collapse supernovae progenitors.\n\n", "2504.20132": "2025-04-28, **Expanding Ejecta Method: I. Mapping Supernova Morphology with Intensity Interferometry**, I-Kai Chen et.al., [2504.20132v1](http://arxiv.org/abs/2504.20132v1)\n\n We explore the potential of optical intensity interferometry to extract angularly resolved information from supernova explosions, introducing the \"expanding ejecta method\" (EEM) as a robust alternative to the classical expanding photosphere method (EPM). Foreseeing future improvements to intensity interferometers of large light collection area ($25\\pi\\,\\rm{m}^2$ per telescope) equipped with spectral multiplexing ($10^4$ spectral resolution) and fast photodetectors ($10\\,\\mathrm{ps}$ timing resolution, $50\\%$ overall efficiency), we demonstrate that high signal-to-noise measurements of the visibility modulus are achievable for Type IIP (Type Ia) supernovae out to $3~(12)\\,\\mathrm{Mpc}$. By focusing on generic line emission and absorption in ballistic ejecta, the EEM can relax assumptions about spherical symmetry, blackbody radiation, and extinction. The EEM enables angular diameter distances to be determined with $\\sim2\\%$ precision for supernovae of apparent magnitude $m = 12$ from a 60-hour observation by an intensity interferometer with those same instrumental specifications. We argue that the EEM is significantly more robust to modeling uncertainties and systematic effects than (variants of) the EPM. In a companion paper, we show how the EEM can be used to provide geometric anchors for cosmic distance ladder calibration, or to construct a wholly independent Hubble diagram based on angular diameter distances.\n\n", "2504.20043": "2025-04-28, **Starlight from JWST: Implications for star formation and dark matter models**, John Ellis et.al., [2504.20043v1](http://arxiv.org/abs/2504.20043v1)\n\n We confront the star formation rate in different dark matter (DM) models with UV luminosity data from JWST up to $z\\simeq25$ and legacy data from HST. We find that a transition from a Salpeter population to top-heavy Pop-III stars is likely at $z\\simeq10$ and that beyond $z=10-15$ the feedback from supernovae and active galactic nuclei is progressively reduced, so that at $z\\simeq25$ the production of stars is almost free from any feedback. We compare fuzzy and warm DM models that suppress small-scale structures with the CDM paradigm, finding that the fuzzy DM mass $> 4.5 \\times 10^{-22}{\\rm eV}$ and the warm DM mass $> 1.5\\, {\\rm keV}$ at the 95\\% CL. The fits of the star formation rate parametrization do not depend strongly on the DM properties within the allowed range. We find no preference over CDM for enhanced matter perturbations associated with axion miniclusters or primordial black holes. The scale of the enhancement of the power spectrum should be $> 27\\,{\\rm Mpc}^{-1}$ at the 95\\% CL, excluding axion miniclusters produced for $m\\_a < 7.5 \\times 10^{-17}\\,{\\rm eV}$ or heavy primordial black holes that constitute a fraction $f\\_{\\rm PBH}$ of DM in the range $10^{-4} (m\\_{\\rm PBH}/10^4 \\,M\\_{\\odot})^{-0.09} < f\\_{\\rm PBH} < 8.7\\times 10^{-3} (m\\_{\\rm PBH}/10^4\\, M\\_{\\odot})^{-1}$.\n\n", "2504.20128": "2025-04-28, **Gas-cell development for nuclear astrophysics motivated studies on noble gas targets and the $^3$He($α$,$γ$)$^7$Be reaction**, Á. Tóth et.al., [2504.20128v1](http://arxiv.org/abs/2504.20128v1)\n\n In classical nuclear physics experiments in most cases the target is solid, either in atomic or in molecular form. However, there are selected cases, where solid target is hardly be produced. Such a case is in particular, when the target is noble gas. In many astrophysical scenarios, such as big bang nucleosynthesis (BBN), stellar hydrogen burning, and supernova explosions, alpha induced reactions on noble gas nuclei play a crucial role. Studying these reactions in the laboratory requires these noble gas atoms to be confined in a sufficient amount to allow the reactions. For example, in case of the $^3$He($\\alpha$,$\\gamma$)$^7$Be reaction, both reactants are noble gases. The reaction cross section was experimentally determined in several works, however there are still energy regions lacking experimental data, rendering the extrapolations towards the astrophysically relevant energies uncertain. To be able to study among others the $^3$He($\\alpha$,$\\gamma$)$^7$Be reaction, a thin-windowed gas-cell target was developed, which can be used to study alpha induced reactions on noble gases leading to radioactive isotopes. The reaction product is collected inside a catcher foil to be analyzed later with gamma spectroscopy. Using the described gas-cell, new experimental total cross section of the $^3$He($\\alpha$,$\\gamma$)$^7$Be reaction was determined in the energy range of $E\\_\\mathrm{c.m.} = 2600-3000$~keV. These results confirm the overall trend, and also the absolute scale in this energy range. In addition, studying particle scattering with the same reactant as a radiative capture gives valuable information about the compound nucleus. The measured scattering cross section can be used forvalidations of theoretical reaction cross section estimates. For this aim, gas-cell was designed to study alpha scattering on noble gas target. A few test measurement is presented with the scattering gas-cell.\n\n", "2504.19964": "2025-04-28, **XMM-Newton Observations of the High Temperature Plasma in the Large Magellanic Cloud Supernova Remnant N132D**, Adam R. Foster et.al., [2504.19964v1](http://arxiv.org/abs/2504.19964v1)\n\n We present an analysis of the archival XMM-Newton observations of the Large Magellanic Cloud (LMC) supernova remnant N132D totaling more than 500ks. We focus on the high temperature plasma ($kt\\sim 4.5$keV) that is responsible for the high energy continuum and exciting the Fe K emission. An image analysis shows that the Fe K emission is mainly concentrated in the southern part of the remnant interior to the region defined by the forward shock. This Fe K distribution would be consistent with an asymmetric distribution of the Fe ejecta and/or an asymmetric interaction between the reverse shock and the Fe ejecta. We compare the EPIC-pn and EPIC-MOS spectra in the 3.0 -- 12.0keV bandpass with a model based on RGS data plus a higher temperature component, in collisional ionization equilibrium (CIE), or non-equilibrium (NEI) (both ionizing and recombining). We find that the data are equally well-fitted by the CIE and ionizing models. Assuming the CIE and ionizing spectral models, the Fe in this high temperature component is significantly enhanced with respect to typical LMC abundances. We can place only an upper limit on the neutral Fe K line. We conclude that the Fe~K emission is due to ejecta heated by the reverse shock given the spatial distribution, relatively high temperature, and enhanced abundance. We estimate the progenitor mass based on the Ca/Fe and Ni/Fe mass ratios to be $13\\le M\\_P \\le 15 M\\_\\odot$.\n\n", "2504.19884": "2025-04-28, **Accretion and Recovery in Giant Eruptions of Massive Stars**, Bhawna Mukhija et.al., [2504.19884v1](http://arxiv.org/abs/2504.19884v1)\n\n Giant Eruptions (GEs) are episodic high-rate mass loss events that massive stars experience in the late stage of evolutions before exploding as a core-collapse supernova. If it occurs in a binary system, the companion star can accrete part of the mass. We use numerical simulations to analyze how the companion responds to accretion and how its structure and evolution are altered. We run a grid of massive stars with masses from $20~\\rm M\\_{\\odot}$ to $60~\\rm M\\_{\\odot}$, and accretion rates from $\\rm 10^{-4}$ to $\\rm 0.1~M\\_{\\odot}~\\rm yr^{-1}$, over a duration of $20$ yrs. For accretion rates $\\rm \\lesssim 0.01~M\\_{\\odot}~\\rm yr^{-1}$ the star remains on the hotter side of the HR diagram with a minor increase in luminosity without expanding, as the accretion timescale exceeds the thermal time scale by a larger factor. Mass loss through stellar winds leads to a minor drop in luminosity shortly after the accretion phase as the star enters the recovery phase. For $\\rm \\gtrsim 0.01~M\\_{\\odot}~\\rm yr^{-1}$ the companion star experiences a sudden increase in luminosity by about one order of magnitude, inflates, and cools. Under the accreted gas layer the star retains its structure and continues to eject radiation-driven wind during the recovery phase, namely the time it takes to regain equilibrium. Eventually, the accreted material mixes with the inner layers of the star, and the star continues to evolve as a more massive star.\n\n", "2504.19672": "2025-04-28, **On Neutron Star Natal Kicks in High-Mass X-Ray Binaries: Insights from Population Synthesis**, Xiangyu Ivy Wang et.al., [2504.19672v1](http://arxiv.org/abs/2504.19672v1)\n\n The motion of neutron stars (NSs) in the Galaxy is largely dependent on natal kicks received by the NSs during supernova explosions. Thus, the measured peculiar velocities of NS high-mass X-ray binaries (HMXBs) provide valuable clues to natal kicks, which also play an important role in the evolution of HMXBs. In this work, we collect proper motions, radial velocities and parallaxes for 36 NS HMXBs to derive their peculiar velocities at the birth of the NSs. We then use binary population synthesis to simulate the velocities of NS HMXBs with various choices of the kick velocity distribution for both core-collapse and electron-capture supernovae. Comparing the simulated and measured velocities, orbital periods, and eccentricities, we show that the natal kick distribution that can best match the observations is characterized by a bimodal Maxwellian distribution with $\\sigma\\_1$ = 320 km s$^{-1}$ (for core-collapse supernovae) and $\\sigma\\_2$ = 80 km s$^{-1}$ (for electron-capture supernovae) and the He core mass for the latter in the range of $(1.83-2.25)$ $M\\_{\\odot}$. Our findings provide useful insights for further population synthesis and binary evolution studies of NS binaries.\n\n", "2504.19579": "2025-04-28, **Latest developments in wide-field VLBI**, Jack F. Radcliffe et.al., [2504.19579v2](http://arxiv.org/abs/2504.19579v2)\n\n Very Long Baseline Interferometry (VLBI) combines the signals of telescopes distributed across thousands of kilometres to provide some of the highest angular resolution images of astrophysical phenomena. Due to computational expense, typical VLBI observations are restricted to a single target and a small (few arcseconds) field-of-view per pointing. The technique of wide-field VLBI was born to enable the targeting of multiple sources and has been successful in providing new insights into Active Galactic Nuclei, the interstellar medium, supernovae, gravitational lenses and much more. However, this technique is still only employed in a few experiments, restricting the scientific potential of VLBI observations. In this conference proceeding, we outline new developments in wide-field VLBI, including an end-to-end correlation and calibration workflow, distributed correlation, and new calibration routines. These developments aim to enable wide-field VLBI to be a standard observing mode on all major VLBI arrays.\n\n", "2504.19523": "2025-04-28, **Observational constraints in late time for an axially symmetric transitioning model with bulk viscous fluid**, G. K. Goswami et.al., [2504.19523v1](http://arxiv.org/abs/2504.19523v1)\n\n In this paper, we explore an axially symmetric Bianchi type-I model of the universe with bulk viscous fluid as a source of gravitational field under the framework of Einstein's field equations by assuming barotropic bulk viscous pressure as $-3\\zeta H^2$.   The model parameters have been estimated with the help of four data sets: The Hubble 46 data set describes Hubble parameter values at various redshifts, Union 2.1 compilation data sets comprise a distance modulus of 580 SNIa supernovae at different redshifts, the Pantheon data set contains Apparent magnitudes of 1048 SNIa supernovae at various redshifts and finally BAO data set of volume averaged distances at 5 redshifts.   The observational data is analyzed using the traditional Bayesian methodology, and the posterior distributions of the parameters are obtained using the Markov Chain Monte Carlo (MCMC) technique. To get the best-fit values for the model parameters for MCMC analysis, we use the $ emcee $ package. For parameter estimation, we have also employed the minimizing $\\chi^{2}$ function. We also tried to achieve these values statistically using combined data sets from the four described earlier. The OHD+BAO~and~OHD+Pan+BAO+Union combined data sets provide the best fit Hubble parameter value $H\\_0$ as $66.912 ^{+0.497}\\_{-0.501})$ Km/s/Mpc and $74.216 ^{+0.150}\\_{-0.148}$ Km/s/Mpc respectively. We have performed state finder diagnostics to discuss the nature of dark energy. Some other geometrical parameters like the Jerk parameter and the Om diagnostic are also being discussed to clarify the nature of the dark energy model. The study reveals that the model behaves like a quintessence in late time and approaches the $\\Lambda$ CDM model.\n\n"}}