{"neutrino": {"2510.26621": "2025-10-30, **Study of neutrino spin oscillations in a gravitational field with a differential equations method**, Mridupawan Deka et.al., [2510.26621v1](http://arxiv.org/abs/2510.26621v1)\n\n In this work, we employ Ordinary Differential Equation solution method to study neutrino spin oscillations in the case when they are gravitationally scattered off a rotating Kerr black hole. Previously, this problem involved the integral solution of the Hamilton-Jacobi equation. We analyze the consistency of these two methods.\n\n", "2510.26267": "2025-10-30, **The signals of doomsday II: Cosmological signatures of late time $SU(3)_c$ symmetry breaking**, Amartya Sengupta et.al., [2510.26267v1](http://arxiv.org/abs/2510.26267v1)\n\n The only two gauge symmetries which remain unbroken today are $SU(3)\\_c$ and $U(1)\\_{EM}$. Both of them are crucial for our universe to appear the way it does, and for our form of life to exist. Unless we are very special observers living at the very end of the cosmological symmetry breaking chain, there is no reason to believe that these two symmetries will remain unbroken in the future. In this paper, we discuss cosmological observational signatures of the $SU(3)\\_c$ symmetry breaking. We introduce a model with a new colored scalar field whose potential supports the first order phase transition through creation of the true vacuum bubbles. We then calculate particle production due to vacuum mismatch and use the event generators to study the decays of the new scalar field and massive gluons. We then use Pythia to hadronize the decay products and get the distributions of produced photons and neutrinos as the final result. They represent a long range signature which, if ever observed, might be interpreted as the signals of the doomsday.\n\n", "2510.26260": "2025-10-30, **Letter of Intent: The Forward Physics Facility**, Luis A. Anchordoqui et.al., [2510.26260v1](http://arxiv.org/abs/2510.26260v1)\n\n The Forward Physics Facility (FPF) is a proposed extension of the HL-LHC program designed to exploit the unique scientific opportunities offered by the intense flux of high energy neutrinos, and possibly new particles, in the far-forward direction. Located in a well-shielded cavern 627 m downstream of one of the LHC interaction points, the facility will support a broad and ambitious physics program that significantly expands the discovery potential of the HL-LHC. Equipped with four complementary detectors -- FLArE, FASER$\\nu$2, FASER2, and FORMOSA -- the FPF will enable breakthrough measurements that will advance our understanding of neutrino physics, quantum chromodynamics, and astroparticle physics, and will search for dark matter and other new particles. With this Letter of Intent, we propose the construction of the FPF cavern and the construction, integration, and installation of its experiments. We summarize the physics case, the facility design, the layout and components of the detectors, as well as the envisioned collaboration structure, cost estimate, and implementation timeline.\n\n", "2510.26235": "2025-10-30, **Testing the type-II seesaw mechanism with gravitational waves**, Yonghua Wang et.al., [2510.26235v1](http://arxiv.org/abs/2510.26235v1)\n\n Traditional seesaw mechanisms provide an elegant theoretical framework for explaining the small yet non-zero masses of neutrinos. Nevertheless, they face significant experimental challenges, primarily because the energy scale associated with the seesaw mechanism is too high to be directly probed in terrestrial experiments. In this paper, we explore the gravitational waves (GWs) generated via graviton bremsstrahlung during the decay of seesaw particles in the early Universe. Specifically, we compute the GW spectrum resulting from the decay of the Higgs triplet within the type-II seesaw model. Our results demonstrate that the resulting GW spectrum depends sensitively on the mass of the Higgs triplet and its couplings to the Standard Model Higgs doublet and the left-handed lepton doublet. The detection of such a high-frequency GW background could offer a unique experimental window into the seesaw mechanism and provide indirect evidence for its validity.\n\n", "2510.26232": "2025-10-30, **Search for nucleon decay via $p\\rightarrowνπ^{+}$ and $n\\rightarrowνπ^{0}$ in 0.484 Mton-year of Super-Kamiokande data**, Super-Kamiokande Collaboration et.al., [2510.26232v1](http://arxiv.org/abs/2510.26232v1)\n\n We present the results of searches for nucleon decays via $p\\rightarrow\\nu\\pi^{+}$ and $n\\rightarrow\\nu\\pi^{0}$ using a 0.484 Mt$\\cdot$yr exposure of Super-Kamiokande I-V data covering the entire pure water phase of the experiment. Various improvements on the previous 2014 nucleon decay search, which used an exposure of 0.173 Mt$\\cdot$yr, are incorporated. The physics models related to pion production and nuclear interaction are refined with external data, and a more comprehensive set of systematic uncertainties, now including those associated with the atmospheric neutrino flux and pion production channels is considered. Also, the fiducial volume has been expanded by 21\\%. No significant indication of a nucleon decay signal is found beyond the expected background. Lower bounds on the nucleon partial lifetimes are determined to be $3.5\\times10^{32}$~yr for $p\\rightarrow\\nu\\pi^{+}$ and $1.4\\times10^{33}$~yr for $n\\rightarrow\\nu\\pi^{0}$ at 90\\% confidence level.\n\n", "2510.26126": "2025-10-30, **KM3-230213A and IceCube Neutrino Events from Metastable Dark Matter of Primordial Black Hole Origin**, Prabhav Singh et.al., [2510.26126v1](http://arxiv.org/abs/2510.26126v1)\n\n We investigate a scenario in which the recently observed ultra-high-energy neutrino event KM3-230213A, with a median energy of approximately 220 PeV, as well as the high-energy neutrinos detected by IceCube Observatory, originate from the decay of superheavy dark matter (DM) particles produced through primordial black hole (PBH) evaporation. To establish this connection, we derive constraints on the PBH abundance parameter $\\beta$ as a function of the initial PBH mass $M\\_{\\mathrm{BH\\_0}}$ and DM mass $m\\_{\\mathrm{DM}}$, by considering the bound from the observed relic DM abundance. Using these constraints, we compute the resulting neutrino flux and show that DM masses in the PeV-EeV range can yield neutrinos of comparable energies, capable of accounting for both the KM3-230213A and IceCube events while remaining consistent with the relic abundance constraint. Interestingly, the scenario remains viable over a broad region of parameter space while satisfying existing cosmological and astrophysical bounds. Overall, our results demonstrate that PBH evaporation followed by DM decay provides a consistent and natural explanation for the observed ultra-high-energy neutrino events in the absence of accompanying multimessenger signatures.\n\n", "2510.26050": "2025-10-30, **Reconstruction of neutrino events in the Accelerator Neutrino Neutron Interaction Experiment: Part I**, S. Abubakar et.al., [2510.26050v1](http://arxiv.org/abs/2510.26050v1)\n\n The Accelerator Neutrino Neutron Interaction Experiment (ANNIE) was designed to reconstruct neutrino events from the Fermilab Booster Neutrino Beam (BNB) with the parallel goals of measuring neutron production in interactions with oxygen and serving as a testbed for new technology. The ANNIE detector consists of a 26-ton water Cherenkov target tank instrumented with conventional photomultiplier tubes (PMTs), a downstream tracking muon spectrometer, and an upstream double wall of plastic scintillator to serve to veto charged particles incoming from neutrino events that occur upstream of the experimental setup. ANNIE has also deployed multiple Large-Area Picosecond PhotoDetectors (LAPPDs) and a test vessel of water-based liquid scintillator (WbLS). This paper describes the event reconstruction performance of the detector before implementation of these novel technologies, which will serve as a baseline against which their impact can be measured. That said, even the techniques used for event reconstruction using only the conventional PMT array and muon spectrometer are significantly different than those used in other water Cherenkov detectors due to the small size of ANNIE (which makes nanosecond-scale timing not as useful as in a large detector) and the availability of reconstruction information from the tracking muon spectrometer. We demonstrate that combining the information from these two elements into a single fit using only pattern recognition yields a muon vertex uncertainty of 60 cm, a directional uncertainty of 13.2 degrees, and energy reconstruction uncertainty of about 10\\% for BNB muon neutrino Charged Current Zero Pion (CC0pi) events.\n\n", "2510.25877": "2025-10-29, **A Mini Review of some Dark Matter/BSM Physics and a Bit More**, Shmuel Nussinov et.al., [2510.25877v1](http://arxiv.org/abs/2510.25877v1)\n\n There is a vast literature on Dark Matter (DM) with many reviews of specific topics only a small fraction of which will be mentioned. I start with a very brief review of cosmology which underlies much of DM research and some relevant General Relativity (GR). I next discuss Self Interacting Dark Matter (SIDM) models and upper bounds on the mass M(X) of point-like, symmetric DM. This is followed up by some general aspects of DM detection and directional and temporal variations. I discuss DM models tied with BSM physics scenarios including Primordial Black Holes, new physics in the neutrino sector, ultra-light DM and axions.\n\n", "2510.25841": "2025-10-29, **Electroweak form factors of large nuclei as BPS skyrmions**, Alberte Xosé López Freire et.al., [2510.25841v1](http://arxiv.org/abs/2510.25841v1)\n\n We employ the Bogomolnyi-Prasad-Sommerfield (BPS) Skyrme model within the framework of semi-classical quantization to compute both electromagnetic and neutral current form factors for heavy nuclei. Our results show excellent agreement with the experimental data for low- to moderate momentum transfer. Further, we present an analytic expression of the neutral current form factor for generic nuclei, expressed as a power series in the momentum transfer. Our method provides an alternative to existing phenomenological approaches, and is particularly relevant for precision neutrino experiments where control over model-dependent systematics is essential for probing physics beyond the Standard Model.\n\n", "2510.25635": "2025-10-29, **Extra dip in ultrahigh energy neutrino spectrum from generalized uncertainty principle**, J. Barranco et.al., [2510.25635v1](http://arxiv.org/abs/2510.25635v1)\n\n We revisited the scenario of a resonant enhancement in the oscillation probability due to an interaction potential between neutrinos and dark matter with the novelty of the inclusion of the generalized uncertainty principle. It is shown that a new resonant conversion appears at higher energies. This effect could be tested with future neutrino data as new dips in the ultrahigh energy neutrino flux.\n\n", "2510.25523": "2025-10-29, **Analytical approaches for rapid prediction of gravitational waveforms for relativistic binary systems**, Aleksandra V. Mishakina et.al., [2510.25523v1](http://arxiv.org/abs/2510.25523v1)\n\n We present a fast method for obtaining fully analytical approximations for gravitational waveforms produced by merging of neutron stars and/or black holes for the earliest stages of the merger process. The obtained analytical formula is compared with numerical calculations, its accuracy and limits of applicability are evaluated. Our results may be useful not only for the earliest evalution of properties of the nature of binary system in gravitational-wave detectors but also will give early alerts for gamma-ray, optical and neutrino observatories.\n\n", "2510.25486": "2025-10-29, **NLO event generation for LHC neutrinos and application to flux measurements at FASER**, Peter Krack et.al., [2510.25486v1](http://arxiv.org/abs/2510.25486v1)\n\n The LHC generates an intense beam of high-energy neutrinos in the forward direction, whose scientific potential has been left unexploited for many years. The FASER and SND@LHC experiments, operating since 2023, have recently measured LHC neutrinos for the first time. In this contribution we discuss how to produce accurate predictions, including NLO QCD corrections and modern parton shower algorithms, for present and future LHC neutrino experiments, including those at the proposed Forward Physics Facility (FPF). To this end, the energy and rapidity distribution of the LHC neutrinos is encoded in a LHAPDF grid interfaced to the neutrino DIS event generator in the POWHEG-BOX-RES framework. This Monte Carlo tool enables the modelling of differential distributions that are sensitive to hadronic final states, initial- and final-state radiation, and realistic acceptance and selection cuts. As a first application, we deploy this event generator to compute fast-interpolation grids and carry out a first determination of the LHC forward neutrino fluxes directly from FASER data using the NNPDF fitting methodology.\n\n", "2510.25274": "2025-10-29, **A Dual-Resolution Prescription in the $S_N$ Method for Boltzmann Neutrino Transport I: Proof of Principle and the Resolution of Collision Term**, Akira Ito et.al., [2510.25274v1](http://arxiv.org/abs/2510.25274v1)\n\n We propose a dual-resolution prescription meant for the Boltzmann neutrino transport, in which the advection and collision terms are calculated with different angular resolutions in momentum space. The purpose is to address the issue of the low resolution that afflicts the $S\\_N$ method in the multi-dimensional neutrino transport simulations for core-collapse supernovae. We handle with a high resolution the advection term alone, assuming that the collision term does not require such high resolutions. To confirm this surmise as well as our new conversion scheme, from low- to high-angular resolutions and vice versa, we run a couple of experimental one-zone (in space) simulations. Neutrino scatterings on nucleons are considered with small recoils fully taken into account whereas the advection term is replaced by the angle- and energy-dependent source terms that are designed to mimic the results of a Boltzmann simulation, inducing the anisotropy in momentum space. For the conversion from a low-resolution distribution function to a high-resolution one, we employ a polynomial interpolations in the zenith and azimuth directions separately with the number conservation and continuity (and periodicity only in the azimuth direction). We find that this dual-resolution scheme works well and that the current angular resolution employed in the canonical supernova simulations with our Boltzmann solver or a bit better in the $\\phi\\_\\nu$ direction will be sufficient for the collision terms if they are coupled with the advection terms calculated with a high-angular resolution via this prescription.\n\n", "2510.25272": "2025-10-29, **Characterization of the Li$_2$WO$_4$ crystal as a cryogenic scintillating calorimeter**, D. L. Helis et.al., [2510.25272v1](http://arxiv.org/abs/2510.25272v1)\n\n A wide range of scintillating bolometers is under investigation for applications in the search for rare events and processes beyond the Standard Model. In this work, we report the first measurement of a natural, non-molybdenum-doped, lithium tungstate (LWO) crystal operated underground as a scintillating cryogenic calorimeter. The detector achieved a baseline energy resolution of 0.5 keV RMS with a low-energy threshold of about 1.5 keV. The simultaneous readout of heat and light enabled particle identification, revealing a clear separation between $\\beta/\\gamma$, $\\alpha$, and nuclear recoil populations above 300 keV, with a light-yield-based particle discrimination better than $6\\sigma$. These results, fully comparable with those achieved with other compounds in the field, demonstrate that LWO is a promising candidate for rare-event searches. In particular, the combination of excellent radio-purity (with U/Th levels below 0.5 mBq/kg) and sensitivity to neutron interactions via the $^6$Li(n,$\\alpha$)$^3$H reaction makes this material an attractive option for next-generation experiments on dark matter, coherent elastic neutrino-nucleus scattering, and spin-dependent interactions.\n\n", "2510.25190": "2025-10-29, **Prospects for a fourth generation of leptons in a 13 TeV p-p collider**, Ramkrishna Joshi et.al., [2510.25190v1](http://arxiv.org/abs/2510.25190v1)\n\n In the Standard Model, three discovered generations of leptons and quarks are known to date. However, speculations about existence of next generations have a strong foothold. In this study, we sequentially extrapolate the Standard Model to include a fourth generation of leptons (l4, nu4) with a massive Dirac neutrino. We perform MC simulated event generation of pp -> l4 l4(bar) scattering processes at an LHC-like p-p collider with sqrt(s) = 13 TeV by considering l4 mass of 190 GeV and nu4 mass of 100 GeV with PYTHIA. We demonstrate mass constraints of sequential leptons from oblique parameters and study important jet and lepton kinematics in our simulation with CMS like constraints. Fourth generation neutrino is stable in this scenario making l4 -> W nu4 the only dominant channel in collider searches. With the cut-flow, we achieve global excess of (1.46 +/- 0.068(stat.)) sigma and local excess of (3.33 +/- 0.241(stat.)) sigma in the 180-300 GeV signal window. Missing Transverse Energy (MET) provides clean signature of nu4. We assess discovery potential of the BSM lepton against lepton mass, center-of-mass energy (Ecom) and luminosities. Higher luminosities and Ecom are promising to probe BSM moderate mass lepton scenarios at present and future colliders.\n\n"}, "dark matter": {"2510.26791": "2025-10-30, **Boosting the cosmic 21-cm signal with exotic Lyman-$α$ from dark matter**, Dominic Agius et.al., [2510.26791v1](http://arxiv.org/abs/2510.26791v1)\n\n The 21-cm signal from the epoch of cosmic dawn ($z \\sim 10-30$) offers a powerful probe of new physics. One standard mechanism for constraining decaying dark matter from 21-cm observations relies on heating of the intergalactic medium by the decay products, an effect whose observability is entangled with the uncertain Lyman-$\\alpha$ fluxes and X-ray heating from the first stars. In this Letter, we explore a novel mechanism, where the Lyman-$\\alpha$ photons produced from dark matter decay initiate early Wouthuysen-Field coupling of the spin temperature to the gas temperature, thereby boosting the 21-cm signal. This mechanism provides constraints on dark matter that are less dependent on uncertainties associated with star formation than constraints on exotic heating. We study this effect for decaying dark matter with masses $m\\_{\\chi}\\sim20.4-27.2$ eV, where diphoton decay efficiently produces Lyman-series photons. We present forecasts for the Hydrogen Epoch of Reionization Array and the Square Kilometre Array, showing their potential to probe an unconstrained parameter space for light decaying DM, including axion-like particles.\n\n", "2510.26765": "2025-10-30, **Vector dark matter with non-abelian kinetic mixing**, Ana Luisa Foguel et.al., [2510.26765v1](http://arxiv.org/abs/2510.26765v1)\n\n An appealing framework for dark matter is provided by light hidden sectors, below the electroweak scale, feebly coupled to the Standard Model via light mediators. We consider a minimal, predictive model where both the dark matter and the mediator are vector bosons, and have the same mass. The portal between the dark sector and the Standard Model is provided by a kinetic mixing between the dark gauge symmetry, $SU(2)\\_X$, and the hypercharge, $U(1)\\_Y$, induced by a dimension-six operator. The dark-matter candidates, $X^\\pm$, are charged under a custodial symmetry and therefore stable, while the mediator is a massive dark photon, $Z\\_D$, mixing with the photon and the $Z$. We show how the observed dark-matter abundance can be reproduced via freeze-out or freeze-in, through either the kinetic mixing or the dark gauge interaction. We also analyse dark 3-to-2 annihilations, that can become dominant in model variations with $Z\\_D$ heavier than $X^\\pm$. We confront our relic-density predictions with current and projected experimental, astrophysical and cosmological bounds on the model parameter space, highlighting the correlation between the dark-photon and dark-matter phenomenologies.\n\n", "2510.26754": "2025-10-30, **Quantum Enhanced Dark-Matter Search with Entangled Fock States in High-Quality Cavities**, Benjamin Freiman et.al., [2510.26754v1](http://arxiv.org/abs/2510.26754v1)\n\n We present a quantum-enhanced protocol for detecting wave-like dark matter using an array of $N$ entangled superconducting cavities initialized in an $m$-photon Fock state. By distributing and recollecting the quantum state with an entanglement-distribution operation, the scan rate scales as $N^2(m+1)$ while thermal excitation is the dominant background, significantly outperforming classical single-cavity methods under matched conditions. We evaluate the robustness of our scheme against additional noise sources, including decoherence and beamsplitter infidelity, through theoretical analysis and numerical simulations. In practice, the key requirements, namely high-Q superconducting radio-frequency cavities that support long integration times, high-fidelity microwave beamsplitters, and universal cavity control, are already available on current experimental platforms, making the protocol experimentally feasible.\n\n", "2510.26739": "2025-10-30, **Wavefront Curvature and Transverse Atomic Motion in Time-Resolved Atom Interferometry: Impact and Mitigation**, Noam Mouelle et.al., [2510.26739v1](http://arxiv.org/abs/2510.26739v1)\n\n Time-resolved atom interferometry, as employed in applications such as gravitational wave detection and searches for ultra-light dark matter, requires precise control over systematic effects. In this work, we investigate phase noise arising from shot-to-shot fluctuations in the atoms' transverse motion in the presence of the wavefront curvature of the interferometer beam, and analyse its dependence on the laser-beam geometry in long-baseline, large-momentum-transfer atom interferometers. We use a semi-classical framework to derive analytical expressions for the effective phase perturbation in position-averaged measurements and validate them using Monte Carlo simulations. Applied to 100-m and 1-km atom gradiometers representative of next-generation experiments, the model shows that configurations maximizing pulse efficiency also amplify curvature-induced phase noise, requiring micron-level control of the atom cloud's centre-of-mass position and sub-micron-per-second control of its centre-of-mass velocity to achieve sub-$10^{-5}$ rad phase stability. Alternative beam geometries can suppress this noise by up to two orders of magnitude, but at the cost of reduced pulse efficiency. To address this limitation, we propose a mitigation strategy based on position-resolved phase-shift readout, which empirically learns and corrects the wavefront-induced bias from measurable quantities such as the phase-shift gradient and final cloud position. This approach restores high-sensitivity operation in the maximum-pulse-efficiency configuration without detailed beam characterisation, providing a practical route towards next-generation, time-resolved atom interferometers operating at the $10^{-5}$ rad noise level.\n\n", "2510.26649": "2025-10-30, **A New Probe for Long-Lived Particles at Higgs Factories: Displaced Photons in the Hadronic Calorimeter**, Zhicheng Jiang et.al., [2510.26649v1](http://arxiv.org/abs/2510.26649v1)\n\n The search for dark matter and other photon-portal long-lived particles (LLPs) at electron-positron colliders often relies on the mono-photon signature. At future Higgs factories operating at the $Z$-pole, this approach faces a critical challenge: the irreducible background from $e^+e^- \\to \\nu\\bar{\\nu}\\gamma$ becomes overwhelming. We propose a novel strategy that overcomes this limitation by searching for displaced photons from LLP decays within the barrel of the hadronic calorimeter. This signature exploits the architectural shielding of the detector to create a nearly background-free environment. Our analysis demonstrates exceptional sensitivity to LLPs with decay lengths from $\\sim$1 to $10^6$ meters, improving upon conventional searches by up to one order of magnitude for benchmark photon-portal models.\n\n", "2510.26593": "2025-10-30, **Hybrid Physical-Neural Simulator for Fast Cosmological Hydrodynamics**, Arne Thomsen et.al., [2510.26593v1](http://arxiv.org/abs/2510.26593v1)\n\n Cosmological field-level inference requires differentiable forward models that solve the challenging dynamics of gas and dark matter under hydrodynamics and gravity. We propose a hybrid approach where gravitational forces are computed using a differentiable particle-mesh solver, while the hydrodynamics are parametrized by a neural network that maps local quantities to an effective pressure field. We demonstrate that our method improves upon alternative approaches, such as an Enthalpy Gradient Descent baseline, both at the field and summary-statistic level. The approach is furthermore highly data efficient, with a single reference simulation of cosmological structure formation being sufficient to constrain the neural pressure model. This opens the door for future applications where the model is fit directly to observational data, rather than a training set of simulations.\n\n", "2510.26545": "2025-10-30, **A test of invariance of halo surface density for FIRE-2 simulations with cold dark matter and self-interacting dark matter**, Sujit K. Dalui et.al., [2510.26545v1](http://arxiv.org/abs/2510.26545v1)\n\n Numerous observations have shown that the dark matter halo surface density, defined as the product of core radius and halo central density of cored dark matter haloes is nearly constant and independent of galaxy mass over a whole slew of galaxy types. Here we calculate the surface density in cold dark matter(CDM) and self-interacting dark matter (SIDM) models including baryons, as well as SIDM without baryons, for dwarf galaxies of masses $\\approx 10^{10} M\\_{\\odot}$ using mock catalogs obtained from simulations as part of the Feedback In Realistic Environments project. We find that the dark matter surface density and column density are nearly constant for CDM and SIDM for this mass range. The halo surface density obtained from the Burkert profile fit is consistent with galactic-scale observations within $1\\sigma$. We also computed the empirical scaling relations between the central surface density and maximum velocity using the best-fit dark matter profiles, and found that they agree with observations of Milky Way and M31 dwarfs.\n\n", "2510.26318": "2025-10-30, **Weak-Lensing Detection of Intercluster Filaments in Three Nearby Cluster Systems**, Rahul Shinde et.al., [2510.26318v1](http://arxiv.org/abs/2510.26318v1)\n\n Direct detection of intercluster filaments is challenging due to their low surface density, resulting in a weak deflection field. We present weak-lensing detections of intercluster filaments using wide-field Dark Energy Camera (DECam) observations from the Local Volume Complete Cluster Survey (LoVoCCS). A matched-filter method was applied to identify filamentary structures in three nearby ($z < 0.1$) systems centered on Abell 401, Abell 2029, and Abell 3558. We discover two prominent filaments ($\\geq 4\\sigma$) in each system, with the strongest detections ($6.4\\sigma - 7.3\\sigma$) around Abell 401 and Abell 2029. In particular, we report the first robust weak-lensing detections $(>5 \\sigma)$ of the intercluster bridges connecting the cluster pairs Abell 401/399, Abell 2029/2033, Abell 2029/SIG, and Abell 3558/3556. Adopting a filament convergence model motivated by numerical simulations, we infer the maximum convergence ($\\kappa\\_0$) and characteristic width ($h\\_{\\mathrm{c}}$) for all six filaments, yielding $\\kappa\\_0 \\sim 0.015 - 0.053$ and $h\\_{\\mathrm{c}} \\sim 0.11 - 0.45 \\ \\mathrm{Mpc}$. The performance of the matched-filter technique is validated using mock shear catalogs and further tested on a null field around Abell 2351. We also explore the potential of using the B-mode lensing signal of filaments to suppress cluster-induced shear contamination. These results demonstrate the feasibility of directly mapping dark matter filaments with current and future wide-field weak-lensing datasets.\n\n", "2510.26258": "2025-10-30, **Searching for the X17 with the PADME experiment**, V. Kozhuharov et.al., [2510.26258v1](http://arxiv.org/abs/2510.26258v1)\n\n The PADME experiment was originally designed to test dark matter theories predicting the existence of a ''Dark Sector'' composed of particles that interact with Standard Model ones exclusively through the exchange of a new, massive mediator. The confirmation of the X17 anomaly, observed in nuclear decays at the ATOMKI in Debrecen, sparked considerable interest in the particle physics community. If the anomaly arises from the decay of a new state into an e+e- pair,the time-reversal symmetry implies that it must be also producible through e+e- annihilation. The PADME experiment can rely on the world's only e+ beam with the appropriate energy for a resonant production of X17. The collaboration dedicated 2022 data taking to investigate the X17 anomaly via e+e- -> X17 -> e+e- reaction, aiming to probe the particle hypothesis. An overview of the scientific program of the experiment and the present status of the search for X17 at PADME are presented.\n\n", "2510.26239": "2025-10-30, **A Triple-GEM Time Projection Chamber for Wide Field-of-View Hard X-ray Polarimetry: First Results**, Davide Fiorina et.al., [2510.26239v1](http://arxiv.org/abs/2510.26239v1)\n\n We report on the development of a large-volume, wide field-of-view time projection chamber (TPC) for X-ray polarimetry, featuring a triple-GEM amplification stage and optical readout. Originally developed within the CYGNO program for directional dark matter searches, the system employs a scientific CMOS (sCMOS) camera and a photomultiplier tube (PMT) to collect secondary scintillation light produced during charge amplification. A prototype with a cylindrical active volume (radius 3.7 cm, height 5 cm) was tested at the INAF--IAPS calibration facility (Rome, Tor Vergata) to assess sensitivity to low-energy electron directionality. We fully reconstruct electrons in the 10-60 keV range, obtain angular resolutions as good as 15{\\deg}, and infer modulation factors up to 0.9. These first results demonstrate robust photoelectron tracking at tens of keV with strong modulation, indicating that photoelectric-effect polarimetry can be extended to higher energies. This capability is promising for rapid transients (GRBs, solar flares) and would broaden the astrophysical reach of X-ray polarimetry.\n\n", "2510.25969": "2025-10-29, **Long-lived quasinormal modes, grey-body factors and absorption cross-section of the black hole immersed in the Hernquist galactic halo**, B. C. Lütfüoğlu et.al., [2510.25969v1](http://arxiv.org/abs/2510.25969v1)\n\n We analyze quasinormal modes, grey-body factors, and absorption cross-sections of a massive scalar field in the background of a Schwarzschild black hole surrounded by a Hernquist dark-matter halo. The quasinormal spectrum is obtained through the higher-order WKB method and verified by time-domain evolution, showing consistent results. The field mass increases the oscillation frequency and reduces the damping rate, producing longer-lived modes, while variations in the halo parameters lead to moderate shifts in the spectrum. The grey-body factors reveal a suppression of low-frequency transmission and a displacement of their main features toward higher frequencies, resulting in a corresponding shift in the absorption cross-section.\n\n", "2510.25895": "2025-10-29, **Beyond general relativity: gravitational waves in non-minimally coupled theories**, Stephon Alexander et.al., [2510.25895v1](http://arxiv.org/abs/2510.25895v1)\n\n Non-minimal couplings between matter and curvature tensors arise in many different contexts. Such couplings modify solutions of general relativity (GR) and therefore can be probed in various astrophysical systems. A particularly interesting scenario arises if dark matter experiences non-minimal couplings, as dark matter densities are expected to spike in the vicinity of binary black hole mergers. This gives a novel setting for simultaneously studying dark matter and (beyond) GR physics via observations of gravitational waves (GWs). In this work, we explore effects of various non-minimal couplings on GWs by working with a model-independent parameterization for left- and right-handed GW strains. We extend the parameterization proposed in \\cite{Jenks:2023pmk,Daniel:2024lev} to include early-universe effects, and we write down the generic solution assuming slowly-varying matter fields. We then systematically apply our results to three models: Kalb-Ramond dark matter with dimension-four operators, axion-dilaton-Chern-Simons-Gauss-Bonnet dimension-five operators, and dimension-six couplings to a (dark) vector field.\n\n", "2510.25870": "2025-10-29, **Optimal Displacement Sensing with Spin-Dependent Squeezed States**, Liam J. Bond et.al., [2510.25870v1](http://arxiv.org/abs/2510.25870v1)\n\n Displacement sensing is a fundamental task in metrology. However, the development of quantum-enhanced sensors that fully utilize the available degrees of freedom in many-body quantum systems remains an outstanding challenge. We propose novel many-body displacement sensing schemes that use spin-dependent squeezed (SDS) states -- hybrid spin-boson states whose bosonic squeezed quadrature is conditioned on an auxiliary spin. We prove that SDS states are \\emph{optimal}, i.e. their quantum Cram\\'{e}r-Rao bound saturates the Heisenberg limit. We propose explicit measurement sequences that can be readily implemented in systems such as trapped ions. We also introduce a scalable state-preparation protocol and numerically demonstrate the preparation of $8.7$~dB of spin-dependent squeezing $15$ times faster than the standard approach using second-order sidebands in trapped ions. The potential applications of our sensing protocols range from measuring single-photon scattering to searches for dark matter.\n\n", "2510.25835": "2025-10-29, **Determining (All) Dark Matter-Electron Scattering Rates From Material Properties**, Yonit Hochberg et.al., [2510.25835v1](http://arxiv.org/abs/2510.25835v1)\n\n We show that the scattering rate for any dark matter (DM) interaction with electrons in any target is proportional to several measurable material properties, encapsulated by a single master formula. This generalizes the dielectric function formalism--developed for DM interactions that couple to electron density--to any interaction, incorporating both spin-dependent and spin-independent interactions simultaneously. This formalism links the full many-body response of a target system to the DM probe in a clear and simple form, providing a reliable event rate prediction from measurable material quantities. We demonstrate the utility of our formalism by placing new limits from existing data on a class of spin-dependent light DM interactions, as their rates--contrary to common lore--are determined entirely by the dielectric function. We further highlight a promising avenue for the detection of sub-MeV DM using the rare earth metal Praseodymium, which exhibits a spin-dependent anisotropic response down to the meV scale. Our results lay the groundwork for a rapid systematic investigation of novel electron scattering targets going beyond the classic spin-independent searches, enhancing the prospects for DM detection.\n\n", "2510.25834": "2025-10-29, **Electric Accumulation of Millicharged Particles**, Asher Berlin et.al., [2510.25834v1](http://arxiv.org/abs/2510.25834v1)\n\n A terrestrial population of millicharged particles that interact significantly with normal matter can arise if they make up a dark matter subcomponent or if they are light enough to be produced in cosmic ray air showers. Such particles thermalize to terrestrial temperatures through repeated scatters with normal matter in Earth's environment. We show that a simple electrified shell (e.g., a Van de Graaff generator) functions as an efficient accumulator of such room-temperature millicharged particles, parametrically enhancing their local density by as much as twelve orders of magnitude. This can be used to boost the sensitivity of any detector housed in the shell's interior, such as ion traps and tests of Coulomb's law. In a companion paper, we apply this specifically to Cavendish tests of Coulomb's law, and show that a well-established setup can probe a large region of unexplored parameter space, with sensitivity to the irreducible density of millicharged particles generated from cosmic rays that outperforms future accelerator searches for sub-GeV masses.\n\n", "2510.25825": "2025-10-29, **Cavendish Tests of Millicharged Particles**, Asher Berlin et.al., [2510.25825v1](http://arxiv.org/abs/2510.25825v1)\n\n A terrestrial population of room-temperature millicharged particles can arise if they make up a dark matter subcomponent or if they are light enough to be produced in cosmic ray air showers. In a companion paper, we showed that a simple electrified shell acts as an efficient accumulator for such particles, parametrically enhancing their local density by many orders of magnitude. Here we demonstrate that Cavendish tests of Coulomb's Law, performed since the late 18th century, function as both quasistatic accumulators and detectors for this overdensity. Reinterpretations of these past Cavendish tests thus provide some of the strongest bounds on a terrestrial millicharge population. We also propose surrounding a Cavendish test with an additional charged shell, which significantly improves the sensitivity and can even enable detection of the irreducible density of millicharged particles generated from cosmic rays. Using decades-old technology, this can outperform future accelerator searches for sub-GeV masses.\n\n", "2510.25217": "2025-10-29, **Anomaly footprints in SM+Gravity**, Loriano Bonora et.al., [2510.25217v1](http://arxiv.org/abs/2510.25217v1)\n\n This is a follow-up of arXiv:2412.07470 [hep-th]. A simplified version of the SM plus gravity, put forward there, is presented here and some of its aspects delved into. The basic structure consists of two sectors, left and right, with chirally mirror fermions and scalars, as well as $SU(3)$ and $U(1)$ gauge fields, while the $SU(2)$ gauge fields as well as the metric are in common to both sectors. This structure is dictated by the request to cancel all dangerous anomalies. The left sector consists of the fermion, gauge and scalar fields of the SM, now minimally coupled to gravity. The right sector is a mirror image of the left, with distinct fields, except the metric and the $SU(2)$ gauge potentials. The first new aspect is the proposed and motivated interpretation of the right sector as the dark matter one. The second new subject covered here is Weyl symmetry and its possible application to cosmology and its theoretical fallout on unitarity and renormalization of the model. A background solution of the Weyl invariant theory is derived, which may apply to the very early stages of the universe. This solution also suggests interesting applications to the cosmological constant problem. On the quantum field theory side the subject of Weyl symmetry and Weyl anomalies is reviewed and, among other things, an application of the WZ terms is illustrated to the problem of one-loop quantization of the model which may avoid negative norm states.\n\n", "2510.25203": "2025-10-29, **Low-Gap Hf-HfOx-Hf Josephson Junctions for meV-Scale Particle Detection**, Y. Balaji et.al., [2510.25203v2](http://arxiv.org/abs/2510.25203v2)\n\n Superconducting qubits have motivated the exploration of Josephson-junction technologies beyond quantum computing, with emerging applications in low-energy photon and phonon detection for astrophysics and dark matter searches. Achieving sensitivity at the THz (meV) scale requires materials with smaller superconducting gaps than those of conventional aluminum or niobium-based devices. Here, we report the fabrication and characterization of hafnium (Hf)-based Josephson junctions (Hf-HfOx-Hf), demonstrating Hf as a promising low-Tc material platform for ultra-low threshold single THz photon and single-phonon detection. Structural and chemical analyses reveal crystalline films and well-defined oxide barriers, while electrical transport measurements at both room and cryogenic temperatures exhibit clear Josephson behavior, enabling extraction of key junction parameters such as critical current, superconducting gap and normal-state resistance. This work presents the first comprehensive study of Hf-based junctions and their potential for next-generation superconducting detectors and qubit architectures leveraging low superconducting gap energies.\n\n", "2510.25197": "2025-10-29, **Impact of shell model interactions on WIMP-nucleus scattering observables for silicon and germanium targets**, Raghda Abdel Khaleq et.al., [2510.25197v1](http://arxiv.org/abs/2510.25197v1)\n\n The nature of dark matter (DM) remains one of the biggest mysteries in physics today. Dark matter direct detection experiments look for nuclear recoil signals from DM-nucleus elastic scattering, which can be used to characterise DM. Nuclear modelling of the target nucleus may impact the predicted DM-nucleus scattering rates, and affect interpretation of experimental signals. In this work, we investigate the impact of nuclear shell model interactions on DM nuclear responses for silicon and germanium targets using a SuperCDMS-like experimental parameters. Nuclear uncertainties resulting from shell model interaction choice in the nuclear form factors are roughly retained at the scattering rate and exclusion limit levels for certain nuclear responses.\n\n"}, "supernova": {"2510.26731": "2025-10-30, **The Weighing Halos Accurately, Locally, and Efficiently with Supernovae (WHALES) Survey Overview and Initial Data Release**, Maria Acevedo et.al., [2510.26731v1](http://arxiv.org/abs/2510.26731v1)\n\n We present an overview of the Weighing Halos Accurately, Locally, and Efficiently with Supernovae (WHALES) survey, the first to discover and measure Type Ia supernovae (SNe Ia) in and around galaxy superclusters. By building a sample of SNe~Ia around these massive environments, we aim to provide new constraints on bulk-flow models while laying the groundwork for improved estimates of supercluster masses. Here, we present data from the first two seasons targeting the Shapley Supercluster (0.02<z<0.06), which is responsible for a large but unknown fraction of our local group's motion. Until now, no supernovae had been analyzed in the direction of Shapley. Through the WHALES survey, we have identified 12 likely SNe Ia in this region using SkyMapper, including 8 with spectroscopic confirmation. We present the first light curves of these SNe and combine our observations with data from ATLAS. We demonstrate that the low number of discovered SNe Ia per season is consistent with various rate calculations, highlighting the need for future surveys to monitor superclusters over a multi-year timespan. Finally, we present simulations of SN Ia observations in the environments of massive galaxy clusters, demonstrating how the inferred peculiar velocities can constrain cluster masses, and highlighting the added complexity within superclusters. We find that a sample of 100 SNe Ia would enable a 25% precision measurement of the total mass of the Shapley Supercluster.\n\n", "2510.26625": "2025-10-30, **The chemical DNA of the Magellanic Clouds IV. Unveiling extreme element production: the Eu abundance in the Small Magellanic Cloud**, Samuele Anoardo et.al., [2510.26625v1](http://arxiv.org/abs/2510.26625v1)\n\n In this study we investigate the chemical enrichment of the rapid neutron-capture process in the Small Magellanic Cloud (SMC). We measure [Eu/Fe] abundance ratios in 209 giant stars that are confirmed members of the SMC, providing the first extensive dataset of Eu abundances in this galaxy across its full metallicity range, spanning more than 1.5 dex. We compare Eu abundances with those of Mg and Ba to evaluate the efficiency of the r-process relative to $\\alpha$-capture and s-process nucleosynthesis. The SMC shows enhanced [Eu/Fe] values at all metallicities (comparable with the values measured in the Milky Way), with a clear decline as [Fe/H] increases (from $\\sim$ -1.75 dex to $\\sim$ -0.5 dex), consistent with the onset of Type Ia supernovae. In contrast, [Eu/Mg] is enhanced by about +0.5 dex at all [Fe/H], significantly above the values observed in Milky Way stars, where [Eu/Mg] remains close to solar, reflecting comparable production of r-process and $\\alpha$-capture elements. Moreover, [Ba/Eu] increases with metallicity, beginning at [Fe/H] $\\approx$ -1.5 dex, namely at a lower metallicity with respect to the Milky Way, where [Ba/Eu] starts to increase around [Fe/H] $\\approx$ -1 dex. Our findings suggest the SMC has a higher production of Eu (with respect to the $\\alpha$-elements) than the Milky Way but in line with what observed in other dwarf systems within the Local Group. We confirm that galaxies with star formation efficiencies lower than the Milky Way have high [Eu/$\\alpha$], probably indicating a stronger efficiency of the delayed sources of r-process at low metallicities.\n\n", "2510.26570": "2025-10-30, **The magnetic fields of the dusty nuclei and molecular outflows of Arp 220**, Enrique Lopez-Rodriguez et.al., [2510.26570v1](http://arxiv.org/abs/2510.26570v1)\n\n Galaxy mergers trigger starburst activity and galactic outflows that enrich the circumgalactic medium, profoundly impacting galaxy evolution. These phenomena are intrinsically linked to the physical conditions of the medium, which is permeated by magnetic (B) fields affecting its transport and dynamics. Here, we spatially resolve, $0.24$\" (96 pc), the B-fields in the dusty and molecular outflows of Arp 220, the closest ($78$ Mpc) Ultra-Luminous Infrared Galaxy hosting two interacting nuclei, denoted as East and West. We perform ALMA $870~\\mu$m dust continuum polarization and CO(3-2) emission line polarization, and report the first detection of CO(3-2) emission line polarization through the Goldreich-Kylafis effect in an outflow. Dust polarization shows that Arp 220 E has a spiral-like B-field on the disk with a linear polarization fraction of $0.4\\pm0.1$% that may produce the detected circular polarization passing through foreground aligned dust grains. Arp 220 W reveals a B-field parallel to the red- and blueshifted outflows in both the dust and emission line polarization maps. The outflows show a dust polarization of $0.2$%, while the CO(3-2) emission line polarization is $1-2$% at $4-6\\sigma$ significance across independent velocity channels. A highly polarized ($3-5$%) dusty bridge has a B-field orientation of $\\sim110^{\\circ}$ connecting both nuclei. Mean B-field strengths of $1.6$ mG and $8$ mG for the blue- and redshifted outflows, respectively, are estimated. These strong B-fields are attributed to amplification by compression in nuclear clouds and supernova remnants. This amplified B-field is likely sustained by the turbulent kinetic energy in the outflow and may be critical in directing the transport of metals and cosmic rays into the circumgalactic medium.\n\n", "2510.26513": "2025-10-30, **CROCODILE-DWARF: Assembly and Kinematics of Field Dwarf Galaxies with GADGET4-OSAKA**, Kazuki Tomaru et.al., [2510.26513v1](http://arxiv.org/abs/2510.26513v1)\n\n We present results from CROCODILE-DWARF, a suite of cosmological zoom-in hydrodynamic simulations of isolated field dwarf galaxies with halo masses of $\\sim10^{10}\\,M\\_\\odot$ at $z=0$, performed with the \\textsc{gadget4-osaka} code. The simulations include detailed modeling of star formation, chemical enrichment, and supernova feedback using the \\textsc{CELib} and \\textsc{grackle} libraries, achieving baryonic resolutions of $\\sim2\\times10^3\\,M\\_\\odot$. Our study focuses on how assembly history governs the structural and kinematic diversity of dwarf galaxies within the $\\Lambda$CDM framework. The simulated galaxies reproduce the observed stellar-to-halo mass, mass--metallicity, and size--mass relations, yielding stellar masses of $10^6-10^8\\,M\\_\\odot$ and metallicities consistent with those of Local Group dwarf galaxies. The galaxies display a broad range of rotational support, where gas is generally more rotationally supported than stars. Differences in morphology and kinematics primarily reflect variations in halo assembly timescales and merger activity. Early-assembling, high-concentration halos form stars efficiently and become gas-poor by $z=0$, while late-assembling, low-concentration halos remain gas-rich due to delayed star formation and rejuvenated gas accretion. We identify a clear anti-correlation between rotational support and the cumulative merger mass fraction, demonstrating that dynamical heating by mergers is the dominant factor shaping kinematic diversity. In some cases, late-time mergers induce the formation of extended gas disks by delivering fresh gas and angular momentum. These results demonstrate that assembly history, rather than halo mass alone, critically shapes the present-day kinematic and morphological diversity of dwarf galaxies.\n\n", "2510.26355": "2025-10-30, **Model-independent late-universe measurements of $H_0$ and $Ω_\\mathrm{K}$ with the PAge-improved inverse distance ladder**, Guo-Hong Du et.al., [2510.26355v1](http://arxiv.org/abs/2510.26355v1)\n\n The standard $\\Lambda{\\rm CDM}$ model has encountered serious challenges and the $H\\_0$ tension has become more significant with increasingly precise cosmological observation. Meanwhile, inconsistencies in measurements of the curvature parameter $\\Omega\\_\\mathrm{K}$ between different datasets also have emerged. In this work, we employ two global and cosmic age-based parameterizations, PAge and MAPAge, to perform model-independent measurements of the Hubble constant $H\\_0$ and $\\Omega\\_\\mathrm{K}$ by utilizing the inverse distance ladder (IDL). To construct the PAge-improved IDL, we utilize the strong gravitational lensing (SGL), cosmic chronometers (CC), and gamma ray bursts (GRB) data to calibrate the latest DESI DR2 baryon acoustic oscillation data and DESY5 type Ia supernova data. Our analysis indicate that DESI+DESY5+SGL+CC+GRB gives $H\\_0=71.59\\pm 0.94\\,{\\rm km}~{\\rm s}^{-1}~{\\rm Mpc}^{-1}$ in the MAPAge model, reducing the $H\\_0$ tension to the $1.0\\sigma$ level. Extending to MAPAge$+\\Omega\\_{\\rm K}$ model, we obtain $\\Omega\\_\\mathrm{K}=0.001\\pm 0.038$, which suggests that current late-time data are consistent with a flat universe. Finally, the Bayesian analysis indicates that the present late-universe data provide weak to moderate evidence in favor of PAge and MAPAge relative to $\\Lambda{\\rm CDM}$.\n\n", "2510.26152": "2025-10-30, **Direct Numerical Simulations of Oxygen-Flame-Driven Deflagration-to-Detonation Transition in Type Ia Supernovae**, Xiaoyu Zhang et.al., [2510.26152v1](http://arxiv.org/abs/2510.26152v1)\n\n We present direct numerical simulations demonstrating deflagration-to-detonation transition (DDT) driven by oxygen flames in Type Ia supernova progenitors. Using the Castro hydrodynamics code coupled with the ``aprox13'' 13-isotope nuclear network, we simulate combustion in isolated fuel regions where oxygen flames trail carbon flames. In a fiducial one-dimensional run at $\\rho\\_{0}=3.5\\times10^{7}\\ \\mathrm{g\\ cm^{-3}}$ we observe spontaneous DDT of the oxygen flame via the Zel'dovich gradient mechanism when the carbon-oxygen separation reaches $\\sim 10\\ \\mathrm{km}$. The oxygen detonation then captures the carbon flame and triggers a stable carbon detonation. Systematic one-dimensional parameter scans show that successful carbon DDT requires upstream densities in the range $(3.1$--$3.6)\\times10^{7}\\ \\mathrm{g\\ cm^{-3}}$ and a minimum carbon-flame thickness of $\\gtrsim 20\\ \\mathrm{m}$. Two-dimensional simulations confirm DDT and demonstrate that the multidimensional cellular structure of the oxygen detonation can promote carbon detonation at somewhat lower densities than in one dimension. These results provide direct numerical evidence that oxygen-flame-driven DDT is physically plausible in turbulent white-dwarf environments and underscore the importance of multidimensional effects for Type Ia supernova explosion modeling.\n\n", "2510.26112": "2025-10-30, **Evidence of cosmic-ray acceleration up to sub-PeV energies in the supernova remnant IC 443**, Zhen Cao et.al., [2510.26112v1](http://arxiv.org/abs/2510.26112v1)\n\n Supernova remnants (SNRs) have been considered as the primary contributors to cosmic rays (CRs) in our Galaxy. However, the maximum energy of particles that can be accelerated by shocks of SNRs is uncertain observationally and theoretically, and the role of contribution to CRs around PeV energies by SNRs is unclear. In this study, we present observations of high-energy $\\gamma$-ray emission from the SNR IC 443 using the Large High Altitude Air Shower Observatory (LHAASO). The morphological analysis reveals a pointlike source whose location and spectrum are consistent with those of the Fermi-LAT-detected compact source with $\\pi^0$-decay signature, and a more extended source which is consistent with a newly discovered source, previously unrecognized by Fermi-LAT. The spectrum of the point source can be described by a power-law function with an index of $\\sim3.0$, extending beyond $\\sim 30$ TeV without apparent cutoff. Assuming a hadronic origin of the $\\gamma$-ray emission, the $95\\%$ lower limit of accelerated protons reaches about 300 TeV. The extended source might be coincident with IC 443, SNR G189.6+3.3 or the putative pulsar wind nebula CXOU J061705.3+222127, and can be explained by either a hadronic or leptonic model. The LHAASO results provide compelling evidence that CR protons up to sub-PeV energies can be accelerated by the SNR.\n\n", "2510.25950": "2025-10-29, **Lyman-$α$ radiation pressure regulates star formation efficiency**, D. Manzoni et.al., [2510.25950v1](http://arxiv.org/abs/2510.25950v1)\n\n Order-unity star formation efficiencies (SFE) in early galaxies may explain the overabundance of bright galaxies observed by JWST at high redshift. Here we show that Lyman-$\\alpha$ (Ly$\\alpha$) radiation pressure limits the gas mass converted into stars, particularly in primordial environments. We develop a shell model including Ly$\\alpha$ feedback, and validate it with one-dimensional hydrodynamical simulations. To account for Ly$\\alpha$ resonant scattering, we adopt the most recent force multiplier fits, including the effect of Ly$\\alpha$ photon destruction by dust grains. We find that, independently of their gas surface density $\\Sigma\\_g$, clouds are disrupted on a timescale shorter than a free-fall time, and even before supernova explosions if $\\Sigma\\_g \\gtrsim 10^3\\,M\\_{\\odot}\\ \\rm pc^{-2}$. At $\\log(Z/Z\\_{\\odot}) = -2$, relevant for high-redshift galaxies, the SFE is $0.01 \\lesssim \\hat{\\epsilon}\\_{*} \\lesssim 0.66$ for $10^3 \\lesssim\\Sigma\\_g [M\\_{\\odot}\\ \\rm pc^{-2}] \\lesssim 10^5$. The SFE is even lower for decreasing metallicity. Near-unity SFEs are possible only for extreme surface densities, $\\Sigma\\_{g} \\gtrsim 10^5\\;M\\_{\\odot}\\ \\rm pc^{-2}$, and near-solar metallicities. We conclude that Ly$\\alpha$ radiation pressure severely limits a possible extremely efficient, feedback-free phase of star formation in dense, metal-poor clouds.\n\n", "2510.25909": "2025-10-29, **On the Universality of the Relation Between Magnetic Fields and Star Formation in Galaxies**, Davide Belfiori et.al., [2510.25909v1](http://arxiv.org/abs/2510.25909v1)\n\n The interstellar medium (ISM) is permeated by magnetic fields that affect gas dynamics and star formation. These fields correlate with supernova (SN)-driven turbulence, but whether the scaling is universal across galaxy properties, ISM phases, and energy budgets remains unclear. We quantify the dependence of magnetic fields on star formation activity including both regular and starburst galaxies. We analyse 19 spiral disks from the cosmological RTnsCRiMHD Azahar suite, deriving line-of-sight integrated maps to measure median magnetic-field strength ($B$), specific energies (thermal, turbulent, magnetic, and cosmic-ray), and star formation rate (SFR), star formation surface density ($\\Sigma\\_{\\mathrm{SFR}}$) and specific SFR (sSFR). We find an almost universal magnetic-field-SFR scaling with slope $\\alpha \\approx 0.2$-$0.3$ across galaxy mass and ISM phases. The $B$-$\\Sigma\\_{\\mathrm{SFR}}$ slope ($\\alpha \\approx 1/3$) supports an SN-driven, turbulence-regulated origin. Neutral gas is generally turbulence-dominated and in near equipartition with magnetic energy for systems with sSFR $\\gtrsim 0.1$ Gyr$^{-1}$ and SFR $\\gtrsim 1$ $M\\_\\odot$ yr$^{-1}$. The simulated trends match observations with similar slopes ($\\alpha \\approx 0.25$-$0.35$), indicating that SN-driven turbulence is the main amplification mechanism behind the near-universal $B$-SFR relation.\n\n", "2510.25873": "2025-10-29, **25 Years of Groundbreaking Discoveries with Chandra**, Patrick Slane et.al., [2510.25873v1](http://arxiv.org/abs/2510.25873v1)\n\n The Chandra X-ray Observatory is a mainstay of modern observational astrophysics. With the highest angular resolution of any X-ray facility, its imaging and spectral capabilities in the 0.5-10 keV band have led to both unique and complementary breakthroughs in nearly all areas of the field. Now more than a quarter century into its mission, Chandra continues to provide unique information on the contributions of compact objects to the evolution of galaxies, the nature of supernova explosions, the impact of energetic jets from supermassive black holes on their host environments, and the fate of exoplanet atmospheres in systems rich with stellar flares. Here we provide a summary of Chandra results - one that is embarrassingly incomplete, but representative of both the exquisite past and promising future for Chandra's contributions to high energy astrophysics and all of mainstream astronomy.\n\n"}}