{"neutrino": {"2601.19883": "2026-01-27, **A Comprehensive Effective Field Theory Framework for Coherent Elastic Neutrino-Nucleus Scattering**, Gang Li et.al., [2601.19883v1](http://arxiv.org/abs/2601.19883v1)\n\n Coherent elastic neutrino-nucleus scattering (CE$ν$NS) stands out as a pivotal process for precision tests of the Standard Model electroweak sector, investigations of neutrino properties, and searches for new physics (NP). Recent experimental measurements by COHERENT, CONUS+, and ton-scale xenon detectors--including PandaX-4T and XENONnT--underscore the need for a systematic theoretical framework to bridge high-energy physics scenarios with low-energy observational data. In this work, we develop a comprehensive end-to-end effective field theory (EFT) framework for CE$ν$NS, encompassing the complete energy scale hierarchy spanning the ultraviolet (UV) regime down to the nuclear sector. We consider the low-energy EFT (LEFT) operators up to dimension 8, incorporating their QCD renormalization group running effects, and employ the systematic spurion method to achieve the matching between these operators and the chiral Lagrangian. A full power counting analysis is performed, extending to nuclear response functions, which evaluates contributions from LEFT operators up to dimension 8 while accounting for the nucleon number enhancement effect intrinsic to CE$ν$NS. Moreover, we match the relevant LEFT operators for CE$ν$NS onto operators up to dimension 8 within the Standard Model EFT. By also providing their complete tree-level ultraviolet completions, this procedure establishes a consistent top-down theoretical workflow. Leveraging a broad suite of CE$ν$NS experimental data, this framework enables a combined analysis to extract constraints on the scales of EFT operators and neutrino non-standard interaction parameters.\n\n", "2601.19550": "2026-01-27, **Probing Solar Neutrino Deficit via Torsion-Induced Flavor Change in f(T) Gravity**, H. Yazdani Ahmadabadi et.al., [2601.19550v1](http://arxiv.org/abs/2601.19550v1)\n\n We investigate whether the spacetime torsion can modify neutrino flavor oscillations in f(T) gravity. This offers a probe of modified teleparallel gravity in astrophysical environments. By using the Dirac action in teleparallel geometry, we derive an effective coupling between the torsion vector and neutrino current. In the weak-field limit around a spherical mass, we obtain analytical expressions for torsion-induced phase shifts and effective mass-squared differences. Our results indicate that both vacuum oscillations and the Mikheyev-Smirnov-Wolfenstein (MSW) resonance in matter are affected by these torsion-based modifications. Using solar neutrino data from Super-Kamiokande, SNO, Borexino, and KamLAND, we constrain the teleparallel model parameters and also the neutrino-torsion coupling.\n\n", "2601.19454": "2026-01-27, **Radiative Dirac neutrino masses and dark matter in a $U(1)_{B-L}$ extended model**, Chayan Majumdar et.al., [2601.19454v1](http://arxiv.org/abs/2601.19454v1)\n\n We study a $U(1)\\_{B-L}$ extension of the Standard Model (SM) in which Dirac neutrino masses are generated radiatively at the one-loop level through the exchange of new beyond the SM fields. This framework establishes a direct connection between neutrino mass generation and the dark sector, with the stability of the dark matter ensured by a residual discrete $Z\\_6$ symmetry arising from the spontaneous breaking of $U(1)\\_{B-L}$. We investigate the resulting charged lepton flavor violating processes and dark matter phenomenology, saturating relic observations and direct-detection constraints, and analyze the collider signatures of the dark sector at the Large Hadron Collider and at a future muon collider. We have identified excellent prospects for observing the considered dark matter candidates in these colliders, even with lower integrated luminosities than the proposed one.\n\n", "2601.19419": "2026-01-27, **Predictions of effective Majorana neutrino mass under radiative corrections to $μ-τ$ reflection symmetry**, Prokash Pegu et.al., [2601.19419v1](http://arxiv.org/abs/2601.19419v1)\n\n The search for neutrinoless double beta decay ($0νββ$) is currently one of the key objectives in neutrino physics research. The decay rate of $0νββ$ decay depends on the effective Majorana neutrino mass $\\|\\langle m \\rangle\\_{ee}\\|$. In this work we study the numerical prediction of $\\|\\langle m \\rangle\\_{ee}\\|$ in the scenario of deviation from the $μ$-$τ$ reflection symmetry due to radiative corrections, as an extension of our earlier work \\cite{pegu}. In \\cite{pegu}, we consider an exact $μ$-$τ$ reflection symmetry in the light effective Majorana neutrino mass matrix and in the corresponding lepton mixing matrix as well at the seesaw scale. We choose numerical values of all the mixing parameters and neutrino mass eigenvalues at the seesaw scale as inputs and estimate the values of mass eigenvalues and mixing parameters at the electroweak scale due to radiative corrections. We find these low energy predictions consistent with global $3σ$ oscillation data. In the present work, we compute the effective Majorana neutrino mass $\\|\\langle m \\rangle\\_{ee}\\|$ using these low energy values at the electroweak scale. We find that the low energy predictions of $\\|\\langle m \\rangle\\_{ee}\\|$ are consistent with the latest upper bound $\\|\\langle m \\rangle\\_{ee}\\|<(0.028-0.122)\\ eV$ provided by KamLAND-Zen Collaboration.\n\n", "2601.19187": "2026-01-27, **Analysing Toponium at the LHC using Recursive Jigsaw Reconstruction**, Aman Desai et.al., [2601.19187v1](http://arxiv.org/abs/2601.19187v1)\n\n Recent results from the ATLAS and the CMS experiments at the Large Hadron Collider indicate the presence of a top-quark pair bound state near the threshold region. We present a way to reconstruct a toponium state at the $t\\bar{t}$ threshold region formed at the Large Hadron Collider using the Recursive Jigsaw Reconstruction. We have considered the Non-Relativistic QCD based toponium model implemented in MadGraph5\\\\_aMC@NLO. The final states considered consist of two b-jets, two oppositely charged leptons, and missing energy that arises from two neutrinos. The goal of the Recursive Jigsaw Reconstruction is to make use of rules that can help resolve combinatorics ambiguity in preparing the decay tree for a given physics event. Additionally, missing energy coming from two neutrinos needs to be resolved in order to reconstruct the event. We apply four different methods within the RestFrames package and compare the reconstruction results resulting from each of the methods. Due to this method, one can also access kinematic variables in the rest frames belonging to intermediate particle states, providing additional means to discriminate the SM $\\ttbar$ background from the toponium signal. We propose using two angular variables to enhance sensitivity to the toponium signal. Our preliminary results indicate that the improvement in sensitivity can be as much as 16\\% over the current strategy in the LHC's Run 3 configuration. This method may be useful for gaining additional insight into the physics phenomenology in the $\\ttbar$ threshold region.\n\n", "2601.19081": "2026-01-27, **Development of a comprehensive PMT optical model for the JUNO experiment**, Y. Ren et.al., [2601.19081v1](http://arxiv.org/abs/2601.19081v1)\n\n There are 17,612 20-inch photomultiplier tubes (PMTs) installed at the Jiangmen Underground Neutrino Observatory (JUNO). Developing a precise optical model for the PMTs is crucial for enhancing the accuracy of detector simulations and refining the energy response model at JUNO. In this study, we established a comprehensive PMT optical model based on prior studies, taking into account the non-uniformity of photon detection efficiency (PDE) across the PMT surface and the variances in PDE as well as reflections among different PMTs. By collecting reflectance data from 669 PMTs and utilizing PDE data from mass testing systems, we estimated the thickness maps of the photocathode (PC) and the anti-reflective coating (ARC) for each PMT. We also determined the collection efficiency (CE) by decomposing PDE with consideration of the optical processes occurring within the PMTs. The refractive index and extinction coefficient of both the PC and ARC, along with the escape factor, were evaluated over a broad wavelength range of 300~nm to 700~nm, covering the entire spectrum of interest for JUNO. Compared to the prediction from a simplified PMT optical model, which assumes uniform PC and ARC across all PMTs of the same type, the further developed PMT optical model yields much more reflectance for HPK PMTs and less for NNVT PMTs, and the change in PDE is at the level of a few percent. This comprehensive PMT optical model also provides a valuable reference for other PMT-based applications.\n\n", "2601.19015": "2026-01-26, **Part II: Low Energy Galactic Neutrinos**, Eduardo Flores et.al., [2601.19015v1](http://arxiv.org/abs/2601.19015v1)\n\n We study low energy galactic neutrinos in the Milky Way under two fundamentally different descriptions of gravity, showing that neutrinos provide a sensitive probe of gravity underlying nature. If gravity is a quantum interaction, its long range character leads to the formation of an atom like bound neutrino structure. We compute its mass distribution and find that, within a radius 292 kpc, the total mass is only ten to the minus 29 of the galaxy dark matter, ruling it out as a dark matter candidate. Nevertheless, experimental confirmation of this structure would constitute direct evidence for gravity as a quantum force mediated by gravitons. If gravity instead arises from spacetime curvature, neutrinos interact only via the short range weak force and are therefore effectively collisionless. In this regime, neutrinos behave as free classical particles orbiting the galaxy and experience no Fermi pressure. We show that such a population can be sufficiently compact to reproduce the Milky Way rotation curve, making neutrinos viable dark matter candidates. The extremely small neutrino antineutrino annihilation cross section further implies near equilibrium between neutrinos and antineutrinos, potentially addressing the matter antimatter asymmetry.\n\n", "2601.18888": "2026-01-26, **Constraining axial non-standard interactions of neutrinos with long baseline experiments**, Yasaman Farzan et.al., [2601.18888v1](http://arxiv.org/abs/2601.18888v1)\n\n Thanks to a number of neutrino oscillation and Coherent Elastic neutrino Nucleus Scattering (CE$ν$NS) experiments, the vector Non-Standard Interactions (NSI) of neutrinos have been well studied and constrained. We show that the long-sought-after new physics may hide in the ``axial\" non-standard interactions rather than in the vector NSI. We then show how by studying neutral current scattering events in the detectors of long baseline experiments, MINOS, MINOS$+$ and DUNE, the impact of the axial NSI can be discovered.\n\n", "2601.18880": "2026-01-26, **Single-wave solutions of the neutrino fast flavor system. Part II. Weak instabilities and their resonant behavior**, Damiano F. G. Fiorillo et.al., [2601.18880v1](http://arxiv.org/abs/2601.18880v1)\n\n Flavor instabilities in dense neutrino media trigger exponential growth of flavor waves, yet their nonlinear saturation remains poorly understood. We examine a simple proxy for this effect in the form of a single-wave solution of an axially symmetric fast flavor system. When the angular crossing is shallow and the growth rate of the instability correspondingly small, the flavor wave primarily affects resonant neutrinos that move in phase with it. The evolution of these resonant neutrinos becomes periodic, undergoing cycles of full flavor reversal. They feed power into the unstable wave, and subsequently return to their initial state, draining power back out. This new flavor pendulum captures the dynamics of weak, nearly monochromatic fast flavor instabilities. Since weakly unstable distributions always exhibit a narrow range of unstable wavenumbers, our model likely describes the earliest development of a flavor instability when it first appears. When the instability is not weak, the linear phase of a single-wave excitation does not connect to a regular nonlinear solution, unless the angle distribution consists of only two beams.\n\n", "2601.18781": "2026-01-26, **Another relation among the neutrino mass-squared differences?**, I. Alikhanov et.al., [2601.18781v1](http://arxiv.org/abs/2601.18781v1)\n\n Determining absolute neutrino masses remains a central challenge in particle physics. Relations among the neutrino mass-squared differences could facilitate this determination and shed additional light on the underlying mass-generation mechanism. Inspired by recent global fits of neutrino oscillation parameters, we propose a simple algebraic relation between $Δm^2\\_{21}$ and $Δm^2\\_{31}$. It provides a framework to analytically manipulate these parameters and admits specific physical interpretations. In particular, the results may point toward a vanishing $ν\\_1$ mass.\n\n", "2601.18668": "2026-01-26, **tilepy: A Flexible Open-Source Scheduling Engine for Time-Domain and Multi-Messenger Astronomy**, Fabian Schüssler et.al., [2601.18668v1](http://arxiv.org/abs/2601.18668v1)\n\n The era of multi-messenger astrophysics requires rapid and efficient follow-up of transient events, many of which, such as gravitational waves (GW), gamma-ray bursts (GRB), and high-energy neutrinos, suffer from poor sky localisation. We present tilepy, a Python-based software designed to optimize observation schedules for these events. We here detail the modular architecture of tilepy, which separates high-level scheduling logic from low-level tiling and pointing tools, enabling full adaptability for ground- and space-based observatories. Furthermore, we describe the integration of tilepy into the Astro-COLIBRI platform, providing the community with a user-friendly interface and API for triggering complex observation campaigns in real time.\n\n", "2601.18666": "2026-01-26, **The phase structure of QCD: Fluctuations and Correlations**, Peter Braun-Munzinger et.al., [2601.18666v1](http://arxiv.org/abs/2601.18666v1)\n\n The strong interaction - governed by Quantum Chromodynamics (QCD) - shapes the structure of the visible universe. At about 10 $μ$s after the big bang, the primordial matter made up of quarks and gluons plus leptons, photons and neutrinos, the quark-gluon plasma (QGP), became cool enough to create, in a phase transition, the protons and neutrons of ordinary matter, along with other strongly interacting unstable hadrons. This phase transition was predicted within the framework of QCD and has been studied in accelerator laboratories world-wide since about 40 years. This review will explore recent breakthroughs in the study of the QCD phase diagram. We will highlight measurements of particle production and fluctuations, and compare them to theoretical predictions. We summarize our current understanding of the QCD structure and outline future experimental opportunities with high energy nuclear collisions at fixed-target and collider facilities world-wide.\n\n", "2601.18601": "2026-01-26, **Geometrical Constraints On Leptonic Unitarity Triangles**, Mathieu Guigue et.al., [2601.18601v1](http://arxiv.org/abs/2601.18601v1)\n\n The precision of the neutrino oscillation parameters measurements has improved and will continue to improve as the next-generation experiments become online. Beyond the more precise measurements of the mixing angles and phases used to parametrize the lepton mixing matrix, tests of its unitarity are of great interest. This paper studies how the amplitudes of the oscillation patterns can be used and combined to construct leptonic unitarity triangles.\n\n", "2601.18421": "2026-01-26, **Meson-exchange currents and nuclear correlations in neutrino and electron scattering with nuclei**, Paloma Rodríguez Casalé et.al., [2601.18421v1](http://arxiv.org/abs/2601.18421v1)\n\n This thesis is dedicated to the study of electron and neutrino scattering on nuclei, with special emphasis on meson-exchange currents (MEC) and short-range correlations (SRC) between nucleon pairs in one-particle emission processes. In chapter 2, the SuSAM* model is improved by redefining the single nucleon hadronic tensor, averaging it over a Fermi distribution instead of using the previous extrapolation from the relativistic Fermi gas. This formulation removes the inconsistency associated with negative contributions in kinematics far from the QE peak. The new definition allows extending the SuSAM* formalism to include MEC, which is the focus of chapter 3. In chapter 3, a scaling analysis of 12C data is performed incorporating MEC explicitly at the single nucleon level, leading to a new phenomenological scaling function. Using this model, the effect of MEC on EM responses is studied and compared with the relativistic Fermi gas (RFG) and the relativistic mean field (RMF) models. Chapter 4 presents a detailed analysis of the interference between 1b2b in the RT. It is shown that this interference is always negative within the independent-particle approximation. Chapter 5 extends the study of MEC to the CCQE neutrino scattering within the RFG, RMF, and SuSAM* frameworks. It is found that OB-MEC interference reduces both the RT and the neutrino cross section. Chapter 6 addresses SRC in the wave function of a nucleon pair in nuclear matter. The BG equation is solved using the NN potential developed by the Granada group, allowing for the calculation of high-momentum components. Finally, chapter 7 combined the effect of MEC and SRC, which extends the FG by including the high-momentum components of nucleon pairs affected by MEC. It is found that SRC enhance the RT, in contrast with what is observed in uncorrelated models.\n\n", "2601.18397": "2026-01-26, **Testing residual-symmetry-fixed columns of $U_{\\rm PMNS}$ at DUNE and T2HK with initial JUNO constraints**, Debajyoti Dutta et.al., [2601.18397v1](http://arxiv.org/abs/2601.18397v1)\n\n We study fixed-column predictions of the lepton mixing matrix that arise from residual symmetries originating in a class of discrete flavour and modular symmetries. While the recent high-precision determination of $\\sin^{2}θ\\_{12}$ by JUNO already constrains part of these predictions, the remaining ones are primarily characterized by non-trivial correlations between $\\sin^{2}θ\\_{23}$ and the Dirac CP phase $δ\\_{\\rm CP}$, which are currently only weakly constrained. This motivates a detailed investigation using next-generation long-baseline neutrino experiments. For the viable scenarios, we derive precise $\\sin^{2}θ\\_{23}$-$δ\\_{\\rm CP}$ correlations and use them to generate test-event samples, marginalising over the remaining oscillation parameters. We perform detailed simulations for DUNE and T2HK, presenting allowed regions in the $\\sin^{2}θ\\_{23}$-$δ\\_{\\rm CP}$ plane and evaluating the CP-violation fraction as a function of exposure. Our results show that the combined sensitivity of DUNE and T2HK provides a robust test of fixed-column lepton-mixing predictions.\n\n", "2601.18357": "2026-01-26, **Resolution Dependence in Magnetohydrodynamic Simulations of Neutrino-Driven Core-Collapse Supernovae**, Vishnu Varma et.al., [2601.18357v1](http://arxiv.org/abs/2601.18357v1)\n\n We investigate the role of resolution and initial magnetic field strength on core-collapse supernovae in simulations of a non-rotating $13 \\mathrm{M\\_\\odot}$ progenitor. Specifically, we study the effect on shock revival, explosion dynamics, and the properties of the compact remnant. We run four models with different numerical grid resolutions with an initial central dipole field strength of $\\mathord{\\approx}10^{12}\\, \\mathrm{G}$. Two of those resolutions are also run with a weaker central magnetic field of $\\mathord{\\approx}10^{10}\\, \\mathrm{G}$ . The shock revival time for all models is largely independent of resolution and initial magnetic field strength, but we find higher explosion energies when the initial magnetism is stronger and at higher resolutions. We find that models with strong magnetic fields have lower neutrino luminosity and energies, due to a proto-neutron star (PNS) that is deformed by the strong magnetic fields. At higher resolutions, magnetic fields are amplified more efficiently in the gain region and in the PNS via the small-scale dynamo. Although the strong magnetic fields do not directly drive the explosion, they have a subsidiary impact on the explosion mechanism and compensate for the reduced neutrino heating. Stronger magnetic energies in the PNS also affect energy and angular momentum redistribution, leading to more extended and vigorous PNS convection zones at higher resolutions.\n\n", "2601.18237": "2026-01-26, **Revisiting $μ$-$e$ conversion in $R$-parity violating SUSY**, Yu-Qi Xiao et.al., [2601.18237v1](http://arxiv.org/abs/2601.18237v1)\n\n The $μ$-$e$ conversion process is one of the most powerful ways to test lepton-flavor-violating (LFV) interactions involving charged leptons. The standard model with massive neutrinos predicts an extremely low rate for $μ$-$e$ conversion, making this process an excellent probe for testing LFV arising from new physics. Among many theoretical models that can induce LFV, the Supersymmetric model with R-parity violating interactions is one of the most studied for $μ$-$e$ conversion. In this work, we revisit trilinear R-parity violating interactions for $μ$-$e$ conversion, considering renormalization group (RG) running effects from high to low energy scales. The $μ$-$e$ conversion, $μ\\to e γ$, and $μ\\to eee$ experimental data are compared to give upper limits on the relevant 15 combinations of the trilinear $λ^{\\prime}$ couplings and 6 combinations of the $λ$ couplings, certain of which are underexplored in previous studies. We find that RG running effects influence the limits by no more than 30\\% in most cases, but can improve constraints by $\\sim$80\\% in certain combinations, which cannot be neglected. In the near future, COMET and Mu2e are expected to begin data-taking and aim to provide the most stringent constraints on $μ$-$e$ conversion. These next-generation $μ$-$e$ experiments have the ability to give much more comprehensive examinations on most trilinear coupling combinations than the $μ\\to eγ$ and $μ\\to 3e$ decay experiments. The $μ$-$e$ experiments will not only deepen our understanding of LFV but also provide a crucial way to examine the underlying new physics contributions.\n\n", "2601.18209": "2026-01-26, **Lattice determination of the neutrino background for $J/ψ\\rightarrow γ+ \\textrm{invisible}$**, Yu Meng et.al., [2601.18209v1](http://arxiv.org/abs/2601.18209v1)\n\n Searching for dark matter is a primary goal of modern astronomy and particle physics. Invisible decays of heavy quarkonia are particularly promising for probing light dark matter, attracting broad interest due to their unique sensitivity. Experiments searching for radiative invisible decays of the $J/ψ$ have steadily improved upper limits, and upcoming facilities will push sensitivity further -- making the precise determination and subtraction of the neutrino background indispensable. Here, we present the first lattice QCD calculation of the Standard Model decay $J/ψ\\to γν\\barν$, an irreducible background to $J/ψ\\to γ+ \\textrm{invisible}$. Our result for the branching fraction is $\\operatorname{Br}(J/ψ\\to γν\\barν)=1.00(9)(7)\\times 10^{-10}$, where the first uncertainty is statistical and the second is our systematic estimate. This work advances lattice-based determinations of neutrino backgrounds to quarkonium invisible decays, delivering an ab initio benchmark for $J/ψ\\to γ+ \\textrm{invisible}$. Our approach generalizes to other quarkonium channels (e.g., $Υ/φ\\to γ+\\textrm{invisible}$) and provides critical theoretical support for dark matter searches at colliders.\n\n", "2601.18114": "2026-01-26, **Mitigating Deadtime in Distributed Optical Arrays: A Liveness-Aware Trigger Approach for High-Energy Neutrino Detection**, Thammarat Yawisit et.al., [2601.18114v1](http://arxiv.org/abs/2601.18114v1)\n\n Large-scale neutrino observatories operate under unavoidable detector deadtime arising from photomultiplier saturation, digitizer limits, and front-end readout constraints. Conventional coincidence-based trigger logic implicitly assumes continuous sensor availability and therefore suffers systematic efficiency loss when channels become temporarily non-live. This work presents the design of a liveness-aware trigger architecture targeting low-latency FPGA deployment in distributed optical arrays. We introduce a recursive Infinite Impulse Response (IIR) update law implemented as a fully synthesizable pipeline that constructs a continuity-preserving effective observable at each sensor node. Rather than collapsing during non-liveness intervals, the observable decays smoothly while retaining phase and amplitude information relevant for network-level coherence estimation. By explicitly separating continuous measurement construction from discrete trigger decision logic, the proposed architecture enables graceful degradation under partial channel non-liveness. Performance is evaluated using a hybrid validation framework that combines representative event topologies derived from IceCube Open Data with a hardware-accurate signal and noise model spanning a wide dynamic range. Simulation results demonstrate that the proposed trigger sustains high event recovery efficiency in regimes of elevated deadtime probability, where conventional coincidence logic degrades substantially. Furthermore, the continuity-preserving observable yields up to a two-order-of-magnitude improvement in effective signal-to-noise ratio, enabling robust detection under strong saturation and non-ideal operating conditions. This method provides a robust foundation for next-generation firmware-level trigger strategies in large-scale, noise-dominated detector systems.\n\n", "2601.18051": "2026-01-26, **Neutrino opacities in magnetic fields for binary neutron star merger simulations**, Mia Kumamoto et.al., [2601.18051v1](http://arxiv.org/abs/2601.18051v1)\n\n Neutrino interactions play a central role in transport and flavor evolution in the ejecta of binary neutron star mergers. Simulations suggest that neutron star mergers may produce magnetic fields as strong as $10^{17}$ G, but computational difficulties have hampered the inclusion of magnetic field effects in neutrino interaction rates. In this paper we give approximate interaction rates for neutrinos in the presence of strong magnetic fields, including the effects of Landau quantization and anomalous magnetic moments with errors of order $\\sqrt{T/M}$. We also comment on a neutrino production channel from individual neutrons that can produce low-energy $ν\\barν$ pairs even at low density.\n\n"}, "dark matter": {"2601.19863": "2026-01-27, **Prompt cusps in hierarchical dark matter halos: Implications for annihilation boost**, Shin'ichiro Ando et.al., [2601.19863v1](http://arxiv.org/abs/2601.19863v1)\n\n Recent simulations have identified long-lived ``prompt cusps'' -- compact remnants of early density peaks with inner profiles $ρ\\propto r^{-3/2}$. They can survive hierarchical assembly and potentially enhance signals of dark matter annihilation. In this work, we incorporate prompt cusps into the semi-analytic substructure framework \\textsc{SASHIMI}, enabling a fully hierarchical, environment-dependent calculation of the annihilation luminosity that consistently tracks subhalos, sub-subhalos, and tidal stripping. We assign prompt cusps to first-generation microhalos and propagate their survival through the merger history, including an explicit treatment of cusps associated with stripped substructure. We find that the substructure hierarchy converges rapidly once a few levels are included, and that prompt cusps can raise the total annihilation boost of Milky-Way--size hosts at $z=0$ to $B\\sim O(10)$ for fiducial cusp-occupation assumptions, compared to a subhalo-only baseline of $B\\_{\\rm sh}\\sim\\mathrm{few}$. Across a wide range of host masses and redshifts, prompt cusps increase the normalization of $B(M\\_{\\rm host},z)$ while largely preserving its mass and redshift trends. Compared to universal-average, peak-based estimates, our fiducial boosts are lower by about an order of magnitude, primarily reflecting a correspondingly smaller inferred cusp abundance in host halos, highlighting the importance of unifying peak-based cusp formation with merger-tree evolution and environmental dependence.\n\n", "2601.19861": "2026-01-27, **Testing the Equivalence Principle in Galaxy Clusters**, Enea Di Dio et.al., [2601.19861v1](http://arxiv.org/abs/2601.19861v1)\n\n Clusters of galaxies have been used to measure a subtle effect predicted by Einstein: gravitational redshift. This signal encodes pristine information about our Universe, since it is sensitive to the depth of the clusters' gravitational potential wells. In this work, we show how gravitational redshift can be used to test a fundamental physical principle: the weak equivalence principle. This principle stipulates that all matter falls in the same way in a gravitational potential, regardless of its nature. By comparing the amplitude of the gravitational redshift signal with the velocity dispersion in galaxy clusters, we build a novel test of this principle targeted to the unknown dark matter. Our test is sensitive to any additional interaction that would alter the way dark matter falls in gravitational potentials, hence leading to a violation of the equivalence principle. We show that currently available data can constrain the presence of a fifth force in clusters at the level of 7-14%, while the newest surveys will reach a precision of a few percents. This demonstrates the crucial role played by galaxy clusters in testing fundamental properties of dark matter.\n\n", "2601.19844": "2026-01-27, **Oscillating Resonances: Imprints of ultralight dark matter at colliders**, Martin Bauer et.al., [2601.19844v1](http://arxiv.org/abs/2601.19844v1)\n\n In models where ultralight fields constitute dark matter, the misalignment mechanism leads to coherent, low-amplitude oscillations in fundamental constants. This effect arises from effective operators that couple dark matter to Standard Model fields. We present different models that can induce these effective operators by integrating out a mediator field. For mediator masses within the reach of collider searches, an alternative way to discover ultralight dark matter is to search for a resonance. Due to being a mediator to dark matter, the mass of the mediator oscillates. The resonance therefore, should not appear as a single isolated peak, but is smeared out once data is averaged over an oscillation cycle or more. Remarkably, the oscillation period and amplitude are in the range of current and future collider searches, even though constraints from atomic clocks probing variations of the fine-structure constant and the electron mass are very strong. We recast existing searches and projections from Belle II, LHCb and SHiP for an `oscillating resonance', and discuss how the periodicity of the signal can be used to reconstruct the peak from mass-binned data. We further show that time-stamped data would allow to unfold the signal via a fast Fourier transform and determine the significance of the signal for different background levels. The discovery of an oscillating resonance at a collider, with characteristics as predicted in ultralight dark matter scenarios, would constitute a powerful probe of dark matter's underlying nature.\n\n", "2601.19662": "2026-01-27, **A study of dark matter-dark energy interaction under the DESI DR2 data constraint**, Amin Aboubrahim et.al., [2601.19662v1](http://arxiv.org/abs/2601.19662v1)\n\n While $Λ$CDM provides a good fit to cosmological data, it fails to address many of the outstanding questions in contemporary cosmology. Chief among these are the Hubble tension and the apparent dynamical nature of dark energy as inferred from the recent DESI DR2 analysis. In this work, we analyze a field-theoretic description of cosmology where both dark energy and dark matter are interacting spin zero fields. We give a thorough study of a wide range of the interaction strength and demonstrate the effect on the dark energy equation of state and the Hubble tension. Using the recent cosmological data, we extract constraints on cosmological parameters including the free parameters of the model.\n\n", "2601.19150": "2026-01-27, **Q-balls from thermal balls during a first-order phase transition: a numerical study**, Yuan-Jie Li et.al., [2601.19150v1](http://arxiv.org/abs/2601.19150v1)\n\n We numerically study the Q-ball formation triggered by a cosmological first-order phase transition within the Friedberg-Lee-Sirlin model. By performing lattice simulations, we track the nonequilibrium dynamics throughout the transition, providing a precise description of the Q-ball formation mechanism and the resulting mass spectrum. Collapsing false-vacuum regions first form thermal balls, which subsequently cool via dissipative interactions and stabilize into long-lived Q-balls with nonzero spin. We observe a large population of low-mass Q-balls, as well as rare, massive Q-balls that are several times larger than the analytical prediction. The final Q-ball population exhibits a broad mass spectrum spanning over two orders of magnitude, characterized by an exponential tail of number density at large masses. The simulations suggest that the Q-ball abundance is approximately $50\\%$ higher than predicted by analytical estimates, adjusting the result in the context of Q-balls as dark matter candidates.\n\n", "2601.18873": "2026-01-26, **Thermoskyrmions**, Mikael Chala et.al., [2601.18873v1](http://arxiv.org/abs/2601.18873v1)\n\n Skyrmions are stable and topologically non-trivial field configurations that behave like localized particles. They appear in the chiral effective theory for pions, where they correspond to the baryon states, and might also exist in the electroweak theory, in the presence of certain effective interactions. In this paper, focusing on toy models that capture different limits of the electroweak sector of the Standard Model (SM), we show that skyrmions not classically stable at zero temperature can be stabilized by thermal effects. This result motivates the study of skyrmions in the quantum effective action of the SM, potentially implying the existence of dark matter without new physics.\n\n", "2601.18693": "2026-01-26, **Intracluster light as a dark matter tracer: how their spatial and kinematic relationship is shaped by satellite demographics**, G Martin et.al., [2601.18693v1](http://arxiv.org/abs/2601.18693v1)\n\n We investigate how the orbital evolution and mass distribution of infalling satellite galaxies shape the phase-space and radial distributions of intracluster light (ICL) relative to the underlying cluster dark matter (DM) halo. Using N-body simulations, we follow the tidal stripping and orbital evolution of satellite galaxies as they are accreted into a live cluster halo, systematically varying satellite-to-host mass ratio and orbital circularity. We measure the specific orbital energy and angular momentum of stripped stellar and DM material, finding that the stripped stars consistently occupy lower-energy and lower-angular momentum regions of phase-space than the stripped DM. The magnitude of this difference increases strongly towards more equal satellite--to--host mass ratios, while the dependence on orbital circularity is weak. We construct a predictive model for the phase-space properties of stripped stars and DM from a whole infalling satellite population and find that the resulting phase-space difference between the components are driven primarily by the characteristic mass of the infalling satellite stellar mass function. We find that the ICL is always more centrally concentrated than the DM. The magnitude of this offset depends on the characteristic mass and increases towards higher characteristic masses. Comparisons with four independent cosmological hydrodynamical simulations show that, once the infalling satellite stellar mass function is matched, the model reproduces the radial stellar-to-DM density profile offsets to better than the inter-simulation scatter. This demonstrates that the radial relationship between the ICL and the DM distribution is largely governed by satellite demographics. With adequate constraints on the infalling satellite population, ICL density profiles can therefore be used as informative tracers of the underlying radial DM distribution in clusters.\n\n", "2601.18652": "2026-01-26, **Impact of Rastall gravity on hydrostatic mass of galaxy clusters**, M. Lawrence Pattersons et.al., [2601.18652v1](http://arxiv.org/abs/2601.18652v1)\n\n Galaxy clusters are the largest virialized structures in the Universe and are predominantly dominated by dark matter. The hydrostatic mass and the mass obtained from gravitational lensing measurements generally differ, a discrepancy known as the hydrostatic mass bias. In this work, we derive the hydrostatic mass of galaxy clusters within the framework of Rastall gravity and investigate its implications under two scenarios: (i) the absence of dark matter and (ii) the existence of dark matter. In the first scenario, Rastall gravity effectively reduces the hydrostatic mass, bringing it closer to the observed baryonic mass. The best linear fit yields a slope $\\mathbf{M}=1.07\\pm0.11$, indicating a near one-to-one correspondence between the two masses. In the second scenario, Rastall gravity helps to alleviate the hydrostatic mass bias. The linear fit between the Rastall hydrostatic mass and the observed lensing mass results in a best-fit slope $\\mathbf{M}=1.01\\pm0.16$, which is very close to unity. These results suggest that Rastall gravity provides a statistically favorable framework for addressing mass discrepancies in galaxy clusters.\n\n", "2601.18578": "2026-01-26, **The AIDA-TNG project: gas distributions inside and around haloes**, Chi Zhang et.al., [2601.18578v1](http://arxiv.org/abs/2601.18578v1)\n\n The nature of Dark Matter (DM) is one of the most outstanding mysteries of modern astrophysics. While the standard Cold DM (CDM) model successfully explains observations on most astrophysical scales, DM particles have not yet been detected, leaving room for a plethora of different models. In order to identify their observable signatures, we use the AIDA-TNG cosmological simulation suite to predict the distributions of gas and neutral hydrogen (HI) in the CDM, Self-Interacting DM (SIDM), velocity-dependent SIDM (vSIDM), and Warm DM (WDM) models.   We find that the DM models investigated have very limited impact on the median gas and HI profile of haloes. In particular, for the most massive haloes ($M\\_{\\rm vir}\\sim10^{14}\\,\\mathrm{M}\\_\\odot$), we find that DM self-interactions can shallow the central potential and thereby enhance gas cooling. We find that, in all models, the halo-to-halo variation in the HI profiles is explained by AGN feedback, and that the specific characteristics of DM model is largely subdominant. Nevertheless, we detect some systematic difference in the case of SIDM, with more HI surviving close to the centre with respect to other models. We provide fitting functions for the gas and HI profiles.   We investigate the galaxy-Ly$α$ cross-correlation function (\\galacc) for different halo masses, redshift and observation strategies. We find that at $z=0$ vSIDM can be distinguished from CDM in haloes with $10^{12}\\lesssim M\\_{\\rm vir}\\lesssim10^{13}\\,{\\rm M}\\_\\odot$, while SIDM1 can be distinguished from CDM in haloes with $M\\_{\\rm vir}\\gtrsim10^{13}\\,{\\rm M}\\_\\odot$. We estimate that statistically-robust detection requires sampling $\\sim160$ haloes with $\\sim20$ sightlines each, a task that can be achieved with current and future facilities like WEAVE, 4MOST, PFS, ELT and WST.\n\n", "2601.18379": "2026-01-26, **Analysis of freeze-in scenario with a scalar Leptoquark and a scalar Dark Matter**, Joydeep Roy et.al., [2601.18379v1](http://arxiv.org/abs/2601.18379v1)\n\n Dark Matter relic density generation through \\textit{freeze-in} mechanism where dark matter particles interact feebly with visible sector particles, is an alternative approach to well-studied and most popular \\textit{freeze-out} paradigm. We study this \\textit{freeze-in} scenario in the presence of a scalar leptoquark interacting with both dark matter and Standard Model particles with renormalizable interactions. We discuss the effect of the presence of such heavy particle, a scalar leptoquark with mass $\\geq 1.5 \\TeV$, in the thermal bath and subsequent relic density generation. We explore the parameter space of such framework, consisting of two masses and three dimensionless couplings. We numerically study the interaction rates and relic density as a function of these parameters and determine their values consistent with the dark matter constraints.\n\n", "2601.18176": "2026-01-26, **Rotating black holes in the Hernquist galactic halo and its accretion disk luminosity**, Malihe Heydari-Fard et.al., [2601.18176v1](http://arxiv.org/abs/2601.18176v1)\n\n Static, spherically symmetric black holes immersed in a dark matter halo with a Hernquist-type density profile have been derived by Cardoso et. al. in Ref. \\redcite{Cardoso:2021wlq}. Using the Newman-Janis algorithm, we construct the metric for a stationary and axially symmetric rotating black hole in this environment. Then, we obtain the electromagnetic properties of thin accretion disks around such rotating black holes by utilizing the steady-state Novikov-Thorne model, and study the effects of spin parameter and halo compactness parameter on the disk properties. Finally, by comparison the results of the rotating Cardoso black hole with that of Kerr black hole in the absence of dark matter, we find that the presence of dark matter can not significantly affect the disk properties and thus for astrophysical black holes with large spin parameter, the distinction of rotating Cardoso black holes becomes more difficult than the Kerr black hole.\n\n", "2601.18079": "2026-01-26, **Vanishing Compactness Gap and Fermionic Compact Dark Matter in Hořava-Lifshitz Gravity**, Edwin J. Son et.al., [2601.18079v1](http://arxiv.org/abs/2601.18079v1)\n\n We show that the gap in the compactness between black holes and neutron stars witnessed in general relativity may be vanishing in Hořava-Lifshitz (HL) gravity. Assuming a fermion equation-of-state for simplicity, and solving the Tolman-Oppenheimer-Volkoff equation within the HL gravity framework, we see that there exists a minimum fermion mass $m\\_f^\\text{(min)}(q,y)$, above which the gap of the compactness between black hole and fermionic compact object vanishes, for a given deformation parameter $q$ of HL and interaction strength $y$ between fermions. Thus, in HL gravity, the mass and radius of an object found in the lower mass gap by LIGO-Virgo-KAGRA observations might not be able to classify it as a black hole or a neutron star. It is interesting to note that a fermion of mass $\\sim 40\\ \\text{GeV}$ can form a highly compact object of mass $\\sim 10^{-4}\\ \\msun$ and radius $\\sim 1\\ \\text{m}$ that may play the role of the cold dark matter. In addition, we find the possible existence of another class of compact objects whose compactness is comparable to that of a black hole.\n\n"}, "supernova": {"2601.19891": "2026-01-27, **Fading Echoes of Interaction: Probing Centuries of Mass-Loss in Four Old Type IIn Supernovae**, Elizabeth Hillenkamp et.al., [2601.19891v1](http://arxiv.org/abs/2601.19891v1)\n\n Supernovae characterized by enduring narrow optical hydrogen emission lines (SNe IIn) are believed to result primarily from the core-collapse of massive stars undergoing sustained interaction with a dense circumstellar medium (CSM). While the properties of SN IIn progenitors have relatively few direct constraints, the ongoing ejecta-CSM interaction provides unique information about late-stage stellar mass-loss preceding core-collapse. We present late-time X-ray and radio observations of four $\\geq$3000 day-old SNe IIn: SN 2013L, SN 2014ab, SN 2015da, and KISS15s. The radio and X-ray emission from KISS15s indicate a mass-loss rate of $\\rm{\\dot M\\sim4\\times 10^{-3}~{M\\_{\\odot}\\,yr^{-1}}}$ at $\\sim$450 years pre-supernova -- 2 orders of magnitude below earlier optical estimates (which probed the mass-loss immediately preceding the supernova). We find hints of a spectral inversion in the radio SED of KISS15s; a possible signature of a secondary shock due to a binary system or the emergence of a pulsar wind. For SN 2013L, we obtain a mass-loss rate of $\\rm{\\dot M\\sim2 \\times 10^{-3}~\\rm{M\\_{\\odot}\\,yr^{-1}}}$ at $\\sim$400 years pre-explosion based on the X-ray detection. For SN 2014ab and SN 2015da, we find a upper limits on the mass-loss rates of $\\rm{\\dot M<2\\times10^{-3}~M\\_{\\odot}\\,yr^{-1}}$ explosion at $\\sim$ 250 and 300 years pre-explosion, respectively. All four objects display mass-loss rates lower than estimates from earlier optical analyses by at least 1-3 orders of magnitude, necessitating a rapidly evolving progenitor process over the last centuries pre-explosion. Our analysis reveals how X-ray and radio observations can elucidate progenitor evolution when these objects have faded at optical wavelengths.\n\n", "2601.19424": "2026-01-27, **Union3.1: Self-consistent Measurements of Host Galaxy Properties for 2000 Type Ia Supernovae**, Taylor J. Hoyt et.al., [2601.19424v1](http://arxiv.org/abs/2601.19424v1)\n\n The determination of distances using time-series photometry of Type Ia supernovae (SNe Ia) relies on a ~5% empirical correction related to the properties of their host galaxies, e.g., global stellar mass. It is therefore crucial for unbiased cosmology inference that host galaxy properties be self-consistently determined across the full range of redshifts probed, which we undertake in this study for approximately 2000 SNe in the Union3 compilation (now Union3.1). We use aperture-matched, homogeneously-reduced, optical-infrared photometry from the DESI Legacy Imaging Surveys to derive global galaxy properties using the stellar population synthesis and SED-fitting code Prospector. We find that the host masses of $z<0.10$ SNe in Union3 were, on average, overestimated relative to the rest of the sample, while the opposite was true for $z<0.15$ SNe in Pantheon+. After correction, the two studies' average distance modulus estimated for low-redshift SNe, previously $>0.03$ mag discrepant, come into 0.01 mag agreement. We then update the UNITY SN analysis and find that the uncertainties on all standardization parameters shrink to 0.6-0.9x their previous sizes. For flat-$Λ$CDM, we find $Ω\\_m=0.344^{+0.026}\\_{-0.025}$, a -0.3$σ$ shift from Union3. We then combine with measurements of Baryon Acoustic Oscillations (BAO) and the Cosmic Microwave Background (CMB) exactly as done by DESI DR2 and find $w\\_0=-0.719\\pm0.084$, $w\\_a=-0.95^{+0.29}\\_{-0.26}$, corresponding to 3.4$σ$ evidence against a cosmological constant (down from 3.8$σ$). We also update the DESI combined probe analysis using our correction to Pantheon+ and the recent DES-SN5YR Dovekie recalibration, finding $3.2σ$ (up from 2.8$σ$) and 3.4$σ$ (down from 4.2$σ$) evidence against a cosmological constant in the $w\\_0w\\_a$ plane, altogether marking a significantly improved consistency across SN analyses.\n\n", "2601.19018": "2026-01-26, **A multiwavelength view of the nearby Calcium-Strong Transient SN 2025coe in the X-Ray, Near-Infrared, and Radio Wavebands**, Sahana Kumar et.al., [2601.19018v1](http://arxiv.org/abs/2601.19018v1)\n\n Calcium-strong transients (CaSTs) are a subclass of faint and rapidly evolving supernovae (SNe) that exhibit strong calcium features and notably weak oxygen features. The small but growing population of CaSTs exhibits some aspects similar to thermonuclear supernovae and others that are similar to massive star core-collapse events, leading to intriguing questions on the physical origins of CaSTs. SN 2025coe is one of the most nearby CaSTs discovered to date, and our coordinated multi-wavelength observations obtained days to weeks post-explosion reveal new insights on these enigmatic transients. With the most robust NIR spectroscopic time-series of a CaST collected to date, SN 2025coe shows spectral signatures characteristic of Type Ib SNe (SNe Ib, i.e. He-rich stripped-envelope SNe). SN~2025coe is the third X-ray detected CaST and our analysis of the \\textit{Swift} X-ray data suggest interaction with 0.12 $\\pm\\,0.11\\ M\\_{\\odot}$ of circumstellar material (CSM) extending to at least $2 \\times 10^{15} $cm ($\\sim 30,000\\ R\\_{\\odot}$), while our analysis of the 1-240 GHz radio non-detections gives an outer radius of that CSM of at most $\\sim 4\\times 10^{15}$ cm. This inferred nearby high-density CSM extending out to $3\\pm 1 \\times10^{15}$ cm is similar to that seen in the other two X-ray detected CaSTs, and its presence suggests that either intensive mass-loss or some polluting mechanism may be a common feature of this subclass. Our work also expands upon recent studies on the optical properties of SN 2025coe and explores our current understanding of different progenitor systems that could possibly produce CaSTs.\n\n", "2601.18988": "2026-01-26, **Energy partition in collisionless counterstreaming plasmas**, Alexis Marret et.al., [2601.18988v1](http://arxiv.org/abs/2601.18988v1)\n\n Fast, counter-streaming plasma outflows drive magnetic field amplification, plasma heating, and particle acceleration in numerous astrophysical environments, from supernova remnant shocks to active galactic nuclei jets. Understanding how, in the absence of Coulomb collisions, energy is redistributed between the different plasma species remains a fundamental open question. We use 3D fully-kinetic simulations to investigate energy partition in weakly magnetized counter-propagating plasmas. Our results reveal a complex interplay between different processes, where at early times the Weibel instability drives a first stage of magnetic field amplification and at late times the kinking of current filaments drives a second amplification stage via a dynamo-type mechanism. Electrons are heated primarily during the latter phase through magnetic pumping. By the time the flows thermalize, we observe that the final temperature ratio $T\\_e/T\\_i$ and energy partition depend on the ion-to-electron mass ratio. For electron-proton flows, the electron thermal energy only reaches up to a few percent of the initial ion kinetic energy.\n\n", "2601.18885": "2026-01-26, **Homogeneous abundance ratios of hydrostatic and explosive alpha-elements in globular clusters from high resolution optical spectroscopy**, Eugenio Carretta et.al., [2601.18885v1](http://arxiv.org/abs/2601.18885v1)\n\n Galactic globular clusters (GCs) were born shortly after the Big Bang. For such old stellar systems the initial mass function (IMF) at the high mass regime can never be observed directly, because stars more massive than about 1 Mo have evolved since longtime. However, the hydrostatic to explosive alpha-element ratio (HEx ratio) offers a way to bypass the lack of observable high mass stars through the yields that massive stars released when exploding as supernovae, incorporated in the stars we presently observe in GCs. The HEx ratio measures the percentage of high mass stars over the total number of stars exploding as supernovae and it is an efficient probe of the ephemeral first phases of the GC evolution. We exploited a recently completed survey to assemble a dataset of very homogeneous abundances of alpha-elements in 27 GCs from [Fe/H]~ -2.4 to ~ -0.3 dex. In agreement with previous results from APOGEE, we confirm that the HEx ratio is indistinguishable for GCs formed in situ and accreted in the Galaxy, and that this ratio decreases with increasing metallicity. However, we posit that this trend is better explained by a metallicity-dependent IMF deficient in the highest mass stars at high metallicity, as corroborated by the declining [O/Mg] ratio as a function of the [Mg/H] ratio. At odds with the previous analysis based on APOGEE data, we detect an anti-correlation of HEx ratio with both present day and initial GC masses. Finally, we hypothesise that in that analysis, the stars of the GC M 54 were probably confused with stars in the core of the Sagittarius dwarf galaxy, where the cluster is presently immersed.\n\n", "2601.18542": "2026-01-26, **XFit: Global Optimization and Degeneracy Mapping in X-ray Spectral Modeling**, Austin MacMaster et.al., [2601.18542v1](http://arxiv.org/abs/2601.18542v1)\n\n The standard approach to modeling X-ray spectral data relies on local optimization methods, such as the Levenberg-Marquardt algorithm. While effective for simple models and speedy spectral fitting, these local optimizers are prone to becoming trapped in local minima, particularly in high-dimensional or degenerate parameter spaces, and typically require extensive user intervention. In this work, we introduce XFit, a global optimization method for fitting X-ray data, which makes extensive use of the Ferret evolutionary algorithm. XFit enables automated exploration of complex parameter spaces, efficient mapping of confidence intervals, and identification of degenerate solutions that may be overlooked by local methods. We demonstrate the performance of XFit using two representative X-ray sources: the Central Compact Object in Cassiopeia A and the supernova remnant G41.1-0.3. These examples span both low- and high-dimensional models, allowing us to illustrate the advantages of global optimization. In both cases, XFit produces solutions that are consistent with or improve upon those found with traditional methods, while also revealing alternative fits or degenerate solutions within statistically acceptable confidence levels. The automated mapping of parameter space offered by XFit makes it a powerful complement to existing spectral fitting tools, particularly as models and data quality become increasingly complex. Future work will expand the application of XFit to broader datasets and more physically motivated models.\n\n"}}