{"neutrino": {"2412.17698": "2024-12-23, **Confronting the seesaw mechanism with neutrino oscillations: a general and explicit analytical bridge**, Zhi-zhong Xing et.al., [2412.17698v1](http://arxiv.org/abs/2412.17698v1)\n\n With the help of a full Euler-like block parametrization of the flavor structure for the canonical seesaw mechanism, we present the first general and explicit analytical calculations of the two neutrino mass-squared differences, three flavor mixing angles and the effective Dirac CP-violating phase responsible for the primary behaviors of neutrino oscillations. Such model-independent results will pave the way for testing the seesaw mechanism at low energies.\n\n", "2412.17649": "2024-12-23, **Neutrinos as background and signal in Migdal search**, Tarak Nath Maity et.al., [2412.17649v1](http://arxiv.org/abs/2412.17649v1)\n\n Ionization or excitation resulting from the delayed response of the electron cloud to nuclear recoil is known as the Migdal effect. Dark matter searches utilizing this process set the most stringent bounds on the spin-independent dark matter-nucleon scattering cross section over a large region of the sub-GeV dark matter parameter space, underscoring its significance in dark matter detection. In this paper, we quantify the regions of dark matter parameter space that are challenging to probe via the Migdal effect due to the presence of dominant solar neutrino backgrounds for both liquid noble and semiconductor targets. Our findings reveal that there is no hard floor in the dark matter parameter space. Instead, we map the so called neutrino fog. In mapping the neutrino fog, we identify the importance of incorporating the Migdal effect induced by neutrinos, as well as neutrino-electron scattering and dominant coherent neutrino-nucleus scattering, particularly for semiconductor targets. Furthermore, we demonstrate that a large portion of the relic density allowed parameter space lies within the neutrino fog. Finally, we estimate the exposure required to detect neutrino induced Migdal events in direct detection experiments.\n\n", "2412.17584": "2024-12-23, **Search for charged Higgs bosons produced in top-quark decays or in association with top quarks and decaying via $H^{\\pm} \\to τ^{\\pm}ν_τ$ in 13 TeV $pp$ collisions with the ATLAS detector**, ATLAS Collaboration et.al., [2412.17584v1](http://arxiv.org/abs/2412.17584v1)\n\n Charged Higgs bosons produced either in top-quark decays or in association with a top-quark, subsequently decaying via $H^{\\pm} \\to \\tau^{\\pm}\\nu\\_{\\tau}$, are searched for in 140 $\\text{fb}^{-1}$ of proton-proton collision data at $\\sqrt{s}=13$ TeV recorded with the ATLAS detector. Depending on whether the top-quark produced together with the $H^{\\pm}$ decays hadronically or semi-leptonically, the search targets $\\tau$+jets or $\\tau$+lepton final states, in both cases with a $\\tau$-lepton decaying into a neutrino and hadrons. No significant excess over the Standard Model background expectation is observed. For the mass range of $80 \\leq m\\_{H^{\\pm}} \\leq 3000$ GeV, upper limits at 95% confidence level are set on the production cross-section of the charged Higgs boson times the branching fraction $\\mathrm{\\cal{B}}(H^{\\pm} \\to \\tau^{\\pm}\\nu\\_{\\tau})$ in the range 4.5 pb-0.4 fb. In the mass range 80-160 GeV, assuming the Standard Model cross-section for $t\\bar{t}$ production, this corresponds to upper limits between 0.27% and 0.02% on $\\mathrm{\\cal{B}}(t\\to bH^{\\pm}) \\times \\mathrm{\\cal{B}}(H^{\\pm} \\to \\tau^{\\pm}\\nu\\_{\\tau})$.\n\n", "2412.17277": "2024-12-23, **Neutrinos: Opening new doors**, Francesco Vissani et.al., [2412.17277v1](http://arxiv.org/abs/2412.17277v1)\n\n In this contribution, which introduces the \"Crossing the Portal\" session of the NOW 2024 meeting, I discuss the value of the concepts of interdisciplinarity and innovation for neutrino physics. After some historical considerations, which provide an initial illustration of the significant role of these concepts, I review some well-known cases of neutrino science, involving both astrophysics and particle physics, which allow us to deepen the analysis. The importance of a harmonious relationship between theoretical elaborations and experiments emerges: effective collaboration between theoretical and experimental physicists played a key role in many of the successful cases and proved marginal or defective in the doubtful ones. The discussion highlights also the need to proceed armed with a patience, a virtue that Feynman himself indicated as essential to science, all the more necessary when investigating interesting but elusive particles such as neutrinos.\n\n"}, "dark matter": {"2412.17802": "2024-12-23, **Feebly-Interacting Peccei-Quinn Model**, Wen Yin et.al., [2412.17802v1](http://arxiv.org/abs/2412.17802v1)\n\n The QCD axion is widely studied as a dark matter (DM) candidate and as a solution to the strong CP problem of the Standard Model. In conventional field-theoretic models, a much larger mass scale than the electroweak (EW) scale is typically introduced to spontaneously break Peccei-Quinn (PQ) symmetry with a large enough axion decay constant, $f\\_a$, thereby avoiding constraints from star cooling. In this paper, I propose an alternative approach to achieving the large decay constant: a PQ scalar field with a large wave function renormalization constant, analogous to a feebly coupled gauge theory. Other dimensionless parameters are ${O}(1)$ in the unit of the EW scale for the naturalness. This framework predicts a light PQ Higgs boson with a mass $\\sim (\\mathrm{EW~scale})^2 / f\\_a$. Exotic particles associated with the PQ anomaly are expected to have masses around the EW scale. The proposed model alleviates both the PQ quality and EW scale fine-tuning problems and introduces interesting axion-PQ Higgs cosmologies, encompassing: slim axion DM from a fat string network, heavy axion DM from PQ Higgs condensate fragmentation, PQ Higgs DM, and axion-PQ Higgs co-DM scenarios. Potential experimental signatures are explored, including fifth-force tests, DM detections, accelerator searches, and gravitational wave observations by employing lattice simulation. Possible extensions of the scenario are also discussed.\n\n", "2412.17719": "2024-12-23, **Revisiting the Inert Scalar Dark Matter with Vector-like Quarks**, Prasanta Kumar Das et.al., [2412.17719v1](http://arxiv.org/abs/2412.17719v1)\n\n The inert doublet model (IDM), a minimal extension of the Standard Model (SM), provides a scalar dark matter (DM) candidate that belongs to the additional Higgs doublet. The model faces challenges in achieving the correct relic abundance for compressed spectra and DM masses in the high-mass range. In this work we introduce a $Z\\_2$-odd singlet vector-like quark (VLQ) into the IDM framework that helps us alleviate these issues and provide new channels of contributions to the relic abundance. The VLQ not only enhances the DM relic abundance for masses above $~550$ GeV but also eases constraints from direct detection experiments by enabling smaller couplings between the inert scalars and the SM Higgs. We analyze the impact of the VLQ on DM phenomenology, including relic density, direct and indirect detection constraints. The results demonstrate that the extended IDM framework not only resolves existing limitations in the compressed spectrum but also offers exciting prospects for detection in current and future collider experiments.\n\n", "2412.17687": "2024-12-23, **Probing new physics in the era of precision cosmology**, Matteo Forconi et.al., [2412.17687v1](http://arxiv.org/abs/2412.17687v1)\n\n Over the past decades, advancements in observational cosmology have introduced us in an era of precision cosmology, dramatically enhancing our understanding of the Universe's history as well as bringing new tensions to light. Observations of the Cosmic Microwave Background, large-scale structure, and distant galaxies have provided unprecedented insights into the processes that shaped our Universe. This PhD thesis contributes to this research by exploring how these cosmic observables can be leveraged to constrain new physics beyond the standard $\\Lambda$-Cold Dark Matter model.\n\n", "2412.17308": "2024-12-23, **Photonic Freeze-In**, Peter Cox et.al., [2412.17308v1](http://arxiv.org/abs/2412.17308v1)\n\n We present a new scenario of freeze-in, where the dark matter is produced exclusively via the annihilation of photons. We study fermionic and scalar dark matter models with a focus on cosmological histories with low reheat temperatures. Photonic freeze-in can be probed via direct detection, dark matter production in SN1987A, and via the production of new electromagnetically charged states at the Large Hadron Collider. We briefly discuss UV-complete models that can realise this scenario.\n\n"}, "supernova": {"2412.17286": "2024-12-23, **The Unique Helium Nova V445 Puppis Ejected $\\gg$0.001 M$_{\\odot}$ in the Year 2000 and Will Not Become a Type Ia Supernova**, Bradley E. Schaefer et.al., [2412.17286v1](http://arxiv.org/abs/2412.17286v1)\n\n V445 Puppis is the only known example of a helium nova, where a layer of helium-rich gas accretes onto the surface of a white dwarf in a cataclysmic variable, with runaway helium burning making for the nova event. Speculatively, helium nova can provide one path to produce a Type Ia supernova (SNIa), within the larger framework of single-degenerate models. Relatively little has been known about V445 Pup, with this work reporting the discovery of the orbital period near 1.87 days. The companion star is 2.65$\\pm$0.35 R$\\_{\\odot}$ in radius as an evolved giant star stripped of its outer hydrogen envelope. The orbital period immediately before the 2000 eruption was $P\\_{\\rm pre}$=1.871843$\\pm$0.000014 days, with a steady period change of (-0.17$\\pm$0.06)$\\times$10$^{-8}$ from 1896--1995. The period immediately after the nova eruption was $P\\_{\\rm post}$=1.873593$\\pm$0.000034 days, with a $\\dot{P}$ of ($-$4.7$\\pm$0.5)$\\times$10$^{-8}$. The fractional orbital period change ($\\Delta P/P$) is $+$935$\\pm$27 ppm. This restricts the mass of the gases ejected in the nova eruption to be $\\gg$0.001M$\\_{\\odot}$, and much greater than the mass accreted to trigger the nova. So the white dwarf is losing mass over each eruption cycle, and will not become a SNIa. Further, for V445 Pup and helium novae in general, I collect observations from 136 normal SNIa, for which any giant or sub-giant companion star would have been detected, yet zero companions are found. This is an independent proof that V445 Pup and helium novae are not SNIa progenitors.\n\n"}}