{"neutrino": {"2509.06857": "2025-09-08, **Stochastic modelling of cosmic-ray sources for Galactic diffuse emissions**, Anton Stall et.al., [2509.06857v1](http://arxiv.org/abs/2509.06857v1)\n\n Galactic diffuse emissions in gamma rays and neutrinos arise from interactions of cosmic rays with the interstellar medium and probe the cosmic-ray intensity away from the Solar system. Model predictions for those are influenced by the properties of cosmic-ray sources, and understanding the impact of cosmic-ray sources on Galactic diffuse emissions is key for interpreting measurements by LHAASO, Tibet AS-gamma, IceCube, and the upcoming SWGO. We consider supernova remnants as prototypical cosmic-ray sources and study the impact of their discreteness on the Galactic diffuse emissions in different source injection and near-source transport models in a stochastic Monte Carlo study. Three lessons exemplify the results of our simulations: First, the distributions of Galactic diffuse emission intensities can be described by a mixture model of stable laws and Gaussian distributions. Second, the maximal deviations caused by discrete sources across the sky depend on energy, reaching typically tens of percent in burst-like and energy-dependent escape scenarios but order unity or larger in a time-dependent diffusion scenario. Third, the additional model uncertainty from source stochasticity is subdominant in burst-like and energy-dependent escape scenarios, but becomes sizeable above some tens of TeV in the time-dependent diffusion scenario, where it can help reconcile model predictions with LHAASO measurements. With increased spatial resolution, especially at energies beyond tens of TeV, measurements of Galactic diffuse emissions can be expected to constrain source models and locate cosmic ray sources.\n\n", "2509.06699": "2025-09-08, **Magnetic, thermal and rotational evolution of isolated neutron stars**, José A. Pons et.al., [2509.06699v1](http://arxiv.org/abs/2509.06699v1)\n\n The strong magnetic fields of neutron stars are closely linked to their observed thermal, spectral, and timing properties, such as the distribution of spin periods and their derivatives. To understand the evolution of astrophysical observables over time, it is essential to develop robust theoretical frameworks and numerical models that solve the coupled thermal and magnetic field evolution equations, incorporating detailed microphysical inputs like thermal and electrical conductivities and neutrino emission rates. These efforts are key to uncovering how the strength and geometry of magnetic fields change with age, ultimately shedding light on the diverse phenomenology of neutron stars. In this review, we outline the fundamental theory underlying magneto-thermal evolution models, with an emphasis on numerical methods and a comprehensive set of benchmark tests intended to guide current and future code development. We revisit established results from axisymmetric simulations, highlight recent progress in fully three-dimensional models, and offer a perspective on the anticipated developments in this rapidly evolving field.\n\n", "2509.06668": "2025-09-08, **Transient Observations with LST-1: Key Results and Future Prospects**, Monica Seglar-Arroyo et.al., [2509.06668v1](http://arxiv.org/abs/2509.06668v1)\n\n The recent detections of the afterglow phase of long gamma-ray bursts (lGRBs) at very high energies (VHE, >100 GeV) mark a significant advance in astrophysics of transient phenomena, offering deeper insights into the acceleration mechanisms, jet structure, and physical processes driving GRB emission. In the multi-messenger landscape, both high-energy neutrino and gravitational wave detections are providing new insights into the physics of extreme cosmic accelerators and highlighting the need for rapid and broadband follow-up observations. The Large-Sized Telescope (LST-1), the first telescope of the LST array, part of the Cherenkov Telescope Array Observatory (CTAO) North site, is particularly well-suited for real-time, rapid follow-up of transients. In this contribution, we present the latest achievements of the transient observational program with LST-1, which is now in advanced commissioning on La Palma, Canary Islands. We outline the observational strategies in place and describe the dynamic handling of events by the transient handler of LST-1 (e.g., its ability to handle poorly localised events, including gravitational waves, GRBs and neutrinos). We present the key results from transient observation campaigns conducted so far, discuss the lessons learned, and outline the promising prospects for the future LST-1+MAGIC combined transient program with fast response, via a Transient Handler.\n\n", "2509.06141": "2025-09-07, **The Optical and Mechanical Design of POEMMA Balloon with Radio**, Eric Mayotte et.al., [2509.06141v1](http://arxiv.org/abs/2509.06141v1)\n\n POEMMA Balloon with Radio (PBR) is a NASA super-pressure balloon mission building toward the proposed Probe Of Extreme Multi-Messenger Astrophysics (POEMMA) dual satellite mission. In its planned 2027 launch, PBR will study Ultra-High-Energy Cosmic Rays, Neutrinos, and High-Altitude Horizontal Airshowers from 33 km above the Earth. By operating at balloon altitudes, PBR will provide a novel vantage point to study air-shower physics while offering competitive instantaneous exposure to neutrinos from transient astrophysical phenomena. The payload's optical instrument is a 0.95 m$^2$ aperture hybrid Schmidt telescope with a 3.81 m$^2$ segmented mirror focusing light onto a Fluorescence Camera and a bi-focalized Cherenkov Camera. The payload will also feature a Radio Instrument consisting of two sinuous antennas based on the Payload for Ultrahigh Energy Observations (PUEO) low-frequency instrument. A combined gamma ray/x-ray detector and IR cloud camera round out the instrumentation package, meaning PBR will be the first multi-hybrid balloon-borne multi-messenger observatory flown. This extensive instrumentation must be combined into a radio quiet payload that satisfies the scientific needs and can operate in near vacuum at extreme temperatures, all while meeting NASA safety requirements and weighing no more than 3000 lbs (1361 kg). Accomplishing these tasks together will mark a significant step toward establishing technological readiness for the POEMMA satellite mission. We present an overview of PBR's mechanical and optical systems, additionally detailing our strategies to mitigate electromagnetic interference for the radio instrument and prepare for the harsh near-space environment.\n\n", "2509.05973": "2025-09-07, **Long-term neutrino emission from a core-collapse supernova with axion-photon coupling**, Masamitsu Mori et.al., [2509.05973v1](http://arxiv.org/abs/2509.05973v1)\n\n We perform long-term general-relativistic neutrino-radiation hydrodynamic simulations for core-collapse supernovae (CCSNe) which include the cooling effect induced by the coupling between axion-like particles (ALPs) and photons. We take into account the \\kanji{photon} coalescence and the Primakoff effect, and investigate ALPs with the mass of 10\\,MeV and the coupling constant $g\\_{a\\gamma}$ of $1.0\\times10^{-9}{\\rm \\,GeV^{-1}}$ to $7.0\\times10^{-9}{\\rm \\,GeV^{-1}}$. It is found that the effects of the ALP cooling emerge in the late phase rather than the early phase and the ALP luminosities are always lower than the neutrino luminosity in our simulations. We estimate the number of neutrino events for Super-Kamiokande assuming a 10\\,kpc CCSN. We conclude that signatures of ALPs could be found in the long-term neutrino signals from a nearby CCSN event in the future, even if $g\\_{a\\gamma}$ is below an upper limit based on the conventional energy-loss argument.\n\n"}, "dark matter": {"2509.06955": "2025-09-08, **Constraints on Dark Matter Models from Supermassive Black Hole Evolution**, John Ellis et.al., [2509.06955v1](http://arxiv.org/abs/2509.06955v1)\n\n A semi-analytical model for the evolution of galaxies and supermassive black holes (SMBHs) within the $\\Lambda$CDM paradigm has been shown to yield stellar mass-BH mass relations that reproduce both the JWST and pre-JWST observations. Either fuzzy or warm dark matter (FDM or WDM) would suppress the formation of the smaller galactic halos that play important roles in the CDM fit to the high-redshift SMBH data. Our analysis of the stellar mass-BH mass relation disfavours FDM fields with masses $< 2.0\\times 10^{-20}$ eV and WDM particles with masses $< 7.2$ keV, both at the 95 % confidence level.\n\n", "2509.06943": "2025-09-08, **First Production of Skipper-CCD Modules for the DAMIC-M Experiment**, H. Lin et.al., [2509.06943v1](http://arxiv.org/abs/2509.06943v1)\n\n The DAMIC-M experiment will search for sub-GeV dark matter particles with a large array of silicon skipper charge-coupled devices (CCDs) at the Modane Underground Laboratory (LSM) in France. After five years of development, we recently completed the production of 28 CCD modules at the University of Washington, each consisting of four 9-megapixel skipper CCDs. Material screening and background controls were implemented to meet stringent radio-purity targets, while extensive testing was employed to select science-grade CCDs for the modules and confirm their excellent performance after fabrication. Further testing at LSM will select 26 of these modules (${\\sim}$350 g active mass) to be installed and operated in the DAMIC-M detector in early 2026.\n\n", "2509.06892": "2025-09-08, **Asymmetric Cannibal Dark Matter: Constraints from Neutron Star**, Ujjal Kumar Dey et.al., [2509.06892v1](http://arxiv.org/abs/2509.06892v1)\n\n Asymmetric dark matter can be efficiently captured by neutron stars via elastic scattering with nucleons and dark matter self scattering. The accumulated dark matter thermalizes and concentrates in the stellar interior, forming a dark matter core. In this work, we propose a novel framework in which a $\\mathbb{Z}\\_3$ symmetry allows for number-changing self-interactions of the form $3 \\rightarrow 2$ within the dark sector. These cannibalistic reactions become increasingly efficient at high dark matter densities, leading to a significant depletion of the dark matter population in the stellar core. This number depletion heats up the neutron star above the standard cooling expectations, yielding observable thermal signatures in relatively old, isolated neutron stars, potentially detectable via James Webb Space Telescope. We show that even in the presence of other heating mechanisms, e.g. dark matter annihilation and kinetic heating, the cannibal heating dominates for certain parameter space. We demonstrate that the cannibal heating can predict detectable heating signatures in old neutron stars, thereby allowing a broader range of viable dark matter masses and couplings to the Standard Model.\n\n", "2509.06805": "2025-09-08, **Euclid preparation. Methodology for validating the Euclid Catalogue of Galaxy Clusters using external data**, Euclid Collaboration et.al., [2509.06805v1](http://arxiv.org/abs/2509.06805v1)\n\n We present our methodology for identifying known clusters as counterparts to objects in the Euclid Catalogue of Galaxy Clusters (ECGC). Euclid is expected to detect a large number of optically-selected galaxy clusters over the approximately 14000 square degrees of its extragalactic sky survey. Extending out well beyond redshift unity, the catalogue will contain many new high-redshift clusters, while at lower redshifts a fraction of the clusters will have been observed in other surveys. Identifying these known clusters as counterparts to the Euclid-detected clusters is an important step in the validation and construction of the ECGC to augment information with external observables. We present a set of catalogues and meta-catalogues of known clusters that we have assembled for this step, and we illustrate their application and our methodology using the Dark Energy Survey Year 1 RedMaPPer cluster catalogue in lieu of the future ECGC. In the process of this work, we have constructed and deliver an updated EC-RedMaPPer catalogue with multi-wavelength counterparts.\n\n", "2509.06788": "2025-09-08, **An Interpretable AI Framework to Disentangle Self-Interacting and Cold Dark Matter in Galaxy Clusters: The CKAN Approach**, Zhenyang Huang et.al., [2509.06788v1](http://arxiv.org/abs/2509.06788v1)\n\n Convolutional neural networks have shown their ability to differentiate between self-interacting dark matter (SIDM) and cold dark matter (CDM) on galaxy cluster scales. However, their large parameter counts and ''black-box'' nature make it difficult to assess whether their decisions adhere to physical principles. To address this issue, we have built a Convolutional Kolmogorov-Arnold Network (CKAN) that reduces parameter count and enhances interpretability, and propose a novel analytical framework to understand the network's decision-making process. With this framework, we leverage our network to qualitatively assess the offset between the dark matter distribution center and the galaxy cluster center, as well as the size of heating regions in different models. These findings are consistent with current theoretical predictions and show the reliability and interpretability of our network. By combining network interpretability with unseen test results, we also estimate that for SIDM in galaxy clusters, the minimum cross-section $(\\sigma/m)\\_{\\mathrm{th}}$ required to reliably identify its collisional nature falls between $0.1\\,\\mathrm{cm}^2/\\mathrm{g}$ and $0.3\\,\\mathrm{cm}^2/\\mathrm{g}$. Moreover, CKAN maintains robust performance under simulated JWST and Euclid noise, highlighting its promise for application to forthcoming observational surveys.\n\n", "2509.06728": "2025-09-08, **Self-resonant dark matter with $Z_4$ gauged symmetry**, Lucca Radicce Justino et.al., [2509.06728v1](http://arxiv.org/abs/2509.06728v1)\n\n We present a new model for two-component scalar dark matter (DM), consisting of two complex scalar fields. In this model, both the DM components are stable due to the remaining $Z\\_4$ gauge symmetry, which is the remnant of the $U(1)^\\prime$ local symmetry. When the resonance condition for DM masses is fulfilled, we show that the elastic co-scattering processes between two components of dark matter ($u$-channel processes) are enhanced due to the Yukawa potential with a small effective mass for the lighter DM mediator, so we can use such co-scattering processes for dark matter to explain the small-scale problems at galaxies. Moreover, there are also semi-annihilation processes that two components of dark matter annihilate into one dark matter particle and a dark photon/Higgs, which are enhanced by the $u$-channel Sommerfeld factor. Focusing on some benchmark models for two-component dark matter satisfying the observed relic density, we obtain the bounds for the dark photon portal couplings from the direct detection for boosted dark matter, which is produced from the semi-annihilation processes at the galactic center.\n\n", "2509.06684": "2025-09-08, **Core or Halo? Two-Fluid Analysis of Dark Matter-Admixed Quarkyonic Stars in the Multi-Messenger Era**, Jeet Amrit Pattnaik et.al., [2509.06684v1](http://arxiv.org/abs/2509.06684v1)\n\n For the first time, we explore dark matter (DM) admixed quarkyonic stars (DAQSs) within a two-fluid formalism, where the normal/visible sector is modeled by a quarkyonic equation of state (EOS) in the Effective Relativistic Mean Field (E-RMF) framework and the DM component is treated as a degenerate fermionic gas with scalar and vector self-interactions. Our analysis begins with the mass-radius (M-R) relation, showing that the inclusion of DM enables stellar configurations to reach the mass range compatible with the GW190814 event. We identify both DM core and DM halo morphologies among the viable EOSs, with core dominated and halo dominated cases exhibiting distinct signatures. By fixing the stellar mass within the GW190814 range, we constrain the possible dark matter fractions and explore the role of different interaction channels. Using the EOSs consistent with these constraints, we further investigate the tidal deformability ($\\Lambda$), moment of inertia (MOI), and stellar radius, finding broad agreement with constraints from GW170817, GW190814, and NICER. Finally, we compile the characteristic properties of DAQSs, including EOS type, DM fractions, morphology (core vs halo), and macroscopic observables in a comparative summary. This study provides a unified two-fluid framework to explore dense QCD matter and dark matter in the multi-messenger era, suggesting that the GW190814 secondary object could plausibly be interpreted as either a DM core or a DM halo quarkyonic star.\n\n", "2509.06628": "2025-09-08, **The complementary of CTAO, direct detection and collider searches for dark matter in Effective Field Theories and Simplified models**, Igor Reis et.al., [2509.06628v1](http://arxiv.org/abs/2509.06628v1)\n\n This paper explores the sensitivity of the Cherenkov Telescope Array Observatory to dark matter annihilation in the Galactic Center, within the frameworks of Effective Field Theory and Simplified Models. We present sensitivity forecasts, utilizing an up-to-date instrument configuration and incorporating the latest models for Galactic Diffuse Emission. A key aspect of our work is the inclusion of updated dark matter density profiles, J-factors, and velocity dispersion distributions derived from the FIRE-2 cosmological hydrodynamical simulations, which significantly impact the expected indirect detection signals. Furthermore, we update the constraints from direct detection experiments (Xenon1T and LZ) taking into account the astrophysical uncertainties informed by the FIRE-2 simulations, and also investigate limits coming from collider searches (ATLAS and CMS). Our analysis reveals improved constraints on the effective suppression scale ($M\\_*$) in the Effective Field Theory framework and on the mediator mass ($M\\_{med}$) in Simplified Models compared to previous studies, highlighting the complementarity of the Cherenkov Telescope Array Observatory with direct and collider searches in probing a wide range of dark matter scenarios. We discuss the implications of these results for various dark matter interaction types, including scalar, pseudoscalar, vector, and axial-vector mediators, and emphasize the importance of considering realistic astrophysical inputs in interpreting dark matter search results across different experimental fronts.\n\n", "2509.06398": "2025-09-08, **First searches for axion and dark photon dark matter with MADMAX**, Fabrice Hubaut et.al., [2509.06398v1](http://arxiv.org/abs/2509.06398v1)\n\n The MAgnetized Disk and Mirror Axion eXperiment (MADMAX) is a future experiment aiming to detect dark matter axions from the galactic halo by resonant conversion to photons in a strong magnetic field. It uses a novel concept based on a stack of dielectric disks in front of a mirror, called booster, to enhance the potential signal from axion-photon conversion over a significant mass range. In its final version, MADMAX aims to scan the uncharted QCD axion mass range around 100 $\\mu$eV, favored by post-inflationary theories. Several small scale prototype systems have been tested these last three years, allowing to validate the dielectric haloscope concept and perform competitive axion and dark photon dark matter searches. This contribution presents the current status of the experiment and its prototypes, including the results achieved so far, the ongoing research and development and the remaining challenges.\n\n", "2509.06210": "2025-09-07, **Search for Signatures of Dark Matter Annihilation in the Galactic Center with HAWC**, R. Alfaro et.al., [2509.06210v1](http://arxiv.org/abs/2509.06210v1)\n\n We conduct an indirect dark matter (DM) search in the Galactic Center, focusing on a square region within $\\pm 9^{\\circ}$ in Galactic longitude and latutide, using 2,865 days of data ($\\sim$8 years) from the High-Altitude Water Cherenkov (HAWC) Observatory. We explore DM particles within the Weakly Interacting Massive Particles framework with masses from 1 TeV to 10 PeV. Analyzing three annihilation channels ($b\\bar{b}$, $\\tau^{+}\\tau^{-}$, $W^{+}W^{-}$) and three density profiles (Navarro-Frenk-White, Einasto, Burkert), we find no significant excess and set 95\\% confidence-level upper limits on the velocity-weighted annihilation cross section. Our results provide the first constraints on DM particles well above 100 TeV using gamma-ray data from the Galactic Center, with the strongest limits $\\mathcal{O}(10^{-24})$~cm$^{3}$/s, from the $\\tau^{+}\\tau^{-}$ channel and the Einasto profile.\n\n", "2509.05910": "2025-09-07, **Solar--System Experiments in the Search for Dark Energy and Dark Matter**, Slava G. Turyshev et.al., [2509.05910v1](http://arxiv.org/abs/2509.05910v1)\n\n We reassess the realistic discovery reach of Solar--System experiments for dark energy (DE) and dark matter (DM) and quantify their complementarity to dedicated cosmological probes, such as the Dark Energy Spectroscopic Instrument (DESI) and Euclid mission. In scalar-tensor frameworks with universal conformal coupling $A(\\phi)$, screening (chameleon/symmetron, Vainshtein) suppresses fifth forces in deep Solar potentials, consistent with the gravitational-wave speed bound $\\|c\\_{\\tt T}/c-1\\|\\lesssim 10^{-15}$. We treat Solar--System tests as hypothesis-driven probes: we assemble quantitative guardrails (MICROSCOPE $\\eta$, Cassini $\\gamma$, LLR $\\dot G/G$ and SEP, ephemeris limits on $\\rho\\_{\\rm DM}$ and Yukawa $\\alpha(\\lambda)$, and clock-network searches for ultralight DM), place them alongside current cosmology posteriors, and provide an explicit map from cosmology-level linear response (e.g., $\\mu\\_{\\rm lin,0}$) to local residuals using the screening relations (thin--shell and Vainshtein). Guided by systematics-gated criteria, we outline a near-term program -- solar-conjunction Shapiro-delay and Doppler/range tests, sustained millimeter-class LLR, global optical-clock links, refined ephemerides, and spaceborne atom interferometry (AIS) -- with realistic sensitivities $\\|\\gamma-1\\|\\in (2$--$5)\\times 10^{-6}$, $\\eta\\_{\\rm EEP}\\sim10^{-16}$--$10^{-17}$ (AIS/LLR), $\\|\\dot{G}/G\\|\\lesssim (2$--$5)\\times 10^{-14}\\,\\mathrm{yr}^{-1}$, a uniform $\\simeq 2\\times$ tightening of AU-scale Yukawa/DM-density bounds, and $3$--$10\\times$ gains in ultralight-DM couplings from clock networks. Primary discovery potential for late-time dark energy lies with multi-probe cosmology (geometry and growth), while a hypothesis-driven Solar--System program supplies high-leverage falsification and selective discovery windows for dark matter with ultralight mediators or long-range forces.\n\n"}, "supernova": {"2509.06787": "2025-09-08, **Detection of a septuple stellar system in formation via disk fragmentation**, Shanghuo Li et.al., [2509.06787v1](http://arxiv.org/abs/2509.06787v1)\n\n Stellar multiple systems play a pivotal role in cluster dynamics and stellar evolution, leading to intense astronomical phenomena like X-ray binaries, gamma-ray bursts, Type Ia supernova, and stellar mergers, which are prime sources of gravitational waves. However, their origin remains poorly understood. Here we report the discovery of a septuple protostellar system embedded in a Keplerian disk within the high-mass star-forming region NGC\\,6334IN, with close separations of 181-461 AU. The stability analysis reveals that the disk surrounding the septuple system is dynamically unstable, indicating that the septuple system formed via disk fragmentation. Previous studies have typically found only 2--3 members forming via disk fragmentation in both low- and high-mass star-forming regions. Our findings provide compelling observational evidence that the fragmentation of a gravitationally unstable disk is a viable mechanism for the formation of extreme high-order multiplicity, confirming what was previously only a theoretical concept. The results shed new light on the formation of extreme high-order multiplicity in cluster environments.\n\n", "2509.06526": "2025-09-08, **Metallicity differences between Type IIP and stripped-envelope supernova environments**, R. Ganss et.al., [2509.06526v1](http://arxiv.org/abs/2509.06526v1)\n\n This work presents measurements of local HII environment metallicities of core-collapse supernovae (SNe) in hosts with redshifts up to z$\\sim$0.025. 139 SNe environments were observed at the Isaac Newton Telescope and data of an additional 268 SNe environments were found in archival data of MUSE, MaNGA and PISCO. The project focuses on SNe with clean Type IIP, Type Ib and Type Ic classifications. We present the largest spectroscopic sample to date, evaluating environment metallicities of 79 Type Ib, 66 Type Ic and 93 Type IIP by N2 and O3N2 strong emission line methods. The cumulative distribution functions (CDFs) of the SN environment metallicities show Type Ib and Type Ic SNe tending towards higher metallicity than Type IIP. We test the null hypothesis that Type Ib/Ic/IIP progenitors are drawn from the same parent population. There is no statistically significant difference between progenitors of Type Ib and Type Ic SNe. However, when comparing Ib/Ic with IIP SNe, the tests indicate strong statistical significance (significance level better than 1\\%) to reject our null hypothesis suggesting that the samples are not drawn from the same parent population. The significance is even higher (level better 0.1\\%) when testing Type IIP vs. the combined Type Ib+Ic sample. These results support a different physical nature of Type IIP and Types Ib/Ic progenitors. It challenges stellar evolution and SNe explosion models to reproduce the distinct CDFs found.\n\n"}}