{"neutrino": {"2502.18268": "2025-02-25, **The cosmic-ray sea explains the diffuse Galactic gamma-ray and neutrino emission from GeV to PeV**, Pedro De La Torre Luque et.al., [2502.18268v1](http://arxiv.org/abs/2502.18268v1)\n\n The LHAASO collaboration has recently released the spectrum and the angular distribution of the $\\gamma$-ray Galactic diffuse emission from 1 TeV to 1 PeV measured with the Kilometer-2 Array (KM2A) and Water Cherenkov Detector Array (WCDA). We show that these data are in remarkably good agreement with a set of models that assume the emission to be produced by the Galactic population of cosmic rays if its spectral shape traces that measured by CALET and DAMPE as well as KASCADE at higher energies. No extra-components besides the CR sea is needed to explain LHAASO results. Accounting for unresolved sources, we consistently reproduce Tibet AS$\\gamma$ as well as a wide set of $\\gamma$-ray data at lower energy. To do this, we consider two different transport setups: a conventional one and a $\\gamma$-optimized spatial-dependent one (a development of the widely adopted KRA$\\_\\gamma$ model). We demonstrate that both setups are compatible with LHAASO results. However, the latter is preferred if one takes into account Fermi-LAT gamma-ray data and neutrino measurements. In fact, we also compute the associated Galactic neutrino diffuse emission finding that the contribution from sources cannot be dominant and showing that spatial-dependent propagation models closely match the ANTARES and IceCube best fits for the Galactic Center Ridge and the Galactic Plane emissions. We argue that our $\\gamma$-optimized model should be used as a template for future analyses of upcoming data from the Global Neutrino Network.\n\n", "2502.18256": "2025-02-25, **Constraints on Lorentz invariance violation in neutrino sector from the ultra-high-energy event KM3-230213A**, Yu-Ming Yang et.al., [2502.18256v1](http://arxiv.org/abs/2502.18256v1)\n\n Lorentz invariance is a fundamental symmetry of spacetime and serves as the cornerstone of modern physics, supporting the constancy of the speed of light. A crucial implication of this principle is that no particle can propagate faster than this universal speed limit. In this study, we present a stringent neutrino-based test of Lorentz invariance, utilizing the highest-energy neutrino ever detected, known as event KM3-230213A. The detection of this neutrino, with measured energy of approximately 220 PeV, allows us to establish a lower bound on the scale of second-order Lorentz invariance violation, quantified as \\(\\Lambda\\_2>5.0\\times 10^{19}\\) GeV at 90 \\% confidence level.\n\n", "2502.18175": "2025-02-25, **Muon-decay parameters from COHERENT**, Víctor Bresó-Pla et.al., [2502.18175v1](http://arxiv.org/abs/2502.18175v1)\n\n We demonstrate that measurements of Coherent Elastic Neutrino-Nucleus Scattering (CE$\\nu$NS) at spallation sources are valuable probes of muon-decay physics. Using COHERENT data we derive the first direct constraint on the Michel parameters governing the $\\bar\\nu\\_\\mu$ energy distribution. We also discuss future sensitivities and assess the implications for the Lorentz structure of the interactions mediating muon decay.\n\n", "2502.18130": "2025-02-25, **Lepton flavor violating decays $l_j\\rightarrow l_iγ$, $l_j \\rightarrow 3l_i$ and $μ\\rightarrow e+ q\\bar q$ in the N-B-LSSM**, Rong-Zhi Sun et.al., [2502.18130v1](http://arxiv.org/abs/2502.18130v1)\n\n The N-B-LSSM is an extension of the minimal supersymmetric standard model (MSSM) with the addition of three singlet new Higgs superfields and right-handed neutrinos, whose local gauge group is $SU(3)\\_C\\times SU(2)\\_L\\times U(1)\\_Y\\times U(1)\\_{B-L}$. In the N-B-LSSM, we study lepton flavor violating decays $l\\_j\\rightarrow l\\_i\\gamma$, $l\\_j \\rightarrow 3l\\_i$ and $\\mu\\rightarrow e+ q\\bar q$ $(j=\\tau,\\mu,~i=\\mu,e$ and $i\\neq j)$. Based on the current experimental limitations, we carry out detailed parameter scanning and numerical calculations to analyse the effects of different sensitive parameters on lepton flavor violation (LFV) in the N-B-LSSM. The numerical results show that the non-diagonal elements involving the initial and final leptons are main sensitive parameters and LFV sources. This work can provide a strong basis for exploring new physics (NP) beyond the Standard Model (SM).\n\n", "2502.18029": "2025-02-25, **Unified neutrino mixing and approximate $μ$-$τ$ reflection symmetry**, Yuta Hyodo et.al., [2502.18029v1](http://arxiv.org/abs/2502.18029v1)\n\n We investigate the phenomenology of a unified neutrino mixing framework, which serves as the origin of well-known neutrino mixing schemes such as the tribimaximal mixing (TBM), bimaximal mixing (BM), golden ratio mixing (GRM) and hexagonal mixing (HM). Our analysis reveals that the predicted sum of neutrino masses derived from an approximate $\\mu$-$\\tau$ reflection symmetric flavor neutrino mass matrix based on the unified neutrino mixing with an inverted mass ordering, is excluded from DESI2024 and Supernova Ia luminosity distance data. This conclusion implies that TBM, BM, GRM, and HM, under an approximate $\\mu$-$\\tau$ reflection symmetry with an inverted mass ordering of neutrinos, are also excluded from observations.\n\n", "2502.17890": "2025-02-25, **Seasonal Variations of the Atmospheric Muon Neutrino Spectrum measured with IceCube**, R. Abbasi et.al., [2502.17890v1](http://arxiv.org/abs/2502.17890v1)\n\n This study presents an energy-dependent analysis of seasonal variations in the atmospheric muon neutrino spectrum, using 11.3 years of data from the IceCube Neutrino Observatory. By leveraging a novel spectral unfolding method, we explore the energy range from 125 GeV to 10 TeV for zenith angles between 90{\\deg} to 110{\\deg}, corresponding to the Antarctic atmosphere. Our findings reveal that the seasonal variation amplitude decreases with energy reaching ($-4.6 \\pm 1.1$)\\% during Austral winter and increases ($+3.9 \\pm 1.2$)\\% during Austral summer relative to the annual average at 10TeV. While the unfolded flux exceeds the model predictions by up to 30\\%, the differential measurement of seasonal variations remains unaffected. The measured seasonal variations of the muon neutrino spectrum are consistent with theoretical predictions using the MCEq code and the NRLMSISE-00 atmospheric model.\n\n"}, "dark matter": {"2502.18263": "2025-02-25, **Exploring sub-GeV dark matter via $s$-wave, $p$-wave, and resonance annihilation with CMB data**, Yu-Ning Wang et.al., [2502.18263v1](http://arxiv.org/abs/2502.18263v1)\n\n We revisit constraints on sub-GeV dark matter (DM) annihilation via $s$-wave, $p$-wave, and resonance processes using current and future CMB data from Planck, FIRAS, and upcoming experiments as LiteBird, CMB-S4, PRISTINE, and PIXIE. For $s$-wave annihilation, we provide updated limits for both $e^{+}e^{-}$ and $\\pi\\pi$ channels, with the profile likelihood method yielding stronger constraints than marginal posterior method. In the $p$-wave case, we comprehensively conduct a model-independent inequality for the 95\\% upper limits from FIRAS, PRISTINE, and PIXIE, with future experiments expected to surpass current BBN limits. For resonance annihilation, we report -- for the first time -- the $95\\%$ upper limits on the decay branching ratio of the mediator particle, when resonances peak during the recombination epoch. Overall, our study highlights the complementary strengths of $\\mu$-distortion and CMB anisotropies in probing sub-GeV DM annihilation.\n\n", "2502.18193": "2025-02-25, **Emergence of running vacuum energy in $f(R,T)$ gravity : Observational constraints**, Ahmed Errahmani et.al., [2502.18193v1](http://arxiv.org/abs/2502.18193v1)\n\n In this work, we present a new analysis for $f(R,T)$ gravity by exploring the energy momentum tensor. We demonstrate that $f(R,T)$ gravity with the form $f(R,T)=R+2 \\kappa^2 \\lambda T-2\\Lambda$ is equivalent to Running Vacuum Energy (RVE), which interacts with the components of the cosmic fluid, namely dark matter and radiation. Interestingly, the form of such interaction is inferred from the non-conservation of the stress energy tensor in $f(R, T)$ gravity rather than being introduced in a phenomenological manner. Furthermore, the parameters that distinguish RVE from $\\Lambda$CDM are fixed once the parameter of $f(R,T)$ gravity, $\\lambda$, is known. To illustrate our setup, we perform a Markov Chain Monte Carlo analysis of three interaction scenarios using a combination of different data. we find that the parameters characterizing the RVE model are very small as expected. These results give an accuracy to this equivalence between $f(R,T)$ gravity under consideration and support the recent result obtained from a quantum field theory in curved space-time point of view which could open a new relationship between $f(R,T)$ gravity and quantum field theory. Finally, the interaction of the running vacuum increases the value of the current value of the Hubble rate by $3.5\\%$ compared to the $\\Lambda$CDM model, which may be a promising study for the Hubble tension.\n\n", "2502.18005": "2025-02-25, **WIMP Dark Matter Search using a 3.1 tonne $\\times$ year Exposure of the XENONnT Experiment**, E. Aprile et.al., [2502.18005v1](http://arxiv.org/abs/2502.18005v1)\n\n We report on a search for weakly interacting massive particle (WIMP) dark matter (DM) via elastic DM-xenon-nucleus interactions in the XENONnT experiment. We combine datasets from the first and second science campaigns resulting in a total exposure of $3.1\\;\\text{tonne}\\times\\text{year}$. In a blind analysis of nuclear recoil events with energies above $3.8\\,\\mathrm{keV\\_{NR}}$, we find no significant excess above background. We set new upper limits on the spin-independent WIMP-nucleon scattering cross-section for WIMP masses above $10\\,\\mathrm{GeV}/c^2$ with a minimum of $1.7\\,\\times\\,10^{-47}\\,\\mathrm{cm^2}$ at $90\\,\\%$ confidence level for a WIMP mass of $30\\,\\mathrm{GeV}/c^2$. We achieve a best median sensitivity of $1.4\\,\\times\\,10^{-47}\\,\\mathrm{cm^2}$ for a $41\\,\\mathrm{GeV}/c^2$ WIMP. Compared to the result from the first XENONnT science dataset, we improve our sensitivity by a factor of up to 1.8.\n\n", "2502.17948": "2025-02-25, **Rapidly spinning dark matter-admixed neutron stars**, Lorenzo Cipriani et.al., [2502.17948v2](http://arxiv.org/abs/2502.17948v2)\n\n Millisecond pulsars, representing the older neutron star population, are believed to have undergone a prolonged period of dark matter accumulation, resulting in a higher dark matter content. Their extreme rotation makes them unique laboratories for studying rapidly rotating neutron stars admixed with dark matter. In this work, we model uniformly rotating neutron stars with a dark matter component that rotates independently from the baryon matter, allowing for the investigation of both co-rotating and counter-rotating scenarios. We examine the impact of dark matter rotation on the macroscopic properties of neutron stars, including the mass-radius relation, the mass-shedding Keplerian limit, and moments of inertia, for various dark matter particle masses and total fractions, considering both core and halo distributions. Our findings provide a more comprehensive understanding of how dark matter influences the equilibrium properties of rotating neutron stars, offering new insights into the astrophysical implications of self-interacting dark matter.\n\n", "2502.17792": "2025-02-25, **Cosmological constraints on two vacuum decay models**, Yupeng Yang et.al., [2502.17792v1](http://arxiv.org/abs/2502.17792v1)\n\n We constrain two vacuum decay models ($\\Lambda(t)$CDM, proposed by the authors of~\\cite{Brito:2024bhh}) utilizing the baryon acoustic oscillations (BAO) data released by the Dark Energy Spectroscopic Instrument (DESI), distance prior from the cosmic microwave background (CMB) observed by the Planck satellite, Hubble rate data obtained via the cosmic chronometers (CC) method and type Ia supernova (SNIa) data. The interaction terms between dark matter and dark energy are defined as $Q=3\\varepsilon H\\rho\\_{\\Lambda}$ for model I and $3\\varepsilon aH\\rho\\_{\\Lambda}$ for model II. We find that the decay parameter is constrained to be $\\varepsilon=0.0094^{+0.0037}\\_{-0.0033}$ for model I and $\\varepsilon=0.0119\\pm{0.0045}$ for model II, respectively, indicating a potential interaction between dark matter and dark energy at the $2\\sigma$ confidence level. The current Hubble parameter values are estimated to be $H\\_{0}=70.30\\pm{0.67}$ for model I and $H\\_{0}=70.28\\pm{0.64}$ for model II. These values of $H\\_0$ fall between those derived from the Planck and SH0ES data, suggesting that these two vacuum decay models could provide a potential solution to alleviate the Hubble tension problem.\n\n", "2502.17778": "2025-02-25, **STQS: A Unified System Architecture for Spatial Temporal Quantum Sensing**, Anastashia Jebraeilli et.al., [2502.17778v1](http://arxiv.org/abs/2502.17778v1)\n\n Quantum sensing (QS) harnesses quantum phenomena to measure physical observables with extraordinary precision, sensitivity, and resolution. Despite significant advancements in quantum sensing, prevailing efforts have focused predominantly on refining the underlying sensor materials and hardware. Given the growing demands of increasingly complex application domains and the continued evolution of quantum sensing technologies, the present moment is the right time to systematically explore distributed quantum sensing architectures and their corresponding design space.   We present STQS, a unified system architecture for spatiotemporal quantum sensing that interlaces four key quantum components: sensing, memory, communication, and computation. By employing a comprehensive gate-based framework, we systemically explore the design space of quantum sensing schemes and probe the influence of noise at each state in a sensing workflow through simulation. We introduce a novel distance-based metric that compares reference states to sensing states and assigns a confidence level. We anticipate that the distance measure will serve as an intermediate step towards more advanced quantum signal processing techniques like quantum machine learning. To our knowledge, STQS is the first system-level framework to integrate quantum sensing within a coherent, unified architectural paradigm. STQS provides seamless avenues for unique state preparation, multi-user sensing requests, and addressing practical implementations. We demonstrate the versatility of STQS through evaluations of quantum radar and qubit-based dark matter detection. To highlight the near-term feasibility of our approach, we present results obtained from IBM's Marrakesh and IonQ's Forte devices, validating key STQS components on present day quantum hardware.\n\n"}, "supernova": {"2502.17902": "2025-02-25, **Dissecting the formation of gas-versus-star counter-rotating galaxies from the NewHorizon simulation**, S. Peirani et.al., [2502.17902v1](http://arxiv.org/abs/2502.17902v1)\n\n (Reduced) Using the NewHorizon simulation, we have studied ten gas-versus-star counter-rotating galaxies in field environments with a stellar mass of M*~[1-5]x10^10 Msun. For all of them, the retrograde accretion of gas either from gas stripping from a nearby companion or from the circumgalactic medium is the starting point of the formation process. Then follows the co-existence of two distinct disks of gas rotating in opposite directions, the pre-existing one in the inner parts and the accreted gas in the outer parts of the galaxy. The latter progressively replaces the former leading to the final gas-star kinetic misalignment configuration. During the process, the star formation is first enhanced and then progressively decreases. We roughly estimate that a higher fraction of the pre-existing gas is converted into stars rather than being expelled. We also found that the black hole activity (BH) tends to be enhanced during the removal of the pre-existing gas. Furthermore, our analysis suggests that the formation of a counter-rotating gas component is always accompanied with the formation of counter-rotating stellar disks. These stellar disks can have diverse properties but host in general a younger and more metal rich population of stars with respect to the main disc, depending on the star formation history and BH activity. The central part of counter-rotating disks tend also to be characterized by a younger population, an enhanced star formation rate and a higher metallicity than their outer parts. The high metallicity comes the progressive metal enrichment of the accreted gas by mixing with the pre-existing gas and by supernovae activity as it sinks toward the center of the galaxy. In case of major mergers, a large amount of accreted stars from the companion would be distributed at large distances from the remnant center due to conservation of the initial orbital angular momentum.\n\n", "2502.17792": "2025-02-25, **Cosmological constraints on two vacuum decay models**, Yupeng Yang et.al., [2502.17792v1](http://arxiv.org/abs/2502.17792v1)\n\n We constrain two vacuum decay models ($\\Lambda(t)$CDM, proposed by the authors of~\\cite{Brito:2024bhh}) utilizing the baryon acoustic oscillations (BAO) data released by the Dark Energy Spectroscopic Instrument (DESI), distance prior from the cosmic microwave background (CMB) observed by the Planck satellite, Hubble rate data obtained via the cosmic chronometers (CC) method and type Ia supernova (SNIa) data. The interaction terms between dark matter and dark energy are defined as $Q=3\\varepsilon H\\rho\\_{\\Lambda}$ for model I and $3\\varepsilon aH\\rho\\_{\\Lambda}$ for model II. We find that the decay parameter is constrained to be $\\varepsilon=0.0094^{+0.0037}\\_{-0.0033}$ for model I and $\\varepsilon=0.0119\\pm{0.0045}$ for model II, respectively, indicating a potential interaction between dark matter and dark energy at the $2\\sigma$ confidence level. The current Hubble parameter values are estimated to be $H\\_{0}=70.30\\pm{0.67}$ for model I and $H\\_{0}=70.28\\pm{0.64}$ for model II. These values of $H\\_0$ fall between those derived from the Planck and SH0ES data, suggesting that these two vacuum decay models could provide a potential solution to alleviate the Hubble tension problem.\n\n"}}