{"neutrino": {"2412.03546": "2024-12-04, **Revisiting the impact of neutrino mass hierarchies on neutrino mass constraints in light of recent DESI data**, Laura Herold et.al., [2412.03546v1](http://arxiv.org/abs/2412.03546v1)\n\n Recent results from DESI combined with cosmic microwave background data give the tightest constraints on the sum of neutrino masses to date. However, these analyses approximate the neutrino mass hierarchy by three degenerate-mass (DM) neutrinos, instead of the normal (NH) and inverted hierarchies (IH) informed by terrestrial neutrino oscillation experiments. Given the stringency of the upper limits from DESI data, we test explicitly whether the inferred neutrino constraints are robust to the choice of neutrino mass ordering using both Bayesian and frequentist methods. For Planck data alone, we find that the DM hierarchy presents a good approximation to the physically motivated hierarchies while showing a strong dependence on the assumed lower bound of the prior, confirming previous studies. For the combined Planck and DESI baryon acoustic oscillation data, we find that assuming NH ($M\\_\\mathrm{tot} < 0.13\\,\\mathrm{eV}$) or IH ($M\\_\\mathrm{tot} < 0.16\\,\\mathrm{eV}$) loosens the Bayesian upper limits compared to the DM approximation ($M\\_\\mathrm{tot} < 0.086\\,\\mathrm{eV}$). The frequentist analysis shows that the different neutrino models fit the data equally well and the loosening of the constraints can thus be attributed to the lower bounds induced by NH and IH. Overall, we find that the DM hierarchy presents a good approximation to the physically motivated hierarchies also for Planck+DESI data as long as the corresponding lower neutrino mass bounds are imposed.\n\n", "2412.03311": "2024-12-04, **Scalar sector of Type 2 Seesaw model explorations with multi-lepton final states**, Călin Alexa et.al., [2412.03311v1](http://arxiv.org/abs/2412.03311v1)\n\n Originally motivated for the generation of (Majorana) neutrino masses, the Type 2 Seesaw Model has also a rich extended Higgs sector with, if accessible at the LHC, a distinctive phenomenology of neutral, charged and doubly-charged states. The goal of the work is to present an exhaustive phenomenological study of the most promising production and decay channels of pair or associated scalars, decaying directly or in cascades to Standard Model particles at the LHC. The study is complementary to the literature in that it highlights a previously unnoticed important sensitivity to a mixing angle. The ensuing uncertainty calls for a comprehensive experimental search strategy for the various processes. These processes can be studied within LHC energies reach, by comparing cutflow results for different final states. We carried out prospective search analyses with multi-lepton, jets and missing energy configurations, assuming an ATLAS-like detector at LHC and HL-LHC, for charged, doubly-charged, and for the first time neutral scalar productions. The work is a collaboration between ATLAS experimentalists and theoreticians in continuation of an endeavor that lead to previous published ATLAS analyses for the search of (doubly)charged Higgs bosons, aiming at proposals for future experimental searches.\n\n", "2412.03260": "2024-12-04, **Quantum Correlations in Neutrino and Neutral Meson Oscillations**, Subhashish Banerjee et.al., [2412.03260v1](http://arxiv.org/abs/2412.03260v1)\n\n We discuss the impact of ideas of open quantum systems and quantum information to various facets of neutrino and neutral meson oscillations. These oscillations are characterized by a number of quantum correlations, both spatial as well as temporal. For neutrinos, the correlations are shown to be simple functions of the product of neutrino survival and oscillation probabilities. The quantum correlations in the neutral mesons are seen to be non-trivially different from their stable counterparts.\n\n", "2412.03186": "2024-12-04, **First Measurement of the Muon Neutrino Interaction Cross Section and Flux as a Function of Energy at the LHC with FASER**, FASER Collaboration et.al., [2412.03186v1](http://arxiv.org/abs/2412.03186v1)\n\n This letter presents the measurement of the energy-dependent neutrino-nucleon cross section in tungsten and the differential flux of muon neutrinos and anti-neutrinos. The analysis is performed using proton-proton collision data at a center-of-mass energy of $13.6 \\, {\\rm TeV}$ and corresponding to an integrated luminosity of $(65.6 \\pm 1.4) \\, \\mathrm{fb^{-1}}$. Using the active electronic components of the FASER detector, $338.1 \\pm 21.0$ charged current muon neutrino interaction events are identified, with backgrounds from other processes subtracted. We unfold the neutrino events into a fiducial volume corresponding to the sensitive regions of the FASER detector and interpret the results in two ways: We use the expected neutrino flux to measure the cross section, and we use the predicted cross section to measure the neutrino flux. Both results are presented in six bins of neutrino energy, achieving the first differential measurement in the TeV range. The observed distributions align with Standard Model predictions. Using this differential data, we extract the contributions of neutrinos from pion and kaon decays.\n\n", "2412.03140": "2024-12-04, **Probing active-sterile neutrino transition magnetic moment on coherent elastic solar neutrino-nucleus scattering**, Mehmet Demirci et.al., [2412.03140v1](http://arxiv.org/abs/2412.03140v1)\n\n In the presence of a transition magnetic moment between active and sterile neutrinos, sterile neutrinos could be produced by neutrino beams electromagnetically upscattering on nuclei. We study the active-sterile neutrino transition magnetic moment through this upscattering in the coherent elastic neutrino-nucleus scattering process induced by solar neutrinos. We place new limits on the transition magnetic moment-sterile neutrino mass plane using the latest data from the CDEX-10 experiment. We also provide projected sensitivities for future measurements. We observe that the projected sensitivities could cover some regions of the parameter space which were previously unexplored for the sterile neutrino mass up to $\\sim$10 MeV.\n\n", "2412.03031": "2024-12-04, **Testing the gauged $\\mathrm{U(1)}_{B-L}$ model for loop induced neutrino mass with dark matter**, Guohao Ying et.al., [2412.03031v1](http://arxiv.org/abs/2412.03031v1)\n\n We present a new viable benchmark scenario under the current experimental data for the model which can explain tiny mass of active neutrinos and dark matter, as a summary of our results. Majorana masses of right-handed neutrinos are given by the spontaneous breaking of the $\\mathrm{U(1)}\\_{B-L}$ gauge symmetry above the electroweak scale, and tiny neutrino masses are radiatively induced by quantum effects of particles of the dark sector including dark matter candidates. We first show benchmark points which satisfy current experimental data, and then give comments on how this model can be tested at collider experiments.\n\n", "2412.02994": "2024-12-04, **Neutrino portals to MeV WIMPs with s-channel mediators**, Nicole F. Bell et.al., [2412.02994v1](http://arxiv.org/abs/2412.02994v1)\n\n Large-scale neutrino detectors currently under construction will have the unique ability to probe the annihilation of low-mass thermal-relic dark matter to neutrinos. This represents an essential test of the thermal freezeout paradigm. This raises the question: what viable UV-complete models are there in which dark matter annihilates dominantly to neutrinos? We discuss models that fulfill this criteria, and are invariant under the Standard Model gauge group, for both scalar and fermionic dark matter. Specifically, we construct new models in which annihilation via the $s$-channel exchange of a scalar or pseudoscalar mediator achieves the correct relic density. In these models, dark matter is stabilised by an exact or a softly-broken lepton-number symmetry. The parameter space of such models will be probed, almost entirely, by the combination of JUNO, Hyper-Kamiokande and CMB-S4.\n\n", "2412.02925": "2024-12-04, **Effects of Landau quantization on neutrino emission and absorption**, Mia Kumamoto et.al., [2412.02925v1](http://arxiv.org/abs/2412.02925v1)\n\n Some neutron stars known as magnetars possess very strong magnetic fields, with surface fields as large as $10^{15}\\,\\rm G$ and internal fields that are possibly stronger. Recent observations of the radio pulsar GLEAM-X J1627 suggest it may have a surface field as strong as $10^{16} \\,\\rm G$. In the presence of a strong magnetic field, the energy levels of electrons and protons are quantized and the Direct Urca process allows neutron stars to cool rapidly, even at low density. For the case of magnetic fields $B \\geq 10^{16}\\,\\rm G$, we find features in the emissivity due to energy quantization that are not captured by the frequently employed quasiclassical approximation where energy levels are treated as nearly continuous. Resonances can result in amplification of the neutrino emissivity at specific densities compared to a calculation that neglects quantization, particularly at low temperature. These effects are not important for the thermal evolution of an entire neutron star, but may be relevant for phenomena that depend on behavior at specific densities. We present a fully relativistic calculation of the Direct Urca rate in a strong magnetic field using the standard V-A weak Lagrangian incorporating mean field nuclear effects and discuss approaches to the numerical challenge the modified wavefunctions present and a new semi-analytic approximation. These tools are also applicable to calculating neutrino opacities in strong magnetic fields in the ejecta of binary neutron star mergers. We calculate the opacities for neutrinos capturing on free nucleons at sub-saturation densities and temperatures exceeding an MeV. We find an enhancement to capture processes of the lowest energy neutrinos by an order of magnitude or more due to suppression of electron Pauli blocking in the case of capture on neutrons, and from the effect of the nucleon magnetic moments in the case of capture on protons.\n\n"}, "dark matter": {"2412.03547": "2024-12-04, **Learning from galactic rotation curves: a neural network approach**, Bihag Dave et.al., [2412.03547v1](http://arxiv.org/abs/2412.03547v1)\n\n For a galaxy, given its observed rotation curve, can one directly infer parameters of the dark matter density profile (such as dark matter particle mass $m$, scaling parameter $s$, core-to-envelope transition radius $r\\_t$ and NFW scale radius $r\\_s$), along with Baryonic parameters (such as the stellar mass-to-light ratio $\\Upsilon\\_*$)? In this work, using simulated rotation curves, we train neural networks, which can then be fed observed rotation curves of dark matter dominated dwarf galaxies from the SPARC catalog, to infer parameter values and their uncertainties. Since observed rotation curves have errors, we also explore the very important effect of noise in the training data on the inference. We employ two different methods to quantify uncertainties in the estimated parameters, and compare the results with those obtained using Bayesian methods. We find that the trained neural networks can extract parameters that describe observations well for the galaxies we studied.\n\n", "2412.03534": "2024-12-04, **Galaxy Formation in the Early Universe**, J. W. Moffat et.al., [2412.03534v1](http://arxiv.org/abs/2412.03534v1)\n\n Recent observations by the James Webb Space Telescope (JWST) have revealed the presence of bright and well-formed galaxies at high redshifts, challenging the predictions of the standard Lambda-Cold Dark Matter (LCDM) cosmological model. This paper explores the potential of Modified Gravity (MOG), specifically Scalar-Tensor-Vector Gravity (STVG), to account for the rapid formation of these galaxies in the early universe. By enhancing the gravitational constant through a dimensionless parameter $\\alpha$ and incorporating a massive vector field $\\phi\\_\\mu$, MOG predicts deeper gravitational wells that can accelerate the collapse of baryonic matter. We present theoretical insights demonstrating how MOG can facilitate the increase in star formation rate and early formation of galaxies, offering a compelling alternative to LCDM. Our findings suggest that MOG provides a viable framework for understanding the rapid growth of galaxies observed by JWST.\n\n", "2412.03485": "2024-12-04, **Accelerating HI density predictions during the Epoch of Reionization using a GPR-based emulator on N-body simulations**, Gaurav Pundir et.al., [2412.03485v1](http://arxiv.org/abs/2412.03485v1)\n\n Building fast and accurate ways to model the distribution of neutral hydrogen during the Epoch of Reionization (EoR) is essential for interpreting upcoming 21 cm observations. A key component of semi-numerical models of reionization is the collapse fraction field $f\\_{\\text{coll}}(\\mathbf{x})$, which represents the fraction of mass within dark matter halos at each location. Using high-dynamic range N-body simulations to obtain this is computationally prohibitive and semi-analytical approaches, while being fast, end up compromising on accuracy. In this work, we bridge the gap by developing a machine learning model that can generate $f\\_{\\text{coll}}$ maps by sampling from the full distribution of $f\\_{\\text{coll}}$ conditioned on the dark matter density contrast $\\delta$. The conditional distribution functions and the input density field to the model are taken from low-dynamic range N-body simulations that are more efficient to run. We evaluate the performance of our ML model by comparing its predictions to a high-dynamic range N-body simulation. Using these $f\\_{\\text{coll}}$ maps, we compute the HI and HII maps through a semi-numerical code for reionization. We are able to recover the large-scale HI density field power spectra $(k \\lesssim 1\\ h\\,{\\rm Mpc}^{-1})$ at the $\\lesssim10\\%$ level, while the HII density field is reproduced with errors well below 10% across all scales. Compared to existing semi-analytical prescriptions, our approach offers significantly improved accuracy in generating the collapse fraction field, providing a robust and efficient alternative for modeling reionization.\n\n", "2412.03438": "2024-12-04, **The relation of galaxies and dark matter haloes to the filamentary cosmic web**, Navdha et.al., [2412.03438v1](http://arxiv.org/abs/2412.03438v1)\n\n We use the Millennium Simulation to study the relation of galaxies and dark matter haloes to the cosmic web. We define the web as the unique, fully connected, percolating object with (unsmoothed) matter density everywhere exceeding 5.25 times the cosmic mean. This object contains 35\\% of all cosmic mass but occupies only 0.62\\% of all cosmic volume. It contains 26\\% of dark matter haloes of mass $10^{11}M\\_\\odot$, rising to 50\\% at $10^{12.7}M\\_\\odot$, and to $>90\\%$ above $10^{14}M\\_\\odot$. In contrast, it contains 45\\% of all galaxies of stellar mass $10^{8.5}M\\_\\odot$, rising to 50\\% at $10^{10}M\\_\\odot$, to 60\\% at $10^{11}M\\_\\odot$ and to 90\\% at $10^{11.5}M\\_\\odot$. This difference arises because a large fraction of all satellite and backsplash galaxies are part of the cosmic web. Indeed, more than 50\\% of web galaxies are satellites for stellar masses below that of the Milky Way, rising to about 70\\% below $10^{10}M\\_\\odot$, whereas centrals substantially outnumber satellites in the non-web population at all stellar masses. As a result, web galaxies have systematically lower specific star-formation rates (sSFR's) than non-web galaxies. For the latter, the distributions of stellar mass and sSFR are almost independent of web distance. Furthermore, for both central and satellite galaxies, the sSFR distributions at given stellar mass are identical in and outside the web, once differences in backsplash fraction are accounted for. For the galaxy formation model considered here, differences between web and non-web galaxy populations are almost entirely due to the difference in halo mass distribution between the two environments.\n\n", "2412.03432": "2024-12-04, **Self-interactions of ultralight spinless dark matter to the rescue?**, Gaurav Goswami et.al., [2412.03432v1](http://arxiv.org/abs/2412.03432v1)\n\n Numerous observations on astrophysical and cosmological scales can be interpreted to mean that, in addition to the familiar kind of matter well described by the standard model of elementary particle physics, there exists Dark Matter (DM). The fundamental properties of the elementary particles which make up the DM e.g. particle mass, spin, couplings etc are currently being observationally constrained. In particular, if DM particles have spin zero, there exist recent constraints which suggest a lower limit on its mass which is often a couple of orders of magnitude larger than $10^{-22}$ eV. In this talk, we will (a) argue that these limits are based on the assumption that the self coupling of the spinless DM particles is negligible, and, (b) show how some of these lower limits will get modified in the presence of incredibly feeble self interactions.\n\n", "2412.03406": "2024-12-04, **The Outskirt Stellar Mass of Low-Redshift Massive Galaxies is an Excellent Halo Mass Proxy in Illustris/IllustrisTNG Simulations**, Shuo Xu et.al., [2412.03406v1](http://arxiv.org/abs/2412.03406v1)\n\n Recent observations suggest that the extended stellar halos of low-redshift massive galaxies are tightly connected to the assembly of their dark matter halos. In this paper, we use the Illustris, IllustrisTNG100, and IllustrisTNG300 simulations to compare how different stellar aperture masses trace halo mass. For massive central galaxies ($M\\_\\star\\geq 10^{11.2}M\\_\\odot$), we find that a 2D outskirt stellar mass measured between 50 to 100 kpc ($M\\_{\\star,[50,100]}$) consistently outperforms other aperture-based stellar masses. We further show that $M\\_{\\star,[50,100]}$ correlates better with halo mass than the total amount of accreted stars (the ex situ mass), which suggests that not all accreted stars connect to halo assembly equally. While the galaxy formation recipes are different between Illustris and IllustrisTNG100, the two simulations yield consistent ex situ outskirt fractions for massive galaxies (about 70% in $M\\_{\\star,[50,100]}$). These results demonstrate the potential of using the outskirt stellar mass to deepen our understanding of galaxy-halo connection in massive dark matter halos and trace dark matter halos better.\n\n", "2412.03288": "2024-12-04, **Searches for exotic spin-dependent interactions with spin sensors**, Min Jiang et.al., [2412.03288v1](http://arxiv.org/abs/2412.03288v1)\n\n Numerous theories have postulated the existence of exotic spin-dependent interactions beyond the Standard Model of particle physics. Spin-based quantum sensors, which utilize the quantum properties of spins to enhance measurement precision, emerge as powerful tools for probing these exotic interactions. These sensors encompass a wide range of technologies, such as optically pumped magnetometers, atomic comagnetometers, spin masers, nuclear magnetic resonance, spin amplifiers, and nitrogen-vacancy centers. These technologies stand out for their ultrahigh sensitivity, compact tabletop design, and cost-effectiveness, offering complementary approaches to the large-scale particle colliders and astrophysical observations. This article reviews the underlying physical principles of various spin sensors and highlights the recent theoretical and experimental progress in the searches for exotic spin-dependent interactions with these quantum sensors. Investigations covered include the exotic interactions of spins with ultralight dark matter, exotic spin-dependent forces, electric dipole moment, spin-gravity interactions, and among others. Ongoing and forthcoming experiments using advanced spin-based sensors to investigate exotic spin-dependent interactions are discussed.\n\n", "2412.03163": "2024-12-04, **Constraints on dark matter annihilation in the Large Magellanic Cloud from multiple low-frequency radio observations**, Zhanfang Chen et.al., [2412.03163v1](http://arxiv.org/abs/2412.03163v1)\n\n Low-frequency radio emission from the Large Magellanic Cloud~(LMC) is assumed to be dominated by nonthermal synchrotron radiation from energy loss of energetic $e^+/e^-$ in magnetic field. Two different kinds of sources of $e^+/e^-$, dark matter~(DM) annihilation and cosmic rays~(CR) related to massive stars, are taken into account in this paper. We fit the multiple low-frequency radio observations, from 19.7 MHz to 1.4 GHz, with a double power-law model $S\\_{nth} =S\\_{DM}(\\frac {\\nu}{\\nu\\_{\\star}})^{-\\alpha\\_{DM}}+S\\_{CR}( \\frac {\\nu}{\\nu\\_{\\star}})^{-\\alpha\\_{CR}} $. $\\nu\\_{\\star}$ is set to be $1.4$ GHz and $S\\_{CR}$ could be determined from the 24 $\\mu m$ luminosity based on the global radio-infrared correlation. Our best fit with a fixed $\\alpha\\_{CR}$ changing from $0.80$ to $0.55$ yields $\\alpha\\_{DM}$ ranging from $0.21$ to $0.66$. Given a fixed value of $\\alpha\\_{CR}$, we derive the upper limits of synchrotron emission induced by dark matter annihilation at different radio frequencies. Larger value of $\\alpha\\_{CR}$ represents for a harder $e^+/e^-$ spectrum from cosmic rays, which leads to a smaller value of $\\alpha\\_{DM}$ and allow less synchrotron emission resulted from dark matter annihilation in lower frequency. Under the same assumption on the magnetic field, we find that the lower the frequency, the stronger the restriction on DM parameter space. Meanwhile, as the peak frequency of synchrotron radiation decrease with the energy of $e^+/e^-$, constraints on DM properties obtained from lower frequency are more severe in the case of DM with lower mass. Future low-frequency radio survey should be considered a promising and powerful way to constrain DM.\n\n", "2412.03100": "2024-12-04, **Formation of Transitional cE/UCD Galaxies through Massive/Dwarf Disc Galaxy Mergers**, Alexander V. Khoperskov et.al., [2412.03100v2](http://arxiv.org/abs/2412.03100v2)\n\n The dynamics of the merger of a dwarf disc galaxy with a massive spiral galaxy of the Milky Way type have been studied in detail. The remnant of such interaction after numerous crossings of the satellite through the disc of the main galaxy is a compact stellar core, the characteristics of which are close to small compact elliptical galaxies (cEs) or large ultra-compact dwarfs (UCDs). Such transitional cE/UCD objects with an effective radius of 100-200 pc arise as a result of stripping the outer layers of the stellar core during the destruction of a disc dwarf galaxy. Numerical models of the satellite before interaction include baryonic matter (stars and gas) and dark mass. We use N-body to describe the dynamics of stars and dark matter and Smoothed-Particle Hydrodynamics to model the gas components of both galaxies. The direct method of calculating the gravitational force between all particles provides a qualitative resolution of spatial structures up to 10 pc. The simulated cE/UCD galaxies contain very little gas and dark matter at the end of their evolution.\n\n"}, "supernova": {"2412.03509": "2024-12-04, **Signatures of the Shock Interaction as an Additional Power Source in the Nebular Spectra of SN 2023ixf**, Amit Kumar et.al., [2412.03509v1](http://arxiv.org/abs/2412.03509v1)\n\n Red supergiants may lose significant mass through steady winds and episodic eruptions in the final 100-1000 years before the core collapses, shaping their circumstellar environment. Interaction between supernova (SN) ejecta and distant circumstellar material (CSM) can generate shocks, which can energize the ejecta and serve as a key power source during the nebular phase of the SN. In the present work, we investigate the nebular spectrum of SN 2023ixf, observed one year post-explosion (at +363 d) with the recently commissioned WEAVE instrument on the 4.2m William Herschel Telescope. This marks the first supernova spectrum captured with WEAVE. In this spectrum, H$\\alpha$ exhibits a peculiar evolution, flanked by blueward and redward broad components centred at $\\sim\\pm 5650\\,\\mathrm{km\\,s^{-1}}$ from the rest velocity of H$\\alpha$, which are seen for only a few SNe to date. These features indicate energy deposition from shocks generated by the interaction of ejecta with a CSM expelled nearly 350 $-$ 640 years pre-explosion. Comparisons of the +363 d spectrum with model spectra from the literature, that include varying shock powers, suggest a shock power of at least $\\sim 5 \\times 10 ^{40}\\,\\mathrm{erg\\,s^{-1}}$ at this epoch. Additionally, analysis of the [O I] doublet, along with other prominent emission lines, provides evidence for clumpiness, dust formation, and asymmetry within the ejecta and/or the surrounding CSM. These emission lines also helped to constrain the oxygen mass ($\\approx0.19^{\\scriptscriptstyle +0.08}\\_{\\scriptscriptstyle -0.04} M\\_\\odot$), He-core mass ($<3 M\\_\\odot$) and the zero-age main sequence mass ($\\lesssim 12 M\\_\\odot$) of the progenitor of SN 2023ixf. The comparison with other Type II SNe highlights SN 2023ixf's unique shock interaction signatures and evidence of dust formation, setting it apart in terms of evolution and dynamics.\n\n", "2412.03262": "2024-12-04, **Difficulties of two exploding white dwarfs to account for type Ia supernovae with bimodal nebular emission profiles**, Jessica Braudo et.al., [2412.03262v1](http://arxiv.org/abs/2412.03262v1)\n\n We use a simple dynamical scheme to simulate the ejecta of type Ia supernova (SN Ia) scenarios with two exploding white dwarfs (WDs) and find that the velocity distribution of the ejecta has difficulties accounting for bimodal emission line profiles with a large separation between the two emission peaks. The essence of the dynamical code is in including the fact that the ejecta does not leave the system instantaneously. We find that the final separation velocity between the centers of masses of the two WDs' ejecta is ~80% of the pre-explosion WDs' orbital velocity, i.e., we find separation velocities of 4200-5400 km/s for two WDs of masses M1=M2=0.94 Mo. The lower separation velocities we find challenge scenarios with two exploding WDs to explain bimodal emission line profiles with observed velocity separations of up to ~7000 km/s. Only the mass in the ejecta of one WD with an explosion velocity lower than the separation velocity contributes to one peak of the bimodal profile; this is the inner ejecta. We find the inner ejecta to be only <15% of the ejecta mass in energetic explosions. Less energetic explosions yield higher inner mass but lower separation velocities. We encourage searching for alternative explanations of bimodal line profiles.\n\n"}}