{"neutrino": {"2309.07840": "2023-09-14, **Recent Progress in Low Energy Neutrino Scattering Physics and Its Implications for the Standard and Beyond the Standard Model Physics**, V. Pandey et.al., [2309.07840v1](http://arxiv.org/abs/2309.07840v1)\n\n Neutrinos continue to provide a testing ground for the structure of the standard model of particle physics as well as hints towards the physics beyond the standard model. Neutrinos of energies spanning over several orders of magnitude, originating in many terrestrial and astrophysical processes, have been detected via various decay and interaction mechanisms. At MeV scales, there has been one elusive process, until a few years ago, known as coherent elastic neutrino-nucleus scattering (CEvNS) that was theoretically predicted over five decades ago but was never observed experimentally. The recent experimental observation of the CEvNS process by the COHERENT collaboration at a stopped pion neutrino source has inspired physicists across many subfields. This has vital implications for nuclear physics, high-energy physics, astrophysics, and beyond. CEvNS, being a low-energy process, provides a natural window to study light, weakly-coupled, new physics in the neutrino sector.   In this review, we intend to provide the current status of low energy neutrino scattering physics and its implications for the standard and beyond the standard model physics. We discuss the general formalism of calculating the tree-level CEvNS cross section and present estimated theoretical uncertainties on the CEvNS cross section stemming from different sources. We also discuss the inelastic scattering of tens of MeV neutrinos that have implications for supernova detection in future neutrino experiments. We discuss how the CEvNS experiments can be used as a testing ground for the Standard Model (SM) weak physics as well as in searching for the Beyond the Standard Model (BSM) physics signals. Any deviation from the SM predicted event rate either with a change in the total event rate or with a change in the shape of the recoil spectrum, could indicate new contributions to the interaction cross-section.\n\n", "2309.07560": "2023-09-14, **Search for the Prompt Atmospheric Neutrino Flux in IceCube**, Jakob Böttcher et.al., [2309.07560v1](http://arxiv.org/abs/2309.07560v1)\n\n For about a decade the IceCube Neutrino Observatory has been observing a high-energy diffuse astrophysical neutrino flux. At these energies, an important source of background are the prompt atmospheric neutrinos produced in decays of charmed mesons that are part of cosmic-ray-induced air showers. The production yield of charmed mesons in the very forward phase space of hadronic interactions, and thus the flux of prompt neutrinos, is not well known and has not yet been observed by IceCube. A measurement of the flux of prompt neutrinos will improve the modeling of hadronic interactions in cosmic-ray induced air showers at high energies. Additionally, in the context of astrophysical neutrino measurements, understanding this background flux will improve the measurement precision of the spectral shape in the future. In particular, the analysis of up-going muon neutrino-induced tracks in IceCube provides a large sample of atmospheric neutrinos which likely includes prompt neutrinos. However, the measurement of a subdominant prompt neutrino flux strongly depends on the hypothesis for the dominant astrophysical neutrino flux. This makes the estimation of upper limits on the prompt neutrino flux challenging. We discuss the extent of this model dependency on the astrophysical flux and propose a method to calculate robust upper limits. Furthermore, a possible dedicated search of the prompt neutrino flux using multiple IceCube detection channels is outlined.\n\n"}, "dark matter": {"2309.07913": "2023-09-14, **Why would you put a flashlight in a dark matter detector?**, R. Gibbons et.al., [2309.07913v1](http://arxiv.org/abs/2309.07913v1)\n\n Silicon photomultipliers (SiPMs) are solid-state, single-photon sensitive, pixelated sensors whose usage for scintillation detection has rapidly increased over the past decade. It is known that the avalanche process within the device, which renders a single photon detectable, can also generate secondary photons which may be detected by a separate device. This effect, known as external crosstalk, could potentially degrade the science goals of future xenon dark matter experiments. In this article, we measure the effect of external crosstalk in a dual-phase, liquid xenon time projection chamber fully instrumented with SiPMs. We then consider the implications for a future xenon dark matter experiment utilizing SiPMs and discuss possible solutions.\n\n", "2309.07896": "2023-09-14, **Dark Matter Direct Detection in $t$-channel mediator models**, Giorgio Arcadi et.al., [2309.07896v1](http://arxiv.org/abs/2309.07896v1)\n\n We provide a complete reappraisal for the Direct Detection phenomenology of Dark Matter $t$-channel portal models. We provide a complete computation of the loop induced direct detection cross-section for both scalar and fermionic Dark Matter candidates. The results are compared with current and future bounds from direct detection experiments as well as with the requirement of the correct Dark Matter relic density.\n\n", "2309.07869": "2023-09-14, **Nuclear Recoil Identification in a Scientific Charge-Coupled Device**, K. J. McGuire et.al., [2309.07869v1](http://arxiv.org/abs/2309.07869v1)\n\n Charge-coupled devices (CCDs) are a leading technology in direct dark matter searches because of their eV-scale energy threshold and high spatial resolution. The sensitivity of future CCD experiments could be enhanced by distinguishing nuclear recoil signals from electronic recoil backgrounds in the CCD silicon target. We present a technique for event-by-event identification of nuclear recoils based on the spatial correlation between the primary ionization event and the lattice defect left behind by the recoiling atom, later identified as a localized excess of leakage current under thermal stimulation. By irradiating a CCD with an $^{241}$Am$^{9}$Be neutron source, we demonstrate $>93\\%$ identification efficiency for nuclear recoils with energies $>150$ keV, where the ionization events were confirmed to be nuclear recoils from topology. The technique remains fully efficient down to 90 keV, decreasing to 50$\\%$ at 8 keV, and reaching ($6\\pm2$)$\\%$ at 1.5--3.5 keV. Irradiation with a $^{24}$Na $\\gamma$-ray source shows no evidence of defect generation by electronic recoils, with the fraction of electronic recoils with energies $<85$ keV that are spatially correlated with defects $<0.1$$\\%$.\n\n", "2309.07854": "2023-09-14, **A Differentiable Model of the Evolution of Dark Matter Halo Concentration**, Dash Stevanovich et.al., [2309.07854v1](http://arxiv.org/abs/2309.07854v1)\n\n We introduce a new model of the evolution of the concentration of dark matter halos, c(t). For individual halos, our model approximates c(t) as a power law with a time-dependent index, such that at early times, concentration has a nearly constant value of c=3-4, and as cosmic time progresses, c(t) smoothly increases. Using large samples of halo merger trees taken from the Bolshoi-P and MDPL2 cosmological simulations, we demonstrate that our 3-parameter model can approximate the evolution of the concentration of individual halos with a typical accuracy of 0.1 dex for t>2 Gyr for all Bolshoi-P and MDPL2 halos of present-day mass greater than 10^11.5 Msun. We additionally present a new model of the evolution of the concentration of halo populations, which we show faithfully reproduces both average concentration growth, as well as the diversity of smooth trajectories of c(t), including capturing correlations with halo mass and halo assembly history. Our publicly available source code, Diffprof, can be used to generate Monte Carlo realizations of the concentration histories of cosmologically representative halo populations; Diffprof is differentiable due to its implementation in the JAX autodiff library, which facilitates the incorporation of our model into existing analytical halo model frameworks.\n\n", "2309.07839": "2023-09-14, **Interplay between Higgs inflation and dark matter models with dark $U(1)$ gauge symmetry**, Sarif Khan et.al., [2309.07839v1](http://arxiv.org/abs/2309.07839v1)\n\n We investigate dark matter phenomenology and Higgs inflation in a dark $U(1)\\_D$-extended model. The model features two dark matter candidates, a dark fermion and a dark vector boson. When the fermion DM $\\psi$ is heavier than the vector DM $W\\_D$, there is an ample parameter space where $\\psi$ is dominant over $W\\_D$. The model can then easily evade the stringent bounds from direct detection experiments, since $\\psi$ has no direct coupling to the Standard Model particles. Furthermore, the model can accommodate inflation in three different ways, one along the Standard Model Higgs direction, one along the dark Higgs direction, and one along the combination of the two. Considering the running of the parameters and various observational constraints, we perform a detailed numerical analysis and identify allowed parameter spaces that explain both dark matter and Higgs inflation in a unified manner. We discuss in detail how the imposition of Higgs inflation severely constrains the dark matter parameter space. The existence of the dark Higgs field is found to play a crucial role both in dark matter phenomenology and in generalised Higgs inflation.\n\n", "2309.07838": "2023-09-14, **Additional Higgs Bosons near 95 and 650 GeV in the NMSSM**, Ulrich Ellwanger et.al., [2309.07838v1](http://arxiv.org/abs/2309.07838v1)\n\n Hints for an additional Higgs boson with a mass of about 95 GeV originate from LEP and searches in the diphoton channel by CMS and ATLAS. A search for resonant production of SM plus BSM Higgs bosons in the diphoton plus bb channel by CMS showed some excess for a 650 GeV resonance decaying into the SM Higgs plus a 95 GeV Higgs boson. We investigate whether these phenomena can be interpreted simultaneously within the NMSSM subject to the latest constraints on couplings of the SM Higgs boson, on extra Higgs bosons from the LHC, and on dark matter direct detection cross sections.\n\n", "2309.07816": "2023-09-14, **Scalar-Gauss-Bonnet model, the coincidence problem and the gravitational wave speed**, H. Mohseni Sadjadi et.al., [2309.07816v1](http://arxiv.org/abs/2309.07816v1)\n\n We consider a dark energy model consisting of a scalar field simultaneously coupled to the Gauss-Bonnet invariant and dark matter such that the observational gravitational wave speed constraint on the Gauss-Bonnet term is respected. In the early era, the Gauss-Bonnet term caused the scalar field to remain at a stable point. In this period, dark energy density was negligible. Next, due to the dark matter redshift and the conformal coupling, the initial $Z\\_2$ symmetry was broken, and the activated field climbed up its potential and provided conditions for late-time acceleration. In this scenario, the Gauss-Bonnet term is not directly involved in the late-time evolution but alleviates the coincidence problem.\n\n", "2309.07790": "2023-09-14, **Mass transfer and boson cloud depletion in a binary black hole system**, Yao Guo et.al., [2309.07790v1](http://arxiv.org/abs/2309.07790v1)\n\n Ultralight boson is one of the potential candidates for dark matter. If exists, it can be generated by a rapidly rotating black hole via superradiance, extracting the energy and angular momentum of the black hole and forming a boson cloud. The boson cloud can be affected by the presence of a companion star, generating fruitful dynamical effects and producing characteristic gravitational wave signals. We study the dynamics of the boson cloud in a binary black hole system, in particular, we develop a framework to study the mass transfer between two black holes. It is found that bosons occupying the growing modes of the central black hole can jump to the decaying modes of the companion black hole, resulting in cloud depletion. This mechanism of cloud depletion is different from that induced by the resonant perturbation from the companion.\n\n", "2309.07507": "2023-09-14, **The Os$^{16+}$ and Ir$^{17+}$ ions as candidates for accurate optical clock sensitive to physics beyond standard model**, V. A. Dzuba et.al., [2309.07507v1](http://arxiv.org/abs/2309.07507v1)\n\n We perform detailed calculations of the electronic structure of the Os$^{16+}$ ion and demonstrate that it has several metastable states which can be used for very accurate optical clocks. The clocks are highly sensitive to manifestations of the physics beyond standard model, such as time variation of the fine structure constant $\\alpha$, interaction with scalar and pseudoscalar (axion) dark matter fields, local Lorentz invariance and local position invariance violations, and interaction of atomic electrons with nucleus mediated by new boson. The latter can be studied by analysing King plot for isotope shifts and its possible non-linearities since Os has 5 stable isotopes with zero nuclear spin.   Similar calculations for the Ir$^{17+}$ ion spectra and some minor amendments to the interpretation of the experimental data demonstrate very good agreement between theory and experiment. This helps to validate the method of the calculations and demonstrate that both ions are excellent candidates for the search of new physics.\n\n", "2309.07494": "2023-09-14, **Preprocessing in small groups: Three simulated galaxies interacting prior to cluster infall**, Ewa L. Lokas et.al., [2309.07494v1](http://arxiv.org/abs/2309.07494v1)\n\n The formation of galaxy clusters is a complicated process that probably involves the accretion of galaxies in groups, as observed in nearby clusters, such as Virgo and Fornax. The members of the groups undergo \"preprocessing\" prior to cluster infall, which affects their stellar populations and morphology. In this paper I present an extreme example of such an accretion event selected from the IllustrisTNG100 simulation. The group, composed of three full-sized disky galaxies and a number of smaller satellites, is accreted early, with the first pericenter around the cluster at redshift z=1.3. Before the infall, the three galaxies interact strongly in pairs within the group, which produces tidally induced bars in the two more massive ones. The interactions also lead to mass exchange and trigger some star formation activity resulting in temporary rejuvenation of their stellar populations. After infall, they all undergo seven pericenter passages around the cluster, experiencing strong mass loss in the dark matter and gas components, as well as reddening of the stellar populations. Their tidally induced bars are, however, preserved and even enhanced probably due to the loss of gas via ram-pressure stripping in the intracluster medium. The study demonstrates that group accretion can happen very early in cluster formation and proposes another scenario for the formation of tidally induced bars.\n\n", "2309.07442": "2023-09-14, **Constraints via EHT for black hole solutions with dark matter under the generalized uncertainty principle minimal length scale effect**, Ali Övgün et.al., [2309.07442v1](http://arxiv.org/abs/2309.07442v1)\n\n We derived four novel classes of spherically symmetric but non-asymptotically flat black hole solutions surrounded with spherical dark matter distribution perceived under the minimal length scale effect via the Generalized Uncertainty Principle (GUP). Here, we considered the effect of this quantum correction, described by the parameter $\\gamma$, on a toy model galaxy with dark matter and the three well-known dark matter distributions: the Cold Dark Matter (CDM), Scalar Field Dark Matter (SFDM), and the Universal Rotation Curve (URC). We aimed to find constraints to $\\gamma$ by applying these solutions to the known supermassive black holes: Sgr. A* and M87*, in conjunction with the available Event Horizon telescope. We then examined the effect of $\\gamma$ on the event horizon, photonsphere, and shadow radii, where we observed unique deviations from the Schwarzschild case. As for the shadow radii, we obtained bounds for the values of $\\gamma$ on each black hole solution at $1\\sigma$ confidence level. Our results revealed that under minimal length scale effect, black holes can give positive (larger shadow) and negative values (smaller shadow) of $\\gamma$, which are supported indirectly by laboratory experiments and astrophysical or cosmological observations, respectively.\n\n"}, "supernova": {"2309.07800": "2023-09-14, **SN 2021gno: a Calcium-rich transient with double-peaked light curves**, K. Ertini et.al., [2309.07800v1](http://arxiv.org/abs/2309.07800v1)\n\n We present extensive ultraviolet (UV) and optical photometric and optical spectroscopic follow-up of supernova (SN)~2021gno by the \"Precision Observations of Infant Supernova Explosions\" (POISE) project, starting less than two days after the explosion. Given its intermediate luminosity, fast photometric evolution, and quick transition to the nebular phase with spectra dominated by [Ca~II] lines, SN~2021gno belongs to the small family of Calcium-rich transients. Moreover, it shows double-peaked light curves, a phenomenon shared with only four other Calcium-rich events. The projected distance from the center of the host galaxy is not as large as other objects in this family. The initial optical light-curve peaks coincide with a very quick decline of the UV flux, indicating a fast initial cooling phase. Through hydrodynamical modelling of the bolometric light curve and line velocity evolution, we found that the observations are compatible with the explosion of a highly-stripped massive star with an ejecta mass of $0.8\\,M\\_\\odot$ and a $^{56}$Ni mass of $0.024~M\\_{\\odot}$. The initial cooling phase (first light curve peak) is explained by the presence of an extended circumstellar material comprising $\\sim$$10^{-2}\\,M\\_{\\odot}$ with an extension of $1100\\,R\\_{\\odot}$. We discuss if hydrogen features are present in both maximum-light and nebular spectra, and its implications in terms of the proposed progenitor scenarios for Calcium-rich transients.\n\n", "2309.07795": "2023-09-14, **Late-time phenomenology required to solve the $H_0$ tension in view of the cosmic ladders and the anisotropic and angular BAO data sets**, Adrià Gómez-Valent et.al., [2309.07795v1](http://arxiv.org/abs/2309.07795v1)\n\n The $\\sim 5\\sigma$ mismatch between the value of the Hubble parameter measured by SH0ES and the one inferred from the inverse distance ladder (IDL) constitutes the biggest tension afflicting the standard model of cosmology, which could be pointing to the need of physics beyond $\\Lambda$CDM. In this paper we study the background history required to solve the $H\\_0$ tension if we consider standard prerecombination physics, paying special attention to the role played by the data on baryon acoustic oscillations (BAO) employed to build the IDL. We show that the anisotropic BAO data favor an ultra-late-time (phantom-like) enhancement of $H(z)$ at $z\\lesssim 0.2$ to solve the tension, accompanied by a transition in the absolute magnitude of supernovae of Type Ia $M(z)$ in the same redshift range. The effective dark energy (DE) density must be smaller than in the standard model at higher redshifts. Instead, when angular BAO data (claimed to be less subject to model dependencies) is employed in the analysis, we find that the increase of $H(z)$ starts at much higher redshifts, typically in the range $z\\sim 0.6-0.9$. In this case, $M(z)$ could experience also a transition (although much smoother) and the effective DE density becomes negative at $z\\gtrsim 2$. Both scenarios require a violation of the weak energy condition (WEC), but leave an imprint on completely different redshift ranges and might also have a different impact on the perturbed observables. They allow for the effective crossing of the phantom divide. Finally, we employ two alternative methods to show that current data from cosmic chronometers do not exclude the violation of the WEC, but do not add any strong evidence in its favor neither. Our work puts the accent on the utmost importance of the choice of the BAO data set in the study of the possible solutions to the $H\\_0$ tension.\n\n", "2309.07463": "2023-09-14, **Bridging between type IIb and Ib supernovae: SN IIb 2022crv with a very thin Hydrogen envelope**, Anjasha Gangopadhyay et.al., [2309.07463v1](http://arxiv.org/abs/2309.07463v1)\n\n We present optical, near-infrared, and radio observations of supernova (SN) SN~IIb 2022crv. We show that it retained a very thin H envelope and transitioned from a SN~IIb to a SN~Ib; prominent H$\\alpha$ seen in the pre-maximum phase diminishes toward the post-maximum phase, while He {\\sc i} lines show increasing strength. \\texttt{SYNAPPS} modeling of the early spectra of SN~2022crv suggests that the absorption feature at 6200\\,\\AA\\ is explained by a substantial contribution of H$\\alpha$ together with Si {\\sc ii}, as is also supported by the velocity evolution of H$\\alpha$. The light-curve evolution is consistent with the canonical stripped-envelope supernova subclass but among the slowest. The light curve lacks the initial cooling phase and shows a bright main peak (peak M$\\_{V}$=$-$17.82$\\pm$0.17 mag), mostly driven by radioactive decay of $\\rm^{56}$Ni. The light-curve analysis suggests a thin outer H envelope ($M\\_{\\rm env} \\sim$0.05 M$\\_{\\odot}$) and a compact progenitor (R$\\_{\\rm env}$ $\\sim$3 R$\\_{\\odot}$). An interaction-powered synchrotron self-absorption (SSA) model can reproduce the radio light curves with a mean shock velocity of 0.1c. The mass-loss rate is estimated to be in the range of (1.9$-$2.8) $\\times$ 10$^{-5}$ M$\\_{\\odot}$ yr$^{-1}$ for an assumed wind velocity of 1000 km s$^{-1}$, which is on the high end in comparison with other compact SNe~IIb/Ib. SN~2022crv fills a previously unoccupied parameter space of a very compact progenitor, representing a beautiful continuity between the compact and extended progenitor scenario of SNe~IIb/Ib.\n\n"}}