{"neutrino": {"2402.02974": "2024-02-05, **Appearance of neutrino asymmetries in the process of expansion of the Universe, hierarchy of neutrino masses and CP violation**, A. P Serebrov et.al., [2402.02974v1](http://arxiv.org/abs/2402.02974v1)\n\n In this work, we study the appearance of neutrino asymmetries during the expansion of the Universe. A mathematical model based on differential equations was used to describe the processes of neutrino oscillations considering CP violation and neutrino collisions. An analysis of the emergence of neutrino asymmetry due to collisions of neutrinos with each other and due to CP violation during neutrino oscillations is presented. It was discovered that the asymmetry bifurcates into two states with positive and negative asymmetry for the inverse hierarchy of neutrino masses. A state with a normal hierarchy of neutrino masses is unstable and is not realized. It is shown that the maximum CP violation is realized. The influence of this process on the dispersion of the primordial $^4\\text{He}$ mass fraction is calculated, which is confirmed by astrophysical observations. Thus, the inverse hierarchy of neutrino masses is realized. The CP violation in neutrino oscillations is maximum and the phase is $\\delta\\_{13}=270^\\circ (-\\pi/2)$\n\n", "2402.02767": "2024-02-05, **Chiral perturbative solution for the type-I seesaw mechanism in next-to-leading order**, Masaki J. S. Yang et.al., [2402.02767v1](http://arxiv.org/abs/2402.02767v1)\n\n In this letter, we perform chiral perturbative diagonalization of the type-I seesaw mechanism by hierarchical singular values $\\lambda\\_{i}$ of the Dirac mass matrix $m\\_{D}$ up to the next-to-leading order (NLO). Since the mass matrix of right-handed neutrinos $M\\_{R}$ has parity symmetries under $\\lambda\\_{i} \\leftrightarrow - \\lambda\\_{i}$, the singular values $M\\_{i}$ and mixing angles of diagonalization of $M\\_{R}$ are written by only even and odd orders of $\\lambda\\_{i}$ respectively.   We confirm this fact by specific perturbative expansions of the third- and the fourth-order by $\\lambda\\_{i}$. As a result, as long as the chiral perturbation theory is valid, the NLO contributions are generally suppressed by $O(\\lambda\\_{i}^{2} / \\labmda\\_{j}^{2}) \\lesssim 1\\%$ compared to the leading-order expressions that have sufficient accuracies.\n\n"}, "dark matter": {"2402.03236": "2024-02-05, **The Disruption of Dark Matter Minihalos by Successive Stellar Encounters**, Ian DSouza et.al., [2402.03236v1](http://arxiv.org/abs/2402.03236v1)\n\n Scenarios such as the QCD axion with the Peccei-Quinn symmetry broken after inflation predict an enhanced matter power spectrum on sub-parsec scales. These theories lead to the formation of dense dark matter structures known as minihalos, which provide insights into early Universe dynamics and have implications for direct detection experiments. We examine the mass loss of minihalos during stellar encounters, building on previous studies that derived formulas for mass loss and performed N-body simulations. We propose a new formula for the mass loss that accounts for changes in the minihalo profile after disruption by a passing star. We also investigate the mass loss for multiple stellar encounters. We demonstrate that accurately assessing the mass loss in minihalos due to multiple stellar encounters necessitates considering the alterations in the minihalo's binding energy after each encounter, as overlooking this aspect results in a substantial underestimation of the mass loss.\n\n", "2402.03120": "2024-02-05, **Cosmography with next-generation gravitational wave detectors**, Hsin-Yu Chen et.al., [2402.03120v1](http://arxiv.org/abs/2402.03120v1)\n\n Advancements in cosmology through next-generation ground-based gravitational wave observatories will bring in a paradigm shift. We explore the pivotal role that gravitational-wave standard sirens will play in inferring cosmological parameters with next-generation observatories, not only achieving exquisite precision but also opening up unprecedented redshifts. We examine the merits and the systematic biases involved in gravitational-wave standard sirens utilizing binary black holes, binary neutron stars, and neutron star-black hole mergers. Further, we estimate the precision of bright sirens, golden dark sirens, and spectral sirens for these binary coalescences and compare the abilities of various next-generation observatories (A^sharp, Cosmic Explorer, Einstein Telescope, and their possible networks). When combining different sirens, we find sub-percent precision over more than 10 billion years of cosmic evolution for the Hubble expansion rate $H(z)$. This work presents a broad view of opportunities to precisely measure the cosmic expansion rate, decipher the elusive dark energy and dark matter, and potentially discover new physics in the uncharted Universe with next-generation gravitational-wave detectors.\n\n", "2402.03073": "2024-02-05, **Study of dark counts in optical superconducting transition-edge sensors**, Laura Manenti et.al., [2402.03073v2](http://arxiv.org/abs/2402.03073v2)\n\n Superconducting transition-edge sensors (TESs), known for their high single-photon detection efficiency and low background, are increasingly being used in rare event searches. We present the first comprehensive characterization of optical TES backgrounds, identifying three event types: high-energy, electrical noise, and photon-like events. We experimentally verify and simulate the source of the high-energy events. We develop an algorithm to isolate photon-like events, the expected signal in dark matter searches, achieving record-low photon-like dark count rates in the 0.8-3.2 eV energy range.\n\n", "2402.02934": "2024-02-05, **Quantum loop corrections in the modified gravity model of Starobinsky inflation with primordial black hole production**, Sultan Saburov et.al., [2402.02934v1](http://arxiv.org/abs/2402.02934v1)\n\n A modified gravity model of Starobinsky inflation and primordial black hole production was proposed in good (within $1\\sigma$) agreement with current measurements of the cosmic microwave background radiation. The model is an extension of the singularity-free Appleby-Battye-Starobinsky model by the $R^4$-term with different values of the parameters whose fine-tuning leads to efficient production of primordial black holes on smaller scales with the asteroid-size masses between $10^{16}$ g and $10^{20}$ g. Those primordial black holes may be part (or the whole) of the current dark matter, while the proposed model can be confirmed or falsified by detection or absence of the induced gravitational waves with the frequencies about $10^{-2}$ Hz. The main purpose of this paper was to estimate the size of quantum (loop) corrections in the model. It was found their relative contribution to the power spectrum of scalar perturbations is about $10^{-5}$ or less, so that the model is not ruled out by the quantum corrections.\n\n", "2402.02740": "2024-02-05, **Phase Space Distribution Functions and Energy Distributions of Dark Matter Particles in Haloes**, Axel Gross et.al., [2402.02740v1](http://arxiv.org/abs/2402.02740v1)\n\n We calculate the phase space distribution function (DF) and the energy distribution of dark matter particles for a spherical halo in dynamical equilibrium assuming the Navarro-Frenk-White (NFW) density profile. Comparing the results with simulations of a wide range of haloes, we find that with appropriate matching, the energy distribution for a simulated halo can be well described by that derived from the best-fit NFW profile. Deviations occur at low energy when the NFW profile provides a poor fit for $r<0.05R\\_{vir}$, where $R\\_{vir}$ is the virial radius. The comparisons of DFs are similar to those of energy distributions, but the DF derived from the best-fit NFW profile has somewhat less accuracy because additional deviations are introduced through the density of energy states. We also compare the NFW fits to the simulated DFs and energy distributions with the DarkEXP fits of Hjorth & Williams (arXiv:1010.0265). We find that these fits have comparable accuracy in the region where both fit well, and that there is an approximate relation between the energy scale of the DarkEXP fits and the parameters of the NFW profile. The DarkEXP fits are better at low energy because they require the central gravitational potential as an input.\n\n"}, "supernova": {"2402.03027": "2024-02-05, **Stellar feedback impact on the ionized gas kinematics in the dwarf galaxy Sextans B**, Ivan S. Gerasimov et.al., [2402.03027v1](http://arxiv.org/abs/2402.03027v1)\n\n We investigated the ionised and atomic gas kinematics and excitation state in the central region of ongoing star formation of the nearby low-metallicity dwarf galaxy Sextans B. The analysis is based on the new observations performed in Ha emission line with high resolution ($R \\sim 16000$) scanning Fabry-Perot interferometer at the 6-m BTA SAO RAS telescope, and on the long-slit spectral observations at the 9.2-m SALT and 2.5-m CMO SAI MSU telescopes. Strong non-circular gas motions detected in the studied regions probably resulted from the off-plane gas motions and impact of stellar feedback. We identified six regions of elevated Ha velocity dispersion, five of which exhibit asymmetric or two-component Ha line profiles. Three of these regions are young ($<1.1$ Myr) expanding ($V\\_{\\rm exp} \\sim 25-50\\ {\\rm km\\ s^{-1}}$) superbubbles. We argue that at least three regions in the galaxy could be supernova remnants. We conclude that supernovae feedback is the dominant source of energy for superbubbles in Sextans B, which is expected for such a low metallicity, although we cannot rule out a strong impact of pre-supernova feedback for one superbubble.\n\n", "2402.02924": "2024-02-05, **SN 2020pvb: a Type IIn-P supernova with a precursor outburst**, Nancy Elias-Rosa et.al., [2402.02924v1](http://arxiv.org/abs/2402.02924v1)\n\n We present photometric and spectroscopic data sets for SN 2020pvb, a Type IIn-P supernova (SN) similar to SNe 1994W, 2005cl, 2009kn and 2011ht, with a precursor outburst detected (PS1 w-band ~ -13.8 mag) around four months before the B-band maximum light. SN 2020pvb presents a relatively bright light curve peaking at M\\_B = -17.95 +- 0.30 mag and a plateau lasting at least 40 days before it went in solar conjunction. After this, the object is no longer visible at phases > 150 days above -12.5 mag in the B-band, suggesting that the SN 2020pvb ejecta interacts with a dense spatially confined circumstellar envelope. SN 2020pvb shows in its spectra strong Balmer lines and a forest of FeII lines with narrow P Cygni profiles. Using archival images from the Hubble Space Telescope, we constrain the progenitor of SN 2020pvb to have a luminosity of log(L/L\\_sun) <= 5.4, ruling out any single star progenitor over 50 M\\_sun. All in all, SN 2020pvb is a Type IIn-P whose progenitor star had an outburst ~ 0.5 yr before the final explosion, the material lost during this outburst is probably playing a role in shaping the physical properties of the supernova.\n\n", "2402.02878": "2024-02-05, **The Gaia RVS benchmark stars II. A sample of stars selected for their Gaia high radial velocity**, E. Caffau et.al., [2402.02878v1](http://arxiv.org/abs/2402.02878v1)\n\n The Gaia satellite has already provided the astronomical community with three data releases, and the Radial Velocity Spectrometer (RVS) on board Gaia has provided the radial velocity for 33 million stars. When deriving the radial velocity from the RVS spectra, several stars are measured to have large values. To verify the credibility of these measurements, we selected some bright stars with the modulus of radial velocity in excess of 500\\ to be observed with SOPHIE at OHP and UVES at VLT. This paper is devoted to investigating the chemical composition of the stars observed with UVES. We derived atmospheric parameters using Gaia photometry and parallaxes, and we performed a chemical analysis using the code. We find that the sample consists of metal-poor stars, although none have extremely low metallicities. The abundance patterns match what has been found in other samples of metal-poor stars selected irrespective of their radial velocities. We highlight the presence of three stars with low Cu and Zn abundances that are likely descendants of pair-instability supernovae. Two stars are apparently younger than 1\\,Ga, and their masses exceed twice the turn-off mass of metal-poor populations. This makes it unlikely that they are blue stragglers because it would imply they formed from triple or multiple systems. We suggest instead that they are young metal-poor stars accreted from a dwarf galaxy. Finally, we find that the star RVS721 is associated with the Gjoll stream, which itself is associated with the Globular Cluster NGC\\,3201.\n\n", "2402.02780": "2024-02-05, **Dramatic rebrightening of the type-changing stripped-envelope supernova SN 2023aew**, Yashvi Sharma et.al., [2402.02780v1](http://arxiv.org/abs/2402.02780v1)\n\n Multi-peaked supernovae with precursors, dramatic light-curve rebrightenings, and spectral transformation are rare, but are being discovered in increasing numbers by modern night-sky transient surveys like the Zwicky Transient Facility (ZTF). Here, we present the observations and analysis of SN 2023aew, which showed a dramatic increase in brightness following an initial luminous (-17.4 mag) and long (~100 days) unusual first peak (possibly precursor). SN 2023aew was classified as a Type IIb supernova during the first peak but changed its type to resemble a stripped-envelope supernova (SESN) after the marked rebrightening. We present comparisons of SN 2023aew's spectral evolution with SESN subtypes and argue that it is similar to SNe Ibc during its main peak. P-Cygni Balmer lines are present during the first peak, but vanish during the second peak's photospheric phase, before H$\\alpha$ resurfaces again during the nebular phase. The nebular lines ([O I], [Ca II], Mg I], H$\\alpha$) exhibit a double-peaked structure which hints towards a clumpy or non-spherical ejecta. We analyze the second peak in the light curve of SN 2023aew and find it to be broader than normal SESNe as well as requiring a very high $^{56}$Ni mass to power the peak luminosity. We discuss the possible origins of SN 2023aew including an eruption scenario where a part of the envelope is ejected during the first peak which also powers the second peak of the light curve through SN-CSM interaction.\n\n"}}