{"neutrino": {"2601.22000": "2026-01-29, **Discovery prospects of a singly-charged scalar at $μ$TRISTAN**, Joseph George et.al., [2601.22000v1](http://arxiv.org/abs/2601.22000v1)\n\n In this article, we study the associated production of a singly-charged ($Δ^+$) scalar along with a $W^+$ boson in the newly proposed $μ^+μ^+$ collider (also known as $μ$TRISTAN) at $\\sqrt{s} = 2~$ TeV. Such a singly-charged scalar is naturally accommodated in an extremely well-motivated neutrino mass model, namely, the Type-II seesaw model. This model, beside providing a viable explanation of neutrino mass generation, also allows for lepton flavor violating (LFV) processes. Since LFV processes are not allowed in the Standard Model (SM), we focus on the discovery prospect of the singly-charged scalar in the Type-II seesaw model at $μ$TRISTAN through a LFV process, owing to the advantage of this process being free of any SM background. Additionally, this article also proposes a method to indicate if the underlying theory follows a Normal or an Inverted hierarchy depending on the distribution of lepton flavors in the final state.\n\n", "2601.21432": "2026-01-29, **Cosmological analysis of the DESI DR1 Lyman alpha 1D power spectrum**, J. Chaves-Montero et.al., [2601.21432v1](http://arxiv.org/abs/2601.21432v1)\n\n We present the cosmological analysis of the one-dimensional Lyman-$α$ flux power spectrum from the first data release of the Dark Energy Spectroscopic Instrument (DESI). We capture the dependence of the signal on cosmology and intergalactic medium physics using an emulator trained on a cosmological suite of hydrodynamical simulations, and we correct its predictions for the impact of astrophysical contaminants and systematics, many of these not considered in previous analyses. We employ this framework to constrain the amplitude and logarithmic slope of the linear matter power spectrum at $k\\_\\star=0.009\\,\\mathrm{km^{-1}s}$ and redshift $z=3$, obtaining $Δ^2\\_\\star=0.379\\pm0.032$ and $n\\_\\star=-2.309\\pm0.019$. The robustness of these constraints is validated through the analysis of mocks and a large number of alternative data analysis variations, with cosmological parameters kept blinded throughout the validation process. We then combine our results with constraints from DESI BAO and temperature, polarization, and lensing measurements from Planck, ACT, and SPT-3G to set constraints on $Λ$CDM extensions. While our measurements do not significantly tighten the limits on the sum of neutrino masses from the combination of these probes, they sharpen the constraints on the effective number of relativistic species, $N\\_\\mathrm{eff}=3.02\\pm0.10$, the running of the spectral index, $α\\_\\mathrm{s}=0.0014\\pm0.0041$, and the running of the running, $β\\_\\mathrm{s}=-0.0006\\pm0.0048$, by a factor of 1.18, 1.27, and 1.90, respectively. We conclude by outlining the improvements needed to fully reach the level of confidence implied by these uncertainties.\n\n", "2601.21411": "2026-01-29, **TeV Gamma-Rays from the Low-Luminosity Active Galactic Nucleus NGC 4278: Implications for the Diffuse Neutrino Background**, Chengchao Yuan et.al., [2601.21411v1](http://arxiv.org/abs/2601.21411v1)\n\n This work investigates the origin of the TeV emission detected by the Large High Altitude Air Shower Observatory (LHAASO) from NGC 4278, a galaxy hosting a low-luminosity active galactic nucleus (LLAGN). Considering two plausible scenarios, AGN jets and winds, we model the X-ray, GeV, and TeV emission during both TeV-low (quasi-quiet) and TeV-high (active) states. The spectral energy distributions can be explained either by single-zone leptonic emission from moderately relativistic jets or by lepto-hadronic emission from sub-relativistic winds. The best-fit parameters suggest that the transition from the quasi-quiet to the active state may be driven jointly by an enhanced accretion rate and the expansion of jets or winds. We further show that future MeV and very-high-energy $γ$-ray observations can discriminate between the {leptonic and lepto-hadronic scenarios}. Although the neutrino flux from NGC~1068 predicted by the wind model is too low to be detected with current neutrino observatories, a lepto-hadronic wind scenario can account for the PeV diffuse neutrino background when adopting a local LLAGN density corrected for the TeV duty cycle, $n\\_{\\rm L,0}(ΔT\\_{\\rm TeV}/T) \\sim 10^{-5}~\\rm Mpc^{-3}$, as inferred from the LHAASO detection.\n\n", "2601.21373": "2026-01-29, **Scaling Properties of Two-Particle-Two-Hole Responses in Asymmetric Nuclei for Neutrino Scattering within the Relativistic Mean-Field Framework**, V. L. Martinez-Consentino et.al., [2601.21373v1](http://arxiv.org/abs/2601.21373v1)\n\n We perform a systematic analysis of the nuclear dependence of two-particle-two-hole meson-exchange current contributions to inclusive lepton-nucleus scattering within the relativistic mean-field framework. We present microscopic calculations of nuclear responses for a set of 17 nuclei, ranging from helium to uranium, using a model with different Fermi momenta for protons and neutrons. We propose a novel scaling prescription based on the two-particle phase space and key nuclear parameters. The resulting description is accurate over a wide range of nuclear targets, with typical deviations below 10\\%, and allows for a separate treatment of the different emission channels. In addition, a consistent benchmark against electron-scattering data is provided. The parametrization presented provides a practical framework for extending the responses to different nuclear targets in neutrino event generators.\n\n", "2601.21256": "2026-01-29, **Earth-Density Effects in LBL Experiments: A Comprehensive Review of Theory, Observations, and Future Directions**, Tia Pandit et.al., [2601.21256v1](http://arxiv.org/abs/2601.21256v1)\n\n Earth matter density uncertainties play a non trivial role in three flavor neutrino oscillations in matter, particularly for the muon to electron appearance channel that underpins CP violation measurements in long baseline experiments. We demonstrate that when realistic spatial variations of the Earths density are taken into account, the oscillation probabilities acquire additional, energy dependent structures that cannot be captured by path-averaged density approximations. We show that mismodeling of the matter density profile can introduce degeneracies that obscure genuine leptonic CP violating effects, thereby degrading parameter sensitivity and biasing the inference of the CP phase. Identifying energy regions in which CP sensitivity remains robust against matter density uncertainties is therefore essential. These considerations indicate that marginalization over a single effective density parameter is insufficient for next generation precision measurements and motivate the incorporation of spatially resolved Earth density profiles in the analysis frameworks of future long-baseline neutrino oscillation experiments.\n\n", "2601.21155": "2026-01-29, **Nucleon axial-vector form factor and radius from radiatively-corrected antineutrino scattering data**, Oleksandr Tomalak et.al., [2601.21155v1](http://arxiv.org/abs/2601.21155v1)\n\n The nucleon axial-vector form factor, $G\\_A$, is critical to determine the electroweak interactions of leptons with nucleons. Important examples of processes influenced by $G\\_A$ are elastic (anti)neutrino-nucleon scattering and muon capture by the proton. Sparse experimental data results in a large uncertainty on the momentum dependence of $G\\_A$ and has motivated the consideration of new experimental probes and first-principles lattice quantum chromodynamics (QCD) evaluations. The comparison of new and precise theoretical predictions for $G\\_A$ with future experimental data necessitates the application of radiative corrections to experimentally-observable processes. We apply these corrections in the extraction of $G\\_A$ and the associated axial-vector radius from the recent MINERvA antineutrino-hydrogen data, compare the effects from radiative corrections to other uncertainties in neutrino scattering experiments, and discuss the comparison of lattice QCD evaluations to experimental measurements.\n\n"}, "dark matter": {"2601.21848": "2026-01-29, **Compact Stars Sourced by Perfect Fluid Dark Matter Halos**, Yuan Yue et.al., [2601.21848v1](http://arxiv.org/abs/2601.21848v1)\n\n Recent studies have shown that dark matter halos can support regular black holes or compact stars by assuming an anisotropic energy-momentum tensor. In this paper, we extend the analysis to the dark matter halo as an isotropic perfect fluid. By employing galactic dark matter profiles-specifically the Einasto and Dehnen models-as the mass-energy density source, we numerically solve the Einstein field equations and find a class of non-singular, horizonless compact star solutions. Moreover, these configurations remain stable against axial perturbations while satisfying the dominant energy condition.\n\n", "2601.21676": "2026-01-29, **Little Red Dots and Supermassive Black Hole Seed Formation in Ultralight Dark Matter Halos**, Dongsu Bak et.al., [2601.21676v1](http://arxiv.org/abs/2601.21676v1)\n\n We investigate how supermassive black hole (SMBH) seeds form in the early Universe at the centers of ultralight dark matter (ULDM) halos. Focusing on the ULDM Jeans scale, we identify the critical conditions under which high-redshift baryonic gas, strongly confined by central solitonic cores of the halos, undergoes direct and monolithic collapse. The solitonic potential naturally drives rapid inflow and shock heating, allowing the gas to exceed the critical atomic-cooling and fragmentation-suppression threshold of $\\sim 3 \\times 10^4 {\\rm K}$ without invoking an external UV background. We derive semi-analytic relations for the halo mass, soliton mass, baryonic core radius, and thermodynamic state of the gas, including the effects of baryonic contraction. These relations simultaneously determine the minimum and maximum SMBH seed masses as functions of redshift. In this framework, pristine gas clouds that satisfy the temperature threshold collapse without fragmentation, forming SMBH seeds with characteristic masses of order $\\sim 10^5M\\_\\odot$, while systems below the threshold are expected to form compact star clusters instead. Our model also implies an upper limit on the attainable SMBH mass, predicting a maximum mass scale of order $\\sim10^{10}M\\_\\odot$, consistent with the most massive quasars observed to date. The ULDM particle mass required to reproduce the inferred seed mass scale, $m \\simeq 10^{-22}{\\rm eV}$, coincides with the value favored by galactic-scale observations, providing a unified explanation for the characteristic masses of both galactic cores and early SMBH seeds. Our model predicts efficient SMBH seed formation at redshifts $z \\gtrsim 10$ and offers a natural interpretation of recently observed little red dots as SMBHs embedded in compact, hot, ionized gas clouds.\n\n", "2601.21638": "2026-01-29, **A Low-mass Model of The Milky Way: The Disk Warp Resulting from A Galaxy Merger**, Mingji Deng et.al., [2601.21638v1](http://arxiv.org/abs/2601.21638v1)\n\n Previous studies have shown that disk warps can result from galaxy mergers. Recent research indicates a noticeable decline in the rotation curve (RC) of the Milky Way (MW), suggesting the need for a new low-mass model to describe its dynamical features. This study constructs a new Gaia-Sausage-Enceladus (GSE) merger model to characterize the RC features of our galaxy. We use the GIZMO code to simulate mergers with various orbital parameters to investigate how the disk warp evolves under different conditions. This simulation demonstrates the evolutionary mechanism of disk warp, which arises due to the asymmetric gravitational potential of the dark matter (DM) halo generated universally by galaxy mergers. The results indicate that the tilt angle of the DM halo partly reflects the gravitational strength at the $Z=0$ plane, while the gravitational strength on the disk plane reflects the amplitude of disk warp. We identify a dual-regime interaction mechanism driven by the asymmetric halo potential. On short timescales, we find a distinct anti-correlation between the halo's tilt angle and the disk's warp amplitude, indicating a `seesaw' mechanism of angular momentum exchange. On secular timescales, however, dynamical friction drives a global alignment, causing both the halo tilt and the warp amplitude to decay simultaneously. Furthermore, we demonstrate that high-inclination mergers can sustain long-lived prograde precession, where the persistent yet decaying gravitational torque maintains the prograde bending mode against differential wind-up.\n\n", "2601.21361": "2026-01-29, **Search for dimuon resonance in the 35 to 75 GeV mass range using 140 fb$^{-1}$ of 13 TeV $pp$ collisions with the ATLAS detector**, ATLAS Collaboration et.al., [2601.21361v1](http://arxiv.org/abs/2601.21361v1)\n\n A model-independent search for low-mass resonances decaying into pairs of oppositely charged muons is presented. The analysis uses proton--proton collision data corresponding to an integrated luminosity of 140 fb$^{-1}$, recorded by the ATLAS detector at the Large Hadron Collider between 2015 and 2018. The search targets hypothetical dimuon resonances in the invariant mass range from 35 GeV to 75 GeV. The modelling of this mass region is particularly challenging for conventional analytic background parameterisations. To address this, a Gaussian process regression technique is used to model the background. The dimuon mass spectrum is analysed for potential signals, and no statistically significant excess is observed. Upper limits at the 95% confidence level are set on the fiducial production cross-section of new resonances decaying promptly into muons, ranging from 20 fb to 110 fb, depending on the resonance mass. These results are further interpreted in the context of dark-photon and dark-matter-mediator models, leading to new constraints on their parameter spaces.\n\n"}, "supernova": {"2601.21168": "2026-01-29, **Strontium-84 Enrichments in Presolar Grains Provide First Evidence of p-process Nucleosynthesis in Core-collapse Supernovae**, Ishita Pal et.al., [2601.21168v1](http://arxiv.org/abs/2601.21168v1)\n\n This study reports detection of rare p-process isotopes within presolar grains. Presolar grains are relic dust grains from dying stars. These microscopic dust particles are found in primitive solar system materials. Their distinct isotopic compositions record the nucleosynthetic processes in their parent stars and the Galactic chemical environment in which these stars formed. We studied presolar graphite grains of high-density type from the Murchison meteorite and found five grains with subgrains that show enrichments in 84Sr compared to the solar abundance.84Sr is the neutron-deficient isotope of strontium that can be produced in the deep oxygen-rich interior of high-mass stars that end their lives as core-collapse supernovae. The observed 84Sr excesses cannot be produced in low-mass asymptotic giant branch stars, the source of most high-density presolar graphites found in meteorites. High-density graphites with embedded 84Sr excesses are, instead, compatible with a core-collapse supernovae origin. The graphite subgrains condensed from carbon-rich materials in the outer layers of core-collapse supernovae, where 84Sr was destroyed by neutron captures during hydrostatic evolution of the stars and their final explosion. Based on current theoretical stellar models, a few percent of contribution from the inner regions of core-collapse supernovae, which are enriched in p-process nuclides, to the outer carbon-rich regions is the most likely explanation for the observed enrichment of 84Sr in the subgrains of the high-density graphites. In this study, we present the first observational evidence that core-collapse supernovae produce and eject isotopes made by the p-process.\n\n"}}