{"neutrino": {"2501.17141": "2025-01-28, **A new approximation for heavy-lepton neutrino pair processes in simulations of core-collapse supernovae**, Aurore Betranhandy et.al., [2501.17141v1](http://arxiv.org/abs/2501.17141v1)\n\n In this paper, we present a new approximation for efficiently and effectively including heavy-lepton neutrino pair-production processes in neutrino transport simulations of core-collapse supernovae. In the neutrino-driven explosion mechanism, the electron neutrinos and anti-neutrinos are the main players in transporting the energy of the cooling PNS to the matter behind the shock. While heavy-lepton neutrinos, $\\nu\\_x$, play a smaller role in the heating of the gain region, they dominate the cooling of the proto-neutron star (PNS) and therefore still play a crucial role in the explosion mechanism. In this study, we explore the impacts of modifications in the transport and formalisms of pair ($\\nu\\_x\\bar{\\nu}\\_x$) emission and absorption processes. We quantify the impact in terms of the emergent neutrino signal and the nature of the PNS convection and early cooling. For this, we perform a set of simulations, spherically symmetric and axisymmetric, of a 20 M$\\_\\odot$ progenitor using two different state-of-the-art equations of state (EOS). First and foremost, we show that our new efficient approximation for neutrino pair production matches the results of a full treatment very well. Furthermore, for this progenitor, we show that the impact of the modifications is dependent on the EOS used, as the EOS drives the PNS evolution. The variations we explore, including variations due to the nucleon-nucleon bremsstrahlung formalism, have a comparatively smaller impact than the EOS has as a whole.\n\n", "2501.16967": "2025-01-28, **Uncertainties in astrophysical gamma-ray and neutrino fluxes from proton-proton cross-sections in the GeV to PeV range**, Julien Dörner et.al., [2501.16967v1](http://arxiv.org/abs/2501.16967v1)\n\n The identification of Cosmic Ray (CR) sources represents one of the biggest and long-standing questions in astrophysics. Direct measurements of cosmic rays cannot provide directional information due to their deflection in (extra)galactic magnetic fields. Cosmic-ray interactions at the sources lead to the production of high-energy gamma rays and neutrinos, which, combined in the multimessenger picture, are the key to identifying the origins of CRs and estimating transport properties. While gamma-ray observations alone raise the question of whether their origin is hadronic or leptonic, the observation of high-energy neutrino emission directly points to the presence of CR hadrons. To identify the emission signatures from acceleration and transport effects a proper modeling of those interactions in a transport framework is needed. Significant work has been done to tune the production cross sections to accelerator data and different models exist that put the exact evolution of the Monte-Carlo generated showers into a statistical approach of a probabilistic description of the production of the final states of the showers relevant for astrophysical observations.   In this work, we present the implementation of different hadronic interaction (HI) models into the publicly available transport code CRPropa. We apply different descriptions of the HI, trained on observational data in different energy regimes to a nearby, giant molecular cloud. In this case, the resulting gamma-ray flux can differ by a factor $\\sim 2$ dependent on the choice of the HI model.\n\n", "2501.16908": "2025-01-28, **Impact of light sterile neutrinos on cosmological large scale structure**, Rui Hu et.al., [2501.16908v2](http://arxiv.org/abs/2501.16908v2)\n\n Sterile neutrinos with masses on the $\\mathrm{eV}$ scale are promising candidates to account for the origin of neutrino mass and the reactor neutrino anomalies. The mixing between sterile and active neutrinos in the early universe could result in a large abundance of relic sterile neutrinos, which depends on not only their physical mass $m\\_{\\rm phy}$ but also their degree of thermalization, characterized by the extra effective number of relativistic degrees of freedom $\\Delta N\\_{\\rm eff}$. Using neutrino-involved N-body simulations, we investigate the effects of sterile neutrinos on the matter power spectrum, halo pairwise velocity, and halo mass and velocity functions. We find that the presence of sterile neutrinos suppress the matter power spectrum and halo mass and velocity functions, but enhance the halo pairwise velocity. We also provide fitting formulae to quantify these effects.\n\n"}, "dark matter": {"2501.17147": "2025-01-28, **Non-halo structures and their effects on gravitationally lensed galaxies**, Baptiste Jego et.al., [2501.17147v1](http://arxiv.org/abs/2501.17147v1)\n\n While the $\\Lambda$CDM model succeeds on large scales, its validity on smaller scales remains uncertain. Recent works suggest that non-halo dark matter structures, such as filaments and walls, could significantly influence gravitational lensing and that the importance of these effects depends on the dark matter model: in warm dark matter scenarios, fewer low-mass objects form and thus their mass is redistributed into the cosmic-web. We investigate these effects on galaxy-galaxy lensing using fragmentation-free Warm Dark Matter (WDM) simulations with particle masses of m$\\_{\\chi}$ = 1 keV and m$\\_{\\chi}$ = 3 keV. Although these cosmological scenarios are already observationally excluded, the fraction of mass falling outside of haloes grows with the thermal velocity of the dark matter particles, which allows for the search for first-order effects. We create mock datasets, based on gravitationally-lensed systems from the BELLS-Gallery, incorporating non-halo contributions from these simulations to study their impact in comparison to mocks where the lens has a smooth mass distribution. Using Bayesian modelling, we find that perturbations from WDM non-halo structures produce an effect on the inferred parameters of the main lens and shift the reconstructed source position. However, these variations are subtle and are effectively absorbed by standard elliptical power-law lens models, making them challenging to distinguish from intrinsic lensing features. Most importantly, non-halo perturbation does not appear as a strong external shear term, which is commonly used in gravitational lensing analyses to represent large-scale perturbations. Our results demonstrate that while non-halo structures can affect the lensing analysis, the overall impact remains indistinguishable from variations of the main lens in colder WDM and CDM scenarios, where non-halo contributions are smaller.\n\n", "2501.17119": "2025-01-28, **First Axion-Like Particle Results from a Broadband Search for Wave-Like Dark Matter in the 44 to 52 $μ$eV Range with a Coaxial Dish Antenna**, Gabe Hoshino et.al., [2501.17119v1](http://arxiv.org/abs/2501.17119v1)\n\n We present the results from the first axion-like particle search conducted using a dish antenna. The experiment was conducted at room temperature and sensitive to axion-like particles in the $44-52\\,\\mu\\mathrm{eV}$ range ($10.7 - 12.5\\,\\mathrm{GHz}$). The novel dish antenna geometry was proposed by the BREAD collaboration and previously used to conduct a dark photon search in the same mass range. To allow for axion-like particle sensitivity, the BREAD dish antenna was placed in a $3.9\\,\\mathrm{T}$ solenoid magnet at Argonne National Laboratory. In the presence of a magnetic field, axion-like dark matter converts to photons at the conductive surface of the reflector. The signal is focused onto a custom coaxial horn antenna and read out with a low-noise radio-frequency receiver. No evidence of axion-like dark matter was observed in this mass range and we place the most stringent laboratory constraints on the axion-photon coupling strength, $g\\_{a\\gamma\\gamma}$, in this mass range at 90\\% confidence.\n\n", "2501.16829": "2025-01-28, **Multi-Messenger and Cosmological Constraints on Dark Matter through Two-Fluid Neutron Star Modeling**, Ankit Kumar et.al., [2501.16829v1](http://arxiv.org/abs/2501.16829v1)\n\n In this study, we investigate the impact of dark matter (DM) on neutron stars (NSs) using a two-fluid formalism that treats nuclear matter (NM) and DM as gravitationally coupled components. Employing NM equations of state spanning a wide range of stiffness and a self-interacting asymmetric fermionic DM framework, we explore the emergence of DM core- and halo-dominated structures and their observational implications. Constraints from gravitational waves (GW170817), NICER X-ray measurements (PSR J0030+0451), and pulsar mass limits (PSR J0740+6620) delineate a consistent parameter space for DM properties derived from these multi-messenger observations. DM halo-dominated configurations, while consistent with PSR J0740+6620's mass limits and NICER's radius measurements for PSR J0030+0451, are ruled out by the tidal deformability bounds inferred from the GW170817 event. Consequently, the combined limits inferred from the observational data of GW170817, PSR J0030+0451, and PSR J0740+6620 support the plausibility of DM core-dominated configurations. Constraints on the DM self-interaction strength from galaxy cluster dynamics further refine the DM parameter space permitted by NS observations. This work bridges multi-messenger astrophysics and cosmology, providing insights into DM interactions and their implications for NS structure, evolution, and observational signatures.\n\n", "2501.16618": "2025-01-28, **Prediction of Individual Halo Concentrations Across Cosmic Time Using Neural Networks**, Tianchi Zhang et.al., [2501.16618v1](http://arxiv.org/abs/2501.16618v1)\n\n The concentration of dark matter haloes is closely linked to their mass accretion history. We utilize the halo mass accretion histories from large cosmological N-body simulations as inputs for our neural networks, which we train to predict the concentration of individual haloes at a given redshift. The trained model performs effectively in other cosmological simulations, achieving the root mean square error between the actual and predicted concentrations that significantly lower than that of the model by Zhao et al. and Giocoli et al. at any redshift. This model serves as a valuable tool for rapidly predicting halo concentrations at specified redshifts in large cosmological simulations.\n\n", "2501.16602": "2025-01-28, **Central densities of dark matter halos in FIRE-2 simulations of low-mass galaxies with cold dark matter and self-interacting dark matter**, Maria C. Straight et.al., [2501.16602v1](http://arxiv.org/abs/2501.16602v1)\n\n We investigate the central density structure of dark matter halos in cold dark matter (CDM) and self-interacting dark matter (SIDM) models using simulations that are part of the Feedback In Realistic Environments (FIRE) project. For simulated halos of dwarf galaxy scale ($M\\_{\\rm halo}(z=0)\\approx 10^{10}\\,M\\_\\odot$), we study the central structure in both dissipationless simulations and simulations with full FIRE-2 galaxy formation physics. As has been demonstrated extensively in recent years, both baryonic feedback and self-interactions can convert central cusps into cores, with the former process doing so in a manner that depends sensitively on stellar mass at fixed $M\\_{\\rm halo}$. Whether the two processes (baryonic feedback and self-interactions) are distinguishable, however, remains an open question. Here we demonstrate that, compared to feedback-induced cores, SIDM-induced cores transition more quickly from the central region of constant density to the falling density at larger radial scales. This result holds true even when including identical galaxy formation modeling in SIDM simulations as is used in CDM simulations, since self-interactions dominate over galaxy formation physics in establishing the central structure of SIDM halos in this mass regime. The change in density profile slope as a function of radius therefore holds the potential to discriminate between self-interactions and galaxy formation physics as the driver of core formation in dwarf galaxies.\n\n"}, "supernova": {"2501.16990": "2025-01-28, **Optical investigation of supernova remnant G206.7+5.9**, Hicran Bakis et.al., [2501.16990v1](http://arxiv.org/abs/2501.16990v1)\n\n The shell-type supernova remnant (SNR) G206.7+5.9 was recently discovered in the radio band with the Five-hundred-meter Aperture Spherical radio Telescope (FAST). The remnant spans about 3.5 in diameter and exhibits bilateral shells. In this work, we present optical spectra of G206.7+5.9 with the Large sky Area Multi-Object fiber Spectroscopic Telescope (LAMOST), and narrow-band (H$\\alpha$ and [SII]) images with the 1-m T100 telescope. The filamentary structure seen in H$\\alpha$ image shows a clear correlation with the radio emission. We use optical line ratios to determine the physical parameters of G206.7+5.9. The LAMOST spectra reveal large ratios of [SII]/H$\\alpha$ $\\sim$ (0.61-1.78) and [NII]/H$\\alpha$ $\\sim$ (0.63-1.92) consistent with that expected for a shock-heated SNR. The emission lines [OI] $\\lambda$6300, $\\lambda$6363 detected in the spectra also support the presence of shocks. Electron density ($n\\_{\\rm e}$) measurements based on the [SII] $\\lambda$6716/$\\lambda$6731 ratio suggest densities between 117 and 597 cm$^{-3}$. We estimate the pre-shock cloud density ($n\\_{\\rm c}$) to be approximately 2.6$-$13.3 cm$^{-3}$. We also investigate the archival HI data and have newly identified an expanding gas motion of the HI, whose velocity span is approximately 10 km s$^{-1}$. We conclude that G206.7+5.9 is an SNR exhibiting properties remarkably similar to those seen in Galactic SNRs.\n\n"}}