{"neutrino": {"2509.09678": "2025-09-11, **Cosmic $τ$ensions Indirectly Correlate with Reionization Optical Depth**, Itamar J. Allali et.al., [2509.09678v1](http://arxiv.org/abs/2509.09678v1)\n\n The reionization optical depth $\\tau\\_{\\rm reio}$ has interesting connections to existing cosmological anomalies. As first studied in the context of the Hubble tension in our previous paper, a larger $\\tau\\_{\\rm reio}$, which could be achieved by removing the Planck low-$\\ell$ polarization data, could boost $H\\_0$ slightly, resulting in a mild reduction of the tension between the early- and late-universe determinations of $H\\_0$. It has been shown later that a larger $\\tau\\_{\\rm reio}$ could also relieve other anomalies including: the tension between BAO and CMB data, the neutrino mass tension, and the latest DESI plus supernovae data's tension with the standard cosmological constant scenario. In this paper, we systematically analyze the correlations between $\\tau\\_{\\rm reio}$ and relevant cosmological parameters in the existing cosmic observation anomalies. In addition to Pearson correlation coefficients extracted directly from the covariance matrix, we also study partial correlation coefficients which measure intrinsic relationships between pairs of parameters removing the influence of other parameters. We show that $\\tau\\_{\\rm reio}$ has weak intrinsic correlations with the parameters responsible for the tensions and anomalies discussed. The large direct Pearson correlations that allow larger $\\tau\\_{\\rm reio}$ inferences to alleviate the cosmological tensions each arise from complicated networks through multiple parameters. As a result, the relationships between $\\tau\\_{\\rm reio}$ and each anomaly are not independent of each other. We also employ our method of computing correlations to clarify the impact of large scale polarization data, and comment also on the effects of CMB observations from ACT and SPT.\n\n", "2509.09590": "2025-09-11, **Ultra-high energy event KM3-230213A as a cosmogenic neutrino in light of minimal UHECR flux models**, M. Yu. Kuznetsov et.al., [2509.09590v1](http://arxiv.org/abs/2509.09590v1)\n\n Recently, the KM3NeT experiment reported the detection of a neutrino with exceptionally high energy E = 220 PeV, whose origin remains unclear. The corresponding value of the neutrino flux is in tension with the results of other high-energy neutrino experiments. In this study, we discuss the possibility that this neutrino is cosmogenic, i. e., produced by ultra-high energy cosmic rays (UHECR) during their propagation through the intergalactic medium. We adopt the UHECR flux models derived by the Telescope Array experiment, which features a predominantly light mass composition. We show that the predictions of the cosmogenic neutrino flux in these models are consistent with the measurements of the KM3NeT-only and with that of the \"global neutrino observatory\" at approximately 2${\\sigma}$ level. Notably, this result is achieved in a minimal version of the UHECR flux models, that assume one source population with a standard cosmological evolution. We also estimate the corresponding cosmogenic gamma-ray flux and show that it is consistent with Fermi-LAT IGRB measurements and UHE gamma-ray limits; the improvement of the latter can probe these predictions in future.\n\n", "2509.09346": "2025-09-11, **Fixed points of classical gravity coupled with a Standard-Model-like theory**, Latham Boyle et.al., [2509.09346v1](http://arxiv.org/abs/2509.09346v1)\n\n Coupling quantum field theory (QFT) \\!-\\! even free QFT \\!-\\! to gravity leads to well-known problems. In particular, the stress tensor $T\\_{\\mu\\nu}$ (gravity's source) and its correlators typically diverge in the UV, creating a conflict between the wildly inhomogeneous spacetime we expect quantum mechanically and the weakly-curved, macroscopic spacetime we observe. Are there QFTs for which these divergences cancel? Here, for simplicity, we consider free quantum fields on a classical curved background. The aforementioned divergences are related to the running of the gravitational couplings. We calculate the corresponding beta functions, identifying a special class of QFTs with UV fixed points at which $\\langle T\\_{\\mu\\nu}\\rangle$ and all its correlators $\\langle T\\ldots T\\rangle$ are UV finite. An intriguing example is a theory like the Standard Model (including right-handed neutrinos) with $12$ gauge fields, $3$ generations of $16$ Weyl fermions and $36$ four-derivative (Fradkin-Tseytlin) scalars. In the infrared, this theory has a positive Newton's constant $G$ and an arbitrarily small cosmological constant $\\Lambda$.\n\n", "2509.09266": "2025-09-11, **Determination of CKM matrix element and axial vector form factors from weak decays of quantum-entangled strange baryons**, BESIII Collaboration et.al., [2509.09266v1](http://arxiv.org/abs/2509.09266v1)\n\n The electromagnetic structure of the nucleon can be determined from the scattering of electrons off a nucleon target. However, to study its axial structure, neutrino beams are required. The results from these experiments should be extrapolated to zero energy-momentum transfers to access the static properties of the nucleon. For baryons with strange quarks, hyperons, the static limit can instead be approached in semi-leptonic decays, which give direct access to the weak magnetism and axial-vector coupling strengths that are inaccessible in electromagnetic interactions. The axial-vector coupling as while weak magnetism coupling and the overall normalization, given by form factor $f\\_1$, are being determined with increased precision from the theory of strong interactions using a first principles formulation on the space--time lattice. Furthermore, the probability of the semi-leptonic hyperon decay is approximately proportional to $\\|V\\_{us}\\|^2\\cdot (f\\_1^2+3g\\_1^2)$, where $V\\_{us}$ is the CKM matrix element responsible for the transition between an $s$ and a $u$ quark. Current determinations of $\\|V\\_{us}\\|$ come from kaon decays, but the results are not consistent and could indicate a deviation from CKM matrix unitarity, a tell-tale sign of physics beyond the Standard Model (SM) of elementary particles. Here we determine the absolute branching fraction and weak coupling strengths for $\\Lambda\\to p e^-\\bar\\nu\\_e$, and $\\bar \\Lambda\\to \\bar p e^+\\nu\\_e$. These observables combined with form factors determined from first-principle lattice QCD calculations allow for the extraction of the $\\|V\\_{us}\\|$ value. We demonstrate how $\\|V\\_{us}\\|$ can be extracted with increasing sensitivity using polarized hyperons from entangled, baryon-antibaryon pairs, thus enabling a complementary road to that of meson decays. In addition, the presented experimental method can be used for other semileptonic decays of baryons.\n\n", "2509.09086": "2025-09-11, **Reionization optical depth and CMB-BAO tension in punctuated inflation**, Zhiqi Huang et.al., [2509.09086v1](http://arxiv.org/abs/2509.09086v1)\n\n Within the standard six-parameter Lambda cold dark matter ($\\Lambda$CDM) model, a $2$-$3\\sigma$ tension persists between baryon acoustic oscillation (BAO) measurements from the Dark Energy Spectroscopic Instrument (DESI) and observations of the cosmic microwave background (CMB). Although this tension has often been interpreted as evidence for dynamical dark energy or a sum of neutrino masses below the established minimum, recent studies suggest it may instead originate from an underestimation of the reionization optical depth, particularly when inferred from large-scale CMB polarization. Jhaveri et al. propose that a suppression of large-scale primordial curvature power could partially cancel the contribution of $\\tau$ to the CMB low-$\\ell$ polarization power spectrum, leading to a biased low $\\tau$ measurement in standard analyses. In this work, we investigate whether punctuated inflation - which generates a suppression of primordial power on large scales through a transient fast-roll phase - can raise the inferred $\\tau$ value and thereby reconcile the consistency between CMB and BAO. For simple models with step-like features in the inflaton potential, we find that the constraint on $\\tau$ and the CMB-BAO tension remain nearly identical to those in the standard six-parameter $\\Lambda$CDM model. We provide a physical explanation for this negative result.\n\n"}, "dark matter": {"2509.09624": "2025-09-11, **Exploring Coupled Quintessence in light of CMB and DESI DR2 measurements**, Atul Ashutosh Samanta et.al., [2509.09624v1](http://arxiv.org/abs/2509.09624v1)\n\n We perform a detailed analysis of a theoretically motivated dark energy quintessence model which interacts with the dark matter sector of the universe. Utilising the current observational datasets from the Cosmic Microwave Background, Baryon Acoustic Oscillations and Type Ia Supernovae, we constrain the parameters that characterise the strength of the time dependent interaction. We also look at the effect of a warm dark matter component in the context of coupled quintessence. Analysis using Deviance Information Criterion indicates strong preference for the quintessence model coupled with warm dark matter. However, Bayesian evidence analysis shows favor in the direction of $\\Lambda$CDM model.\n\n", "2509.09609": "2025-09-11, **Constraints on Ultra-heavy DM from TeV-PeV gamma-ray diffuse measurements**, Manuel Rocamora et.al., [2509.09609v1](http://arxiv.org/abs/2509.09609v1)\n\n Recent experiments have measured the Galactic $\\gamma$-ray diffuse emission up to PeV energies, opening a window to study acceleration of Galactic cosmic rays and their propagation up to the cosmic-ray knee. Furthermore, these observations provide a powerful tool to set strong constraints into very-heavy dark matter particles, with masses in the TeV-PeV range. In this paper, we explore the potential of the newest observations of diffuse emissions at the Galactic plane from HAWC and LHAASO to probe this kind of dark matter over a wide mass range. Here, we model secondary emissions (inverse-Compton) from the electrons and positrons produced in the annihilation/decay of dark matter, on top of their prompt $\\gamma$-ray emission, including the effects of absorption of high-energy photons via pair production. Furthermore, we show that including the astrophysical backgrounds (namely diffuse emission from cosmic-ray collisions or emission from unresolved sources) can significantly improve these limits. We find that the new measurements provided, specially by LHAASO with the combination of the WCDA and KM2A detectors, allow us to set strong constraints in decaying dark matter, being competitive and even improving the strongest constraints at the moment. We also highlight that these regions lead to constraints that are less affected by uncertainties from the dark matter distribution and discuss how CTA north and SWGO will be able to improve limits in this mass range.\n\n", "2509.09582": "2025-09-11, **The emergence of globular clusters and globular-cluster-like dwarfs**, Ethan D. Taylor et.al., [2509.09582v1](http://arxiv.org/abs/2509.09582v1)\n\n Globular clusters (GCs) are among the oldest and densest stellar systems in the Universe, yet how they form remains a mystery. Here we present a suite of cosmological simulations in which both dark-matter-free GCs and dark-matter-rich dwarf galaxies naturally emerge in the Standard Cosmology. We show that these objects inhabit distinct locations in the size-luminosity plane and that they have similar ages, age spread, metallicity and metallicity spread to globulars and dwarfs in the nearby Universe. About half of our simulated globulars form by means of regular star formation near the centres of their host dwarf, with the rest forming further out, triggered by mergers. The latter are more tidally isolated and more likely to survive to the present day. Finally, our simulations predict the existence of a new class of object that we call 'globular-cluster-like dwarfs' (GCDs). These form from a single, self-quenching, star-formation event in low-mass dark-matter halos at high redshift and have observational properties intermediate between globulars and dwarfs. We identify several dwarfs in our Galaxy, such as Reticulum II (refs. 2-4), that could be in this new class. If so, they promise unprecedented constraints on dark-matter models and new sites to search for metal-free stars.\n\n", "2509.09490": "2025-09-11, **On Lagrangian formulations for (ir)reducible mixed-antisymmetric higher integer spin fields in Minkowski spaces**, Alexander A. Reshetnyak et.al., [2509.09490v1](http://arxiv.org/abs/2509.09490v1)\n\n We extend the results of Lagrangian formulations study to construct gauge-invariant Lagrangians for (ir)reducible integer higher-spin massless and massive representations of the Poincare group with a Young tableau $Y[\\hat{s}\\_1,\\hat{s}\\_2,\\hat{s}\\_3]$ in $d$-dimensional flat space-time (as the probable candidates to describe the Dark Matter problem beyond the SM). These particles are described within a metric-like formulation by tensor fields with 3 groups of antisymmetric Lorentz indices $\\Phi\\_{\\mu^1[{\\hat{s}\\_1}],\\mu^2[{\\hat{s}\\_2}], \\mu^3[{\\hat{s}\\_3}]}$ on a basis of the   BRST method with complete, $Q$, and incomplete, $Q\\_c$, BRST operators. We found unconstrained (with $Q$) and constrained (with $Q\\_c$ and off-shell BRST invariant holonomic constraints) gauge Lagrangian formulations with different configuration spaces and reducibility stages. The deformation procedure to construct interacting gauge model with mixed-antisymmetric fields is proposed.\n\n", "2509.09202": "2025-09-11, **Interacting k-essence field with non-pressureless Dark Matter: Cosmological Dynamics and Observational Constraints**, Saddam Hussain et.al., [2509.09202v1](http://arxiv.org/abs/2509.09202v1)\n\n We investigate a class of interacting dark energy and dark matter (DM) models, where dark energy is modeled as a $k$-essence scalar field with an inverse-square potential. Two general forms of interaction are considered: one proportional to the Hubble parameter, and another independent of the Hubble parameter, depending instead on combinations of the energy densities and pressures of the dark sectors. The dynamics are analyzed using a dynamical system stability framework by constructing an autonomous system of equations. The models are tested against a wide range of observational datasets, including cosmic chronometers (CC), BAO measurements from DESI DR2, compressed Planck data (PLA), Pantheon+ (PP), DES supernovae, Big Bang Nucleosynthesis (BBN), and strong lensing data from H0LiCOW (HCW). The analysis shows that the models consistently reproduce all major cosmological epochs and yield statistically competitive results compared to the flat $\\Lambda$CDM model. The models exhibit stable late-time de-Sitter solutions, ensuring ghost-free evolution, with the Hubble constant in the range $H\\_0 \\sim 67$--$70$ km/s/Mpc.\n\n"}, "supernova": {"2509.09665": "2025-09-11, **1.8 per cent measurement of $H_0$ from Cepheids alone**, Richard Stiskalek et.al., [2509.09665v1](http://arxiv.org/abs/2509.09665v1)\n\n One of the most pressing problems in current cosmology is the cause of the Hubble tension. We revisit a two-rung distance ladder, composed only of Cepheid periods and magnitudes, anchor distances in the Milky Way, Large Magellanic Cloud, NGC 4258, and host galaxy redshifts. We adopt the SH0ES data for the most up-to-date and carefully vetted measurements, where the Cepheid hosts were selected to harbour also Type Ia supernovae. We introduce two important improvements: a rigorous selection modelling and a state-of-the-art density and peculiar velocity model using Manticore-Local, based on the Bayesian Origin Reconstruction from Galaxies (BORG) algorithm. We infer $H\\_0 = 71.7 \\pm 1.3\\,\\mathrm{km}\\,\\mathrm{s}^{-1}\\,\\mathrm{Mpc}^{-1}$, assuming the Cepheid host sample was selected by estimated supernova magnitudes. Less plausible selection criteria shift $H\\_0$ by about one standard deviation. The posterior has a lower central value and a 45 per cent smaller error than a previous study using the same data. The result is also slightly lower than the supernova-based SH0ES inferred value of $H\\_0 = 73.2 \\pm 0.9\\,\\mathrm{km}\\,\\mathrm{s}^{-1}\\,\\mathrm{Mpc}^{-1}$, and is in $3.3\\sigma$ tension with the latest standard cosmological model microwave background results. These results demonstrate that a measurement of $H\\_0$ of sufficient precision to weigh in on the Hubble tension is achievable using second-rung data alone, underscoring the importance of robust and accurate statistical modelling.\n\n", "2509.09624": "2025-09-11, **Exploring Coupled Quintessence in light of CMB and DESI DR2 measurements**, Atul Ashutosh Samanta et.al., [2509.09624v1](http://arxiv.org/abs/2509.09624v1)\n\n We perform a detailed analysis of a theoretically motivated dark energy quintessence model which interacts with the dark matter sector of the universe. Utilising the current observational datasets from the Cosmic Microwave Background, Baryon Acoustic Oscillations and Type Ia Supernovae, we constrain the parameters that characterise the strength of the time dependent interaction. We also look at the effect of a warm dark matter component in the context of coupled quintessence. Analysis using Deviance Information Criterion indicates strong preference for the quintessence model coupled with warm dark matter. However, Bayesian evidence analysis shows favor in the direction of $\\Lambda$CDM model.\n\n", "2509.09419": "2025-09-11, **Impact of rotation on the accretion of entropy perturbations in collapsing massive stars**, Olzhas Mukazhanov et.al., [2509.09419v1](http://arxiv.org/abs/2509.09419v1)\n\n Convection in the innermost shells of massive stars plays an important role in initiating core-collapse supernovae. When these convective motions reach the supernova shock, they create extra turbulence, which helps energize the explosion. In our earlier work, we studied the effect of rotation on the hydrodynamic evolution of convective vortices in collapsing stars. This study focuses on how rotation influences the entropy perturbations, which naturally form in turbulent convection. As these perturbations are carried inward with the collapsing star, they generate both vorticity and sound waves. Using linear perturbation theory, we model entropy waves as small disturbances on top of a steady background flow. Our results show that stellar rotation has little effect on the evolution of entropy perturbations during collapse, prior to encountering the supernova shock. This outcome is consistent with our earlier findings on the limited influence of rotation in the accretion of convective eddies.\n\n", "2509.09293": "2025-09-11, **The superMIGHTEE project: MeerKAT and GMRT Together to Unveil the Deep Radio Sky**, Dharam V. Lal et.al., [2509.09293v1](http://arxiv.org/abs/2509.09293v1)\n\n An international team of researchers has come together to undertake an ultra-broadband exploration of the deep radio sky. The superMIGHTEE project combines data from the MIGHTEE project, using the precursor Square Kilometre Array (SKA) MeerKAT telescope in South Africa, with observations from the upgraded Giant Metrewave Radio Telescope (uGMRT) in India to produce deep images at several $\\mu$Jy sensitivity over a frequency range of 200 MHz--2.5 GHz, with an angular resolution of a few arcseconds. This paper describes the initial superMIGHTEE uGMRT data release, comprising total intensity continuum images covering a total of 9.9 deg$^2$ at 650 MHz and 6.9 deg$^2$ at 400 MHz in the XMM-LSS, COSMOS, and E-CDFS deep fields. The associated radio source catalogs include 27,101 sources at 650 MHz and 10,946 sources at 400 MHz. The redshift distribution of the sources extends to $z\\sim4$ with a median value of $z=1$. An overview of the broadband spectra of the sources, in combination with the MeerKAT MIGHTEE 1280 MHz data, reveals a clear change in spectral properties at the transition from an active galactic nuclei-dominated population to a population dominated by star-forming galaxies at flux densities of a few mJy. At higher frequencies, the star-forming galaxy population exhibits an optically thin synchrotron spectral index indicative of energy injection from supernovae. At lower frequencies, the spectra flatten significantly with decreasing flux density, and the fraction of sources with peaked spectra increases. This is the first superMIGHTEE uGMRT data release. Subsequent releases will include spectropolarimetric and spectral line image cubes, as well as images at lower frequencies. The goal of the superMIGHTEE ultra-wideband dataset is to enhance our understanding of the evolution of active galactic nuclei and star-forming galaxies over cosmic time, (abridged).\n\n", "2509.09247": "2025-09-11, **Investigating the cosmic distance duality relation with gamma-ray bursts**, Anna Chiara Alfano et.al., [2509.09247v1](http://arxiv.org/abs/2509.09247v1)\n\n Deviations from the so-called {\\it cosmic distance duality relation} may result from systematic errors in distance measurements or, more interestingly, hint at new physics. Further, it can also be related to the Hubble constant tension between early and local measurements of $H\\_0$. Based on this, we test validity of this relation through a model-independent parameterization of the Hubble rate via the well-estabilished B\\'ezier polynomials approach. We seek for possible departures from the relation considering three parametrizations, i) a power-law correction, ii) a logarithmic correction and iii) a Pad\\'e series $P\\_{n,m}(z)$ of order (1;2) with $n=1$ being the order of the numerator while $m=2$ is the order of the denominator. Then, assuming a flat scenario, we test them through Monte Carlo -- Markov chain analyses that combine low- and intermediate/high-$z$ data sets, such as observational Hubble data, the Pantheon catalog of type Ia supernovae, galaxy clusters, the second data release from the DESI Collaboration and gamma-ray bursts. In particular, we distinguish between \\emph{Analysis A} and \\emph{Analysis C}, depending whether the prompt emission $E\\_{iso}-E\\_p$ or the prompt-afterglow $L\\_0-E\\_p-T$ gamma-ray burst correlations, respectively, is fit together with the other probes previously described. Our results seem to point towards a \\emph{no violation} of the cosmic distance duality relation and a preference towards Planck's value of $H\\_0$.\n\n", "2509.09202": "2025-09-11, **Interacting k-essence field with non-pressureless Dark Matter: Cosmological Dynamics and Observational Constraints**, Saddam Hussain et.al., [2509.09202v1](http://arxiv.org/abs/2509.09202v1)\n\n We investigate a class of interacting dark energy and dark matter (DM) models, where dark energy is modeled as a $k$-essence scalar field with an inverse-square potential. Two general forms of interaction are considered: one proportional to the Hubble parameter, and another independent of the Hubble parameter, depending instead on combinations of the energy densities and pressures of the dark sectors. The dynamics are analyzed using a dynamical system stability framework by constructing an autonomous system of equations. The models are tested against a wide range of observational datasets, including cosmic chronometers (CC), BAO measurements from DESI DR2, compressed Planck data (PLA), Pantheon+ (PP), DES supernovae, Big Bang Nucleosynthesis (BBN), and strong lensing data from H0LiCOW (HCW). The analysis shows that the models consistently reproduce all major cosmological epochs and yield statistically competitive results compared to the flat $\\Lambda$CDM model. The models exhibit stable late-time de-Sitter solutions, ensuring ghost-free evolution, with the Hubble constant in the range $H\\_0 \\sim 67$--$70$ km/s/Mpc.\n\n", "2509.09123": "2025-09-11, **Binary Black Hole Phase Space Discovers the Signature of Pair Instability Supernovae Mass Gap**, Samsuzzaman Afroz et.al., [2509.09123v1](http://arxiv.org/abs/2509.09123v1)\n\n The rapidly expanding catalog of gravitational-wave detections provides a powerful probe of the formation history of compact binaries across cosmic time. In this work, we extend the Binary Compact Object (BCO) phase-space framework to the full set of events in the GWTC-4 catalog to map the observed binary formation scenarios in a data-driven way. Applying this framework, we identify distinct regions of phase-space associated with different channels and discover for the first time a unique mass-cutoff scale in a data-driven way. The mapping of these on different formation channels reveals a population of first-generation (1G) black holes sharply truncated at approximately 45.5 $M\\_\\odot$, consistent with the theoretically predicted pair-instability supernova (PISN) mass gap. These findings demonstrate the capability of the BCO phase-space to disentangle overlapping formation pathways, establish robust connections between gravitational-wave observations and binary evolution, and highlight the potential of upcoming observing runs to reveal rare populations and exotic origins.\n\n", "2509.09069": "2025-09-11, **Testing the effect of progenitor's metallicity on $^{56}$Ni mass and constraining the progenitor scenarios in Type Ia supernovae**, Young-Lo Kim et.al., [2509.09069v1](http://arxiv.org/abs/2509.09069v1)\n\n The analytical model found that the intrinsic variation in the initial metallicity of the Type Ia supernova (SN Ia) progenitor stars ($Z\\_{progenitor}$) translates into a 25% variation in the $^{56}$Ni mass synthesized and, therefore, 0.2 mag difference in the observed peak luminosity of SNe Ia. Previous observational studies used the currently-observed global gas-phase metallicity of host galaxies, instead of $Z\\_{progenitor}$ used in the model, and showed a higher scatter in the $^{56}$Ni mass measurements compared to the model prediction. Here, we use $Z\\_{progenitor}$ of 34 normal SNe Ia and employ recent SN Ia explosion models with various configurations to cover the observed $^{56}$Ni mass range. Unlike previous studies, our sample covers the $Z\\_{progenitor}$ range, where most of the $Z\\_{progenitor}$ effect occurs. Linear regression returns a slope of 0.02+-0.03, which is the opposite trend to the analytical model, but at at low statistical significance level. We find that comparing our sample with SN Ia explosion models on the $Z\\_{progenitor}$--$^{56}$Ni mass diagram allows us to constrain the progenitor scenarios. We also explore other chemical composition indicators. For $(Fe/H)\\_{progenitor}$, our sample follows the trend predicted by the analytical models, but at a low significance level. Noticeably, $(\\alpha/Fe)\\_{progenitor}$ shows the opposite trend and a clear gap. When we split the sample at $(\\alpha/Fe)\\_{progenitor}$ = 0.35 $(\\alpha/Fe)\\_{\\odot}$, we find a 3$\\sigma$ difference in the weighted-means of the $^{56}$Ni mass. Lastly, SNe Ia in different $Z\\_{progenitor}$ groups show a difference of 0.14+-0.09 mag in the standardized luminosity. The present work highlights a holistic approach (from the progenitor star to the explosion with SN Ia and host galaxy observational data) to understand the underlying physics of SNe Ia for more accurate and precise cosmology.\n\n"}}