{"neutrino": {"2505.19924": "2025-05-26, **Revisiting Flavor Model and Leptogenesis**, Takaaki Nomura et.al., [2505.19924v1](http://arxiv.org/abs/2505.19924v1)\n\n We revisit a supersymmetric flavor model based on the symmetries $SU(2)\\_L \\times A\\_4 \\times Z\\_3 \\times U(1)\\_R$, which extends the original Altarelli and Feruglio construction by introducing flavon and driving superfields responsible for the spontaneous breaking of the flavor symmetry in order to obtain non-zero reactor angle. The vacuum alignments of flavon fields are achieved through the minimization of the scalar potential derived from the superpotential. This setup leads to specific mass matrices for the charged leptons and neutrinos that are consistent with current experimental data, including the measured values of the lepton mixing angles and neutrino mass squared differences. We investigate whether the model can simultaneously accommodate successful thermal leptogenesis. In particular, we analyze the CP asymmetry generated in the decay of heavy Majorana neutrinos, the resulting lepton asymmetry, and its conversion to the baryon asymmetry through the electroweak sphalerons. However the CP asymmetry is zero, since the Dirac neutrino mass matrix is simple texture in the leading order for our model. Then we consider the next-leading order in Yukawa interactions of the Dirac neutrinos. Therefor, we can realize the baryon asymmetry of the universe at the present universe. By numerically scanning the parameter space, we identify the regions consistent with both neutrino oscillation data and the observed baryon asymmetry. The range of the Majorana phases may be tested in future experiments.\n\n", "2505.19721": "2025-05-26, **Observing Supernova Neutrino Light Curves with Super-Kamiokande.VI. A Practical Data Analysis Technique Considering Realistic Experimental Backgrounds**, Fumi Nakanishi et.al., [2505.19721v1](http://arxiv.org/abs/2505.19721v1)\n\n Neutrinos from supernovae, especially those emitted during the late phase of core collapse, are essential for understanding the final stages of massive star evolution. We have been dedicated to developing methods for the analysis of neutrinos emitted during the late phase and observed at Super-Kamiokande (SK). Our previous studies have successfully demonstrated the potential of various analysis methods in extracting essential physical properties; however, the lack of background consideration has limited their practical application. In this study, we address this issue by incorporating a realistic treatment of the experimental signal and background events with the on-going SK experiment. We therefore optimize our analysis framework to reflect realistic observational conditions, including both signal and background events. Using this framework we study several long-time supernova models, simulating the late phase neutrino observation in SK and focusing in particular on the identification of the last observed event. We discuss the possibility of model discrimination methods using timing information from this last observed event.\n\n", "2505.19592": "2025-05-26, **Occurrence of fast neutrino flavor conversions in QCD phase-transition supernovae**, Zewei Xiong et.al., [2505.19592v1](http://arxiv.org/abs/2505.19592v1)\n\n Core-collapse supernovae undergoing a first-order quantum chromodynamics (QCD) phase transition experience the collapse of the central proto-neutron star that leads to a second bounce. This event is accompanied by the release of a second neutrino burst. Unlike the first stellar core bounce neutrino burst which consists exclusively of electron neutrinos, the second burst is dominated by electron antineutrinos. Such a condition makes QCD supernovae an ideal site for the occurrence of fast neutrino flavor conversion (FFC), which can lead to rapid flavor equilibration and significantly impact the related neutrino signal. In this work, we perform a detailed analysis of the conditions for fast flavor instability (FFI) around and after the second neutrino burst in a QCD phase transition supernova model launched from a 25~$M\\_\\odot$ progenitor mass. We evaluate the relevant instability criteria and find two major phases of FFC. The first phase is closely associated with the collapse and the rapidly expanding shock wave, which is a direct consequence of the proto-neutron star collapse due to the phase transition. The second phase takes place a few milliseconds later when electron degeneracy is restored near the proto-neutron star surface. We also characterize the growth rate of FFI and estimate its impact on the evolution of the neutrino flavor content. The potential observational consequences on neutrino signals are evaluated by comparing a scenario assuming complete flavor equipartition with other scenarios without FFC. Finally, we investigate how FFC may influences $r$-process nucleosynthesis associated with QCD phase transition driven supernova explosions.\n\n"}, "dark matter": {"2505.20115": "2025-05-26, **Shadows and Observational Images of a Schwarzschild-like Black Hole Surrounded by a Dehnen-type Dark Matter Halo**, Zuting Luo et.al., [2505.20115v1](http://arxiv.org/abs/2505.20115v1)\n\n This study investigates the optical appearance of a Schwarzschild-like black hole (BH) surrounded by a Dehnen-type dark matter (DM) halo, with a focus on how the DM halo's density $\\rho\\_{s}$ and radius $r\\_{s}$ influence the BH's shadow and photon ring. First, the radius $r\\_h$ of the BH's event horizon and the equation of motion for photons were derived, and observational data from the Event Horizon Telescope (EHT) for M87* were used to constrain the parameters $\\rho\\_{s}$ and $r\\_{s}$ of the DM halo. Afterward, by varying the values of $\\rho\\_{s}$ and $r\\_{s}$, key parameters such as the effective potential $V\\_{eff}$ of photons, the critical impact parameter $b\\_{ph}$, the radius $r\\_{isco}$ of the innermost stable circular orbit,and the the radius $r\\_{ph}$ of the photon sphere were calculated for each case. It was found that as $\\rho\\_{s}$ and $r\\_{s}$ increase, the above mentioned parameters all show an increasing trend. Subsequently, we examined the optical appearance of the BH under two models: one with an optically and geometrically thin accretion disk and the other with a static spherical accretion model. The findings indicate that as $\\rho\\_{s}$ and $r\\_{s}$ increase, the peak of the received intensity shifts toward a higher impact parameter $b$, resulting in a distinct optical appearance.\n\n", "2505.20044": "2025-05-26, **Classical Analysis of Noncoherent Dark Matter to Photon Conversions in a Resonant Cavity**, Puxian Wei et.al., [2505.20044v1](http://arxiv.org/abs/2505.20044v1)\n\n Both axion and dark photon dark matter are among the most promising candidates of dark matter. What we know with some confidence is that they exhibit a small velocity distribution $\\delta v\\lesssim v\\sim 10^{-3}$c. In addition, their mass is small, resulting in a long de Broglie wavelength and a high particle number density. Their phase space distribution has many uncertainties thus could give rise to a coherent or noncoherent wave on the laboratory scale. In this paper, we demonstrated that a resonant cavity can enhance the noncoherent axion-to-photon or dark photon-to-photon transitions. The reason in a classical picture is that a cavity can resonantly respond to many different resonant sources at the same time. This is consistent with the quantum perspective. The induced signals, however, are noncoherent and therefore may need a single-photon readout.\n\n", "2505.20031": "2025-05-26, **Static Black Hole Solution with a Dark Matter Halo**, Uktamjon Uktamov et.al., [2505.20031v1](http://arxiv.org/abs/2505.20031v1)\n\n In this letter, we present a novel analytical Schwarzschild-like black hole (BH) solution that exhibits a static BH with a dark matter (DM) halo characterized by a Dehnen-type density profile. We study the properties of the newly derived BH solution by examining its spacetime curvature characteristics and energy conditions, providing insights into how the DM halo influences these fundamental characteristics. This solution could represent an alternative perspective on the interaction of black hole-dark matter systems, providing new insights into the fundamental properties of DM halos.\n\n", "2505.19857": "2025-05-26, **Probing Memory-Burdened Primordial Black Holes with Galactic Sources observed by LHAASO**, Xiu-hui Tan et.al., [2505.19857v1](http://arxiv.org/abs/2505.19857v1)\n\n The recently identified \\textit{memory burden} effect has the potential to significantly decelerate the evaporation of black holes. Specifically, when approximately half of a black hole's initial mass has been radiated away, the evaporation process is halted. This mechanism allows very light primordial black holes (PBHs) with masses $m\\_{\\rm PBH}<10^{15}$ g to persist until the present day and may contribute to the dark matter (DM) content of the universe. In this work, we focus on PBHs with masses $\\lesssim 10^{9}$ g. Due to the memory burden effect, these PBHs emit high-energy gamma-rays, which in turn alter the corresponding observed energy spectra. To investigate the constraints on the masses and DM abundance of PBHs, we analyze data from four Galactic sources measured by the Large High Altitude Air Shower Observatory (LHAASO), including the Crab Nebula, LHAASO J2226+6057, LHAASO J1908+0621, and LHAASO J1825-1326. Our findings indicate that the ultra-high-energy gamma-ray spectra from these Galactic sources provide crucial probes for light PBHs, thereby significantly constraining their potential contribution to DM.\n\n", "2505.19747": "2025-05-26, **Gravitational wave cosmology**, Ligong Bian et.al., [2505.19747v1](http://arxiv.org/abs/2505.19747v1)\n\n Gravitational waves (GWs) originating from cosmological sources offer direct insights into the physics of the primordial Universe, the fundamental nature of gravity, and the cosmic expansion of the Universe. In this review paper, we present a comprehensive overview of our recent advances in GW cosmology, supported by the national key research and development program of China, focusing on cosmological GW sources and their implications for fundamental physics and cosmology. We first discuss the generation mechanisms and characteristics of stochastic gravitational wave backgrounds generated by physical processes occurred in the early Universe, including those from inflation, phase transitions, and topological defects, and summarize current and possible future constraints from pulsar timing array and space-based detectors. Next, we explore the formation and observational prospects of primordial black holes as GW sources and their potential connection to dark matter. We then analyze how GWs are affected by large-scale structure, cosmological perturbations, and possible modifications of gravity on GW propagation, and how these effects can be used to test fundamental symmetry of gravity. Finally, we discuss the application of GW standard sirens in measuring the Hubble constant, the expansion history, and dark energy parameters, including their combination with electromagnetic observations. These topics together show how GW observations, especially with upcoming space-based detectors, such as LISA, Taiji, and Tianqin, can provide new information about the physics of the early Universe, cosmological evolution, and the nature of gravity.\n\n"}, "supernova": {"2505.19831": "2025-05-26, **SN 2024aecx: A double-peaked rapidly evolving Type IIb supernova at 11 Mpc**, Xingzhu Zou et.al., [2505.19831v1](http://arxiv.org/abs/2505.19831v1)\n\n We present the results of low-resolution spectroscopic and densely sampled multiband simultaneous optical imaging ($ugi$ and $vrz$ bands) follow-up of supernova (SN) 2024aecx. The photometric data is supplemented with $Swift$/UVOT and ATLAS survey observations. The SN was discovered in the spiral galaxy NGC 3521 (distance $\\sim$11 Mpc) within a day after the explosion. The early spectra of SN 2024aecx show a weak signature of hydrogen lines, which disappeared in $\\sim$30 days after the explosion. Light curves in all bands show a distinct feature of two peaks, and the first peak is likely due to the shock cooling emission. The early phase light curve evolution of SN 2024aecx has similarity with the typical Type IIb events, but the decay rate in different bands (e.g., $\\rm \\Delta m\\_{15}$ = 1.60 $\\pm$ 0.05 mag, $g$-band) is significantly faster in the post-peak phase. It attained the secondary maximum in $\\sim$19 days ($g$-band) with a peak absolute magnitude of M$\\_{g}$= -17.94 $\\pm$ 0.10 mag. The color evolution of SN 2024aecx is displaying a red-blue-red trend between days $\\sim$8 to 40. The analytical model fitting to the light curves reveals an envelope mass and progenitor radii in the range of $\\sim$0.03 - 0.24 $M\\_\\odot$ and $\\sim$169 - 200 $R\\_\\odot$, respectively. Modeling of the pseudo-bolometric light curve suggests that synthesized $^{56}$Ni in the explosion was $\\sim$0.15 M$\\_{\\odot}$ with ejecta mass and kinetic energy of $\\sim$0.7 M$\\_{\\odot}$ and $\\sim$0.16 x 10$^{51}$ erg, respectively. The observational properties and modeling indicate that the SN 2024aecx progenitor belongs to the extended progenitor category.\n\n", "2505.19818": "2025-05-26, **Infrared diagnostics of late-time core-collapse supernova spectra**, Luc Dessart et.al., [2505.19818v1](http://arxiv.org/abs/2505.19818v1)\n\n Nonlocal thermodynamic equilibrium radiative transfer calculations of red-supergiant and He-star explosions are presented, extending previous work to focus on the infrared emission from atoms and ions in the ejecta during the nebular-phase (i.e., ~200 to ~500d) -- molecules and dust are ignored. We cover non-rotating, solar-metallicity progenitors spanning an initial mass between 10 and about 40Msun, and exploding as Type II or Ibc supernovae (SNe). Both photometrically and spectroscopically, the SN II models evolve distinctly from the SN Ibc models, primarily because of the greater ejecta kinetic-energy-to-mass ratio in the latter, which leads to a greater gamma-ray escape together with a lower density and a higher ionization in our H-deficient ejecta. Type II SN models remain optically luminous at all times, whereas SN Ibc models progressively brighten in the infrared (which holds 80% of their luminosity at 500d), causing strong infrared lines such as [NeII]12.81mic or [NiII]6.634mic to evolve essentially at constant luminosity. We find that the strength of [NeII]12.81mic correlates with progenitor mass but with additional strong sensitivity to, for example, ejecta ionization -- this line radiates alone up to 20% of the SN luminosity after ~300d in our SN Ibc models. The numerous infrared Ni lines are found to be good tracers of the material that underwent explosive nucleosynthesis and can thus be used to constrain the level of 56Ni mixing in core-collapse SNe. The evolution of the integrated flux in infrared Fe and Co lines shows much diversity, which compromises their use as diagnostic of the 56Ni-decay power source in our models. Future spectroscopic observations of core-collapse SNe by the JWST will provide unprecedented information on the emission from atoms and ions in their ejecta, delivering critical constraints on the inner workings of massive star explosions.\n\n", "2505.19055": "2025-05-25, **Testing cosmological principle under Copernican principle**, Xin Wang et.al., [2505.19055v1](http://arxiv.org/abs/2505.19055v1)\n\n Recent observational analyses have revealed potential evidence for a preferred spatial direction in cosmological data. Such directional parameterization inherently places observers at a privileged spatial position, thereby conflicting with the Copernican principle and suffering from the look-elsewhere effect. To restore the Copernican principle which is the foundation of modern astronomy, we propose a stochastic framework for cosmological principle violations. The almost uniform temperature of cosmic microwave background suggests that the deviation of isotropy is negligible ($\\lesssim 10^{-5}$ level) on the last scattering surface, which can be used as a zero boundary condition to construct an orthogonal basis below the redshift of recombination. The relative deviation from Hubble diagram of isotropic ($\\Lambda$CDM or $w\\_0w\\_a$CDM) models is expanded with the orthogonal basis with a hierarchy of increasing resolution. Using this new approach, we test cosmological principle with type Ia supernovae, strong lens time delay, and gravitational-wave standard siren. The data sets are consistent with statistical isotropy on large scales.\n\n"}}