{"neutrino": {"2406.14554": "2024-06-20, **Neutrino mass bounds from DESI 2024 are relaxed by Planck PR4 and cosmological supernovae**, Itamar J. Allali et.al., [2406.14554v1](http://arxiv.org/abs/2406.14554v1)\n\n The recent DESI 2024 Baryon Acoustic Oscillations (BAO) measurements combined with the CMB data from the Planck 18 PR3 dataset and the Planck PR4+ACT DR6 lensing data, with a prior on the sum of the neutrino masses $\\sum m\\_\\nu>0$, leads to a strong constraint, $\\sum m\\_\\nu<0.072$ eV, which would exclude the inverted neutrino hierarchy and put some tension on even the standard hierarchy. We show that actually this bound gets significantly relaxed when combining the new DESI measurements with the HiLLiPoP+LoLLiPoP likelihoods, based on the Planck 2020 PR4 dataset, and with supernovae datasets. We note that the fact that neutrino masses are pushed towards zero, and even towards negative values, is known to be correlated with the so-called $A\\_L$ tension, a mismatch between lensing and power spectrum measurements in the Planck PR3 data, which is reduced by HiLLiPoP+LoLLiPoP to less than 1$\\sigma$. We find $\\sum m\\_\\nu<0.1$ eV and $\\sum m\\_\\nu<0.12$ eV, with the supernovae Pantheon+ and DES-SN5YR datasets respectively. The shift caused by these datasets is more compatible with the expectations from neutrino oscillation experiments, and both the normal and inverted hierarchy scenarios remain now viable, even with the $\\sum m\\_\\nu>0$ prior. Finally, we analyze neutrino mass bounds in an extension of $\\Lambda$CDM that addresses the $H\\_0$ tension, with extra fluid Dark Radiation, finding that in such models bounds are further relaxed and the posterior probability for $\\sum m\\_\\nu$ begins to exhibit a peak at positive values.\n\n", "2406.14480": "2024-06-20, **$P$ & $m_e$**, Ravi Kuchimanchi et.al., [2406.14480v1](http://arxiv.org/abs/2406.14480v1)\n\n Curiously in the minimal left right symmetric model, chiral ($\\chi$) symmetry that protects the electron's mass ($m\\_e$), due to parity (P) implies the vanishing of its neutrino mixing angles. We break the $\\chi$ symmetry to generate the observed neutrino mixing which causes the electron to acquire its mass on RGE running, and in turn determines the B-L gauge symmetry breaking scale ($v\\_R$) to be $10^{10} GeV \\lesssim v\\_R \\leq 10^{15} GeV $ (and with fine-tuning can be at $10 TeV$ scale). If the muon's mass is also generated radiatively, the B-L breaking scale is $\\sim 10^{14-15}$ GeV. Regardless of how the high scale $v\\_R$ is, this is a testable model for obtaining the mass of the electron (and muon), since on RGE running and P breaking, a large strong CP phase ($\\bar{\\theta} >> 10^{-10}$) which depends logarithmically on $v\\_R$ is generated if there is O(1) CP violation in leptonic Yukawa couplings. Hence we expect that leptonic CP phases including the Dirac CP phase $\\delta\\_{CP}$ of the PMNS matrix must be consistent with $0$ or $180^o$ to within a degree, which can be verified or excluded by neutrino experiments such as DUNE and Hyper-Kamiokande. In lieu of P, if charge conjugation C is used, the same results follow. However with C and no P, axions would likely need to be added anyway, in which case there is no constraint on $\\delta\\_{CP}$.\n\n", "2406.14268": "2024-06-20, **A hierarchical Bayesian approach to point source analysis in high-energy neutrino telescopes**, F. Capel et.al., [2406.14268v1](http://arxiv.org/abs/2406.14268v1)\n\n We propose a novel approach to the detection of point-like sources of high-energy neutrinos. Motivated by evidence for emerging sources in existing data, we focus on the characterisation and interpretation of these sources. The hierarchical Bayesian model is implemented in the Stan platform, enabling computation of the posterior distribution with Hamiltonian Monte Carlo. We simulate a population of weak neutrino sources detected by the IceCube experiment and use the resulting data set to demonstrate and validate our framework. We show that even for the challenging case of sources at the threshold of detection and using limited prior information, it is possible to correctly infer the source properties. Additionally, we demonstrate how modelling flexible connections between similar sources can be used to recover the contribution of sources that would not be detectable individually, going beyond what is possible with existing stacking methods.\n\n", "2406.14121": "2024-06-20, **First Demonstration of a Combined Light and Charge Pixel Readout on the Anode Plane of a LArTPC**, N. Anfimov et.al., [2406.14121v1](http://arxiv.org/abs/2406.14121v1)\n\n The novel SoLAr concept aims to extend sensitivities of liquid-argon neutrino detectors down to the MeV scale for next-generation detectors. SoLAr plans to accomplish this with a liquid-argon time projection chamber that employs an anode plane with dual charge and light readout, which enables precision matching of light and charge signals for data acquisition and reconstruction purposes. We present the results of a first demonstration of the SoLAr detector concept with a small-scale prototype detector integrating a pixel-based charge readout and silicon photomultipliers on a shared printed circuit board. We discuss the design of the prototype, and its operation and performance, highlighting the capability of such a detector design.\n\n", "2406.14002": "2024-06-20, **A Collaborative Explanation of Cosmic Ray Spectrum Based on the Gluon Condensation Model**, Jintao Wu et.al., [2406.14002v1](http://arxiv.org/abs/2406.14002v1)\n\n Based on the Gluon Condensation (GC) model, the relationship between the spectra of electrons, $\\gamma$ rays, and neutrinos in cosmic rays can be deduced. It has been found that these particles share the same parameter, $\\beta\\_p$, and have an identical GC threshold values. This paper explores the connection between the second excess spectra of electron and the spectra of gamma rays and neutrinos. According to the observed gamma-ray data, it is suggested that the source LHAASO J2108+5157 might contribute to the second excess of electron.\n\n", "2406.14001": "2024-06-20, **High-energy Neutrino Emission from NGC 1068 by Outflow-cloud Interactions**, Yong-Han Huang et.al., [2406.14001v1](http://arxiv.org/abs/2406.14001v1)\n\n As the hottest high-energy neutrino spot, NGC 1068 has received much attention in recent years. Here we focus on the central region of the active galactic nuclei (AGN) and propose an outflow-cloud interaction model that could probably explain the observed neutrino data. Considering the accretion process adjacent to the central supermassive black hole (SMBH) of NGC 1068, strong outflows will be generated, which will likely interact with surrounding clouds floating in the corona region. Particles carried by the outflow will be accelerated to very high energy by the shocks forming during the outflow-cloud interactions. For the accelerated high-energy protons, $p\\gamma$ interactions with the background photon field of the corona and disk and $pp$ interaction with the surrounding gas will produce considerable high-energy $\\gamma$-rays and neutrino. However, because of the extremely dense photon fields in the corona and disk, the newly generated $\\gamma$-rays will be significantly attenuated through the $\\gamma\\gamma$ absorptions. In our scenario, the expected GeV-TeV $\\gamma$-ray emission will be suppressed to a much lower level than the neutrino emission, consistent with the observational characteristics of NGC 1068, while the generated 1-30\\,TeV neutrino flux can fit the IceCube data very well.\n\n"}, "dark matter": {"2406.14437": "2024-06-20, **Complex Dark Photon Dark Matter EFT**, Enrico Bertuzzo et.al., [2406.14437v1](http://arxiv.org/abs/2406.14437v1)\n\n We construct an effective field theory for complex Stueckelberg dark photon dark matter. Such an effective construction can be realized by writing down a complete set of operators up to dimension six built with the complex dark photon and Standard Model fields. Classifying the effective operators, we find that in order to properly take into account the non-renormalizable nature of an interacting massive vector, the size of the Wilson coefficients should be naturally smaller than naively expected. This can be consistently taken into account by a proper power counting, that we suggest. First we apply this to collider bounds on light dark matter, then to direct detection searches by extending the list of non-relativistic operators to include the case of complex vectors. In the former we correctly find scaling limits for small masses, while in the latter we mostly focus on electric dipole interactions, that are the smoking gun of this type of dark matter. Simple UV completions that effectively realize the above scenarios are also outlined.\n\n", "2406.14389": "2024-06-20, **Exploring new physics via effective interactions**, Ekata Singh et.al., [2406.14389v1](http://arxiv.org/abs/2406.14389v1)\n\n We investigate self-conjugate Dark Matter (DM) particles that primarily interact with standard model electroweak gauge bosons within an effective field theoretical framework. Our analysis focuses on effective contact interactions, invariant under the standard model gauge group, between Majorana fermions, and real scalar DM, with SM neutral electroweak gauge bosons. We calculate the Wilson coefficients for interaction terms up to dimension-8 and establish constraints on the theory's parameters. These constraints are derived from the observed relic density, and indirect detection observations. We discuss the potential for dark matter-nucleon scattering in direct detection experiments. Additionally, we utilize low-energy LEP data to assess sensitivity to the pair production of low-mass ($\\leq$ 80 GeV) DM particles. Furthermore, we highlight the potential of the proposed International Linear Collider (ILC) in probing effective operators through the pair production of DM particles with masses $\\geq$ 50 GeV in association with mono-photons.\n\n", "2406.14157": "2024-06-20, **Exact solutions for differentially rotating galaxies in general relativity**, Marco Galoppo et.al., [2406.14157v1](http://arxiv.org/abs/2406.14157v1)\n\n A class of stationary axisymmetric solutions of Einstein's equations for isolated differentially rotating dust sources is presented. The low-energy asymptotic regime is extracted, requiring a self-consistent coupling of quasilocal energy and angular momentum. The Raychaudhuri equation reduces to a balance equation, with two important limits. These limits can be interpreted empirically for rotationally supported configurations such as galaxies. The net energy including quasilocal kinetic contributions vanishes on the inner vortex surface, and the outer rotosurface. These new geometrical objects potentially shed light on virialization. Whether or not abundant collisionless dark matter exists, the new solutions suggest that the phenomenology of galactic rotation curves be fundamentally reconsidered, for consistency with general relativity.\n\n"}, "supernova": {"2406.14195": "2024-06-20, **Investigating the Role of Pre-supernova Massive Stars in the Acceleration of Galactic Cosmic Rays**, Michael De Becker et.al., [2406.14195v1](http://arxiv.org/abs/2406.14195v1)\n\n Galactic cosmic rays (GCRs) constitute a significant part of the energy budget of our Galaxy, and the study of their accelerators is of high importance in modern astrophysics. Their main sources are likely supernova remnants (SNRs). These objects are capable to convert a part of their mechanical energy into accelerated charged particles. However, even though the mechanical energy reservoir of SNRs is promising, a conversion rate into particle energy of 10 to 20% is necessary to feed the population of GCRs. Such an efficiency is however not guaranteed. Complementary sources deserve thus to be investigated. This communication aims to address the question of the contribution to the acceleration of GCRs by pre-supernova massive stars in binary or higher multiplicity systems\n\n", "2406.14057": "2024-06-20, **Evidence for bipolar explosions in Type IIP supernovae**, T. Nagao et.al., [2406.14057v1](http://arxiv.org/abs/2406.14057v1)\n\n Recent observations of core-collapse supernovae (SNe) suggest aspherical explosions. Globally aspherical structures in SN explosions are regarded as the key for understanding their explosion mechanism. However, the exact explosion geometries from the inner cores to the outer envelopes are poorly understood. Here, we present photometric, spectroscopic and polarimetric observations of the Type IIP SN 2021yja and discuss its explosion geometry, in comparison to those of other Type IIP SNe that show large-scale aspherical structures in their hydrogen envelopes (SNe 2012aw, 2013ej and 2017gmr). During the plateau phase, SNe 2012aw and 2021yja exhibit high continuum polarization characterized by two components with perpendicular polarization angles. This behavior can be interpreted to be due to a bipolar explosion, composed of a polar (energetic) and an equatorial (bulk) components of the SN ejecta. In such a bipolar explosion, an aspherical axis created by the polar ejecta would be dominating at early phases, while the perpendicular axis along the equatorial ejecta would emerge at late phases after the receding of the photosphere in the polar ejecta. The interpretation of the bipolar explosions in SNe 2012aw and 2021yja is also supported by other observational properties, including the time evolution of the line velocities and the line shapes in the nebular spectra. The polarization of other Type IIP SNe that show large-scale aspherical structures in the hydrogen envelope (SNe 2013ej and 2017gmr) is also consistent with the bipolar-explosion scenario, although this is not conclusive.\n\n"}}