{"neutrino": {"2401.17810": "2024-01-31, **Revisiting Trimaximal TM2 mixing in two $A_4$ modular symmetries**, Han Zhang et.al., [2401.17810v1](http://arxiv.org/abs/2401.17810v1)\n\n We discuss a minimal lepton flavour model with two modular $A\\_4$ symmetries, one acting on neutrinos and the other acting on charged leptons. Two corresponding moduli fields are restricted at stabilisers. To avoid vanishing or degenerate lepton masses, the stabiliser in the charged lepton sector always preserves a $Z\\_3$ symmetry, and that in the neutrino preserves a $Z\\_2$ symmetry. By scanning all viable stabilisers, a unique Trimaximal TM2 mixing is predicted. However, the prediction of the lightest neutrino mass and the mass parameter in neutrinoless double beta decay, as well as two Majorana phases, are different and classified into three cases.\n\n", "2401.17613": "2024-01-31, **New Constraints on Gauged U(1)$_{L_μ-L_τ}$ Models via $Z-Z'$ Mixing**, Kento Asai et.al., [2401.17613v1](http://arxiv.org/abs/2401.17613v1)\n\n It is known that the model based on U(1)$\\_{L\\_\\mu-L\\_\\tau}$ gauge symmetry can explain not only the discrepancy between the measured value of muon $g-2$ and the theoretical prediction, but also the structure of the neutrino mass and mixings. We revisit the analysis of the mass matrix structure in the minimal U(1)$\\_{L\\_\\mu-L\\_\\tau}$ models based on the latest experimental result, where the minimal stands for the symmetry breaking caused only by a single scalar field. We find that the model called type ${\\bf 2}\\_{+1}$, where an SU(2)$\\_L$ doublet scalar $\\Phi\\_{+1}$ with the U(1)$\\_{L\\_\\mu - L\\_\\tau}$ charge $+1$ and the hypercharge $+1/2$, predicts the $\\bf B\\_3$ texture and is marginally acceptable under the current neutrino oscillation data and cosmological observation. When the U(1)$\\_{L\\_\\mu - L\\_\\tau}$ gauge symmetry is broken by the vacuum expectation value of the standard model non-singlet representation such as $\\Phi\\_{+1}$, there are additional contributions to the flavor-changing meson decay process and atomic parity violation via the $Z-Z'$ mixing. We newly evaluate the model-dependent constraints on the model and conclude that the type ${\\bf 2}\\_{+1}$ model is robustly ruled out. The model is extended to have an additional vacuum expectation value of a standard model singlet scalar in order to avoid the stringent constraint from the flavor-changing meson decay. Finally, we find the allowed range of the ratio of these vacuum expectation values.\n\n"}, "dark matter": {"2401.18076": "2024-01-31, **Searching for scalar field dark matter with LIGO**, Alexandre S. Göttel et.al., [2401.18076v1](http://arxiv.org/abs/2401.18076v1)\n\n We report on a direct search for scalar field dark matter using data from LIGO's third observing run. We analyse the coupling of size oscillations of the interferometer's beamsplitter and arm test masses that may be caused by scalar field dark matter. Using new efficient search methods to maximise sensitivity for signatures of such oscillations, we set new upper limits for the coupling constants of scalar field dark matter as a function of its mass, which improve upon bounds from previous direct searches by several orders of magnitude in a frequency band from 10 Hz to 180 Hz.\n\n", "2401.17990": "2024-01-31, **Dark Matter Searches with Levitated Sensors**, Eva Kilian et.al., [2401.17990v1](http://arxiv.org/abs/2401.17990v1)\n\n Motivated by the current interest in employing quantum sensors on Earth and in space to conduct searches for new physics, we provide a perspective on the suitability of large-mass levitated optomechanical systems for observing dark matter signatures. We discuss conservative approaches of recoil detection through spectral analysis of coherently scattered light, enhancements of directional effects due to cross-correlation spectral densities, and the possibility of using quantum superpositions of mesoscopic test particles to measure rare events.\n\n", "2401.17945": "2024-01-31, **Euclid preparation. The Near-IR Background Dipole Experiment with Euclid**, Euclid Collaboration et.al., [2401.17945v1](http://arxiv.org/abs/2401.17945v1)\n\n Verifying the fully kinematic nature of the cosmic microwave background (CMB) dipole is of fundamental importance in cosmology. In the standard cosmological model with the Friedman-Lemaitre-Robertson-Walker (FLRW) metric from the inflationary expansion the CMB dipole should be entirely kinematic. Any non-kinematic CMB dipole component would thus reflect the preinflationary structure of spacetime probing the extent of the FLRW applicability. Cosmic backgrounds from galaxies after the matter-radiation decoupling, should have kinematic dipole component identical in velocity with the CMB kinematic dipole. Comparing the two can lead to isolating the CMB non-kinematic dipole. It was recently proposed that such measurement can be done using the near-IR cosmic infrared background (CIB) measured with the currently operating Euclid telescope, and later with Roman. The proposed method reconstructs the resolved CIB, the Integrated Galaxy Light (IGL), from Euclid's Wide Survey and probes its dipole, with a kinematic component amplified over that of the CMB by the Compton-Getting effect. The amplification coupled with the extensive galaxy samples forming the IGL would determine the CIB dipole with an overwhelming signal/noise, isolating its direction to sub-degree accuracy. We develop details of the method for Euclid's Wide Survey in 4 bands spanning 0.6 to 2 mic. We isolate the systematic and other uncertainties and present methodologies to minimize them, after confining the sample to the magnitude range with negligible IGL/CIB dipole from galaxy clustering. These include the required star-galaxy separation, accounting for the extinction correction dipole using the method newly developed here achieving total separation, accounting for the Earth's orbital motion and other systematic effects. (Abridged)\n\n", "2401.17940": "2024-01-31, **Can we constrain warm dark matter masses with individual galaxies?**, Shurui Lin et.al., [2401.17940v1](http://arxiv.org/abs/2401.17940v1)\n\n We study the impact of warm dark matter mass on the internal properties of individual galaxies using a large suite of 1,024 state-of-the-art cosmological hydrodynamic simulations from the DREAMS project. We take individual galaxies' properties from the simulations, which have different cosmologies, astrophysics, and warm dark matter masses, and train normalizing flows to learn the posterior of the parameters. We find that our models cannot infer the value of the warm dark matter mass, even when the values of the cosmological and astrophysical parameters are given explicitly. This result holds for galaxies with stellar mass larger than $2\\times10^8 M\\_\\odot/h$ at both low and high redshifts. We calculate the mutual information and find no significant dependence between the WDM mass and galaxy properties. On the other hand, our models can infer the value of $\\Omega\\_{\\rm m}$ with a $\\sim10\\%$ accuracy from the properties of individual galaxies while marginalizing astrophysics and warm dark matter masses.\n\n", "2401.17589": "2024-01-31, **Critical behavior and Joule-Thomson expansion of charged AdS black holes surrounded by exotic fluid with modified Chaplygin equation of state**, Meng-Yao Zhang et.al., [2401.17589v1](http://arxiv.org/abs/2401.17589v1)\n\n By considering the concept of a unified single fluid model, referred to as the modified Chaplygin gas, which amalgamates dark energy and dark matter. In this study, we explore the thermodynamic characteristics of charged AdS black holes existing in an unconventional fluid accompanied by MCG. To accomplish this objective, we derive the equations of state by regarding the charge $Q^{2}$ as a thermodynamic variable. The impact of MCG parameters on the critical thermodynamic quantities ($\\Phi\\_{c}$, $T\\_{c}$, $Q\\_{c}^{2}$) are examined, followed by a detailed analysis of the $Q^{2}-\\Phi$ diagram. To provide a clearer explanation of the phase transition, we present an analysis of the Gibbs free energy. It is important to note that if the Hawking temperature exceeds the critical temperature, there is a distinct pattern observed known as swallowtail behavior. This indicates that the system undergoes a first-order phase transition from a smaller black hole to a larger one. The critical exponent of the system is found to be in complete agreement with that of the van der Waals fluid system. Furthermore, we investigate the impact of MCG parameters and black hole charge on the J-T expansion in the extended phase space. The impact of MCG on the inversion curve of charged black holes exhibits a striking resemblance to that observed in most multi-dimensional black hole systems. In addition, it is worth noting that the parameter $\\beta$ exert a significant influence on the ratio $\\frac{T\\_{min}}{T\\_{c}}$. specific values of MCG parameters, and the minimum inversion temperature is consistent with the charged AdS black hole. The parameters $\\gamma$ and $\\beta$ have a non-negligible effect on the isenthalpy curve.\n\n", "2401.17553": "2024-01-31, **Dark matter measurements combining stellar and HI kinematics: 30% $1-σ$ outliers with low dark matter content at $5R_\\mathrm{e}$**, Meng Yang et.al., [2401.17553v1](http://arxiv.org/abs/2401.17553v1)\n\n We construct the Schwarzschild dynamical models for 11 early-type galaxies with the SAURON and Mitchell stellar IFUs out to $2-4 R\\_\\mathrm{e}$, and construct dynamical models with combined stellar and HI kinematics for a subsample of 4 galaxies with HI velocity fields out to $10 R\\_\\mathrm{e}$ obtained from the Westerbork Synthesis Radio Telescope, thus robustly obtaining the dark matter content out to large radii for these galaxies. Adopting a generalised-NFW dark matter profile, we measure an NFW-like density cusp in the dark matter inner slopes for all sample galaxies, with a mean value of $1.00\\pm0.04$ (rms scatter $0.15$). The mean dark matter fraction for the sample is $0.2$ within $1 R\\_\\mathrm{e}$, and increases to $0.4$ at $2 R\\_\\mathrm{e}$, and $0.6$ at $5 R\\_\\mathrm{e}$. The dark matter fractions within $1 R\\_\\mathrm{e}$ of these galaxies are systematically lower than the predictions of both the TNG-100 and EAGLE simulations. For the dark matter fractions within $2 R\\_\\mathrm{e}$ and $5 R\\_\\mathrm{e}$, 40% and 70% galaxies are $1-\\sigma$ consistent with either the TNG-100 or the EAGLE predictions, while the remaining 60% and 30% galaxies lie below the $1-\\sigma$ region. Combined with 36 galaxies with dark matter fractions measured out to $5 R\\_\\mathrm{e}$ in the literature, about 10% of these 47 galaxies lie below the $3-\\sigma$ region of the TNG-100 or EAGLE predictions.\n\n"}, "supernova": {"2401.18080": "2024-01-31, **Strong Bow Shocks: Turbulence and An Exact Self-Similar Asymptotic**, Marcus DuPont et.al., [2401.18080v1](http://arxiv.org/abs/2401.18080v1)\n\n We show that strong bow shocks are turbulent and non-universal near the head, but asymptote to a universal steady, self-similar, and analytically solvable flow in the downstream. The turbulence is essentially 3D, and has been confirmed by a 3D simulation. The asymptotic behavior is confirmed with high resolution 2D and 3D simulations of a cold uniform wind encountering both a solid spherical obstacle and stellar wind. This solution is relevant in the context of: (i) probing the kinematic properties of observed high-velocity compact bodies -- e.g., runaway stars and/or supernova ejecta blobs -- flying through the interstellar medium; and (ii) constraining stellar bow shock luminosities invoked by some quasi-periodic eruption (QPE) models.\n\n", "2401.17660": "2024-01-31, **Origin of $^{60}$Fe nuclei in cosmic rays: the contribution of local OB associations**, Nicolas de Séréville et.al., [2401.17660v1](http://arxiv.org/abs/2401.17660v1)\n\n The presence of live $^{60}$Fe nuclei (lifetime of 3.8~Myr) in cosmic rays detected by the ACE/CRIS instrument suggests a nearby nucleosynthesis source. $^{60}$Fe is primarily produced in core-collapse supernovae, and we aim to clarify whether the detected $^{60}$Fe nuclei can be associated with a particular local supernova. We consider 25 OB associations and sub-groups located within 1 kpc of the solar system based on recent $Gaia$ census. A model is developed that combines stellar population synthesis within these OB associations, cosmic-ray acceleration within associated superbubbles, and cosmic-ray transport to the solar system. The most critical model parameter impacting $^{60}$Fe cosmic-ray production is the explodability criterion, which determines if a massive star ends its life as a supernova. Our study points to the Sco-Cen OB association as the most probable origin of the observed $^{60}$Fe nuclei, particularly suggesting they were accelerated in the Sco-Cen superbubble by a young supernova aged $\\leq500$ kyr with a progenitor mass of approximately $13-20~M\\_\\odot$. A less likely source is the supernova at the origin of the Geminga pulsar 342 kyr ago, if the progenitor originated in the Orion OB1 association. The contribution of local OB associations to the cosmic-ray density of stable $^{56}$Fe is estimated to be around 20\\%, with some sensitivity to cosmic ray acceleration efficiency and diffusion coefficient. These findings shed light on the origins of cosmic-ray nuclei, connecting them to nucleosynthesis events within our local cosmic neighborhood.\n\n"}}