{"neutrino": {"2506.24110": "2025-06-30, **Constraining self-interacting ultrahigh-energy neutrinos by cosmic microwave background spectral distortion**, Pravin Kumar Natwariya et.al., [2506.24110v1](http://arxiv.org/abs/2506.24110v1)\n\n The neutrino telescopes have firmly established the existence of ultra-high-energy (UHE) neutrinos. Observations of these neutrinos offer a unique probe of neutrino self-interactions. This work investigates how the self-interacting neutrinos, mediated by scalar bosons, inject energy into the medium through radiative scattering with the cosmic neutrino background, leaving an imprint on the Cosmic Microwave Background (CMB) spectrum. The energy injection into plasma in redshift ranges, $5\\times10^4\\lesssim z\\lesssim2\\times10^6$ and $ z\\lesssim5\\times10^4$, leads to $\\mu$-type and $y$-type of CMB spectral distortions, respectively. Using observational constraints from Cosmic Background Explorer/Far Infrared Absolute Spectrophotometer (COBE/FIRAS) and projected sensitivities from Primordial Inflation Explorer (PIXIE) experiments for $\\mu$-type and $y$-type CMB distortions, we derive the stringent upper bounds on the self-interaction coupling strength as a function of mediator mass for neutrino interactions. We focus on flavor-specific self-interaction related to muon neutrinos and sub-GeV mass mediators ($m\\_{\\phi}$). We find the upper bound on the self-interaction coupling strength to be $\\sim 3.1\\times 10^{-5}$ for the muon neutrino, considering UHE muon neutrino energy to be 1 PeV and PIXIE projected upper bounds on $\\mu$-type CMB spectral distortion. The bound remains constant till the mediator mass reaches the center of mass energy, and after that, it gets relaxed and becomes proportional to the mediator mass. We have also compared our results with existing bounds in the literature. Our findings indicate that CMB spectral distortion could play a decisive role in exploring neutrino physics beyond the standard model of particle physics, and future missions like PIXIE can provide valuable insights.\n\n", "2506.24027": "2025-06-30, **Dark matter as the source of neutrino mass: theory overview and experimental prospects**, Ivania M. Ávila et.al., [2506.24027v1](http://arxiv.org/abs/2506.24027v1)\n\n We review theoretical frameworks in which small neutrino masses arise radiatively through interactions with a dark sector that also accounts for cosmological dark matter. A prototypical example is provided by scotogenic schemes, that extend the inert Higgs doublet model. We outline their key features and limitations, including possible completions, such as the revamped setup. The phenomenological signatures of both fermionic and bosonic scotogenic dark matter are discussed, along with scoto-seesaw models that merge scotogenic and seesaw mechanisms, and scenarios where the dark sector triggers a low-scale seesaw. These frameworks can accommodate dark matter as either Weakly Interacting Massive Particles (WIMPs) or Feebly Interacting Massive Particles (FIMPs). While hidden dark sector models are inherently difficult to test experimentally, those based on visible dark sectors offer clear predictions that could be confirmed -- or ruled out -- by forthcoming dark matter searches, collider experiments, and lepton flavor violation studies.\n\n", "2506.23905": "2025-06-30, **Neutrino oscillations in the Ellis wormhole spacetime**, Ya-Ru Wang et.al., [2506.23905v1](http://arxiv.org/abs/2506.23905v1)\n\n Gravitational lensing is a powerful tool to probe compact astrophysical objects and the distribution of dark matter at large scales. As a counterpart of photons, lensed relativistic neutrinos could also be used to explore properties of curved spacetimes. In the present paper we consider neutrino oscillations in the Ellis wormhole (WH) spacetime in comparison with the widely discussed black hole (BH) spacetimes. We investigate the oscillations involving lensing effects with 2- and 3-flavor neutrinos under the weak-field approximation. In the two-flavor model, the flavor oscillation probabilities display the impacts of the throat radius, neutrino mass hierarchy, and the lightest neutrino mass. In the realistic 3-flavor case, the similar observations are obtained with the up-to-date global fit data of neutrino experiments. The influence of the Ellis WH on the coherence of neutrinos is also studied in the paper. In general, the observations from neutrino oscillations cannot be used to discriminate Ellis WH spacetimes from typical BH spacetimes under the weak-field limit.\n\n", "2506.23887": "2025-06-30, **The Echo 12-23 Texture: A Novel Flavour Paradigm for Neutrinos**, Manash Dey et.al., [2506.23887v2](http://arxiv.org/abs/2506.23887v2)\n\n We construct a flavour guided model that realises the distinctive Echo 12-23 Texture in the neutrino mass matrix through a non-trivial interplay of symmetries. While the model accounts for charged lepton mass hierarchy, the texture offers interesting insights specifically into neutrino mass ordering and flavour dynamics. With clear imprints on low energy observables, the framework provides a minimal yet testable path toward understanding the origin of neutrino properties.\n\n", "2506.23885": "2025-06-30, **Modeling blazar broadband emission with convolutional neural networks -- III. proton synchrotron and hybrid models**, N. Sahakyan et.al., [2506.23885v1](http://arxiv.org/abs/2506.23885v1)\n\n Modeling the broadband emission of blazars has become increasingly challenging with the advent of multimessenger observations. Building upon previous successes in applying convolutional neural networks (CNNs) to leptonic emission scenarios, we present an efficient CNN-based approach for modeling blazar emission under proton synchrotron and hybrid lepto-hadronic frameworks. Our CNN is trained on extensive numerical simulations generated by SOPRANO, which span a comprehensive parameter space accounting for the injection and all significant cooling processes of electrons and protons. The trained CNN captures complex interactions involving both primary and secondary particles, effectively reproducing electromagnetic and neutrino emissions. This allows for rapid and thorough exploration of the parameter space characteristic of hadronic and hybrid emission scenarios. The effectiveness of the trained CNN is demonstrated through fitting the spectral energy distributions of two prominent blazars, TXS 0506+059 and PKS 0735+178, both associated with IceCube neutrino detections. The modeling is conducted under assumptions of constant neutrino flux across distinct energy ranges, as well as by adopting a fitting that incorporates the expected neutrino event count through a Poisson likelihood method. The trained CNN is integrated into the Markarian Multiwavelength Data Center (MMDC; https://www.mmdc.am), offering a robust tool for the astrophysical community to explore blazar jet physics within a hadronic framework.\n\n"}, "dark matter": {"2506.24077": "2025-06-30, **The distribution of metals in simulated Milky Way-mass galaxies**, Federico G. Iza et.al., [2506.24077v1](http://arxiv.org/abs/2506.24077v1)\n\n Galaxies form due to the continuous accretion of gaseous material towards the centre of dark matter haloes, which gives rise to stellar discs once the gas reaches high density. Analysis of stellar age distribution shows that stars in the inner regions of the disc are born at earlier times, in contrast to those found in the outer regions, which constitute a younger population. This scheme, typical of galactic formation processes, is known as the \"inside-out\" scenario and is closely related to the global properties of a significant fraction of the population of spiral galaxies. In this study, we analyse model galaxies from the Auriga project, a set of high-resolution, magnetohydrodynamic cosmological simulations of Milky Way-mass galaxies, to investigate the distribution of metals at $z=0$. Since different galactic components were subjected to different formation histories, we focus on the distribution of metals in the halo, bulge, and disc using a dynamical decomposition method based on the degree of rotation of the stars and their gravitational potential.\n\n", "2506.24022": "2025-06-30, **Cosmic Axions Revealed via Amplified Modulation of Ellipticity of Laser (CARAMEL)**, Hooman Davoudiasl et.al., [2506.24022v1](http://arxiv.org/abs/2506.24022v1)\n\n We propose a new axion dark matter detection strategy that employs optical readout of laser beam ellipticity modulations caused by axion-induced electric fields in a microwave cavity, using electro-optic (EO) crystals, enhanced by externally injected radio-frequency (RF) power. Building upon the variance-based probing method, PRD 107, 103005, (2023), we extend this concept to the optical domain: a weak probe laser interacts with an EO crystal placed inside a resonant microwave cavity at cryogenic temperatures, and the axion-induced electric field is revealed through induced ellipticity. The injected RF signal coherently interferes with that of the axion field, amplifying the optical response and significantly improving sensitivity. While our EO-based method employs a Fabry-Perot resonator, we do not require Michelson interferometers. Our method hence enables compact, high-frequency axion searches, across the 0.5-50\\,GHz range. Operating at cryogenic temperatures not only suppresses thermal backgrounds but, critically, allows the probing method to mitigate the laser quantum noise. This approach offers a scalable path forward for axion detection over the $\\sim (\\text{few}-200$)~$\\mu$eV mass range -- covering the preferred parameter space for the post-inflationary Peccei-Quinn axion dark matter -- using compact, tunable systems.\n\n", "2506.24002": "2025-06-30, **Line-of-sight acceleration as a test of the Galactic Yukawa potential**, Felipe A. da Silva Barbosa et.al., [2506.24002v1](http://arxiv.org/abs/2506.24002v1)\n\n We forecast the impact of direct radial acceleration measurements, based on two redshift measurements of the same target one decade apart, on constraining the Yukawa correction to the Newtonian potential in the Milky Way. The Galaxy's matter distribution is modeled as the sum of a spherical bulge, a spherical dark matter halo, and two axially symmetric disks. Considering a sample of 165 Milky Way globular clusters, we find that the precision of next-generation spectrographs ($\\sim$ 10 cm s$^{-1}$) is not sufficient to provide competitive constraints compared to rotation curve data using the same baryonic matter distribution. The latter sample only becomes competitive for a precision better than 0.6 cm s$^{-1}$. On the other hand, we find that adopting a population of $1.3 \\times 10^5$ RR Lyrae stars as targets, a precision of $\\sim$ 10 cm s$^{-1}$ can achieve constraints on the Yukawa parameters as strong as with the rotation curves.\n\n", "2506.23770": "2025-06-30, **Constraining Inflation via FIMP dark matter using the $β$-function with collider implications**, Sarif Khan et.al., [2506.23770v1](http://arxiv.org/abs/2506.23770v1)\n\n The present study connects inflation and freeze-in type dark matter (DM) within the same setup. Although the observables in these two phenomena lie at vastly different energy scales, they have been properly handled using the RG running of couplings. For studying DM and inflation, the SM has been minimally extended by introducing an abelian dark gauge symmetry and a dark singlet scalar. In studying inflation, the SM Higgs doublet has been considered as the inflaton, which has a non-minimal coupling with the Ricci scalar. All inflationary observables have been computed at the horizon exit scale and constrained using the Planck data. Moreover, inflationary constraints have revealed strong correlations among model parameters, significantly reducing the allowed parameter space. In particular, in the Higgs mixing angle and BSM Higgs mass plane, only those values that ensure the Higgs quartic coupling remains above 0.18 are allowed. The additional gauge boson serves as a suitable DM candidate, produced via the freeze-in mechanism and stabilised by charge conjugation symmetry. The upper bound on the DM relic density further shrinks the parameter space allowed from inflationary constraints, becoming even narrower if we assume that the present vector DM constitutes the total DM density. Since DM interactions are feeble, it remains safe from all terrestrial experimental constraints. Additionally, the feeble dark matter coupling requires the dark Higgs-Ricci scalar non-minimal coupling to be negligible to satisfy Higgs inflation conditions. Finally, we have explored collider aspects and found that the trilinear and quartic Higgs vertices deviate from their SM values after incorporating inflation and DM constraints. Therefore, once we measure $\\kappa\\_{3,4}$ at the future collider, we can establish the robustness of the Higgs inflation scenario.\n\n", "2506.23761": "2025-06-30, **Macroscopic states in Bose-Einstein condensate dark matter model with axionlike interaction**, A. V. Nazarenko et.al., [2506.23761v1](http://arxiv.org/abs/2506.23761v1)\n\n The phase diagrams of ultralight dark matter (DM), modeled as a self-gravitating Bose-Einstein condensate with axionlike interaction, are studied. We classify stable, metastable, and unstable DM states over a wide range of condensate wave function amplitudes. It is shown that the axionlike interaction causes instability and an imaginary speed of sound at low amplitudes, whereas, in a specific high-amplitude band, DM attains a stable state capable of forming a dense solitonic core and suppressing quantum fluctuations in the surrounding galactic DM halo. These findings are corroborated by evaluating thermodynamic functions for DM in the dwarf galaxy NGC2366 and its hypothetical analogs with different core-to-halo mass ratios. Distinct DM phase compositions respond differently to fluctuation-induced partial pressure, resulting in a first-order phase transition in a certain range of an interaction parameter. While the DM properties in NGC2366 lie within the supercritical regime, the phase transition nonetheless provides a thermodynamic marker separating stable from unstable DM configurations. Once a dense core forms - reaching a threshold of about 12% of the total mass - the enhanced gravitation stabilizes the DM halo against fluctuations, while the internal pressure ensures core stability. In particular, we find that NGC2366's dense DM comprises roughly 19% of the DM mass while occupying only 4.7% of its total volume.\n\n", "2506.23752": "2025-06-30, **Significance of soft-scale breaking on primordial black hole production in Coleman-Weinberg type supercooling-phase transition**, He-Xu Zhang et.al., [2506.23752v1](http://arxiv.org/abs/2506.23752v1)\n\n Ultra-supercooling phase transitions can generate large overdensities in the Universe, potentially leading to the formation of primordial black holes (PBHs), which can also be a dark matter candidate. In this work, we focus on the supercooling phase transition for the scale symmetry breaking based on the effective potential of the Coleman-Weinberg (CW) type. We investigate the effect on the PBH production in the presence of an additional mass term for the CW scalar field, what we call a soft-scale breaking term, which serves as the extra explicit-scale breaking term other than the quantum scale anomaly induced by the CW mechanism. We demonstrate that even a small size of the soft-scale breaking term can significantly affect the PBH production depending on its sign: a positive term slows down the phase transition, thereby enhancing the PBH abundance and improving the model's ability to account for dark matter; in contrast, a negative term suppresses the PBH formation. The inclusion of such soft-scale breaking terms broadens the viable parameter space and increases the flexibility of the framework. We further illustrate our results through two ultraviolet-complete realizations: i) a many-flavor QCD-inspired model as a reference model which can dynamically induce a positive-soft scale breaking; ii) a Higgs portal model with a $B-L$ scalar as the benchmark for the case where a negative-soft scale breaking is induced. Our study would provide a new testable link between PBH dark matter and gravitational wave signatures in the CW-type scenario.\n\n"}, "supernova": {"2506.23564": "2025-06-30, **Acceleration and Transport of the Unstable Cosmic-ray Isotope $^{60}$Fe in Supernova-Enriched Environments**, Xin-Yue Shi et.al., [2506.23564v1](http://arxiv.org/abs/2506.23564v1)\n\n The unstable isotope $^{60}$Fe, with a half-life of 2.6 million years, is produced primarily in supernova explosions. The observed presence of $^{60}$Fe in cosmic rays and its detection in deep-sea crusts and sediments suggest two possible scenarios: either the direct acceleration of $^{60}$Fe from supernova ejecta or its enrichment in the circumstellar material surrounding supernova progenitors, which indicates cosmic ray production in clusters of supernovae. Focusing on the latter scenario, we consider an environment shaped by successive supernova explosions, reminiscent of the Local Bubble around the time of the most recent supernova explosion. We independently tracked the evolution of the $^{60}$Fe mass ratio within the Local Bubble using passive scalars. To investigate the spectra of protons and $^{60}$Fe, we explicitly modelled cosmic-ray acceleration and transport at the remnant of the last supernova by simultaneously solving the hydrodynamical equations for the supernova outflow and the transport equations for cosmic rays, scattering turbulence, and large-scale magnetic field, using the time-dependent acceleration code RATPaC. The main uncertainty in our prediction of the local $^{60}$Fe flux at about $pc=1$ GeV/nuc is the magnetic-field structure in the Local Bubble and the cosmic-ray diffusion beyond the approximately $100$ kyr of evolution covered by our study. We found that if the standard galactic propagation applies, the local $^{60}$Fe flux would be around 3% of that measured. If there is a sustained reduction in the diffusion coefficient at and near the Local Bubble, then the expected $^{60}$Fe flux could be up to 30% of that measured.\n\n", "2506.23556": "2025-06-30, **What Prevents Resolving the Hubble Tension through Late-Time Expansion Modifications?**, Zhihuan Zhou et.al., [2506.23556v1](http://arxiv.org/abs/2506.23556v1)\n\n We demonstrate that Type Ia supernovae (SNe Ia) observations impose the critical constraint for resolving the Hubble tension through late-time expansion modifications. Applying the Fisher-bias optimization framework to cosmic chronometers (CC), baryon acoustic oscillations (BAO) from DESI DR2, Planck CMB, and Pantheon+ data, we find that: (i) deformations in $H(z \\lesssim 3)$ (via $w(z)$ reconstruction) can reconcile tensions between CC, Planck, DESI BAO, and SH0ES measurements while maintaining or improving fit quality ($\\Delta\\chi^2 < 0$ relative to $\\Lambda$CDM); (ii) In the neighborhood of Planck best-fit $\\Lambda$CDM model, no cosmologically viable solutions targeting $H\\_0 \\gtrsim 69$ satisfy SNe Ia constraints. MCMC validation confirms the maximum achievable $H\\_0 = 69.09\\pm0.30$ ($\\chi^2\\_{\\rm BF} \\approx \\chi^2\\_{\\Lambda\\rm CDM}$) across all data combinations, indicating that the conflict between late-time $w(z)$ modifications and SNe Ia observations prevents complete resolution of the Hubble tension.\n\n"}}