{"neutrino": {"2307.14204": "2023-07-26, **On the lensing impact on cosmic relics $\\&$ tensions**, William Giarè et.al., [2307.14204v1](http://arxiv.org/abs/2307.14204v1)\n\n Cosmological bounds on neutrinos and additional hypothetical light thermal relics, such as QCD axions, are currently among the most restrictive ones. These limits mainly rely on Cosmic Microwave Background temperature anisotropies. Nonetheless, one of the largest cosmological signatures of thermal relics is that on gravitational lensing, due to their free streaming behavior before their non-relativistic period. We investigate late time only hot relic mass constraints, primarily based on recently released lensing data from the Atacama Cosmology Telescope, both alone and in combination with lensing data from the Planck Satellite. Additionally, we consider other local probes, such as Baryon Acoustic Oscillations measurements, shear-shear, galaxy-galaxy, and galaxy-shear correlation functions from the Dark Energy Survey, and distance moduli measurements from Type Ia Supernovae. The tightest bounds we find are $\\sum m\\_\\nu<0.43$ eV and $m\\_a<1.1$ eV, both at $95\\%$ CL. Interestingly, these limits are still much stronger than those found on e.g. laboratory neutrino mass searches, reassessing the robustness of the extraction of thermal relic properties via cosmological observations. In addition, when considering lensing-only data, the significance of the Hubble constant tension is considerably reduced, while the clustering parameter $\\sigma\\_8$ controversy is completely absent.\n\n", "2307.14121": "2023-07-26, **Diraxiogenesis**, Maximilian Berbig et.al., [2307.14121v1](http://arxiv.org/abs/2307.14121v1)\n\n The family of Dirac Seesaw models offers an intriguing alternative explanation for the smallness of neutrino masses without necessarily requiring microscopic lepton number violation, when compared to the more familiar class of Majorana Seesaws. A global $\\text{U}(1)\\_\\text{D}$ symmetry, that is explicitly broken by a higher dimensional scalar operator, ensures that the right handed neutrino does not couple directly to the Standard Model like Higgs and an exact gauged or residual lepton number symmetry prohibits all Majorana masses. We demonstrate that all three Dirac Seesaws possess a Pseudo-Nambu-Goldstone boson associated with the $\\text{U}(1)\\_\\text{D}$ symmetry, that we call the Diraxion, whose cosmological dynamics have so far been left unexplored. Furthermore we illustrate that a Dirac-Leptogenesis version of the recently proposed Lepto-Axiogenesis scenario can be realized in this class of models, leading to a unified origin of the observed baryon asymmetry and dark matter relic abundance. Explaining only the baryon asymmetry can lead to potentially observable amounts of right handed neutrino dark radiation with $\\Delta N\\_\\text{eff.}\\lesssim 0.028$. On the other hand, if we only fix the dark matter abundance via the kinetic misalignment mechanism, this set-up could lead to detectable signatures in proposed cosmic neutrino background experiments via decays of eV-scale Diraxions to neutrinos. Here there is no domain wall problem, since topological defects immediately decay to a subleading fraction of relic Diraxions. A key ingredient of all Axiogenesis scenarios is the dynamics of relatively light scalar called the Saxion, that in our case has a mass at the GeV-scale and which might reveal itself in heavy meson decays or collider searches. Our setup predicts isocurvature perturbations in baryons, dark matter and dark radiation sourced by fluctuations of the Saxion.\n\n", "2307.14102": "2023-07-26, **Automatic test system for the data acquisition board of GRANDProto300**, Yiren Chen et.al., [2307.14102v1](http://arxiv.org/abs/2307.14102v1)\n\n The Giant Radio Array for Neutrino Detection (GRAND) aims to detect the radio emission from air showers triggered by ultra-high-energy particles in the atmosphere. GRANDProto300 is its pathfinder array, of which the first 100 detection units have already been produced. A custom data acquisition (DAQ) board receives, processes, and transmits radio signals. We report on the board design, and on the functions and performance tests applied to it. Function tests are of signal acquisition and transmission, and of the field-programmable gate array (FPGA) filter algorithm. Performance tests are of the analog-to-digital conversion and GPS time accuracy. We developed an efficient system to automate the test, in line with the mass-production scale needed to build future, larger versions of GRAND.\n\n", "2307.14086": "2023-07-26, **Measurement of the $2νββ$ decay rate and spectral shape of $^{100}$Mo from the CUPID-Mo experiment**, C. Augier et.al., [2307.14086v1](http://arxiv.org/abs/2307.14086v1)\n\n Neutrinoless double beta decay ($0\\nu\\beta\\beta$) is a yet unobserved nuclear process which would demonstrate Lepton Number violation, a clear evidence of beyond Standard Model physics. The process two neutrino double beta decay ($2\\nu\\beta\\beta)$ is allowed by the Standard Model and has been measured in numerous experiments. In this letter, we report a measurement of $2\\nu\\beta\\beta$ decay half-life of $^{100}$Mo to the ground state of $^{100}$Ru of $(7.07~\\pm~0.02~\\text{(stat.)}~\\pm~0.11~\\text{(syst.)})~\\times~10^{18}$~yr by the CUPID-Mo experiment. With a relative precision of $\\pm~1.6$ \\% this is the most precise measurement to date of a $2\\nu\\beta\\beta$ decay rate in $^{100}$Mo. In addition, we constrain higher-order corrections to the spectral shape which provides complementary nuclear structure information. We report a novel measurement of the shape factor $\\xi\\_{3,1}=0.45~\\pm 0.03~\\text{(stat.)} \\ \\pm 0.05 \\ \\text{(syst.)}$, which is compared to theoretical predictions for different nuclear models. We also extract the first value for the effective axial vector coupling constant obtained from a spectral shape study of $2\\nu\\beta\\beta$ decay.\n\n", "2307.14069": "2023-07-26, **Towards a more robust reconstruction method for IceCube's real-time program**, G. Sommani et.al., [2307.14069v1](http://arxiv.org/abs/2307.14069v1)\n\n Sources of astrophysical neutrinos can potentially be discovered through the detection of neutrinos in coincidence with electromagnetic counterparts. Real-time alerts generated by IceCube play an important role in this search, acting as triggers for follow-up observations with instruments sensitive to electromagnetic signals in various wavelengths. In previous studies, we investigated the treatment of the systematic uncertainties on the reconstruction method currently used in IceCube's real-time program, concluding that a new approach, more robust against systematic variations, is needed. Here we present the state-of-the-art of these analyses, and discuss a modification to an already-existing and reliable reconstruction method that results in an improved solution under many metrics. The proposed reconstruction method is faster, more precise, and significantly less influenced by systematic uncertainties, than the current one. This system provides a more robust estimate of angular uncertainties than the previous algorithm, making it a solid benchmark for real-time event analyses.\n\n", "2307.14053": "2023-07-26, **Intergenerational gauged $B-L$ model and its implication to muon $g-2$ anomaly and thermal dark matter**, Nobuchika Okada et.al., [2307.14053v1](http://arxiv.org/abs/2307.14053v1)\n\n We study the flavor dependent $U(1)\\_{B\\_i-L\\_j}$ models, where an $i$-th generation of quarks and $j(\\neq i)$-th generation of leptons are charged. By solving the anomaly free condition for the matter sector of the SM fermions and three generations of RH neutrinos, we find that the $j$-th generation of RH neutrino is not necessarily charged under the $U(1)\\_{B\\_i-L\\_j}$ gauge symmetry with the charge $-1$ and the other (neither $i$-th nor $j$-th) generation of RH neutrino can also be. As a general solution for the anomaly cancellation conditions, the other two RN neutrinos than the charge $-1$ RH neutrino may have non-vanishing charge and be stable due to the gauge invariance, and hence it is a candidate for dark matter (DM) in our Universe. We apply this result to a $B\\_3-L\\_2$ model and consider a light thermal DM and a solution to the muon $g-2$ anomaly. We identify the parameter region to have the DM mass range from MeV to sub-GeV and simultaneously solve the muon $g-2$ anomaly. We also derive the constraints on the gauge kinetic mixing parameter by using the latest Borexino Phase-II data.\n\n", "2307.13971": "2023-07-26, **Direction reconstruction for the in-ice radio array of IceCube-Gen2**, Sjoerd Bouma et.al., [2307.13971v1](http://arxiv.org/abs/2307.13971v1)\n\n The IceCube-Gen2 facility will extend the energy range of IceCube to ultra-high energies. The key component to detect neutrinos with energies above 10 PeV is a large array of in-ice radio detectors. In previous work, direction reconstruction algorithms using the forward-folding technique have been developed for both shallow ($\\lesssim 20$ m) and deep in-ice detectors, and have also been successfully used to reconstruct cosmic rays with ARIANNA. Here, we focus on the reconstruction algorithm for the deep in-ice detector, which was recently introduced in the context of the Radio Neutrino Observatory in Greenland (RNO-G). We discuss the performance-critical aspects of the algorithm, as well as recent and future improvements, and apply it to study the performance of a station of the IceCube-Gen2 in-ice radio array. We obtain the angular resolution, which turns out to be strongly asymmetric, and use this to optimize the configuration of a single station.\n\n", "2307.13969": "2023-07-26, **Three-year performance of the IceAct telescopes at the IceCube Neutrino Observatory**, Lars Heuermann et.al., [2307.13969v1](http://arxiv.org/abs/2307.13969v1)\n\n IceAct is an array of compact Imaging Air Cherenkov Telescopes at the ice surface as part of the IceCube Neutrino Observatory. The telescopes, featuring a camera of 61 silicon photomultipliers and fresnel-lens-based optics, are optimized to be operated in harsh environmental conditions, such as at the South Pole. Since 2019, the first two telescopes have been operating in a stereoscopic configuration in the center of IceCube's surface detector IceTop. With an energy threshold of about 10 TeV and a wide field-of-view, the IceAct telescopes show promising capabilities of improving current cosmic-ray composition studies: measuring the Cherenkov light emissions in the atmosphere adds new information about the shower development not accessible with the current detectors. First simulations indicate that the added information of a single telescope leads, e.g., to an improved discrimination between flux contributions from different primary particle species in the sensitive energy range. We review the performance and detector operations of the telescopes during the past 3 years (2020-2022) and give an outlook on the future of IceAct.\n\n", "2307.13967": "2023-07-26, **$N_{\\rm eff}$ constraints on light mediators coupled to neutrinos: the dilution-resistant effect**, Shao-Ping Li et.al., [2307.13967v1](http://arxiv.org/abs/2307.13967v1)\n\n We investigate the impact of new light particles, carrying significant energy in the early universe after neutrino decoupling, on the cosmological effective relativistic neutrino species, $N\\_{{\\rm eff}}$. If the light particles are produced from decoupled neutrinos, $N\\_{{\\rm eff}}$ is predominantly modified through the dilution-resistant effect. This effect arises because the energy stored in the mass of new particles is less diluted than the photon and neutrino energy as the universe expands. Our study comprehensively explores this effect, deriving $N\\_{{\\rm eff}}$ constraints on the couplings of light mediators with neutrinos, encompassing both scalar and vector mediators. We find that the dilution-resistant effect can increase $N\\_{{\\rm eff}}$ by 0.118 and 0.242 for scalar and vector mediators, respectively. These values can be readily reached by forthcoming CMB experiments. Upon reaching these levels, future $N\\_{{\\rm eff}}$ constraints on the couplings will be improved by many orders of magnitude.\n\n", "2307.13965": "2023-07-26, **Towards a cosmic ray composition measurement with the IceAct telescopes at the IceCube Neutrino Observatory**, Larissa Paul et.al., [2307.13965v1](http://arxiv.org/abs/2307.13965v1)\n\n The IceCube Neutrino Observatory is equipped with the unique possibility to measure cosmic ray induced air showers simultaneously by their particle footprint on the surface with the IceTop detector and by the high-energy muonic shower component at a depth of more than 1.5 km. Since 2019 additionally two Imaging Air Cherenkov Telescopes, called IceAct, measure the electromagnetic component of air showers in the atmosphere above the IceCube detector. This opens the possibility to measure air shower parameters in three independent detectors and allows to improve mass composition studies with the IceCube data. One IceAct camera consists of 61 SiPM pixels in a hexagonal grid. Each pixel has a field of view of 1.5 degree resulting in an approximately 12-degree field of view per camera. A single telescope tube has a diameter of 50 cm, is built robust enough to withstand the harsh Antarctic conditions, and is able to detect cosmic ray particles with energies above approximately 10 TeV. A Graph Neural Network (GNN) is trained to determine the air shower properties from IceAct data. The composition analysis is then performed using Random Forest Regression (RF). Since all three detectors have a different energy threshold, we train several RFs with different inputs, combining the different detectors and taking advantage of the lower energy threshold of the IceAct telescopes. This will result in composition measurements for different detector combinations and enables cross-checks of the results in overlapping energy bands. We present the method, parameters for data selection, and the status of this analysis.\n\n", "2307.13951": "2023-07-26, **An improved mapping of ice layer undulations for the IceCube Neutrino Observatory**, Dmitry Chirkin et.al., [2307.13951v1](http://arxiv.org/abs/2307.13951v1)\n\n A precise understanding of the optical properties of the instrumented Antarctic ice sheet is crucial to the performance of the IceCube Neutrino Observatory, a cubic-kilometer Cherenkov array of 5,160 digital optical modules (DOMs) deployed in the deep ice below the geographic South Pole. We present an update to the description of the ice tilt, which describes the undulation of layers of constant optical properties as a function of depth and transverse position in the detector. To date, tilt modeling has been based solely on stratigraphy measurements performed by a laser dust logger during the deployment of the array. We now show that it can independently be deduced using calibration data from LEDs located in the DOMs. The new fully volumetric tilt model not only confirms the magnitude of the tilt along the direction orthogonal to the ice flow obtained from prior dust logging, but also includes a newly discovered tilt component along the flow.\n\n", "2307.13895": "2023-07-26, **Neutrino mixing sum rules and the Littlest Seesaw**, Francesco Costa et.al., [2307.13895v1](http://arxiv.org/abs/2307.13895v1)\n\n In this work, we revisit neutrino mixing sum rules arising from discrete symmetries, and the class of Littlest Seesaw neutrino models. These theoretical models offer predictions for the leptonic CP phase and mixing angles, and correlations among them, which can be tested in forthcoming neutrino experiments. In particular, we study the solar neutrino mixing sum rules, arising from charged lepton corrections to Tri-bimaximal (TB), Bi-maximal (BM), Golden Ratios (GRs), and Hexagonal (HEX) neutrino mixing, and atmospheric neutrino mixing sum rules, arising from preserving one of the columns of these types of mixing, for example, the first or second column of the TB mixing matrix (TM1 or TM2), and confront them with an up-to-date global fit of the neutrino oscillation data. We show that some mixing sum rules, for example, an atmospheric neutrino mixing sum rule arising from a version of neutrino Golden Ratio mixing (GRa1), are already excluded at $3\\sigma$, and determine the remaining models allowed by the data. We also consider the highly predictive Littlest Seesaw models, which are a special case of tri-maximal mixing models (TM1), and discuss their prospects\n\n", "2307.13878": "2023-07-26, **Updated directions of IceCube HESE events with the latest ice model using DirectFit**, Tianlu Yuan et.al., [2307.13878v1](http://arxiv.org/abs/2307.13878v1)\n\n The initial evidence of astrophysical neutrinos by the IceCube Neutrino Observatory stemmed from the high-energy starting events (HESE) sample: a selection of the highest-energy neutrino interactions that occurred within the detector fiducial volume. Each event was reconstructed based on our best knowledge of the ice at the time, with the latest results published in a description of the sample using 7.5 years of data. Since then, several major improvements in ice modeling have occurred using in-situ calibration data. These include a microscopic description of ice anisotropy arising from ice crystal birefringence and a more complete mapping of the ice layer undulations across the detector. The improvements feed into more accurate descriptions of individual events, and can especially affect the directional reconstruction of particle showers. Here, we apply the latest ice model in an exact manner to reconstruct IceCube's high-energy events using DirectFit. This reconstruction samples posterior distributions across parameters of interest by performing full event resimulation and photon propagation at each step. We obtain improved per-event descriptions, as well as updates on previously published source searches using the aggregated sample.\n\n", "2307.13792": "2023-07-25, **Detection of astrophysical neutrinos at prospective locations of dark matter detectors**, Yi Zhuang et.al., [2307.13792v1](http://arxiv.org/abs/2307.13792v1)\n\n We study the prospects for detection of solar and atmospheric neutrino fluxes at future large-scale dark matter detectors through both electron and nuclear recoils. We specifically examine how the detection prospects change for several prospective detector locations (SURF, SNOlab, Gran Sasso, CJPL, and Kamioka), and improve upon the statistical methodologies used in previous studies. Due to its ability to measure lower neutrino energies than other locations, we find that the best prospects for the atmospheric neutrino flux are at the SURF location, while the prospects are weakest at CJPL because it is restricted to higher neutrino energies. On the contrary, the prospects for the diffuse supernova neutrino background (DSNB) are best at CJPL, due largely to the reduced atmospheric neutrino background at this location. Including full detector resolution and efficiency models, the CNO component of the solar flux is detectable via the electron recoil channel with exposures of $\\sim 10^3$ ton-yr for all locations. These results highlight the benefits for employing two detector locations, one at high and one at low latitude.\n\n", "2307.13790": "2023-07-25, **A neutrino window to scalar leptoquarks: from low energy to colliders**, Valentina De Romeri et.al., [2307.13790v1](http://arxiv.org/abs/2307.13790v1)\n\n Leptoquarks are theorized particles of either scalar or vector nature that couple simultaneously to quarks and leptons. Motivated by recent measurements of coherent elastic neutrino-nucleus scattering, we consider the impact of scalar leptoquarks coupling to neutrinos on a few complementary processes, from low energy to colliders. In particular, we set competitive constraints on the typical mass and coupling of scalar leptoquarks by analyzing recent COHERENT data. We compare these constraints with bounds from atomic parity violation experiments, deep inelastic neutrino-nucleon scattering and LHC data. Our results highlight a strong complementarity between different facilities and demonstrate the compelling power of coherent elastic neutrino-nucleus scattering experiments to probe leptoquark masses in the MeV-GeV range. Finally, we also present prospects for improving current bounds with future upgrades of the COHERENT detectors and the planned European Spallation Source.\n\n", "2307.13731": "2023-07-25, **Multimessenger search for electrophilic feebly interacting particles from supernovae**, Pedro De la Torre Luque et.al., [2307.13731v1](http://arxiv.org/abs/2307.13731v1)\n\n We study MeV-scale electrophilic Feebly Interacting Particles (FIPs), that may be abundantly produced in Supernova (SN) explosions, escape the star and decay into electrons and positrons. This exotic injection of leptons in the Milky Way leaves an imprint in both photon and cosmic-ray fluxes. Specifically, positrons lose energy and annihilate almost at rest with background electrons, producing photons with $511$ keV energy. In addition, electrons and positrons radiate photons through bremsstrahlung emission and upscatter the low-energy galactic photon fields via the inverse Compton process generating a broad emission from X-ray to $\\gamma$-ray energies. Finally, electrons and positrons are directly observable in cosmic ray experiments. In order to describe the FIP-induced lepton injection in full generality, we use a model independent parametrization which can be applied to a host of FIPs such as axion-like particles, dark photons and sterile neutrinos. Theoretical predictions are compared to experimental data to robustly constrain FIP-electron interactions with an innovative multimessenger analysis.\n\n", "2307.13638": "2023-07-25, **The Giant Radio Array for Neutrino Detection**, João R. T. de Mello Neto et.al., [2307.13638v1](http://arxiv.org/abs/2307.13638v1)\n\n Ultra-high-energy cosmic neutrinos (UHE), with energies above 100 PeV, are unparalleled probes of the most energetic astrophysical sources and weak interactions at energies beyond the reach of accelerators. GRAND is an envisioned observatory of UHE particles - neutrinos, cosmic rays, and gamma rays - consisting of 200,000 radio antennas deployed in sub-arrays at different locations worldwide. GRAND aims to detect the radio emission from air showers induced by UHE particle interactions in the atmosphere and underground. For neutrinos, it aims to reach a flux sensitivity of $\\sim 10^{-10}$ GeV cm$^{-2}$ s$^{-1}$ sr$^{-1}$, with a sub-degree angular resolution, which would allow it to test the smallest predicted diffuse fluxes of UHE neutrinos and to discover point sources. The GRAND Collaboration operates three prototype detector arrays simultaneously: GRAND@Nan\\c{c}ay in France, GRANDProto300 in China, and GRAND@Auger in Argentina. The primary purpose of GRAND@Nan\\c cay is to serve as a testbench for hardware and triggering systems. On the other hand, GRANDProto300 and GRAND@Auger are exploratory projects that pave the way for future stages of GRAND. GRANDProto300 is being built to demonstrate autonomous radio-detection of inclined air showers and study cosmic rays near the proposed transition between galactic and extragalactic sources. All three arrays are in the commissioning stages. It is expected that by 2028, the detector units of the final design could be produced and deployed, marking the establishment of two GRAND10k arrays in the Northern and Southern hemispheres. We will survey preliminary designs, simulation results, construction plans, and the extensive research program made possible by GRAND.\n\n", "2307.13524": "2023-07-25, **The format for GRAND data storage and related Python interfaces**, Lech Wiktor Piotrowski et.al., [2307.13524v1](http://arxiv.org/abs/2307.13524v1)\n\n The vast amounts of data to be collected by the Giant Radio Array for Neutrino Detection (GRAND) and its prototype - GRANDProto300 - require the use of a data format very efficient in terms of i/o speed and compression. At the same time, the data should be easily accessible, without the knowledge of the intricacies of the format, both for bulk processing and for detailed event-by-event analysis and reconstruction. We present the format and the structure prepared for GRAND data, the concept of the data-processing chain, and data-oriented and analysis-oriented interfaces written in Python.\n\n", "2307.13493": "2023-07-25, **Flavor-dependent $U(1)$ extension inspired by lepton, baryon and color numbers**, Duong Van Loi et.al., [2307.13493v1](http://arxiv.org/abs/2307.13493v1)\n\n There is no reason why the gauge symmetry extension is family universal as in the standard model and the most well-motivated models, e.g. left-right symmetry and grand unification. Hence, we propose a simplest extension of the standard model -- a flavor-dependent $U(1)$ gauge symmetry -- and find the new physics insight. For this aim, the $U(1)$ charge, called $X$, is expressed as $X=x B+y L$ in which $x$ and $y$ are free parameters as functions of flavor index, e.g. for a flavor $i$ they take $x\\_i$ and $y\\_i$ respectively, where $B$ and $L$ denote normal baryon and lepton numbers. Imposing a relation involved by the color number $3$, i.e. $-x\\_{1,2,\\cdots,n}=x\\_{n+1,n+2,\\cdots,n+m}=3y\\_{1,2,\\cdots,n+m}\\equiv 3z$, for arbitrarily nonzero $z$, we achieve a novel $U(1)$ theory with implied $X$-charge. This theory not only explains the origin of the number of observed fermion families but also offers a possible solution for both neutrino mass and dark matter, which differs from $B-L$ extension. Two typical models based on this idea are examined, yielding interesting results for flavor-changing neutral currents and particle colliders, besides those of neutrino mass and dark matter.\n\n", "2307.13273": "2023-07-25, **High-energy neutrino constraints on cosmic-ray re-acceleration in radio halos of massive galaxy clusters**, Kosuke Nishiwaki et.al., [2307.13273v1](http://arxiv.org/abs/2307.13273v1)\n\n A fraction of merging galaxy clusters host diffuse radio emission in their central region, termed as a giant radio halo (GRH). The most promising mechanism of GRHs is the re-acceleration of non-thermal electrons and positrons by merger-induced turbulence. However, the origin of these seed leptons has been under debate, and either protons or electrons can be primarily-accelerated particles. In this work, we demonstrate that neutrinos can be used as a probe of physical processes in galaxy clusters, and discuss possible constraints on the amount of relativistic protons in the intra-cluster medium with the existing upper limits by IceCube. We calculate radio and neutrino emission from massive ($>10^{14}M\\_\\odot$) galaxy clusters, using the cluster population model of Nishiwaki & Asano (2022). This model is compatible with the observed statistics of GRHs, and we find that the contribution of GRHs to the isotropic radio background observed with the ARCADE-2 experiment should be subdominant. Our fiducial model predicts the all-sky neutrino flux that is consistent with IceCube's upper limit from the stacking analysis. We also show that the neutrino upper limit gives meaningful constraints on the parameter space of the re-acceleration model, such as the electron-to-proton ratio of primary cosmic-rays and the magnetic field, and in particular the secondary scenario, where the seed electrons mostly originate from inelastic $pp$ collisions, can be constrained even in the presence of re-acceleration.\n\n", "2307.13234": "2023-07-25, **The simulated performance of GRANDProto300**, Kai-Kai Duan et.al., [2307.13234v1](http://arxiv.org/abs/2307.13234v1)\n\n GRANDProto300 is a 300-antenna prototype array of the envisioned GRAND (Giant Radio Array for Neutrino Detection) project. The goal of GRANDProto300 is to detect radio signals emitted by cosmic ray-induced air showers, with energies ranging from $10^{16.5}$~eV to $10^{18.5}$~eV, which covers the transition region between Galactic and extragalactic sources. We use simulations to optimize the layout of GRANDProto300 and develop a shower reconstruction method. Based on them, we present the performance of GRANDProto300 for cosmic-ray detection, by means of its effective area, angular resolution, and energy resolution.\n\n", "2307.13213": "2023-07-25, **Research and progress of front-end readout prototype system for GRANDProto300**, Xing Xu et.al., [2307.13213v1](http://arxiv.org/abs/2307.13213v1)\n\n GRANDProto300 is the planned 300-antenna pathfinder array of the Giant Radio Array for Neutrino Detection (GRAND), of which the first 100 detection units have been already produced. Its main goal is to demonstrate the viability of the detection of the radio emission from air showers initiated by inclined ultra-high-energy cosmic rays with energies of $10^{16.5}$ to $10^{18.5}$ eV, covering the purported transition region from their Galactic to extragalactic origin. The front-end readout system of each detection unit of GRANDProto300 processes signals from the radio antenna and the particle detector, generates the first-level trigger, and communicates with a central processing station. Based on earlier designs, we have built the first prototype of this system using two development boards and one self-designed front-end board. We present our new design that is improved and more economical than the earlier one, as well as test results and prospects for future work.\n\n"}, "dark matter": {"2307.14018": "2023-07-26, **Collective Excitations of Self-Gravitating Bose-Einstein Condensates: Breathing Mode and Appearance of Anisotropy under Self-Gravity**, Kenta Asakawa et.al., [2307.14018v1](http://arxiv.org/abs/2307.14018v1)\n\n We study the collective mode of self-gravitating Bose-Einstein condensates (BECs) described by the Gross-Pitaevskii-Poisson (GPP) equation. The self-gravitating BEC recently receives significant attention in cosmology and astrophysics as a candidate for dark matter. We investigate the breathing and anisotropic collective modes by numerically solving the GPP equation and using the variational method. The breathing mode shows that the period decreases with the total mass due to the density dependence of the self-gravitating BEC, which is quantitatively consistent with our analytical results. We also obtain an anisotropic collective mode, in which the quadrupole mode is coupled with the breathing mode. The period of the quadrupole mode has the same total mass dependence as that of the breathing mode. The characteristics of these periods are different from those of ordinary BECs trapped by an external potential. However, despite the difference in density dependence, their ratio is equal to that of the BEC trapped by an isotropic harmonic potential. Furthermore, a variational method extended to a spheroidal configuration shows that we extract only the quadrupole mode from the anisotropic collective mode.\n\n", "2307.13774": "2023-07-25, **Excess of high-$z$ galaxies as a test for bumpy power spectrum of density perturbations**, M. V. Tkachev et.al., [2307.13774v1](http://arxiv.org/abs/2307.13774v1)\n\n Modified matter power spectra with approximately Gaussian bump on sub-Mpc scales can be a result of a complex inflation. We consider five spectra with different amplitudes $A$ and locations $k\\_0$ and run N-body simulations in a cube $(5 Mpc/h)^3$ at $z>8$ to reveal the halo mass functions and their evolution with redshift. We have found that the ST formula provides a good approximation to a such kind of matter spectra. In the considered models the dark matter halo formation starts much more earlier than in $\\Lambda$CDM, which in turn can result in an earlier star formation and a nuclear activity in galaxies. At $z=0$ the halo mass functions are hardly distinguishable from the standard $\\Lambda$CDM, therefore the models with the bumpy spectra can be identified in observations by their excess in number of bright sources at high redshift only\n\n", "2307.13738": "2023-07-25, **The GMRT archive atomic gas survey -- II. Mass modelling and dark matter halo properties across late-type spirals**, Prerana Biswas et.al., [2307.13738v1](http://arxiv.org/abs/2307.13738v1)\n\n Studying the kinematics and mass modelling of galaxies from HI 21 cm data provides valuable insights into the properties of both the baryonic components and the dark matter halo in nearby galaxies. Despite many observational studies, mass modelling of galaxies remains challenging due to different limitations. For example, most of the previous studies involving mass modelling are based on rotation curves derived from two-dimensional velocity fields from HI or H$\\alpha$ spectroscopic observation which are often affected by beam smearing and projection effect. However, kinematic modelling done by fitting the \"Tilted ring model\" to three-dimensional data cube is not affected by these issues. In this study, we present and compare 3D kinematic modelling of a pilot sample of eleven galaxies from the GMRT archive atomic gas survey (GARCIA) using two different publicly available pipelines. We model the observed HI rotation curve using 3.6 $\\mu$m infrared data and SDSS r-band data for stellar contribution, HI surface density profile for gas, and Navarro-Frenk-White (NFW) profile for dark matter halo; and employ the Markov Chain Monte Carlo (MCMC) optimization method for parameter estimation. Further, to validate our analysis, we revisit important scaling relations, e.g., the M$\\_{gas}$-M$\\_{star}$ relation, M$\\_{star}$-M$\\_{halo}$ relation, M$\\_{gas}$-M$\\_{halo}$ relation and Baryonic Tully-Fisher relation (BTFR). The scaling relations from our analysis are broadly consistent with that reported in the literature. A larger sample of galaxies from GARCIA in the near future will allow studying these scaling relations in greater details.\n\n", "2307.13727": "2023-07-25, **Limiting Light Dark Matter with Luminous Hadronic Loops**, Joe Bramante et.al., [2307.13727v1](http://arxiv.org/abs/2307.13727v1)\n\n Dark matter is typically assumed not to couple to the photon at tree level. While annihilation to photons through quark loops is often considered in indirect detection searches, such loop-level effects are usually neglected in direct detection, as they are typically subdominant to tree-level dark matter-nucleus scattering. However, when dark matter is lighter than around 100 MeV, it carries so little momentum that it is difficult to detect with nuclear recoils at all. We show that loops of low-energy hadronic states can generate an effective dark matter-photon coupling, and thus lead to scattering with electrons even in the absence of tree-level dark matter-electron scattering. For light mediators, this leads to an effective fractional electric charge which may be very strongly constrained by astrophysical observations. Current and upcoming searches for dark matter-electron scattering can thus set limits on dark matter-proton interactions down to 1 MeV and below.\n\n", "2307.13723": "2023-07-25, **Dual-sided Charge-Coupled Devices**, Javier Tiffenberg et.al., [2307.13723v1](http://arxiv.org/abs/2307.13723v1)\n\n Existing Charge-Coupled Devices (CCDs) operate by detecting either the electrons or holes created in an ionization event. We propose a new type of imager, the Dual-Sided CCD, which collects and measures both charge carriers on opposite sides of the device via a novel dual-buried channel architecture. We show that this dual detection strategy provides exceptional dark-count rejection and enhanced timing capabilities. These advancements have wide-ranging implications for dark-matter searches, near-IR/optical spectroscopy, and time-domain X-ray astrophysics.\n\n", "2307.13553": "2023-07-25, **Modelling the black holes surrounded by a dark matter halo in the galactic center of M87**, Dong Liu et.al., [2307.13553v1](http://arxiv.org/abs/2307.13553v1)\n\n In this paper, the structure of a dark matter halo can be well described by the mass model of M87 and the Einasto profile for the cold dark matter model, i.e., $\\rho\\_{\\text{halo}} (r)=\\rho\\_e \\exp ( -2 \\alpha ^{-1} ((r/r\\_e)^\\alpha -1 ) )$ [J. Wang et al., Nature, 585, 39-42 (2020)]. Under these conditions, we construct a solution of a static spherically symmetric black hole in a dark matter halo. Then, using the Newman-janis algorithm, we extend this static solution to the case of rotation, and obtain a solution for the Kerr-like black hole. We prove that this solution of the Kerr-like black hole is indeed a solution to the Einstein field equations. Finally, taking M87 as an example, we study and analyze some physical properties of this Kerr-like black hole, and then compare them with the Kerr black hole. These research results for the black hole in a dark matter halo may indirectly provide an effective method for detecting the existence of dark matter.\n\n"}, "supernova": {"2307.13862": "2023-07-25, **Probing the Consistency of Cosmological Contours for Supernova Cosmology**, P. Armstrong et.al., [2307.13862v1](http://arxiv.org/abs/2307.13862v1)\n\n As the scale of cosmological surveys increases, so does the complexity in the analyses. This complexity can often make it difficult to derive the underlying principles, necessitating statistically rigorous testing to ensure the results of an analysis are consistent and reasonable. This is particularly important in multi-probe cosmological analyses like those used in the Dark Energy Survey and the upcoming Legacy Survey of Space and Time, where accurate uncertainties are vital. In this paper, we present a statistically rigorous method to test the consistency of contours produced in these analyses, and apply this method to the Pippin cosmological pipeline used for Type Ia supernova cosmology with the Dark Energy Survey. We make use of the Neyman construction, a frequentist methodology that leverages extensive simulations to calculate confidence intervals, to perform this consistency check. A true Neyman construction is too computationally expensive for supernova cosmology, so we develop a method for approximating a Neyman construction with far fewer simulations. We find that for a simulated data-set, the 68% contour reported by the Pippin pipeline and the 68% confidence region produced by our approximate Neyman construction differ by less than a percent near the input cosmology, however show more significant differences far from the input cosmology, with a maximal difference of 0.05 in $\\Omega\\_{M}$, and 0.07 in $w$. This divergence is most impactful for analyses of cosmological tensions, but its impact is mitigated when combining supernovae with other cross-cutting cosmological probes, such as the Cosmic Microwave Background.\n\n", "2307.13785": "2023-07-25, **SPROUT: A moving mesh hydro code using a uniformly expanding Cartesian grid**, Soham Mandal et.al., [2307.13785v1](http://arxiv.org/abs/2307.13785v1)\n\n We present the publicly available moving-mesh hydrodynamics code Sprout. Sprout solves the equations of ideal hydrodynamics on an expanding Cartesian mesh. The expanding mesh can follow fluid outflows for several orders of magnitude with very little numerical diffusion, thereby capturing shocks and fine structures accurately. Following the bulk flow accurately also allows for longer timesteps in general. This makes Sprout particularly suitable for studying expanding outflows such as supernova remnants and active galactic nuclei. Relative to other moving mesh codes, the simple mesh structure in Sprout is also convenient for implementing additional physics or algorithms. Many code tests are performed to test the accuracy and performance of the numerical scheme.\n\n", "2307.13743": "2023-07-25, **Aspects of Everpresent $Λ$ (II): Cosmological Tests of Current Models**, Santanu Das et.al., [2307.13743v1](http://arxiv.org/abs/2307.13743v1)\n\n This paper investigates Everpresent $\\Lambda$, a stochastic dark energy model motivated by causal set theory and unimodular gravity, and confronts it with two key observational data sets, Supernova Ia (SN Ia) and Cosmic Microwave Background (CMB) data. A key feature of this model is that $\\Lambda$ fluctuates over time and on average the magnitude of its fluctuations is of the order of the dominant energy density (be it radiation or matter) for the given epoch. In particular, we focus on a phenomenological implementation of Everpresent $\\Lambda$ known as Model 1. The random fluctuations in Everpresent $\\Lambda$ realizations are generated using seed numbers, and we find that for a small fraction of seeds Model 1 is capable of producing realizations that fit SN Ia data better than $\\Lambda$CDM. We further investigate what features distinguish these realizations from the more general behaviour, and find that the \"good'' realizations have relatively small fluctuations at low redshifts ($z<1.5$), which do not closely track the matter density. We find that Model 1 struggles to improve on $\\Lambda$CDM at describing the CMB data. However, by suppressing the values of $\\Lambda$ near the last scattering surface, as suggested in arXiv:1703.06265, we find a large improvement in the best fit of the model, though still with a $\\chi^2$ value much larger than that of $\\Lambda$CDM. We also study the allowed variation of the dark energy density by the CMB constraints in a more model-independent manner, and find that some variation (especially prior to recombination) is possible and in fact can lead to improvement over $\\Lambda$CDM and reduce the Hubble tension, in line with some early dark energy proposals. However, for the kinds of variations considered, the favoured fluctuations are smaller in magnitude than is typical in current Everpresent $\\Lambda$ models.\n\n", "2307.13728": "2023-07-25, **Robust constraints on feebly interacting particles using XMM-Newton**, Pedro De la Torre Luque et.al., [2307.13728v1](http://arxiv.org/abs/2307.13728v1)\n\n During galactic Supernova (SN) explosions, a large amount of feebly interacting particles (FIPs) may be produced. In this work we analyze electrophilic FIPs with masses in the MeV-range that escape from SN and decay into electron-positron pairs, causing an exotic leptonic injection. This contribution adds up to known components, leading to an unexpected excess of X-ray fluxes generated by inverse-Compton scattering of the injected particles on low-energy photon backgrounds. For the first time in the context of FIPs, we use XMM-Newton X-ray measurements to obtain the strongest and most robust bounds on electrophilic FIPs produced by SN in our Galaxy.\n\n", "2307.13696": "2023-07-25, **The Dark Energy Survey Supernova Program: Cosmological Biases from Host Galaxy Mismatch of Type Ia Supernovae**, H. Qu et.al., [2307.13696v1](http://arxiv.org/abs/2307.13696v1)\n\n Redshift measurements, primarily obtained from host galaxies, are essential for inferring cosmological parameters from type Ia supernovae (SNe Ia). Matching SNe to host galaxies using images is non-trivial, resulting in a subset of SNe with mismatched hosts and thus incorrect redshifts. We evaluate the host galaxy mismatch rate and resulting biases on cosmological parameters from simulations modeled after the Dark Energy Survey 5-Year (DES-SN5YR) photometric sample. For both DES-SN5YR data and simulations, we employ the directional light radius method for host galaxy matching. In our SN Ia simulations, we find that 1.7% of SNe are matched to the wrong host galaxy, with redshift difference between the true and matched host of up to 0.6. Using our analysis pipeline, we determine the shift in the dark energy equation of state parameter (Dw) due to including SNe with incorrect host galaxy matches. For SN Ia-only simulations, we find Dw = 0.0013 +/- 0.0026 with constraints from the cosmic microwave background (CMB). Including core-collapse SNe and peculiar SNe Ia in the simulation, we find that Dw ranges from 0.0009 to 0.0032 depending on the photometric classifier used. This bias is an order of magnitude smaller than the expected total uncertainty on w from the DES-SN5YR sample of around 0.03. We conclude that the bias on w from host galaxy mismatch is much smaller than the uncertainties expected from the DES-SN5YR sample, but we encourage further studies to reduce this bias through better host-matching algorithms or selection cuts.\n\n", "2307.13491": "2023-07-25, **Reverberation of pulsar wind nebulae (III): Modelling of the plasma interface empowering a long term radiative evolution**, R. Bandiera et.al., [2307.13491v1](http://arxiv.org/abs/2307.13491v1)\n\n The vast majority of Pulsar Wind Nebulae (PWNe) present in the Galaxy is formed by middle-aged systems characterized by a strong interaction of the PWN itself with the supernova remnant (SNR). Unfortunately, modelling these systems can be quite complex and numerically expensive, due to the non-linearity of the PWN-SNR evolution even in the simple 1D / one-zone case when the reverse shock of the SNR reaches the PWN, and the two begin to interact (and reverberation starts).   Here we introduce a new numerical technique that couples the numerical efficiency of the one-zone thin shell approach with the reliability of a full ``lagrangian'' evolution, able to correctly reproduce the PWN-SNR interaction during the reverberation and to consistently evolve the particle spectrum beyond. Based on our previous findings, we show that our novel strategy resolves many of the uncertainties present in previous approaches, as the arbitrariness in the SNR structure, and ensure a robust evolution, compatible with results that can be obtained with more complex 1D dynamical approaches. Our approach enable us for the first time to provide reliable spectral models of the later compression phases in the evolution of PWNe. While in general we found that the compression is less extreme than that obtained without such detailed dynamical considerations, leading to the formation of less structured spectral energy distributions, we still find that a non negligible fraction of PWNe might experience a super-efficient phase, with the optical and/or X-ray luminosity exceeding the spin-down one.\n\n", "2307.13464": "2023-07-25, **Cosmographic view on the $H_0$ and $σ_8$ tensions**, Rocco D'Agostino et.al., [2307.13464v1](http://arxiv.org/abs/2307.13464v1)\n\n Measurements of the $H\\_0$ and $\\sigma\\_8$ parameters within the standard cosmological model recently highlighted significant statistical tensions between the cosmic microwave background and low-redshift probes, such as local distance ladder, weak lensing and galaxy clustering surveys. In this work, we frame geometrical distances in a model-independent way by means of cosmographic approximations in the range $z \\in (0, 2.3)$ to take into account a robust dataset composed of Baryon Acoustic Oscillations (BAO), type Ia Supernovae (SN), Cosmic Chronometer (CC) data, and measurements from Redshift Space Distortions (RSD). From the joint analysis BAO\\,+\\,SN\\,+\\,CC\\,+\\,RSD, we find an accuracy of $\\sim$1.4\\% and $\\sim$3.7\\% on $H\\_0$ and $\\sigma\\_8$, respectively. Our result for $H\\_0$ is at 2$\\sigma$ tension with local measurements by the SH0ES team, while our $\\sigma\\_8$ estimate is at 2.6$\\sigma$ tension with Planck-CMB analysis. This inference shows a tension statistically smaller when compared to those estimated via the $\\Lambda$CDM model. We also find that the jerk parameter can deviate more than 3$\\sigma$ from the $\\Lambda$CDM prediction. Under the same cosmographic setup, we also present results by considering a SH0ES Gaussian prior on $H\\_0$ that allows for improved accuracy of the parameter space of the models. The present work brings observational constraints on $H\\_0$ and $\\sigma\\_8$ into a new model-independent perspective, which differs from the predictions obtained within the $\\Lambda$CDM paradigm.\n\n", "2307.13342": "2023-07-25, **Multi-wavelength Study of Magnetic Field and Turbulence in the Monogem Pulsar TeV halo**, Sunil Malik et.al., [2307.13342v1](http://arxiv.org/abs/2307.13342v1)\n\n Magnetic fields are ubiquitous in the interstellar medium, including extended objects such as supernova remnants (SNRs) and Pulsar Wind Nebulae (PWNe). Its turbulent characteristics govern the diffusion of cosmic rays and the multi-wavelength emission from PWNe. However, the geometry and turbulence nature of the magnetic fields in the ambient region of PWN is still unknown. Recent gamma-ray observations from HAWC and synchrotron observations suggest a highly suppressed diffusion coefficient compared to the mean interstellar value. In this letter, we present the first direct observational evidence that the local mean magnetic field is nearly aligned toward the line of sight (LoS) with an inclination angle $\\theta\\_{\\lambda} <10^{\\circ}$ employing a recently developed statistical recipe known as `Y-parameter'. Furthermore, we report that the magnetic field fluctuations are mostly dominated by compressible modes, with a 2D correlation length of approximately $3 \\ {\\rm pc}$ in the vicinity of Monogem PWN region. Our study highlights the pivotal role of magnetic field and turbulence in unraveling the physical processes in TeV halos and cosmic ray transport.\n\n"}}