{"neutrino": {"2311.09116": "2023-11-15, **Hints of Neutrino Dark Matter scattering in the CMB? Constraints from the Marginalized and Profile Distributions**, William Giarè et.al., [2311.09116v1](http://arxiv.org/abs/2311.09116v1)\n\n We study scatter-like interactions between neutrinos and dark matter in light of different combinations of temperature, polarization and lensing data released by three independent CMB experiments - the Planck satellite, the Atacama Cosmology Telescope (ACT), and the South Pole Telescope (SPT) - in conjunction with Baryon Acoustic Oscillation (BAO) measurements. We apply two different statistical methodologies. Alongside the usual marginalization technique, we cross-check all the results through a Profile Likelihood analysis. As a first step, working under the assumption of massless neutrinos, we perform a comprehensive (re-)analysis aimed at assessing the validity of some recent results hinting at a mild preference for non-vanishing interactions from small-scale CMB data. We find compelling resilience in the results already documented in the literature, confirming that interactions with a strength $u\\_{\\nu\\rm{DM}} \\sim 10^{-5} - 10^{-4}$ appear to be globally favored by ACT (both alone and in combination with Planck). This result is corroborated by the inclusion of additional data, such as the recent ACT-DR6 lensing likelihood, as well as by the Profile Likelihood analysis. Interestingly, a fully consistent preference for interactions emerges from SPT, as well, although it is weaker than the one obtained from ACT. As a second step, we repeat the same analysis considering neutrinos as massive particles. Despite the larger parameter space, all the hints pointing towards interactions are confirmed also in this more realistic case. In addition, we report a very mild preference for interactions in Planck+BAO alone (not found in the massless case) which aligns with small-scale data. While this latter result is not fully confirmed by the Profile Likelihood analysis, the profile distribution does confirm that interactions are not disfavoured by Planck.\n\n", "2311.09044": "2023-11-15, **Decoding Fermion Mass Pattern from Mass Hierarchy**, Ying Zhang et.al., [2311.09044v1](http://arxiv.org/abs/2311.09044v1)\n\n Building an organized Yukawa structure of quarks and leptons is an essential mission to understand fermion mass hierarchy and flavor mixing in particle physics. Inspired by the similarity of CKM and PMNS mixings, a common mass pattern for up-type and down-type quarks, charged leptons, and Dirac neutrinos is realized in terms of hierarchal masses. An organized structure of Yukawa couplings can be expressed on a Yukawa basis. The CKM mixing and PMNS mixing have the same mathematical forms due to $SO(2)$ family symmetry. By fitting the CKM/PMNS mixing experiment, the flat pattern becomes a successful flavor structure. The fundamental fermions can be explained by a new picture to show the relationship between gauge structure and flavor structure.\n\n", "2311.09005": "2023-11-15, **Leptogenesis driven by majoron**, Eung Jin Chun et.al., [2311.09005v1](http://arxiv.org/abs/2311.09005v1)\n\n We propose a leptogenesis scenario where baryon asymmetry generation is assisted by the kinetic motion of the majoron, $J$, in the process of lepton-number violating inverse decays of a right-handed neutrino, $N$. We investigate two distinct scenarios depending on the sources of majoron kinetic motion: 1) the misalignment mechanism, and 2) the kinetic misalignment mechanism. The former case can naturally generate the observed baryon asymmetry for the majoron mass $m\\_J \\gtrsim \\,{\\rm TeV}$ and the right-handed neutrino's mass $M\\_{N} \\gtrsim 10^{11}\\,{\\rm GeV}$. However, an additional decay channel of the majoron is required to avoid the overclosure problem of the majoron oscillation. The later scenario works successfully for $m\\_J \\lesssim 100\\,{\\rm keV}$, and $M\\_{N} \\lesssim 10^9\\,{\\rm GeV}$ while $M\\_N$ can be even far below the temperature of the electroweak phase transition as long as sufficiently large kinetic misalignment is provided. We also find that a sub-$100\\,{\\rm keV}$ majoron is a viable candidate for dark matter.\n\n", "2311.08901": "2023-11-15, **Neutrino Mass Model and Dark Matter with $Y=0$ Inert Triplet Scalar**, Shilpa Jangid et.al., [2311.08901v1](http://arxiv.org/abs/2311.08901v1)\n\n We study a one-loop induced neutrino mass model with an inert isospin triplet scalar field of $Y=0$ and heavier Majorana right-handed fermions. We show numerical analysis of neutrino oscillation and lepton flavor violations and demonstrate our allowed regions in cases of normal and inverted hierarchies. Then, we move on to the discussion of dark matter (DM) candidates to satisfy the relic density where we have two candidates; fermionic DM (FDM) and bosonic DM (BDM). And, we classify four cases NH+FDM, NH+BDM, IH+FDM, IH+BDM and search for each of the allowed points in the model.\n\n", "2311.08898": "2023-11-15, **Prospects for the Detection of the Standing Accretion Shock Instability in IceCube-Gen2**, Jakob Beise et.al., [2311.08898v1](http://arxiv.org/abs/2311.08898v1)\n\n Core-collapse supernovae (CCSNe) are among the most energetic processes in our Universe and are crucial for the understanding of the formation and chemical composition of the Universe. The precise measurement of the neutrino light curve from CCSNe is crucial to understanding the hydrodynamics and fundamental processes that drive CCSNe. The IceCube Neutrino Observatory has mass-independent sensitivity within the Milky Way and some sensitivity to the higher mass CCSNe in the Large and Small Magellanic clouds. The envisaged large-scale extension of the IceCube detector, IceCube-Gen2, opens the possibility for new sensor design and trigger concepts that could increase the number of neutrinos detected from a CCSNe burst compared to IceCube. In this contribution, we study how wavelength-shifting technology can be used in IceCube-Gen2 to measure the fast modulations of the neutrino signal due to standing accretion shock instabilities (SASI).\n\n", "2311.08828": "2023-11-15, **Status of the superweak extension of the standard model and muon g-2**, Zoltan Trocsanyi et.al., [2311.08828v1](http://arxiv.org/abs/2311.08828v1)\n\n The super-weak force is a minimal, anomaly-free U(1) extension of the standard model, designed to explain the origin of (i) neutrino masses and mixing matrix elements, (ii) dark matter, (iii) cosmic inflation, (iv) stabilization of the electroweak vacuum and (v) leptogenesis. In this talk we discuss the phenomenological status of the model and provide viable scenarios for the physics of the items in this list.\n\n", "2311.08638": "2023-11-15, **The Cosmology of Dark Energy Radiation**, Kim V. Berghaus et.al., [2311.08638v1](http://arxiv.org/abs/2311.08638v1)\n\n In this work, we quantify the cosmological signatures of dark energy radiation -- a novel description of dark energy, which proposes that the dynamical component of dark energy is comprised of a thermal bath of relativistic particles sourced by thermal friction from a slowly rolling scalar field. For a minimal model with particle production emerging from first principles, we find that the abundance of radiation sourced by dark energy can be as large as $\\Omega\\_{\\text{DER}} = 0.03$, exceeding the bounds on relic dark radiation by three orders of magnitude. Although the background and perturbative evolution of dark energy radiation is distinct from Quintessence, we find that current and near-future cosmic microwave background and supernova data will not distinguish these models of dark energy. We also find that our constraints on all models are dominated by their impact on the expansion rate of the Universe. Considering extensions that allow the dark radiation to populate neutrinos, axions, and dark photons, we evaluate the direct detection prospects of a thermal background comprised of these candidates consistent with cosmological constraints on dark energy radiation. Our study indicates that a resolution of $\\sim 6 \\, \\text{meV}$ is required to achieve sensitivity to relativistic neutrinos compatible with dark energy radiation in a neutrino capture experiment on tritium. We also find that dark matter axion experiments lack sensitivity to a relativistic thermal axion background, even if enhanced by dark energy radiation, and dedicated search strategies are required to probe new parameter space. We derive constraints arising from a dark photon background from oscillations into visible photons, and find that several orders of magnitude of viable parameter space can be explored with planned experimental programs such as DM Radio and LADERA.\n\n"}, "dark matter": {"2311.09162": "2023-11-15, **Leaving No Branches Behind: Predicting Baryonic Properties of Galaxies from Merger Trees**, Chen-Yu Chuang et.al., [2311.09162v1](http://arxiv.org/abs/2311.09162v1)\n\n Galaxies play a key role in our endeavor to understand how structure formation proceeds in the Universe. For any precision study of cosmology or galaxy formation, there is a strong demand for huge sets of realistic mock galaxy catalogs, spanning cosmologically significant volumes. For such a daunting task, methods that can produce a direct mapping between dark matter halos from dark matter-only simulations and galaxies are strongly preferred, as producing mocks from full-fledged hydrodynamical simulations or semi-analytical models is too expensive. Here we present a Graph Neural Network-based model that is able to accurately predict key properties of galaxies such as stellar mass, $g-r$ color, star formation rate, gas mass, stellar metallicity, and gas metallicity, purely from dark matter properties extracted from halos along the full assembly history of the galaxies. Tests based on the TNG300 simulation of the IllustrisTNG project show that our model can recover the baryonic properties of galaxies to high accuracy, over a wide redshift range ($z = 0-5$), for all galaxies with stellar masses more massive than $10^9\\,M\\_\\odot$ and their progenitors, with strong improvements over the state-of-the-art methods. We further show that our method makes substantial strides toward providing an understanding of the implications of the IllustrisTNG galaxy formation model.\n\n", "2311.08915": "2023-11-15, **Evidence for microlensing by primordial black holes in quasar broad emission lines**, M. R. S. Hawkins et.al., [2311.08915v1](http://arxiv.org/abs/2311.08915v1)\n\n With the detection of black hole mergers by the LIGO gravitational wave telescope, there has been increasing interest in the possibility that dark matter may be in the form of solar mass primordial black holes. One of the predictions implicit in this idea is that compact clouds in the broad emission line regions of high redshift quasars will be microlensed, leading to changes in line structure and the appearance of new emission features. In this paper the effect of microlensing on the broad emission line region is reviewed by reference to gravitationally lensed quasar systems where microlensing of the emission lines can be unambiguously identified. It is then shown that although changes in Seyfert galaxy line profiles occur on timescales of a few years, they are too nearby for a significant chance that they could be microlensed, and are plausibly attributed to intrinsic changes in line structure. In contrast, in a sample of 53 high redshift quasars, 9 quasars show large changes in line profile at a rate consistent with microlensing. These changes occur on a timescale an order of magnitude too short for changes associated with the dynamics of the emission line region. The main conclusion of the paper is that the observed changes in quasar emission line profiles are consistent with microlensing by a population of solar mass compact bodies making up the dark matter, although other explanations like intrinsic variability are possible. Such bodies are most plausibly identified as primordial black holes.\n\n", "2311.08888": "2023-11-15, **Dark Energy with a Little Help from its Friends**, Joaquim M. Gomes et.al., [2311.08888v1](http://arxiv.org/abs/2311.08888v1)\n\n We analyse theories that do not have a de Sitter vacuum and cannot lead to slow-roll quintessence, but which nevertheless support a transient era of accelerated cosmological expansion due to interactions between a scalar $\\phi$ and either a hidden sector thermal bath, which evolves as Dark Radiation, or an extremely-light component of Dark Matter. We show that simple models can explain the present-day Dark Energy of the Universe consistently with current observations. This is possible both when $\\phi$'s potential has a hilltop form and when it has a steep exponential run-away, as might naturally arise from string theory. We also discuss a related theory of multi-field quintessence, in which $\\phi$ is coupled to a sector that sources a subdominant component of Dark Energy, which overcomes many of the challenges of slow-roll quintessence.\n\n", "2311.08664": "2023-11-15, **Merger Response of Halo Anisotropy Properties**, Kuan Wang et.al., [2311.08664v1](http://arxiv.org/abs/2311.08664v1)\n\n Anisotropy properties -- halo spin, shape, position offset, velocity offset, and orientation -- are an important family of dark matter halo properties that indicate the level of directional variation of the internal structures of haloes. These properties reflect the dynamical state of haloes, which in turn depends on the mass assembly history. In this work, we study the evolution of anisotropy properties in response to merger activity using the IllustrisTNG simulations. We find that the response trajectories of the anisotropy properties significantly deviate from secular evolution. These trajectories have the same qualitative features and timescales across a wide range of merger and host properties. We propose explanations for the behaviour of these properties and connect their evolution to the relevant stages of merger dynamics. We measure the relevant dynamical timescales. We also explore the dependence of the strength of the response on time of merger, merger ratio, and mass of the main halo. These results provide insight into the physics of halo mergers and their effects on the statistical behaviour of halo properties. This study paves the way towards a physical understanding of scaling relations, particularly to how systematics in their scatter are connected to the mass assembly histories of haloes.\n\n"}, "supernova": {}}