{"neutrino": {"2409.05807": "2024-09-09, **Quantum maximum entropy closure for small flavor coherence**, Julien Froustey et.al., [2409.05807v1](http://arxiv.org/abs/2409.05807v1)\n\n Quantum angular moment transport schemes are an important avenue toward describing neutrino flavor mixing phenomena in dense astrophysical environments such as supernovae and merging neutron stars. Successful implementation will require new closure relations that go beyond those used in classical transport. In this paper, we derive the first analytic expression for a quantum M1 closure, valid in the limit of small flavor coherence, based on the maximum entropy principle. We verify that the resulting closure relation has the appropriate limits and characteristic speeds in the diffusive and free-streaming regimes. We then use this new closure in a moment linear stability analysis to search for fast flavor instabilities in a binary neutron star merger simulation and find better results as compared with previously designed, ad hoc, semi-classical closures.\n\n", "2409.05736": "2024-09-09, **A universal implementation of radiative effects in neutrino event generators**, Julia Tena Vidal et.al., [2409.05736v1](http://arxiv.org/abs/2409.05736v1)\n\n Due to the similarities between electron-nucleus ($eA$) and neutrino-nucleus scattering ($\\nu A$), $eA$ data can contribute key information to improve cross-section modeling in $eA$ and hence in $\\nu A$ event generators. However, to compare data and generated events, either the data must be radiatively corrected or radiative effects need to be included in the event generators. We implemented a universal radiative corrections program that can be used with all reaction mechanisms and any $eA$ event generator. Our program includes real photon radiation by the incident and scattered electrons, and virtual photon exchange and photon vacuum polarization diagrams. It uses the ``extended peaking\" approximation for electron radiation and neglects charged hadron radiation. This method, validated with GENIE, can also be extended to simulate $\\nu A$ radiative effects. This work facilitates data-event-generator comparisons used to improve $\\nu A$ event generators for the next-generation of neutrino experiments.\n\n", "2409.05682": "2024-09-09, **ForestFlow: cosmological emulation of Lyman-$α$ forest clustering from linear to nonlinear scales**, J. Chaves-Montero et.al., [2409.05682v1](http://arxiv.org/abs/2409.05682v1)\n\n On large scales, measurements of the Lyman-$\\alpha$ forest offer insights into the expansion history of the Universe, while on small scales, these impose strict constraints on the growth history, the nature of dark matter, and the sum of neutrino masses. This work introduces ForestFlow, a cosmological emulator designed to bridge the gap between large- and small-scale Lyman-$\\alpha$ forest analyses. Using conditional normalizing flows, ForestFlow emulates the 2 Lyman-$\\alpha$ linear biases ($b\\_\\delta$ and $b\\_\\eta$) and 6 parameters describing small-scale deviations of the 3D flux power spectrum ($P\\_\\mathrm{3D}$) from linear theory. These 8 parameters are modeled as a function of cosmology $\\unicode{x2013}$ the small-scale amplitude and slope of the linear power spectrum $\\unicode{x2013}$ and the physics of the intergalactic medium. Thus, in combination with a Boltzmann solver, ForestFlow can predict $P\\_\\mathrm{3D}$ on arbitrarily large (linear) scales and the 1D flux power spectrum ($P\\_\\mathrm{1D}$) $\\unicode{x2013}$ the primary observable for small-scale analyses $\\unicode{x2013}$ without the need for interpolation or extrapolation. Consequently, ForestFlow enables for the first time multiscale analyses. Trained on a suite of 30 fixed-and-paired cosmological hydrodynamical simulations spanning redshifts from $z=2$ to $4.5$, ForestFlow achieves $3$ and $1.5\\%$ precision in describing $P\\_\\mathrm{3D}$ and $P\\_\\mathrm{1D}$ from linear scales to $k=5\\,\\mathrm{Mpc}^{-1}$ and $k\\_\\parallel=4\\,\\mathrm{Mpc}^{-1}$, respectively. Thanks to its parameterization, the precision of the emulator is also similar for both ionization histories and two extensions to the $\\Lambda$CDM model $\\unicode{x2013}$ massive neutrinos and curvature $\\unicode{x2013}$ not included in the training set. ForestFlow will be crucial for the cosmological analysis of Lyman-$\\alpha$ forest measurements from the DESI survey.\n\n", "2409.05646": "2024-09-09, **New Search for Dark Matter with Neutrons at Neutrino Detectors**, Koun Choi et.al., [2409.05646v1](http://arxiv.org/abs/2409.05646v1)\n\n Large-volume neutrino experiments are ideal for testing boosted dark matter (BDM) scenarios. We propose, for the first time, an approach to utilize knockout neutrons by detecting de-excitation $\\gamma$ rays and coincident captured neutrons from dark-matter interactions with bound neutrons in oxygen, while previous studies have focused on knockout-protons and electrons. This method is especially crucial for water \\v{C}erenkov detectors, where high proton \\v{C}erenkov threshold ($\\sim$1 GeV) suppresses signal acceptance. Recently, Super-Kamiokande (SK) was doped with 0.03\\% gadolinium (SK-Gd) to enhance neutron tagging efficiency. Using SK-Gd as a target experiment, we demonstrate that this method increases sensitivity to BDM models by an order of magnitude compared to proton-based analysis, and it allows exploration of a wider range of light dark-matter models previously inaccessible with proton-based analysis. We also present the projected sensitivity for the upcoming Hyper-Kamiokande detector.\n\n", "2409.05522": "2024-09-09, **Design and Implementation of TAO DAQ System**, Shuihan Zhang et.al., [2409.05522v1](http://arxiv.org/abs/2409.05522v1)\n\n Purpose: The Taishan Antineutrino Observatory (TAO) is a satellite experiment of the Jiangmen Underground Neutrino Observatory (JUNO), also known as JUNO-TAO. Located close to one of the reactors of the Taishan Nuclear Power Plant, TAO will measure the antineutrino energy spectrum precisely as a reference spectrum for JUNO. The data acquisition (DAQ) system is designed to acquire data from the TAO readout electronics and process it with software trigger and data compression algorithms. The data storage bandwidth is limited by the onsite network to be less than 100 Mb/s.   Methods: The system is designed based on a distributed architecture, with fully decoupled modules to facilitate customized design and implementation. It is divided into two main components: the data flow system and the online software. The online software serves as the foundation, providing the electronics configuration, the process management, the run control, and the information sharing. The data flow system facilitates continuous data acquisition from various electronic boards or trigger systems, assembles and processes raw data, and ultimately stores it on the disk.   Results: The core functionality of the system has been designed and developed. The usability of the data flow system interface and the software trigger results have been verified during the pre-installation testing phase.   Conclusion: The DAQ system has been deployed for the TAO experiment. It has also successfully been applied to the integration test of the detector and electronics prototypes.\n\n", "2409.05453": "2024-09-09, **Multi-label Classification of Parameter Constraints in BSM Extensions using Deep Learning**, Maien Binjonaid et.al., [2409.05453v1](http://arxiv.org/abs/2409.05453v1)\n\n The shortcomings of the Standard Model (SM) motivate its extension to accommodate new expected phenomena, such as dark matter and neutrino masses. However, such extensions are generally more complex due to the presence of a larger number of free parameters as well as additional phenomenology. Understanding how current theoretical and experimental constraints, individually and collectively, affect the parameter spaces of new models is of utmost importance in achieving testable predictions and targeted model-building that aims to solve certain issues. We present a comprehensive approach of using Deep Learning (DL) for the multi-label classification (MLC) of theoretical and experimental limits on the two-Higgs doublet model augmented by a real singlet (N2HDM), as a representative case. This approach can be generalized to any extension beyond the SM.\n\n", "2409.05326": "2024-09-09, **SCALE at Scale: Cosmological applications of small-scale CMB lensing**, Victor C. Chan et.al., [2409.05326v1](http://arxiv.org/abs/2409.05326v1)\n\n The Small-Correlated-Against-Large Estimator (SCALE) for small-scale lensing of the cosmic microwave background (CMB) provides a novel method for measuring the amplitude of CMB lensing power without the need for reconstruction of the lensing field. In our previous study, we showed that the SCALE method can outperform existing reconstruction methods to detect the presence of lensing at small scales ($\\ell \\gg 3000$). Here we develop a procedure to include information from SCALE in cosmological parameter inference. We construct a precise neural network emulator to quickly map cosmological parameters to desired CMB observables such as temperature and lensing power spectra and SCALE cross spectra. We also outline a method to apply SCALE to full-sky maps of the CMB temperature field, and construct a likelihood for the application of SCALE in parameter estimation. SCALE supplements conventional observables such as the CMB power spectra and baryon acoustic oscillations in constraining parameters that are sensitive to the small-scale lensing amplitude such as the neutrino mass $m\\_\\nu$. We show that including estimates of the small-scale lensing amplitude from SCALE in such an analysis provides enough constraining information to measure the minimum neutrino mass at $4\\sigma$ significance in the scenario of minimal mass, and higher significance for higher mass. Finally, we show that SCALE will play a powerful role in constraining models of clustering that generate scale-dependent modulation to the distribution of matter and the lensing power spectrum, as predicted by models of warm or fuzzy dark matter.\n\n", "2409.05313": "2024-09-09, **Influences of non-standard interactions on PeV neutrino events with and without a $L_α-L_β$ symmetry**, Qiu-Xia Yi et.al., [2409.05313v1](http://arxiv.org/abs/2409.05313v1)\n\n The recently reported astrophysical neutrinos events in the TeV-PeV energy range open a winder to explore new physics at energy frontiers. In this paper, we examine effects of non-standard interactions (NSIs) on the PeV neutrinos events. We consider NSIs with and without a gauge symmetry $L\\_{\\alpha}$ - $L\\_{\\beta}$. We find that, for typical $\\mu^{\\pm}$ damping and $\\pi^{\\pm}$ decay sources, the NSI with an extra gauge symmetry has more noticeable effects on the PeV events. Therefore, the detection of the events in the upcoming experiments could set stringent constraints on the NSI parameters in the $L\\_{\\alpha}$ - $L\\_{\\beta}$ symmetric case.\n\n"}, "dark matter": {"2409.05443": "2024-09-09, **Dark QCD perspective inspired by strong CP problem at QCD scale**, Bin Wang et.al., [2409.05443v1](http://arxiv.org/abs/2409.05443v1)\n\n We discuss a QCD-scale composite axion model arising from dark QCD coupled to QCD. The presently proposed scenario not only solves the strong CP problem, but also is compatible with the preheating setup for the QCD baryogenesis. The composite axion is phenomenologically required to mimic the QCD pion, but can generically be flavorful, which could be testable via the induced flavor changing processes at experiments. Another axionlike particle (ALP) is predicted to achieve the axion relaxation mechanism, which can phenomenologically act as the conventional QCD axion. This ALP can be ultralight, having the mass less than 1 eV, to be a dark matter candidate. The QCD $\\times$ dark QCD symmetry structure constrains dark QCD meson spectra, so that the dark $\\eta'$-like meson would only be accessible at the collider experiments. Still, the Belle II experiment can have a high enough sensitivity to probe the dark $\\eta$-like meson decaying to diphoton, which dominantly arises from the mixing with the QCD $\\eta'$ and the pionic composite axion. We also briefly address nontrivial cosmological aspects, such as those related to the dark-chiral phase transition, the dark matter production, and an ultraviolet completion related to the ultralight ALP.\n\n", "2409.05348": "2024-09-09, **Compartmental and Coexistence in the Dark Sector of the Universe**, Andronikos Paliathanasis et.al., [2409.05348v1](http://arxiv.org/abs/2409.05348v1)\n\n We revise the cosmological interaction between dark energy and dark matter. More precisely, we focus on models that support compartmentalization or co-existence in the dark sector of the universe. Within the framework of a homogeneous and isotropic, spatially flat Friedmann--Lema\\^itre--Robertson--Walker geometry, we analyse the asymptotic behaviour of the physical parameters for two interacting models, where dark energy and dark matter have constant equations of state parameters, in the presence of dark radiation, when dark energy is described by a quintessence scalar field. For each model, we determine the asymptotic solutions and attempt to understand how the interaction affects the cosmological evolution and history.\n\n"}, "supernova": {"2409.05838": "2024-09-09, **Measuring the speed of light with cosmological observations: current constraints and forecasts**, Jaiane Santos et.al., [2409.05838v1](http://arxiv.org/abs/2409.05838v1)\n\n We measure the speed of light with current observations, such as Type Ia Supernova, galaxy ages, radial BAO mode, as well as simulations of future redshift surveys and gravitational waves as standard sirens. By means of a Gaussian Process reconstruction, we find that the precision of such measurements can be improved from roughly 6\\% to 1.5-2\\%, in light of these forthcoming observations. This result demonstrates that we will be able to perform a cosmological measurement of a fundamental physical constant with unprecedented precision, which will help us underpinning if its value is truly consistent with local measurements, as predicted by the standard model of Cosmology.\n\n", "2409.05767": "2024-09-09, **Occurrence of gravitational collapse in the accreting neutron stars of binary-driven hypernovae**, L. M. Becerra et.al., [2409.05767v1](http://arxiv.org/abs/2409.05767v1)\n\n The binary-driven hypernova (BdHN) model proposes long gamma-ray bursts (GRBs) originate in binaries composed of a carbon-oxygen (CO) star and a neutron star (NS) companion. The CO core collapse generates a newborn NS and a supernova that triggers the GRB by accreting onto the NSs, rapidly transferring mass and angular momentum to them. We perform three-dimensional, smoothed-particle-hydrodynamics simulations of BdHNe using up-to-date NS nuclear equations of state (EOS), with and without hyperons, and calculate the structure evolution in full general relativity. We assess the binary parameters leading either NS to the critical mass for gravitational collapse into a black hole (BH) and its occurrence time, $t\\_\\textrm{col}$. We include a non-zero angular momentum of the NSs and find that $t\\_\\textrm{col}$ ranges from a few tens of seconds to hours for decreasing NS initial angular momentum values. BdHNe I are the most compact (about five minutes orbital period), promptly form a BH and release $\\gtrsim 10^{52}$ erg. They form NS-BH binaries with tens of kyr merger timescale by gravitational-wave emission. BdHNe II and III do not form BHs, release $\\sim 10^{50}$-$10^{52}$ erg and $\\lesssim 10^{50}$ erg. They form NS-NS with a wider range of merger timescales. In some compact BdHNe II, either NS can become supramassive, i.e., above the critical mass of a non-rotating NS. Magnetic braking by a $10^{13}$ G field can delay BH formation, leading to BH-BH or NS-BH of tens of kyr merger timescale.\n\n", "2409.05509": "2024-09-09, **Origin of the break in the cosmic-ray electron plus positron spectrum at ~ 1 TeV**, Satyendra Thoudam et.al., [2409.05509v1](http://arxiv.org/abs/2409.05509v1)\n\n Recent measurements of the cosmic-ray electron plus positron spectrum by several experiments have confirmed the presence of a break at $\\sim\\,1$ TeV. The origin of the break is still not clearly understood. In this work, we explore different possibilities for the origin which include an electron source spectrum with a broken power-law, a power-law with an exponential or super-exponential cut-offs and the absence of potential nearby cosmic-ray sources. Based on the observed electron plus positron data from the DAMPE and the H.E.S.S experiments, and considering supernova remnants as the main sources of cosmic rays in the Galaxy, we find statistical evidence in favour of the scenario with a broken power-law source spectrum with the best-fit source parameters obtained as $\\Gamma=2.39$ for the source spectral index, $E\\_0\\approx 1.6$ TeV for the break energy and $f=1.59\\times 10^{48}$ ergs for the amount of supernova kinetic energy injected into cosmic-ray electrons. Such a power-law break in the spectrum has been predicted for electrons confined inside supernova remnants after acceleration via diffusive shock acceleration process, and also indicated by the multi-wavelength study of supernova remnants. All these evidences have shown that the observed spectral break provides a strong indication of a direct link between cosmic-ray electrons and their sources. Our findings further show that electrons must undergo spectral changes while escaping the source region in order to reconcile the difference between the spectral index of electrons observed inside supernova remnants and that obtained from Galactic cosmic-ray propagation studies.\n\n"}}