{"neutrino": {"2412.14160": "2024-12-18, **$2νββ$ Spectrum in Chiral Effective Field Theory**, Saad el Morabit et.al., [2412.14160v1](http://arxiv.org/abs/2412.14160v1)\n\n We investigate two-neutrino double beta decay ($2\\nu\\beta\\beta$) in chiral effective field theory. We find contributions from weak magnetism and double-weak pion-exchange at next-to-leading-order in the chiral power counting. We discuss the impact of the chiral corrections on the electron spectra and find that they should be included in analyses of $2\\nu\\beta\\beta$ decay that aim to uncover new physics signatures in the electron spectrum. We illustrate this point by revisiting the effect of sterile neutrinos and non-standard charged interactions. We also find that the pion-exchange contributions involve nuclear matrix elements that are related to those appearing in neutrinoless double beta decay ($0\\nu \\beta \\beta$). We investigate whether the $0\\nu \\beta \\beta$ nuclear matrix elements can be obtained from detailed measurements of the energy spectrum of the outgoing electrons in $2\\nu\\beta\\beta$ transitions.\n\n", "2412.14121": "2024-12-18, **Leptogenesis with Majoron Dark Matter**, Stephen F. King et.al., [2412.14121v1](http://arxiv.org/abs/2412.14121v1)\n\n We discuss a model of neutrino mass based on the type I seesaw mechanism embedded in a spontaneously broken global lepton number framework with a $Z\\_2$ symmetry. We show that the resulting Majoron is a viable freeze-in dark matter candidate. Two right-handed neutrinos are assumed to have dominant off-diagonal masses suggesting resonant leptogenesis as the origin of baryon asymmetry of the Universe. Explicit higher dimensional lepton number violating operators, are shown to play a crucial role in simultaneously controlling both the Majoron production in the early Universe and the right handed neutrino mass splitting relevant for resonant leptogenesis. We perform a combined analysis of Majoron dark matter and leptogenesis, discussing the relative importance of self energy and vertex contributions to CP asymmetry, and explore the parameter space, leading to an intricate relation between neutrino mass, dark matter and baryon asymmetry.\n\n", "2412.14115": "2024-12-18, **The Neutrino Slice at Muon Colliders**, Luc Bojorquez-Lopez et.al., [2412.14115v1](http://arxiv.org/abs/2412.14115v1)\n\n Muon colliders provide an exciting new path pushing forward the energy frontier of particle physics. We point out a new use of these facilities for neutrino physics and beyond the Standard Model physics \\emph{using their main detectors}. Muon decays along the main accelerator rings induce an intense, highly collimated beam of neutrinos. As this beam crosses a thin slice of the kt-scale detector, it would induce unprecedented numbers of neutrino interactions, with $\\mathcal{O}(10^4)$ events per second for a 10 TeV $\\mu^+\\mu^-$ collider. We characterize these events, showing that they are highly energetic and possess a distinct timing signature with a large transverse displacement. We discuss promising applications of these events for instrumentation, electroweak, and beyond-the-Standard Model physics. For instance, we show that a sub-percent measurement of the neutrino-electron scattering rate enables new precision measurements of the Weak angle and a novel detection of the neutrino charge radius.\n\n", "2412.14044": "2024-12-18, **Freeze-in leptogenesis with sterile neutrino self-interactions**, Maria Dias Astros et.al., [2412.14044v1](http://arxiv.org/abs/2412.14044v1)\n\n Sterile neutrinos are a simple yet compelling addition to the Standard Model. For right-handed neutrinos with masses below the electroweak scale, leptogenesis can proceed through CP-violating oscillations of the sterile neutrinos. This is known as ARS or freeze-in leptogenesis. However, the ARS scenario requires the right-handed neutrinos to have a high degree of mass degeneracy. In this work, we study an extension of the SM that introduces a scalar singlet in addition to the two sterile neutrinos required to generate the baryon asymmetry. The new scalar interacts with the sterile neutrinos via a Yukawa interaction. This leads to an additional rate for the production and destruction of the sterile neutrinos and to a novel contribution to the effective potential. For the case in which the mass and the new Yukawa matrices are not diagonal in the same basis, we find that the effective potential can boost the baryon asymmetry of the universe by several orders of magnitude. This significantly alleviates the fine-tuned mass condition required in vanilla ARS leptogenesis.\n\n", "2412.13829": "2024-12-18, **Minimal extension of the Standard Model with a mirror symmetry between fundamental fermions and a possible origin of dark matter**, Jakub Rembieliński et.al., [2412.13829v1](http://arxiv.org/abs/2412.13829v1)\n\n In this paper, we propose a specific, nontrivial extension of the Standard Model of weak interactions based on the ${SU(2)}\\_L\\times{U(1)}\\_Y\\times{U(1)}\\_C$ group. Our motivation follows from the identification of the globally conserved charge $\\Omega=\\mathrm{B}-\\mathrm{L}-\\mathrm{Q}$ as a neutrino charge. An intriguing feature of the model is the emergence of a mirror symmetry between neutrinos and electrically charged leptons, as well as between up and down quarks. Following the spontaneous breaking of the weak gauge symmetry with the use of the Goldstone-Higgs iso-doublet, all elementary fermions acquire Dirac masses from Yukawa interaction. The $W^\\pm$ and $Z$ bosons also acquire masses, although with a modified relationship between their respective masses, as compared to the Standard Model. Our model accounts for both chiral components of the neutrino and offers an explanation for the non-observability of the right-chiral neutrino. Additionally, it forbids neutrinoless double-beta decay. Spontaneous breaking of the local $U(1)$ symmetry leads to the new gauge boson $ \\mathit{\\Omega}\\_\\mu$ mass $M\\_\\mathit{\\Omega}$, which we assume to be greater than the mass $m\\_\\chi$ of a new scalar, Higgs-like field $\\chi$. The cosmological stability of $\\chi$, predicted under this condition, allows for its interpretation as dark matter, interacting exclusively with $\\mathit{\\Omega}\\_\\mu$ and gravity. From this perspective, we solve and analyze a system of Boltzmann equations that describe the thermal evolution of the number density of $\\chi$ dark matter and the $\\mathit{\\Omega}\\_\\mu$ mediator field within the context of the $\\mathrm{\\Lambda CDM}$ cosmological model. Specifically, we estimate the coupling constant $q$ to be in the range of $\\sim 10^{-8.5}\\ g$ to $\\sim 10^{-6}\\ g$ which ensures cosmological stability of the $\\chi$ particles.\n\n", "2412.13707": "2024-12-18, **Background characterization of the CONUS+ experimental location**, CONUS Collaboration et.al., [2412.13707v1](http://arxiv.org/abs/2412.13707v1)\n\n CONUS+ is an experiment aiming at detecting coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) of reactor antineutrinos on germanium nuclei in the fully coherent regime, continuing the CONUS physics program conducted at the Brokdorf nuclear power plant (KBR), Germany. The CONUS+ experiment is installed in the Leibstadt nuclear power plant (KKL), Switzerland, at a distance of 20.7 m from the 3.6 GW reactor core, where the antineutrino flux is $1.5\\cdot 10^{13}$~s$^{-1}$cm$^{-2}$. The CE$\\nu$NS signature will be measured with four point-contact high-purity low energy threshold germanium (HPGe) detectors. A good understanding of the background is crucial, especially events correlated with the reactor thermal power are troublesome. A large background characterization campaign was conducted during reactor on and off times to find the best location for the CONUS+ setup. On-site measurements revealed a correlated, highly thermalized neutron field with a maximum fluence rate of $(2.3\\pm0.1)\\cdot 10^{4}$~neutrons~d$^{-1}$cm$^{-2}$ during reactor operation. The $\\gamma$-ray background was studied with a HPGe detector without shield. The muon flux was examined using a liquid scintillator detector measuring (107$\\pm$3)~muons~s$^{-1}$m$^{-2}$, which corresponds to an average overburden of 7.4~m of water equivalent. The new background conditions in CONUS+ are compared to the previous CONUS ones, showing a 30 times higher flux of neutrons, but a 26 times lower component of reactor thermal power correlated $\\gamma$-rays over 2.7 MeV. The lower CONUS+ overburden increases the number of muon-induced neutrons by 2.3 times and the flux of cosmogenic neutrons. Finally, all the measured rates are discussed in the context of the CONUS+ background, together with the CONUS+ modifications performed to reduce the impact of the new background conditions at KKL.\n\n", "2412.13696": "2024-12-18, **Taming flavour violation in the Inverse Seesaw**, Jonathan Kriewald et.al., [2412.13696v1](http://arxiv.org/abs/2412.13696v1)\n\n The Inverse Seesaw mechanism remains one of the most attractive explanations for the lightness of neutrino masses, allowing for natural low-scale realisations. We consider the prospects of a simple extension via 3 generations of sterile fermions - the so called ISS(3,3) - in what concerns numerous lepton flavour observables. In order to facilitate a connection between the Lagrangian parameters and low-energy data, we systematically develop new parametrisations of the Yukawa couplings. Relying on these new parametrisations to explore the parameter space, we discuss the complementary role of charged lepton flavour violation searches in dedicated facilities, as well as in lepton colliders (FCC-ee and $\\mu$TRISTAN). Our results reveal the strong synergy of the different indirect searches in probing the distinct flavour sectors of the model. In particular, we show that in the absence of radiative decays $\\ell\\_\\alpha\\to\\ell\\_\\beta\\gamma$, sizeable rates for $Z$-penguin dominated observables could hint at a non-trivially mixed and non-degenerate heavy spectrum.\n\n"}, "dark matter": {"2412.14139": "2024-12-18, **Alleviating cosmological tensions with a hybrid dark sector**, Elsa M. Teixeira et.al., [2412.14139v1](http://arxiv.org/abs/2412.14139v1)\n\n We investigate a cosmological model inspired by hybrid inflation, where two scalar fields representing dark energy (DE) and dark matter (DM) interact through a coupling that is proportional to the DE scalar field $1/\\phi$. The strength of the coupling is governed solely by the initial condition of the scalar field, $\\phi\\_i$, which parametrises deviations from the standard $\\Lambda$CDM model. In this model, the scalar field tracks the behaviour of DM during matter-domination until it transitions to DE while the DM component decays quicker than standard CDM during matter-domination, and is therefore different from some interacting DM-DE models which behaves like phantom dark energy. Using \\textit{Planck} 2018 CMB data, DESI BAO measurements and Pantheon+ supernova observations, we find that the model allows for an increase in $H\\_0$ that can help reduce the Hubble tension. In addition, we find that higher values of the coupling parameter are correlated with lower values of $\\omega\\_m$, and a mild decrease of the weak-lensing parameter $S\\_8$, potentially relevant to address the $S\\_8$ tension. Bayesian model comparison, however, reveals inconclusive results for most datasets, unless S$H\\_0$ES data are included, in which case a moderate evidence in favour of the hybrid model is found.\n\n", "2412.13404": "2024-12-18, **Dark Matter: Explanatory Unification and Historical Continuity**, Simon Allzén et.al., [2412.13404v1](http://arxiv.org/abs/2412.13404v1)\n\n In recent years, the hope to confirm the existence of dark matter by experimentally detecting it has diminished significantly. After more than 30 years of experimental searches, many of the most promising candidates have since been ruled out, leaving the epistemic and scientific condition of dark matter in a state of suspension. In efforts to improve the epistemic justification for the dark-matter hypothesis, physicists have turned to philosophical arguments and historical narratives. In this paper, I explicate two such strategies -- explanatory unification and historical continuity -- applied in the context of dark matter. I argue that greater care and attention should be invested in the explanatory arguments to increase their strength, and that a survey of primary historical sources in astronomy renders the historical evidence for the continuity of dark matter substantially weaker. The quality and rigor of the philosophical and historical arguments which physicists are constructing could be substantially improved by increasing interdisciplinary practices.\n\n"}, "supernova": {"2412.14139": "2024-12-18, **Alleviating cosmological tensions with a hybrid dark sector**, Elsa M. Teixeira et.al., [2412.14139v1](http://arxiv.org/abs/2412.14139v1)\n\n We investigate a cosmological model inspired by hybrid inflation, where two scalar fields representing dark energy (DE) and dark matter (DM) interact through a coupling that is proportional to the DE scalar field $1/\\phi$. The strength of the coupling is governed solely by the initial condition of the scalar field, $\\phi\\_i$, which parametrises deviations from the standard $\\Lambda$CDM model. In this model, the scalar field tracks the behaviour of DM during matter-domination until it transitions to DE while the DM component decays quicker than standard CDM during matter-domination, and is therefore different from some interacting DM-DE models which behaves like phantom dark energy. Using \\textit{Planck} 2018 CMB data, DESI BAO measurements and Pantheon+ supernova observations, we find that the model allows for an increase in $H\\_0$ that can help reduce the Hubble tension. In addition, we find that higher values of the coupling parameter are correlated with lower values of $\\omega\\_m$, and a mild decrease of the weak-lensing parameter $S\\_8$, potentially relevant to address the $S\\_8$ tension. Bayesian model comparison, however, reveals inconclusive results for most datasets, unless S$H\\_0$ES data are included, in which case a moderate evidence in favour of the hybrid model is found.\n\n"}}