{"neutrino": {"2508.10876": "2025-08-14, **Accelerating cosmological inference of interacting dark energy with neural emulators**, Karim Carrion et.al., [2508.10876v1](http://arxiv.org/abs/2508.10876v1)\n\n The present thesis aims to tackle two critical aspects of present and future cosmological analysis of Large-Scale Structure (LSS): accurate modelling of the nonlinear matter power spectrum beyond $\\Lambda$CDM, and efficient computational techniques for Bayesian parameter estimation. Both are crucial for testing alternative cosmologies and avoiding spurious results. We focus on the Dark Scattering (DS) model, describing pure momentum transfer between dark matter -- dark energy through the parameter $A\\_{\\rm ds}$. To capture DS effects, we adopt the halo model reaction framework within $\\tt{ReACT}$, compute the nonlinear DS spectrum, and validate it against $N$-body simulations. We further include baryonic feedback and massive neutrinos, finding degeneracies between DS and baryonic effects but not with neutrinos. We then constrain DS using cosmic shear from KiDS-1000, accelerated by neural emulators from $\\tt{CosmoPower}$, which speed up predictions by $\\mathcal{O}(10^4)$. Our DS emulator, trained on halo model reaction outputs, preserves percent-level accuracy and incorporates baryonic feedback. Analysing KiDS shear statistics, we obtain $\\vert A\\_{\\rm ds}\\vert \\lesssim 20$ b/GeV at $68 \\%$ C.L. Combining KiDS with Planck CMB and BAO data, we find $A\\_{\\rm ds}=10.6^{+4.5}\\_{-7.3}$ b/GeV at $68 \\%$ C.L., suggesting the DS model as a promising resolution to the $S\\_8$ tension. Finally, we present weak lensing forecasts for Stage IV surveys using an automatically differentiable pipeline with $\\tt{jax-cosmo}$ and gradient-based samplers in $\\tt{NumPyro}$, reducing computational cost from months on CPUs to days on GPUs. Model evidence is evaluated with $\\tt{harmonic}$ under multiple scale cuts. To put things into perspective, the modelling strategies and machine learning accelerations developed here provide powerful tools for the next generation of LSS cosmology.\n\n", "2508.10734": "2025-08-14, **Right handed neutrino production from $Z^\\prime$ interactions in forward search experiments**, ShivaSankar K. A et.al., [2508.10734v1](http://arxiv.org/abs/2508.10734v1)\n\n We study two general $U(1)$ extensions of the Standard Model (SM) those generate tiny neutrino masses via the seesaw mechanism after general $U(1)$ breaking. These models predict a new neutral gauge boson ($Z'$) and right-handed neutrinos (RHNs), the latter introduced for anomaly cancellation and neutrino mass generation. In both scenarios, left- and right-handed fermions couple differently to the $Z'$, and RHNs mix with light neutrinos, enabling variety of decay modes. Focusing on the high-luminosity LHC (HL-LHC) and the future FASER2 experiment, we explore RHN pair production from $Z'$ decays in two cases: (i) long-lived $Z'$ decays to visible modes and long-lived RHNs, and (ii) short-lived $Z'$ decays to long-lived RHNs, which further decay visibly inside FASER2. We estimate projected limits on the general $U(1)$ gauge coupling, $Z'$ mass, RHN mass, and light-heavy neutrino mixing for various $U(1)$ charge assignments, and compare them with current experimental bounds.\n\n", "2508.10487": "2025-08-14, **Ultra-luminous X-ray pulsars as sources of TeV neutrinos**, L. Ducci et.al., [2508.10487v1](http://arxiv.org/abs/2508.10487v1)\n\n We explored the expected properties of the neutrino emission from accreting neutron stars in X-ray binaries using numerical simulations. The simulations are based on a model in which neutrinos are produced by the decay of charged pions and kaons, generated in inelastic collisions between protons accelerated up to TeV energies in the magnetosphere of a magnetized (B~1E12 G) neutron star and protons of the accretion disc. Our results show that this process can produce strong neutrino emission up to a few tens of TeV when the X-ray luminosity is above ~1E39 erg/s, as in ultra-luminous X-ray (ULX) pulsars. We show that neutrinos from a transient Galactic ULX pulsar with L\\_x ~ 5E39 erg/s can be detected with kilometre-scale detectors such as IceCube if the source is within about 3-4 kpc. We also derived an upper limit on the neutrino flux from the Galactic ULX pulsar Swift J0243.6+6124 using IceCube data, a result that has not been previously reported. Our findings establish a new benchmark for future astrophysical neutrino observations, critical for interpreting data from current and upcoming instruments with significantly improved sensitivity.\n\n"}, "dark matter": {"2508.10665": "2025-08-14, **Gravitational Wave Spectrum from the Production of Dark Matter via the freeze-in Mechanism**, Yonghua Wang et.al., [2508.10665v1](http://arxiv.org/abs/2508.10665v1)\n\n Since the first detection of gravitational waves by ground-based interferometers, it has emerged as a novel probe for exploring physics in the early universe. The particle nature of cold dark matter (DM) and its underlying production mechanisms remain long-standing unresolved issues in the field. Notably, if DM is generated through the freeze-in mechanism in the early universe, direct laboratory detection becomes extraordinarily challenging due to its extremely weak coupling with standard model particles. In this study, we calculate the graviton bremsstrahlung process involved in the freeze-in production of dark matter, deriving the gravitational wave spectra for both the conventional freeze-in mechanism and ultraviolet freeze-in scenarios. Our analysis reveals that these spectra exhibit distinct characteristics, though they fall beyond the detection limits of currently proposed gravitational wave experiments. However, advancements in high-frequency gravitational wave detection technologies in the future may offer a means to indirectly probe the ultraviolet freeze-in mechanism.\n\n", "2508.10602": "2025-08-14, **Development of superfluid helium-3 bolometry using nanowire resonators with SQUID readout for the QUEST-DMC experiment**, QUEST-DMC Collaboration et.al., [2508.10602v1](http://arxiv.org/abs/2508.10602v1)\n\n Superfluid helium-3 bolometers can be utilised for dark matter direct detection searches. The extremely low heat capacity of the B phase of the superfluid helium-3 at ultra-low temperatures offers the potential to reach world leading sensitivity to spin dependent interactions of dark matter in the sub-GeV/c$^2$ mass range. Here, we describe the development of bolometry using both micron scale and sub-micron diameter vibrating wire resonators, with a SQUID amplifier-based readout scheme. Characterisation of the resonators and bolometer measurements are shown, including the use of non-linear operation and the corresponding corrections. The bolometer contains two vibrating wire resonators, enabling heat injection calibration and simultaneous bolometer tracking measurements. Coincident events measured on both vibrating wire resonators verify their response. We also demonstrate proof of concept frequency multiplexed readout. Development of these measurement techniques lays the foundations for the use of superfluid helium-3 bolometers, instrumented with vibrating nano-mechanical resonators, for future low threshold dark matter searches.\n\n", "2508.10543": "2025-08-14, **Dark Star Clusters or Ultra-Faint Dwarf galaxies? Revisiting UMa3/U1**, Ali Rostami-Shirazi et.al., [2508.10543v1](http://arxiv.org/abs/2508.10543v1)\n\n Owing to sparse spectroscopic observations, the classification of faint satellites as either dark matter-dominated dwarf galaxies or self-gravitating star clusters remains unresolved. The recently discovered Ursa Major III/UNIONS 1 (UMa3/U1) object, with its measured velocity dispersion, provides a rare observational anchor in this regime. Despite its cluster-like compactness, its inferred dynamical mass-to-light ratio (M\\_dyn/L) suggests a dark matter-dominated nature, prompting interpretations of UMa3/U1 as a microgalaxy, though current measurements remain inconclusive. Thousand-level M\\_dyn/L values are not unique to galaxies; self-gravitating dark star clusters (DSCs) can reach comparable levels via energy injection driven by a centrally segregated black hole subsystem (BHSub), which accelerates the evaporation of luminous stars and leads to a super-virial appearance with elevated velocity dispersion. To assess whether UMa3/U1 is a DSC, we conducted direct N-body simulations and identified a model that successfully reproduces both its compact structure and elevated M\\_dyn/L, supporting a self-gravitating cluster origin. We find the cluster entered the DSC phase around 4 Gyr ago, with its luminous stars expected to be depleted within the next 1 Gyr, followed by the gradual disruption of the central BHSub over the subsequent Gyr. We broaden our analysis by mapping DSC evolutionary tracks in the size versus total luminosity (L) and M\\_dyn/L-L spaces, showing that DSCs occupy a region overlapping with faint, ambiguous satellites. In the M\\_dyn/L-L diagram, DSCs trace a transitional channel bridging globular clusters and dwarf galaxies as they rise from M\\_dyn/L ~ 2 to 10^4 M\\_sun/L\\_sun.\n\n", "2508.10278": "2025-08-14, **SHH method for SIDM: An SIDM-hydro hybrid method for simulating self-interacting dark matter**, Sarah Schon et.al., [2508.10278v1](http://arxiv.org/abs/2508.10278v1)\n\n We present a new scheme to couple existing numerical methods for elastic self-interacting dark matter (SIDM) to the hydrodynamic equations via a continuous function of the local Knudsen number. The method, an SIDM-hydro hybrid (SHH), allows more efficient simulation of the evolution of inhomogeneous halos deep into the regime of gravothermal collapse. With the improved efficiency gained by moving to a hydrodynamical description in high-density regions, the SHH method allows central densities of two orders of magnitude higher to be reached in considerably less simulation time than traditional methods. Our implementation should be considered as the first step toward a robust SHH method, as we interpolate the first and second moments of the Boltzmann equation in the ideal-fluid limit only. The simulation results are qualitatively similar to those found with other methods, although there are differences in the implementation of the primary physics driving the dynamics, and in the details of the resulting halo profiles. However, our results indicate that the SHH technique shows promise to investigate gravothermal collapse in diverse, dynamical environments. The method can be extended to incorporate non-ideal fluid terms and dissipation, as needed for dark-matter scenarios where interactions beyond the elastic regime may be important in the dense interiors of some halos.\n\n"}, "supernova": {"2508.10878": "2025-08-14, **The Dark Energy Bedrock All-Sky Supernova Program: Motivation, Design, Implementation, and Preliminary Data Release**, Nora F. Sherman et.al., [2508.10878v1](http://arxiv.org/abs/2508.10878v1)\n\n Precise measurements of Type Ia supernovae (SNe Ia) at low redshifts ($z$) serve as one of the most viable keys to unlocking our understanding of cosmic expansion, isotropy, and growth of structure. The Dark Energy Bedrock All-Sky Supernovae (DEBASS) program will deliver the largest uniformly calibrated low-$z$ SN Ia data set in the southern hemisphere to date. DEBASS utilizes the Dark Energy Camera to image supernovae in conjunction with the Wide-Field Spectrograph (WiFeS) to gather comprehensive host galaxy information. By using the same photometric instrument as both the Dark Energy Survey (DES) and the DECam Local Volume Exploration Survey, DEBASS not only benefits from a robust photometric pipeline and well-calibrated images across the southern sky, but can replace the historic and external low-$z$ samples that were used in the final DES supernova analysis. DEBASS has accumulated more than 400 spectroscopically confirmed SNe Ia in the redshift range of $0.01<z<0.08$ from 2021 to mid-2025, and, in this paper along with a companion paper Acevedo et al. submitted, we present an early data release of 77 SNe within the DES footprint to demonstrate the merit and constraining power of the data set. Here, we introduce the DEBASS program, discuss its scientific goals and the advantages it offers for supernova cosmology, and present our initial results. With this early data release, we find a robust median absolute standard deviation of Hubble diagram residuals of $\\sim$0.10 mag and an initial measurement of the host-galaxy mass step of $0.06\\pm0.04$ mag, both before performing bias corrections. This low scatter shows the promise of a low-$z$ SN Ia program with a well-calibrated telescope and high signal-to-noise ratio across multiple bands.\n\n", "2508.10877": "2025-08-14, **The Dark Energy Bedrock All-Sky Supernova Program: Cross Calibration, Simulations, and Cosmology Forecasts**, Maria Acevedo et.al., [2508.10877v1](http://arxiv.org/abs/2508.10877v1)\n\n Type Ia supernovae (SNe Ia) have been essential for probing the nature of dark energy; however, most SN analyses rely on the same low-redshift sample, which may lead to shared systematics. In a companion paper (Sherman et al., submitted), we introduce the Dark Energy Bedrock All-Sky Supernova (DEBASS) program, which has already collected more than 500 low-redshift SNe Ia on the Dark Energy Camera (DECam), and present an initial release of 77 SNe Ia within the Dark Energy Survey (DES) footprint observed between 2021 and 2024. Here, we examine the systematics, including photometric calibration and selection effects. We find agreement at the 10 millimagnitude level among the tertiary standard stars of DEBASS, DES, and Pan-STARRS1. Our simulations reproduce the observed distributions of DEBASS SN light-curve properties, and we measure a bias-corrected Hubble residual scatter of $0.08$ mag, which, while small, is found in 10% of our simulations. We compare the DEBASS SN distances to the Foundation sample and find consistency with a median residual offset of $0.016 \\pm 0.019$ mag. Selection effects have negligible impacts on distances, but a different photometric calibration solution shifts the median residual $-0.015 \\pm 0.019$ mag, highlighting calibration sensitivity. Using conservative simulations, we forecast that replacing historical low-redshift samples with the full DEBASS sample (>400 SNe Ia) will improve the statistical uncertainties on dark energy parameters $w\\_0$ and $w\\_a$ by 30% and 24% respectively, enhance the dark energy Figure of Merit by up to 60%, and enable a measurement of $f\\sigma\\_8$ at the 25% level.\n\n", "2508.10843": "2025-08-14, **The explosion jets of the core-collapse supernova remnant Circinus X-1**, Noam Soker et.al., [2508.10843v1](http://arxiv.org/abs/2508.10843v1)\n\n We propose that the recently analyzed opposite rings in the Circinus X-1 (Cir X-1) core collapse supernova (CCSN) remnant resulted from a pair of opposite jets at the final phases of the jet-driven explosion process of the progenitor of Cir X-1. We point out the similarity of the rings in the Cir X-1 CCSN remnant to a ring in the Cygnus Loop CCSN remnant. While the X-ray binary system Cir X-1 actively launches jets, no such activity exists in the Cygnus Loop. In both CCSN remnants, we attribute the rings to jets that are part of the explosion process in the framework of the jittering jets explosion mechanism (JJEM). We also identify such a ring in the CCSN remnant 107.7-5.1, which we also attribute to exploding jets. We conduct three-dimensional hydrodynamical simulations of late jets inside an exploding massive stellar core, and demonstrate the feasibility of this scenario for ring formation. The Cir X-1 CCSN remnant has a large blowout, similar to that of the Cygnus Loop and to a large protrusion in the CCSN remnant G0.9+0.1 . Based on these similarities, we suggest that other exploding jets inflated the blowout of the Cir X-1 nebula, identical to an earlier claim on the formation of the blowout of the Cygnus Loop. We identify a point-symmetric structure in the Cir X-1 CCSN remnant, strengthening the JJEM. This study further demonstrates that the JJEM is a successful explosion mechanism to analyze CCSNe and CCSN remnants.\n\n", "2508.10752": "2025-08-14, **Signature of the explosion mechanism of Type-Ia SNe in substructures of the remnant: the case of Tycho's SNR**, Soham Mandal et.al., [2508.10752v1](http://arxiv.org/abs/2508.10752v1)\n\n Type-Ia supernovae (SNe), or runaway thermonuclear explosions of white dwarfs (WDs), play a critical role in the chemical evolution of galaxies, and are important cosmological distance indicators due to their 'standardizable' lightcurves. Growing evidence, however, suggests greater diversity in their observed lightcurves (and spectra) than thought previously. This is usually attributed to a variety of WD explosion mechanisms and progenitor system properties, but a direct link between the explosion mechanisms and Type-Ia SN observables remains elusive. Here we present a novel approach to identify explosion mechanisms of Type-Ia SNe, by analyzing the sizes of small-scale turbulent substructures of different elements in their extended ejecta, i.e., in Supernova Remnants (SNRs). Our three-dimensional hydrodynamical models show that substructures in an SNR dominated by iron-group elements may have a typical size different from substructures dominated by intermediate mass elements (e.g., Si, S) in the same SNR. This size difference is governed by the explosion mechanism. Applying this approach to Tycho's SNR, we find that its observed structure is most consistent with the explosion of a sub-Chandrasekhar mass WD via the double-detonation mechanism. Extending this method to other well-characterized SNRs can let us connect the inferred explosion mechanism to the associated historical SNe, which often have spectra reconstructed through light echo observations.\n\n", "2508.10573": "2025-08-14, **Constraints on the progenitor and explosion of SN 2024ggi in harmony with pre-explosion detection and hydrodynamic simulations**, Amar Aryan et.al., [2508.10573v1](http://arxiv.org/abs/2508.10573v1)\n\n Supernova (SN) 2024ggi is a nearby Type II SN discovered by ATLAS, showing early flash-ionization features. The pre-explosion images reveal a red supergiant (RSG) progenitor with an initial mass of 10-17 M$\\_\\odot$. In the present work, we perform detailed hydrodynamic modeling to refine and put robust constraints on the progenitor and explosion parameters of SN 2024ggi. Among the progenitor models in our study, the pre-SN properties of the 11 M$\\_{\\odot}$ match the pre-explosion detected progenitor well. However, we find it difficult to completely rule out the 10 M$\\_{\\odot}$ and 12 M$\\_{\\odot}$ models. Thus, we provide a constraint of 11$^{+1}\\_{-1}$ M$\\_{\\odot}$ on the initial mass of the progenitor. To match the observed bolometric light curve and velocity evolution of SN 2024ggi, the favored model with an initial mass of 11 M$\\_{\\odot}$ has a pre-SN radius of 800 R$\\_{\\odot}$ and requires an explosion energy of [0.7-0.8]$\\times$10$^{51}$ erg, nickel mass of $\\lesssim$0.055 M$\\_{\\odot}$, ejecta mass of 9.1 M$\\_{\\odot}$, and an amount of $\\sim$ 0.5 M$\\_{\\odot}$ of steady-wind CSM extended up to $\\sim1.2\\times10^{14}$ cm resulting from an eruptive mass-loss rate of 1.0 M$\\_{\\odot}$ yr$^{-1}$. We also incorporate the accelerated-wind CSM scenario which suggests a mass-loss rate of 1.0$\\times10^{-2}$ M$\\_{\\odot}$ yr$^{-1}$ and a CSM mass of $\\sim$ 0.7 M$\\_{\\odot}$ extended up to $\\sim1.1\\times10^{14}$ cm. This mass-loss rate falls within the range constrained observationally. Additionally, due to the constraint of 11$^{+1}\\_{-1}$ M$\\_{\\odot}$ on the initial mass, the range of pre-SN radius and ejecta mass would be [690-900] R$\\_{\\odot}$, and [8.2-9.6] M$\\_{\\odot}$, respectively.\n\n", "2508.10514": "2025-08-14, **Evidence for Evolving Dark Energy from LRG1 and Low-$z$ SNe Ia Data**, Himanshu Chaudhary et.al., [2508.10514v1](http://arxiv.org/abs/2508.10514v1)\n\n We present observational evidences indicating that dark energy may be evolving with time, thereby challenging the core assumptions of the standard $\\Lambda$CDM model. Our investigation extends beyond the standard $\\Lambda$CDM model by exploring a range of dynamical dark energy models. The analysis reveals that the matter density parameter, $\\Omega\\_m$, changes with redshift, and this change is significantly influenced by the LRG1 datapoint from the DESI DR2 survey. We find that including LRG1 strongly affects the predictions of these models, especially for $\\Omega\\_m$ and $\\omega\\_0$, with the latter shifting from $-1$ to slightly higher values. This suggests that the evidence of evolving dark energy in the DESI DR2 data is driven by the LRG1 datapoint. When we exclude low-redshift supernovae data, particularly from the DES-SN5YR compilation, the model predictions are restored to the $\\Lambda$CDM paradigm. This effect is particularly evident in the GEDE model, where removing low-redshift supernovae data leads to $\\Delta = 0$, effectively recovering $\\Lambda$CDM paradigm. Our analysis confirms that the evidence for dynamical dark energy is substantial, particularly at low redshift ($z \\lesssim 0.3$). The reconstruction of $\\omega(z)$ and $f\\_{DE}(z)$, using a combination of DESI DR2 BAO measurements, CMB distance priors, and supernovae datasets, further supports the evolving nature dark energy. These results favor a dynamical dark-energy scenario characterized by $\\omega\\_0>-1$, $\\omega\\_a<0$, and $\\omega\\_0+\\omega\\_a<-1$ (Quintom-B). Bayesian analysis of model evidence reveals that the inclusion of low-redshift supernovae data significantly strengthens the support for evolving dark energy models such as JBP and Mirage, while models revert to inconclusive or weak support when low-redshift data are excluded.\n\n"}}