{"neutrino": {"2303.15970": "2023-03-28, **A Search for IceCube sub-TeV Neutrinos Correlated with Gravitational-Wave Events Detected By LIGO/Virgo**, R. Abbasi et.al., [2303.15970v1](http://arxiv.org/abs/2303.15970v1)\n\n The LIGO/Virgo collaboration published the catalogs GWTC-1, GWTC-2.1 and GWTC-3 containing candidate gravitational-wave (GW) events detected during its runs O1, O2 and O3. These GW events can be possible sites of neutrino emission. In this paper, we present a search for neutrino counterparts of 90 GW candidates using IceCube DeepCore, the low-energy infill array of the IceCube Neutrino Observatory. The search is conducted using an unbinned maximum likelihood method, within a time window of 1000 s and uses the spatial and timing information from the GW events. The neutrinos used for the search have energies ranging from a few GeV to several tens of TeV. We do not find any significant emission of neutrinos, and place upper limits on the flux and the isotropic-equivalent energy emitted in low-energy neutrinos. We also conduct a binomial test to search for source populations potentially contributing to neutrino emission. We report a non-detection of a significant neutrino-source population with this test.\n\n", "2303.15920": "2023-03-28, **Probing Heavy Neutrinos at the LHC from Fat-jet using Machine Learning**, Wei Liu et.al., [2303.15920v1](http://arxiv.org/abs/2303.15920v1)\n\n We explore the potential to use machine learning methods to search for heavy neutrinos, from their hadronic final states including a fat-jet signal, via the processes $pp \\rightarrow W^{\\pm *}\\rightarrow \\mu^{\\pm} N \\rightarrow \\mu^{\\pm} \\mu^{\\mp} W^{\\pm} \\rightarrow \\mu^{\\pm} \\mu^{\\mp} J$ at hadron colliders. We use either the Gradient Boosted Decision Tree or Multi-Layer Perceptron methods to analyse the observables incorporating the jet substructure information, which is performed at hadron colliders with $\\sqrt{s}=$ 13, 27, 100 TeV. It is found that, among the observables, the invariant masses of variable system and the observables from the leptons are the most powerful ones to distinguish the signal from the background. With the help of machine learning techniques, the limits on the active-sterile mixing have been improved by about one magnitude comparing to the cut-based analyses, with $V\\_{\\mu N}^2 \\lesssim 10^{-4}$ for the heavy neutrinos with masses, 100 GeV$~<m\\_N<~$1 TeV.\n\n", "2303.15709": "2023-03-28, **Testing the type II seesaw leptogenesis at the LHC**, Chengcheng Han et.al., [2303.15709v1](http://arxiv.org/abs/2303.15709v1)\n\n The type II seesaw leptogenesis simultaneously explains the origin of neutrino masses, the baryon asymmetry of our universe, and the inflation. The large hadron collider(LHC) provides an opportunity to directly test the type II seesaw leptogenesis by looking for the predicted triplet Higgs. In this paper, we perform an analysis of the detection prospect for the triplet Higgs at the LHC through the multi-lepton channels. We find that due to the contribution of $pp\\to H^{\\pm \\pm }H^{\\mp }$ process, the sensitivity of multi-lepton channels searching for the doubly-charged Higgs pair production can be improved. We also investigate the $3l+ {E}^{\\rm miss}\\_{\\rm T}$ signals to probe the $pp\\to H^{\\pm \\pm }H^{\\mp }$ production and find that the future high luminosity LHC could probe a triplet Higgs around 1.2 TeV at $2\\sigma$ level.\n\n", "2303.15599": "2023-03-27, **Neutrinos in Global SU(5) F-theory Model**, Stuart Raby et.al., [2303.15599v1](http://arxiv.org/abs/2303.15599v1)\n\n In this talk, given at Corfu 2022 Workshop on the Standard Model and Beyond, I present work in collaboration with Junichiro Kawamura,Ref.~[arXiv:2212.00840]. The talk is also based on a number of papers on a Global $SU(5)$ F-theory GUT in collaboration with Herb Clemens. In the model $SU(5)$ is broken to the MSSM via a Wilson line. This is accomplished (without problems with vector-like exotics) by simultaneously describing the F-theory model and its Heterotic dual. The model has a twin MSSM sector and it's the neutrino sector of the field I consider in the talk.\n\n", "2303.15562": "2023-03-27, **Relic Neutrino Helicity Evolution in Galactic Magnetic Field and Its Implications**, Kuo K. Liao et.al., [2303.15562v1](http://arxiv.org/abs/2303.15562v1)\n\n We simulate the evolution of the helicity of relic neutrinos as they propagate to Earth through a realistic model of the Galactic magnetic field, improving upon the rough estimates in the pioneering work of Baym and Peng. We find that with magnetic moments consistent with experimental bounds and even several orders of magnitude smaller, the helicity of relic neutrinos rotates with a substantial directional anisotropy. Averaged over directions this would simply reduce the apparent flux; if the direction of the incident neutrino could be measured, the directional anisotropy in the interaction probability could become a powerful diagnostic. We study the effects of $\\nu$ spin rotation on C$\\nu$B detection through the inverse tritium decay process.\n\n", "2303.15527": "2023-03-27, **PEANUTS: a software for the automatic computation of solar neutrino flux and its propagation within Earth**, Tomás E. Gonzalo et.al., [2303.15527v1](http://arxiv.org/abs/2303.15527v1)\n\n We present PEANUTS (Propagation and Evolution of Active NeUTrinoS), an open-source Python package for the automatic computation of solar neutrino spectra and active neutrino propagation through Earth. PEANUTS is designed to be fast, by employing analytic formulae for the neutrino propagation through varying matter density, and flexible, by allowing the user to input arbitrary solar models, custom Earth density profiles and general detector locations. It provides functionalities for a fully automated simulation of solar neutrino fluxes at a detector, as well as access to individual routines to perform more specialised computations. The software has been extensively tested against the results of the SNO experiment, providing excellent agreement with their results. In addition, the present text contains a pedagogical derivation of the relations needed to compute the oscillated solar neutrino spectra, neutrino propagation through Earth and nadir exposure of an experiment.\n\n", "2303.15524": "2023-03-27, **Decoherence effects in reactor and Gallium neutrino oscillation experiments -- a QFT approach**, Raphael Krueger et.al., [2303.15524v1](http://arxiv.org/abs/2303.15524v1)\n\n We adopt the quantum field theoretical method to calculate the amplitude and event rate for a neutrino oscillation experiment, considering neutrino production, propagation and detection as a single process. This method allows to take into account decoherence effects in the transition amplitude induced by the quantum mechanical uncertainties of all particles involved in the process. We extend the method to include coherence loss due to interactions with the environment, similar to collisional line broadening. In addition to generic decoherence induced at the amplitude level, the formalism allows to include, in a straightforward way, additional damping effects related to phase-space integrals over momenta of unobserved particles as well as other classical averaging effects. We apply this method to neutrino oscillation searches at reactor and Gallium experiments and confirm that quantum decoherence is many orders of magnitudes smaller than classical averaging effects and therefore unobservable. The method used here can be applied with minimal modifications also to other types of oscillation experiments, e.g., accelerator based beam experiments.\n\n", "2303.15513": "2023-03-27, **Anticipating the XRISM search for the decay of resonantly produced sterile neutrino dark matter**, Mark R. Lovell et.al., [2303.15513v1](http://arxiv.org/abs/2303.15513v1)\n\n The resonantly produced sterile neutrino ($N\\_1$) of the neutrino minimal standard model ($\\nu$MSM) is a compelling dark matter candidate, especially in the reported possible detection of $N\\_1$ with mass $m\\_\\mathrm{s}=7.1$~keV in X-ray decay. This particle will be accessible to the XRISM X-ray mission over the next 12 months. We revisit the physics behind $N\\_1$ and the uncertainty in its parameters. We compare predictions for the $m\\_\\mathrm{s}=7.1$keV $N\\_1$ mixing angle, $\\sin^{2}(2\\theta)$, and half-mode mass, $M\\_\\mathrm{hm}$, to existing X-ray observations and structure formation constraints. The strongest available constraints rule out $N\\_1$ as a dark matter candidate, and a more optimistic reading of the data prefers $\\sin^{2}(2\\theta)=5\\times10^{-11}$ and $M\\_\\mathrm{hm}=3.5\\times10^{8}$$\\mathrm{M}\\_{\\odot}$. We highlight that the most promising upcoming opportunity for a detection is to find a line of velocity dispersion $\\sim500$$\\mathrm{kms^{-1}}$ in the Virgo cluster with XRISM, and then draw up a list of future objects of study to determine: (i) whether the line is from dark matter generally, and (ii) if from dark matter, whether that candidate is indeed $N\\_1$.\n\n", "2303.15300": "2023-03-27, **SiPM array of Xenoscope, a full-scale DARWIN vertical demonstrator**, R. Peres et.al., [2303.15300v1](http://arxiv.org/abs/2303.15300v1)\n\n The DARWIN project aims to build and operate a next-generation observatory for dark matter and neutrino physics, featuring a time projection chamber with a proposed active target of 40 t of liquid xenon. As an R&D facility to test fundamental components of the future detector, Xenoscope, a full-scale vertical demonstrator with ~400 kg of liquid xenon and up to 2.6 m electron drift length, was built at the University of Zurich. Its main objective is to demonstrate electron drift over unprecedented distances in liquid xenon - first in a purity monitor setup with charge readout, followed by a dual-phase time projection chamber. In this second phase, an array of 48 VUV4 MMPCs from Hamamatsu (model S13371-6050CQ-02) with a 12-channel readout will be placed above the liquid xenon column and operated as a light readout for the secondary proportional scintillation signals coming from extracted electrons in the time projection chamber. This work presents the design and development of the silicon photomultiplier array of Xenoscope, covering the structural and electronic design, sensor characterisation at cryogenic temperature and signal simulation.\n\n", "2303.15227": "2023-03-27, **Tri-Resonant Leptogenesis**, P. Candia da Silva et.al., [2303.15227v1](http://arxiv.org/abs/2303.15227v1)\n\n We present a class of leptogenesis models where the light neutrinos acquire their observed mass through a symmetry-motivated construction. We consider an extension of the Standard Model, which includes three singlet neutrinos which have mass splittings comparable to their decay widths. We show that this tri-resonant structure leads to an appreciable increase in the observed CP asymmetry over that found previously in typical bi-resonant models. To analyse such tri-resonant scenarios, we solve a set of coupled Boltzmann equations, crucially preserving the variations in the relativistic degrees of freedom. We highlight the fact that small variations at high temperatures can have major implications for the evolution of the baryon asymmetry when the singlet neutrino mass scale is below $100$ GeV. We then illustrate how this variation can significantly affect the ability to find successful leptogenesis at these low masses. Finally, the parameter space for viable leptogenesis is delineated, and comparisons are made with current and future experiments.\n\n", "2303.15118": "2023-03-27, **Hybrid scoto/seesaw: flavour and dark matter**, D. M. Barreiros et.al., [2303.15118v1](http://arxiv.org/abs/2303.15118v1)\n\n We propose a model based on the interplay between the type-II seesaw and scotogenic neutrino mass generation mechanisms. The setup features a $\\mathbb{Z}\\_8$ discrete flavour symmetry which is broken down to a residual $\\mathbb{Z}\\_2$ responsible for stabilising dark matter. A singlet scalar field is introduced to implement spontaneous CP violation. The effective neutrino mass matrix two-texture zero structure leads to sharp neutrino sector predictions. We analyse the constraints imposed on the model by current and future charged lepton flavour violation experiments. This framework provides two viable dark matter candidates, scalar or fermion. We investigate the scalar dark matter scenario considering relic density, direct-detection and collider constraints.\n\n"}, "dark matter": {"2303.15894": "2023-03-28, **The mass accretion history of dark matter haloes down to Earth mass**, Yizhou Liu et.al., [2303.15894v1](http://arxiv.org/abs/2303.15894v1)\n\n We take advantage of the unprecedented dynamical range provided by the \"Cosmic-Zoom\" project to study the mass accretion history (MAH) of present-day dark matter haloes over the entire mass range present in the $\\Lambda$CDM paradigm when the dark matter is made of weakly interacting massive particles of mass $100\\ \\mathrm{GeV}$. In particular, we complement previous studies by exploring the MAHs of haloes with mass from $10^8\\ h^{-1}\\mathrm{M\\_{\\odot}}$ down to Earth mass, $10^{-6}\\ h^{-1}\\mathrm{M\\_{\\odot}}$. The formation redshift of low-mass haloes anti-correlates weakly with mass, peaking at $z=3$ for haloes of mass $10^{-4}\\ h^{-1}\\mathrm{M\\_{\\odot}}$. Even lower masses are affected by the free-streaming cutoff in the primordial spectrum of density fluctuations and form at lower redshift. We compare MAHs in our simulations with predictions from two analytical models based on the extended Press-Schechter theory (EPS), and three empirical models derived by fitting and extrapolating either results from cosmological $N$-body simulations or Monte Carlo realizations of halo growth. All models fit our simulations reasonably well over the mass range for which they were calibrated. While the empirical models match better for more massive haloes, $M>10^{10}\\ h^{-1}\\mathrm{M\\_{\\odot}}$, the analytical models do better when extrapolated down to Earth mass. At the higher masses, we explore the correlation between local environment density and MAH, finding that biases are relatively weak, with typical MAHs for haloes in extremely low-density and in typical regions differing by less than $20$ percent at high redshift. We conclude that EPS theory predicts the hierarchical build-up of dark matter haloes quite well over the entire mass range.\n\n", "2303.15767": "2023-03-28, **Dark Matter in Fractional Gravity I: Astrophysical Tests on Galactic Scales**, Francesco Benetti et.al., [2303.15767v1](http://arxiv.org/abs/2303.15767v1)\n\n [abridged] We explore the possibility that the dark matter (DM) component in galaxies may originate fractional gravity. In such a framework, the standard law of inertia continues to hold, but the gravitational potential associated to a given DM density distribution is determined by a modified Poisson equation including fractional derivatives (i.e., derivatives of non-integer type), that are meant to describe non-local effects. We derive analytically the expression of the potential that in fractional gravity corresponds to various spherically symmetric density profiles, including the Navarro-Frenk-White (NFW) distribution that is usually exploited to describe virialized halos of collisionless DM as extracted from $N-$body cosmological simulations. We show that in fractional gravity the dynamics of a test particle moving in a cuspy NFW density distribution is substantially altered with respect to the Newtonian case (i.e., basing on the standard Poisson equation), mirroring what in Newtonian gravity would instead be sourced by a density profile with an inner core. We test the fractional gravity framework on galactic scales, showing that: (i) it can provide accurate fits to the stacked rotation curves of galaxies with different properties; (ii) it can reproduce to reasonable accuracy the observed shape and scatter of the radial acceleration relation (RAR); (iii) it can properly account for the universal surface density and the core radius vs. disk scale-length scaling relations. Finally, we discuss the possible origin of the fractional gravity behavior as a fundamental or emerging property of the elusive DM component.\n\n", "2303.15565": "2023-03-27, **Effective Field Theory of Intrinsic Alignments at One Loop Order: a Comparison to Dark Matter Simulations**, Thomas Bakx et.al., [2303.15565v1](http://arxiv.org/abs/2303.15565v1)\n\n We test the regime of validity of the effective field theory (EFT) of intrinsic alignments (IA) at the one-loop level by comparing with 3D halo shape statistics in N-body simulations. This model is based on the effective field theory of large-scale structure (EFT of LSS) and thus a theoretically well-motivated extension of the familiar non-linear alignment (NLA) model and the tidal-alignment-tidal-torquing (TATT) model. It contains a total of $8$ free bias parameters. Specifically, we measure the dark matter halo shape-shape multipoles $P\\_{EE}^{(0)}(k), P\\_{EE}^{(2)}(k), P\\_{BB}^{(0)}(k), P\\_{BB}^{(2)}(k)$ as well as the matter-shape multipoles $P\\_{\\delta E}^{(0)}(k), P\\_{\\delta E}^{(2)}(k)$ from the simulations and perform a joint fit to determine the largest wavenumber $k\\_{\\text{max}}$ up to which the theory predictions from the EFT of IA are consistent with the measurements. We find that the EFT of IA is able to describe intrinsic alignments of dark matter halos up to $k\\_\\text{max}=0.30\\,h/\\text{Mpc}$ at $z=0$. This demonstrates a clear improvement over other existing alignment models like NLA and TATT, which are only accurate up to $k\\_\\text{max}=0.05\\,h/\\text{Mpc}$ . We examine the posterior distributions of the higher-order bias parameters, and show that their inclusion is necessary to describe intrinsic alignments in the quasi-linear regime. Further, the EFT of IA is able to accurately describe the auto-spectrum of intrinsic alignment B-modes, in contrast to the other alignment models considered.\n\n", "2303.15510": "2023-03-27, **GEO-FPT: a model of the galaxy bispectrum at mildly non-linear scales**, Sergi Novell-Masot et.al., [2303.15510v1](http://arxiv.org/abs/2303.15510v1)\n\n We present GEO-FPT (Geometric Fitted Perturbation Theory), a new model for the galaxy bispectrum anisotropic signal in redshift space, with functional form rooted in perturbation theory. It also models the dependence of the bispectrum with the geometric properties of the triangles in Fourier space, and has a broader regime of validity than state-of-the-art theoretical models based on perturbation theory. We calibrate the free parameters of this model using high-resolution dark matter simulations and perform stringent tests to show that GEO-FPT describes the galaxy bispectrum accurately up to scales of $k\\simeq0.12 h{\\rm Mpc}^{-1}$ for different cosmological models, as well as for biased tracers of the dark matter field, considering a survey volume of $100$ (Gpc $h^{-1})^3$. In particular, a joint analysis of the power spectrum and bispectrum anisotropic signals, taking into account their full covariance matrix, reveals that the relevant physical quantities -- the BAO peak position (along and across the line-of-sight), and the growth of structure parameters times the amplitude of dark matter fluctuations, $f\\sigma\\_8$-- are recovered in an unbiased way, with an accuracy better than $0.4\\%$ and $2\\%$ respectively (which is our $2\\sigma$ statistical limit of the systematic error estimate). In addition, the bispectrum signal breaks the $f\\sigma\\_8$ degeneracy without detectable bias: $f$ and $\\sigma\\_8$ are recovered with better than $2.7\\%$ and $3.8\\%$ accuracy respectively (which is our $2\\sigma$ statistical limit of the systematic error estimate).   GEO-FPT boosts the applicability of the bispectrum signal of galaxy surveys beyond the current limitation of $k\\lesssim 0.08\\,h$ Mpc$^{-1}$ % and makes the bispectrum a key statistic to unlock the information content from the mildly non-linear regime in the on-going and forthcoming galaxy redshift surveys.\n\n", "2303.15509": "2023-03-27, **Direct searches for general dark matter-electron interactions with graphene detectors: Part II. Sensitivity studies**, Riccardo Catena et.al., [2303.15509v1](http://arxiv.org/abs/2303.15509v1)\n\n We use a formalism that describes electron ejections from graphene-like targets by dark matter (DM) scattering for general forms of scalar and spin 1/2 DM-electron interactions in combination with state-of-the-art density functional calculations to produce predictions and reach estimates for various possible carbon-based detector designs. Our results indicate the importance of a proper description of the target electronic structure. In addition, we find a strong dependence of the predicted observed signal for different DM candidate masses and interaction types on the detailed geometry and design of the detector. Combined with directional background vetoing, these dependencies will enable the identification of DM particle properties once a signal has been established.\n\n", "2303.15497": "2023-03-27, **Direct searches for general dark matter-electron interactions with graphene detectors: Part I. Electronic structure calculations**, Riccardo Catena et.al., [2303.15497v1](http://arxiv.org/abs/2303.15497v1)\n\n We develop a formalism to describe electron ejections from graphene-like targets by dark matter (DM) scattering for general forms of scalar and spin 1/2 DM-electron interactions and compare their applicability and accuracy within the density functional theory (DFT) and tight binding (TB) approaches. This formalism allows for accurate prediction of the daily modulation signal expected from DM in upcoming direct detection experiments employing graphene sheets as the target material. A key result is that the physics of the graphene sheet and that of the DM and the ejected electron factorise, allowing for the rate of ejections from all forms of DM to be obtained with a single graphene response function. We perform a comparison between the TB and DFT approaches to modeling the initial state electronic wavefunction within this framework, with DFT emerging as the more self-consistent and reliable choice due to the challenges in the embedding of an appropriate atomic contribution into the TB approach.\n\n", "2303.15315": "2023-03-27, **Observation of a low energy nuclear recoil peak in the neutron calibration data of the CRESST-III Experiment**, CRESST Collaboration et.al., [2303.15315v1](http://arxiv.org/abs/2303.15315v1)\n\n New-generation direct searches for low mass dark matter feature detection thresholds at energies well below 100 eV, much lower than the energies of commonly used X-ray calibration sources. This requires new calibration sources with sub-keV energies. When searching for nuclear recoil signals, the calibration source should ideally cause mono-energetic nuclear recoils in the relevant energy range. Recently, a new calibration method based on the radiative neutron capture on $^{182}$W with subsequent de-excitation via single $\\gamma$-emission leading to a nuclear recoil peak at 112 eV was proposed. The CRESST-III dark matter search operated several CaWO$\\_{4}$-based detector modules with detection thresholds below 100 eV in the past years. We report the observation of a peak around the expected energy of 112 eV in the data of three different detector modules recorded while irradiated with neutrons from different AmBe calibration sources. We compare the properties of the observed peaks with Geant-4 simulations and assess the prospects of using this for the energy calibration of CRESST-III detectors.\n\n", "2303.15267": "2023-03-27, **Revisiting progenitor-age dependence of type Ia supernova luminosity standardization process**, Junchao Wang et.al., [2303.15267v1](http://arxiv.org/abs/2303.15267v1)\n\n Much of the research in supernova cosmology is based on an assumption that the peak luminosity of type Ia supernovae (SNe Ia), after a standardization process, is independent of the galactic environment. A series of recent studies suggested that there is a significant correlation between the standardized luminosity and the progenitor age of SNe Ia. The correlation found in the most recent work by Lee et al. is strong enough to explain the extra dimming of distant SNe Ia, and therefore casts doubts on the direct evidence of cosmic acceleration. The present work improves the previous work by incorporating the uncertainties of progenitor ages, which were ignored in Lee et al., into a fully Bayesian inference framework. We find a weaker dependence of supernova standardized luminosity on the progenitor age, but the detection of correlation remains significant (3.3$\\sigma$). Assuming that such correlation can be extended to high redshift and applying it to the Pantheon SN Ia data set, we find that the correlation cannot be the primary cause of the observed extra dimming of distant SNe Ia. Further more, we use the PAge formalism, which is a good approximation to many dark energy and modified gravity models, to do a model comparison. The concordance Lambda cold dark matter model remains a good fit when the progenitor-age dependence of SN Ia luminosity is corrected. The best-fit parameters, however, are in $\\sim 2\\sigma$ tension with the standard values inferred from cosmic microwave background observations.\n\n", "2303.15169": "2023-03-27, **Inflation and Dark Matter in the $Z_5$ Model**, XinXin Qi et.al., [2303.15169v1](http://arxiv.org/abs/2303.15169v1)\n\n We discuss the possibility of unifying dark matter physics and inflation in the $Z\\_5$ model of the two-component dark matter. Inflation driven by the two-component dark matter fields can be divided into two cases, singlet dark matter inflation and mixed dark matter inflation, where both two-component play the role of inflaton in the latter case. For dark matter, we focus on the mixed dark matter inflation case. We show a viable parameter space that satisfies the theoretical and dark matter relic density constraint in the case of successful inflation. It turns out that the dark matter density is dominated by the light component, which is consistent with the feature of the $Z\\_5$ model of the two-component dark matter.\n\n"}, "supernova": {"2303.15695": "2023-03-28, **Insights on the Sun birth environment in the context of star-cluster formation in hub-filament systems**, Doris Arzoumanian et.al., [2303.15695v1](http://arxiv.org/abs/2303.15695v1)\n\n Cylindrical molecular filaments are observed to be the main sites of Sun-like star formation, while massive stars form in dense hubs, at the junction of multiple filaments. The role of hub-filament configurations has not been discussed yet in relation to the birth environment of the solar system and to infer the origin of isotopic ratios of Short-Lived Radionuclides (SLR, such as $^{26}$Al) of Calcium-Aluminum-rich Inclusions (CAIs) observed in meteorites. In this work, we present simple analytical estimates of the impact of stellar feedback on the young solar system forming along a filament of a hub-filament system. We find that the host filament can shield the young solar system from the stellar feedback, both during the formation and evolution of stars (stellar outflow, wind, and radiation) and at the end of their life (supernovae). We show that the young solar system formed along a dense filament can be enriched with supernova ejecta (e.g., $^{26}$Al) during the formation timescale of CAIs. We also propose that the streamers recently observed around protostars may be channeling the SLR-rich material onto the young solar system. We conclude that considering hub-filament configurations as the birth environment of the Sun is important when deriving theoretical models explaining the observed properties of the solar system.\n\n", "2303.15664": "2023-03-28, **Synthetic Population of Binary Cepheids. II. The effect of companion light on the extragalactic distance scale**, Paulina Karczmarek et.al., [2303.15664v1](http://arxiv.org/abs/2303.15664v1)\n\n Because of their period-luminosity relation (PLR), classical Cepheids play a key role in the calibration of the extragalactic distance scale and the determination of the Hubble-Lema\\^{i}tre constant $H\\_0$. Recent findings show that the majority of classical Cepheids should be in binary or multiple systems, which might undermine their accuracy, as the extra -- and unaccounted for -- light from the companions of Cepheids causes a shift in the PLR. We quantify this shift using synthetic populations of binary Cepheids that we developed for this purpose, as described in Paper I of this series. We find that while all PLRs are shifted toward brighter values due to the excess light from the companions, the bias in the relative distance modulus between two galaxies hosting binary Cepheids can be either positive or negative, depending on the percentage of binary Cepheids in them. If the binarity percentage in the two galaxies is similar, the effect of binarity is canceled. Otherwise, it introduces a shift in the distance modulus of the order of millimags in the near-infrared passbands and Wesenheit indices, and tens of millimags in the visual domain; its exact value depends on the variant of the synthetic population (a unique combination of metallicity, star formation history, shape and location of the instability strip, and initial parameter distributions). Such shifts in distance moduli to type Ia supernova host galaxies introduce an additional statistical error on $H\\_0$, which however does not prevent measuring $H\\_0$ with a precision of 1%.\n\n", "2303.15439": "2023-03-27, **Identifying gravitationally lensed supernovae within the Zwicky Transient Facility public survey**, M. R. Magee et.al., [2303.15439v1](http://arxiv.org/abs/2303.15439v1)\n\n Strong gravitational lensing of supernovae is exceedingly rare. To date, only a handful of lensed supernovae are known. Despite their rarity, lensed supernovae have emerged as one of the most promising methods for measuring the current expansion rate of the Universe and breaking the Hubble tension. We present an extensive search for gravitationally lensed supernovae within the Zwicky Transient Facility (ZTF) public survey, covering 12,524 transients with good light curves discovered during four years of observations. We crossmatch a catalogue of known and candidate lens galaxies with our transient sample and find only one coincident source, which was due to chance alignment. To search for supernovae magnified by unknown lens galaxies, we test multiple methods that have been suggested in the literature, for the first time on real data. This includes selecting objects with extremely red colours and those that appear inconsistent with the host galaxy redshift. In both cases, we find a few hundred candidates, most of which are due to contamination from activate galactic nuclei, bogus detections, or unlensed supernovae. The false positive rate from these methods presents significant challenges for future surveys. In total, 65 unique transients were identified across all of our selection methods that required detailed manual rejection, which would be infeasible for larger samples. Overall, we do not find any compelling candidates for lensed supernovae, which is broadly consistent with previous estimates for the rate of lensed supernovae in the ZTF public survey and the number expected to pass the selection cuts we apply.\n\n", "2303.15267": "2023-03-27, **Revisiting progenitor-age dependence of type Ia supernova luminosity standardization process**, Junchao Wang et.al., [2303.15267v1](http://arxiv.org/abs/2303.15267v1)\n\n Much of the research in supernova cosmology is based on an assumption that the peak luminosity of type Ia supernovae (SNe Ia), after a standardization process, is independent of the galactic environment. A series of recent studies suggested that there is a significant correlation between the standardized luminosity and the progenitor age of SNe Ia. The correlation found in the most recent work by Lee et al. is strong enough to explain the extra dimming of distant SNe Ia, and therefore casts doubts on the direct evidence of cosmic acceleration. The present work improves the previous work by incorporating the uncertainties of progenitor ages, which were ignored in Lee et al., into a fully Bayesian inference framework. We find a weaker dependence of supernova standardized luminosity on the progenitor age, but the detection of correlation remains significant (3.3$\\sigma$). Assuming that such correlation can be extended to high redshift and applying it to the Pantheon SN Ia data set, we find that the correlation cannot be the primary cause of the observed extra dimming of distant SNe Ia. Further more, we use the PAge formalism, which is a good approximation to many dark energy and modified gravity models, to do a model comparison. The concordance Lambda cold dark matter model remains a good fit when the progenitor-age dependence of SN Ia luminosity is corrected. The best-fit parameters, however, are in $\\sim 2\\sigma$ tension with the standard values inferred from cosmic microwave background observations.\n\n", "2303.15066": "2023-03-27, **Low-redshift estimates of the absolute scale of baryon acoustic oscillations**, Thais Lemos et.al., [2303.15066v1](http://arxiv.org/abs/2303.15066v1)\n\n Measurements of the characteristic length scale $r\\_s$ of the baryon acoustic oscillations (BAO) provide a robust determination of the distance-redshift relation. Currently, the best (sub-per cent) estimate of $r\\_s$ at the drag epoch is provided by Cosmic Microwave Background (CMB) observations assuming the validity of the standard $\\Lambda$CDM model at $z \\sim 1000$. Therefore, inferring $r\\_s$ from low-$z$ observations in a model-independent way and comparing its value with CMB estimates provides a consistency test of the standard cosmology and its assumptions at high-$z$. In this paper, we address this question and estimate the absolute BAO scale combining angular BAO measurements and type Ia Supernovae data. Our analysis uses two different methods to connect these data sets and finds a good agreement between the low-$z$ estimates of $r\\_{s}$ with the CMB sound horizon at drag epoch, regardless of the value of the Hubble constant $H\\_0$ considered. These results highlight the robustness of the standard cosmology at the same time that they also reinforce the need for more precise cosmological observations at low-$z$.\n\n", "2303.15040": "2023-03-27, **Strengthening extended Gravity constraints with combined systems:\\\\ \\texorpdfstring{$f(R)$}{} bounds from Cosmology and the Galactic Center**, D. Benisty et.al., [2303.15040v1](http://arxiv.org/abs/2303.15040v1)\n\n MOdified Gravity (MoG)) is widely constrained in different astrophysical and astronomical systems. Since these different systems are based on different scales it is not trivial to get a combined constraint that is based on different phenomenology. Here, for the first time (to the best of our knowledge), we combine constraints for MoG from late time Cosmology and the orbital motion of the stars around the galactic center. MoG give different potentials that are tested directly in the galactic center. The cosmological data set includes the type Ia supernova and baryon acoustic oscillations. For the galactic star center data set we use the published orbital measurements of the S2 star. The constraints on the universal parameter $\\beta$ from the combined system give: $\\beta\\_{HS}=0.154 \\pm 0.109$ for the Hu-Sawicki model, while $\\beta\\_{St}= 0.309 \\pm 0.19 $ for the Starobinsky model. These results improve on the cosmological results we obtain. The results show that {{\\it combined constraint}} from different systems yields a stronger constraint for different theories under consideration. Future measurements from the galactic center and from cosmology will give better constraints on MoG.\n\n", "2303.15007": "2023-03-27, **Sensitivity of the Cherenkov Telescope Array to spectral signatures of hadronic PeVatrons with application to Galactic Supernova Remnants**, The Cherenkov Telescope Array Consortium et.al., [2303.15007v1](http://arxiv.org/abs/2303.15007v1)\n\n The local Cosmic Ray (CR) energy spectrum exhibits a spectral softening at energies around 3~PeV. Sources which are capable of accelerating hadrons to such energies are called hadronic PeVatrons. However, hadronic PeVatrons have not yet been firmly identified within the Galaxy. Several source classes, including Galactic Supernova Remnants (SNRs), have been proposed as PeVatron candidates. The potential to search for hadronic PeVatrons with the Cherenkov Telescope Array (CTA) is assessed. The focus is on the usage of very high energy $\\gamma$-ray spectral signatures for the identification of PeVatrons. Assuming that SNRs can accelerate CRs up to knee energies, the number of Galactic SNRs which can be identified as PeVatrons with CTA is estimated within a model for the evolution of SNRs. Additionally, the potential of a follow-up observation strategy under moonlight conditions for PeVatron searches is investigated. Statistical methods for the identification of PeVatrons are introduced, and realistic Monte--Carlo simulations of the response of the CTA observatory to the emission spectra from hadronic PeVatrons are performed. Based on simulations of a simplified model for the evolution for SNRs, the detection of a $\\gamma$-ray signal from in average 9 Galactic PeVatron SNRs is expected to result from the scan of the Galactic plane with CTA after 10 hours of exposure. CTA is also shown to have excellent potential to confirm these sources as PeVatrons in deep observations with $\\mathcal{O}(100)$ hours of exposure per source.\n\n"}}