{"neutrino": {"2508.15747": "2025-08-21, **Robustness of Solutions of the Quantum Kinetic Equations in the Presence of Matter Density Fluctuations**, Shashank Shalgar et.al., [2508.15747v1](http://arxiv.org/abs/2508.15747v1)\n\n We investigate the role of fluctuations in the matter density on neutrino flavor evolution by studying their effects on the collision terms in the spherically symmetric quantum kinetics equations (QKEs). We solve the QKEs with varying radial resolution ($r\\_{\\mathrm{bins}} = 150 \\, , 1500 \\, , 15000$) to assess numerical convergence in angular distributions, number densities, and energy spectra for four neutrino flavors ($\\nu\\_e$, $\\bar{\\nu}\\_e$, $\\nu\\_x$, $\\bar{\\nu}\\_x$). Our results demonstrate that the solutions are numerically converged already at the coarsest resolution, with higher resolutions yielding almost identical outcomes. We introduce random perturbations to each radial bin, thus adding perturbations with a length scale that is related to the radial resolution. We study both time-independent and time-dependent perturbations to the matter density that affect the collision term and analyze their effects on neutrino flavor evolution. We find that such fluctuations do not induce any significant instabilities or qualitative changes in flavor evolution. Angular structure remains robust, and flavor-dependent number densities and energy spectra show only minor deviations compared to the unperturbed case. These findings suggest that matter perturbations have a negligible effect on neutrino flavor evolution in spherically symmetric settings.\n\n", "2508.15662": "2025-08-21, **New rephasing invariants and CP violation built from the trios of the CKM or PMNS matrix elements**, Shu Luo et.al., [2508.15662v1](http://arxiv.org/abs/2508.15662v1)\n\n Given the $3\\times 3$ Cabibbo-Kobayashi-Maskawa (CKM) quark flavor mixing matrix $V$, we define a new set of rephasing invariants in terms of the \"trios\" of its nine elements: $\\lozenge^{ijk}\\_{\\alpha\\beta\\gamma} \\equiv (V^{}\\_{\\alpha i} V^{}\\_{\\beta j} V^{}\\_{\\gamma k})/\\det V$ with $\\alpha \\neq \\beta \\neq \\gamma$ and $i \\neq j \\neq k$ running respectively over $(u, c, t)$ and $(d, s, b)$. We find that ${\\rm Im} \\lozenge^{ijk}\\_{\\alpha\\beta\\gamma} = - {\\cal J}$ holds, where ${\\cal J}$ is the well-known Jarlskog invariant of weak CP violation. Analogous rephasing invariants $\\blacklozenge^{ijk}\\_{\\alpha\\beta\\gamma} \\equiv (U^{}\\_{\\alpha I} U^{}\\_{\\beta j} U^{}\\_{\\gamma k})/\\det U$ can be defined for the $3\\times 3$ Pontecorvo-Maki-Nakagawa-Sakata (PMNS) lepton flavor mixing matrix $U$, where $\\alpha \\neq \\beta \\neq \\gamma$ and $i \\neq j \\neq k$ run respectively over $(e, \\mu, \\tau)$ and $(1, 2, 3)$. Taking into account small non-unitarity of $U$ based on the canonical seesaw mechanism for neutrino mass generation, we calculate ${\\rm Im} \\blacklozenge^{ijk}\\_{\\alpha\\beta\\gamma}$ with the help of a full Euler-like block parametrization of the seesaw flavor structure and demonstrate that their leading terms converge to a universal invariant ${\\cal J}^{}\\_\\nu$ in the unitarity limit of $U$.\n\n", "2508.15609": "2025-08-21, **Sub-GeV Sterile Neutrino as a Probe of Neutrino Mass Generation in the Minimal Left-Right Symmetric Model**, Gang Li et.al., [2508.15609v1](http://arxiv.org/abs/2508.15609v1)\n\n The minimal left-right symmetric model (mLRSM) provides an elegant and testable framework for addressing the origin of neutrino masses. We examine the constraints on the sub-GeV sterile neutrino in the type-II seesaw scenario of the mLRSM without left-right mixing, taking limits from collider searches, meson decays, supernovae, neutrinoless double beta ($0\\nu\\beta\\beta$) decay and cosmology. Specifically, we derive the $0\\nu\\beta\\beta$ decay constraints using the advanced effective field theory approach and up-to-date nuclear matrix element calculations. Besides, we update the SN1987A cooling bound with the state-of-the-art simulations, provide new constraints from the energy deposition in the supernova ejecta, and incorporate the stringent sterile neutrino lifetime upper limit $\\tau\\lesssim 0.023$ s from the big bang nucleosynthesis. Our results identify the parameter region compatible with all current experimental and observational constraints, where the sterile neutrino mass lies between 700 MeV and 1 GeV and the right-handed $W$ boson mass is slightly below 20 TeV. This region is exclusively probed by the future tonne-scale $0\\nu\\beta\\beta$ decay experiments, providing a unique window to test the mLRSM and the possible origin of neutrino masses.\n\n", "2508.15332": "2025-08-21, **On the Lagrangian and fermion mass of the unified $SU(2) \\otimes SU(4)$ gauge field theory**, Eckart Marsch et.al., [2508.15332v1](http://arxiv.org/abs/2508.15332v1)\n\n {In the Standard Model of elementary particles the fermions are assumed to be intrinsically massless. Here we propose a new theoretical idea of fermion mass generation (other than by the Higgs mechanism) through the coupling with the vector gauge fields of the unified $SU(2) \\otimes SU(4)$ gauge symmetry, especially with the $Z$ boson of the weak interaction that affects all elementary fermions. The resulting small masses are suggested to be proportional to the self-energy of the $Z$ field as described by a Yukawa potential. Thereby the electrically neutral neutrino just gets a tiny mass through its $Z$-field coupling. In contrast, the electrically charged electron and quarks can become more massive by the inertia induced through the Coulomb energy of the electrostatic fields surrounding them in their rest frames.\n\n", "2508.15289": "2025-08-21, **Cosmology with an emergent Standard Model**, Steven D. Bass et.al., [2508.15289v1](http://arxiv.org/abs/2508.15289v1)\n\n We discuss new ideas that the Standard Model might be emergent with connection to electroweak vacuum stability and related consequences for cosmology. In this scenario, the gauge symmetries and particles of the Standard Model would be ``born'' in some phase transition at a large scale about $10^{16}$ GeV with the Standard Model parameters constrained by the requirement of vacuum stability.Emergent gauge symmetries are well known in condensed matter physics. Perhaps the Standard Model might also be emergent. In this case the particles would be the stable long range excitations of degrees of freedom that operate above the scale of emergence. The dark energy scale comes out with similar size to the tiny masses of light Majorana neutrinos. The emergence scenario comes with interesting constraints on possible dark matter structure. New physics at energy scales around $10^{16}$ GeV might be explored through its effects in the neutrino mass matrix plus using high frequency gravitational waves and polarisation observables in the cosmic microwave background.\n\n", "2508.15161": "2025-08-21, **Verification of Cas A neutron star cooling rate using Chandra HRC-S observations**, Jiaqi Zhao et.al., [2508.15161v1](http://arxiv.org/abs/2508.15161v1)\n\n The young neutron star (NS) in the Cassiopeia A (Cas A) supernova remnant is a fascinating test for theories of NS cooling. Chandra observations have indicated that its surface temperature is declining rapidly, about 2% per decade, using 20 years of data, if a uniform carbon atmosphere is assumed for the NS. This rapid decline may be caused by the neutrons in the NS core transitioning from a normal to a superfluid state. However, most of the Cas A NS observations were performed by the Chandra ACIS detectors, which suffer complicated systematic effects. Here, we test the cooling of the Cas A NS with Chandra HRC data over 25 years. The Chandra HRC detector has independent systematics, serving as a cross-check. Assuming a fixed hydrogen column density ($N\\_{\\rm H}$), we infer the cooling rate of the Cas A NS to be 0.57$^{+0.26}\\_{-0.27}$% per decade. Allowing the $N\\_{\\rm H}$ to vary with time (as estimated using ACIS data), the cooling rate is 1.11$^{+0.25}\\_{-0.28}$% per decade. These cooling rates are smaller than measured using ACIS data, implying systematic uncertainties have not been eradicated from either or both datasets. However, we have verified the decline in the absorbed flux from the Cas A NS using an independent instrument, at $>3\\sigma$ level (4.7%$\\pm$1.5% over 10 years). Additionally, the weaker cooling rate of Cas A NS inferred from HRC datasets eliminates the tension with the theoretically predicted cooling, and can be explained by the reduced efficiency of the neutrino emission accompanying the Cooper pair breaking and formation process in neutron triplet-state superfluid.\n\n"}, "dark matter": {"2508.15490": "2025-08-21, **Measurement of circumgalactic extinction in the Kilo-Degree Survey's Data Release 4**, Eray Genc et.al., [2508.15490v1](http://arxiv.org/abs/2508.15490v1)\n\n Galaxies reside in extended dark matter halos, but their baryonic content, especially dust, remains less well understood. We aim to investigate the amount and distribution of dust in galactic halos by measuring shifts in the observed magnitudes of background galaxies. Dust absorbs and scatters shorter-wavelength light, reddening background sources. We quantify this effect using multi-band magnitude shifts in the Kilo-Degree Survey (KiDS) Data Release 4, distinguishing it from achromatic magnification. Our pipeline is validated using MICE2 mock catalogues, and we explore potential systematics arising from galaxy selection, in contrast to previous quasar-based studies. Simulations show that input halo and dust masses can be recovered independently and jointly using galaxy-galaxy lensing (GGL) and magnitude shifts. A minimum redshift separation of $\\Delta z\\_{\\mathrm B}\\sim0.3$ and brightness cuts are required to minimise overlap effects and the effects of photometric noise, respectively. Applying our pipeline to KiDS data, we first confirm the achromaticity of magnitude shifts in five near-infrared filters ($ZYJHK\\_{\\rm s}$). In optical bands ($ugri$), joint analysis constrains halo mass and dust mass to $0.2$ dex and $0.3$ dex, respectively, yielding $M\\_{\\rm dust}=7.24^{+0.52}\\_{-0.64} \\times 10^7\\,M\\_\\odot$ and $\\log(M\\_{\\rm halo}^{\\rm DM}/M\\_\\odot)=12.33^{+0.08}\\_{-0.04}$. These results agree with previous studies and represent the first successful measurement of magnitude shifts and halo extinction with KiDS, confirming that galaxies reside in extended baryonic halos enriched by gas and dust from feedback processes.\n\n"}, "supernova": {}}