{"neutrino": {"2507.07936": "2025-07-10, **Monophotons from Scalar Portal Dark Matter at Neutrino Experiments**, Bhaskar Dutta et.al., [2507.07936v1](http://arxiv.org/abs/2507.07936v1)\n\n In this work, we investigate monophoton signatures arising from dark matter via a $2\\to 3$ scattering process $\\chi + N \\to \\chi + N + \\gamma$ that is mediated by a virtual scalar and a Standard Model photon. Since the final-state photon carries a large fraction of the initial dark matter's energy, this process offers a compelling handle for probing scalar portal dark matter scenarios. Their distinctive energy, angular, and timing distributions allow for effective separation of signal from neutrino-induced backgrounds. We analyze several models featuring different couplings to the scalar mediator, with the scalar photon coupling serving as the common detection channel. We considered the flux of dark matter produced both at the target and absorber of neutrino facilities such as the BNB, NuMI, and LBNF, and investigated the sensitivities at the ongoing SBND, ICARUS-NuMI, and future DUNE ND detectors. Our results demonstrate that the sensitivities at the considered experiments, especially DUNE ND, can place significantly improved constraints on viable parameter space in various scenarios.\n\n", "2507.07844": "2025-07-10, **Machine Learning Tools for the IceCube-Gen2 Optical Array**, Francisco Javier Vara Carbonell et.al., [2507.07844v1](http://arxiv.org/abs/2507.07844v1)\n\n Neural networks (NNs) have a great potential for future neutrino telescopes such as IceCube-Gen2, the planned high-energy extension of the IceCube observatory. IceCube-Gen2 will feature new optical sensors with multiple photomultiplier tubes (PMTs) designed to provide omnidirectional sensitivity. Neural networks excel at handling high-dimensional problems and can naturally incorporate the increased complexity of these new sensors. Additionally, their fast inference time makes them promising candidates for handling the high event rates expected from IceCube-Gen2.   This contribution presents potential applications of neural networks in the IceCube-Gen2 in-ice optical array. First, we introduce a method to simulate the IceCube-Gen2 optical modules' photon acceptance using a NN that leverages the modules' inherent symmetries. Secondly, we present the status of neutrino NN-based reconstruction efforts, including the adaptation of a novel IceCube technique that combines normalizing flows with transformer NNs. Finally, we describe current progress in noise cleaning applications based on node classification with graph neural networks (GNNs), a method that has already shown promising results for the forthcoming low-energy extension, IceCube-Upgrade.\n\n", "2507.07813": "2025-07-10, **Probing ultra-high-energy neutrinos with the IceCube-Gen2 in-ice radio array**, Christian Glaser et.al., [2507.07813v1](http://arxiv.org/abs/2507.07813v1)\n\n The next generation neutrino telescope, IceCube-Gen2, will be sensitive to the astrophysical and cosmogenic flux of neutrinos across a broad energy range, from the TeV to the EeV scale. The planned design includes 8 cubic kilometers of ice instrumented with approximately 10,000 optical sensors, a surface array, and a radio array of antennas embedded in the ice laid out sparsely over 500 km^2. The radio array provides sensitivity to ultra-high energy neutrinos using independent radio stations that can trigger on Askaryan emission from neutrino interactions in the ice. In this contribution, we present the design for the radio array along with its planned implementation, which is expected to increase sensitivity to neutrinos with energies beyond 100PeV by at least an order of magnitude over existing arrays. Furthermore, we will quantify the expected science output by presenting measurement forecasts for the main science cases of diffuse flux and point source discovery, as well as cross-section and flavor measurements.\n\n", "2507.07598": "2025-07-10, **The sensitivity of liquid scintillator detectors to CP-violation with atmospheric neutrinos**, Thilo Birkenfeld et.al., [2507.07598v1](http://arxiv.org/abs/2507.07598v1)\n\n The detection of CP violation in neutrino oscillations is one of the most important goals of the next generation of neutrino experiments. Here we study the detectability of the CP-violating phase in the oscillation of atmospheric neutrinos. Liquid scintillator detectors of a few kilotons can probe the low-energy range of the atmospheric neutrino flux. We calculate the expected rate, spectrum, and zenith angle distribution for a typical liquid scintillator detector for different detector sites. We include a typical detector response with different capabilities for flavour identification and a background model. The sensitivity is estimated using a Poisson likelihood analysis. In the case of maximal CP violation, the sensitivity can reach $4\\,\\sigma$ ($90\\%~c.l.$) for perfect flavour identification.\n\n", "2507.07573": "2025-07-10, **The Impact of Natal Kicks on Black Hole Binaries**, Alejandro Vigna-Gómez et.al., [2507.07573v1](http://arxiv.org/abs/2507.07573v1)\n\n In massive binary-star systems, supernova explosions can significantly alter the orbit during the formation of compact objects. Some compact objects are predicted to form via direct collapse, a scenario with negligible mass loss and no baryonic ejecta emitted. In this scenario, most of the energy is released via neutrinos, and any resulting natal kick arises from asymmetries in their emission. Here I investigate stellar collapse leading to binary black hole (BH) formation, with a focus on how the natal kick influences the gravitational-wave-driven merger time. Broadly, I find three regimes. For low natal kicks, the effect on the time-to-coalescence is negligible. For moderate natal kicks, if the binary remains bound, up to 50% of binary BHs experience a decrease in their time-to-coalescence by more than an order of magnitude. For large natal kicks, although most binaries become unbound, those that remain bound may acquire retrograde orbits and/or lead to shorter time-to-coalescence. For binary BH mergers, large natal kicks ($\\gtrsim100$ km/s) are hard to reconcile with both neutrino natal kicks and the complete collapse scenario. This suggests that retrograde orbits and shortened merger times could only arise in volatile BH formation scenarios or if spin-axis tossing is at work. Consequently, electromagnetic observations of BHs in massive star binaries within the Local Group offer a more effective means to probe the physics behind complete collapse. Another promising population for deciphering the complete collapse scenario is that of massive, wide binaries. Although Gaia may help shed light on these systems, longer observational baselines will likely be needed to fully understand the roles of neutrino natal kicks and stellar collapse in BH formation.\n\n", "2507.07563": "2025-07-10, **Inhomogeneous stellar mixing in the final hours before the Cassiopeia A supernova**, Toshiki Sato et.al., [2507.07563v1](http://arxiv.org/abs/2507.07563v1)\n\n Understanding stars and their evolution is a key goal of astronomical research and has long been a focus of human interest. In recent years, theorists have paid much attention to the final interior processes within massive stars, as they can be essential for revealing neutrino-driven supernova mechanisms and other potential transients of massive star collapse. However, it is challenging to observe directly the last hours of a massive star before explosion, since it is the supernova event that triggers the start of intense observational study. Here we report evidence for a final phase of stellar activity known as a ``shell merger'', an intense shell burning in which the O-burning shell swallows its outer C-/Ne-burning shell, deep within the progenitor's interior moments before the supernova explosion. In the violent convective layer created by the shell merger, Ne, which is abundant in the stellar O-rich layer, is burned as it is pulled inward, and Si, which is synthesized inside, is transported outward. The remnant still preserves some traces of such Ne-rich downflows and Si-rich upflows in the O-rich layer, suggesting that inhomogeneous shell-merger mixing began just hours ($\\lesssim 10^4$ s) before its gravitational collapse. Our results provide the first observational evidence that the final stellar burning process rapidly alters the internal structure, leaving a pre-supernova asymmetry. This breaking of spherical symmetry facilitates the explosion of massive stars and influences various supernova and remnant characteristics, including explosion asymmetries and the neutron star's kick and spin.\n\n", "2507.07541": "2025-07-10, **Reconstruction of cosmic-ray properties with GNN in GRAND**, Arsène Ferrière et.al., [2507.07541v1](http://arxiv.org/abs/2507.07541v1)\n\n The Giant Radio Array for Neutrino Detection (GRAND) aims to detect and study ultra-high-energy (UHE) neutrinos by observing the radio emissions produced in extensive air showers. The GRANDProto300 prototype primarily focuses on UHE cosmic rays to demonstrate the autonomous detection and reconstruction techniques that will later be applied to neutrino detection. In this work, we propose a method for reconstructing the arrival direction and energy with high precision using state-of-the-art machine learning techniques from noisy simulated voltage traces. For each event, we represent the triggered antennas as a graph structure, which is used as input for a graph neural network (GNN). To significantly enhance precision and reduce the required training set size, we incorporate physical knowledge into both the GNN architecture and the input data. This approach achieves an angular resolution of 0.14{\\deg} and a primary energy reconstruction resolution of about 15%. Additionally, we employ uncertainty estimation methods to improve the reliability of our predictions. These methods allow us to quantify the confidence of the GNN predictions and provide confidence intervals for the direction and energy reconstruction. Finally, we explore strategies to evaluate the consistency and robustness of the model when applied to real data. Our goal is to identify situations where predictions remain trustworthy despite domain shifts between simulation and reality.\n\n", "2507.07497": "2025-07-10, **A search for extremely-high-energy neutrinos with IceCube and implications for the ultra-high-energy cosmic-ray proton fraction**, Maximilian Meier et.al., [2507.07497v1](http://arxiv.org/abs/2507.07497v1)\n\n When ultra-high-energy cosmic rays (UHECRs) interact with ambient photon backgrounds, a flux of extremely-high-energy (EHE), so-called cosmogenic, neutrinos is produced. The observation of these neutrinos with IceCube can probe the nature of UHECRs. We present a search for EHE neutrinos using $12.6 \\, \\mathrm{years}$ of IceCube data. The non-observation of neutrinos with energies $\\gtrsim 10 \\, \\mathrm{PeV}$ constrains the all-flavor neutrino flux at $1 \\, \\mathrm{EeV}$ to be below $E^2 \\Phi\\_{\\nu\\_e + \\nu\\_\\mu + \\nu\\_\\tau} \\simeq 10^{-8} \\, \\mathrm{GeV} \\, \\mathrm{cm}^{-2} \\, \\mathrm{s}^{-1} \\, \\mathrm{sr}^{-1}$, the most stringent limit to date. This constrains the proton fraction in UHECRs of energy above $30 \\, \\mathrm{EeV}$ to be $\\lesssim 70\\%$ if the evolution of the UHECR sources is similar to the star formation rate. Our analysis circumvents uncertainties associated with hadronic interaction models in studies of UHECR air showers, which also suggest a heavy composition at such energies.\n\n", "2507.07491": "2025-07-10, **New Public Neutrino Alerts for Clusters of IceCube Events**, Sarah Mancina et.al., [2507.07491v1](http://arxiv.org/abs/2507.07491v1)\n\n The IceCube Neutrino Observatory searches for the origins of astrophysical neutrinos using various techniques to overcome the significant backgrounds produced by cosmic-ray air showers. One such technique involves combining the neutrino data with other cosmic messengers to identify spatial and temporal correlations. IceCube contributes to multi-messenger astrophysics (MMA) by providing alerts for interesting events observed in the detector. The Gamma-ray Follow-Up (GFU) cluster alert system is one stream that identifies potential neutrino flares in realtime, producing around 20 alerts per year. GFU-cluster alerts have been privately shared with Imaging Air Cherenkov Telescopes (IACTs) through memoranda of understanding since IceCube's predecessor, AMANDA. To preserve blindness to the full behavior of our data, the current system mutes updates from sources following the initial GFU-cluster alert sent, preventing further updates until the activity drops below the alert threshold. With growing knowledge of the potential environments that produce astrophysical neutrinos and to foster open collaboration, the GFU-cluster alerts will shift to be publicly shared. Additionally, the new alert platform will provide all above-threshold information such that the source behavior after the initial alert is not obscured. The above threshold data will be distributed through an interactive website that will update the community on the status of active GFU-cluster alerts. This presentation will introduce the new GFU-cluster platform and the accompanying website, soon to be accessible to the MMA community.\n\n", "2507.07476": "2025-07-10, **A comparative study of physics capabilities of a liquid argon and a water based liquid scintillator at DUNE**, Nishat Fiza et.al., [2507.07476v1](http://arxiv.org/abs/2507.07476v1)\n\n We present a comprehensive comparison of the physics sensitivities of a Liquid Argon Time Projection Chamber (LArTPC) and a Water-based Liquid Scintillator (WbLS) detector, considering their potential deployment as the fourth far detector module in the DUNE facility. Using GLoBES-based simulations, we evaluate their performance in measuring standard neutrino oscillation parameters ($\\theta\\_{23}, \\delta\\_{13}$ and $\\Delta m^{2}\\_{31}$), both in standard 3-neutrino case, as well as in presence of new physics scenarios involving light sterile neutrinos and neutral-current non-standard interactions (NC NSI). Our findings show that THEIA (a WbLS-based detector) significantly outperforms LArTPC in resolving the CP phase $\\delta\\_{13}$,- especially near maximal CP violation, and in lifting the octant degeneracy of $\\theta\\_{23}$ due to its superior energy resolution and ability to clearly identify the second oscillation maximum. Furthermore, THEIA offers competitive reconstruction precision even with relatively moderate energy resolutions ($7-10\\%/\\sqrt{E}$) and demonstrates enhanced robustness under new physics scenarios. These results support the physics-driven case for a hybrid DUNE configuration utilizing both LArTPC and WbLS technologies for optimized sensitivity across the full spectrum of neutrino oscillation and physics beyond the standard model.\n\n", "2507.07452": "2025-07-10, **Advanced Northern Tracks Selection using a Graph Convolutional Neural Network for the IceCube Neutrino Observatory**, Philipp Soldin et.al., [2507.07452v1](http://arxiv.org/abs/2507.07452v1)\n\n The IceCube Neutrino Observatory is a cubic-kilometer detector located in the Antarctic ice at the geographic South Pole. It reads out over 5,000 photomultiplier tubes (PMTs) to detect Cherenkov light produced by secondary particles, enabling IceCube to identify both atmospheric and astrophysical neutrinos. One of the main challenges in this effort is effectively distinguishing between muons induced by neutrinos and those generated by cosmic-ray air showers. To address this challenge, the Advanced Northern Tracks Selection (ANTS) employs a graph convolutional neural network. This network is designed to utilize both the sensor data and the geometric arrangement of the detector's photomultiplier tubes (PMTs). By representing each module as a node in a graph and extracting features from each module, the network can capture and integrate both local and global features. This work details the implementation of the network architecture and highlights the improvements in background rejection efficiency compared to existing methods for selecting muon tracks.\n\n", "2507.07408": "2025-07-10, **Classification of high energy muon bundles and single muons from the southern sky in IceCube**, Najia Moureen Binte Amin et.al., [2507.07408v1](http://arxiv.org/abs/2507.07408v1)\n\n The IceCube Neutrino Observatory, located at the geographic South Pole, uses the glacial ice volume to detect astrophysical neutrinos. Detection of the neutrinos from the northern sky provides the opportunity to use a large effective volume. However, as the cross-section increases with energy, most high-energy neutrinos are absorbed by the Earth. On the other hand, probing down-going PeV neutrinos from the southern sky becomes challenging because of the large cosmic ray induced muon backgrounds. This contribution presents a method for classifying atmospheric muon bundles and single muons by analyzing the lateral and longitudinal characteristics of through-going track-like events from the southern sky. Muons generated in cosmic ray air showers form muon bundles, exhibiting a lateral spread spanning tens of meters within IceCube. We explore the time residual feature for the observed Cherenkov light to separate bundles from single muons. We also utilize energy losses along the track, which lead to fluctuations in the light intensity: bundles follow a smooth pattern, whereas single muons are more stochastic. A Boosted Decision Tree algorithm is trained on simulated, well-reconstructed cosmic ray and neutrino events to classify neutrino-induced single muons and cosmic ray bundles.\n\n", "2507.07407": "2025-07-10, **The GRAND@Auger Prototype for the Giant Radio Array for Neutrino Detection**, Beatriz de Errico et.al., [2507.07407v1](http://arxiv.org/abs/2507.07407v1)\n\n As of early 2025, the GRAND Collaboration operates three prototype arrays: GRANDProto300 in China, GRAND@Nan\\c{c}ay in France, and GRAND@Auger in Argentina. The GRAND@Auger prototype was established through an agreement between the GRAND and Pierre Auger Collaborations, repurposing ten Auger Engineering Radio Array (AERA) stations as GRAND detection units. This setup provides a unique opportunity for coincident air-shower detection, enabling direct event-by-event comparison between GRAND@Auger and the well-established Pierre Auger detectors. Such comparisons allow for a detailed assessment of the detection principle and reconstruction capabilities of GRAND. In this contribution, we present an overview of the commissioning and preliminary results of GRAND@Auger, including the measurement of the Galactic background noise and the detection of the first self-triggered candidate event in coincidence with the Pierre Auger Observatory. Both results underscore the role of GRAND@Auger in advancing the GRAND project and refining the techniques required for large-scale radio detection of ultra-high-energy particles.\n\n", "2507.07397": "2025-07-10, **LIQUIDating the Gallium Anomaly**, Garv Chauhan et.al., [2507.07397v1](http://arxiv.org/abs/2507.07397v1)\n\n The gallium anomaly has a global significance of greater than $5\\sigma$. Most viable BSM solutions quickly run into strong tensions with reactor and solar neutrino data. We propose to use indium (${}^{115}\\text{In}$) as a target as it offers a low threshold and reasonably high cross section. The neutrino-indium charged current cross section can be calibrated using the well-constrained solar ${}^{7}\\text{Be}$ neutrino flux that lies very close in energy to the ${}^{51}\\text{Cr}$ neutrino lines. The triple coincidence provided by ${}^{115}\\text{In}$ neutrino capture can be fully exploited by an opaque scintillation detector that also provides energy and position information. We show that a $100$ ton indium target combined with 2 source runs of a $3.4$ MCi ${}^{51}\\text{Cr}$ source can probe the complete parameter space of the gallium anomaly, both in the context of a vanilla sterile neutrino as well as more involved BSM scenarios.\n\n", "2507.07345": "2025-07-10, **Search for heavy neutral leptons in $π^+$ decays to positrons**, NA62 Collaboration et.al., [2507.07345v1](http://arxiv.org/abs/2507.07345v1)\n\n A search for heavy neutral lepton ($N$) production in $\\pi^+\\to e^+ N$ in-flight decays using data collected by the NA62 experiment at CERN in 2017-2024 is reported. Upper limits for the extended neutrino mixing matrix element $\\|U\\_{e4}\\|^2$ are established at the level of $10^{-8}$ for heavy neutral leptons with mass in the range 95-126 $MeV/c^2$ and lifetime exceeding 50 ns.\n\n"}, "dark matter": {"2507.07973": "2025-07-10, **Multiple Axions Save High-Scale Inflation**, Dan Kondo et.al., [2507.07973v1](http://arxiv.org/abs/2507.07973v1)\n\n Many models of dark matter QCD axion requires inflation at a scale $H\\_{\\text{inf}} \\lesssim 10^{6}$~GeV and hence does not allow for a detectable tensor mode fluctuation. This is because the domain wall problem forces the Peccei--Quinn symmetry to be broken during the inflation and the axions to be produced by the misalignment mechanism. We point out that theories with multiple axions can evade this constraint and allow for a high-scale inflation with detectable tensor mode. It only requires a condition on the anomaly coefficients so that there is a unique minimum for the axion potential without a fine-tuning or small parameters.\n\n", "2507.07963": "2025-07-10, **A Semi-Analytic model for Effects of Fuzzy Dark Matter Granule Perturbations on Orbital Motion**, Yu Zhao et.al., [2507.07963v1](http://arxiv.org/abs/2507.07963v1)\n\n In fuzzy dark matter scenarios, the quantum wave nature of ultralight axion-like particles generates stochastic density fluctuations inside dark matter halos. These fluctuations, known as granules, perturb the orbits of subhalos and other orbiting bodies. While previous studies have simulated these effects using N-body techniques or modeled them statistically using diffusion approximations, we propose an alternative framework based on representing the perturbations as a Fourier series with random coefficients, which can be applied to individual orbits, not just populations. We extend the model to finite-size subhalos, identifying a critical length scale below which subhalos behave as point-mass particles. In contrast, larger subhalos exhibit suppressed perturbations from granules due to their extended mass profiles. Using FDM-Simulator, we validate our finite-size model by isolating granule accelerations and confirming their statistical effects on subhalo dynamics.\n\n", "2507.07895": "2025-07-10, **A case study of GW190425 for classifying binary neutron star versus binary black hole mergers and constraining asymmetric dark matter with gravitational wave detectors**, Sanika Khadkikar et.al., [2507.07895v1](http://arxiv.org/abs/2507.07895v1)\n\n The LIGO Scientific, Virgo, and KAGRA collaboration has identified two binary neutron star merger candidates, GW170817 and GW190425, along with several binary black hole candidates. While GW170817 was confirmed as a BNS merger through its electromagnetic counterparts, GW190425 lacked such observations, leaving its classification uncertain. We examine the possibility that GW190425 originated from black holes that merged after dark matter accretion caused their progenitor neutron stars to implode. Using this event, we place constraints on dark matter parameters, such as its mass and interaction cross section. We simulate GW190425-like events and analyze them using future gravitational wave detector networks, including upcoming upgrades to current detector networks and next-generation observatories. We show that a network with A+ sensitivity can not classify a GW190425-like event with sufficient confidence. Detector networks with A# sensitivity can classify such events only if the neutron stars follow a relatively stiff equation of state, whose stronger tidal imprint differs measurably from a binary black hole waveform. Next-generation observatories like the Einstein Telescope and Cosmic Explorer recover the tidal signature even for soft, compact stars, enabling confident classification. Finally, we forecast the dark matter constraints that future gravitational wave networks could achieve for similar events.\n\n", "2507.07892": "2025-07-10, **Baryonification: An alternative to hydrodynamical simulations for cosmological studies**, Aurel Schneider et.al., [2507.07892v1](http://arxiv.org/abs/2507.07892v1)\n\n We present an improved baryonification (BFC) model that modifies dark-matter-only $N$-body simulations to generate particle-level outputs for gas, dark matter, and stars. Unlike previous implementations, our approach first splits each simulation particle into separate dark matter and baryonic components, which are then displaced individually using the BFC technique. By applying the hydrostatic and ideal gas equations, we assign pressure and temperature values to individual gas particles. The model is validated against hydrodynamical simulations from the FLAMINGO and TNG suites (which feature varied feedback prescriptions) showing good agreement at the level of density and pressure profiles across a wide range of halo masses. As a further step, we calibrate the BFC model parameters to gas and stellar mass ratio profiles from the hydrodynamical simulations. Based on these calibrations, we baryonify $N$-body simulations and compare the resulting total matter power spectrum suppressions to the ones from the same hydrodynamical simulation. Carrying out this test of the BFC method at each redshift individually, we obtain a 2 percent agreement up to $k=5\\,h$/Mpc across all tested feedback scenarios. We also define a reduced, 2+1 parameter BFC model that simultaneously accounts for feedback variations (2 parameters) and redshift evolution (1 parameter). The 2+1 parameter model agrees with the hydrodynamical simulations to better than 2.5 percent over the scales and redshifts relevant for cosmological surveys. Finally, we present a map-level comparison between a baryonified $N$-body simulation and a full hydrodynamical run from the TNG simulation suite. Visual inspection of dark matter, gas, and stellar density fields, along with the integrated pressure map, shows promising agreement. Further work is needed to quantify the accuracy at the level of observables.\n\n", "2507.07798": "2025-07-10, **Exploring non-cold dark matter in a scenario of dynamical dark energy with DESI DR2 data**, Tian-Nuo Li et.al., [2507.07798v1](http://arxiv.org/abs/2507.07798v1)\n\n Recent observations of DESI hint that dark matter (DM) may not be cold but have a non-zero equation of state (EoS) parameter, and that dark energy (DE) may not be a cosmological constant. In this work, we explore the possibility of a non-zero DM EoS parameter within the framework of dynamical DE. We perform analysis by using the latest baryon acoustic oscillation (BAO) data from DESI DR2, the cosmic microwave background (CMB) data from Planck, and the type Ia supernova (SN) data from DESY5 and PantheonPlus. When using the combination of CMB, BAO, and SN data, our results indicate a preference for a non-zero DM EoS parameter at the $2.8\\sigma$ and $3.3\\sigma$ level within the content of a constant DE EoS. In contrast, for a time-evolving DE EoS parameterized by $w\\_0$ and $w\\_a$, this preference decreases to $0.8\\sigma$ and $1.1\\sigma$. Furthermore, allowing a non-zero DM EoS yields best-fit values of $w\\_0$ and $w\\_a$ that exhibit smaller deviations from the $\\Lambda$CDM expectations, and Bayesian evidence analysis shows a comparable preference for this model relative to $\\Lambda$CDM. The overall results of this work indicate that a non-zero DM EoS parameter warrants further exploration and investigation.\n\n", "2507.07786": "2025-07-10, **Constraints on Axion-Like Particles from 16.5 Years of Fermi-LAT Data and Prospects for VLAST**, Zhi-Qi Guo et.al., [2507.07786v1](http://arxiv.org/abs/2507.07786v1)\n\n Axion-like particles (ALPs), hypothetical particles beyond the Standard Model, are considered as promising dark matter candidates. ALPs can convert into photons and vice versa in a magnetic field via the Primakoff effect, potentially generating detectable oscillation in $\\gamma$-ray spectra. This study analyzes 16.5 years of data from the Fermi Large Area Telescope (Fermi-LAT) on NGC 1275, the brightest galaxy in the Perseus cluster, to constrain the ALP parameter space. Our results improve the previous 95\\% exclusion limits of the photon-ALP coupling $g\\_{a\\gamma}$ by a factor of 2 in the ALP mass range of $4\\times 10^{-10}\\,\\mathrm{eV}\\lesssim m\\_{a}\\lesssim 5\\times 10^{-9}\\,\\mathrm{eV}$. Moreover, we investigate the projected sensitivity of the future Very Large Area $\\gamma$-ray Space Telescope (VLAST) on searching for ALPs. We find that (i) the expected sensitivity on the ALP-photon coupling can be stronger than that from the upcoming International Axion Observatory (IAXO) in the ALP mass range of $2\\times 10^{-11}\\,\\mathrm{eV}\\lesssim m\\_{a}\\lesssim 1\\times 10^{-7}\\,\\mathrm{eV}$, with the best sensitivity of $g\\_{a\\gamma}\\sim 7\\times 10^{-13}\\,\\mathrm{GeV^{-1}}$ at $m\\_{a}\\sim 2\\times 10^{-10}\\,\\mathrm{eV}$; (ii) VLAST can extend the sensitivity of the ALP masses below $5\\times 10^{-12}\\,\\mathrm{eV}$, where the ALP-photon coupling $g\\_{a\\gamma}\\gtrsim 1.5\\times 10^{-11}\\,\\mathrm{GeV^{-1}}$ will be excluded; (iii) the entire parameter space of ALP accounting for TeV transparency can be fully tested. These results demonstrate that VLAST will offer an excellent opportunity for ALPs searches.\n\n", "2507.07665": "2025-07-10, **Whispers from the Early Universe: The Ringdown of Primordial Black Holes**, Chen Yuan et.al., [2507.07665v1](http://arxiv.org/abs/2507.07665v1)\n\n We investigate the stochastic gravitational wave background (SGWB) generated by the ringdown phase of primordial black holes (PBHs) formed in the early universe. As the ringdown signal is independent of the PBH formation mechanism, the resulting SGWB offers a model-independent probe of PBHs. We numerically compute the ringdown waveform and derive the corresponding SGWB. We show that such a signal could be detected by future pulsar timing arrays (PTAs) for PBHs heavier than the solar mass. Additionally, we evaluate the SGWB from binary PBH mergers and demonstrate that it lies within the sensitivity bands of next-generation ground-based interferometers such as Cosmic Explorer and Einstein Telescope, suggesting a multi-band observational strategy for probing the PBH dark matter scenario.\n\n", "2507.07482": "2025-07-10, **Probing Axions via Spectroscopic Measurements of S-stars at the Galactic Center**, Zhaoyu Bai et.al., [2507.07482v1](http://arxiv.org/abs/2507.07482v1)\n\n Axions, encompassing both QCD axions and axion-like particles, can generate loop-induced quadratic couplings to electromagnetic field strength tensors, resulting in oscillatory shifts of the fine-structure constant. Near a Kerr black hole, an axion field with a Compton wavelength comparable to the event horizon can exponentially grow through the superradiance mechanism, potentially reaching a maximum amplitude near the decay constant, provided this scale is below approximately $10^{16}$ GeV. The saturated axion cloud formed around the black hole induces characteristic oscillations in the fine-structure constant, with a period of $10$-$40$ minutes determined by the axion mass, and a spatial profile governed by the axion wavefunction and its coupling strength. At lower axion masses, axion dark matter can form a soliton-like core characterized by a nearly constant amplitude, extending measurable variations of the fine-structure constant to greater distances. Precise spectroscopic measurements of S-stars orbiting the supermassive black hole Sgr A$^*$ provide a powerful probe of these predictions, potentially excluding substantial regions of parameter space for quadratic scalar couplings to photons, owing to the high boson density near the Galactic Center.\n\n"}, "supernova": {"2507.07816": "2025-07-10, **GPU-Accelerated Searches for Long-Transient Gravitational Waves from Newborn Neutron Stars**, Joan-René Mérou et.al., [2507.07816v1](http://arxiv.org/abs/2507.07816v1)\n\n We present a novel method to efficiently search for long-duration gravitational wave transients emitted by new-born neutron star remnants of binary neutron star coalescences or supernovae. The detection of these long-transient gravitational waves would contribute to the understanding of the properties of neutron stars and fundamental physics. Additionally, studying gravitational waves emitted by neutron stars can provide valuable tests of general relativity and offer insights into the neutron star population, of which only a small fraction appears to be observable through current electromagnetic telescopes. Our approach uses GPUs and the JAX library in Python, resulting in significantly faster processing compared to previous methods. The efficiency of this code enables wide regions of the sky to be covered, eliminating the need for precise pinpointing of mergers or supernovae. This method will be deployed in searches for long-transient gravitational waves following any detection of a binary neutron star system merger in the latest O4 science run of the LIGO-Virgo-KAGRA collaboration, which started in May 2023 with a significant improvement in sensitivity with respect to previous runs.\n\n", "2507.07798": "2025-07-10, **Exploring non-cold dark matter in a scenario of dynamical dark energy with DESI DR2 data**, Tian-Nuo Li et.al., [2507.07798v1](http://arxiv.org/abs/2507.07798v1)\n\n Recent observations of DESI hint that dark matter (DM) may not be cold but have a non-zero equation of state (EoS) parameter, and that dark energy (DE) may not be a cosmological constant. In this work, we explore the possibility of a non-zero DM EoS parameter within the framework of dynamical DE. We perform analysis by using the latest baryon acoustic oscillation (BAO) data from DESI DR2, the cosmic microwave background (CMB) data from Planck, and the type Ia supernova (SN) data from DESY5 and PantheonPlus. When using the combination of CMB, BAO, and SN data, our results indicate a preference for a non-zero DM EoS parameter at the $2.8\\sigma$ and $3.3\\sigma$ level within the content of a constant DE EoS. In contrast, for a time-evolving DE EoS parameterized by $w\\_0$ and $w\\_a$, this preference decreases to $0.8\\sigma$ and $1.1\\sigma$. Furthermore, allowing a non-zero DM EoS yields best-fit values of $w\\_0$ and $w\\_a$ that exhibit smaller deviations from the $\\Lambda$CDM expectations, and Bayesian evidence analysis shows a comparable preference for this model relative to $\\Lambda$CDM. The overall results of this work indicate that a non-zero DM EoS parameter warrants further exploration and investigation.\n\n"}}