{"neutrino": {"2308.03702": "2023-08-07, **Sensitivity of octant of $θ_{23}$, CP violation and mass hierarchy in NO$ν$A with multinucleon and detector effects**, Paramita Deka et.al., [2308.03702v1](http://arxiv.org/abs/2308.03702v1)\n\n In this work, we investigate how multinucleon enhancement and RPA (Random Phase Approximation) suppression can affect the measurement of three unknown neutrino oscillation parameters - the CP-violating phase $\\delta\\_{CP}$, the octant of the atmospheric mixing angle $\\theta\\_{23}$, and the determination of the mass hierarchy, in the appearance channel of the NO$\\nu$A experiment. We include the presence of the detector effect as well in the analysis, which is crucial for capturing realistic experimental scenarios. It is found that the analysis using our comprehensive model (QE(+RPA)+2p2h) exhibits significantly enhanced sensitivity compared to the pure QE interaction process, in all the cases. Also, the higher octant of $\\theta\\_{23}$, the lower half plane of $\\delta\\_{CP}$, and the normal mass hierarchy (HO-LHP-NH) exhibit improved sensitivity, enabling a more precise determination of the corresponding parameters. Furthermore, it is also noted that improving the performance of the detector also improves the results. Thus, including multinucleon effects and improving detector efficiency have the potential to enhance the capabilities of the NO$\\nu$A (and other long baseline) experiment in conducting precise parameter studies.\n\n", "2308.03356": "2023-08-07, **A relativistic model-free prediction for neutrinoless double beta decay at leading order**, Y. L. Yang et.al., [2308.03356v1](http://arxiv.org/abs/2308.03356v1)\n\n Starting from a manifestly Lorentz-invariant chiral Lagrangian, we present a model-free prediction for the transition amplitude of the process $nn\\rightarrow pp e^-e^-$ induced by light Majorana neutrinos, which is a key process of the neutrinoless double beta decay ($0\\nu\\beta\\beta$) in heavy nuclei employed in large-scale searches. Contrary to the nonrelativistic case, we show that the transition amplitude can be renormalized at leading order without any uncertain contact operators. The predicted amplitude defines a stringent benchmark for the previous estimation with model-dependent inputs, and greatly reduces the uncertainty of $0\\nu\\beta\\beta$ transition operator in the calculations of nuclear matrix elements. Generalizations of the present framework could also help to address the uncertainties in $0\\nu\\beta\\beta$ decay induced by other mechanisms. In addition, the present work motivates a relativistic ab initio calculation of $0\\nu\\beta\\beta$ decay in light and medium-mass nuclei.\n\n", "2308.02990": "2023-08-06, **The Surface Array of IceCube-Gen2**, Alan Coleman et.al., [2308.02990v1](http://arxiv.org/abs/2308.02990v1)\n\n The science goals of IceCube-Gen2 include multi-messenger astronomy, astroparticle and particle physics. To this end, the observatory will include several detection methods, including a surface array and in-ice optical sensors. The array will have an approximately 8 km$^2$ surface coverage consisting of elevated scintillator panels and radio antennas to detect air showers in the energy range of several 100 TeV to a few EeV. The observatory's design is unique in that the measurements using the surface array can be combined with the observations of $\\geq$300 GeV muons, produced in the hadronic cascades, using the optical detectors in the ice. This allows for an enhanced ability to study cosmic-ray and hadronic physics as well as to boost the sensitivity for astrophysical neutrinos from the southern sky by reducing the primary background, atmospheric muons. We will present the baseline design of the surface array and highlight the expected scientific capabilities.\n\n"}, "dark matter": {"2308.03737": "2023-08-07, **Frequency of the dark matter subhalo collisions and bifurcation sequence arising formation of dwarf galaxies**, Koki Otaki et.al., [2308.03737v1](http://arxiv.org/abs/2308.03737v1)\n\n The cold dark matter (CDM) model predicts galaxies have 100 times more dark matter mass than stars. Nevertheless, recent observations report the existence of dark-matter-deficient galaxies with less dark matter than expected. To solve this problem, we investigate the physical processes of galaxy formation in head-on collisions between gas-containing dark matter subhaloes (DMSHs). Analytical estimation of the collision frequency between DMSHs associated with a massive host halo indicates that collisions frequently occur within 1/10th of the virial radius of the host halo, with a collision timescale of about 10 Myr, and the most frequent relative velocity increases with increasing radius. Using analytical models and numerical simulations, we show the bifurcation channel of the formation of dark-matter-dominated and dark-matter-deficient galaxies. In the case of low-velocity collisions, a dark-matter-dominated galaxy is formed by the merging of two DMSHs. In the case of moderate-velocity collisions, the two DMSHs penetrate each other. However the gas medium collides, and star formation begins as the gas density increases, forming a dwarf galaxy without dark matter at the collision surface. In the case of high-velocity collisions, shock-breakout occurs due to the shock waves generated at the collision surface reaching the gas surface, and no galaxy forms. For example, the simulation demonstrates that a pair of DMSHs with a mass of 10^9 Msun containing gas of 0.1 solar metallicity forms a dark-matter-deficient galaxy with a stellar mass of 10^7 Msun for a relative velocity of 200 km/s.\n\n", "2308.03724": "2023-08-07, **Quantum Gravity Effects on Dark Matter and Gravitational Waves**, Stephen F. King et.al., [2308.03724v1](http://arxiv.org/abs/2308.03724v1)\n\n We explore how quantum gravity effects, manifested through the breaking of discrete symmetry responsible for both Dark Matter and Domain Walls, can have observational effects through CMB observations and gravitational waves. To illustrate the idea we consider a simple model with two scalar fields and two $\\mathcal{Z}\\_2$ symmetries, one being responsible for Dark Matter stability, and the other spontaneously broken and responsible for Domain Walls, where both symmetries are assumed to be explicitly broken by quantum gravity effects. We show the recent gravitational wave spectrum observed by several pulsar timing array projects can help constrain such effects.\n\n", "2308.03680": "2023-08-07, **Investigation of spin-dependent dark matter in mono-photon production at high-energy colliders**, G. Gil da Silveira et.al., [2308.03680v1](http://arxiv.org/abs/2308.03680v1)\n\n Many theories about dark matter have emerged due to its strong theoretical appeal in explaining astrophysical phenomena. However, experimental and theoretical particle physics have yet not provided evidence that dark matter is part of the observable Universe. Our work aims to investigate the interaction between Standard Model (SM) fermions and different species of dark matter (DM) particles in high-energy collisions through interaction of a new massive vector mediator, Z'. The production of scalar and fermion DM pairs via fermion annihilation into the new vector boson is investigated near a resonance, where a SM signal from hard photon emission is considered as initial state radiation, namely a mono-photon production. Values of coupling constants between the DM and the SM particles are mapped in contrast to the Planck satellite data for thermal relic density DM computed in the correct framework for the relic density near a resonance, where a weaker suppression of the relic density is expected. We show for the CLIC and LHC kinematic regimes that certain mass ranges and coupling constants of these DM particles are in agreement with the expected relic density near a resonance and are not excluded by collider and astrophysical limits.\n\n", "2308.03468": "2023-08-07, **The mass density contrast in perturbed Friedman-Lemaitre-Robertson-Walker cosmologies**, Edward Malec et.al., [2308.03468v1](http://arxiv.org/abs/2308.03468v1)\n\n We analyze the evolution of the mass density contrast in spherical perturbations of flat Friedman-Lemaitre-Robertson-Walker cosmologies. Both dark matter and dark energy are included. In the absence of dark energy the evolution equation coincides with that obtained by Bonnor within the ``Newtonian cosmology''.\n\n", "2308.03342": "2023-08-07, **General spherically symmetric solution of Cotton gravity**, Merab Gogberashvili et.al., [2308.03342v1](http://arxiv.org/abs/2308.03342v1)\n\n In this paper we present the general spherically symmetric solution to the vacuum equations of Cotton gravity. The obtained metric solution reveals the presence of singularities at the photosphere of a spherical source, which obstruct the formation of Schwarzschild-like black holes. The solution is characterized by two integration constants that can be associated with the Hubble horizon and utilized to model the dark matter and dark energy. We examine the diverse features of the solution, including the introduction of long-range modifications to Newton's force through the incorporation of the velocity-squared repulsive term.\n\n", "2308.03298": "2023-08-07, **A New Halo Density Profile for Galaxies**, Fei Qin et.al., [2308.03298v1](http://arxiv.org/abs/2308.03298v1)\n\n More precise measurements of galaxy clustering will be provided by the next generation of galaxy surveys such as DESI, WALLABY and SKA. To utilize this information to improve our understanding of the Universe, we need to accurately model the distribution of galaxies in their host dark matter halos. In this work we present a new halo density profile model for galaxies, which makes predictions for the positions of galaxies in the host halo, different to the widely adopted Navarro-Frenk-White (NFW) profile, since galaxies tend to be found more in the outskirts of halos (nearer the virial radius) than an NFW profile. The parameterised density profile model is fit and tested using the DarkSage semi-analytic model of galaxy formation. We find that our density profile model can accurately reproduce the halo occupation distribution and galaxy two-point correlation function of the DarkSage simulation. We also derive the analytic expressions for the circular velocity and gravitational potential energy for this density profile. We use the SDSS DR10 galaxy group catalogue to validate this halo density profile model. Compared to the NFW profile, we find that our model more accurately predicts the positions of galaxies in their host halo and the galaxy two-point correlation function.\n\n", "2308.03136": "2023-08-06, **On the Nonlocal Newtonian Cosmology**, Raihaneh Moti et.al., [2308.03136v1](http://arxiv.org/abs/2308.03136v1)\n\n In the absence of an exact development of the cosmological models of the Mashhoon nonlocal gravity, the Newtonian regime may clarify some aspects of it. One important feature to consider is the formation of horizons, which can be understood as a consequence of the finite interaction velocity. In order, to fully investigate the nonlocal effects, it is necessary to extend the integration over space to the integration over space-time. In this context, we show that the density of effective dark matter would increase, while the density of baryonic matter decreases, during the deep matter-dominated epoch. This finding is in contradiction with the predictions of the standard model of cosmology and it raises concerns about the compatibility of nonlocal effects using Tohline-Kuhn kernel with the standard model.\n\n"}, "supernova": {"2308.03484": "2023-08-07, **A Systematic Study of Associations between Supernova Remnants and Molecular Clouds**, Xin Zhou et.al., [2308.03484v1](http://arxiv.org/abs/2308.03484v1)\n\n We universally search for evidence of kinematic and spatial correlation of supernova remnant (SNR) and molecular cloud (MC) associations for nearly all SNRs in the coverage of the MWISP CO survey, i.e. 149 SNRs, 170 SNR candidates, and 18 pure pulsar wind nebulae (PWNe) in 1 deg < l < 230 deg and -5.5 deg < b < 5.5 deg. Based on high quality and unbiased 12CO/13CO/C18O (J = 1--0) survey data, we apply automatic algorithms to identify broad lines and spatial correlations for molecular gas in each SNR region. The 91 percent of SNR-MC associations detected previously are identified in this paper by CO line emission. Overall, there could be as high as 80 percent of SNRs associated with MCs. The proportion of SNRs associated with MCs is high within the Galactic longitude less than ~50 deg. Kinematic distances of all SNRs that are associated with MCs are estimated based on systemic velocities of associated MCs. The radius of SNRs associated with MCs follows a lognormal distribution, which peaks at ~8.1 pc. The progenitor initial mass of these SNRs follows a power-law distribution with an index of ~-2.3 that is consistent with the Salpeter index of -2.35. We find that SNR-MC associations are mainly distributed in a thin disk along the Galactic plane, while a small amount distributed in a thick disk. With the height of these SNRs from the Galactic plane below ~45 pc, the distribution of the average radius relative to the height of them is roughly flat, and the average radius increases with the height when above ~45 pc.\n\n", "2308.03456": "2023-08-07, **Bayesian inference from gravitational waves in fast-rotating, core-collapse supernovae**, Carlos Pastor-Marcos et.al., [2308.03456v1](http://arxiv.org/abs/2308.03456v1)\n\n Core-collapse supernovae (CCSNe) are prime candidates for gravitational-wave detectors. The analysis of their complex waveforms can potentially provide information on the physical processes operating during the collapse of the iron cores of massive stars. In this work we analyze the early-bounce rapidly rotating CCSN signals reported in the waveform catalog of Richers et al 2017, which comprises over 1800 axisymmetric simulations extending up to about $10$~ms of post-bounce evolution. It was previously established that for a large range of progenitors, the amplitude of the bounce signal, $\\Delta h$, is proportional to the ratio of rotational-kinetic energy to potential energy, T/\\|W\\|, and the peak frequency, $f\\_{\\rm peak}$, is proportional to the square root of the central rest-mass density. In this work, we exploit these relations to suggest that it could be possible to use such waveforms to infer protoneutron star properties from a future gravitational wave observation, if the distance and inclination are well known. Our approach relies on the ability to describe a subset of the waveforms in the early post-bounce phase in a simple template form depending only on two parameters, $\\Delta h$ and $f\\_{\\rm peak}$. We use this template to perform a Bayesian inference analysis of waveform injections in Gaussian colored noise for a network of three gravitational wave detectors formed by Advanced LIGO and Advanced Virgo. We show that it is possible to recover the injected parameters, peak frequency and amplitude, with an accuracy better than 10% for more than 50% of the detectable signals (given known distance and inclination angle). However, inference on waveforms from outside the Richers catalog is not reliable, indicating a need for carefully verified waveforms of the first 10 ms after bounce of rapidly rotating supernovae of different progenitors with agreement between different codes.\n\n", "2308.03106": "2023-08-06, **Dust evolution in a supernova interacting with the ISM**, Evgenii O. Vasiliev et.al., [2308.03106v1](http://arxiv.org/abs/2308.03106v1)\n\n Supernovae (SN) explosions are thought to be an important source of dust in galaxies. At the same time strong shocks from SNe are known as an efficient mechanism of dust destruction via thermal and kinetic sputtering. A critically important question of how these two hypotheses of SNe activity control the dust budget in galaxies is still not quite clearly understood. In this paper we address this question within 3D multi-fluid hydrodynamical simulations, treating separately the SNe injected dust and the dust pre-exicted in ambient interstellar gas. We focus primarily on how the injected and pre-existed dust are destroyed by shock waves and the hot gas in the SN bubble depending of the density of ambient gas. Within our model we estimate an upper limit of the SN-produced dust mass which can be supplied into interstellar medium. For a SN progenitor mass of 30 $M\\_\\odot$ and the ejected dust mass $M\\_d=1~M\\_\\odot$ we constrain the dust mass that can delivered into the ISM as $\\geq 0.13~M\\_\\odot$ provided the injected dust particles are large $a\\geq 0.1~\\mu$m.\n\n"}}