{"neutrino": {"2506.13747": "2025-06-16, **Two-neutrino $0^+ \\to 0^+$ double beta decay of $^{48}\\mathrm{Ca}$ within the DFT-NCCI framework**, Jan Miśkiewicz et.al., [2506.13747v1](http://arxiv.org/abs/2506.13747v1)\n\n We present a seminal calculation of the nuclear matrix element for the two-neutrino double beta ($2\\nu\\beta\\beta$) decay of ${}^{48}\\text{Ca} \\rightarrow {}^{48}\\text{Ti}$ using a post-Hartree-Fock (HF) Density Functional Theory-based No-Core Configuration-Interaction (DFT-NCCI) framework developed by our group [Phys. Rev. C 94, 024306 (2016)]. In the present calculation, we utilize a variant of the approach that restores rotational symmetry and mixes states projected from self-consistent mean-field configurations obtained by solving the HF equations with the density-independent local Skyrme interaction. Our calculations yield $\\|\\mathcal{M}\\_{2\\nu\\beta\\beta}\\| = 0.056(6)$ MeV$^{-1}$ for the nuclear matrix element describing this process. This result is in very good agreement with shell-model studies - for example, with the calculations by Horoi {\\it et al.\\/} [Phys. Rev. C 75, 034303 (2007)], which yielded 0.054 (0.064) MeV$^{-1}$ for the GXPF1A (GXPF1) interactions, respectively. It is also in a reasonable agreement with the most recent experimental estimate from the review by Barabash, which is 0.068(6) MeV$^{-1}$, assuming quenching $qg\\_\\text{A} \\approx 1$. The consistency of our prediction with the shell-model results increases our confidence in the nuclear modeling of this second-order, very rare process which is of paramount importance for further modeling of the neutrinoless double beta ($0\\nu\\beta\\beta$) decay process.\n\n", "2506.13665": "2025-06-16, **Impact of embedded $^{163}$Ho on the performance of the transition-edge sensor microcalorimeters of the HOLMES experiment**, Douglas Bennett et.al., [2506.13665v1](http://arxiv.org/abs/2506.13665v1)\n\n We present a detailed investigation of the performance of transition-edge sensor (TES) microcalorimeters with $^{163}$Ho atoms embedded by ion implantation, as part of the HOLMES experiment aimed at neutrino mass determination. The inclusion of $^{163}$Ho atoms introduces an excess heat capacity due to a pronounced Schottky anomaly, which can affect the detector's energy resolution, signal height, and response time. We fabricated TES arrays with varying levels of $^{163}$Ho activity and characterized their performance in terms of energy resolution, decay time constants, and heat capacity. The intrinsic energy resolution was found to degrade with increasing $^{163}$Ho activity, consistent with the expected scaling of heat capacity. From the analysis, we determined the specific heat capacity of $^{163}$Ho to be $(2.9 \\pm 0.4 \\mathrm{(stat)} \\pm 0.7 \\mathrm{(sys)})$ J/K/mol at $(94 \\pm 1)$\\,mK, close to the literature values for metallic holmium. No additional long decay time constants correlated with $^{163}$Ho activity were observed, indicating that the excess heat capacity does not introduce weakly coupled thermodynamic systems. These results suggest that our present TES microcalorimeters can tolerate $^{163}$Ho activities up to approximately 5 Bq without significant performance degradation. For higher activities, reducing the TES transition temperature is necessary to maintain energy resolution. These findings provide critical insights for optimizing TES microcalorimeters for future neutrino mass experiments and other applications requiring embedded radioactive sources. The study also highlights the robustness of TES technology in handling implanted radionuclides while maintaining high-resolution performance.\n\n", "2506.13555": "2025-06-16, **Joint analysis of reactor and accelerator CE$ν$NS data on germanium: implications for the Standard Model and nuclear physics**, M. Atzori Corona et.al., [2506.13555v1](http://arxiv.org/abs/2506.13555v1)\n\n This work presents the first comprehensive joint analysis of all available Coherent Elastic Neutrino-Nucleus Scattering (CE$\\nu$NS) data on germanium: those observed at the Spallation Neutron Source (SNS) by the COHERENT collaboration and those of the nuclear reactors revealed by the CONUS+ experiment using germanium detectors. In addition to COHERENT and CONUS+, we incorporate reactor data from TEXONO and $\\nu$GeN, thereby enhancing both the statistical significance and the systematic reliability of our study. We provide state-of-the-art determinations of key nuclear physics and Standard Model parameters, including the neutron root-mean-square (rms) radius of germanium nuclei, the weak mixing angle, and the neutrino charge radius. The observed tension of about $2 \\sigma$ between the COHERENT germanium measurement and the Standard Model prediction motivates a detailed reassessment of the theoretical cross-section. In particular, we examine the impact of nuclear form factors and uncertainties in the nuclear radius, as well as the potential influence of a systematic shift in the neutrino flux normalisation at the SNS. Our results highlight the reliability of CE$\\nu$NS as a precision tool, reinforced by the complementarity of different experimental inputs, and lay the groundwork for future advances in the field.\n\n", "2506.13412": "2025-06-16, **Triplet Higgs assisted leptogenesis from axion oscillation after inflation**, Sasmita Mishra et.al., [2506.13412v1](http://arxiv.org/abs/2506.13412v1)\n\n Leptogenesis via axion oscillation after inflation is an alternate mechanism of thermal leptogenesis. In this mechanism, the requirement of the existence of a lepton number ($L$) violating process in equilibrium to drive the lepton number requires the temperature of leptogenesis at $\\sim 10^{13}$ GeV. Triplet scalars, due to their interaction with gauge bosons, make a suitable candidate to prevail in the thermal bath via gauge scattering at such high energy. Also, owing to its interaction with Standard Model (SM) leptons and the Higgs scalar, it can mediate $\\Delta L =2$ process. Moreover, just one triplet is enough to serve the purpose as opposed to thermal leptogenesis, where at least one more triplet scalar/right-handed neutrino is required to generate a sizable $CP$ violation. In this work, we study a model where the SM gauge group is extended with $U(1)\\_{\\rm PQ}$, with the addition of one Higgs doublet, one scalar triplet, and one complex scalar singlet. The presence of a complex scalar singlet decouples the PQ symmetry breaking from the electroweak scale. It also provides a common source of an axion-like particle and seesaw scale. The scalar triplet offers a common link between leptogenesis via axion oscillation and neutrino mass. Further, with the presence of one triplet scalar, the lepton flavor violation process is directly determined from low-energy neutrino oscillation data.\n\n", "2506.13310": "2025-06-16, **QCD Axion Conversion in Magnetospheres of Neutron Stars**, Shubham Yadav et.al., [2506.13310v1](http://arxiv.org/abs/2506.13310v1)\n\n The axion-converted-photons flux is a principal window for searching QCD axions as a dark matter (DM) candidate. In addition to solving the strong CP problem, these may explain the properties of the mysterious DM. Neutron star (NS) cooling by neutrino/axion emissions rate constrains the astrophysical properties of superdense matter. We attempt to analyse the impact of strong magnetic fields on the emission properties of NS by employing the FPS equation of State (EoS). We use the Tolman Oppenheimer Volkoff (TOV) equations by considering effects of strong fields and generating profiles. We assume Cooper-pair-breaking formation (PBF) and the Bremsstrahlung process occur in the core of NS. We adopt a polynomial fit function of radial profile to analyse the effects of strong magnetic field. Our entire analysis is at an axion mass of $15$ meV and central magnetic field $B\\_{c}$=$10^{17}$ G. Our work assumes the core comprises hadronic matter of the spherically symmetric magnetized NSs. We have present the results for the energy spectrum of axions and their subsequent conversion to photons. We show that the cooling rate and the luminosity of axions for NSs change significantly due to the intense magnetic field. We report that the energy spectrum of axions from the Bremsstrahlung process dominates over the PBF process at lesser axion energies, within the possible axion mass range for PSR J1356-6429 NS. Our results reveal that the impact of the magnetic field is less at lower axion energies, indicating the necessity for including a magnetic field in axion-to-photon conversion mechanisms.\n\n", "2506.13289": "2025-06-16, **$0νββ$ decay nuclear matrix elements under Left-Right symmetric model from the spherical quasi-particle random phase approximation method with realistic force**, Ri-Guang Huang et.al., [2506.13289v1](http://arxiv.org/abs/2506.13289v1)\n\n We perform the calculation of nuclear matrix elements for the neutrinoless double beta decays under a Left-Right symmetric model mediated by light neutrino, and we adopt the spherical quasi-particle random-phase approximation (QRPA) approach with realistic force. For eight nuclei: $^{76}$Ge, $^{82}$Se, $^{96}$Zr, $^{100}$Mo, $^{116}$Cd, $^{128}$Te, $^{130}$Te and $^{136}$Xe, related nuclear matrix elements are given. We analyze each term and the details of contributions of different parts are also given. For the $q$ term, we find that the weak-magnetism components of the nucleon current contribute equally as other components such as axial-vector. We also discuss the influence of short-range correlations on these NMEs. It is found that $R$ term are more sensitive to the short range correlation than other terms due to the large portion of the contribution from high exchange momenta.\n\n", "2506.12873": "2025-06-15, **Tri-hypercharge versus tri-darkcharge**, Duong Van Loi et.al., [2506.12873v1](http://arxiv.org/abs/2506.12873v1)\n\n We propose a minimal, ultraviolet-complete, and renormalizable extension of the Standard Model, in which the three generations of ordinary fermions are distinguished by family-dependent hypercharges, while three right-handed neutrinos are separated by a dark gauge symmetry that is trivial for all Standard Model fields. This setup yields a fully flipped inert doublet model. The model naturally realizes a hybrid scotoseesaw mechanism that accounts for the smallness of neutrino masses and the largeness of lepton mixing. Simultaneously, it explains the stability and relic abundance of dark matter through a residual dark parity and addresses the hierarchies of charged fermion masses and the suppression of quark mixing via higher-dimensional operators involving high-scale scalar singlets and vector-like fermions. We explore the phenomenological implications of the model and derive constraints from electroweak precision tests, collider searches, flavor-changing processes, and observations of dark matter.\n\n"}, "dark matter": {"2506.13560": "2025-06-16, **Insights into the structure and kinematics of a Milky Way-like galaxy**, Eva Durán-Camacho et.al., [2506.13560v1](http://arxiv.org/abs/2506.13560v1)\n\n How the large-scale kinematics of the Milky Way (MW) relate -- or even regulate -- the formation of large-to-small scale structures is incredibly hard to infer from observations. Here we investigate this interplay through a detailed analysis of a MW-like galaxy simulation, generated through the self-consistent evolution of gas, stars, and dark matter. We show that our model provides a close match to many of the MW's stellar structure and kinematic features (including in the inner Galaxy, and around the Solar neighbourhood), and find that the stellar spiral pattern in our model is very faint, with significantly less multiplicity than the sharper gaseous arms.If taken as an analogue to the MW, this finding would explain the difficulty in observational studies to agree on the number and location of our Galaxy's spiral arms. We also examine radial and tangential velocity residuals in the disc, and find that sharp kinematic transitions correlate with spiral arms, especially in the gas, where values reach $30 - 50$\\,km\\,s$^{-1}$. We find strong radial converging flows promoting spiral-arm growth, while diverging flows disrupt them. A time-resolved analysis of spiral-ridge segments confirms that convergence precedes density enhancements and potential star-forming conditions, while divergence leads to fragmentation and mass redistribution. These patterns evolve on relatively short timescales ($\\sim10-20$\\,Myr), highlighting the transient nature of spiral arms. Our model's spiral arms are dynamically driven, short-lived features shaped by evolving flows, rather than static density waves, which could explain the observed lack of contrast of cloud properties and star formation within and outside spiral arms in the MW.\n\n", "2506.13422": "2025-06-16, **Jet outbursts, non-thermal pressure and the AGN jet duty cycle**, Andrew Sullivan et.al., [2506.13422v1](http://arxiv.org/abs/2506.13422v1)\n\n We predict the non-thermal pressure (NTP) induced in the cores of galaxy clusters by kinetic jet feedback from an active galactic nucleus (AGN). We model a population of Fanaroff-Riley type I jets when sampling power-law distributions in jet power and age, which we evolve in time with a two-phase jet-lobe model. We couple the energy of each jet outburst to the surrounding gas inside spherical shells, allowing us to estimate the fraction of NTP to total pressure induced in the cluster. We predict the mean profile for this NTP fraction over the source population in a variety of cluster environments and for different AGN jet duty cycles. For typical gas and dark matter profiles, the mean NTP fraction peaks at ~4-6% when the AGN jets are active for 10-30% of the total AGN lifecycle. These predictions are in good agreement with observational constraints, suggesting that AGN feedback imparts only small non-thermal contributions to the cluster's core. Furthermore, we find a relationship between the peak in the mean NTP fraction and the AGN jet duty cycle in a given cluster environment. Applying this to Hitomi measurements of the NTP in the Perseus cluster, we infer an AGN jet duty cycle that is consistent with independent evidence of Perseus' AGN jet activity. We propose this as a novel approach for observationally inferring the past AGN activity of real clusters from their observed NTP fraction and environmental profiles.\n\n", "2506.13352": "2025-06-16, **Scrutinizing the impact of the solar modulation on AMS-02 antiproton excess**, Kai-Kai Duan et.al., [2506.13352v1](http://arxiv.org/abs/2506.13352v1)\n\n This study examines the impact of solar modulation on the antiproton excess observed by AMS-02, which may indicate dark matter (DM) annihilation. We analyze three solar modulation models: the force-field approximation (FFA), a time-, charge-, and rigidity-dependent FFA, and a three-dimensional numerical simulation based on the Parker transport equation. Based on AMS-02 latest antiproton data (2025), our results show that the significance of the DM signal is sensitive to the chosen modulation model, with a 2$\\sigma$ signal for the FFA (4$\\sigma$ if including data from H, He, C, O, B/C, and B/O) and a reduced significance for more complex models. We also address systematic uncertainties using two methods: the add-in-quadrature method, which assumes uncorrelated uncertainties between energy bins, and the nuisance parameter method, which treats systematic uncertainties as nuisance parameters during the fitting process. Fitted to AMS-02 antiproton data, DM annihilation to the $b\\bar{b}$ scenario with three different solar modulation models shows that the add-in-quadrature method causes overfitting, whereas the nuisance parameters approach leads to underfitting. Statistically, the signal region of the FFA model using the add-in-quadrature method is the most reliable. This work highlights the need for refined solar modulation models and a better treatment of uncertainties for a conclusive interpretation of the AMS-02 data.\n\n", "2506.13288": "2025-06-16, **Decay of dark energy into dark matter in a metric $f(R)$ gravity: effective running Hubble constant**, Giovanni Montani et.al., [2506.13288v1](http://arxiv.org/abs/2506.13288v1)\n\n We examine a modified late-Universe dynamics where dark energy decays into dark matter, within the framework of metric $f(R)$-gravity in the Jordan frame. After a detailed analysis of the modified $\\Lambda \\text{CDM}$ model, we introduce a theoretical diagnostic tool to capture the emergence of an effective running Hubble constant as a function of redshift. We then compare this theoretical model with the 40-bin analysis of the Supernova Pantheon sample. This comparison allows us to determine the value of the additional free parameter that appears in our model, beyond those of the standard $\\Lambda \\text{CDM}$ model. Our modified late Universe dynamics provides a good-quality fit to the binned data, improving upon the previous phenomenological interpretation based on a power-law decay. However, unlike the power-law model, our approach cannot be extrapolated to the recombination redshift to match the Hubble constant measured by the Planck satellite. In fact, the dynamics resulting from the binned Pantheon sample analysis address only weakly the Hubble tension between the SH0ES and the Planck Collaboration values of the Hubble constant. Here we provide a convincing representation of the observed deviation of the cosmological dynamics from the $\\Lambda$CDM-one, as it out-stands from the low redshift observed sources.\n\n", "2506.13035": "2025-06-16, **Probing Dark Matter's Gravitational Effects Locally with TianQin**, Zheng-Cheng Liang et.al., [2506.13035v1](http://arxiv.org/abs/2506.13035v1)\n\n In this study, we explore the potential of using TianQin missions to probe the local gravitational effects of dark matter. The TianQin project plans to launch satellites at both low and high orbits. High-precision orbit determination is expected to assist in the Earth's gravity or gravitational waves detection. By comparing the derived masses in low and high orbits, it is possible to constrain the amount of dark matter between the two spheres, hence placing a local constraint on dark matter's gravity effect. Our results show the capability of TianQin in detecting the density of dark matter around Earth, with an ultimate sensitivity to a value of $10^{-8}\\,\\,{\\rm kg\\,\\,m^{-3}}$. This detection limit surpasses the estimated bounds for the solar system and the observation results for our Galaxy by approximately 7 and 14 orders of magnitude, respectively.\n\n", "2506.12907": "2025-06-15, **Revisiting the Realistic Intersecting D6-Brane Model with positive and negative μ Terms**, Imtiaz Khan et.al., [2506.12907v1](http://arxiv.org/abs/2506.12907v1)\n\n In light of current constraints from supersymmetry (SUSY) searches within the LHC, as well as findings from direct dark matter detection experiments such as LUX-ZEPLIN (LZ), we revisit the three-family Pati-Salam model derived from intersecting D6-branes in Type IIA string theory compactified on the $T^6/(\\mathbb{Z}\\_2 \\times \\mathbb{Z}\\_2)$ orientifold, known for its realistic low-energy phenomenology. Since the muon anomalous magnetic moment might be in accordance with the Standard Model prediction, we conduct a comprehensive scan over the model's parameter space for each sign of the Higgsino mass parameter, $\\mu < 0$ and $\\mu > 0$. We find that the gravitino mass is typically greater than 1.5 TeV in both scenarios while simultaneously satisfying the LHC SUSY bounds, B-physics observables, and the Higgs mass constraint. Within the experimentally viable region of the parameter space, the sparticle mass spectra fall within the following ranges: gluinos lie in the range 2-18 TeV; first- and second-generation squarks and sleptons span 3-16 TeV and 1-6 TeV, respectively. For third-generation sfermions, the lightest stop, which can satisfy the dark matter relic density via neutralino-stop coannihilation consistent with the \\textit{Planck} 5$\\sigma$ bounds, has a mass in the range 0.5-1.2 TeV. The lightest neutralino can be as heavy as 2.9 TeV. Additionally, the lightest stau can be as light as 200 GeV or as heavy as 5.2 TeV. We identify several viable mechanisms, including multiple coannihilation channels and resonance mechanisms, by which the observed dark matter relic abundance is successfully realized.\n\n", "2506.12863": "2025-06-15, **Cosmological effect of coherent oscillation of ultralight scalar fields in a multicomponent universe**, Priyanka Saha et.al., [2506.12863v1](http://arxiv.org/abs/2506.12863v1)\n\n The idea that coherent oscillations of a scalar field, oscillating over a time period that is much shorter than the cosmological timescale, can exhibit cold dark matter (CDM) like behavior was previously established. In our work we first show that this equivalence between the oscillating scalar field model and the CDM sector is exact only in a flat Friedmann-Lemaitre-Robertson-Walker (FLRW) spacetime in the absence of cosmological constant and any other possible matter components in the universe when the mass of the scalar field is very large compared to the Hubble parameter. Then we show how to generalize the equivalence between the coherently oscillating scalar field model and the CDM sector in a spatially curved universe with multiple matter components. Using our general method, we will show how a coherently oscillating scalar field model can represent the CDM sector in the presence of non-minimal coupling of the CDM sector with radiation. Our method is powerful enough to work out the dynamics of gravitational collapse in a closed FLRW spacetime where the coherently oscillating scalar field model represents the CDM sector. We have, for the first time, presented a consistent method which specifies how a coherently oscillating scalar field model, where the scalar field is ultralight, acts like the CDM sector in a multicomponent universe.\n\n"}, "supernova": {"2506.13660": "2025-06-16, **Supernova explosions of runaway stars and young neutron stars above the Galactic plane**, Vinka Dakić et.al., [2506.13660v1](http://arxiv.org/abs/2506.13660v1)\n\n Several supernova remnants and young neutron stars were recently discovered relatively high above the Galactic plane. One possibility is that they originate from runaway OB stars born in the Galactic disk. Understanding their origin will provide key insights into the properties of the Galactic halo. This paper aims to determine the spatial distribution of supernova explosions from runaway OB stars and to assess whether this model can explain certain observed neutron stars. We map the distribution of supernova events produced by runaway OB stars by incorporating their birth rate, initial spatial distribution, lifetime, ejection mechanisms, and velocity distributions. By tracking their motion in the Galactic potential, we determine their final distribution right before the explosion. We show that the neutron star Calvera, which is found at z around 2.2 kpc, could have originated from a runaway OB star. In addition, we compare the probabilities of finding a supernova remnant originating from Type Ia and core-collapse supernovae high above the Galactic plane, showing that supernova remnants related to core-collapse supernovae outnumber those related to Type Ia supernovae.\n\n", "2506.13288": "2025-06-16, **Decay of dark energy into dark matter in a metric $f(R)$ gravity: effective running Hubble constant**, Giovanni Montani et.al., [2506.13288v1](http://arxiv.org/abs/2506.13288v1)\n\n We examine a modified late-Universe dynamics where dark energy decays into dark matter, within the framework of metric $f(R)$-gravity in the Jordan frame. After a detailed analysis of the modified $\\Lambda \\text{CDM}$ model, we introduce a theoretical diagnostic tool to capture the emergence of an effective running Hubble constant as a function of redshift. We then compare this theoretical model with the 40-bin analysis of the Supernova Pantheon sample. This comparison allows us to determine the value of the additional free parameter that appears in our model, beyond those of the standard $\\Lambda \\text{CDM}$ model. Our modified late Universe dynamics provides a good-quality fit to the binned data, improving upon the previous phenomenological interpretation based on a power-law decay. However, unlike the power-law model, our approach cannot be extrapolated to the recombination redshift to match the Hubble constant measured by the Planck satellite. In fact, the dynamics resulting from the binned Pantheon sample analysis address only weakly the Hubble tension between the SH0ES and the Planck Collaboration values of the Hubble constant. Here we provide a convincing representation of the observed deviation of the cosmological dynamics from the $\\Lambda$CDM-one, as it out-stands from the low redshift observed sources.\n\n", "2506.13126": "2025-06-16, **Logarithmic and Strong Coupling Models in Weyl-Type $f(Q,T)$ Gravity**, Rahul Bhagat et.al., [2506.13126v1](http://arxiv.org/abs/2506.13126v1)\n\n In this paper, we have explored the cosmological implications of Weyl-type $f(Q,T)$ gravity, a modified gravitational theory formulated from Weyl geometry. The nonmetricity scalar $Q$ is coupled to the trace $T$ of the energy-momentum tensor. We analyze two models based on the logarithmic and strong coupling form of the function $f(Q,T)$. The corresponding field equations are then solved numerically after reformulating the system in terms of redshift. We used combined dataset from Cosmic Chronometers (CC), Pantheon$^+$ supernovae, and Baryon Acoustic Oscillations (BAO) and performed the Markov Chain Monte Carlo (MCMC) analysis to constrain the model parameters. Using the constrained parameters, the geometrical and dynamical aspects of the models are analyzed. The results successfully describe a transition from decelerated to accelerated expansion for both the models. The models mostly exhibit quintessence-like behavior and asymptotically approach the $\\Lambda$CDM scenario at late times. The calculated age of the Universe from each model aligns with constraints from Planck and stellar age data. The violation of the strong energy condition and the satisfaction of null energy condition and dominant energy conditions are shown.\n\n", "2506.13047": "2025-06-16, **Simple quintessence models in light of DESI-BAO observations**, James M. Cline et.al., [2506.13047v1](http://arxiv.org/abs/2506.13047v1)\n\n Recent analyses from the DESI collaboration suggest that the dark energy density of the Universe may be decreasing with time, slowing the acceleration of the scale factor $a$. Typically these studies are performed assuming an ansatz for the equation of state $w(a)$. In this work, we instead consider simple models of a scalar quintessence potential with linear and quadratic behavior, which could be more representative of real models than particular parametrizations of $w(a)$. We observe a significant preference for dynamical dark energy when using supernova data from DESY5 along with DESI BAO and Planck data, at the cost of slightly exacerbating the Hubble tension. However, when using supernova data from Pantheon+ or Union3, we find only a mild preference for dynamical dark energy.\n\n", "2506.13004": "2025-06-16, **New Field OB and OBe Binaries of the SMC Wing: Observational Properties and Population Modeling**, Irene Vargas-Salazar et.al., [2506.13004v1](http://arxiv.org/abs/2506.13004v1)\n\n We present a radial velocity (RV) survey of the field OB and OBe stars of the SMC Wing. We use multi-epoch observations of 55 targets obtained with the Magellan IMACS and M2FS multi-object spectrographs to identify single- and double-lined spectroscopic binaries. We also use TESS light curves to identify new eclipsing binary candidates. We find that 10 each of our 34 OB (29\\%) and 21 OBe (48\\%) stars are confirmed binaries, and at least $\\sim$ 6 more are candidates. Using our RV measurements, we set constraints on the companion masses, and in some cases, on periods, eccentricities and inclinations. The RV data suggest that OB binaries favor more circular orbits (mean eccentricity $\\langle e\\rangle = 0.08\\pm 0.02$) while OBe binaries are eccentric ($\\langle e\\rangle = 0.45\\pm 0.04$). We identify 2 candidate black hole binaries, [M2002] 77616, and 81941. We use BPASS to predict the frequencies of ejected OB and OBe stars and binaries, assuming OBe stars are binary mass gainers ejected by the companion supernova. We also predict the frequencies of black-hole, neutron-star, and stripped-star companions, and we model the distributions of primary and secondary masses, periods, eccentricities, and velocity distributions. The models are broadly consistent with the binary origin scenario for OBe stars, and predict an even larger number of post-supernova OB binaries. Comparison with the kinematics supports a significant contribution from dynamical ejections for both OB and OBe stars, although less so for binaries.\n\n", "2506.12759": "2025-06-15, **New tests of cosmic distance duality relation with DESI 2024 BAO observations**, Qiumin Wang et.al., [2506.12759v1](http://arxiv.org/abs/2506.12759v1)\n\n In this paper, we test the cosmic distance duality relation (CDDR), as required by the Etherington reciprocity theorem, which connects the angular diameter distance and the luminosity distance via the relation \\( D\\_{\\rm L}(z) = D\\_{\\rm A}(z)(1+z)^2 \\). Our analysis is based on the latest baryon acoustic oscillation (BAO) measurements provided by the Dark Energy Survey (DES), the Baryon Oscillation Spectroscopic Survey (BOSS)/Extended BOSS (eBOSS), and the Dark Energy Spectroscopic Instrument (DESI) surveys. Specifically, an unbiased test of the CDDR is performed through a novel, model-independent method inspired by the two-point diagnostic approach, with DES-SN5YR and Pantheon type Ia supernova (SN Ia) sample reconstructed using the Artificial Neural Network (ANN) technique. This methodology effectively eliminates all nuisance parameters, including the sound horizon scale \\( r\\_{\\rm d} \\) from BAO and the absolute magnitude \\( M\\_{\\rm B} \\) from SN Ia. A set of \\( N-1 \\) independent CDDR ratios \\( \\eta\\_{ij} \\) are constructed for statistical analysis. At the current observational level, no significant deviation from the CDDR is observed at low redshifts, whereas we find positive evidence ($>2\\sigma$ C.L.) of deviation from the CDDR at two high redshifts ($z=2.33$ and $z=2.334$). Therefore, our results confirm that the BAO measurement provides a powerful tool to test such fundamental relation in modern cosmology.\n\n", "2506.12709": "2025-06-15, **Constraints on Dark Energy Models Using Late Universe Probes**, Shubham Barua et.al., [2506.12709v1](http://arxiv.org/abs/2506.12709v1)\n\n We use late Universe probes - Type Ia Supernovae from the PantheonPlus compilation, Quasars, and Dark Energy Spectroscopic Instrument (DESI) Data Release 1 (DR1) BAO data - along with Cosmic Chronometers or Megamasers to constrain various dark energy parameterizations. These include the standard $\\Lambda$CDM model ($w\\_0=-1,w\\_a=0$), as well as the Chevallier-Polarski-Linder (CPL), Barboza-Alcaniz (BA), Jassal-Bagla-Padmanabhan (JBP), Exponential (EXP), and Transitional Dark Energy (TDE) parameterizations. We find that across all parameterizations, the constrained values of $w\\_0$ and $w\\_a$ remain within $(1-2)\\sigma$ of the standard $\\Lambda$CDM model, irrespective of spatial curvature, dataset combinations, or prior choices. We find from Bayesian model comparison that $\\Lambda$CDM remains the most favored model for both flat and non-flat cases, with results remaining robust under different priors. Across all dataset combinations, we reaffirm the fact that LRG1 and LRG2 data points from the DESI BAO dataset are responsible for driving the preference for dynamical dark energy.\n\n"}}