{"neutrino": {"2504.21822": "2025-04-30, **On the difficulty of capturing the distribution function of neutrinos in neutron star merger simulations**, Francois Foucart et.al., [2504.21822v1](http://arxiv.org/abs/2504.21822v1)\n\n The collision of two neutron stars is a rich source of information about nuclear physics. In particular, the kilonova signal following a merger can help us elucidate the role of neutron stars in nucleosynthesis, and informs us about the properties of matter above nuclear saturation. Approximate modeling of neutrinos remains an important limitation to our ability to make predictions for these observables. Part of the problem is the fermionic nature of neutrinos. By the exclusion principle, the expected value $f\\_\\nu$ for the number of neutrinos in a quantum state is at most 1. Any process producing neutrinos is suppressed by a blocking factor $(1-f\\_\\nu)$. Recent simulations focused on neutrino physics mostly use a gray two-moment scheme to evolve neutrinos. This evolves integrals of $f\\_\\nu$ over momentum space, preventing direct calculations of blocking factors. Monte Carlo methods may be an attractive alternative, providing access to the full distribution of neutrinos. Their current implementation is however inadequate to estimate $f\\_\\nu$: in our most recent simulations, a single Monte Carlo packet causes, in the worst cases, estimates of $f\\_\\nu$ to jump from $f\\_\\nu=0$ to $f\\_\\nu\\sim 10^5$. While this is concerning, this brazen violation of the fermionic nature of neutrinos has been largely inconsequential as the interactions used in simulations avoid direct calculations of $f\\_\\nu$. We are however reaching a level of modeling at which this problem can no longer be ignored. Here, we discuss the relatively simple origin of this issue. We then show that very rough estimates of $f\\_\\nu$ can in theory be obtained in merger simulations, but that they will require a combination of unintuitive weighting schemes for Monte Carlo packets and smoothing of the neutrino distribution at coarser resolution than what the merger simulation uses.\n\n", "2504.21813": "2025-04-30, **Turning a negative neutrino mass into a positive optical depth**, Tanisha Jhaveri et.al., [2504.21813v1](http://arxiv.org/abs/2504.21813v1)\n\n Under $\\Lambda$CDM, recent baryon acoustic oscillation (BAO) distance measures from DESI, which favor a low matter density $\\Omega\\_m$, are in moderate $2-3\\sigma$ tension with cosmic microwave background (CMB) observations. This tension appears alternately as a preference for the sum of neutrino masses dropping below the $\\sum m\\_\\nu = 0.06$eV value required by neutrino oscillation measurements to formally negative values; a discrepant value of $\\Omega\\_m$ at 0.06eV; or preference for dynamical dark energy beyond $\\Lambda$CDM. We show that this tension largely arises from the CMB lensing constraints on the calibration of the sound horizon for geometric measurements and relies on the measurement of the reionization optical depth $\\tau$ from large-angle CMB polarization to set the lensing amplitude. Dropping these constraints removes the neutrino tension at $\\sum m\\_\\nu=0.06$eV entirely, favoring $\\tau = 0.091\\pm 0.011$ in $\\Lambda$CDM. Beyond $\\Lambda$CDM, it brings the preference for $w\\_0-w\\_a$ dynamical dark energy to below $95\\%$ CL. We explore the freedom in interpreting the low-$\\ell$ EE polarization constraint due to analysis choices and reionization modeling beyond the standard step-function assumption and find that this drops the neutrino tension in $\\Lambda$CDM to below $95\\%$ CL. Alternately, this raising of $\\tau$ can also be achieved by the same reduction in large-scale curvature fluctuations that also ameliorates the low-$\\ell$ temperature anomaly.\n\n", "2504.21701": "2025-04-30, **Leptogenesis, $0νββ$ and lepton flavor violation in modular left-right asymmetric model with polyharmonic $Maaβ$ forms**, Bhabana Kumar et.al., [2504.21701v1](http://arxiv.org/abs/2504.21701v1)\n\n In the absence of supersymmetry, modular forms need not be holomorphic functions of the modulus $\\tau$. Using this idea, we construct a non-supersymmetric framework using polyharmonic $Maa\\beta$ forms. In this approach, the Yukawa coupling is no longer strictly holomorphic in $\\tau$ but instead incorporates both holomorphic and non-holomorphic components. We realize a non-supersymmetric, left-right asymmetric model based on the $\\Gamma\\_3$ modular group, where the active neutrino masses are generated via an extended inverse seesaw mechanism. The model successfully predicts the sum of neutrino masses below the current experimental bound and accommodates neutrino mixing angles within the $3\\sigma$ range. Given its strong predictive power in neutrino oscillation parameters, we further explore its implications for beyond Standard Model (BSM) phenomena, including neutrinoless double beta ($0\\nu\\beta\\beta$) decay, lepton flavor violation (LFV), and baryogenesis via leptogenesis (BAU). Our findings indicate that the model predicts an effective Majorana mass and LFV branching ratios consistent with experimental constraints while also providing a viable explanation for the observed baryon asymmetry through resonant leptogenesis.\n\n", "2504.21560": "2025-04-30, **Plausible Indication of Gamma-Ray Absorption by Dark Matter in NGC 1068**, Gonzalo Herrera et.al., [2504.21560v1](http://arxiv.org/abs/2504.21560v1)\n\n NGC 1068 is the brightest extragalactic source in high-energy neutrinos as seen by IceCube, yet the accompanying gamma-ray flux is orders of magnitude weaker. It has been argued that this indicates that the bulk of neutrinos and gamma rays are emitted in the innermost vicinity of the central supermassive black hole, which is transparent to neutrinos, but opaque to gamma rays. Even in such extreme scenarios for the acceleration of cosmic rays, astrophysical models typically overestimate the low-energy gamma-ray flux and/or require some fine-tuning in the physical parameters. Here we suggest instead that the dark matter surrounding the supermassive black hole may absorb the gamma rays, inducing the observed deficit. We show that for a dark matter-photon scattering cross section in the range $\\sigma\\_{\\rm DM-\\gamma}/m\\_{\\rm DM} \\simeq 10^{-28}-10^{-30}$ cm$^2$/GeV, Fermi-LAT measurements can be well reconciled with IceCube data. We also present some simple particle physics examples that achieve the correct spectral energy dependence while respecting complementary constraints.\n\n", "2504.21404": "2025-04-30, **A radiative neutrino mass model with leptoquarks under non-holomorphic modular $A_4$ symmetry**, Takaaki Nomura et.al., [2504.21404v1](http://arxiv.org/abs/2504.21404v1)\n\n We investigate a radiative seesaw model with two leptoquarks under non-holomorphic modular $A\\_4$ symmetry. The leptons and quarks belong to non-trivial representations of the modular $A\\_4$ and the structures of their mass matrices are restricted. Neutrino masses are generated at one-loop level via leptoquark inside loop diagram where structures of relevant Yukawa interactions are determined by the modular $A\\_4$ symmetry. We scan the free parameters in the model and try to fit all the observed data for both lepton and quark sectors. For allowed parameters, we show some predictions regarding neutrino observables such as sum of neutrino mass and neutrinoless double beta decay.\n\n", "2504.21110": "2025-04-29, **The frozen vanilla model: Exploring dark sector interactions with delta effective theories**, Martín G. Richarte et.al., [2504.21110v1](http://arxiv.org/abs/2504.21110v1)\n\n In this paper, we introduce a new interacting mechanism within the dark sector, encompassing both dark energy and dark matter, while grounding our analysis in the familiar framework of the $\\mathrm{\\Lambda CDM}$ model augmented by baryons and radiation components, including photons and neutrinos. The interaction between dark energy and dark matter is confined to the perturbative level. One significant advantage of this proposal is that all geometric probes yield constraints consistent with the so-called vanilla model or the extended vanilla model, where dark energy has a constant equation of state, $w\\_{x}$. However, the introduction of this new interacting mechanism affects several theoretical signatures, involving contrast dark matter and dark energy densities. We perform an exploratory analysis of those effects in the CMB power spectra, matter-power spectra, and redshift space distortions. For instance, it allows for a decrease/increment in the integrated Sachs-Wolfe (ISW) effect depending on the value taken by the interaction coupling. This effect could be observationally detected by looking for a cross-correlation between the ISW temperature fluctuations and the distribution of galaxies or quasars. At late times, the interaction in the dark sector becomes very effective, affecting the non-linear scale of structure formation. We discuss how the estimators $f\\sigma\\_{8}(z)$ and $S\\_{8}(z)$ are affected by different interacting couplings; indicating that $f\\sigma\\_{8}(z)$ can show a relative change of up to $15\\%$ compared to the concordance model at low redshifts. Finally, we show how the various terms in the dark energy pressure perturbation (both adiabatic and non-adiabatic) are relevant for different scales, demonstrating the absence of large-scale instabilities.\n\n", "2504.21083": "2025-04-29, **Neutrino-antineutrino synchrotron emission from magnetized dense quark matter**, Ritesh Ghosh et.al., [2504.21083v1](http://arxiv.org/abs/2504.21083v1)\n\n Using the Kadanoff--Baym formalism, we perform a detailed study of neutrino-antineutrino synchrotron emission from strongly magnetized, dense quark matter under conditions relevant to compact stars. Starting from an exact expression for the emission rate that fully accounts for Landau-level quantization of quarks, we derive an approximate formula applicable in the regime where quark chemical potentials are much larger than all other relevant energy scales. We demonstrate that the emission rate is largely controlled by a single dimensionless ratio between two low-energy scales: the Landau-level spacing at the Fermi surface, $\\|e\\_f B\\|/\\mu\\_{f}$, and the temperature of the quark matter, $T$. When the ratio $\\|e\\_f B\\|/(\\mu\\_{f} T)$ is small, many closely spaced Landau levels contribute to the emission. In the opposite limit, when the ratio is large, the rate is dominated by transitions between adjacent levels and is exponentially suppressed. Our results show that, even in the presence of the strongest magnetic fields expected in compact stars, the synchrotron emission remains suppressed by more than three orders of magnitude compared to the direct Urca process. This implies that such emission is unlikely to play any substantial role in the cooling of magnetized quark stars, at least those made of unpaired quark matter phases.\n\n", "2504.20960": "2025-04-29, **MINER Reactor Based Search for Axion-Like Particles Using Sapphire (Al2O3) Detectors**, M. Mirzakhani et.al., [2504.20960v1](http://arxiv.org/abs/2504.20960v1)\n\n The absence of definitive results for WIMP dark matter has sparked growing interest in alternative dark matter candidates, such as axions and Axion-Like Particles (ALPs), which also provide insight into the strong CP problem. The Mitchell Institute Neutrino Experiment at Reactor (MINER), conducted at the Nuclear Science Center of Texas A&M University, investigated ALPs near a 1 MW TRIGA nuclear reactor core, positioned approximately 4 meters away. This experiment employed cryogenic sapphire detectors with a low detection threshold (approximately 100 eV), equipped with a Transition Edge Sensor capable of detecting athermal phonons. Due to the low-background environment, we were able to exclude ALPs with axion-photon coupling and axion-electron coupling as small as \\(g\\_{a\\gamma\\gamma} = 10^{-5}\\) and \\(g\\_{aee} = 10^{-7}\\), respectively. Energy depositions below 3 keV were not considered and remain blinded for our Coherent Elastic Neutrino Nucleus Scattering (CEvNS) analysis. This is the first result demonstrating the MINER experiment's potential to probe low-mass ALPs, enabled by its low-threshold detector and proximity to a reactor.\n\n", "2504.21050": "2025-04-29, **High-Precision Physics Experiments at Huizhou Large-Scale Scientific Facilities**, FengPeng An et.al., [2504.21050v1](http://arxiv.org/abs/2504.21050v1)\n\n In response to the capabilities presented by the High-Intensity Heavy Ion Accelerator Facility (HIAF) and the Accelerator-Driven Subcritical System (CiADS), as well as the proposed Chinese Advanced Nuclear Physics Research Facility (CNUF), we are assembling a consortium of experts in relevant disciplines--both domestically and internationally--to delineate high-precision physics experiments that leverage the state-of-the-art research environment afforded by CNUF. Our focus encompasses six primary domains of inquiry: hadron physics--including endeavors such as the super eta factory and investigations into light hadron structures; muon physics; neutrino physics; neutron physics; the testing of fundamental symmetries; and the exploration of quantum effects within nuclear physics, along with the utilization of vortex accelerators. We aim to foster a well-rounded portfolio of large, medium, and small-scale projects, thus unlocking new scientific avenues and optimizing the potential of the Huizhou large scientific facility. The aspiration for international leadership in scientific research will be a guiding principle in our strategic planning. This initiative will serve as a foundational reference for the Institute of Modern Physics in its strategic planning and goal-setting, ensuring alignment with its developmental objectives while striving to secure a competitive edge in technological advancement. Our ambition is to engage in substantive research within these realms of high-precision physics, to pursue groundbreaking discoveries, and to stimulate progress in China's nuclear physics landscape, positioning Huizhou as a preeminent global hub for advanced nuclear physics research.\n\n", "2504.20338": "2025-04-29, **Positive neutrino masses with DESI DR2 via matter conversion to dark energy**, S. Ahlen et.al., [2504.20338v1](http://arxiv.org/abs/2504.20338v1)\n\n The Dark Energy Spectroscopic Instrument (DESI) is a massively parallel spectroscopic survey on the Mayall telescope at Kitt Peak, which has released measurements of baryon acoustic oscillations determined from over 14 million extragalactic targets. We combine DESI Data Release 2 with CMB datasets to search for evidence of matter conversion to dark energy (DE), focusing on a scenario mediated by stellar collapse to cosmologically-coupled black holes (CCBH). In this physical model, which has the same number of free parameters as $\\Lambda$CDM, DE production is determined by the cosmic star formation rate density (SFRD), allowing for distinct early- and late-time cosmologies. Using two SFRDs to bracket current observations, we find that the CCBH model: accurately recovers the cosmological expansion history, agrees with early-time baryon abundance measured by BBN, reduces tension with the local distance ladder, and relaxes constraints on the summed neutrino mass $\\sum m\\_\\nu$. For these SFRDs, we find a peaked positive $\\sum m\\_\\nu < 0.149\\,\\rm eV$ (95\\% confidence) and $\\sum m\\_\\nu = 0.106^{+0.050}\\_{-0.069}\\,\\rm eV$ respectively, in good agreement with lower limits from neutrino oscillation experiments. A peak in $\\sum m\\_\\nu > 0$ results from late-time baryon consumption in the CCBH scenario and is expected to be a general feature of any model that converts sufficient matter to dark energy during and after reionization.\n\n"}, "dark matter": {"2504.21843": "2025-04-30, **Accretion inside astrophysical objects : Effects of rotation and viscosity**, H. A. Adarsha et.al., [2504.21843v1](http://arxiv.org/abs/2504.21843v1)\n\n Sub-solar mass black holes could show up in gravitational observations in future and near-solar mass black holes might have been involved in the events GW190425 and GW190814. Since they cannot form from the stellar evolution, their creation requires exotic mechanisms. One such mechanism involves the capture of dark matter particles by stellar objects and their thermalization. When the criterion for the collapse of these dark matter particles is satisfied, a tiny endoparasitic black hole (EBH) forms and then it accretes matter from the host. The EBH may transmute the host into a black hole of nearly the same mass as the host or lesser, depending on the type of accretion. We examine this complex and poorly explored accretion mechanism, considering the effects of rotation and viscosity but ignoring some other effects, such as those of pressure and magnetic field, as the first step. Using a general framework to assess the effects of rotation and viscosity on accretion, we show that the accretion could be stalled in some white dwarfs, but not in neutron stars. The stalled accretion should cause an opening in the host's polar regions, the extent of which depends on the mass and spin of the host.\n\n", "2504.21593": "2025-04-30, **Dark-technicolour at colliders**, Gauhar Abbas et.al., [2504.21593v1](http://arxiv.org/abs/2504.21593v1)\n\n By employing the extended most attractive channel hypothesis, we show that QCD-like gauge dynamics is possible in the dark-technicolour paradigm. The dark-technicolour paradigm can produce the mass of the Higgs boson, and at the same time, the $S$-parameter is also satisfied. Moreover, the dark-technicolour paradigm can provide a solution of the flavour problem by accommodating the standard HVM or the Froggatt-Nielsen mechanism within its framework. We present the inclusive collider signatures, such as $t\\bar{t}$ and $\\gamma \\gamma$, of the lowest lying scalars and pseudoscalars of the dark-technicolour paradigm, for the scenarios, when the standard HVM or the Froggatt-Nielsen mechanism are implemented within its framework. The collider signatures are investigated at the high-luminosity Large Hadron Collider, the high-energy Large Hadron Collider, and a 100 TeV future hadron collider. Several signatures are within the reach of the high-luminosity Large Hadron Collider. Additionally, one of the dark-Higgs of the model can address $95.4$ GeV excess reported by the ATLAS and CMS experiments. Furthermore, one of the dark-Higgs can act like a new class of chirality-dependent dark-matter particles.\n\n", "2504.21481": "2025-04-30, **Evidence for Dynamical Dark Matter**, Deng Wang et.al., [2504.21481v1](http://arxiv.org/abs/2504.21481v1)\n\n The nature of dark matter is one of the most fundamental questions in cosmology. Using the cosmic microwave background (CMB), type Ia supernova (SN) and DESI's new measurements of baryon acoustic oscillations (BAO), we find the robust $\\sim2\\,\\sigma$ evidences of the evolution of dark matter in the dynamical dark matter (DDM) model, $\\omega\\_{dm}(a)=\\omega\\_{dm0}+\\omega\\_{dma}(1-a)$. Based on CMB data, we find a very strong linear relation $\\omega\\_{dma}=-\\omega\\_{dm0}$, inducing the single-parameter DDM model, $\\omega\\_{dm}(a)=\\omega\\_{dm}a$, where the $\\sim2\\,\\sigma$ DDM evidences is well captured and even strengthened. We demonstrate that there are beyond $2\\,\\sigma$ evidences of the coexistence of DDM and dynamical dark energy using the combinations of CMB, DESI BAO and Pantheon+ SN data. In such models, at a beyond $5\\,\\sigma$ confidence level, we verify that the universe remains in a matter-dominated state for a substantial period in the past, accelerate in the distant future and finally becomes completely dominated by dark matter. We propose that the ultimate fate of the universe is the ``Super Rip'' induced by dark matter with an extremely negative pressure. Our findings fundamentally challenge the prevailing understanding of cosmic acceleration and deepen our insight into the universe's evolution.\n\n", "2504.21320": "2025-04-30, **Towards model-independent identification of lensed gravitational waves using Kramers-Kronig relation**, So Tanaka et.al., [2504.21320v1](http://arxiv.org/abs/2504.21320v1)\n\n Observations of microlensed gravitational waves (GWs) emanated by compact binary coalescences (CBCs) are essential for studying the mass density distribution in the universe, including black holes and dark matter halos. However, no confident detection of microlensed GWs have been reported to date. There are two important challenges in the identification of microlensed GWs. The first is that the source waveform and lens structure models are not known a-priori. The second is that certain classes of unlensed GWs could mimic microlensed GWs, resulting in undesirable false alarms. In this work, we propose to use the Kramers-Kronig relation for gravitational lensing systems. We argue that such systems are essentially linear response systems obeying causality, where KK relation must hold. The power of this method lies in the fact that microlensed GWs, regardless of the lens structure, must obey KK relation, while unlensed GW events are not in general expected to obey it. This, in principle, allows us to identify microlensed GWs while dismissing microlensing mimickers. We provide the first important steps towards a methodology that exploits KK relation, and test its usefulness under idealized conditions.\n\n", "2504.21301": "2025-04-30, **Reevaluating UMa3/U1: star cluster or the smallest known galaxy?**, Scot Devlin et.al., [2504.21301v1](http://arxiv.org/abs/2504.21301v1)\n\n Ursa Major III/UNIONS 1 (UMa3/U1) is the faintest Milky Way satellite discovered to date, exhibiting a half-light radius of 3 $\\pm$ 1 pc and an absolute V-band magnitude of +2.2 $\\pm$ 0.4. Previous studies suggest UMa3/U1 is a dwarf galaxy, based on its large internal velocity dispersion and the improbability (indicated by dynamical cluster simulations) of its long-term survival if it were a dark-matter-free star cluster. In this paper, we model the evolution of UMa3/U1 as a star cluster using collisional N-body simulations that include a description of stellar evolution and the external tidal field of the Milky Way, with some simulations including primordial binaries. We find that UMa3/U1 has a substantial remaining lifetime of 2.7 $\\pm$ 0.4 Gyr, primarily due to the retention of compact stellar remnants within the cluster. This retention is facilitated by mass segregation and the preferential loss of low-mass stars. Furthermore, we demonstrate that the observed large velocity dispersion of UMa3/U1 can be successfully reproduced. These results support the possibility that UMa3/U1 is a self-gravitating star cluster. Our simulations reveal that modelling UMa3/U1 as a dark matter free star cluster produces a markedly altered present-day mass function, driven by a strong depletion of low-mass stars. However, the degree of mass segregation among the visible stars is not statistically significant. We therefore recommend that future observations of UMa3/U1 and other very small Milky Way satellites focus on measuring their present-day mass functions to determine their nature.\n\n", "2504.21273": "2025-04-30, **Interplay of $95$ GeV Diphoton Excess and Dark Matter in Supersymmetric Triplet Model**, Zetian Li et.al., [2504.21273v1](http://arxiv.org/abs/2504.21273v1)\n\n The decay of the Higgs boson and the nature of dark matter remain fundamental challenges in particle physics. We investigate the $95$ GeV diphoton excess and dark matter within the framework of the triplet-extended Minimal Supersymmetric Standard Model (TMSSM). In this model, an additional Hypercharge $Y=0$, $SU(2)\\_L$ triplet superfield is introduced. Mixing between the triplet and doublet Higgs states enhances the diphoton signal strength of the $95$ GeV Higgs boson, resulting in $\\mu\\_{\\gamma\\gamma}^{\\text{CMS+ATLAS}} = 0.24\\_{-0.08}^{+0.09}$, which is consistent with experimental observations. This enhancement arises primarily from charged Higgs loop contributions. Additionally, the model accommodates viable dark matter candidates in the form of a bino-dominated neutralino. The relic density is reduced to the observed value through resonance-enhanced annihilation via the Higgs portal or co-annihilation with the triplino or higgsino. This reduction remains consistent with constraints from direct and indirect detection experiments. A comprehensive parameter scan demonstrates that the TMSSM can simultaneously explain the $95$ GeV diphoton excess, the observed $125$ GeV Higgs mass, and the dark matter relic density, establishing a compelling and theoretically consistent framework.\n\n", "2504.21232": "2025-04-29, **Search for black hole super-radiance using gravito-optic hetrodyne detection**, Eduard Atonga et.al., [2504.21232v1](http://arxiv.org/abs/2504.21232v1)\n\n Gravitational-wave astronomy plays a crucial role in early universe cosmology, dark matter detection, and black-hole merger studies. It is shown here that the heterodyne detection of the gravito-optic effect (employing an enhanced Fabry-P\\'erot cavity) presents a novel broad band approach to gravitational wave detection, with favorable length and frequency scalings. It is demonstrated that such a device is well suited for detecting gravitational waves generated by the annihilation of bosons around black holes, enabling the exploration of a mass range from \\( 2.40 \\times 10^{-12} \\, \\mathrm{eV} \\) to \\( 4.54 \\times 10^{-7} \\, \\mathrm{eV} \\). Furthermore, due to the unique coherent nature of gravitational waves generated by boson annihilation any coherent gravitational waves detected above \\( 1.23 \\times 10^5 \\, \\mathrm{Hz} \\) may be indicative of the existence of black holes of primordial origin.\n\n", "2504.21134": "2025-04-29, **DeepVoid: A Deep Learning Void Detector**, Sam Kumagai et.al., [2504.21134v1](http://arxiv.org/abs/2504.21134v1)\n\n We present DeepVoid, an application of deep learning trained on a physical definition of cosmic voids to detect voids in density fields and galaxy distributions. By semantically segmenting the IllustrisTNG simulation volume using the tidal tensor, we train a deep convolutional neural network to classify local structure using a U-Net architecture for training and prediction. The model achieves a void F1 score of 0.96 and a Matthews correlation coefficient over all structural classes of 0.81 for dark matter particles in IllustrisTNG with interparticle spacing of $\\lambda=0.33 h^{-1} \\text{Mpc}$. We then apply the machine learning technique of curricular learning to enable the model to classify structure in data with significantly larger intertracer separation. At the highest tracer separation tested, $\\lambda=10 h^{-1} \\text{Mpc}$, the model achieves a void F1 score of 0.89 and a Matthews correlation coefficient of 0.6 on IllustrisTNG subhalos.\n\n", "2504.20857": "2025-04-29, **MIGHTEE-HI: The radial acceleration relation with resolved stellar mass measurements**, Andreea Varasteanu et.al., [2504.20857v1](http://arxiv.org/abs/2504.20857v1)\n\n The radial acceleration relation (RAR) is a fundamental relation linking baryonic and dark matter in galaxies by relating the observed acceleration derived from dynamics to the one estimated from the baryonic mass. This relation exhibits small scatter, thus providing key constraints for models of galaxy formation and evolution -- allowing us to map the distribution of dark matter in galaxies -- as well as models of modified dynamics. However, it has only been extensively studied in the very local Universe with largely heterogeneous samples. We present a new measurement of the RAR, utilising a homogeneous, unbiased sample of H{\\sc i}-selected galaxies. We introduce a novel approach of measuring resolved stellar masses using spectral energy distribution (SED) fitting across 10 photometric bands to determine the resolved mass-to-light ratio, which we show is essential for measuring the acceleration due to baryons in the low-acceleration regime. We find that the stellar mass-to-light ratio varies across galaxies and radially, favouring lower mass-to-light ratios compared to previous studies. Our results reveal a tight RAR with a low-acceleration power-law slope of $\\sim 0.5$, consistent with previous studies. Adopting a spatially varying mass-to-light ratio yields the tightest RAR with an intrinsic scatter of only $0.045 \\pm 0.022$ dex. We also find the first tentative evidence for redshift evolution in the acceleration scale, but more data will be required to confirm this. These results highlight the importance of resolved stellar mass measurements in accurately characterizing the gravitational contribution of the baryons in low-mass, gas-rich galaxies.\n\n", "2504.20825": "2025-04-29, **Numerical Relativity Simulations of Dark Matter Admixed Binary Neutron Stars**, Edoardo Giangrandi et.al., [2504.20825v1](http://arxiv.org/abs/2504.20825v1)\n\n Binary neutron star mergers provide insight into strong-field gravity and the properties of ultra-dense nuclear matter. These events offer the potential to search for signatures of physics beyond the standard model, including dark matter. We present the first numerical-relativity simulations of binary neutron star mergers admixed with dark matter, based on constraint-solved initial data. Modeling dark matter as a non-interacting fermionic gas, we investigate the impact of varying dark matter fractions and particle masses on the merger dynamics, ejecta mass, post-merger remnant properties, and the emitted gravitational waves. Our simulations suggest that the dark matter morphology - a dense core or a diluted halo - may alter the merger outcome. Scenarios with a dark matter core tend to exhibit a higher probability of prompt collapse, while those with a dark matter halo develop a common envelope, embedding the whole binary. Furthermore, gravitational wave signals from mergers with dark matter halo configurations exhibit significant deviations from standard models when the tidal deformability is calculated in a two-fluid framework. This highlights the need for refined models in calculating the tidal deformability when considering mergers with extended dark matter structures. These initial results provide a basis for further exploration of dark matter's role in binary neutron star mergers and their associated gravitational wave emission and can serve as a benchmark for future observations from advanced detectors and multi-messenger astrophysics.\n\n", "2504.20765": "2025-04-29, **MUSE observations of dwarf galaxies and a stellar stream in the M83 group**, Oliver Müller et.al., [2504.20765v1](http://arxiv.org/abs/2504.20765v1)\n\n Spectroscopy for faint dwarf galaxies outside of our own Local Group is challenging. Here, we present MUSE spectroscopy to study the properties of four known dwarf satellites and one stellar stream (KK208) surrounding the nearby grand spiral M83, which resides together with the lenticular galaxy Cen A in the Centaurus group. This data complete the phase-space information for all known dwarf galaxies around M83 down to a completeness of $-$10 mag in the $V$ band. All studied objects have an intermediate to old and metal-poor stellar population and follow the stellar luminosity-metallicity relation as defined by the Local Group dwarfs. For the stellar stream we serendipitously identify a previously unknown globular cluster, which is old and metal-poor. Two dwarf galaxies (NGC5264 and dw1341-29) may be a bound satellite of a satellite system due to their proximity and shared velocities. Having access to the positions and velocities of 13 dwarfs around M83, we estimate the mass of the group with different estimators. Ranging between 1.3 and $3.0 \\times 10^{12}$ M$\\_\\odot$ for the halo mass we find it to be larger than previously assumed. This may impact the previously reported tension for cold dark matter cosmology with the count of dwarf galaxies. In contrast to Cen A, we do not find a co-rotating plane-of-satellites around M83.\n\n"}, "supernova": {"2504.21725": "2025-04-30, **New {\\em ab initio} constrained extended Skyrme equations of state for simulations of neutron stars, supernovae and binary mergers: I. Subsaturation density domain**, Adriana R. Raduta et.al., [2504.21725v1](http://arxiv.org/abs/2504.21725v1)\n\n In numerical simulations of core-collapse supernova and binary neutron stars mergers information about the energetics and composition of matter is implemented via external tables covering the huge ranges of thermodynamic conditions explored during the astrophysical evolution. More than 120 general purpose equation of state tables have been contributed so far. Not all of them comply with current constraints from theoretical and experimental nuclear physics and astrophysical observations of neutron stars. Systematic investigations of the role that dense matter properties play in the evolution of these astrophysical phenomena require that more equation of state tables are provided. We build a set of general purpose equation of state tables. At zero temperature, they comply with all currently accepted constraints, including ab initio chiral effective field theory calculations of pure neutron and symmetric nuclear matter. This set is designed to explore a wide variety of the behaviors of the effective masses as functions of density, which is reflected into a wide range of thermal behaviors. We employ Brussels extended Skyrme interactions generated by means of Bayesian inference techniques. An extended nuclear statistical equilibrium model is developed for modeling sub-saturated inhomogeneous nuclear matter. We study the properties of sub-saturated inhomogeneous nuclear matter over wide ranges of density, temperature and proton fraction. We analyze the mechanisms of transition to homogeneous matter and estimate the transition density. Our key results include the presence of a think $^{14}$He layer in the inner crusts of (neo-)neutron stars, significant abundance of other exotic isotopes of H and He in warm and neutron rich matter and a detailed study of the thermodynamic stability of cold stellar matter. The equation of state tables will be publicly available in the Compose online database.\n\n", "2504.21481": "2025-04-30, **Evidence for Dynamical Dark Matter**, Deng Wang et.al., [2504.21481v1](http://arxiv.org/abs/2504.21481v1)\n\n The nature of dark matter is one of the most fundamental questions in cosmology. Using the cosmic microwave background (CMB), type Ia supernova (SN) and DESI's new measurements of baryon acoustic oscillations (BAO), we find the robust $\\sim2\\,\\sigma$ evidences of the evolution of dark matter in the dynamical dark matter (DDM) model, $\\omega\\_{dm}(a)=\\omega\\_{dm0}+\\omega\\_{dma}(1-a)$. Based on CMB data, we find a very strong linear relation $\\omega\\_{dma}=-\\omega\\_{dm0}$, inducing the single-parameter DDM model, $\\omega\\_{dm}(a)=\\omega\\_{dm}a$, where the $\\sim2\\,\\sigma$ DDM evidences is well captured and even strengthened. We demonstrate that there are beyond $2\\,\\sigma$ evidences of the coexistence of DDM and dynamical dark energy using the combinations of CMB, DESI BAO and Pantheon+ SN data. In such models, at a beyond $5\\,\\sigma$ confidence level, we verify that the universe remains in a matter-dominated state for a substantial period in the past, accelerate in the distant future and finally becomes completely dominated by dark matter. We propose that the ultimate fate of the universe is the ``Super Rip'' induced by dark matter with an extremely negative pressure. Our findings fundamentally challenge the prevailing understanding of cosmic acceleration and deepen our insight into the universe's evolution.\n\n", "2504.21408": "2025-04-30, **The maximum mass and rotational kinetic energy of rapidly rotating neutron stars**, Shao-Peng Tang et.al., [2504.21408v1](http://arxiv.org/abs/2504.21408v1)\n\n Rapid uniformly-rotating neutron stars are expected to be formed for instance in the collapse of some massive stars, the accretion of some compact object binaries, and some double neutron star mergers. The huge amount of the rotational energy has been widely believed to be the source of some cosmic gamma-ray bursts and superluminous supernovae. Benefited from the tight constraints on the equation of state of the neutron star matter set by the latest multi-messenger data, the chiral effective field theory ($\\chi$EFT) and perturbative quantum chromodynamics (pQCD), here we present the maximum gravitational mass as well as the kinetic rotational energy for a neutron star at a given spin period. Our nonparametric EOS analysis reveals that the critical Keplerian configurations ($\\Omega\\_{\\rm kep}^{\\rm crit}=1.00\\pm0.07\\times 10^{4}~ {\\rm rad/s}$) can sustain maximum gravitational masses of $M\\_{\\rm kep}^{\\rm crit}=2.76^{+0.11}\\_{-0.09} M\\_\\odot$ with corresponding rotational energy reaching $E\\_{\\rm rot,kep}^{\\rm crit}=2.38^{+0.25}\\_{-0.24}\\times 10^{53}$. However, the maximum rotational energy that can be feasibly extracted from a neutron star is limited to $1.40^{+0.15}\\_{-0.13}\\times 10^{53}$ erg, which holds for a baryon mass of $2.68^{+0.10}\\_{-0.09}M\\_\\odot$. All these parameters, obtained via the nonparametric reconstruction of the equation of state, are at the $68.3\\%$ confidence level and the adoption of a quarkonic model yields rather similar results. These findings are found to have already set some intriguing constraints on the millisecond magnetar interpretation of some exciting data.\n\n", "2504.21373": "2025-04-30, **Dynamical Dark Energy in the Crosshairs: A Joint Analysis with DESI, Pantheon plus, and TDCOSMO Constraints**, Tonghua Liu et.al., [2504.21373v1](http://arxiv.org/abs/2504.21373v1)\n\n The cosmological tensions between early- and late-Universe probes, particularly the Hubble tension ($H\\_0$) and $S\\_8$ discrepancy, challenge the validity of the standard ${\\rm{\\Lambda}CDM}$ model. Motivated by these tensions, we perform a comprehensive joint analysis of three representative dark energy models - ${\\rm{\\Lambda}CDM}$, the Chevallier-Polarski-Linder (CPL) parametrization, and the Phenomenologically Emergent Dark Energy (PEDE) model - using the latest observational datasets: baryon acoustic oscillation (BAO) measurements from DESI Data Releases 1 and 2 (DR1/DR2), the Pantheon Plus sample of Type Ia supernovae (SNe Ia), and time-delay cosmography from TDCOSMO lensing. Our multi-probe approach breaks key degeneracies among cosmological parameters ($H\\_0$, $r\\_d$, and $M\\_B$) and provides robust constraints on dark energy dynamics. The CPL model yields a statistically significant improvement over ${\\rm{\\Lambda}CDM}$, with $\\Delta \\chi^2 \\approx -3.6$ for DESI DR2+Pantheon Plus+TDCOSMO, favoring a quintessence-like behavior ($w\\_0=-0.87^{+0.045 }\\_{-0.045} $, $w\\_a=-0.41^{+ 0.28}\\_{-0.28}$ at 1$\\sigma$ confidence level). In contrast, the PEDE model exhibits severe tension with observations, yielding $\\Delta \\chi^2 \\approx +53.1$ (DR1) and $\\Delta \\chi^2 \\approx +132.3$ (DR2), despite its potential to marginally alleviate the $H\\_0$ tension. DESI DR2 tightens constraints on dynamical dark energy by $\\sim$40\\%, reinforcing evidence for redshift-evolving $w(z)$. Remarkably, our results demonstrate that such data combination can achieve precision comparable to Planck CMB measurements for dynamical dark energy studies, while offering complementary advantages in probing the late-time universe. This synergy between different observational data significantly enhances our ability to constrain dark energy properties.\n\n", "2504.21129": "2025-04-29, **Cosmological-model independent limits on photon mass from FRB and SNe data**, Thais Lemos et.al., [2504.21129v1](http://arxiv.org/abs/2504.21129v1)\n\n Electromagnetic emissions from astrophysical sources at cosmological distances can be used to estimate the photon mass, $m\\_{\\gamma}$. In this paper, we combine measurements of the dispersion measure ($\\mathrm{DM}$) of fast radio bursts (FRB) with the luminosity distance from type Ia supernovae (SNe) to investigate update constraints on the photon rest mass. We derive the expression of $\\mathrm{DM}$ dependence concerning a non-vanishing photon mass from a cosmological-model independent approach and constrain the parameter $m\\_{\\gamma}$ from measurements of 68 well-localized FRBs and 1048 SNe data from the Pantheon compilation. We consider two scenarios for the baryon fraction in the intergalactic medium ($f\\_{\\mathrm{IGM}}$): one where the value is fixed according to recent reports and another where it is treated as a free parameter, $f\\_{\\mathrm{IGM}} = f\\_{\\mathrm{IGM,0}}$. In the latter case, we find $m\\_{\\gamma} = (29.4\\_{-15.5}^{+5.80}) \\times 10^{-51}$ kg, at $1\\sigma$ level. Our results also demonstrate an anticorrelation between $f\\_{\\mathrm{IGM}}$ and $m\\_{\\gamma}$, which highlights the importance of analyzing a larger sample of FRBs for a more comprehensive understanding of their properties.\n\n", "2504.21096": "2025-04-29, **Search for the Optical Counterpart of Einstein Probe Discovered Fast X-ray Transients from Lulin Observatory**, Amar Aryan et.al., [2504.21096v1](http://arxiv.org/abs/2504.21096v1)\n\n The launch of the Einstein Probe (EP) mission has revolutionized the detection and follow-up observations of fast X-ray transients (FXTs) by providing prompt and timely access to their precise localizations. In the first year of its operation, the EP mission reports the discovery of 72 high signal-to-noise FXTs. Subjected to the visibility in the sky and weather conditions, we search for the optical counterparts of 42 EP-discovered FXTs from the Lulin observatory. We successfully detect the optical counterparts of 12 FXTs, and five of those are first discovered by us from the Lulin observatory. We find that the optical counterparts are generally faint (r>20 mag) and decline rapidly (>0.5 mag per day). We also find that 11 out of 42 FXTs had shown direct evidence of their association with Gamma-Ray Bursts (GRBs) through significant temporal and spatial overlapping. Furthermore, the luminosities and redshifts of FXTs with confirm optical counterparts in our observations are fully consistent with the faintest end of the GRB population. However, the non-detection of any associated optical counterpart with a significant fraction of FXTs suggests that EP FXTs are likely a subset of so-called `Dark' FXTs, similar to `Dark' GRBs. Additionally, the luminosities of two FXTs were also consistent with jetted tidal disruption events (TDEs). However, their luminosities differ significantly from those of typical supernova shock breakout or kilonova emissions. Thus, we conclude that a significant fraction of EP-discovered FXTs are associated with events having relativistic jets; either a GRB or a jetted TDE.\n\n", "2504.20664": "2025-04-29, **Challenging $Λ$CDM: 5$σ$ Evidence for a Dynamical Dark Energy Late-Time Transition**, Mateus Scherer et.al., [2504.20664v1](http://arxiv.org/abs/2504.20664v1)\n\n Recently, there has been considerable debate regarding potential evidence for the dynamical nature of dark energy (DE), particularly in light of Baryon Acoustic Oscillations (BAO) measurements released by DESI survey. In this work, we propose an agnostic test that simultaneously constrains the dark energy (DE) equation of state (EoS) and probes the possibility of a transition between the quintessence and phantom regimes, or vice versa. Our initial approach is independent of physical priors, allowing the data to determine which behavior best fits the parameters. We then consider a minimally modified gravity theory known as VCDM, into which we can map our initial approximation, placing it within a theoretically stable framework. To this end, we incorporate the most up-to-date datasets available, including BAO measurements from DESI-DR2, Type Ia Supernovae from the PantheonPlus, DESY5, and Union3 samples, as well as Cosmic Microwave Background (CMB) data from Planck. Our analysis reveals strong and statistically significant evidence for a quintessence-phantom transition across various data combinations. \\textit{The strongest evidence is found for Planck+DESI+DESY5, with a significance exceeding $\\sim$5$\\sigma$ in favor of a quintessence-phantom transition at $z\\_{\\dag} = 0.493^{+0.063}\\_{-0.081}$}. Beyond this redshift, the EoS remains within the phantom regime, while for $z < z\\_{\\dag}$, it favors the quintessence regime. Despite this strong indication, \\textit{we find that such transitions do not resolve the $H\\_0$ tension}.\n\n", "2504.20601": "2025-04-29, **How to turn a Supernova into a PeVatron**, Robert Brose et.al., [2504.20601v1](http://arxiv.org/abs/2504.20601v1)\n\n Context. It is important to determine which Galactic cosmic-ray sources can accelerate particles to the knee of the cosmic ray spectrum at a few PeV, and in particular whether supernova remnants may contribute. Current models for particle acceleration in very young remnants assume the circumstellar material consists of smooth, freely expanding winds. There is strong evidence that some supernovae expand into much denser circumstellar material including dense shells ejected by eruptions shortly before explosion.   Aims. We investigate the effects of dense circumstellar shells on particle acceleration in supernova shocks during the first few years post-explosion, to quantify whether such interaction supernovae may act as PeVatrons.   Methods. We used the pion code to model the circumstellar medium around Luminous Blue Variables after having a brief episode with a mass-loss rate of up to dM/dt = 2Msol/yr. Consequently, we performed spherically symmetric 1-D simulations using our time-dependent acceleration-code RATPaC in which we simultaneously solve the transport equations for cosmic-rays, magnetic turbulence, and the hydrodynamical flow of the thermal plasma in the test-particle limit.   Results. We find that the interaction with the circumstellar shells can significantly boost the maximum energy by enhancing particle escape during the onset of the shock-shell interaction followed by the reacceleration of the shock propagating into a medium with a pre-amplified field. Early interactions boost the maximum energy to a greater degree and interactions within the first 5 months after explosion can increase Emax to more then 1 PeV.\n\n", "2504.20574": "2025-04-29, **Two Decades of Dust Evolution in SN 2005af through JWST, Spitzer, and Chemical Modeling**, Arkaprabha Sarangi et.al., [2504.20574v1](http://arxiv.org/abs/2504.20574v1)\n\n The evolution of dust in core-collapse supernovae (SNe), in general, is poorly constrained owing to a lack of infrared observations after a few years from explosion. Most theories of dust formation in SNe heavily rely only on SN 1987A. In the last two years, the James Webb Space Telescope (JWST) has enabled us to probe the dust evolution in decades-old SNe, such as SN 2004et, SN 2005ip, and SN 1980K. In this paper, we present two decades of dust evolution in SN 2005af, combining early-time infrared observations with Spitzer Space Telescope and recent detections by JWST. We have used a chemical kinetic model of dust synthesis in SN ejecta to develop a template of dust evolution in SN 2005af. Moreover, using this approach, for the first time, we have separately quantified the dust formed in the pre-explosion wind that survived after the explosion, and the dust formed in the metal-rich SN ejecta post-explosion. We report that in SN 2005af, predominantly carbon-rich dust is formed in the ejecta, where the total mass of ejecta dust is about 0.02-0.03 Msun, while in the circumstellar medium the amount of surviving oxygen-rich dust is 0.001-0.004 Msun.\n\n", "2504.20407": "2025-04-29, **Discovery of a variable yellow supergiant progenitor for the Type IIb SN 2024abfo**, Zexi Niu et.al., [2504.20407v1](http://arxiv.org/abs/2504.20407v1)\n\n We report the discovery of a progenitor candidate for the Type IIb SN 2024abfo using multi-epoch pre-explosion images from the Hubble Space Telescope and the Dark Energy Camera Legacy Survey. The progenitor exhibited a ~0.7 mag decline in F814W from 2001 to 2013, followed by significant brightness and color fluctuations in the g, r and z bands. This is the first time that a variable progenitor has been found for a SN IIb. We suggest that the variability is caused by intrinsic changes in the progenitor star instead of varying obscuration by circumstellar dust. Our results show that the progenitor of SN 2024abfo was likely a yellow supergiant star with an initial mass of 12--14, 14--15 and 15--18 Msun for different assumed values of circumstellar reddening of E(B-V)\\_CSM = 0, 0.1 and 0.2 mag. Our study underscores the critical role of multi-epoch imaging surveys in revealing the final stages of core-collapse supernovae progenitors.\n\n"}}