{"neutrino": {"2404.03213": "2024-04-04, **Neutrino mean free path in neutron stars in the presence of hyperons**, Jesper Leong et.al., [2404.03213v1](http://arxiv.org/abs/2404.03213v1)\n\n We investigate the neutrino elastic differential cross-section (NDCS) and corresponding mean free path for neutral current scattering in the dense matter of a neutron star. A wide range of observed neutron star (NS) masses is considered, including the presence of $\\Lambda$, $\\Xi^{-}$, and $\\Xi^{0}$ hyperons in the heaviest stars. Their presence significantly decreases the total neutrino mean free path in the heavier stars.\n\n", "2404.03102": "2024-04-03, **Direct Experimental Constraints on the Spatial Extent of a Neutrino Wavepacket**, Joseph Smolsky et.al., [2404.03102v1](http://arxiv.org/abs/2404.03102v1)\n\n Despite their high relative abundance in our Universe, neutrinos are the least understood fundamental particles of nature. They also provide a unique system to study quantum coherence in fundamental systems due to their extremely weak interaction probabilities. The quantum properties of neutrinos emitted in experimentally relevant sources are virtually unknown and theoretical predictions for the spatial width of neutrino wavepackets vary by many orders of magnitude. In weak nuclear decay, the size of a neutrino wavepacket, $\\sigma\\_{\\nu,x}$, is related to the spatial wavefunction of its parent at production. Here, we present the first direct limits of this quantity through a new experimental concept to extract the energy width, $\\sigma\\_{\\textrm{N},E}$, of the recoil daughter nucleus emitted in the nuclear electron capture (EC) decay of $^7$Be. The final state in the EC decay process contains a recoiling $^7$Li nucleus and an electron neutrino ($\\nu\\_e$) which are entangled at their creation. The $^7$Li energy spectrum is measured to high precision by directly embedding $^7$Be radioisotopes into a high resolution superconducting tunnel junction that is operated as a cryogenic charge sensitive detector. The lower limit on the spatial coherence of the recoil daughter was found to be $\\sigma\\_{\\textrm{N}, x} \\geq 6.2$ pm, which implies the system remains in a spatially coherent state much larger than the nuclear scale. Further, this implies a lower limit on the size of a neutrino wavepacket, $\\sigma\\_{\\nu,x} \\geq 35$ nm, which is more than five orders of magnitude more stringent than the limits from all combined reactor oscillation experiments. These results have wide-reaching implications in several areas including quantum coherence, the nature of spatial localization at sub-atomic scales, interpretation of neutrino physics data, and the potential reach of future large-scale experiments.\n\n", "2404.03096": "2024-04-03, **Full-Scale Readout Electronics for the ECHo-100k Experiment**, T. Muscheid et.al., [2404.03096v1](http://arxiv.org/abs/2404.03096v1)\n\n Recent advances in the development of cryogenic particle detectors such as magnetic microcalorimeters (MMCs) allow the fabrication of sensor arrays with an increasing number of pixels. Since these detectors must be operated at the lowest temperatures, the readout of large detector arrays is still quite challenging. This is especially true for the ECHo experiment, which presently aims to simultaneously run 6,000 two-pixel detectors to investigate the electron neutrino mass. For this reason, we developed a readout system based on a microwave SQUID multiplexer ($\\mu$MUX) that is operated by a custom software-defined radio (SDR) at room-temperature. The SDR readout electronics consist of three distinct hardware units: a data processing board with a Xilinx ZynqUS+ MPSoC; a converter board that features DACs, ADCs, and a coherent clock distribution network; and a radio frequency front-end board to translate the signals between the baseband and the microwave domains. Here, we describe the characteristics of the full-scale SDR system. First, the generated frequency comb for driving the $\\mu$MUX was evaluated. Subsequently, by operating the SDR in direct loopback, the crosstalk of the individual channels after frequency demultiplexing was investigated. Finally, the system was used with a 16-channel $\\mu$MUX to evaluate the linearity of the SDR, and the noise contributed to the overall readout setup.\n\n", "2404.03002": "2024-04-03, **DESI 2024 VI: Cosmological Constraints from the Measurements of Baryon Acoustic Oscillations**, DESI Collaboration et.al., [2404.03002v1](http://arxiv.org/abs/2404.03002v1)\n\n We present cosmological results from the measurement of baryon acoustic oscillations (BAO) in galaxy, quasar and Lyman-$\\alpha$ forest tracers from the first year of observations from the Dark Energy Spectroscopic Instrument (DESI), to be released in the DESI Data Release 1. DESI BAO provide robust measurements of the transverse comoving distance and Hubble rate, or their combination, relative to the sound horizon, in seven redshift bins from over 6 million extragalactic objects in the redshift range $0.1<z<4.2$. DESI BAO data alone are consistent with the standard flat $\\Lambda$CDM cosmological model with a matter density $\\Omega\\_\\mathrm{m}=0.295\\pm 0.015$. Paired with a BBN prior and the robustly measured acoustic angular scale from the CMB, DESI requires $H\\_0=(68.52\\pm0.62)$ km/s/Mpc. In conjunction with CMB anisotropies from Planck and CMB lensing data from Planck and ACT, we find $\\Omega\\_\\mathrm{m}=0.307\\pm 0.005$ and $H\\_0=(67.97\\pm0.38)$ km/s/Mpc. Extending the baseline model with a constant dark energy equation of state parameter $w$, DESI BAO alone require $w=-0.99^{+0.15}\\_{-0.13}$. In models with a time-varying dark energy equation of state parametrized by $w\\_0$ and $w\\_a$, combinations of DESI with CMB or with SN~Ia individually prefer $w\\_0>-1$ and $w\\_a<0$. This preference is 2.6$\\sigma$ for the DESI+CMB combination, and persists or grows when SN~Ia are added in, giving results discrepant with the $\\Lambda$CDM model at the $2.5\\sigma$, $3.5\\sigma$ or $3.9\\sigma$ levels for the addition of Pantheon+, Union3, or DES-SN5YR datasets respectively. For the flat $\\Lambda$CDM model with the sum of neutrino mass $\\sum m\\_\\nu$ free, combining the DESI and CMB data yields an upper limit $\\sum m\\_\\nu < 0.072$ $(0.113)$ eV at 95% confidence for a $\\sum m\\_\\nu>0$ $(\\sum m\\_\\nu>0.059)$ eV prior. These neutrino-mass constraints are substantially relaxed in models beyond $\\Lambda$CDM. [Abridged.]\n\n", "2404.02792": "2024-04-03, **Numerical relativity simulations of black hole and relativistic jet formation**, Takami Kuroda et.al., [2404.02792v1](http://arxiv.org/abs/2404.02792v1)\n\n We investigate impacts of stellar rotation and magnetic fields on black hole (BH) formation and its subsequent explosive activities, by conducting axisymmetric radiation-magnetohydrodynamics simulations of gravitational collapse of a 70 $M\\_\\odot$ star with two-moment multi energy neutrino transport in numerical relativity. Due to its dense stellar structure, all models cannot avoid the eventual BH formation even though a strongly magnetized model experiences the so-called magnetorotational explosion prior to the BH formation. One intriguing phenomenon observed in the strongly magnetized model is the formation of a relativistic jet in the post-BH formation. The relativistic jet is the outcome of a combination of strong magnetic fields and low-density materials above the BH. The jet further enhances the explosion energy beyond $\\sim10^{52}$ erg, which is well exceeding the gravitational overburden ahead of the shock. Our self-consistent supernova models demonstrate that rotating magnetized massive stars at the high-mass end of supernova progenitors could be a potential candidate of hypernova and long gamma-ray burst progenitors.\n\n", "2404.02775": "2024-04-03, **A plethora of long-range neutrino interactions probed by DUNE and T2HK**, Sanjib Kumar Agarwalla et.al., [2404.02775v1](http://arxiv.org/abs/2404.02775v1)\n\n Upcoming neutrino experiments will soon search for new neutrino interactions more thoroughly than ever before, boosting the prospects of extending the Standard Model. In anticipation of this, we forecast the capability of two of the leading long-baseline neutrino oscillation experiments, DUNE and T2HK, to look for new flavor-dependent neutrino interactions with electrons, protons, and neutrons that could affect the transitions between different flavors. We interpret their sensitivity in the context of long-range neutrino interactions, mediated by a new neutral boson lighter than $10^{-10}$ eV, and sourced by the vast amount of nearby and distant matter in the Earth, Moon, Sun, Milky Way, and beyond. For the first time, we explore the sensitivity of DUNE and T2HK to a wide variety of $U(1)^\\prime$ symmetries, built from combinations of lepton and baryon numbers, each of which induces new interactions that affect oscillations differently. We find ample sensitivity: in all cases, DUNE and T2HK may constrain the existence of the new interaction even if it is supremely feeble, may discover it, and, in some cases, may identify the symmetry responsible for it.\n\n", "2404.02636": "2024-04-03, **Sibyll$^{\\bigstar}$**, Felix Riehn et.al., [2404.02636v1](http://arxiv.org/abs/2404.02636v1)\n\n In the last decade, an increasing number of datasets have revealed a consistent discrepancy between the number of muons measured in ultra-high-energy extensive air showers (EAS) and the numbers predicted by simulations. This gap persists despite incorporating Large Hadron Collider (LHC) data into the tuning of current hadronic interaction models, leading to the phenomenon often termed the ''muon puzzle''. To gain a deeper understanding of the potential origins of this muon puzzle, we have developed Sibyll$^{\\bigstar}$, a series of phenomenologically modified versions of Sibyll 2.3d. In these models, we have increased muon production by altering $\\rho^0$, baryon-antibaryon pair, or kaon production in hadronic multiparticle production processes. These variants remain within bounds from provided by accelerator measurements, including those from the LHC and fixed-target experiments, notably NA49 and NA61, showing a level of consistency comparable to Sibyll 2.3d. Our findings show that these modifications can increase the muon count in EAS by up to 35%, while minimally affecting the depth of shower maximum ($X\\_{\\rm max}$) and other shower variables. Additionally, we assess the impact of these modifications on various observables, including inclusive muon and neutrino fluxes and the multiplicities of muon bundles in deep underground and water/ice Cherenkov detectors. We aim for at least one of these model variants to offer a more accurate representation of EAS data at the highest energies, thereby enhancing the quality of Monte Carlo predictions used in training neural networks. This improvement is crucial for achieving more reliable data analyses and interpretations.\n\n"}, "dark matter": {"2404.03655": "2024-04-04, **Magnetic fields from small-scale primordial perturbations**, Nanoom Lee et.al., [2404.03655v1](http://arxiv.org/abs/2404.03655v1)\n\n Weak magnetic fields must have existed in the early Universe, as they were sourced by the cross product of electron density and temperature gradients through the Biermann-battery mechanism. In this paper we calculate the magnetic fields generated at cosmic dawn by a variety of small-scale primordial perturbations, carefully computing the evolution of electron density and temperature fluctuations, and consistently accounting for relative velocities between baryons and dark matter. We first compute the magnetic field resulting from standard, nearly scale-invariant primordial adiabatic perturbations, making significant improvements to previous calculations. This \"standard\" primordial field has a root mean square (rms) of $\\sim10^{-15}$ nG at $20\\lesssim z \\lesssim 100$, with fluctuations on $\\sim$ kpc comoving scales, and could serve as the seed of present-day magnetic fields observed in galaxies and galaxy clusters. In addition, we consider early-Universe magnetic fields as a possible probe of non-standard initial conditions of the Universe on small scales $k \\sim 1-10^3$ Mpc$^{-1}$. To this end, we compute the maximally-allowed magnetic fields within current upper limits on small-scale adiabatic and isocurvature perturbations. Under the current Cosmic Microwave Background spectral-distortion constraints magnetic fields could be produced with a rms of $\\sim 5\\times 10^{-11}$ nG at $z = 20$. Uncorrelated small-scale isocurvature perturbations within current Big-Bang Nucleosynthesis bounds could potentially enhance the magnetic field to $\\sim 10^{-14}-10^{-10}$ nG at $z = 20$, depending on the specific isocurvature mode considered. While these very weak fields remain well below current observational capabilities, our work points out that magnetic fields could potentially provide an interesting window into the poorly constrained small-scale initial conditions of the Universe.\n\n", "2404.03352": "2024-04-04, **ToMCCA: A Toy Monte Carlo Coalescence Afterburner**, Maximilian Mahlein et.al., [2404.03352v1](http://arxiv.org/abs/2404.03352v1)\n\n The study of antinuclei in cosmic rays provides a unique opportunity to probe physics beyond the Standard Model. Antinuclei in our Galaxy may stem either from annihilation or decay of dark matter, or from collisions of cosmic rays with the interstellar medium, which constitute the background of indirect dark matter searches. Understanding the formation mechanism of (anti)nuclei is crucial for setting limits on their production in space. Coalescence models, which describe the formation of light nuclei from final-state interaction of nucleons, have been widely employed in high-energy collisions. In this work, we introduce ToMCCA (Toy Monte Carlo Coalescence Afterburner), which allows for detailed studies of the nuclear formation processes without the overload of general-purpose event generators. ToMCCA contains parameterizations of the multiplicity dependence of the transverse momentum distributions of protons and of the baryon-emitting source size, extracted from ALICE measurements in pp collisions at $\\sqrt{s} = 5 - 13$ TeV, as well as of the event multiplicity distributions, taken from the EPOS event generator. ToMCCA provides predictions of the deuteron transverse momentum distributions, with an agreement of $\\sim5\\%$ with the experimental data. The results of ToMCCA show that the coalescence mechanism in pp collisions depends only on the event multiplicity rather than on the collision system or its energy. This allows the model to be utilized for predictions at lower center-of-mass collision energies, which are the most relevant for the production of antinuclei from processes related to dark matter. This model can also be extended to heavier nuclei as long as the target nucleus wave function and its Wigner function are known.\n\n", "2404.03328": "2024-04-04, **Primordial Black Hole Interpretation in Subsolar Mass Gravitational Wave Candidate SSM200308**, Chen Yuan et.al., [2404.03328v1](http://arxiv.org/abs/2404.03328v1)\n\n In the recent second part of the third observation run by the LIGO-Virgo-KAGRA collaboration, a candidate with sub-solar mass components was reported, which we labelled as SSM200308. This study investigates the premise that primordial black holes (PBHs), arising from Gaussian perturbation collapses, could explain SSM200308. Through Bayesian analysis, we obtain the primordial curvature power spectrum that leads to the merger rate of PBHs aligning with observational data as long as they constitute $3.54^{+7.66}\\_{-2.82}\\times 10^{-3}$ of the dark matter. However, while the gravitational wave (GW) background from binary PBH mergers is within current observational limits, the scalar-induced GWs associated with PBH formation exceed the constraints imposed by pulsar timing arrays, challenging the Gaussian perturbation collapse PBH model as the source of SSM200308.\n\n", "2404.03232": "2024-04-04, **Discrete origins of matter**, Gauhar Abbas et.al., [2404.03232v1](http://arxiv.org/abs/2404.03232v1)\n\n We discuss models of the flavour problem and dark matter based on the discrete $\\mathcal{Z}\\_{\\rm N} \\times \\mathcal{Z}\\_{\\rm M} \\times \\mathcal{Z}\\_{\\rm P}$ flavour symmetry. A new class of dark-matter emerges out of these models, which is defined as the flavonic dark matter. An ultra-violet completion of these models based on the dark-technicolour paradigm is also presented.\n\n", "2404.03090": "2024-04-03, **Direct detection of light dark matter charged under a $L_μ - L_τ$ symmetry**, Pablo Figueroa et.al., [2404.03090v1](http://arxiv.org/abs/2404.03090v1)\n\n A possible extension of the Standard Model able to explain the recent measurement of the anomalous magnetic moment of the muon consists in adding a gauged $U(1)\\_{L\\_{\\mu}-L\\_{\\tau}}$ symmetry. If the dark matter particle is charged under this symmetry, the kinetic mixing between the new gauge boson and the photon induces dark matter-electron interactions. We derive direct detection constraints on light dark matter charged under a $U(1)\\_{L\\_{\\mu}-L\\_{\\tau}}$ symmetry with electron recoil experiments, and explore prospects with XLZD and OSCURA to close in the parameter space able to explain simultaneously the recent measurement on the anomalous magnetic moment of the muon and the observed relic density of dark matter. We further discuss the spin-dependent scattering contribution arising in this model, which was ignored previously in the literature.\n\n", "2404.03009": "2024-04-03, **HOD-Dependent Systematics in Emission Line Galaxies for the DESI 2024 BAO analysis**, C. Garcia-Quintero et.al., [2404.03009v1](http://arxiv.org/abs/2404.03009v1)\n\n The Dark Energy Spectroscopic Instrument (DESI) will provide precise measurements of Baryon Acoustic Oscillations (BAO) to constrain the expansion history of the Universe and set stringent constraints on dark energy. Therefore, precise control of the global error budget due to various systematic effects is required for the DESI 2024 BAO analysis. In this work, we focus on the robustness of the BAO analysis against the Halo Occupation Distribution (HOD) modeling for the Emission Line Galaxy (ELG) tracer. Based on a common dark matter simulation, our analysis relies on HOD mocks tuned to early DESI data, namely the One-Percent survey data. To build the mocks, we use several HOD models for the ELG tracer as well as extensions to the baseline HOD models. Among these extensions, we consider distinct recipes for galactic conformity and assembly bias. We perform two independent analyses in the Fourier space and in the configuration space. We recover the BAO signal from two-point measurements after performing reconstruction on our mocks. Additionally, we also apply the control variates technique to reduce sample variance noise. Our BAO analysis can recover the isotropic BAO parameter $\\alpha\\_\\text{iso}$ within 0.1\\% and the Alcock Paczynski parameter $\\alpha\\_\\text{AP}$ within 0.3\\%. Overall, we find that our systematic error due to the HOD dependence is below 0.17\\%, with the Fourier space analysis being more robust against the HOD systematics. We conclude that our analysis pipeline is robust enough against the HOD systematics for the ELG tracer in the DESI 2024 BAO analysis.\n\n", "2404.03008": "2024-04-03, **HOD-Dependent Systematics for Luminous Red Galaxies in the DESI 2024 BAO Analysis**, J. Mena-Fernández et.al., [2404.03008v1](http://arxiv.org/abs/2404.03008v1)\n\n In this paper, we present the estimation of systematics related to the halo occupation distribution (HOD) modeling in the baryon acoustic oscillations (BAO) distance measurement of the Dark Energy Spectroscopic Instrument (DESI) 2024 analysis. This paper focuses on the study of HOD systematics for luminous red galaxies (LRG). We consider three different HOD models for LRGs, including the base 5-parameter vanilla model and two extensions to it, that we refer to as baseline and extended models. The baseline model is described by the 5 vanilla HOD parameters, an incompleteness factor and a velocity bias parameter, whereas the extended one also includes a galaxy assembly bias and a satellite profile parameter. We utilize the 25 dark matter simulations available in the AbacusSummit simulation suite at $z=$ 0.8 and generate mock catalogs for our different HOD models. To test the impact of the HOD modeling in the position of the BAO peak, we run BAO fits for all these sets of simulations and compare the best-fit BAO-scaling parameters $\\alpha\\_{\\rm iso}$ and $\\alpha\\_{\\rm AP}$ between every pair of HOD models. We do this for both Fourier and configuration spaces independently, using post-reconstruction measurements. We find a 3.3$\\sigma$ detection of HOD systematic for $\\alpha\\_{\\rm AP}$ in configuration space with an amplitude of 0.19%. For the other cases, we did not find a 3$\\sigma$ detection, and we decided to compute a conservative estimation of the systematic using the ensemble of shifts between all pairs of HOD models. By doing this, we quote a systematic with an amplitude of 0.07% in $\\alpha\\_{\\rm iso}$ for both Fourier and configuration spaces; and of 0.09% in $\\alpha\\_{\\rm AP}$ for Fourier space.\n\n", "2404.02993": "2024-04-03, **Falsifying Anthropics**, Nemanja Kaloper et.al., [2404.02993v1](http://arxiv.org/abs/2404.02993v1)\n\n We propose using fuzzy axion dark matter to test the anthropic principle. A very light axion can be directly detectable, at least by black hole superradiance effects. The idea then is that gravitational and astrophysical observations can discover a light axion in the regime where it must be all of dark matter with abundance which must be set up by the anthropic principle, due to excessive primordial misalignment induced by inflation. Yet it may turn out that dark matter is something else instead of this axion. Since axion misalignment must be induced by Brownian drift in (quasi)de Sitter space, this could invalidate anthropic prediction of dark matter abundance.\n\n", "2404.02960": "2024-04-03, **Exploring the Mpc Environment of the Quasar ULAS J1342+0928 at z = 7.54**, Sofía Rojas-Ruiz et.al., [2404.02960v1](http://arxiv.org/abs/2404.02960v1)\n\n Theoretical models predict that z~6 quasars are hosted in the most massive halos of the underlying dark matter distribution and thus would be immersed in protoclusters of galaxies. However, observations report inconclusive results. We investigate the 1.1 pMpc2 environment of the z = 7.54 luminous quasar ULAS J1342+0928. We search for Lyman-break galaxy candidates (LBG) using deep imaging from the Hubble Space Telescope (HST) in the ACS/F814W, WFC3/F105W/F125W bands, and Spitzer/IRAC at 3.6 $\\mu$m and 4.5 $\\mu$m. We report a zphot = $7.69^{+0.33}\\_{-0.23}$ LBG with magF125W = 26.41 at 223 projected-pkpc from the quasar. We find no HST counterpart to one [CII]-emitter previously found with ALMA at 27 projected-pkpc and $z[CII]=7.5341\\pm0.0009$ (Venemans et al. 2020). We estimate the completeness of our LBG candidates using results from CANDELS/GOODS deep blank field searches sharing a similar filter setup. We find that >50% of the z~7.5 LBGs with magF125W >25.5 are missed due to the absence of a filter redward of the Lyman-break in F105W, hindering the UV color accuracy of the candidates. We conduct a QSO-LBG clustering analysis revealing a low LBG excess of $0.46^{+1.52}\\_{-0.08}$ in this quasar field, consistent with an average or low-density field. Consequently, this result does not present strong evidence of an LBG overdensity around ULAS J1342+0928. Furthermore, we identify two LBG candidates with a zphot matching a confirmed z=6.84 absorber along the line-of-sight to the quasar. All these galaxy candidates are excellent targets for follow-up observations with JWST and/or ALMA to confirm their redshift and physical properties.\n\n", "2404.02956": "2024-04-03, **Multi-messenger Probes of Asteroid Mass Primordial Black Holes: Superradiance Spectroscopy, Hawking Radiation, and Microlensing**, James B. Dent et.al., [2404.02956v1](http://arxiv.org/abs/2404.02956v1)\n\n Superradiance provides a unique opportunity for investigating dark sectors as well as primordial black holes (PBHs), which themselves are candidates for dark matter (DM) over a wide mass range. Using axion-like particles (ALPs) as an example, we show that line signals emerging from a superradiated ALP cloud combined with Hawking radiation from PBHs in extragalactic and galactic halos, along with microlensing observations lead to complementary constraints on parameter space combinations including the ALP-photon coupling, ALP mass, PBH mass, and PBH DM fraction, $f\\_{\\rm PBH}$. For the PBH asteroid mass range $\\sim10^{16}-10^{22}~{\\rm g}$, where PBHs can provide the totality of DM, we demonstrate that ongoing and upcoming observations such as SXI, JWST, and AMEGO-X will be sensitive to possible line and continuum signals, respectively, providing probes of previously inaccessible regions of $f\\_{\\rm PBH}$ parameter space. Further complementarity from a stochastic gravitational-wave background emerging from the PBH formation mechanism is also considered.\n\n", "2404.02953": "2024-04-03, **Inferring dark matter subhalo properties from simulated subhalo-stream encounters**, Tariq Hilmi et.al., [2404.02953v1](http://arxiv.org/abs/2404.02953v1)\n\n In the cold dark matter paradigm, our Galaxy is predicted to contain >10000 dark matter subhaloes in the $10^5-10^8M\\_\\odot$ range which should be completely devoid of stars. Stellar streams are sensitive to the presence of these subhaloes, which can create small-scale features in streams if they pass closely enough. Modelling these encounters can therefore, potentially recover the subhalo's properties. In this work, we demonstrate this for streams generated in numerical simulations, modelled on eccentric orbits in a realistic Milky Way potential, which includes the Large Magellanic Cloud and the subhalo itself. We focus on a mock model of the ATLAS-Aliqa Uma stream and inject a $10^7 M\\_\\odot$ subhalo, creating a similar discontinuous morphology to current observations. We then explore how well subhalo properties are recovered using mock stream observations, consisting of no observational errors, as well as assuming realistic observational setups. These setups include present day style observations, and what will be possible with 4MOST and Gaia DR5 in the future. We show that we can recover all parameters describing the impact even with uncertainties matching existing data, including subhalo positions, velocities, mass and scale radius. Modelling the subhalo on an orbit instead of assuming an impulse approximation, we greatly reduce the degeneracy between subhalo mass and velocity seen in previous works. However, we find a slight bias in the subhalo mass (~0.1 dex). This demonstrates that we should be able to reliably extract the properties of subhaloes with stellar streams in the near future.\n\n", "2404.02906": "2024-04-03, **Hitting the Thermal Target for Leptophilic Dark Matter**, Cari Cesarotti et.al., [2404.02906v1](http://arxiv.org/abs/2404.02906v1)\n\n We study future lepton collider prospects for testing predictive models of leptophilic dark matter candidates with a thermal origin. We calculate experimental milestones for testing the parameter space compatible with freeze-out and the associated collider signals at past, present, and future facilities. This analysis places new limits on such models by leveraging the utility of lepton colliders. At $e^+e^-$ machines, we make projections using precision $Z$-pole observables from $e^+e^-\\to l^+l^- + $ missing energy signatures at LEP and future projections for FCC-ee in these channels. Additionally, a muon collider could also probe new thermal relic parameter space in this scenario via $\\mu^+\\mu^- \\to X + $ missing energy where $X$ is any easy identifiable SM object. Collectively, these processes can probe much all of the parameter space for which DM direct annihilation to $l^+l^-$ yields the observed relic density in Higgs-like models with mass-proportional couplings to charged leptons.\n\n", "2404.02808": "2024-04-03, **Dancing above the abyss: Environmental effects and dark matter signatures in inspirals into massive black holes**, Niklas Becker et.al., [2404.02808v1](http://arxiv.org/abs/2404.02808v1)\n\n In this dissertation, we look at environmental effects in extreme and intermediate mass ratio inspirals into massive black holes. In these systems, stellar mass compact objects orbit massive black holes and lose orbital energy due to gravitational wave emission and other dissipative forces. We explore environmental interactions with dark matter spikes, stellar distributions, accretion disks, and combine and compare them. We discuss the existence and properties of dark matter spikes in the presence of these environmental effects. The signatures of the environmental effects, such as the phase space flow, dephasing, deshifting of the periapse, and alignment with accretion disks, are examined. These signatures are quantified in isolated spike systems, in dry, and in wet inspirals. We generally find dark matter effects to be subdominant to the other environmental effects, but their impact on the waveform is still observable and identifiable. Lastly, the rates of inspirals and the impact of spikes are estimated. All of these results are obtained with the help of a code imripy that is published alongside. If dark matter spikes exist, they should be observable with space-based gravitational wave observatories\n\n", "2404.02793": "2024-04-03, **xGASS: The scatter of the HI-halo mass relation of central galaxies**, Manasvee Saraf et.al., [2404.02793v1](http://arxiv.org/abs/2404.02793v1)\n\n Empirical studies of the relationship between baryonic matter in galaxies and the gravitational potential of their host halos are important to constrain our theoretical framework for galaxy formation and evolution. One such relation, between the atomic hydrogen (HI) mass of central galaxies ($M\\_{\\rm{HI,c}}$) and the total mass of their host halos ($M\\_{\\rm{halo}}$), has attracted significant interest in the last few years. In this work, we use the extended GALEX Arecibo SDSS Survey to examine the scatter of the HI-halo mass relation for a representative sample of central galaxies. Our findings reveal a flat median relation at $\\rm{log}\\_{10}$$(M\\_{\\rm{HI,c}}/\\rm{M}\\_{\\odot}) \\approx 9.40$, across $11.1 < \\rm{log}\\_{10}$$(M\\_{\\rm{halo}}/\\rm{M\\_{\\odot}}) < 14.1$. This flat relation stems from the statistical dominance of star-forming, disc galaxies at low $M\\_{\\rm{halo}}$ in combination with the increasing prevalence of passive, high stellar-concentration systems at higher $M\\_{\\rm{halo}}$. The scatter of this relation and the stellar specific angular momentum of centrals have a strong link (Spearman's rank correlation coefficient $\\geq 0.5$). Comparisons with simulations suggest that the kinematic state of host halos may be primarily driving this scatter. Our findings highlight that the HI-halo mass parameter space is too complex to be completely represented by simple median or average relations and we show that tensions with previous works are most likely due to selection biases. We recommend that future observational studies, and their comparisons with theoretical models, bin central galaxies also by their secondary properties to enable a statistically robust understanding of the processes regulating the cold gas content within central galaxies of dark-matter halos.\n\n", "2404.02646": "2024-04-03, **Ultralight scalar dark matter versus non-adiabatic perfect fluid dark matter in pulsar timing**, Qing-Hua Zhu et.al., [2404.02646v1](http://arxiv.org/abs/2404.02646v1)\n\n Recent evidence of direct detection of stochastic gravitational waves reported by pulsar timing array collaborations might open a new window for studying cosmology and astrophysical phenomena. In addition to signals from gravitational waves, there is motivation to explore residual signals from oscillating dark matter, which might partially comprise the galactic halo. We investigate fluctuations in pulsar timing originating from the coherent oscillation of scalar dark matter up to the subleading order of $\\mathcal{O}(k/m)$, as well as from acoustic oscillations of non-adiabatic perfect fluid dark matter. Both types of dark matter can generate oscillating Newtonian potential perturbations and curvature perturbations, thereby affecting pulsar timing. Our results show distinctive signatures in pulsar timing residuals and angular correlations for these dark matters. Specifically, pulsar timing residuals from non-adiabatic perfect fluid dark matter exhibit different directional dependence and are shown to be more sensitive to the distance to a pulsar. We also study the angular correlation patterns from these dark matters in the NANOGrav 15-year data set. The best fit might suggest that the composition of non-adiabatic perfect fluid dark matter in our galaxy is much greater than that of ultralight scalar dark matter.\n\n", "2404.02630": "2024-04-03, **Dynamical Casimir effect with screened scalar fields**, Ana Lucía Báez-Camargo et.al., [2404.02630v1](http://arxiv.org/abs/2404.02630v1)\n\n Understanding the nature of dark energy and dark matter is one of modern physics' greatest open problems. Scalar-tensor theories with screened scalar fields like the chameleon model are among the most popular proposed solutions. In this article, we present the first analysis of the impact of a chameleon field on the dynamical Casimir effect, whose main feature is the particle production associated with a resonant condition of boundary periodic motion in cavities. For this, we employ a recently developed method to compute the evolution of confined quantum scalar fields in a globally hyperbolic spacetime by means of time-dependent Bogoliubov transformations. As a result, we show that particle production is reduced due to the presence of the chameleon field. In addition, our results for the Bogoliubov coefficients and the mean number of created particles agree with known results in the absence of a chameleon field. Our results initiate the discussion of the evolution of quantum fields on screened scalar field backgrounds.\n\n", "2404.02607": "2024-04-03, **DoubleTES detectors to investigate the CRESST low energy background: results from above-ground prototypes**, G. Angloher et.al., [2404.02607v1](http://arxiv.org/abs/2404.02607v1)\n\n In recent times, the sensitivity of low-mass direct dark matter searches has been limited by unknown low energy backgrounds close to the energy threshold of the experiments known as the low energy excess (LEE). The CRESST experiment utilises advanced cryogenic detectors constructed with different types of crystals equipped with Transition Edge Sensors (TESs) to measure signals of nuclear recoils induced by the scattering of dark matter particles in the detector. In CRESST, this low energy background manifests itself as a steeply rising population of events below 200 eV. A novel detector design named doubleTES using two identical TESs on the target crystal was studied to investigate the hypothesis that the events are sensor-related. We present the first results from two such modules, demonstrating their ability to differentiate between events originating from the crystal's bulk and those occurring in the sensor or in its close proximity.\n\n", "2404.02492": "2024-04-03, **Enhanced Curvature Perturbation and Primordial Black Hole Formation in Two-stage Inflation with a break**, Xinpeng Wang et.al., [2404.02492v1](http://arxiv.org/abs/2404.02492v1)\n\n We investigate a model of $R^2$-gravity with a non-minimally coupled scalar field that gives rise to two-stage inflation with a break, that is, with an intermediate stage where inflation momentarily halts. We find that the power spectrum of the primordial curvature perturbation is significantly enhanced at the break scale, which can account for the primordial black hole (PBH) formation, without affecting the CMB constraint on large scales. The behavior of the curvature perturbation is carefully analyzed and we find a few notable new features in the spectrum. In particular, we find that the $k^3$ growth of the spectrum of toward the end of the first stage of inflation. We argue that this is a universal feature common to all two-stage models where the field dominating the second stage is heavy during the first stage. By appropriately tuning the model parameters, we find that our model can realize the scenario of PBHs as the cold dark matter of the Universe. We also find that we can choose the parameters so that the spectrum of the induced gravitational waves from the enhanced curvature perturbation fits the NANOGrav-15yr data of pulsar timing array observation.\n\n"}, "supernova": {"2404.03490": "2024-04-04, **SUSHI: An algorithm for source separation of hyperspectral images with non-stationary spectral variation**, Julia Lascar et.al., [2404.03490v1](http://arxiv.org/abs/2404.03490v1)\n\n Hyperspectral images are data cubes with two spatial dimensions and a third spectral dimension, providing a spectrum for each pixel, and thus allow the mapping of extended sources' physical properties. In this article, we present the Semi-blind Unmixing with Sparsity for Hyperspectral Images (SUSHI), an algorithm for non-stationary unmixing of hyperspectral images with spatial regularization of spectral parameters. The method allows for the disentangling of physical components without the assumption of a unique spectrum for each component. Thus, unlike most source separation methods used in astrophysics, all physical components obtained by SUSHI vary in spectral shape and in amplitude across the data cube.   Non-stationary source separation is an ill-posed inverse problem that needs to be constrained. We achieve this by training a spectral model and applying a spatial regularization constraint on its parameters. For the spectral model, we used an Interpolatory Auto-Encoder, a generative model that can be trained with limited samples. For spatial regularization, we applied a sparsity constraint on the wavelet transform of the model parameter maps.   We applied SUSHI to a toy model meant to resemble supernova remnants in X-ray astrophysics, though the method may be used on any extended source with any hyperspectral instrument. We compared this result to the one obtained by a classic 1D fit on each individual pixel. We find that SUSHI obtains more accurate results, particularly when it comes to reconstructing physical parameters. We applied SUSHI to real X-ray data from the supernova remnant Cassiopeia A and to the Crab Nebula. The results obtained are realistic and in accordance with past findings but have a much better spatial resolution. Thanks to spatial regularization, SUSHI can obtain reliable physical parameters at fine scales that are out of reach for pixel-by-pixel methods.\n\n", "2404.03362": "2024-04-04, **Exploring Universe acceleration through observational constraints via Hubble parameter reconstruction**, M. Koussour et.al., [2404.03362v1](http://arxiv.org/abs/2404.03362v1)\n\n In this article, we introduce an innovative parametric representation of the Hubble parameter, providing a model-independent means to explore the dynamics of an accelerating cosmos. The model's parameters are rigorously constrained through a Markov Chain Monte Carlo (MCMC) approach, leveraging a comprehensive dataset consisting of 31 data points from cosmic chronometers (CC), 1701 updated observations of Pantheon supernovae type Ia (SNeIa), and 6 data points from baryonic acoustic oscillations (BAO). Our analysis delves into the behavior of various cosmological parameters within the model, including the transition from a decelerating phase to an accelerating one, as well as the density parameters and the equation of state (EoS) parameter. The outcomes of our investigation reveal that the equation of state parameter aligns with characteristics reminiscent of the phantom model, supporting the prevailing understanding of our universe's current state of acceleration. This research contributes valuable insights into the ongoing cosmic expansion and underscores the utility of our novel parametric approach.\n\n", "2404.03166": "2024-04-04, **Searching for binary black hole sub-populations in gravitational wave data using binned Gaussian processes**, Anarya Ray et.al., [2404.03166v1](http://arxiv.org/abs/2404.03166v1)\n\n Astrophysically motivated population models for binary black hole observables are often insufficient to capture the imprints of multiple formation channels. This is mainly due to the strongly parametrized nature of such investigations. Using a non-parametric model for the joint population-level distributions of binary black hole component masses and effective inspiral spins, we find hints of multiple subpopulations in the third gravitational wave transient catalog. The higher (more positive) spin subpopulation is found to have a mass-spectrum without any feature at the $30-40M\\_{\\odot}$, which is consistent with the predictions of isolated stellar binary evolution, simulations for which place the pile up due to pulsational pair-instability supernovae near $50M\\_{\\odot}$ or higher. The other sub-population with effective spins closer to zero shows a feature at $30-40M\\_{\\odot}$ and is consistent with binary black holes formed dynamically in globular clusters, which are expected to peak around $30M\\_{\\odot}$. We also compute merger rates for these two subpopulations and find that they are consistent with the theoretical predictions of the corresponding formation channels. We validate our results by checking their robustness against variations of several model configurations and by analyzing large simulated catalogs with the same model.\n\n", "2404.03112": "2024-04-03, **On the Formation of the W-shaped O II Lines in Spectra of Type I Superluminous Supernovae**, Sei Saito et.al., [2404.03112v1](http://arxiv.org/abs/2404.03112v1)\n\n H-poor superluminous supernovae (SLSNe-I) are characterized by O II lines around 4,000 - 4,500 A in pre-/near-maximum spectra, so-called W-shaped O II lines. As these lines are from relatively high excitation levels, they have been considered a sign of non-thermal processes, which may give a hint of power sources of SLSNe-I. However, the conditions for these lines to appear have not been understood well. In this work, we systematically calculate synthetic spectra to reproduce observed spectra of eight SLSNe-I, parameterizing departure coefficients from the nebular approximation in the SN ejecta (expressed as b\\_neb). We find that most of the observed spectra can be reproduced well with b\\_neb ~< 10, which means that no strong departure is necessary for the formation of the W-shaped O II lines. We also show that the appearance of the W-shaped O II lines is sensitive to temperature; only spectra with temperatures T ~ 14,000 - 16,000 K can produce the W-shaped O II lines without large departures. Based on this, we constrain the non-thermal ionization rate near the photosphere. Our results suggest that spectral features of SLSNe-I can give independent constraints on the power source through the non-thermal ionization rates.\n\n", "2404.02651": "2024-04-03, **Magnetic Field of Molecular Gas Measured with the Velocity Gradient Technique II: Curved Magnetic Field in kpc-Scale Bubble of NGC\\,628**, Mengke Zhao et.al., [2404.02651v1](http://arxiv.org/abs/2404.02651v1)\n\n We report the detection of the ordered alignment between the magnetic field and kpc-scale bubbles in the nearby spiral galaxy, NGC\\,628. Applying the Velocity Gradient Technique (VGT) on CO spectroscopic data from the ALMA-PHANGS, the magnetic field of NGC\\,628 is measured at the scale of 191\\,pc ($\\sim$ 4\\,$''$). The large-scale magnetic field is oriented parallel to the spiral arms and curves around the galactic bubble structures in the mid-infrared emission observed by the James Webb Space Telescope (JWST). Twenty-one bubble structures have been identified at the edges of spiral arms with scales over 300\\,pc, which includes two kpc-scale structures. These bubbles are caused by supernova remnants and prolonged star formation and are similar to the outflow chimneys found in neutral hydrogen in galactic disks. At the edge of the bubbles, the shocks traced by the OIII emission present a curved magnetic field that parallels the bubble's shell. The magnetic field follows the bubble expansion and binds the gas in the shell to trigger further star formation. By analyzing the larger sample of 1694 bubbles, we found a distinct radial-size distribution of bubbles in NGC\\,628 indicating the star formation history in the galaxy.\n\n", "2404.02566": "2024-04-03, **Detached Circumstellar Matter as an Explanation for Slowly-Rising Interacting Type Ibc Supernovae**, Yuki Takei et.al., [2404.02566v1](http://arxiv.org/abs/2404.02566v1)\n\n Some hydrogen-poor (Type Ibc) supernovae (SNe) are known to have massive circumstellar matter (CSM) that are well detached from the star. Using the open-source code CHIPS, we construct a grid of models of SN Ibc interacting with detached CSM. We find that interaction with detached CSM can produce a slowly rising phase in the light curve seen in some interacting SN Ibc, which is difficult to reproduce by interaction with CSM of a density profile motivated from wind or eruptions that are continuous down to the star. We also show that SNe having double peaks in their light curves with timescales of months (e.g., SN 2022xxf) can be explained by radioactive decay of $^{56}$Ni/$^{56}$Co, followed by interaction with detached CSM.\n\n"}}