{"neutrino": {"2402.17352": "2024-02-27, **Search for neutrino emission from the Cygnus Bubble based on LHAASO $γ$-ray observations**, Wenlian Li et.al., [2402.17352v1](http://arxiv.org/abs/2402.17352v1)\n\n The Cygnus region, which contains massive molecular and atomic clouds and young stars, is a promising Galactic neutrino source candidate. Cosmic rays transport in the region can produce neutrinos and $\\gamma$-rays. Recently, the Large High Altitude Air Shower Observatory (LHAASO) detected an ultrahigh-energy $\\gamma$-ray bubble (Cygnus Bubble) in this region. Using publicly available track events detected by the IceCube Neutrino Observatory in 7 years of full detector operation, we conduct searches for correlated neutrino signals from the Cygnus Bubble with neutrino emission templates based on LHAASO $\\gamma$-ray observations. No significant signals were found for any employed templates. With the 7 TeV $\\gamma$-ray flux template, we set a flux upper limit of 90% confidence level (C.L.) for the neutrino emission from the Cygnus Bubble to be $5.7\\times10^{-13}\\, \\mathrm{TeV}^{-1}\\mathrm{cm}^{-2}\\mathrm{s}^{-1}$ at 5 TeV.\n\n", "2402.17125": "2024-02-27, **Waveform Simulation for Scintillation Characteristics of NaI(Tl) Crystal**, J. J. Choi et.al., [2402.17125v1](http://arxiv.org/abs/2402.17125v1)\n\n The lowering of the energy threshold in the NaI detector is crucial not only for comprehensive validation of DAMA/LIBRA but also for exploring new possibilities in the search for low-mass dark matter and observing coherent elastic scattering between neutrino and nucleus. Alongside hardware enhancements, extensive efforts have focused on refining event selection to discern noise, achieved through parameter development and the application of machine learning. Acquiring pure, unbiased datasets is crucial in this endeavor, for which a waveform simulation was developed. The simulation data were compared with the experimental data using several pulse shape discrimination parameters to test its performance in describing the experimental data. Additionally, we present the outcomes of multi-variable machine learning trained with simulation data as a scintillation signal sample. The distributions of outcomes for experimental and simulation data show a good agreement. As an application of the waveform simulation, we validate the trigger efficiency alongside estimations derived from the minimally biased measurement data.\n\n"}, "dark matter": {"2402.17716": "2024-02-27, **Attention-based Neural Network Emulators for Multi-Probe Data Vectors Part I: Forecasting the Growth-Geometry split**, Kunhao Zhong et.al., [2402.17716v1](http://arxiv.org/abs/2402.17716v1)\n\n We present a new class of machine-learning emulators that accurately model the cosmic shear, galaxy-galaxy lensing, and galaxy clustering real space correlation functions in the context of Rubin Observatory year one simulated data. To illustrate its capabilities in forecasting models beyond the standard $\\Lambda$CDM, we forecast how well LSST Year 1 data will be able to probe the consistency between geometry $\\Omega^{\\rm geo}\\_\\mathrm{m}$ and growth $\\Omega^{\\rm growth}\\_\\mathrm{m}$ dark matter densities in the so-called split $\\Lambda$CDM parameterization. When trained with a few million samples, our emulator shows uniform accuracy across a wide range in an 18-dimensional parameter space. We provide a detailed comparison of three neural network designs, illustrating the importance of adopting state-of-the-art Transformer blocks. Our study also details their performance when computing Bayesian evidence for cosmic shear on three fiducial cosmologies. The transformers-based emulator is always accurate within PolyChord's precision. As an application, we use our emulator to study the degeneracies between dark energy models and growth geometry split parameterizations. We find that the growth-geometry split remains to be a meaningful test of the smooth dark energy assumption.\n\n", "2402.17581": "2024-02-27, **CosmoMIA: Cosmic Web-based redshift space halo distribution**, Daniel Forero-Sánchez et.al., [2402.17581v1](http://arxiv.org/abs/2402.17581v1)\n\n Modern galaxy surveys demand extensive survey volumes and resolutions surpassing current dark matter-only simulations' capabilities. To address this, many methods employ effective bias models on the dark matter field to approximate object counts on a grid. However, realistic catalogs necessitate specific coordinates and velocities for a comprehensive understanding of the Universe. In this research, we explore sub-grid modeling to create accurate catalogs, beginning with coarse grid number counts at resolutions of approximately $5.5,h^{-1}$ Mpc per side. These resolutions strike a balance between modeling nonlinear damping of baryon acoustic oscillations and facilitating large-volume simulations. Augmented Lagrangian Perturbation Theory (ALPT) is utilized to model the dark matter field and motions, replicating the clustering of a halo catalog derived from a massive simulation at $z=1.1$. Our approach involves four key stages:   Tracer Assignment: Allocating dark matter particles to tracers based on grid cell counts, generating additional particles to address discrepancies.   Attractor Identification: Defining attractors based on particle cosmic web environments, acting as gravitational focal points.   Tracer Collapse: Guiding tracers towards attractors, simulating structure collapse.   Redshift Space Distortions: Introducing redshift space distortions to simulated catalogs using ALPT and a random dispersion term.   Results demonstrate accurate reproduction of monopoles and quadrupoles up to wave numbers of approximately $k=0.6,h$ Mpc$^{-1}$. This method holds significant promise for galaxy surveys like DESI, EUCLID, and LSST, enhancing our understanding of the cosmos across scales.\n\n", "2402.17265": "2024-02-27, **Constraining Asymmetric Dark Matter using Colliders and Direct Detection**, Arnab Roy et.al., [2402.17265v1](http://arxiv.org/abs/2402.17265v1)\n\n We reappraise the viability of asymmetric dark matter (ADM) realized as a Dirac fermion coupling dominantly to the Standard Model fermions. Treating the interactions of such a DM particle with quarks/leptons in an effective-interactions framework, we derive updated constraints using mono-jet searches from the Large Hadron Collider (LHC) and mono-photon searches at the Large Electron-Positron (LEP) collider. We carefully model the detectors used in these experiments, which is found to have significant impact. The constraint of efficient annihilation of the symmetric part of the ADM, as well as other observational constraints are synthesized to produce a global picture. Consistent with previous work, we find that ADM with mass in the range $1-100$ GeV is strongly constrained, thus ruling out its best motivated mass range. However, we find that leptophilic ADM remains allowed for $\\gtrsim 10$ GeV DM, including bounds from colliders, direct detection, and stellar heating. We forecast that the Future Circular Collider for electron-positron collisions (FCC-ee) will improve sensitivity to DM-lepton interactions by almost an order of magnitude.\n\n", "2402.17163": "2024-02-27, **FORECASTOR -- II. Simulating Galaxy Surveys with the Cosmological Advanced Survey Telescope for Optical and UV Research**, Madeline A. Marshall et.al., [2402.17163v1](http://arxiv.org/abs/2402.17163v1)\n\n The Cosmological Advanced Survey Telescope for Optical and UV Research (CASTOR) is a planned flagship space telescope, covering the blue-optical and UV part of the spectrum. Here we introduce the CASTOR image simulator, a Python GalSim package-based script capable of generating mock CASTOR images from an input catalogue. We generate example images from the CASTOR Wide, Deep, and Ultra-Deep surveys using simulated light-cones from the Santa Cruz Semi-Analytic Model. We make predictions for the performance of these surveys by comparing galaxies that are extracted from each image using Source Extractor to the input catalogue. We find that the Wide, Deep, and Ultra-Deep surveys will be complete to ~27, 29 and 30 mag, respectively, in the UV, u, and g filters, with the UV-split and u-split filters reaching a shallower depth. With a large area of ~2200 deg$^2$, the Wide survey will detect hundreds of millions of galaxies out to z~4, mostly with $M\\_\\ast \\gtrsim 10^9 M\\_\\odot$. The Ultra-Deep survey will probe to z~5, detecting a large fraction of $M\\_\\ast \\simeq 10^8 M\\_\\odot$ galaxies. These powerful samples will enable precision measurements of the distribution of star formation in the cosmic web, connecting the growth of stellar mass to the assembly of dark matter halos over two thirds of the history of the Universe, and other core goals of CASTOR's legacy surveys. These image simulations and the tools developed to generate them will be a vital planning tool to estimate CASTOR's performance and iterate the telescope and survey designs prior to launch.\n\n", "2402.17140": "2024-02-27, **Direct Detection of Dark Photon Dark Matter with the James Webb Space Telescope**, Haipeng An et.al., [2402.17140v1](http://arxiv.org/abs/2402.17140v1)\n\n In this study, we propose an investigation into dark photon dark matter (DPDM) within the infrared frequency band, utilizing highly sensitive infrared light detectors commonly integrated into space telescopes, such as the James Webb Space Telescope (JWST). The presence of DPDM induces electron oscillations in the reflector of these detectors. Consequently, these oscillating electrons can emit monochromatic electromagnetic waves with a frequency almost equivalent to the mass of DPDM. By employing the stationary phase approximation, we can demonstrate that when the size of the reflector significantly exceeds the wavelength of the electromagnetic wave, the contribution to the electromagnetic wave field at a given position primarily stems from the surface unit perpendicular to the relative position vector. This simplification results in the reduction of electromagnetic wave calculations to ray optics. By applying this concept to JWST, our analysis of observational data demonstrates the potential to establish constraints on the kinetic mixing between the photon and dark photon within the range [10, 500] THz. Despite JWST not being optimized for DPDM searches, our findings reveal constraints comparable to those obtained from the XENON1T experiment in the laboratory, as well as astrophysical constraints from solar emission. Additionally, we explore strategies to optimize future experiments specifically designed for DPDM searches.\n\n"}, "supernova": {"2402.17741": "2024-02-27, **Testing the isotropy of cosmic acceleration with Pantheon+SH0ES: A cosmographic analysis**, Carlos A. P. Bengaly et.al., [2402.17741v1](http://arxiv.org/abs/2402.17741v1)\n\n We use a recent Pantheon+SH0ES compilation of Type Ia Supernova distance measurements at low-redshift, i.e., $0.01 \\leq z \\leq 0.10$, in order to investigate the directional dependency of the deceleration parameter ($q\\_0$) in different patches ($60^{\\circ}$ size) across the sky, as a probe of the statistical isotropy of the Universe. We adopt a cosmographic approach to compute the cosmological distances, fixing $H\\_0$ and $M\\_B$ to reference values provided by the collaboration. By looking at 500 different patches randomly taken across the sky, we find a maximum $\\sim 3\\sigma$ CL anisotropy level for $q\\_0$, whose direction points orthogonally to the CMB dipole axis, i.e., $(RA^{\\rm SN},DEC^{\\rm SN}) = (267^{\\circ},6^{\\circ})$ vs $(RA^{\\rm CMB},DEC^{\\rm CMB}) = (167^{\\circ},-7^{\\circ})$. We assessed the statistical significance of those results, finding that such a signal is expected due to the limitations of the observational sample. These results support that there is no significant evidence for a departure from the cosmic isotropy assumption, one of the pillars of the standard cosmological model.\n\n", "2402.17612": "2024-02-27, **Recovered SN Ia rate from simulated LSST images**, Vincenzo Petrecca et.al., [2402.17612v1](http://arxiv.org/abs/2402.17612v1)\n\n The Legacy Survey of Space and Time (LSST) will revolutionize Time Domain Astronomy by detecting millions of transients. In particular, it is expected to increment the number of type Ia supernovae (SNIa) of a factor of 100 compared to existing samples up to z~1.2. Such a high number of events will dramatically reduce statistical uncertainties in the analysis of SNIa properties and rates. However, the impact of all other sources of uncertainty on the measurement must still be evaluated. The comprehension and reduction of such uncertainties will be fundamental both for cosmology and stellar evolution studies, as measuring the SNIa rate can put constraints on the evolutionary scenarios of different SNIa progenitors. We use simulated data from the DESC Data Challenge 2 (DC2) and LSST Data Preview 0 (DP0) to measure the SNIa rate on a 15 deg2 region of the Wide-Fast-Deep area. We select a sample of SN candidates detected on difference images, associate them to the host galaxy, and retrieve their photometric redshifts (z-phot). Then, we test different light curves classification methods, with and without redshift priors. We discuss how the distribution in redshift measured for the SN candidates changes according to the selected host galaxy and redshift estimate. We measure the SNIa rate analyzing the impact of uncertainties due to z-phot, host galaxy association and classification on the distribution in redshift of the starting sample. We found a 17% average lost fraction of SNIa with respect to the simulated sample. As 10% of the bias is due to the uncertainty on the z-phot alone (which also affects classification when used as a prior), it results to be the major source of uncertainty. We discuss possible reduction of the errors in the measurement of the SNIa rate, including synergies with other surveys, which may help using the rate to discriminate different progenitor models.\n\n", "2402.17365": "2024-02-27, **A Search for Radio Pulsars in Supernova Remnants Using FAST with One Pulsar Discovered**, Zhen Zhang et.al., [2402.17365v1](http://arxiv.org/abs/2402.17365v1)\n\n We report on the results of a search for radio pulsars in five supernova remnants (SNRs) with FAST. The observations were made using the 19-beam receiver in the Snapshot mode. The integration time for each pointing is 10 min. We discovered a new pulsar PSR J1845$-$0306 which has a spin period of 983.6 ms and a dispersion measure of 444.6$\\pm$2.0 cm$^{-3}$ pc in observations of SNR G29.6+0.1. To judge the association between the pulsar and the SNR, further verification is needed. We also re-detected some known pulsars in the data from SNRs G29.6+0.1 and G29.7$-$0.3. No pulsars were detected in observations of other three SNRs.\n\n", "2402.17250": "2024-02-27, **A chemodynamical analysis of bright metal-poor stars from the HESP-GOMPA survey -- Indications of a non-prevailing site for light r-process elements**, Avrajit Bandyopadhyay et.al., [2402.17250v1](http://arxiv.org/abs/2402.17250v1)\n\n We present a comprehensive analysis of the detailed chemical abundances for a sample of 11 metal-poor, very metal-poor and extremely metal-poor stars ([Fe/H] = -1.65 to [Fe/H] = -3.0) as part of the HESP-GOMPA (Galactic survey Of Metal Poor stArs) survey. The abundance determinations encompass a range of elements, including C, Na, Mg, Al, Si, Ca, Sc, Ti, Cr, Mn, Fe, Co, Ni, Cu, Zn, Sr, and Ba, with a subset of the brighter objects allowing for the measurement of additional key elements. Notably, the abundance analysis of a relatively bright highly r-process-enhanced (r-II) star (SDSS J0019+3141) exhibits a predominantly main r-process signature and variations in the lighter r-process elements. Moreover, successful measurements of thorium in this star facilitate stellar age determinations. We find a consistent odd-even nucleosynthesis pattern in these stars, aligning with expectations for their respective metallicity levels, thus implicating Type II supernovae as potential progenitors. From the interplay between the light and heavy r-process elements, we infer a diminishing relative production of light r-process elements with increasing Type II supernova contributions, challenging the notion that Type II supernovae are the primary source of these light r-process elements in the early Milky Way. A chemodynamical analysis based on Gaia astrometric data and our derived abundances indicates that all but one of our program stars are likely to be of accreted origin. Additionally, our examination of alpha-poor stars underscores the occurrence of an early accretion event from a satellite on a prograde orbit, similar to that of the Galactic disc.\n\n"}}