{"neutrino": {"2305.08822": "2023-05-15, **First operation of an ALICE OROC operated in high pressure Ar-CO$_{2}$ and Ar-CH$_{4}$**, A. Ritchie-Yates et.al., [2305.08822v1](http://arxiv.org/abs/2305.08822v1)\n\n New neutrino-nucleus interaction cross-section measurements are required to improve nuclear models sufficiently for future long-baseline neutrino experiments to meet their sensitivity goals. A time projection chamber (TPC) filled with a high-pressure gas is a promising detector to characterise the neutrino sources planned for such experiments. A gas-filled TPC is ideal for measuring low-energy particles as they travel much further in gas than solid or liquid neutrino detectors. Using a high-pressure gas increases the target density, resulting in more neutrino interactions. This paper will examine the suitability of multiwire proportional chambers (MWPCs) taken from the ALICE TPC to be used as the readout chambers of a high-pressure gas TPC. These chambers were previously operated at atmospheric pressure. We tested one such MWPC at up to almost 5 bar absolute (barA) with the UK high-pressure test stand at Royal Holloway, University of London. This paper reports the successful operation of an ALICE TPC outer readout chamber (OROC) at pressures up to 4.8 bar absolute with Ar-CH$\\_{4}$ mixtures with a CH$\\_{4}$ content between 2.8% and 5.0%, and so far up to 4 bar absolute with Ar-CO$\\_{2}$ (90-10). We measured the charge gain of this OROC using signals induced by an $^{55}$Fe source. The largest gain achieved at 4.8 bar was $64\\pm2)\\cdot10^{3}$ at stable conditions with an anode wire voltage of 2990 V in Ar-CH$\\_{4}$ (95.9-4.1). In Ar-CO$\\_{2}$ a gain of $(4.2\\pm0.1)\\cdot10^{3}$ was observed at an anode voltage of 2975 V at 4 barA gas pressure. Based on all our gain measurements, we extrapolate that, at the 10 barA pressure necessary to fit 1 tonne of gas into the ALICE TPC volume, a gain of 5000 in Ar-CO$\\_{2}$ (90-10) (10000 in Ar-CH$\\_{4}$ with $\\sim\\!$ 4% CH$\\_{4}$ content) may be achieved with an OROC anode voltage of 4.2 V ($\\sim\\!$ 3.1 kV).\n\n", "2305.08695": "2023-05-15, **Exploring the Focusing Mechanism of the NuMI Horn Magnets**, Katsuya Yonehara et.al., [2305.08695v1](http://arxiv.org/abs/2305.08695v1)\n\n Neutrinos at the Main Injector (NuMI) is a project at Fermilab that provides an intense beam of neutrinos used by a number of experiments. NuMI creates a beam of pions that decay into neutrinos, muons, and other particles. Muons are registered by the muon monitors. Magnetic horns are the key elements of the NuMI beam line. This paper uses the muon beam profile observed at the muon monitors to study the NuMI horn focusing mechanism. It is found that the horn magnet generates dipole and quadrupole fields to focus pions. This suggests that the optics of the horn magnet are predominantly linear. Our study shows that the muon beam profile accurately detects the horn current within 0.05%.\n\n", "2305.08665": "2023-05-15, **First Physics Results from the FASER Experiment**, Brian Petersen et.al., [2305.08665v1](http://arxiv.org/abs/2305.08665v1)\n\n FASER is a new LHC experiment designed to search for light, weakly-interacting particles that are produced in proton-proton collisions at the ATLAS interaction point and travel in the far-forward direction. The first physics results from the initial year of data-taking are presented. A search for dark photons decaying to an electron-positron pair found no events, yielding new constraints on dark photons with couplings $\\epsilon \\sim 10^{-5} - 10^{-4}$ and masses $\\sim 10$ MeV $- 100$ MeV. A search for muon-neutrino charged-current interactions in a tungsten target at the front of the FASER experiment found $153^{+12}\\_{-13}$ neutrino candidates with a negligible background. The reconstructed charge and momentum distributions imply the observation of both neutrinos and anti-neutrinos with an incident neutrino energy above 200 GeV.\n\n", "2305.08627": "2023-05-15, **Short Baseline Oscillations and the Gallium Mystery**, Vedran Brdar et.al., [2305.08627v1](http://arxiv.org/abs/2305.08627v1)\n\n Data from several neutrino experiments suggest an anomalous neutrino flavor transition across relatively short baselines which is in conflict with the three-flavor neutrino oscillation paradigm. In particular, MiniBooNE and BEST collaborations have reported anomalous findings at $\\sim 5\\sigma$. In this contribution, such measurements and their possible explanations within and beyond the Standard Model are discussed.\n\n", "2305.08593": "2023-05-15, **Precision cosmology with the 21-cm signal from the dark ages**, Rajesh Mondal et.al., [2305.08593v1](http://arxiv.org/abs/2305.08593v1)\n\n The 21-cm signal from the dark ages provides a potential new probe of fundamental cosmology. While exotic physics could be discovered, here we quantify the expected benefits within the standard cosmology. A measurement of the global (sky-averaged) 21-cm signal to the precision of thermal noise from a 1,000 hour integration would yield a $5.5\\%$ measurement of a combination of cosmological parameters. A 10,000 hour integration would improve this to $1.8\\%$, and constrain the cosmic Helium fraction as well as Planck. Precision cosmology with 21-cm fluctuations requires a collecting area of $10\\,{\\rm km}^2$ (which corresponds to 400,000 stations), which with a 1,000 hour integration would exceed the same global case. Enhancing the collecting area or integration time $\\times$10 would yield a $0.5\\%$ parameter combination, a Helium measurement five times better than Planck, and a constraint on the neutrino mass as good as Planck. Our analysis sets a baseline for upcoming lunar and space-based dark ages experiments.\n\n", "2305.08576": "2023-05-15, **Exploring Models with Modular Symmetry in Neutrino Oscillation Experiments**, Priya Mishra et.al., [2305.08576v1](http://arxiv.org/abs/2305.08576v1)\n\n Our study aims to investigate the viability of neutrino mass models that arise from discrete non-Abelian modular symmetry groups, i.e., $\\Gamma\\_N$ with ($N=1,2,3,\\dots$) in the future neutrino experiments T2HK, DUNE, and JUNO. Modular symmetry reduces the usage of flavon fields compared to the conventional discrete flavor symmetry models. Theories based on modular symmetries predict the values of leptonic mixing parameters, and therefore, these models can be tested in future neutrino experiments. In this study, we consider three models based on the $A\\_4$ modular symmetry, i.e., Model-A, B, and C such a way that they predict different values of the oscillation parameters but still allowed with respect to the current data. In the future, it is expected that T2HK, DUNE, and JUNO will measure the neutrino oscillation parameters very precisely, and therefore, some of these models can be excluded in the future by these experiments. We have estimated the prediction of these models numerically and then used them as input to scrutinize these models in the neutrino experiments. Assuming the future best-fit values of $\\theta\\_{23}$ and $\\delta\\_{\\rm CP}$ remain the same as the current one, our results show that at $5 \\sigma$ C.L, Model-A can be excluded by T2HK whereas Model-B can be excluded by both T2HK and DUNE. Model-C cannot be excluded by T2HK and DUNE at $5 \\sigma$ C.L. Further; our results show that JUNO alone can exclude Model-B at an extremely high confidence level if the future best-fit of $\\theta\\_{12}$ remains at the current-one. We have also identified the region in the $\\theta\\_{23}$ - $\\delta\\_{\\rm CP}$ parameter space, for which Model-A cannot be separated from Model-B in T2HK and DUNE.\n\n", "2305.08249": "2023-05-14, **Thermal effects in $ν$ DM production**, Salvador Rosauro-Alcaraz et.al., [2305.08249v1](http://arxiv.org/abs/2305.08249v1)\n\n We study the possibility to produce a keV neutrino dark matter candidate through the two-body decays of heavy neutrinos present in TeV scale neutrino mass generation mechanism. Given that the dark matter production happens at the heavy neutrino scale, namely around the electroweak scale, we address thermal effects and study how these modify the dark matter production rates through freeze-in.\n\n", "2305.08217": "2023-05-14, **Neural Network predictions of inclusive electron-nucleus cross sections**, O. Al Hammal et.al., [2305.08217v1](http://arxiv.org/abs/2305.08217v1)\n\n We investigate whether a neural network approach can reproduce and predict the electron-nucleus cross sections in the kinematical domain of present and future accelerator-based neutrino oscillation experiments. For this purpose, we consider the large amount of data available to the community via the web-page ``Quasielastic Electron Nucleus scattering archive'', and use a residual, fully connected feedforward neural network. We illustrate the training performances of the neural network by comparing its results with experimental data for the electron double-differential cross section on carbon. The agreement between predictions and data is remarkable from quasielastic to deep-inelastic scattering. To test the predicting power of the neural network we consider the numerous kinematical conditions for which experimental cross sections on calcium are available. Furthermore, we show the predictions of the electron scattering cross sections on oxygen, argon, and titanium: nuclei of particular interest in the context of present and future accelerator-based neutrino oscillation program. The agreement between these predictions and the data is comparable to the one of other theoretical models commonly used to calculate electron and neutrino cross sections, such as SuSAv2 and GiBUU. Results obtained with GENIE, a Monte Carlo event generator, are also discussed for comparison. The good performances obtained with our neural network suggest that neural networks could be exploited for theoretical and experimental investigations of electron- and neutrino-nucleus scattering.\n\n", "2305.08095": "2023-05-14, **Exploring Ultralight Scalar Assistance in Sterile Neutrino Dark Matter: Cold Spectrum and Unusual X/Gamma-ray Signatures**, Yuxuan He et.al., [2305.08095v1](http://arxiv.org/abs/2305.08095v1)\n\n We present a scalar-driven sterile neutrino production model where the interaction with the ultralight scalar field modifies the oscillation production of sterile neutrinos in the early universe. The model effectively suppresses the production of sterile neutrinos at low temperatures due to the heavy scalar mass, resulting in a colder matter power spectrum that avoids constraints from small-scale structure observations. In this model, the dominant dark matter relic is from sterile neutrinos, with only a small fraction originating from the ultralight scalar. Furthermore, the model predicts a detectable X/Gamma-ray flux proportional to the cubic density of local sterile neutrinos for a light scalar mass due to the light scalar coupling tosterile neutrinos. This distinguishes our model from normal decaying dark matter, which has a linear dependence on the density. In addition, the model predicts a potential low-energy monochromatic neutrino signal that can be detectable by future neutrino telescopes.\n\n", "2305.08083": "2023-05-14, **Unraveling the puzzle of slow components in two-phase argon detectors for dark matter searches using Thick Gas Electron Multiplier**, A. Buzulutskov et.al., [2305.08083v1](http://arxiv.org/abs/2305.08083v1)\n\n The effect of proportional electroluminescence (EL) is used to record the primary ionization signal (S2) in the gas phase of two-phase argon detectors for dark matter particle (WIMP) searches and low-energy neutrino experiments. Our previous studies of EL time properties revealed the presence of two unusual slow components in S2 signal of two-phase argon detector, with time constants of about 4-5 $\\mu$s and 50 $\\mu$s. The puzzle of slow components is that their time constants and contributions to the overall signal increase with electric field (starting from a certain threshold), which cannot be explained by any of the known mechanisms of photon and electron emission in two-phase media. There are indications that these slow components result from delayed electrons, temporarily trapped during their drift in the EL gap on metastable negative argon ions of yet unknown nature. In this work, this hypothesis is convincingly confirmed by studying the time properties of electroluminescence in a Thick Gas Electron Multiplier (THGEM) coupled to the EL gap of two-phase argon detector. In particular, an unusual slow component in EL signal, similar to that observed in the EL gap, was observed in THGEM itself. In addition, with the help of THGEM operated in electron multiplication mode, the slow component was observed directly in the charge signal, unambiguously confirming the effect of trapped electrons in S2 signal. These results will help to unravel the puzzle of slow components in two-phase argon detectors and thus to understand the background in low-mass WIMP searches.\n\n", "2305.08032": "2023-05-14, **Neutrino forces and experimental probes**, Xun-Jie Xu et.al., [2305.08032v1](http://arxiv.org/abs/2305.08032v1)\n\n Neutrinos as almost massless particles could mediate long-range forces, known as neutrino forces. In this talk, I will introduce some theoretical aspects of neutrino forces, including why the potential of a neutrino force has the $1/r^{5}$ form and how it may vary under different circumstances. Experimental probes and possible implications for cosmology are also briefly discussed.\n\n"}, "dark matter": {"2305.08843": "2023-05-15, **Halos of dark energy**, P. P. Avelino et.al., [2305.08843v1](http://arxiv.org/abs/2305.08843v1)\n\n We investigate the properties of dark energy halos in models with a nonminimal coupling in the dark sector. We show, using a quasistatic approximation, that a coupling of the mass of dark matter particles to a standard quintessence scalar field $\\phi$ generally leads to the formation of dark energy concentrations in and around compact dark matter objects. These are associated with regions where scalar field gradients are large and the dark energy equation of state parameter is close to $-1/3$. We find that the energy and radius of a dark energy halo are approximately given by $E\\_{\\rm halo} \\sim \\boldsymbol{\\beta}^2 \\varphi \\, m$ and $r\\_{\\rm halo} \\sim \\sqrt{\\boldsymbol{\\beta} \\,\\varphi ({R}/{H})}$, where $\\varphi=Gm/(R c^2)$, $m$ and $R$ are, respectively, the mass and radius of the associated dark matter object, $\\boldsymbol{\\beta} = -d \\ln m/d \\phi$ is the nonminimal coupling strength parameter, $H$ is the Hubble parameter, $G$ is the gravitational constant, and $c$ is the speed of light in vacuum. We further show that current observational limits on $\\boldsymbol{\\beta}$ over a wide redshift range lead to stringent constraints on $E\\_{\\rm halo}/m$ and, therefore, on the impact of dark energy halos on the value of the dark energy equation of state parameter. We also briefly comment on potential backreaction effects that may be associated with the breakdown of the quasistatic approximation and determine the regions of parameter space where such a breakdown might be expected to occur.\n\n", "2305.08684": "2023-05-15, **Status and Prospects of PADME**, Susanna Bertelli et.al., [2305.08684v1](http://arxiv.org/abs/2305.08684v1)\n\n The Positron Annihilation to Dark Matter Experiment (PADME) was designed and constructed to search for dark photons ($A'$) in the process $e^+e^-\\rightarrow\\gamma A'$, using the positron beam at the Beam Test Facility (BTF) at the National Laboratories of Frascati (LNF). Since the observation of an anomalous spectra in internal pair creation decays of nuclei seen by the collaboration at the ATOMKI institute, the PADME detector has been modified and a new data-taking run has been undertaken to probe the existance of the so-called ``X17\" particle\n\n", "2305.08662": "2023-05-15, **Precision prediction at the LHC of a democratic up-family philic KSVZ axion model**, Anupam Ghosh et.al., [2305.08662v1](http://arxiv.org/abs/2305.08662v1)\n\n In this work, we study the $SU(2)\\_L$ singlet complex scalar extended KSVZ model that, in addition to providing a natural solution to the strong-CP problem by including a global Peccei-Quinn symmetry, also furnishes two components of dark matter that satisfy observer relic density without fine-tuning of model parameters. Furthermore, this model provides a rich phenomenology by introducing a vector-like quark whose presence can be sensed in collider experiments and dark matter production mechanisms. We explore the possibility of democratic Yukawa interaction of the vector-like quark with all up-type quarks and scalar dark matter candidate. We also employ next-to-leading order NLO-QCD correction for VLQ pair production to study a unique search at the LHC, generating a pair of boosted tops with sizeable missing transverse momentum. Multivariate analysis with jet substructure variables has a strong ability to explore a significant parameter space of this model at the 14 TeV LHC.\n\n", "2305.08364": "2023-05-15, **Emergence of the Gambier equation in cosmology**, D. Batic et.al., [2305.08364v1](http://arxiv.org/abs/2305.08364v1)\n\n We show how the Gambier equation arises in connection to Friedmann-Lema$\\mbox{\\^{i}}$tre-Robertson-Walker (FLRW) cosmology and a Dark Matter equation of state. Moreover, we provide a correspondence between the Friedmann equations and the Gambier equations that possess the Painlev$\\acute{\\mbox{e}}$ property in $2+1$ dimensions. We also consider special cases of the Gambier G27 equation such as the generalized Pinney equation. For an extended FLRW model with dynamic scalar field as matter model, the Einstein equations correspond to the Milne-Pinney equation which in turn can be mapped to the parametric Gambier equation of second order.\n\n", "2305.08199": "2023-05-14, **Modelling the escape of Lyman Continuum photons from galaxies in the Epoch of Reionization**, Jonas Bremer et.al., [2305.08199v1](http://arxiv.org/abs/2305.08199v1)\n\n We couple the DELPHI framework for galaxy formation with a model for the escape of ionizing photons to study both its variability with galaxy assembly and the resulting key reionization sources. In this model, leakage either occurs through a fully ionized gas distribution (ionization bounded) or additionally through channels cleared of gas by supernova explosions (ionization bounded + holes). The escape fraction is therefore governed by a combination of the density and star formation rate. Having calibrated our star formation efficiencies to match high-$z$ observables, we find the central gas density to regulate the boundary between high ($>0.70$) and low ($<0.06$) escape fractions. As galaxies become denser at higher redshifts, this boundary shifts from $M\\_{h}\\simeq 10^{9.5}\\mathrm{M\\_{\\odot}}$ at $z\\sim 5$ to $M\\_{h}\\simeq 10^{7.8}\\mathrm{M\\_{\\odot}}$ at $z\\sim 15$. While leakage is entirely governed through holes above this mass range, it is not affecting general trends for lower masses. We find the co-evolution of galaxy assembly and the degree of leakage to be mass and redshift dependent, driven by an increasing fraction of $f\\_{\\mathrm{esc}}<0.06$ galaxies at increasing mass and redshift. The variability in the escape of ionizing photons is driven by the underlying variations in our dark matter assembly histories. Galaxies with $M\\_h < 10^{7.9} ~ (10^{8.9})M\\_{\\odot}$ provide half of the escaping ionizing emissivity by $z \\sim 10 ~ (5)$ in the ionization bounded model. On the other hand, galaxies that purely leak through holes contribute $6$ $(13)\\%$ at $z\\sim 5$ $(15)$. We end by exploring the impact of two reionization feedback scenarios, in which we suppress the gas content of galaxies with $T\\_{\\mathrm{vir}}<20000\\mathrm{K}$ and $v\\_{c}<30\\mathrm{kms^{-1}}$ residing in ionized regions.\n\n", "2305.08091": "2023-05-14, **Pulsar timing residual induced by ultralight tensor dark matter**, Yu-Mei Wu et.al., [2305.08091v1](http://arxiv.org/abs/2305.08091v1)\n\n Ultralight boson fields, with a mass around $10^{-23}\\text{eV}$, are promising candidates for the elusive cosmological dark matter. These fields induce a periodic oscillation of the spacetime metric in the nanohertz frequency band, which is detectable by pulsar timing arrays. In this paper, we investigate the gravitational effect of ultralight tensor dark matter on the arrival time of radio pulses from pulsars. We find that the pulsar timing signal caused by tensor dark matter exhibits a different angular dependence than that by scalar and vector dark matter, making it possible to distinguish the ultralight dark matter signal with different spins. Combining the gravitational effect and the coupling effect of ultralight tensor dark matter with standard model matter provides a complementary way to constrain the coupling parameter $\\alpha$. We estimate $\\alpha \\lesssim 10^{-6}\\sim 10^{-5}$ in the mass range $m<5\\times 10^{-23}\\mathrm{eV}$ with current pulsar timing array.\n\n"}, "supernova": {"2305.08786": "2023-05-15, **Role of Future SNIa Data from LSST in Reinvestigating Cosmological Models**, Rahul Shah et.al., [2305.08786v1](http://arxiv.org/abs/2305.08786v1)\n\n We study how future Type-Ia supernovae (SNIa) standard candles detected by the Vera C. Rubin Observatory (LSST) can constrain some cosmological models. We use a realistic three-year SNIa simulated dataset generated by the LSST Dark Energy Science Collaboration (DESC) Time Domain pipeline, which includes a mix of spectroscopic and photometrically identified candidates. We combine this data with Cosmic Microwave Background (CMB) and Baryon Acoustic Oscillation (BAO) measurements to estimate the dark energy model parameters for two models- the baseline $\\Lambda$CDM and Chevallier-Polarski-Linder (CPL) dark energy parametrization. We compare them with the current constraints obtained from joint analysis of the latest real data from the Pantheon SNIa compilation, CMB from Planck 2018 and BAO. Our analysis finds tighter constraints on the model parameters along with a significant reduction of correlation between $H\\_0$ and $\\sigma\\_8$. We find that LSST is expected to significantly improve upon the existing SNIa data in the critical analysis of cosmological models.\n\n", "2305.08640": "2023-05-15, **The X-ray binaries in M83: will any of them form gravitational wave sources for LIGO/VIRGO/KAGRA?**, Iwona Kotko et.al., [2305.08640v1](http://arxiv.org/abs/2305.08640v1)\n\n There are 214 X-ray point-sources ($L\\_{\\rm X}>10^{35} \\mathrm{erg/s}$) identified as X-ray binaries (XRBs) in the nearby spiral galaxy M83. Since XRBs are powered by accretion onto a neutron star or a black hole from a companion/donor star these systems are promising progenitors of merging double compact objects (DCOs): black hole - black hole (BH-BH), black hole - neutron star (BH-NS), or neutron star - neutron star (NS-NS) systems. The connection (i.e. XRBs evolving into DCOs) may provide some hints to the yet unanswered question: what is the origin of the LIGO/Virgo/KAGRA mergers? Available observations do not allow to determine what will be the final fate of the XRBs observed in M83. Yet, we can use evolutionary model of isolated binaries to reproduce the population of XRBs in M83 by matching model XRBs numbers/types/luminosities to observations. Knowing the detailed properties of M83 model XRBs (donor/accretor masses, their evolutionary ages and orbits) we follow their evolution to the death of donor stars to check whether any merging DCOs are formed. Although all merging DCOs in our isolated binary evolution model go through the XRB phase (defined as reaching X-ray luminosity from RLOF/wind accretion onto NS/BH above $10^{35}$ erg/s), only very few XRBs evolve to form merging (in Hubble time) DCOs. For M83 with its solar-like metallicity stars and continiuous star-formation we find that only $\\sim 1-2\\%$ of model XRBs evolve into merging DCOs depending on the adopted evolutionary physics. This is caused by (i) merger of donor star with compact object during common envelope phase, (ii) binary disruption at the supernova explosion of donor star, (iii) formation of a DCO on a wide orbit (merger time longer than Hubble time).\n\n", "2305.08575": "2023-05-15, **Fission and fusion of heavy nuclei induced by the passage of a radiation-mediated shock in BNS mergers**, Alon Granot et.al., [2305.08575v1](http://arxiv.org/abs/2305.08575v1)\n\n We compute the structure of a Newtonian, multi-ion radiation-mediated shock for different compositions anticipated in various stellar explosions, including supernovae, gamma-ray bursts, and binary neutron star mergers, using a multi-fluid RMS model that incorporates a self-consistent treatment of electrostatic coupling between the different plasma constituents. We find a significant velocity separation between ions having different charge-to-mass ratios in the immediate shock downstream and demonstrate that in fast enough shocks ion-ion collisions can trigger fusion and fission events at a relatively large rate. Our analysis does not take into account potential kinetic effects, specifically, anomalous coupling through plasma microturbulence, that can significantly reduce the velocity spread downstream, below the activation energy for nuclear reactions. A rough estimate of the scale separation in RMS suggests that for shocks propagating in BNS merger ejecta, the anomalous coupling length may exceed the radiation length, allowing a considerable composition change behind the shock via inelastic collisions of $\\alpha$ particles with heavy elements at shock velocities $\\beta\\_u\\gtrsim0.2$. Moreover, a sufficient abundance of free neutrons upstream of the shock can also trigger fission through neutron capture reactions downstream. The resultant change in the composition profile may affect the properties of the early kilonova emission. The implications for other exploding systems are also briefly discussed.\n\n", "2305.08199": "2023-05-14, **Modelling the escape of Lyman Continuum photons from galaxies in the Epoch of Reionization**, Jonas Bremer et.al., [2305.08199v1](http://arxiv.org/abs/2305.08199v1)\n\n We couple the DELPHI framework for galaxy formation with a model for the escape of ionizing photons to study both its variability with galaxy assembly and the resulting key reionization sources. In this model, leakage either occurs through a fully ionized gas distribution (ionization bounded) or additionally through channels cleared of gas by supernova explosions (ionization bounded + holes). The escape fraction is therefore governed by a combination of the density and star formation rate. Having calibrated our star formation efficiencies to match high-$z$ observables, we find the central gas density to regulate the boundary between high ($>0.70$) and low ($<0.06$) escape fractions. As galaxies become denser at higher redshifts, this boundary shifts from $M\\_{h}\\simeq 10^{9.5}\\mathrm{M\\_{\\odot}}$ at $z\\sim 5$ to $M\\_{h}\\simeq 10^{7.8}\\mathrm{M\\_{\\odot}}$ at $z\\sim 15$. While leakage is entirely governed through holes above this mass range, it is not affecting general trends for lower masses. We find the co-evolution of galaxy assembly and the degree of leakage to be mass and redshift dependent, driven by an increasing fraction of $f\\_{\\mathrm{esc}}<0.06$ galaxies at increasing mass and redshift. The variability in the escape of ionizing photons is driven by the underlying variations in our dark matter assembly histories. Galaxies with $M\\_h < 10^{7.9} ~ (10^{8.9})M\\_{\\odot}$ provide half of the escaping ionizing emissivity by $z \\sim 10 ~ (5)$ in the ionization bounded model. On the other hand, galaxies that purely leak through holes contribute $6$ $(13)\\%$ at $z\\sim 5$ $(15)$. We end by exploring the impact of two reionization feedback scenarios, in which we suppress the gas content of galaxies with $T\\_{\\mathrm{vir}}<20000\\mathrm{K}$ and $v\\_{c}<30\\mathrm{kms^{-1}}$ residing in ionized regions.\n\n", "2305.08145": "2023-05-14, **Constrained $f(Q,T)$ gravity accelerating cosmological model and its dynamical system analysis**, S. A. Narawade et.al., [2305.08145v1](http://arxiv.org/abs/2305.08145v1)\n\n In this paper, we have presented an accelerating cosmological model of the Universe in an extended symmetric teleparallel gravity or $f(Q,T)$ gravity. The parametric form of the Hubble parameter is, $H\\left(z\\right) =H\\_{0}\\left[ \\alpha +\\left( 1-\\alpha \\right) \\left( 1+z\\right) ^{n}\\right] ^{\\frac{3}{2n}}$, where $H\\_0$ and $n$ are constants and for $n=3$, the $\\Lambda$CDM scenario can be obtained. We have considered the logarithmic form of $f(Q,T)$ as, $f(Q,T)=-Q+\\beta \\log\\left(\\frac{Q}{Q\\_{0}}\\right)+\\gamma T$, where $\\beta $ and $\\gamma $ are the free model parameters. Using the Hubble, Baryon Acoustic Oscillations (BAO), and Type Ia Supernovae (SNe Ia) datasets, the present value of the Hubble parameter and other free parameters are constrained. Further other cosmographic and dynamical parameters are presented using the obtained constrained values of the Hubble and free parameters. The model shows the quintessence behavior of the Universe at the present time. The present value of the EoS parameter is obtained as, $\\omega\\_{0}=-0.56$ for the $Hubble+BAO+SNe$ datasets. The energy conditions are presented and the violation of the strong energy condition has been shown. We have performed the dynamical system analysis to validate the stability of the model. From the evolutionary plot obtained through the dynamical system variables, the present value of density parameters have been obtained as $\\Omega\\_m\\approx0.3$ and $\\Omega\\_{de}\\approx0.7$.\n\n"}}