{"neutrino": {"2505.00659": "2025-05-01, **It's All ${\\tt Ok}$: Curvature in Light of BAO from DESI DR2**, Shi-Fan Chen et.al., [2505.00659v1](http://arxiv.org/abs/2505.00659v1)\n\n Recent measurements of baryon acoustic oscillations (BAO) from the Dark Energy Spectroscopic Instrument (DESI) show hints of tension with data from the cosmic microwave background (CMB) when interpreted within the standard model of cosmology. In this short note we discuss the consequences of one solution to this tension, a small but negative spatial curvature with $R\\_k = 21 H\\_0^{-1}$, which DESI measures at $2\\sigma$. We describe the physical role of curvature in cosmological distance measures tied to recombination, i.e. the CMB and BAO, and the relation to neutrino mass constraints which are relaxed to $\\sum m\\_\\nu < 0.10$ eV when curvature is allowed to deviate from zero. A robust detection of negative curvature would have significant implications for inflationary models: improved BAO measurements, particularly from future high-redshift spectroscopic surveys, will be able to distinguish curvature from other solutions to the DESI-CMB tension like phantom dark energy at high significance.\n\n", "2505.00516": "2025-05-01, **First Measurement of the Electron Neutrino Charged-Current Pion Production Cross Section on Carbon with the T2K Near Detector**, K. Abe et.al., [2505.00516v1](http://arxiv.org/abs/2505.00516v1)\n\n The T2K Collaboration presents the first measurement of electron neutrino-induced charged-current pion production on carbon in a restricted kinematical phase space. This is performed using data from the 2.5$^{\\deg}$ off-axis near detector, ND280. The differential cross sections with respect to the outgoing electron and pion kinematics, in addition to the total flux-integrated cross section, are obtained. Comparisons between the measured and predicted cross section results using the Neut, Genie and NuWro Monte Carlo event generators are presented. The measured total flux-integrated cross section is [2.52 $\\pm$ 0.52 (stat) $\\pm$ 0.30 (sys)] x $10^{-39}$ cm$^2$ nucleon$^{-1}$, which is lower than the event generator predictions.\n\n", "2505.00300": "2025-05-01, **Magnetized Accretion onto Neutron Stars: from Photon-trapped to Neutrino-cooled Flows**, Luciano Combi et.al., [2505.00300v1](http://arxiv.org/abs/2505.00300v1)\n\n When a neutron star (NS) intercepts gas from a non-degenerate star, e.g., in a tidal disruption event, a common-envelope phase, or the collapsing core of a massive star, photons become trapped in the hot flow around the NS. This gas forms a radiatively inefficient accretion flow (RIAF) until the density and temperature close to the NS surface grow large enough for binding energy to be converted to neutrinos. Here we present three-dimensional, general-relativistic, magnetohydrodynamic simulations of accretion onto a non-rotating, unmagnetized NS. These connect, for the first time, an extended accretion disk with a self-consistent hydrostatic atmosphere around the star. The impact of different seed magnetic fields and accretion rates is studied by approximating the radiation-pressure dominated flow as an ideal gas with an adiabatic index of $4/3$, coupled to a variable neutrino emissivity. At low accretion rates, the hydrostatic atmosphere shows slow rotation and weak magnetization, transitioning to an outer RIAF structure. A toroidal magnetic field mediates the inward flow of energy and angular momentum through the atmosphere, which reaches a steady state when neutrino emission balances the accretion power. We develop a one-dimensional analytical model connecting these results with more general initial conditions and describing the main features of the flow. Our results have implications for the spin and mass evolution of hypercritically accreting NSs.\n\n"}, "dark matter": {"2505.00563": "2025-05-01, **Dark matter as a vector field: an action principle for the Einstein cluster**, Pedro G. S. Fernandes et.al., [2505.00563v1](http://arxiv.org/abs/2505.00563v1)\n\n We show that a vector field non-minimally coupled to gravity reproduces the dynamics of an Einstein cluster. Our results suggest a vectorial nature for dark matter.\n\n", "2505.00553": "2025-05-01, **The Jackknife method as a new approach to validate strong lens mass models**, Shun Nishida et.al., [2505.00553v1](http://arxiv.org/abs/2505.00553v1)\n\n The accuracy of a mass model in the strong lensing analysis is crucial for unbiased predictions of physical quantities such as magnifications and time delays. While the mass model is optimized by changing parameters of the mass model to match predicted positions of multiple images with observations, positional uncertainties of multiple images often need to be boosted to take account of the complex structure of dark matter in lens objects, making the interpretation of the chi-square value difficult. We introduce the Jackknife method as a new method to validate strong lens mass models, specifically focusing on cluster-scale mass modeling. In this approach, we remove multiple images of a source from the fitting and optimize the mass model using multiple images of the remaining sources. We then calculate the multiple images of the removed source and quantitatively evaluate how well they match the observed positions. We find that the Jackknife method performs effectively in simulations using a simple model. We also demonstrate our method with mass modeling of the galaxy cluster MACS J0647.7+7015. We discuss the potential of using the Jackknife method to validate the error estimation of the physical quantities by the Markov Chain Monte Carlo.\n\n", "2505.00478": "2025-05-01, **Probing ALP-portal Fermionic Dark Matter at the $e^+e^-$ Colliders**, Subhaditya Bhattacharya et.al., [2505.00478v1](http://arxiv.org/abs/2505.00478v1)\n\n Axion-like particles (ALPs) are promising candidates for mediating interactions between a dark sector and the Standard Model (SM). In this work, considering the effective interactions of ALPs with the SM gauge bosons and a fermion dark matter (DM), we explore the DM relic satisfied parameter space and assess its testability through indirect searches. The potential of probing such ALP-portal fermionic DM at electron-positron colliders is investigated with the mono-photon + missing energy final states. We show that a spectacular distinction between the signal and SM background is possible via missing energy variable, the seed of which lies in the ALP-photon interaction, which also governs the relic density of DM. We further discuss the sensitivity of ALP-photon coupling using the $\\chi^2$ analysis at the future electron-positron collider specifications.\n\n", "2505.00324": "2025-05-01, **Interactions of the scalaron dark matter in $f (R)$ gravity**, Yuri Shtanov et.al., [2505.00324v1](http://arxiv.org/abs/2505.00324v1)\n\n In $f(R)$ gravity, the scalaron$\\unicode{x2014}$a scalar degree of freedom arising from modification of General Relativity$\\unicode{x2014}$could account for all dark matter if its mass lies in the meV$\\unicode{x2013}$MeV range. In this work, we revisit the scalaron's interactions with Standard Model particles, assuming their minimal coupling to gravity. In particular, we refine the scalaron decay rate into photons. Assuming the scalaron constitutes all of dark matter, we calculate the average cosmological background radiation produced by these decays. We also estimate the contribution of primordial thermal scalarons to the present dark matter density and find it to be negligible. This supports the original scenario in which the scalaron dark matter behaves as a coherently oscillating field.\n\n"}, "supernova": {"2505.00407": "2025-05-01, **Multiple generation star formation in Cepheus Flare**, Fan Wang et.al., [2505.00407v1](http://arxiv.org/abs/2505.00407v1)\n\n We present an analysis of the young stellar moving group ASCC 127 using Gaia DR3 data, significantly expanding its membership to 3,971 stars -- double the number identified in previous studies. Using kinematic and distance criteria, ASCC 127 is divided into five subgroups (Groups 1-5) with ages spanning from 15 to 32 Myr. Groups 1-5 are spatially linked to the Cepheus Flare star-forming region, revealing potential evidence of four sequential star formation episodes at approximately 32 Myr, 20 Myr, 15 Myr, and 7 Myr. Through dust and gas mapping, we identify a spatial cavity extending several tens of parsecs, which may have resulted from feedback processes such as supernovae associated with earlier generations of stars in the region. This structure, along with the larger Loop III feature, indicates that feedback from massive stars likely influenced the interstellar medium (ISM). By integrating young stellar populations with ISM studies, we provide a detailed picture of the feedback-driven star formation history in the Cepheus Flare region.\n\n"}}