{"neutrino": {"2402.04184": "2024-02-06, **Exciting Prospects for Dark Matter at Large-Volume Neutrino Detectors**, Bhaskar Dutta et.al., [2402.04184v1](http://arxiv.org/abs/2402.04184v1)\n\n We propose a new approach to search for light dark matter (DM) in the range of keV-GeV via inelastic nucleus scattering at large-volume neutrino detectors such as Borexino, DUNE, JUNO, and Hyper-K. The approach uses inelastic nuclear scattering of cosmic-ray boosted DM, enabling a low-background search for DM in these experiments. The large neutrino detectors with higher threshold can be used since the nuclear deexcitation lines are $O(10)$ MeV. Using a hadrophilic dark-gauge-boson-portal model as a benchmark, we show that the nuclear inelastic channels generally provide better sensitivity than the elastic scattering for a large region of light DM parameter space.\n\n", "2402.04040": "2024-02-06, **Status of R-parity violating SUSY**, Arghya Choudhury et.al., [2402.04040v1](http://arxiv.org/abs/2402.04040v1)\n\n In this article, we discuss various phenomenological implications of possible R-parity violating (RPV) supersymmetric scenarios. In this context, the implications of both bilinear and trilinear RPV terms are reviewed from the viewpoint of neutrino physics, anomalous muon magnetic moment, different flavor observables, and collider physics. Apart from discussing the distinctive phenomenological implications of the RPV scenarios, we also survey the updated results from different studies to highlight the present status of the RPV couplings.\n\n", "2402.04011": "2024-02-06, **VLBI Analysis of a Potential High-Energy Neutrino Emitter Blazar**, Janka Kőmíves et.al., [2402.04011v1](http://arxiv.org/abs/2402.04011v1)\n\n Recent studies suggest that high-energy neutrinos can be produced in the jets of blazars, radio-loud active galactic nuclei (AGN) with jets pointing close to the line of sight. Due to the relatively poor angular resolution of current neutrino detectors, several sources can be regarded as the possible counterpart of a given neutrino event. Therefore, follow-up observations of counterpart candidates in the electromagnetic regime are essential. Since the Very Long Baseline Interferometry (VLBI) technique provides the highest angular resolution to study the radio jets of blazars, a growing number of investigations are being conducted to connect individual blazars to given high-energy neutrino events. We analyzed more than 20 years of available archival VLBI data of the blazar CTD 74, which has been listed as a possible counterpart of a neutrino event. Using cm-wavelength data, we investigated the jet structure, determined the apparent speed of jet components, and the core flux density before and after the neutrino event. Our results indicate stationary jet features and a significant brightening of the core after the neutrino event.\n\n", "2402.03596": "2024-02-06, **PandaX-xT: a Multi-ten-tonne Liquid Xenon Observatory at the China Jinping Underground Laboratory**, PandaX Collaboration et.al., [2402.03596v1](http://arxiv.org/abs/2402.03596v1)\n\n We propose a major upgrade to the existing PandaX-4T experiment in the China Jinping Underground Laboratory. The new experiment, PandaX-xT, will be a multi-ten-tonne liquid xenon, ultra-low background, and general-purpose observatory. The full-scaled PandaX-xT contains a 43-tonne liquid xenon active target. Such an experiment will significantly advance our fundamental understanding of particle physics and astrophysics. The sensitivity of dark matter direct detection will be improved by nearly two orders of magnitude compared to the current best limits, approaching the so-called \"neutrino floor\" for a dark matter mass above 10 GeV/$c^2$, providing a decisive test to the Weakly Interacting Massive Particle paradigm. By searching for the neutrinoless double beta decay of $^{136}$Xe isotope in the detector, the effective Majorana neutrino mass can be measured to a [10 -- 41] meV/$c^2$ sensitivity, providing a key test to the Dirac/Majorana nature of neutrino s. Astrophysical neutrinos and other ultra-rare interactions can also be measured and searched for with an unprecedented background level, opening up new windows of discovery. Depending on the findings, PandaX-xT will seek the next stage upgrade utilizing isotopic separation on natural xenon.\n\n"}, "dark matter": {"2402.04176": "2024-02-06, **Low energy effective theories of composite dark matter with real representations**, Joachim Pomper et.al., [2402.04176v1](http://arxiv.org/abs/2402.04176v1)\n\n We consider pseudo Nambu-Goldstone bosons arising from Dirac fermions transforming in real representations of a confining gauge group as dark matter candidates. We consider a special case of two Dirac fermions and couple the resulting dark sector to the Standard Model using a vector mediator. Within this construction, we develop a consistent low energy effective theory, with special attention to Wess-Zumino-Witten term given the topologically non-trivial coset space. We furthermore include the heavier spin-0 flavour singlet state and the spin-1 vector meson multiplet, by using the Hidden Local Symmetry Lagrangian for the latter. Although we concentrate on special case of two flavours, our results are generic and can be applied to a wider variety of theories featuring real representations. We apply our formalism and comment on the effect of the flavour singlet for dark matter phenomenology. Finally, we also comment on generalisation of our formalism for higher representations and provide potential consequences of discrete symmetry breaking.\n\n", "2402.04170": "2024-02-06, **Particle physics and cosmology intertwined**, Pran Nath et.al., [2402.04170v1](http://arxiv.org/abs/2402.04170v1)\n\n While the standard model accurately describes data at the electroweak scale without inclusion of gravity, beyond the standard model physics is increasingly intertwined with gravitational phenomena and cosmology. Thus gravity mediated breaking of supersymmetry in supergravity models lead to sparticles masses, which are gravitational in origin, observable at TeV scales and testable at the LHC, and supergravity also provides a candidate for dark matter, a possible framework for inflationary models and for models of dark energy. Further, extended supergravity models, and string and D-brane models contain hidden sectors some of which may be feebly coupled to the visible sector resulting in heat exchange between the visible and hidden sectors. Because of the couplings between the sectors both particle physics and cosmology are effected. The above implies that particle physics and cosmology are intrinsically intertwined in the resolution of essentially all of the cosmological phenomena such as dark matter and dark energy and in the resolution of cosmological puzzles such as Hubble tension and EDGES anomaly. Here we give a brief overview of the intertwining and implications for the discovery of sparticles, and the resolution of the cosmological anomalies and identification of dark matter and dark energy as major challenges for the coming decades.\n\n", "2402.04123": "2024-02-06, **Hot vs cold hidden sectors and their effects on thermal relics**, Jinzheng Li et.al., [2402.04123v1](http://arxiv.org/abs/2402.04123v1)\n\n A variety of possibilities exist for dark matter aside from WIMPS, such as hidden sector dark matter. We discuss synchronous thermal evolution of visible and hidden sectors and show that the density of thermal relics can change $O(100\\%)$ and $\\Delta N\\_{\\rm eff}$ by a factor of up to $10^5$ depending of whether the hidden sector was hot or cold at the reheat temperature. It is also shown that the approximation of using separate entropy conservation for the visible and hidden sectors is invalid even for a very feeble coupling between the two.\n\n", "2402.04099": "2024-02-06, **Bayesian sensitivity of binary pulsars to ultra-light dark matter**, Pavel Kůs et.al., [2402.04099v1](http://arxiv.org/abs/2402.04099v1)\n\n Ultra-light dark matter perturbs the orbital motion of binary pulsars, in particular by causing peculiar time variations of a binary's orbital parameters, which then induce variations in the pulses' times-of-arrival. Binary pulsars have therefore been shown to be promising detectors of ultra-light dark matter. To date, the sensitivity of binary pulsars to ultra-light dark matter has only been studied for dark matter masses in a narrow resonance band around a multiple of the binary pulsar orbital frequency. In this study we devise a two-step, bayesian method that enables us to compute semi-analytically the sensitivity for all masses, also away from the resonance, and to combine several observed binaries into one global sensitivity curve. We then apply our method to the case of a universal, linearly-coupled, scalar ultra-light dark matter. We find that with next-generation radio observatories the sensitivity to the ultra-light dark matter coupling will surpass that of solar-system constraints for a decade in mass around $m\\sim10^{-21}$ $\\text{eV}$, even beyond resonance.\n\n", "2402.03984": "2024-02-06, **Angular correlation and deformed Hellings-Downs curve by spin-2 ultralight dark matter**, Rong-Gen Cai et.al., [2402.03984v1](http://arxiv.org/abs/2402.03984v1)\n\n The pulsar timings are sensitive to both the nanohertz gravitational-wave background and the oscillation of ultralight dark matter. The Hellings-Downs angular correlation curve provides a criterion to search for stochastic gravitational-wave backgrounds at nanohertz via pulsar timing arrays. We study the angular correlation of the timing residuals induced by the spin-2 ultralight dark matter, which is different from the usual Hellings-Downs correlation. At a typical frequency, we show that the spin-2 ultralight dark matter can give rise to the deformation of the Hellings-Downs correlation curve induced by the stochastic gravitational wave background.\n\n", "2402.03959": "2024-02-06, **Lattice simulation of $SU(2)$ dark glueball with machine learning**, Min-Huan Chu et.al., [2402.03959v1](http://arxiv.org/abs/2402.03959v1)\n\n We study the mass and scattering cross section of $SU(2)$ glueballs as dark matter candidates using lattice simulations. We employ both naive and improved $SU(2)$ gauge actions in $3+1$ dimensions with several $\\beta$ values, and adopt both the tranditional Monte Carlo method and the flow-based model based on machine learning techniques to generate lattice configurations. The mass of the scalar glueball with $J^{PC}=0^{++}$ and the NBS wave function are calculated. Using the Runge-Kutta method, we extract the glueball interaction potential and scattering cross section. From the observational constraints, we obtain the lower bound of the mass of scalar glueball candidates as potential components of dark matter.\n\n", "2402.03934": "2024-02-06, **Confronting primordial black holes with LIGO-Virgo-KAGRA and the Einstein Telescope**, Zu-Cheng Chen et.al., [2402.03934v1](http://arxiv.org/abs/2402.03934v1)\n\n The detection of gravitational waves (GWs) from binary black hole (BBH) coalescences by the LIGO-Virgo-KAGRA (LVK) Collaboration has raised fundamental questions about the genesis of these events. In this chapter, we explore the possibility that PBHs, proposed candidates for dark matter, may serve as the progenitors of the BBHs observed by LVK. Employing a Bayesian analysis, we constrain the PBH model using the LVK third GW Transient Catalog (GWTC-3), revealing that stellar-mass PBHs cannot dominate cold dark matter. Considering a mixed population of astrophysical black holes (ABHs) and PBHs, we determine that approximately $1/4$ of the detectable events in the GWTC-3 can be attributed to PBH binaries. We also forecast detectable event rate distributions for PBH and ABH binaries by the third-generation ground-based GW detectors, such as the Einstein Telescope, offering a potential avenue to distinguish PBHs from ABHs based on their distinct redshift evolutions.\n\n", "2402.03794": "2024-02-06, **Simulating the epoch of Helium Reionization in photon-conserving semi-numerical code SCRIPT**, Akanksha Kapahtia et.al., [2402.03794v2](http://arxiv.org/abs/2402.03794v2)\n\n The reionization of the second electron of helium (HeII) leaves important imprints on the thermal and ionization state of the intergalactic medium (IGM). Observational evidence suggests that HeII reionization ended at $z \\simeq 3$ due to ionizing photons emitted predominantly by quasars. We present efficient semi-numerical simulations of helium reionization in a $230 \\ \\mathrm{h^{-1}~Mpc}$ box, that takes into account the spatial patchiness of reionization coupled with photoheating of the IGM. Dark matter haloes are assigned quasars using empirical measurements of the quasar luminosity function, assuming a universal quasar lifetime consistent with duty cycle values inferred from measurements of the quasar clustering. The ionizing photon field from quasars is then included in the semi-numerical Code for ReionIzation with PhoTon conservation (SCRIPT), which was originally developed for modeling hydrogen reionization. In this work, we make appropriate modifications to SCRIPT for modeling inhomogenous HeII reionization and the corresponding thermal history of the IGM is modelled via a subgrid prescription. Our model has three main free parameters i.e. the global clumping factor $\\mathcal{C}\\_{HeIII}$, the temperature increase due to photoheating $T^{re}\\_{He}$ and the quasar spectral energy distribution (SED) index, $\\alpha\\_{UV}$. Our fiducial model with $\\mathcal{C}\\_{HeIII}=15.6$ and $T^{re}\\_{He} \\sim 6000 \\ K$ gives reasonable values for the empirical measurements of the temperature density equation of state at these redshifts, assuming that quasars brighter than $\\mathrm{M\\_{1450}}<-21$ and having $\\alpha\\_{UV}=1.7$ contribute to HeII reionization. The efficiency of our code shows promising prospects for performing parameter estimation in future, for models of HeII reionization using observations of the Ly$\\alpha$ forest.\n\n", "2402.03751": "2024-02-06, **The first robust evidence showing a dark matter density spike around the supermassive black hole in OJ 287**, Man Ho Chan et.al., [2402.03751v1](http://arxiv.org/abs/2402.03751v1)\n\n Black hole dynamics suggests that dark matter would re-distribute near a supermassive black hole to form a density spike. However, no direct evidence of dark matter density spike around a supermassive black hole has been identified. In this letter, we present the first robust evidence showing a dark matter density spike around a supermassive black hole. We revisit the data of the well-known supermassive black hole binary OJ 287 and show that the inclusion of the dynamical friction due to a dark matter density spike around the supermassive black hole can satisfactorily account for the observed orbital decay rate. The derived spike index $\\gamma\\_{\\rm sp}=2.351^{+0.032}\\_{-0.045}$ gives an excellent agreement with the value $\\gamma\\_{\\rm sp}=2.333$ predicted by the benchmark model assuming an adiabatically growing supermassive black hole. This provides a strong verification of the canonical theory suggested two decades ago modeling the gravitational interaction between collisionless dark matter and supermassive black holes.\n\n", "2402.03632": "2024-02-06, **Development of axion haloscopes for high-mass search at CAPP**, SungWoo Youn et.al., [2402.03632v1](http://arxiv.org/abs/2402.03632v1)\n\n The axion offers a well-motivated solution to two fundamental questions in modern physics: the strong CP problem and the dark matter mystery. Cavity haloscopes, exploiting resonant enhancement of photon signals, provide the most sensitive searches for axion dark matter in the microwave region. However, current experimental sensitivities are limited to the O(10^0) ueV range, while recent theoretical predictions for the axion mass favor up to O(10^2) ueV, suggesting the need of new experimental approaches that are suitable for higher mass regions. CAPP has developed/proposed several haloscopes effective for high-mass axion searches based on new cavity concepts and practical tuning mechanisms. They are characterized by large detection volumes and/or high quality factors at high frequencies, achieved by partitioning a single cavity into multiple cells, exploiting higher-order resonant modes, and constructing dielectric photonic crystal structures. Improving on the dish antenna haloscope scheme, a horn antenna array has also been proposed for volume-efficient broadband search in the THz region. We review these haloscope designs for sensitive search in the high-mass regions and discuss their impacts on future experiments.\n\n", "2402.03606": "2024-02-06, **Shadow bound of black holes with dark matter halo**, Yun Soo Myung et.al., [2402.03606v1](http://arxiv.org/abs/2402.03606v1)\n\n We investigate the shadow cast of black holes immersed in a dark matter halo. We use the M87* shadow data obtained by the EHT collaboration to constrain two parameters ($M,a$) of dark matter halo surrounding a black hole with mass $M\\_{\\rm bh}$. For $a\\ge10.8M$, we find the favored region (shadow bound), while the disfavored region is found for $a<10.8M$ when imposing the EHT results. This shadow bound is much less than the observation bound of galaxies ($a\\ge 10^4 M$).\n\n"}, "supernova": {"2402.03613": "2024-02-06, **Multiphase gas in elliptical galaxies: the role of Type Ia supernovae**, Rajsekhar Mohapatra et.al., [2402.03613v1](http://arxiv.org/abs/2402.03613v1)\n\n Massive elliptical galaxies harbor large amounts of hot gas ($T\\gtrsim10^6~\\mathrm{K}$) in their interstellar medium (ISM) but are typically quiescent in star formation. Active-galactic nuclei (AGNs) jets and Type Ia supernovae (SNIa) inject energy into the ISM which offsets its radiative losses and keeps it hot. SNIa deposit their energy locally within the galaxy compared to the larger few$\\times10~\\mathrm{kpc}$-scale AGN jets. In this study, we perform high-resolution ($512^3$) hydrodynamic simulations of a local ($1~\\mathrm{kpc}^3$) density-stratified patch of massive galaxies' ISM. We include radiative cooling and shell-averaged volume heating, as well as randomly exploding SNIa. We study the effect of different fractions of supernova heating (with respect to the net cooling rate), different initial ISM density/entropy (which controls the thermal-instability growth time $t\\_\\mathrm{ti}$) and different degrees of stratification (which affects the free-fall time $t\\_\\mathrm{ff}$). We find that the SNIa drive predominantly compressive turbulence in the ISM with a velocity dispersion $\\sigma\\_v$ up to $40~\\mathrm{km}s^{-1}$ and logarithmic density dispersion $\\sigma\\_s\\sim0.2$--$0.4$. These fluctuations trigger multiphase condensation in regions of the ISM where $\\min(t\\_\\mathrm{ti})/t\\_\\mathrm{ff}\\lesssim 0.6\\exp(6 \\sigma\\_s)$, in agreement with theoretical expectations that large density fluctuations efficiently trigger multiphase gas formation. Since the SNIa rate is not self-adjusting, when the net cooling drops below the net heating rate the SNIa drive a hot wind which sweeps out most of the mass in our local model. Global simulations are required to assess the ultimate fate of this gas.\n\n"}}