{"neutrino": {"2410.24125": "2024-10-31, **Dirac Leptogenesis in Left-Right Symmetric Models**, K. S. Babu et.al., [2410.24125v1](http://arxiv.org/abs/2410.24125v1)\n\n Left-right symmetric models which employ a generalized seesaw mechanism to generate quark and charged lepton masses are known to solve the strong CP problem via parity symmetry, without the need for the axion. These models lead to naturally light Dirac neutrinos with their masses arising through radiatve corrections. In this work, we show how baryogenesis via Dirac leptogenesis can be implemented in this framework. A pair of left-right symmetric scalar doublets $\\phi\\_{L,R}$ carrying $(B-L)$ charge of $3$ is introduced for this purpose, which preserves the parity solution to the strong CP problem. Small neutrino masses are generated through one-loop diagrams mediated by these scalars. The decay of vector-like leptons ($E\\_i$) involved in the seesaw mechanism to generate charged lepton masses, $E\\_i \\rightarrow \\overline{\\nu}\\_{jR} \\,\\phi\\_R^-$, creates a right-handed neutrino ($\\nu\\_{R}$) asymmetry, while preserving total lepton number. The compensating lepton asymmetry is converted to baryon asymmetry via electroweak sphalerons. We show that for a large range of model parameters successful baryogenesis can be realized, with the $W\\_R^\\pm$ gauge boson mass being as low as $10^6$ GeV.\n\n", "2410.24103": "2024-10-31, **Non-holomorphic modular $A_{5}$ symmetry for lepton masses and mixing**, Cai-Chang Li et.al., [2410.24103v1](http://arxiv.org/abs/2410.24103v1)\n\n We perform a comprehensive bottom-up study of all the simplest lepton models based on non-holomorphic $A\\_{5}$ modular flavor symmetry, in which neutrinos are assumed to be Majorana particles and their masses are generated by the Weinberg operator or the type I seesaw mechanism. In the case that the generalized CP (gCP) symmetry is not considered, we find that 21 Weinberg operator models and 174 seesaw models can accommodate the experimental data in lepton sector, and all of them depend on six dimensionless free parameters and two overall scales. If gCP symmetry compatible with $A\\_{5}$ modular symmetry is imposed, one more free parameter would be reduced. Then only 4 of the 21 Weinberg operator models and 100 of the 174 seesaw models agree with the experimental data on lepton masses and mixing parameters. Furthermore, we perform a detailed numerical analysis for two example models for illustration.\n\n", "2410.24099": "2024-10-31, **Characterization of the optical model of the T2K 3D segmented plastic scintillator detector**, S. Abe et.al., [2410.24099v1](http://arxiv.org/abs/2410.24099v1)\n\n The magnetised near detector (ND280) of the T2K long-baseline neutrino oscillation experiment has been recently upgraded aiming to satisfy the requirement of reducing the systematic uncertainty from measuring the neutrinonucleus interaction cross section, which is the largest systematic uncertainty in the search for leptonic charge-parity symmetry violation. A key component of the upgrade is SuperFGD, a 3D segmented plastic scintillator detector made of approximately 2,000,000 optically-isolated 1 cm3 cubes. It will provide a 3D image of GeV neutrino interactions by combining tracking and stopping power measurements of final state particles with sub-nanosecond time resolution. The performance of SuperFGD is characterized by the precision of its response to charged particles as well as the systematic effects that might affect the physics measurements. Hence, a detailed Geant4 based optical simulation of the SuperFGD building block, i.e. a plastic scintillating cube read out by three wavelength shifting fibers, has been developed and validated with the different datasets collected in various beam tests. In this manuscript the description of the optical model as well as the comparison with data are reported.\n\n", "2410.23926": "2024-10-31, **Large neutrino mass in cosmology and keV sterile neutrino dark matter from a dark sector**, Cristina Benso et.al., [2410.23926v1](http://arxiv.org/abs/2410.23926v1)\n\n We consider an extended seesaw model which generates active neutrino masses via the usual type-I seesaw and leads to a large number of massless fermions as well as a sterile neutrino dark matter (DM) candidate in the $\\mathcal{O}(10-100) {\\rm~keV}$ mass range. The dark sector comes into thermal equilibrium with Standard Model neutrinos after neutrino decoupling and before recombination via a U(1) gauge interaction in the dark sector. This suppresses the abundance of active neutrinos and therefore reconciles sizeable neutrino masses with cosmology. The DM abundance is determined by freeze-out in the dark sector, which allows avoiding bounds from X-ray searches. Our scenario predicts a slight increase in the effective number of neutrino species $N\\_{\\rm eff}$ at recombination, potentially detectable by future CMB missions.\n\n", "2410.23833": "2024-10-31, **Performance tests and hardware qualification of the FEBs for the Super-FGD of T2K Phase II**, Lorenzo Giannessi et.al., [2410.23833v1](http://arxiv.org/abs/2410.23833v1)\n\n T2K is a long baseline neutrino experiment, entering Phase II with a Near Detector upgrade. The T2K near detector (ND280) upgrade consists of the installation of three new detector systems: a plastic scintillator neutrino active target (Super-FGD), two time projection chambers (HA-TPC) and a time of flight detector (TOF). The Super-FGD is composed of 2-million 1 cm-cube scintillating cubes read by almost 60 thousand wavelength-shifting (WLS) fibers coupled to an MPPC on one end. Given the large number of channels, the limited space inside magnetic environment, and the limited time from production to installation, the development and testing of the Front-end electronics boards (FEB) for the read-out of the Super-FGD channels represented a challenging task for the success of the upgrade. This work presents the performance tests confirming that the FEB aligns with detector requirements, and the hardware qualification of 240 FEBs through a custom QC test bench designed to detect and locate hardware failures to speed up the repairing process. Installation of the electronics in the detector took place in March 2024, one year after the beginning of the FEB mass production, and the first successful neutrino beam run took place in June of the same year.\n\n", "2410.23756": "2024-10-31, **Disentangling data contributions to the precision measurement of the largest leptonic mixing angle**, P. T. Quyen et.al., [2410.23756v1](http://arxiv.org/abs/2410.23756v1)\n\n Leptonic mixing, together with the massiveness of neutrinos, is one of the most significant discoveries in contemporary particle physics. The observed differences in the mixing patterns of quarks and leptons may shed light on our understanding of the three-generation structure of the Standard Model. This study examines the precise measurement of the largest leptonic mixing angle $\\theta\\_{23}$ through the analysis of neutrino oscillation data samples. Our findings indicate that, contrary to common understanding, the ${\\nu}\\_{\\mu}(\\bar{\\nu}\\_{\\mu})\\rightarrow {\\nu}\\_{e}(\\bar{\\nu}\\_{e})$ appearance samples, rather than the ${\\nu}\\_{\\mu}(\\bar{\\nu}\\_{\\mu})\\rightarrow \\nu\\_{\\mu}(\\bar{\\nu}\\_{\\mu})$ disappearance samples, are sensitive to test the hypothesis of maximal mixing $\\theta\\_{23}=\\pi/4$, particularly if $\\theta\\_{23}$ resides in the higher octant and $\\sin^2\\theta\\_{23}<0.54$. The former serves as the primary source for determining the octant of the $\\theta\\_{23}$ mixing angle; however, the latter remains relevant if $\\theta\\_{23}$ is indeed in the lower octant with $\\sin^2\\theta\\_{23}<0.42$. In a joint T2HK and DUNE analysis, utilizing only appearance sub-samples can exclude the maximal-mixing and determine the actual octant for about 60\\% of the currently allowed range of the $\\theta\\_{23}$ angle. We argue that, despite the presence of parameter degeneracy, the precise measurement of $\\theta\\_{23}$ exhibits minimal dependence on other unknown factors, including the CP-violation phase and neutrino mass ordering.\n\n", "2410.23712": "2024-10-31, **Phenomenology of a singlet-doublet-triplet scotogenic framework**, Maud Sarazin et.al., [2410.23712v1](http://arxiv.org/abs/2410.23712v1)\n\n We present an extensive phenomenological study of a scotogenic framework including a scalar singlet, a scalar doublet, a fermionic doublet, and two generations of a fermionic triplet, allowing to provide three non-zero neutrino masses and three viable dark matter candidates. Using a Markov Chain Monte Carlo numerical technique, we probe the parameter space of the model in view of numerous constraints stemming from dark matter, the neutrino sector, and lepton-flavour violating transitions. The dark matter mass distribution of phenomenologically viable scenarios exhibits three very predictive peaks at 550 GeV, 1080 GeV, and 2300 GeV. In all viable parameter regions, the observed relic density is achieved through dominant co-annihilations. Future experiments will be able to probe a large number of the currently viable parameter space, while certain parameter configurations promise interesting collider signatures. For related studies, five typical parameter configurations are given in SLHA format.\n\n"}, "dark matter": {"2410.24197": "2024-10-31, **Generative modelling for mass-mapping with fast uncertainty quantification**, Jessica J. Whitney et.al., [2410.24197v1](http://arxiv.org/abs/2410.24197v1)\n\n Understanding the nature of dark matter in the Universe is an important goal of modern cosmology. A key method for probing this distribution is via weak gravitational lensing mass-mapping - a challenging ill-posed inverse problem where one infers the convergence field from observed shear measurements. Upcoming stage IV surveys, such as those made by the Vera C. Rubin Observatory and Euclid satellite, will provide a greater quantity and precision of data for lensing analyses, necessitating high-fidelity mass-mapping methods that are computationally efficient and that also provide uncertainties for integration into downstream cosmological analyses. In this work we introduce MMGAN, a novel mass-mapping method based on a regularised conditional generative adversarial network (GAN) framework, which generates approximate posterior samples of the convergence field given shear data. We adopt Wasserstein GANs to improve training stability and apply regularisation techniques to overcome mode collapse, issues that otherwise are particularly acute for conditional GANs. We train and validate our model on a mock COSMOS-style dataset before applying it to true COSMOS survey data. Our approach significantly outperforms the Kaiser-Squires technique and achieves similar reconstruction fidelity as alternative state-of-the-art deep learning approaches. Notably, while alternative approaches for generating samples from a learned posterior are slow (e.g. requiring $\\sim$10 GPU minutes per posterior sample), MMGAN can produce a high-quality convergence sample in less than a second.\n\n", "2410.24082": "2024-10-31, **First Light and Reionisation Epoch Simulations (FLARES) XVII: Learning the galaxy-halo connection at high redshifts**, Maxwell G. A. Maltz et.al., [2410.24082v1](http://arxiv.org/abs/2410.24082v1)\n\n Understanding the galaxy-halo relationship is not only key for elucidating the interplay between baryonic and dark matter, it is essential for creating large mock galaxy catalogues from N-body simulations. High-resolution hydrodynamical simulations are limited to small volumes by their large computational demands, hindering their use for comparisons with wide-field observational surveys. We overcome this limitation by using the First Light and Reionisation Epoch Simulations (FLARES), a suite of high-resolution (M\\_gas = 1.8 x 10^6 M\\_Sun) zoom simulations drawn from a large, (3.2 cGpc)^3 box. We use an extremely randomised trees machine learning approach to model the relationship between galaxies and their subhaloes in a wide range of environments. This allows us to build mock catalogues with dynamic ranges that surpass those obtainable through periodic simulations. The low cost of the zoom simulations facilitates multiple runs of the same regions, differing only in the random number seed of the subgrid models; changing this seed introduces a butterfly effect, leading to random differences in the properties of matching galaxies. This randomness cannot be learnt by a deterministic machine learning model, but by sampling the noise and adding it post-facto to our predictions, we are able to recover the distributions of the galaxy properties we predict (stellar mass, star formation rate, metallicity, and size) remarkably well. We also explore the resolution-dependence of our models' performances and find minimal depreciation down to particle resolutions of order M\\_DM ~ 10^8 M\\_Sun, enabling the future application of our models to large dark matter-only boxes.\n\n", "2410.23631": "2024-10-31, **Direct Detection of Dark Baryons Naturally Suppressed by $\\mathcal{H}$-parity**, Pouya Asadi et.al., [2410.23631v1](http://arxiv.org/abs/2410.23631v1)\n\n We identify symmetries in a broad class of vector-like confining dark sectors that forbid the leading electromagnetic moments that would ordinarily mediate dark baryon scattering with the Standard Model. The absence of these operators implies dark baryon dark matter has much smaller cross sections for elastic scattering off nuclei, leading to suppressed direct detection signals. In the confined description, we identify an ``$\\mathcal{H}$-parity'' symmetry that exists in any dark sector with dark quarks transforming under a vector-like representation of a new confining SU($N\\_c$) gauge theory as well as a vector-like representation of the electroweak group SU(2)$\\_L$. The parity is independent of $N\\_c$ and $N\\_f$, though it is essential that the dark quarks are neutral under hypercharge. This parity forbids dark hadron electric and magnetic dipole moments, charge radius, and anapole moment, while permitting dimension-7 operators that include polarizability, electroweak loop-induced interactions, as well as lower dimensional electromagnetic $\\textit{transition}$ moments between different neutral dark baryon states. We work out an explicit example, $N\\_c=N\\_f=3$, that is the most minimal theory with fermionic dark baryons. In this specific model, we use the non-relativistic quark model to show the magnetic dipole moment and charge radius vanish while the transition moments are non-zero, consistent with $\\mathcal{H}$-parity. We discuss the implications of a suppressed direct detection signal, emphasizing that this broad class of models provide a well-motivated target for future colliders.\n\n"}, "supernova": {"2410.24173": "2024-10-31, **StarDICE III: Characterization of the photometric instrument with a Collimated Beam Projector**, Thierry Souverin et.al., [2410.24173v1](http://arxiv.org/abs/2410.24173v1)\n\n The measurement of type Ia supernovae magnitudes provides cosmological distances, which can be used to constrain dark energy parameters. Large photometric surveys require a substantial improvement in the calibration precision of their photometry to reduce systematic uncertainties in cosmological constraints. The StarDICE experiment is designed to establish accurate broadband flux references for these surveys, aiming for sub-percent precision in magnitude measurements. This requires a precise measurement of the filter bandpasses of both the StarDICE and survey instruments with sub-nanometer accuracy. To that end, we have developed the Collimated Beam Projector (CBP), an optical device capable of calibrating the throughput of an astronomical telescope and of its filters. The CBP is built from a tunable laser source and a reversed telescope to emit a parallel monochromatic light beam that is continuously monitored in flux and wavelength. The CBP output light flux is measured using a large area photodiode, previously calibrated relative to a NIST photodiode. We derive the StarDICE telescope throughput and filter transmissions from the CBP measurements, anchoring it to the absolute calibration provided by the NIST. After analyzing the systematic uncertainties, we achieved sub-nanometer accuracy in determining filter central wavelengths, measured each filter transmission with a precision of 0.5% per 1nm bin, and detected out-of-band leakages at 0.01%. Furthermore, we have synthesized the equivalent transmission for full pupil illumination from four sample positions in the StarDICE telescope mirror, with an accuracy of approximately 0.2nm for central wavelengths and 7mmag for broadband fluxes. We demonstrated our ability to characterize a telescope throughput down to the mmag, and paved the way for future developments, such as a portable CBP version for in-situ transmission monitoring.\n\n", "2410.24134": "2024-10-31, **Measurement of the power spectrum turnover scale from the cross-correlation between CMB lensing and {\\sl Quaia}**, David Alonso et.al., [2410.24134v1](http://arxiv.org/abs/2410.24134v1)\n\n We use the projected clustering of quasars in the Gaia-unWISE quasar catalog, Quaia, and its cross-correlation with CMB lensing data from Planck, to measure the large-scale turnover of the matter power spectrum, associated with the size of the horizon at the epoch of matter-radiation equality. The turnover is detected with a significance of between $2.3$ and $3.1\\sigma$, depending on the method used to quantify it. From this measurement, the equality scale is determined at the $\\sim20\\%$ level. Using the turnover scale as a standard ruler alone (discarding information from the large-scale curvature of the power spectrum), in combination with supernova data through an inverse distance ladder approach, we measure the current expansion rate to be $H\\_0=62.7\\pm17.2\\,{\\rm km}\\,{\\rm s}^{-1}\\,{\\rm Mpc}^{-1}$. The addition of information coming from the power spectrum curvature approximately halves the standard ruler uncertainty. Our measurement in combination with calibrated supernovae from Pantheon$+$ and SH0ES constrains the CMB temperature to be $T\\_{\\rm CMB}=3.10^{+0.48}\\_{-0.36}\\,{\\rm K}$, independently of CMB data. Alternatively, assuming the value of $T\\_{\\rm CMB}$ from COBE-FIRAS, we can constrain the effective number of relativistic species in the early Universe to be $N\\_{\\rm eff}=3.0^{+5.8}\\_{-2.9}$.\n\n", "2410.23959": "2024-10-31, **CEERS: Forging the First Dust -- Transition from Stellar to ISM Grain Growth in the Early Universe**, Denis Burgarella et.al., [2410.23959v1](http://arxiv.org/abs/2410.23959v1)\n\n We investigate the coevolution of metals and dust for 173 galaxies at 4.0<z<11.4 observed with JWST/NIRSpec. We use the code CIGALE that integrates photometric and spectroscopic data. Our analysis reveals a critical transition at Mstar = 10^8.5 MSun, from galaxies dominated by supernovae and AGB stardust, to those dominated by grain growth. This implies a two-mode building of dust mass, supported by model predictions. The detection of stardust galaxies provides a natural and inherent explanation to the excess of UV-bright galaxies at z>10 by JWST. Besides, we observe that the metallicity of galaxies at z>8 presents a metal-to-stellar mass ratio larger than a few 10^-3, above a floor. This suggests a very fast rise of metals at high redshift, impacting the tentative detections of population III objects.\n\n", "2410.23576": "2024-10-31, **On the initial spin periods of magnetars born in weak supernova explosions and their gravitational wave radiation**, Yu-Long Yan et.al., [2410.23576v1](http://arxiv.org/abs/2410.23576v1)\n\n The initial spin periods of newborn magnetars are \\textbf{strongly associated with the origin of their strong magnetic fields, both of which can affect the electromagnetic radiation and gravitational waves (GWs) emitted at their birth.} Combining the upper limit $E\\_{\\rm SNR}\\lesssim10^{51}$ erg on the explosion energies of \\textbf{the supernova (SN) remnants around slowly-spinning magnetars} with a detailed investigation on the evolution of newborn magnetars, we set constraints on the initial spin periods of magnetars \\textbf{born in weak SN explosions}. Depending on the conversion efficiency $\\eta$ of the electromagnetic energy of \\textbf{these} newborn magnetars into the kinetic energy of SN ejecta, the minimum initial spin periods of \\textbf{these} newborn magnetars are $P\\_{\\rm i, min}\\simeq 5-6$ ms for an ideal efficiency $\\eta=1$, $P\\_{\\rm i, min}\\simeq 3-4$ ms for a possible efficiency $\\eta=0.4$, and $P\\_{\\rm i, min}\\simeq 1-2$ ms for a relatively low efficiency $\\eta=0.1$. \\textbf{Based on these constraints and adopting reasonable values for the physical parameters of the newborn magnetars, we find that their GW radiation at $\\nu\\_{\\rm e,1}=\\nu$ may be undetectable by the Einstein Telescope (ET) since the maximum signal-to-noise ratio (${\\rm S/N}$) is only 2.41 even the sources are located at a very close distance of 5 Mpc, where $\\nu$ are the spin frequencies of the magnetars. At such a distance, the GWs emitted at $\\nu\\_{\\rm e,2}=2\\nu$ from the newborn magnetars with dipole fields $B\\_{\\rm d}=5\\times10^{14}$ and $10^{15}$ G may be detectable by the ET because ${\\rm S/N}$ are 10.01 and 19.85, respectively. However, if these newborn magnetars are located at $20$ Mpc away in the Virgo supercluster, no GWs could be detected by the ET due to low ${\\rm S/N}$.\n\n", "2410.23572": "2024-10-31, **Detection of the extended $γ$-ray emission from the new supernova remnant G321.3-3.9 with Fermi-LAT**, Xiaolei Guo et.al., [2410.23572v1](http://arxiv.org/abs/2410.23572v1)\n\n With the 15 yrs of Pass 8 data recorded by the {\\em Fermi} Large Area Telescope, we report the detection of an extended gigaelectronvolt emission component with a 68\\% containment radius of $0^{\\circ}\\!.85$, which is spatially associated with the newly identified supernova remnant (SNR) G321.3-3.9. The $\\gamma$-ray spectrum is best described by a log-parabola model in the energy range of 100 MeV - 1 TeV, which shows a significant spectral curvature at $\\sim$ 1 GeV. Either a leptonic or a hadronic model could explain the multi-wavelength data of G321.3-3.9, while the leptonic model predicts a too low strength of magnetic field. Also considering the flat radio spectrum of G321.3-3.9 and the $\\gamma$-ray upper limit in the low energy band, the hadronic model is favored. The spatial coincidence between the $\\gamma$-ray morphology and the diffuse thermal X-ray emission of G321.3-3.9 and the curved gigaelectronvolt $\\gamma$-ray spectrum of it make G321.3-3.9 to be similar to the typical middle-aged SNRs interacting with molecular clouds. Such characteristics provide another evidence of the potential hadronic origin for its $\\gamma$-ray emission. While there is no molecular cloud detected around G321.3-3.9, which challenges the hadronic model.\n\n"}}