{"neutrino": {"2503.20732": "2025-03-26, **Nuclear recoil detection with color centers in bulk lithium fluoride**, Gabriela A. Araujo et.al., [2503.20732v1](http://arxiv.org/abs/2503.20732v1)\n\n We present initial results on nuclear recoil detection based on the fluorescence of color centers created by nuclear recoils in lithium fluoride. We use gamma rays, fast and thermal neutrons, and study the difference in responses they induce, showing that this type of detector is rather insensitive to gamma rays. We use light-sheet fluorescence microscopy to image nuclear recoil tracks from fast and thermal neutron interactions deep inside a cubic-centimeter sized crystal and demonstrate automated feature extraction in three dimensions using machine learning tools. The number, size, and topology of the events agree with expectations based on simulations with TRIM. These results constitute the first step towards 10-1000g scale detectors with single-event sensitivity for applications such as the detection of dark matter particles, reactor neutrinos, and neutrons.\n\n", "2503.20650": "2025-03-26, **The core software and simulation activities for data analysis at the Pierre Auger Observatory**, Eva Santos et.al., [2503.20650v1](http://arxiv.org/abs/2503.20650v1)\n\n The Pierre Auger Observatory, located near the town Malarg\\\"ue in the province of Mendoza, Argentina, is the largest cosmic-ray detector in existence, covering an area of 3000 km2. The upgraded Observatory, in Phase II of operations, consists of a surface array of 1660 stations combining water Cherenkov, scintillator, and radio detectors. A subset of stations also includes underground muon detectors. Additionally, fluorescence detectors located at four sites overlook the array. The science goals for the enhanced Observatory include the measurement of the properties of ultra-high-energy cosmic rays with large statistics and high sensitivity to the primary composition. The Observatory is also sensitive to photons and neutrinos at the highest energies, allowing it to participate in multi-messenger studies. The Auger Offline Framework provides the tools to perform detailed simulations, using the Geant 4 toolkit, of all components of the Observatory and the analysis of both data and simulated events. It proved to have the flexibility needed to evolve during the lifetime of the Observatory, to accommodate new sub-detectors and, recently, changes to the station readout electronics. A new challenge is interfacing the framework with Machine Learning tools for both the development and execution of neural-network-based algorithms. Independent of the framework, CORSIKA 7 is used to simulate particles, fluorescence light, and radio signals produced by air showers. The production of simulations is coordinated centrally to provide standard libraries for analyses and to optimize the use of computing resources. We will describe the evolution and status of the Offline Framework and the tools used to coordinate the simulation efforts. We will also discuss the challenges of the massive simulation efforts and the resources consumed to provide the simulation libraries required by the Collaboration.\n\n", "2503.20597": "2025-03-26, **To detect strong nugget with an acoustic array**, Haoyang Qi et.al., [2503.20597v1](http://arxiv.org/abs/2503.20597v1)\n\n This article discusses strong nuggets (SNs) which means strong interaction condensed matter clusters with a mass of about $10^6\\,$g. They may originate from the early universe, supernova, pulsar merger event, and so on. Depending on the equation of state, the SNs could be stable and even be one of the candidates for dark matter. In order to detect SNs which hitting the Earth or the Moon at a non-relativistic velocity, a new messenger, the acoustic array, is analysed. The results of the calculations show that the impact signal of an SN can be detected at a distance of about 30 kilometers from the nugget's trajectory. By using microphone boxes, hydrophones or seismographs to construct an array in the bedrock, ocean or on the Moon, it is possible to reconstruct the velocity, mass, and interacting cross section of SNs, and then constrain also the nature of supra-nuclear matter. The acoustic array can also be used for distributed acoustic sensing of meteorites or earthquakes. The sonar localisation system on the proposed High-energy Underwater Neutrino Telescope (HUNT) is suggested as a pathfinder for acoustic array detection.\n\n", "2503.20443": "2025-03-26, **Light exposure and temperature effects on quantum efficiency of bialkali metal photomultipier tubes**, Antonio De Benedittis et.al., [2503.20443v1](http://arxiv.org/abs/2503.20443v1)\n\n In astroparticle experiments, photomultiplier tubes are crucial for detecting Cherenkov radiation emitted by charged particles, owing to their exceptional sensitivity to low-intensity light, which is essential for studying high-energy phenomena associated with astrophysical neutrinos. However, due to their high sensitivity, PMTs are vulnerable to significant damage to their photocathode coating when exposed to intense light and/or high temperatures. Although this scenario is rare under controlled conditions, it can become relevant in experiments with prolonged exposure to sunlight and elevated temperatures.   This study presents an analysis of the damage threshold and recovery time of photomultipliers with bialkali metal coatings. The investigation involved measuring the quantum efficiency of the PMTs before and after exposure to a xenon lamp for varying durations, simulating sunlight exposure over several days. Additionally, quantum efficiency was assessed before and after the PMTs were subjected to thermal stress, providing an evaluation of their performance under different thermal conditions.\n\n", "2503.20238": "2025-03-26, **Quantum circuits for simulating neutrino propagation in matter**, Sandeep Joshi et.al., [2503.20238v1](http://arxiv.org/abs/2503.20238v1)\n\n Quantum simulation of particle phenomena is a rapidly advancing field of research. With the widespread availability of quantum simulators, a given quantum system can be simulated in numerous ways, offering flexibility in implementation and exploration. Here, we perform quantum simulation of neutrino propagation in matter, a phenomenon that plays a crucial role in neutrino oscillations. We present quantum circuits with novel gate arrangements to simulate neutrino propagation in both constant and varying matter density profiles. The oscillation probabilities are determined by encoding and measuring the qubit states in the neutrino flavor basis, showing excellent agreement with theoretical predictions.\n\n", "2503.20219": "2025-03-26, **Multi-threaded Simulation Software for the JUNO Experiment**, Peidong Yu et.al., [2503.20219v1](http://arxiv.org/abs/2503.20219v1)\n\n The Jiangmen Underground Neutrino Observatory (JUNO) is a multi-purpose experiment under construction in southern China. JUNO aims to determine the neutrino mass ordering and precisely measure the neutrino oscillation parameters by detecting reactor neutrinos from nuclear power plants. In addition to reactor neutrinos, JUNO can study atmospheric neutrinos, solar neutrinos, geo-neutrinos, supernova burst neutrinos, the Diffuse Supernova Neutrino Background (DSNB), and nucleon decay, covering an energy range from keV to TeV. JUNO consists of a 20 kton liquid scintillator detector, equipped with 17,612 20-inch PMTs and 25,600 3-inch PMTs, achieving a 3\\% energy resolution (at 1~MeV). Precise simulation plays a crucial role in the experiment. Developed using the SNiPER framework and Geant4 toolkit, the JUNO simulation software is a key component of the JUNO offline software (JUNOSW). The large detector size and the broad energy range of interest pose challenges for detector simulation in terms of CPU time and memory consumption. As the computing nodes shift to include multiple integrated CPU cores, traditional single-threaded computing model can lead to large memory footprints and inefficient use of system resources. Multi-threading on many-core architectures can significantly improve resource utilization. This paper introduces the design and implementation of multi-threaded simulation software for the JUNO experiment.\n\n", "2503.20043": "2025-03-25, **Measurement of charged-current $ν_μ$ and $\\barν_μ$ cross sections on hydrocarbon in a shallow inelastic scattering region**, A. Lozano et.al., [2503.20043v1](http://arxiv.org/abs/2503.20043v1)\n\n This MINERvA analysis is the first neutrino and antineutrino study of a shallow inelastic scattering region, which is the transition region between resonant production and deep inelastic scattering processes. This transition is explicitly included in this study by expanding the scope of shallow inelastic scattering to include not only the mainly lower-$Q^2$ nonresonant pion production but also the kinematic region where pion production off quarks within the nucleon becomes significant with $Q^2$ below the onset of the deep-inelastic scattering region defined in this analysis. To reduce the resonance background the kinematic region 1.5 $<$ $W$ $<$ 2 GeV/$c^2$ was chosen. In addition to the inclusive differential cross section measurements, to emphasize SIS interactions off quarks within the nucleon a sample with $Q^2$ $\\geq$ 1 GeV/$c^2$ was also analyzed. The measurements of one-dimensional cross sections at $\\left\\langle E\\_\\nu \\right\\rangle \\sim 6$ GeV on hydrocarbon of $Q^2$, Bjorken x and muon momentum variables are compared with modified predictions from the GENIE 2 neutrino generator as well as predictions of other neutrino simulators GiBUU, NEUT, NuWro and an alternative GENIE 3 version. Significant discrepancies both in shape and magnitude between measurements and neutrino simulator predictions of all variables have been observed.\n\n", "2503.20017": "2025-03-25, **Testable dark matter solution within the seesaw mechanism**, A. Abada et.al., [2503.20017v1](http://arxiv.org/abs/2503.20017v1)\n\n The presence of a dark matter component in the Universe, together with the discovery of neutrino masses from the observation of the oscillation phenomenon, represents one of the most important open questions in particle physics today. A concurrent solution arises when one of the right-handed neutrinos, necessary for the generation of light neutrino masses, is itself the dark matter candidate. In this article, we study the generation of such a dark matter candidate relying solely on the presence of neutrino mixing. This tightly links the generation of dark matter with searches in laboratory experiments on top of the usual indirect dark matter probes. We find that the regions of parameter space producing the observed dark matter abundance can be probed indirectly with electroweak precision observables and charged lepton flavor violation searches. Given that the heavy neutrino masses need to lie at most around the TeV scale, probes at future colliders would further test this production mechanism.\n\n", "2503.19973": "2025-03-25, **Multi-messenger Gravitational Lensing**, Graham P. Smith et.al., [2503.19973v1](http://arxiv.org/abs/2503.19973v1)\n\n We introduce the rapidly emerging field of multi-messenger gravitational lensing - the discovery and science of gravitationally lensed phenomena in the distant universe through the combination of multiple messengers. This is framed by gravitational lensing phenomenology that has grown since the first discoveries in the 20th century, messengers that span 30 orders of magnitude in energy from high energy neutrinos to gravitational waves, and powerful \"survey facilities\" that are capable of continually scanning the sky for transient and variable sources. Within this context, the main focus is on discoveries and science that are feasible in the next 5-10 years with current and imminent technology including the LIGO-Virgo-KAGRA network of gravitational wave detectors, the Vera C. Rubin Observatory, and contemporaneous gamma/X-ray satellites and radio surveys. The scientific impact of even one multi-messenger gravitational lensing discovery will be transformational and reach across fundamental physics, cosmology and astrophysics. We describe these scientific opportunities and the key challenges along the path to achieving them. This article is the introduction to the Theme Issue of the Philosophical Transactions of The Royal Society A on the topic of Multi-messenger Gravitational Lensing, and describes the consensus that emerged at the associated Theo Murphy Discussion Meeting in March 2024.\n\n", "2503.19960": "2025-03-25, **Signatures of quasi-Dirac neutrinos in diffuse high-energy astrophysical neutrino data**, Kiara Carloni et.al., [2503.19960v1](http://arxiv.org/abs/2503.19960v1)\n\n We search for signatures of extremely long-baseline oscillations between left- and right-handed neutrinos using the high-energy astrophysical neutrino spectra measured by IceCube. We assume the astrophysical neutrino sources to be distributed in redshift following the star formation rate and use the IceCube all-sky flux measurements from TeV to PeV energies. We find, for the first time, that $\\delta m^2$ in the range $2\\times 10^{-19}$ to $3 \\times 10^{-18}\\textrm{eV}^2$ is disfavored at the $3\\sigma$ confidence level, while there exists a preference for a $\\delta m^2$ of $1.9 \\times 10^{-19}\\textrm{eV}^2$ at $2.8\\sigma$. This preference for quasi-Dirac neutrinos is driven by the tension between cascade and track measurements below $30~\\textrm{TeV}$.\n\n", "2503.19775": "2025-03-25, **Prospects and Opportunities with an upgraded FASER Neutrino Detector during the HL-LHC era: Input to the EPPSU**, FASER Collaboration et.al., [2503.19775v1](http://arxiv.org/abs/2503.19775v1)\n\n The FASER experiment at CERN has opened a new window in collider neutrino physics by detecting TeV-energy neutrinos produced in the forward direction at the LHC. Building on this success, this document outlines the scientific case and design considerations for an upgraded FASER neutrino detector to operate during LHC Run 4 and beyond. The proposed detector will significantly enhance the neutrino physics program by increasing event statistics, improving flavor identification, and enabling precision measurements of neutrino interactions at the highest man-made energies. Key objectives include measuring neutrino cross sections, probing proton structure and forward QCD dynamics, testing lepton flavor universality, and searching for beyond-the-Standard Model physics. Several detector configurations are under study, including high-granularity scintillator-based tracking calorimeters, high-precision silicon tracking layers, and advanced emulsion-based detectors for exclusive event reconstruction. These upgrades will maximize the physics potential of the HL-LHC, contribute to astroparticle physics and QCD studies, and serve as a stepping stone toward future neutrino programs at the Forward Physics Facility.\n\n", "2503.19946": "2025-03-25, **Measurement of $β$-particles to determine cross sections relevant to the weak r-process**, Sándor R. Kovács et.al., [2503.19946v1](http://arxiv.org/abs/2503.19946v1)\n\n The neutron-rich isotopes with 30 $\\leq$ Z $\\leq$ 45 are thought to be synthesised in neutrino-driven winds after the collapse of a massive star. This nucleosynthesis scenario, called the weak r-process, is studied using nuclear reaction network calculations. The accuracy of the nucleosynthesis simulations is strongly influenced by the reliability of the nuclear physics input parameters used. Recently, it has been demonstrated that ($\\alpha$,n) reactions play a particularly important role in the weak r-process, but their rates -- computed from the cross sections -- are only known with large uncertainties in the astrophysically relevant temperature range. The half-lives of the products of some key reactions are such that, in principle, the cross sections can be studied using the activation technique. In many cases, however, the $\\beta$-decay of the reaction products leads to the ground state of the daughter nucleus, hence no gamma emission occurs. The purpose of this manuscript is to present our setup with which we determine the cross sections by measuring the yield of $\\beta$-particles emitted during radioactive decay. The $^{86}$Kr($\\alpha$,n)$^{89}$Sr reaction cross-section measurement is used, as a case study.\n\n", "2503.19251": "2025-03-25, **A new type of lepton seesaw model in a modular $A_4$ symmetry**, Takaaki Nomura et.al., [2503.19251v1](http://arxiv.org/abs/2503.19251v1)\n\n We propose a new type of lepton seesaw model introducing a modular $A\\_4$ flavor symmetry in which isospin doublet vector fermions play an important role in constructing seesaw mechanisms for both the charged-lepton mass matrix and the neutrino one. The charged-lepton mass matrix is induced via the Dirac seesaw with a two-by-two block mass matrix. On the other hand, the neutrino mass matrix is generated via a seesaw with four-by-four block mass matrix where the right-handed neutral fermions are also added. Remarkably the neutral fermion mass matrix provides us a new type of seesaw formula for active neutrino mass. Through our chi square analysis, we find some tendencies about observables focusing on two fixed points $\\tau=i,\\ \\omega$.\n\n", "2503.19227": "2025-03-25, **Ultra-High-Energy Neutrinos from Primordial Black Holes**, Alexandra P. Klipfel et.al., [2503.19227v1](http://arxiv.org/abs/2503.19227v1)\n\n The KM3NeT Collaboration recently announced the detection of a neutrino with energy 220 PeV. The highest-energy neutrino ever measured, this observation is difficult to reconcile with known cosmic ray acceleration mechanisms. One possible source of ultra-high-energy particles is the rapid, violent emission of energetic Hawking radiation from a primordial black hole (PBH) near the end of its evaporation lifetime. Realistic formation mechanisms that would produce a population of PBHs very early in cosmic history yield a mass distribution with a power-law tail for small masses; members of such a population that formed with initial mass $M\\_* = 5.34 \\times 10^{14} {\\rm g}$ would be undergoing late-stage evaporation today. We find that recent high-energy neutrino events detected by the IceCube and KM3NeT Collaborations, with energies in the range ${\\cal O} (1 - 10^2) \\, {\\rm PeV}$, are consistent with event-rate expectations if a significant fraction of the dark matter consists of PBHs that obey a well-motivated mass distribution compatible with current evaporation constraints.\n\n"}, "dark matter": {"2503.20738": "2025-03-26, **Freeze-in and Freeze-out production of Higgs Portal Majorana Fermionic Dark Matter during and after Reheating**, Rajesh Mondal et.al., [2503.20738v1](http://arxiv.org/abs/2503.20738v1)\n\n In this paper, we investigate the production of Majorana fermionic dark matter (DM) via the Higgs portal, considering both freeze-in and freeze-out mechanisms during and after the post-inflationary reheating phase. We assume that the Universe is reheated through the decay of the inflaton into a pair of massless fermions. Our analysis focuses on how the non-standard evolution of the Hubble expansion rate and the thermal bath temperature during reheating influence DM production. Additionally, we examine the impact of electroweak symmetry breaking (EWSB), distinguishing between scenarios where DM freeze-in or freeze-out occurs before or after EWSB. We further explore the viable DM parameter space and its compatibility with current and future detection experiments, including XENONnT, LUX-ZEPLIN (LZ), XLZD, and collider searches. Moreover, we incorporate constraints from the Lyman-$\\alpha$ bound to ensure consistency with small-scale structure formation.\n\n", "2503.20696": "2025-03-26, **Immortality through the dark forces: Dark-charge primordial black holes as dark matter candidates**, Jessica Santiago et.al., [2503.20696v1](http://arxiv.org/abs/2503.20696v1)\n\n The fact that no Hawking radiation from the final stages of evaporating primordial black holes (PBHs) has yet been observed places stringent bounds on their allowed contribution to dark matter. Concretely, for Schwarzschild PBHs, i.e., uncharged and non-rotating black holes, this rules out black hole masses of less than $10^{-15} M\\_{\\odot}$. In this article, we propose that by including an additional 'dark' $U(1)$ charge one can significantly lower the PBHs' Hawking temperature, slowing down their evaporation process and significantly extending their lifetimes. With this, PBHs again become a viable option for dark matter candidates over a large mass range. We will explore in detail the effects of varying the dark electron (lightest dark charged fermion) mass and charge on the evaporation dynamics. For instance, we will show that by allowing the dark electron to have a sufficiently high mass and/or low charge, our approach suppresses both Hawking radiation and the Schwinger effect, effectively extending even the lifespan of PBHs with masses smaller than $10^{-15} M\\_{\\odot}$ beyond the current age of the universe. We will finally present a new lower bound on the allowed mass range for dark-charged PBHs as a function of the dark electron charge and mass, showing that the PBHs' mass can get to at least as low as $10^{-24}M\\_\\odot$ depending on the dark electron properties. This demonstrates that the phenomenology of the evaporation of PBHs is ill-served by a focus solely on Schwarzschild black holes.\n\n", "2503.20432": "2025-03-26, **Exploring the Dark Universe: A European Strategy for Axions and other WISPs Discovery**, Deniz Aybas et.al., [2503.20432v1](http://arxiv.org/abs/2503.20432v1)\n\n Axions and other very weakly interacting slim (with $m <$ 1 GeV) particles (WISPs) are a common feature of several extensions of the Standard Model of Particle Physics. The search of WISPs was already recommended in the last update of the European strategy on particle physics (ESPP). After that, the physics case for WISPs has gained additional momentum. Indeed, WISPs may provide a new paradigm to explain the nature of dark matter and puzzling astrophysical and particle physics observations. This document briefly summarizes current searches for WISPs and the perspectives in this research field for the next decade, ranging from their theoretical underpinning, over their indirect observational consequences in astrophysics, to their search in laboratory experiments. It is stressed that in Europe a rich, diverse, and low-cost experimental program is already underway with the potential for one or more game-changing discoveries. In this context, it is also reported the role of the EU funded COST Action ''Cosmic WISPers in the Dark Universe: Theory, astrophysics, and experiments'' (CA21106, https://www.cost.eu/actions/CA21106) in coordinating and supporting WISPs searches in Europe, shaping a roadmap to track the strategy to guarantee a European leadership in this field of research. This document has been submitted in March 2025 as an input to the update process of the ESPP.\n\n", "2503.20270": "2025-03-26, **Constraints on Velocity and Spin Dependent Exotic Interaction at the Millimeter Scale with a Diamagnetic-levitated Force Sensor**, Kenan Tian et.al., [2503.20270v1](http://arxiv.org/abs/2503.20270v1)\n\n Light bosons, beyond the standard model and as prominent candidates for dark matter, can mediate velocity and spin dependent exotic interaction between electron spins and nucleons. At short ranges, it remains an open challenge to test this exotic interaction with high precision. Here, we present a method based on diamagnetic-levitated force sensor to detect the exotic interaction at the millimeter scale. Improved constraints for the coupling $g\\_A^e g\\_V^N$ are established, within the force range spanning from 0.15 mm to 1.5 mm. And the constraint $\\|g\\_A^e g\\_V^N\\| \\leq 4.39 \\times10^{-26}$ at $\\lambda$ = 0.5 mm at the $95 \\%$ confidence level, significantly surpasses previous results by more than three orders of magnitude. The diamagnetic levitation force measurement system developed here can also be repurposed to probe other exotic spin-dependent interactions, such as the exotic spin-spin interaction. This system provides a platform for the exploration of dark matter.\n\n", "2503.20033": "2025-03-25, **Search for dark matter production in association with a single top quark in proton-proton collisions at $\\sqrt{s}$ = 13 TeV**, CMS Collaboration et.al., [2503.20033v1](http://arxiv.org/abs/2503.20033v1)\n\n A search for the production of a single top quark in association with invisible particles is performed using proton-proton collision data collected with the CMS detector at the LHC at $\\sqrt{s}$ = 13 TeV, corresponding to an integrated luminosity of 138 fb$^{-1}$. In this search, a flavor-changing neutral current produces a single top quark or antiquark and an invisible state nonresonantly. The invisible state consists of a hypothetical spin-1 particle acting as a new mediator and decaying to two spin-1/2 dark matter candidates. The analysis searches for events in which the top quark or antiquark decays hadronically. No significant excess of events compatible with that signature is observed. Exclusion limits at 95% confidence level are placed on the masses of the spin-1 mediator and the dark matter candidates, and are compared to constraints from the dark matter relic density measurements. In a vector (axial-vector) coupling scenario, masses of the spin-1 mediator are excluded up to 1.85 (1.85) TeV with an expectation of 2.0 (2.0) TeV, whereas masses of the dark matter candidates are excluded up to 0.75 (0.55) TeV with an expectation of 0.85 (0.65) TeV.\n\n", "2503.19964": "2025-03-25, **Phenomenological implications of a class of non-invertible selection rules**, Motoo Suzuki et.al., [2503.19964v1](http://arxiv.org/abs/2503.19964v1)\n\n Through well-motivated models in particle physics, we demonstrate the power of a general class of selection rules from non-invertible fusion algebra that are only exact at low orders in perturbation theory. Surprisingly, these non-invertible selection rules can even be applied to the minimal extension of the Standard Model, which is to add a gauge-singlet real scalar. In this model, we show that Fibonacci fusion rules can lead to experimentally testable features for the scattering processes of the real scalar. We anticipate that this class of non-invertible selection rules can be applied to a wide range of models beyond the Standard Model. To further strengthen our methodology, we discuss a dark matter model based on the Ising fusion rules, where the dark matter is labeled by the non-invertible element in the algebra, hence its stability is preserved at all loop orders.\n\n", "2503.19870": "2025-03-25, **Backlighting extended gas halos around luminous red galaxies: kinematic Sunyaev-Zel'dovich effect from DESI Y1 x ACT**, Bernardita Ried Guachalla et.al., [2503.19870v1](http://arxiv.org/abs/2503.19870v1)\n\n The gas density profile around galaxies, shaped by feedback and affecting the galaxy lensing signal, is imprinted on the cosmic microwave background (CMB) by the kinematic Sunyaev-Zel'dovich effect (kSZ). We precisely measure this effect ($S/N\\approx 10$) via velocity stacking with $825,283$ spectroscopically confirmed luminous red galaxies (LRG) from the Dark Energy Spectroscopic Instrument (DESI) Y1 survey, which overlap with the Atacama Cosmology Telescope (ACT) Data Release 6 temperature maps over $\\geq 4,000 \\text{deg}^2$. We explore the kSZ dependence with various galaxy parameters. We find no significant trend with redshift, but clear trends with stellar mass and absolute magnitude in $g$, $r$, and $z$ bands. We highlight new challenges when comparing data and hydrodynamical simulations. Our simple and most conservative analysis suggests that the gas is more extended than the dark matter (99.5% confidence, i.e. PTE = 0.005). It also hints at a preference for galaxy formation models with more feedback (Illustris $z=0.5$, PTE = 0.37) rather than less (Illustris TNG $z=0.8$, PTE = 0.045), though with less statistical significance. In all cases, a free multiplicative amplitude was fit to the simulated profiles, and further modeling work is required to firm up these conclusions. We find consistency between kSZ profiles around spectroscopic and photometric LRG, with comparable statistical power, thus increasing our confidence in the photometric analysis. Additionally, we present the first kSZ measurement around DESI Y1 bright galaxy sample (BGS) and emission-line galaxies (ELG), whose features match qualitative expectations. Finally, we forecast $S/N \\sim 50$ for future stacked kSZ measurements using data from ACT, DESI Y3, and Rubin Observatory. These measurements will serve as an input for galaxy formation models and baryonic uncertainties in galaxy lensing.\n\n", "2503.19691": "2025-03-25, **Strongly Interacting Dark Matter admixed Neutron Stars**, Yannick Dengler et.al., [2503.19691v1](http://arxiv.org/abs/2503.19691v1)\n\n Dark matter may accumulate in neutron stars given its gravitational interaction and abundance. We investigate the modification of neutron star properties and confront them with the observations in the context of strongly-interacting dark matter scenario, specifically for a QCD-like theory with G$\\_2$ gauge group for which a first-principles equation-of-state from lattice calculations is available. We study the impact of various observational constraints and modeling of the QCD equation of state on the combined neutron stars. The results indicate that dark matter masses of a few hundred MeV to a few GeV are consistent with the latest observed neutron star properties.\n\n", "2503.19660": "2025-03-25, **Effect of ultralight dark matter on compact binary mergers**, Kabir Chakravarti et.al., [2503.19660v1](http://arxiv.org/abs/2503.19660v1)\n\n The growing catalogue of gravitational wave events enables a statistical analysis of compact binary mergers, typically quantified by the merger rate density. This quantity can be influenced by ambient factors, following which, in this work we have investigated the impact of dark matter environment on the merger statistics. We construct a baseline astrophysical model of compact binary mergers and extend it by incorporating a model of ultra light dark matter, which affects the orbital evolution of binaries through accretion and dynamical friction. Our analysis of the merged population of binary progenitors demonstrates that, compared to the baseline model, ULDM can significantly alter the merger statistics when its ambient density becomes larger than 104GeV/cm3. A comparison with the gravitational wave data from the GWTC-3 catalogue provides insight into potential observational signatures of the ULDM in merger events, leading to possible constraints on the existence and density of dark matter distribution in galaxies.\n\n", "2503.19559": "2025-03-25, **Combined Annual Modulation Dark Matter Search with COSINE-100 and ANAIS-112**, N. Carlin et.al., [2503.19559v1](http://arxiv.org/abs/2503.19559v1)\n\n The annual modulation signal, claimed to be consistent with dark matter as observed by DAMA/LIBRA in a sodium-iodide based detector, has persisted for over two decades. COSINE-100 and ANAIS-112 were designed to test the claim directly using the same target material. COSINE-100, located at Yangyang Underground Laboratory in South Korea, and ANAIS-112, located at Canfranc Underground Laboratory in Spain, have been taking data since 2016 and 2017, respectively. Each experiment published its respective results independently. In this paper, we present the results of an annual modulation search as a test of the signal observed by DAMA/LIBRA with the first three respective years of data from COSINE-100 and ANAIS-112. Using a Markov Chain Monte Carlo method, we find best fit values for modulation amplitude of $-0.0002 {\\pm} 0.0026$ cpd/kg/keV in the 1-6 keV and $0.0021 {\\pm} 0.0028$ cpd/kg/keV in the 2-6 keV energy regions. These results are not compatible with DAMA/LIBRA's assertion for their observation of annual modulation at $3.7{\\sigma}$ and $2.6{\\sigma}$, respectively. Performing a simple combination of the newly released 6-years datasets from both experiments find values consistent with no modulation at $0.0005 {\\pm} 0.0019$ cpd/kg/keV in the 1-6 keV and $0.0027 {\\pm} 0.0021$ cpd/kg/keV in the 2-6 keV energy regions with $4.68{\\sigma}$ and $3.53{\\sigma}$ respective exclusions of the DAMA/LIBRA signal.\n\n", "2503.19552": "2025-03-25, **Cylindrical Euler--Poisson Equation in a Chaplygin Gas Medium**, Balázs Endre Szigeti et.al., [2503.19552v1](http://arxiv.org/abs/2503.19552v1)\n\n We studied the Euler--Poisson equation system in the case of cylindrical symmetry with the von Neumann--Sedov--Taylor type of self-similar Ansatz and present scaling solutions. We have analyzed the scenario governed by Chaplygin's equation of state, which has historically been studied as a unifying framework of dark fluid for dark matter and dark energy.\n\n", "2503.19414": "2025-03-25, **Direct Collapse Supermassive Black Holes from Ultralight Dark Matter**, Hao Jiao et.al., [2503.19414v1](http://arxiv.org/abs/2503.19414v1)\n\n We study the possibility that parametric resonant excitation of photons in an ultralight dark matter halo could generate the required flux of Lyman-Werner photons to allow the direct collapse formation of supermassive black hole seeds.\n\n", "2503.19938": "2025-03-25, **Thermodynamics, Weak Gravitational Lensing, and Parameter Estimation of a Schwarzschild Black Hole Immersed in Hernquist Dark Matter Halo**, Sohan Kumar Jha et.al., [2503.19938v1](http://arxiv.org/abs/2503.19938v1)\n\n In this article, we obtain a novel black hole (BH) solution of a Schwarzschild BH immersed in a Hernquist dark matter (SBHD) halo. The thermodynamic properties of the resultant spacetime are then studied to gauge the impact of dark matter (DM) on the local and global stability of the composite system of the BH-DM halo. With the intention of finding imprints of DM, we then studied weak gravitational lensing (GL) and shadow. Both display significant dependence on the DM parameters - core radius $r\\_s$ and core density $\\rho\\_s$. Finally, we constrain DM parameters by utilizing bounds on the deviation parameter $\\delta$ for super-massive BHs (SMBHs) $M87^*$ and $Sgr A^*$ reported by Event horizon telescope (EHT), Keck, and VLTI observatories. Our analysis finds SBHD congruent with experimental observations, thereby making it a feasible candidate for an SMBH.\n\n"}, "supernova": {"2503.20506": "2025-03-26, **Common envelopes in massive stars III: The obstructive role of radiation transport in envelope ejection**, Mike Y. M. Lau et.al., [2503.20506v1](http://arxiv.org/abs/2503.20506v1)\n\n We present 3D radiation hydrodynamics simulations of common-envelope (CE) evolution involving a 12 solar mass red supergiant donor and a 3 solar mass companion. Existing 3D simulations are predominantly adiabatic, focusing strongly on low-mass donors on the red giant and asymptotic giant branches. However, the adiabatic assumption breaks down once the perturbed CE material becomes optically thin or when entering a longer-timescale evolutionary phase after the dynamical plunge-in. This is especially important for high-mass red supergiant donors, which have short thermal timescales, adding significant uncertainty in understanding how massive binary stars evolve into gravitational-wave sources, X-ray binaries, stripped-envelope supernovae, and more. We compare our radiation hydrodynamics simulations with an adiabatic simulation from Paper I that is otherwise identical, finding that radiative diffusion strongly inhibits CE ejection. The fraction of ejected mass is roughly half that of the adiabatic case when recombination energy release is not included. Almost no material is ejected during the dynamical plunge-in, and longer-timescale ejection during the slow spiral-in is suppressed. However, the orbital separation reached at the end of the dynamical plunge-in does not differ significantly. The large amount of remaining bound mass tentatively supports the emerging view that the dynamical plunge-in is followed by a non-adiabatic phase, during which a substantial fraction of the envelope is ejected and the binary orbit may continue to evolve.\n\n", "2503.20002": "2025-03-25, **Predictions for new physics in the CMB damping tail**, Tristan L. Smith et.al., [2503.20002v1](http://arxiv.org/abs/2503.20002v1)\n\n Ever since the Planck satellite measured the the cosmic microwave background (CMB) down to arcminute angular scales the mismatch between the CMB-inferred value of the Hubble constant and the value inferred from the distance ladder (i.e., the Hubble tension) has been a growing concern and is currently at the $\\sim 6 \\sigma$ level. There are a handful of proposed mechanisms operating in the early universe which have shown some promise in resolving the Hubble tension. These mechanisms are expected to leave a measurable impact on the smallest scale CMB anisotropy, deep in the damping tail. Using current CMB data, baryonic acoustic oscillation data, and the luminosities of type Ia supernovae as a baseline, we compute the predicted small-scale CMB power spectra for a characteristic set of these models. We find that near-future CMB data should be able to detect some but not all of the investigated models.\n\n", "2503.19969": "2025-03-25, **Inferring CSM Properties of Type II SNe Using a Magnitude-Limited ZTF Sample**, K-Ryan Hinds et.al., [2503.19969v1](http://arxiv.org/abs/2503.19969v1)\n\n Although all Type II supernovae (SNe) originate from massive stars possessing a hydrogen-rich envelope, their light curve morphology is diverse, reflecting poorly characterised heterogeneity in the physical properties of their progenitor systems. Here, we present a detailed light curve analysis of a magnitude-limited sample of 639 Type II SNe from the Zwicky Transient Facility Bright Transient Survey. Using Gaussian processes, we systematically measure empirical light curve features (e.g. rise times, peak colours and luminosities) in a robust sampling-independent manner. We focus on rise times as they are highly sensitive to pre-explosion progenitor properties, especially the presence of a dense circumstellar medium (CSM) shed by the progenitor in the years immediately pre-explosion. By correlating our feature measurements with physical parameters from an extensive grid of STELLA hydrodynamical models with varying progenitor properties (CSM structure, $\\dot M$, $R\\_{CSM}$ and $M\\_{ZAMS}$), we quantify the proportion of events with sufficient pre-explosion mass-loss to significantly alter the initial light curve (roughly $M\\_{CSM} \\geq 10^{-2.5} M\\_{\\odot}$) in a highly complete sample of 377 spectroscopically classified Type II SNe. We find that 67 $\\pm$ 6\\% of observed SNe in our magnitude-limited sample show evidence for substantial CSM ($M\\_{CSM} \\geq 10^{-2.5} M\\_{\\odot}$) close to the progenitor ($R\\_{CSM} <10^{15}$ cm) at the time of explosion. After applying a volumetric-correction, we find 36$^{+5}\\_{-7}$\\% of all Type II SN progenitors possess substantial CSM within $10^{15}$ cm at the time of explosion. This high fraction of progenitors with dense CSM, supported by photometric and spectroscopic evidence of previous SNe, reveals mass-loss rates significantly exceeding those measured in local group red supergiants or predicted by current theoretical models.\n\n", "2503.19961": "2025-03-25, **HD 144812: A transition-phase massive star in a binary system**, Michalis Kourniotis et.al., [2503.19961v1](http://arxiv.org/abs/2503.19961v1)\n\n In this Letter, we shed light on the evolutionary phase of HD 144812, a Galactic yellow supergiant showing infrared excess that is typically expected for evolved stars undergoing enhanced mass-loss activity. We present high-resolution spectroscopy of the star in the $H-$ and $K-$band acquired with the GRating INfrared Spectrometer (IGRINS) and further explore multi-band imaging of the wider field of view from the ultraviolet to the radio regime. The IGRINS data reveal several lines from the hydrogen series and iron in a double-peaked emission and we here suggest, that HD 144812 is orbited by a disk-hosting companion. Furthermore, we report emission in the CO band heads of the star that is modeled to arise from a circum-stellar/binary disk (or ring) of ejected gas. The latter consists of material that is expected to have been dredged up from the core of the star to its surface during a prior phase as a red supergiant (RSG). These findings together suggest that HD 144812 is a rare, post-RSG star in a binary system, encouraging further investigation on the effect that the stellar encounters have on triggering instabilities and driving the evolution of the primary star shortly prior to the supernova event.\n\n", "2503.19898": "2025-03-25, **Non-minimally coupled gravity constraints from DESI DR2 data**, Jiaming Pan et.al., [2503.19898v1](http://arxiv.org/abs/2503.19898v1)\n\n It has been observed that the hint about phantom crossing in the DESI BAO observation might point to non-minimally coupled gravity. We analyzed DESI DR2 BAO together with CMB and Type Ia supernova data to constrain non-minimal coupling of gravity in the effective field theory (EFT) approach. Using a non-parametric method to infer the EFT functions, we found that with DESI BAO, DESY5 SN, and Planck CMB data the signal for non-minimal coupling reaches $\\sim3\\sigma$. It is found that current data can constrain up to the quadratic order $(n=2)$ if the EFT function representing non-minimal coupling is Taylor expanded as a general function of the dark energy fraction $\\Omega\\_{\\rm{DE}}$, i.e. $\\Omega^{\\text{EFT}}(a)=\\sum\\_{i=0}^{n} c^{\\rm{EFT}}\\_i \\Omega^i\\_{\\text{DE}}(a)$. This calls for a more flexible parametrization of the EFT functions than commonly used ones in literature.\n\n", "2503.19558": "2025-03-25, **ZTF-observed late-time signals of pre-ZTF transients**, Jacco H. Terwel et.al., [2503.19558v1](http://arxiv.org/abs/2503.19558v1)\n\n With large-scale surveys such as the Zwicky Transient Facility (ZTF), it has become possible to obtain a well-sampled light curve spanning the full length of the survey for any discovery within the survey footprint. Similarly, any transient within the footprint that was first detected before the start of the survey will likely have a large number of post-transient observations, making them excellent targets to search for the presence of late-time signals, in particular due to interaction with circumstellar material (CSM). We search for late-time signals in a sample of 7718 transients, mainly supernovae (SNe), which were first detected during the 10 years before the start of ZTF, aiming to find objects showing signs of late-time interaction with CSM. We find one candidate whose late-time signal is best explained by late-time CSM interaction, with the signal being around 300 days after transient discovery. A thin, distant shell containing $\\lesssim5$ M$\\_\\odot$ of material could explain the recovered signal. We also find five objects whose late-time signal is best explained by faint nuclear transients occurring in host nuclei close to the pre-ZTF transient locations. Finally, we find two objects where it is difficult to determine whether the signal is from a nuclear transient or due to late-time CSM interaction $>5$ years after the SN. This study demonstrates the ability of large-scale surveys to find faint transient signals for a variety of objects, uncovering a population of previously unknown sources. However, the large number of non-detections show that strong late-time CSM interaction occurring years after the SN explosion is extremely rare.\n\n", "2503.19442": "2025-03-25, **KiDS-Legacy: Consistency of cosmic shear measurements and joint cosmological constraints with external probes**, Benjamin Stölzner et.al., [2503.19442v1](http://arxiv.org/abs/2503.19442v1)\n\n We present a cosmic shear consistency analysis of the final data release from the Kilo-Degree Survey (KiDS-Legacy). By adopting three tiers of consistency metrics, we compare cosmological constraints between subsets of the KiDS-Legacy dataset split by redshift, angular scale, galaxy colour and spatial region. We also review a range of two-point cosmic shear statistics. With the data passing all our consistency metric tests, we demonstrate that KiDS-Legacy is the most internally consistent KiDS catalogue to date. In a joint cosmological analysis of KiDS-Legacy and DES Y3 cosmic shear, combined with data from the Pantheon+ Type Ia supernovae compilation and baryon acoustic oscillations from DESI Y1, we find constraints consistent with Planck measurements of the cosmic microwave background with $S\\_8\\equiv \\sigma\\_8\\sqrt{\\Omega\\_{\\rm m}/0.3} = 0.814^{+0.011}\\_{-0.012}$ and $\\sigma\\_8 = 0.802^{+0.022}\\_{-0.018}$.\n\n"}}