{"neutrino": {"2601.05186": "2026-01-08, **Non-Thermal Leptogenesis in the BLSM with Inverse Seesaw Mechanism**, David Delepine et.al., [2601.05186v1](http://arxiv.org/abs/2601.05186v1)\n\n We investigate the viability of non-thermal leptogenesis in the gauged $U(1)\\_{B-L}$ extension of the Standard Model (BLSM) with an inverse seesaw (ISS) mechanism for neutrino mass generation. In this framework, right-handed neutrinos typically have $\\mathcal{O}(1)$ Yukawa couplings, which induce strong washout effects and render conventional thermal leptogenesis ineffective. We demonstrate that a successful baryogenesis scenario can nevertheless be realized through non-thermal leptogenesis, where right-handed neutrinos are produced from the decay of the heavy $B\\!-\\!L$ Higgs boson $χ$. We explicitly analyze the interplay between the dilution factor $T\\_R/M\\_χ$ and the washout parameter characteristic of the ISS, highlighting the tension between suppressing washout effects and maintaining sufficient reheating. We show that a viable lepton asymmetry can be generated provided the scalar mass spectrum is appropriately tuned, allowing for a reduced reheating temperature while keeping washout under control. The resulting lepton asymmetry is efficiently converted into the observed baryon asymmetry of the Universe via sphaleron processes. Our results establish that the inverse-seesaw $B\\!-\\!L$ model remains a predictive and robust framework for non-thermal leptogenesis and baryogenesis.\n\n", "2601.04939": "2026-01-08, **Multi-Messenger Studies with High-Energy Neutrinos and Gamma Rays: The WST Opportunity**, Fabian Schüssler et.al., [2601.04939v1](http://arxiv.org/abs/2601.04939v1)\n\n The search for the sources of ultra-high-energy cosmic rays (UHECRs) using high-energy neutrinos represents a frontier in high-energy astrophysics. However, a critical bottleneck remains: the ability to rapidly survey the sizable sky areas defined by the localization uncertainties of neutrino detectors and to provide rapid spectroscopic classification of the multitude of optical transients found within them.   By deploying a large field-of-view with high-multiplex Multi-Object Spectroscopy (MOS) on a large aperture telescope, one can instantaneously cover neutrino error circles, thus providing crucial spectroscopic classifications of potential counterparts discovered, for example, by the Vera C. Rubin Observatory (LSST) with unprecedented efficiency. Furthermore, simultaneous operation of a giant panoramic central Integral Field Spectrograph (IFS) would allow for detailed kinematic and environmental characterization of primary candidates. This facility would unlock deep synergies between next-generation neutrino telescopes (IceCube-Gen2, KM3NeT) and gamma-ray observatories (CTAO), transforming unique multi-messenger alerts into a comprehensive physical understanding.\n\n", "2601.04802": "2026-01-08, **Dark NSI & neutrino oscillations : probing via $δ_{CP}$ measurements at DUNE and T2HK**, Dharitree Bezboruah et.al., [2601.04802v1](http://arxiv.org/abs/2601.04802v1)\n\n We investigate the possibility of neutrinos interacting with a scalar dark matter field and the resulting implications for neutrino oscillations in the long-baseline sector. As our Universe is predominantly composed of dark matter, neutrinos propagating over astrophysical and terrestrial baselines inevitably traverse a dark matter background. The coherent forward scattering of neutrinos in such a background induces a medium-dependent correction to the mass-squared term in the effective neutrino Hamiltonian having opposing signs for neutrinos and antineutrinos. We study how the elements of this correction matrix, arising from coherent forward scattering of neutrinos with scalar dark matter background referred to as dark non-standard interactions (dark NSI), modify neutrino oscillation probabilities. Furthermore, we also study the effect of the off-diagonal elements and the associated phases on the measurement of leptonic CP violating phase focusing on the upcoming long-baseline superbeam experiments DUNE and T2HK. We show that dark NSI can lead to substantial enhancement or suppression of CP-violation sensitivity, depending on the true values of the dark NSI phases $φ\\_{αβ}$. We further explored how the synergy of DUNE and T2HK can effectively mitigate the degeneracies due to the dark NSI phases, and can restore or even enhance the CP sensitivity as compared to the standard oscillation scenario.\n\n", "2601.04464": "2026-01-08, **Propagating Uncertainties from Nuclear Physics to Gamma-rays in Core Collapse Supernovae**, Chris L Fryer et.al., [2601.04464v1](http://arxiv.org/abs/2601.04464v1)\n\n Nuclear yields are powerful probes of supernova explosions, their engines and their progenitors. In addition, as we improve our understanding of these explosions, we can use nuclear yields to probe dense matter and neutrino physics, both of which play a critical role in the central supernova engine. Especially with upcoming gamma-ray detectors that can directly detect radioactive isotopes out to increasing distances from gamma-rays emitted during their decay, nuclear yields have the potential to provide some of the most direct probes of supernova engines and stellar burning. To utilize these probes, we must understand and limit the uncertainties in their production. Uncertainties in the nuclear physics can be minimized by combining both laboratory experiments and nuclear theory. Similarly, astrophysical uncertainties caused by simplified explosion trajectories can be minimized by higher-fidelity stellar-evolution and supernova-engine models. This paper reviews the physics and astrophysics uncertainties in modeling nucleosynthetic yields, identifying the key areas of study needed to maximize the potential of supernova yields as probes of astrophysical transients and dense-matter physics.\n\n", "2601.04312": "2026-01-07, **Neutrino decays as a natural explanation of the neutrino mass tension**, Guillermo Franco Abellán et.al., [2601.04312v1](http://arxiv.org/abs/2601.04312v1)\n\n A new tension is emerging between the tight cosmological upper bounds on the total neutrino mass ($\\sum m\\_ν\\lesssim 0.06 \\, \\rm{eV}$) and the lower limits from oscillation experiments, with potentially far-reaching implications for cosmology and particle physics. Neutrinos decaying into massless BSM particles with lifetimes $τ\\_ν\\sim 0.01-1\\, \\rm{Gyr}$ represent a theoretically well-motivated mechanism to reconcile such measurements. Using DESI DR2 and CMB datasets, we show that such decays relax the bound on the total neutrino mass up to $\\sum m\\_ν< 0.23 \\, \\rm{eV}$ (95%), restoring full agreement with oscillation data. We also present the first late-time cosmological analysis of neutrino decays into lighter neutrinos in a manner consistent with the measured mass splittings. In contrast to the decays into massless BSM particles, we find that this scenario only marginally alleviates - or even tightens - the cosmological neutrino mass bounds, depending on the mass ordering.\n\n", "2601.03502": "2026-01-07, **Estimating JUNO's Sensitivity to Solar Neutrino-to-antineutrino Conversion and Neutrino Magnetic Moments**, C. V. Ventura et.al., [2601.03502v1](http://arxiv.org/abs/2601.03502v1)\n\n We investigated JUNO's sensitivity to a possible conversion of solar neutrinos into antineutrinos via the spin-flavor precession (SFP) mechanism, and assessed the implications for constraining the neutrino-magnetic moment (NMM). Using a sensitivity-based framework appropriate for counting experiments with no prior observations, we derive 90\\% C.L.\\ ensemble-average sensitivities on the solar antineutrino flux for 1.8--16.8 MeV and 8.0--16.8 MeV. For the entire energy window, the results do not improve the restrictions of other experiments; the relevance occurs in the highes-energy window. In this window, we report a flux of $φ\\_{\\mathrm{lim}}\\le 4.01\\times10^{1}\\ \\mathrm{cm^{-2}\\,s^{-1}}$ and a probability of $P\\_{ν\\_e\\rightarrow\\barν\\_e}\\le 2.07\\times10^{-5}$, the latter normalized to the ${}^8$B flux above threshold, $Φ\\_{\\rm SSM}(E>8~\\mathrm{MeV})$. Assuming transverse solar magnetic fields of $B\\_\\perp=50$ and $100$~kG, the corresponding magnetic-moment sensitivities are $μ\\_ν\\le 7.27\\times10^{-11}\\,μ\\_B$ and $3.64\\times10^{-11}\\,μ\\_B$ in the high-energy window. These results highlight that JUNO has the potential to achieve sensitivities comparable to the most stringent astrophysical limits; in particular, the high-energy selection (8.0--16.8~MeV) provides a sensitivity that is competitive with current results, while the full-energy window remains primarily limited by near-reactor backgrounds.\n\n"}, "dark matter": {"2601.05235": "2026-01-08, **Mimicking Phantom Dark Energy with Evolving Dark Matter Mass**, Lorenzo La Penna et.al., [2601.05235v1](http://arxiv.org/abs/2601.05235v1)\n\n We present a general method to reproduce a given cosmological background through energy exchange between dark energy (DE) and dark matter (DM). This can be simply realized with a standard quintessence scalar field that controls the DM mass. In particular a background with phantom crossing can be effectively realized without introducing ghosts or other pathologies. For example one can reproduce exactly the background that gives the best fit to the recent DESI+CMB+DESY5 data, within the Chevallier-Polarski-Linder (CPL) parametrization of DE. Although the background evolution is identical, the perturbations differ, leading to modified growth of structures. If the DM mass varies at late times, early-time observables are not modified and can reproduce the main predictions of the target model, but late-time observables are affected. We discuss in particular the effects on the matter power spectrum, CMB lensing and ISW effect. When reproducing the best fit CPL background model, this scenario generically predicts $\\mathcal{O}(10\\%)$ deviations in such observables. However, for suitable choices of parameters, effects on the matter power spectrum can be smaller, motivating a detailed study. In general, energy exchange between DE and DM generates a mismatch between the matter power spectrum and the gravitational potential amplitudes compared to the decoupled case, that can lead to deviations observable in future experiments.\n\n", "2601.05203": "2026-01-08, **Symbolically regressing dark matter halo profiles using weak lensing**, Alicia Martín et.al., [2601.05203v1](http://arxiv.org/abs/2601.05203v1)\n\n The structure of dark matter haloes is often described by radial density profiles motivated by cosmological simulations. These are typically assumed to have a fixed functional form (e.g. NFW), with some free parameters that can be constrained with observations. However, relying on simulations has the disadvantage that the resulting profiles depend on the dark matter model and the baryonic physics implementation, which are highly uncertain. Instead, we present a method to constrain halo density profiles directly from observations. This is done using a symbolic regression algorithm called Exhaustive Symbolic Regression (ESR). ESR searches for the optimal analytic expression to fit data, combining both accuracy and simplicity. We apply ESR to a sample of 149 galaxy clusters from the HSC-XXL survey to identify which functional forms perform best across the entire sample of clusters. We identify density profiles that statistically outperform NFW under a minimum-description-length criterion. Within the radial range probed by the weak-lensing data ($R \\sim 0.3 - 3$ h$^{-1}$ Mpc), the highest-ranked ESR profiles exhibit shallow inner behaviour and a maximum in the density profile. As a practical application, we show how the best-fitting ESR models can be used to obtain enclosed mass estimates. We find masses that are, on average, higher than those derived using NFW, highlighting a source of potential bias when assuming the wrong density profile. These results have important knock-on effects for analyses that utilise clusters, for example cosmological constraints on $σ\\_8$ and $Ω\\_m$ from cluster abundance and clustering. Beyond the HSC dataset, the method is readily applicable to any data constraining the dark matter distribution in galaxies and galaxy clusters, such as other weak lensing surveys, galactic rotation curves, or complementary probes.\n\n", "2601.05069": "2026-01-08, **Constraining the Primoridal Black Hole Abundance with Space-Based Detectors**, Wencong Hong et.al., [2601.05069v1](http://arxiv.org/abs/2601.05069v1)\n\n Overdense regions can collapse into primordial black holes (PBHs) in the early universe, which are a compelling candidate for dark matter. Current constraints leave the asteroid-mass window the only possible one for PBH to account for all the dark matter, which can only be probed indirectly by the scalar-induced gravitational waves (GWs) sourced by the curvature perturbation which forms PBH. In this work, we explore the capabilities of future space-based gravitational wave detectors, including LISA, Taiji, and TianQin, to constrain such induced GWs as well as the PBH abundance. We systematically account for the width of the primordial curvature power spectrum, and find that the asteroid-mass window can be fully probed by all three space-based interferometers. If PBHs constitute the majority of dark matter, the induced GW leaves a strong signal in the mHz band with a signal-to-noise ratio of $10^3\\sim10^4$.\n\n", "2601.04735": "2026-01-08, **sidmkit: A Reproducible Toolkit for SIDM Phenomenology and Galaxy Rotation-Curve Modeling**, Nalin Dhiman et.al., [2601.04735v1](http://arxiv.org/abs/2601.04735v1)\n\n Self-interacting dark matter (SIDM) is a well-motivated extension of cold dark matter that can modify halo structure on galactic and group scales while remaining consistent with large-scale structure. However, practical SIDM work often requires bridging several layers, including microphysical scattering models, velocity-dependent effective cross sections, phenomenological astrophysical constraints, and (separately) data-driven halo fits, such as rotation curves. In this paper, we describe \\texttt{sidmkit}, a transparent and reproducible Python package designed to support SIDM ``micro$\\rightarrow$macro'' calculations and to provide a robust batch pipeline for fitting rotation curves in the SPARC data. On the SIDM side, \\texttt{sidmkit} implements velocity-dependent momentum-transfer cross sections for a Yukawa interaction using standard analytic approximations (Born, classical, and Hulthén-based) with a numerical partial-wave option for spot checks. It also provides consistent velocity-moment averaging for Maxwellian relative speeds, scattering-rate utilities, and curated literature \\emph{summary} constraints for regression tests and exploratory scans. On the rotation-curve side, we implement bounded non-linear least squares fits of NFW and Burkert halo models to SPARC baryonic decompositions, with optional mass-to-light priors and information-criterion summaries (AIC/BIC). For the demonstration dataset, we process 191 \\texttt{rotmod} galaxies (LTG+ETG bundles) and fit both NFW and Burkert models (382 total fits). We find that Burkert is preferred by $Δ\\mathrm{BIC} > 0$ for $65.4\\%$ of galaxies, with ``strong'' preference ($Δ\\mathrm{BIC}>6$) in $32.5\\%$ of galaxies;\n\n", "2601.04576": "2026-01-08, **Search for Ultralight Axion Dark Matter with a Levitated Ferromagnetic Torsional Oscillator**, Chunlong Li et.al., [2601.04576v1](http://arxiv.org/abs/2601.04576v1)\n\n We present a search for ultralight axion dark matter coupled to electron spins using a levitated ferromagnetic torsional oscillator (FMTO). This platform directly measures axion-induced torques on a macroscopic spin-polarized body, combining large spin density with strong mechanical isolation to probe magnetic fluctuations below 10 Hz while suppressing gradient-field noise. In a first implementation, the experiment yielded 18000 s of analyzable data at room temperature under high vacuum with optical readout and triple-layer magnetic shielding. A likelihood-based statistical framework, incorporating stochastic fluctuations in the axion-field amplitude, was used to evaluate the data. No excess consistent with an axion-induced pseudo-magnetic field was observed near 2e-14 eV. To account for possible shielding-induced signal attenuation, we quantify its effect and report both the uncorrected (g\\_aee < 1e-7) and attenuation-corrected (g\\_aee < 6e-5) 90% CL limits on the axion-electron coupling. Looking ahead, improvements guided by both noise-budget analysis and shielding-attenuation considerations, including optimized levitation geometry, cryogenic operation, and superconducting shielding, are expected to boost sensitivity by multiple orders of magnitude.\n\n", "2601.04340": "2026-01-07, **Diluting the Dark Sector: A Common Origin for the PTA Signal and Inelastic SIDM**, Zihan Wang et.al., [2601.04340v1](http://arxiv.org/abs/2601.04340v1)\n\n The recent detection of a nanohertz stochastic gravitational wave background (SGWB) challenges conventional astrophysics by observed signal amplitude exceeds predictions from standard SMBHB populations without implausible accretion histories. To resolve this amplitude tension, we introduce the Radiative SIDM Dilution framework.We explain the observed spectrum emerges as a hybrid signal by an astrophysical floor, dynamically suppressed by the cored halos of Self-Interacting Dark Matter (SIDM),and a dominant cosmological peak generated during a supercooled phase transition in the dark sector. By performing a free spectral reconstruction and Bayesian model comparison, we demonstrate that a transition defined by a nucleation temperature $T\\_* \\approx 1.24$ MeV and inverse duration $β/H\\_* \\approx 150$ not only fills the spectral gap left by stalled binaries but yields statistical evidence($Δ\\text{BIC} \\approx 15$) over purely standard astrophysical interpretations. The thermodynamics required to reproduce this SGWB signature also resolves the thermal overproduction of resonant SIDM. The entropy injected by the transition naturally provides the specific dilution factor $D \\approx 100$ needed to reset the dark matter relic density to observation. This mechanism also has broader cosmological consequences.The residual dark radiation alleviates the Hubble tension $ΔN\\_{\\rm eff} \\sim 0.3$ while bubble collisions generate magnetohydrodynamic turbulence sufficient to seed primordial magnetic fields $B\\_0 \\sim 10^{-13}$ G. These convergences suggest that the NANOGrav excess is not an anomaly, but the acoustic signature of the entropy injection event that rendered the dark sector cosmologically viable.\n\n", "2601.04129": "2026-01-07, **Satellite-borne γ-ray astrophysics from coherent interactions in oriented crystals**, Pietro Monti-Guarnieri et.al., [2601.04129v1](http://arxiv.org/abs/2601.04129v1)\n\n High-density and high-Z crystals are a key element of most space-borne $γ$-ray telescopes operating at GeV energies (such as Fermi-LAT). The lattice structure is usually neglected in the development of a crystalline detector, although its effects on the energy deposit development should be taken into account, since the interactions of a high energy ($\\sim$~GeV) photon or e$^\\pm$ impinging along the axis of an oriented crystal are different than the ones observed in a fully isotropic medium. Specifically, if the angle between a photon (e$^\\pm$) trajectory and the crystal axis is smaller than $\\sim$ 0.1$^\\circ$, a large enhancement of the pair production (bremsstrahlung) cross-section is observed. Consequently, a photon-induced shower inside an oriented crystal develops within a much more compact region than in an amorphous medium. Moreover, for photon energies above a few GeV and incidence angles up to several degrees, the pair-production cross-section exhibits a pronounced dependence on the angle between the crystal axis and the photon polarization vector. \\\\ In this work we show that these effects could be exploited to develop a novel class of light-weight pointing space-borne $γ$-ray telescopes, capable of achieving an improved sensitivity and resolution, thanks to a better shower containment in a smaller volume with respect to non-oriented crystalline detectors. We also show that an oriented tracker-converter system could be used to measure the polarization of a $γ$-ray source above few GeV, in a regime that remains unexplorable through any other detection technique. This novel detector concept could open new pathways in the study of the physics of extreme astrophysical environments and potentially improve the detector sensitivity for indirect Dark Matter searches in space.\n\n", "2601.03980": "2026-01-07, **Observational Signatures of Accretion Disks around a Schwarzschild Black Hole in a Hernquist Dark Matter Halo**, Zhenglong Ban et.al., [2601.03980v1](http://arxiv.org/abs/2601.03980v1)\n\n We investigate how a Hernquist type dark matter (DM) halo, parametrized by its core radius $r\\_{s}$ and central density $ρ\\_{s}$, influences both the gravitational wave (GW) emission from timelike periodic orbits and the electromagnetic appearance of a thin accretion disk around a Schwarzschild black hole (BH). By analyzing the effective potential for timelike geodesics, we show that the DM halo shifts the marginally bound orbit (MBO) and the innermost stable circular orbit (ISCO) outward, reflecting its modification of the spacetime geometry and the energy-angular momentum structure of particle motion. Employing a semi-analytical method, we compute orbital trajectories and the associated GW waveforms, revealing that the DM halo alters the characteristic zoom-whirl dynamics and induces measurable changes in waveform morphology. Furthermore, we generate direct and secondary images of the accretion disk across various observer inclinations and find that increasing $r\\_{s}$ or $ρ\\_{s}$ results in cooler, dimmer disks with modified flux distributions. Our results demonstrate that the presence of a DM halo imprints distinct signatures in both gravitational and electromagnetic observables, offering a multimessenger pathway to probe DM environments near BHs.\n\n", "2601.03894": "2026-01-07, **Towards an optimal extraction of cosmological parameters from galaxy cluster surveys using convolutional neural networks**, Iñigo Sáez-Casares et.al., [2601.03894v1](http://arxiv.org/abs/2601.03894v1)\n\n The possibility to constrain cosmological parameters from galaxy surveys using field-level machine learning methods that bypass traditional summary statistics analyses, depends crucially on our ability to generate simulated training sets. The latter need to be both realistic, as to reproduce the key features of the real data, and produced in large numbers, as to allow us to refine the precision of the training process. The analysis presented in this paper is an attempt to respond to these needs by (a) using clusters of galaxies as tracers of large-scale structure, together with (b) adopting a 3LPT code (Pinocchio) to generate a large training set of $32\\,768$ mock X-ray cluster catalogues. X-ray luminosities are stochastically assigned to dark matter haloes using an empirical $M-L\\_X$ scaling relation. Using this training set, we test the ability and performances of a 3D convolutional neural network (CNN) to predict the cosmological parameters, based on an input overdensity field derived from the cluster distribution. We perform a comparison with a neural network trained on traditional summary statistics, that is, the abundance of clusters and their power spectrum. Our results show that the field-level analysis combined with the cluster abundance yields a mean absolute relative error on the predicted values of $Ω\\_{\\rm m}$ and $σ\\_8$ that is a factor of $\\sim 10 \\%$ and $\\sim 20\\%$ better than that obtained from the summary statistics. Furthermore, when information about the individual luminosity of each cluster is passed to the CNN, the gain in precision exceeds $50\\%$.\n\n"}, "supernova": {"2601.05233": "2026-01-08, **Three-dimensional scene reconstruction using Roman slitless spectra**, Tri L. Astraatmadja et.al., [2601.05233v1](http://arxiv.org/abs/2601.05233v1)\n\n The Nancy Grace Roman Space Telescope will carry out a wide-field imaging and slitless spectroscopic survey of Type Ia Supernovae to improve our understanding of dark energy. Crucial to this endeavor is obtaining supernova spectra uncontaminated by light from their host galaxies. However, obtaining such spectra is made more difficult by the inherent problem in wide-field slitless spectroscopic surveys: the blending of spectra of close objects. The spectrum of a supernova will blend with the host galaxy, even from regions distant from the supernova on the sky. If not properly removed, this contamination will introduce systematic bias when the supernova spectra are later used to determine intrinsic supernova parameters and to infer the parameters of dark energy. To address this problem we developed an algorithm that makes use of the spectroscopic observations of the host galaxy at all available observatory roll angles to reconstruct a three-dimensional (3d; 2d spatial, 1d spectral) representation of the underlying host galaxy that accurately matches the 2d slitless spectrum of the host galaxy when projected to an arbitrary rotation angle. We call this ``scene reconstruction''. The projection of the reconstructed scene can be subtracted from an observation of a supernova to remove the contamination from the underlying host. Using simulated Roman data, we show that our method has extremely small systematic errors and significantly less random noise than if we subtracted a single perfectly aligned spectrum of the host obtained before or after the supernova was visible.\n\n", "2601.04347": "2026-01-07, **The Impact of Robotic Telescopes on Time-Domain Astronomy**, Yakubu Mu'allim et.al., [2601.04347v1](http://arxiv.org/abs/2601.04347v1)\n\n The field of time-domain astronomy has experienced unprecedented growth due to the increasing deployment of robotic telescopes capable of autonomous, round-the-clock sky monitoring. These instruments have revolutionized the detection and characterization of transient phenomena such as supernovae, gamma-ray bursts, variable stars, and gravitational wave counterparts. This paper explores the transformative role of robotic telescopes such as ZTF, ATLAS, and LCOGT in enabling rapid-response observations and building large time-series datasets. We review the design principles and scheduling algorithms behind robotic observatories and assess their scientific contributions across different wavelength regimes. Particular attention is given to the synergy between robotic systems and machine learning pipelines that enable real-time classification of transient events. We also discuss challenges such as data deluge, follow-up prioritization, and observational biases, as well as future directions in global telescope networks\n\n", "2601.04344": "2026-01-07, **Nitrogen enhancement of GN-z11 by metal pollution from supermassive stars**, Sho Ebihara et.al., [2601.04344v1](http://arxiv.org/abs/2601.04344v1)\n\n Spectroscopic observations by the James Webb Space Telescope (JWST) have revealed young, compact, high-redshift ($z$) galaxies with high nitrogen-to-oxygen (N/O) ratios. GN-z11 at z=10.6 is one of these galaxies. One possible scenario for such a high N/O ratio is pollution from supermassive stars (SMSs), from which stellar winds are expected to be nitrogen-rich. The abundance pattern is determined by both galaxy evolution and SMS pollution, but so far, simple one-zone models have been used. Using a galaxy formation simulation, we tested the SMS scenario. We used a cosmological zoom-in simulation that includes chemical evolution driven by rotating massive stars (Wolf-Rayet stars), supernovae, and asymptotic giant branch stars. As a post-process, we assumed the formation of an SMS with a mass between $10^3$ and $10^5$ $M\\_\\odot$ and investigated the contribution of its ejecta to the abundance pattern. The N/O ratio was enhanced by the SMS ejecta, and the abundance pattern of GN-z11, including carbon-to-oxygen and oxygen-to-hydrogen ratios, was reproduced by our SMS pollution model if the pollution mass fraction ranges within 10-30 per cent. Such a pollution fraction can be realized when the gas ionized by the SMS is polluted, and the gas density is $10^4$-$10^5$ cm$^{-3}$ assuming a Strömgren sphere. We also compared the abundance pattern with those of other N/O-enhanced high-$z$ galaxies. Some of these galaxies can also be explained by SMS pollution.\n\n", "2601.04179": "2026-01-07, **GRB 180728A and SN 2018fip: the nearest high-energy cosmological gamma-ray burst with an associated supernova**, A. Rossi et.al., [2601.04179v1](http://arxiv.org/abs/2601.04179v1)\n\n The long GRB 180728A, at a redshift of $z = 0.1171$, stands out due to its high isotropic energy of $E\\_{γ,iso} \\sim 2.5 \\times 10^{51}$ erg, in contrast with most events at redshift $z<0.2$. We analyze the properties of GRB 180728A's prompt emission, afterglow, and associated supernova SN 2018fip, comparing them with other GRB-SN events. This study employs a dense photometric and spectroscopic follow-up of the afterglow and the SN up to 80 days after the burst, supported by image subtraction to remove the presence of a nearby bright star, and modelling of both the afterglow and the supernova. GRB 180728A lies on the $E\\_{p,i}-E\\_{γ,iso}$ plane occupied by classical collapsar events, and the prompt emission is one of the most energetic at $z < 0.2$ after GRB 030329 and GRB 221009A. The afterglow of GRB 180728A is less luminous than that of most long GRBs, showing a shallow early phase that steepens around 5 hours (0.2 days). The GRB exploded in an irregular, low-mass, blue, star-forming galaxy, typical of low-z collapsar events. Because of the relatively faint afterglow, the light curve bump of SN 2018fip dominates the optical emission already after $\\sim$3 days and is one of the best sampled to date. The strong suppression below $\\sim$ 4000 angstrom and a largely featureless continuum in the early 6--9 days spectra favor aspherical two-component ejecta with a high-velocity collimated component ($> 20,000 km s^{-1}$), dominant early-on, and a more massive, low-velocity component, which dominates at much later epochs. Our findings indicate that asymmetries need to be considered in order to better understand GRB-SNe. In any case, SN 2018fip shares many characteristics with typical GRB-SNe. Its kinetic energy is below the common range of $10^{52}-10^{53}$ erg and does not correlate with the high energy of the GRB, highlighting the diversity of the GRB-SN energy budget partition.\n\n", "2601.04156": "2026-01-07, **A spectroscopically confirmed, strongly lensed, metal-poor Type II supernova at z = 5.13**, David A. Coulter et.al., [2601.04156v1](http://arxiv.org/abs/2601.04156v1)\n\n Observing supernovae (SNe) in the early Universe (z > 3) provides a window into how both galaxies and individual stars have evolved over cosmic time, yet a detailed study of high-redshift stars and SNe has remained difficult due to their extreme distances and cosmological redshifting. To overcome the former, searches for gravitationally lensed sources allow for the discovery of magnified SNe that appear as multiple images - further providing the opportunity for efficient follow-up. Here we present the discovery of \"SN Eos\": a strongly lensed, multiply-imaged, SN II at a spectroscopic redshift of z = 5.133 +/- 0.001. SN Eos exploded in a Lyman-α emitting galaxy when the Universe was only ~1 billion years old, shortly after it reionized and became transparent to ultraviolet radiation. A year prior to our discovery in JWST data, archival HST imaging of SN Eos reveals rest-frame far ultraviolet (~1,300Å) emission, indicative of shock breakout or interaction with circumstellar material in the first few (rest-frame) days after explosion. The JWST spectroscopy of SN Eos, now the farthest spectroscopically confirmed SN ever discovered, shows that SN Eos's progenitor star likely formed in a metal-poor environment (<= 0.1 Z\\_{\\odot}), providing the first direct evidence of massive star formation in the metal-poor, early Universe. SN Eos would not have been detectable without the extreme lensing magnification of the system, highlighting the potential of such discoveries to eventually place constraints on the faint end of the cosmic star-formation rate density in the very early Universe.\n\n", "2601.03921": "2026-01-07, **Science with a large field-of-view polarization survey: The Large Array Survey Telescope Polarization Node (LAST-P)**, V. Barbosa Martins et.al., [2601.03921v1](http://arxiv.org/abs/2601.03921v1)\n\n Optical polarimetry provides information on the geometry of the emitting region, the magnetic field configuration and the properties of dust in astrophysical sources. Current state-of-the-art instruments typically have a small field of view (FoV), which poses a challenge for conducting wide surveys. We propose the construction of the Large Array Survey Telescope Polarization Node (LAST-P), a wide-field array of optical polarimeters. LAST-P is designed for high-cadence ($\\lesssim 1$ day) polarization monitoring of numerous astrophysical transients, such as the early phases of gamma-ray bursts, supernovae, and novae. Furthermore, LAST-P will facilitate the creation of extensive polarization catalogs for X-ray binaries and white dwarfs, alongside a large FoV study of the interstellar medium. In survey mode, LAST-P will cover a FoV of 88.8 deg$^2$. With a 15 x 1-minute exposure, the instrument will be capable of measuring polarization of sources as faint as Gaia Bp-magnitude $\\sim$20.9. The precision on the linear polarization degree (PD) will reach 0.7\\%, 1.5\\%, and 3.5\\% for sources with magnitudes 17, 18, and 19, respectively, for a seeing of 2.7 arcsec, air mass of about 1 for observations in dark locations. We propose three distinct non-simultaneous survey strategies, among them an active galactic nuclei (AGN) strategy for long-term monitoring of $\\sim$200 AGN with $<$1-day cadence. In this paper, we present the predicted sensitivity of the instrument and outline the various science cases it is designed to explore.\n\n", "2601.03810": "2026-01-07, **The massive hot subdwarf binary LAMOST J065816.72+094343.1**, F. Mattig et.al., [2601.03810v1](http://arxiv.org/abs/2601.03810v1)\n\n Massive short-period binaries involving hot subdwarf stars (sdO/Bs) are rare but important to constraining pathways for binary star evolution. Moreover, some of the most promising candidate progenitor systems leading to Type Ia supernovae (SNe Ia) involve sdO/Bs. LAMOST J065816.72+094343.1 has been identified as such a candidate. To explore the nature and evolutionary future of LAMOST J065816.72+094343.1, we complemented archival spectroscopic data with additional time series spectra and high-resolution spectroscopy of the object. After combining these with photometric data, we determined the orbital parameters of the system and the mass of the companion. We solved the orbit of the system by analyzing 68 low- and medium-resolution spectra using state-of-the-art mixed local thermodynamic equilibrium (LTE) and non-LTE model atmospheres. Additionally, we gathered nine high-resolution spectra to determine atmospheric parameters and the projected rotational velocity of the sdOB. The inclination angle of the system was constrained assuming tidal synchronization of the sdOB, which was verified via analysis of the ellipsoidal variations in the TESS light curve. We determine LAMOSTJ065816.72+094343.1 to be a binary consisting of a massive $0.82 \\pm 0.17 \\mathrm{M}\\_{\\odot}$ sdOB component with a $1.30^{+0.31}\\_{-0.26} \\mathrm{M}\\_{\\odot}$ unseen companion. Due to the companion's mass being very close to the Chandrasekhar mass limit and high for a white dwarf, it is unclear whether it is a white dwarf or a neutron star. We find the system to be in a close orbit, with a period of $P=0.31955193 \\mathrm{d}$ and an inclination angle of $i = 49.6^{+5.2}\\_{-4.2} \\mathrm{deg}$. While the exact nature of the companion remains unknown, we determine the system to either lead to a SN Ia or an intermediate mass binary pulsar, potentially after a phase as an intermediate-mass X-ray binary.\n\n"}}