{"neutrino": {"2506.04099": "2025-06-04, **Heavy Neutral Lepton Decay Searches using Solar Neutrinos**, Patrick Huber et.al., [2506.04099v1](http://arxiv.org/abs/2506.04099v1)\n\n We study the sensitivity to the decay of a heavy neutral lepton into $e^+e^-$-pairs using the solar boron-8 neutrino flux as source. We provide a fully differential cross section for this process including the interference of neutral and charged current amplitudes. We revisit a previous bound from Borexino and make predicitions for the expected sensitivity in future large liquid noble gas detectors, like XLZD, Argo and DUNE, as well as high-resolution scintillator detectors based on the LiquidO technology. We find that more than two orders of magnitude improvement in mixing angle reach is possible relative to existing bounds.\n\n", "2506.04035": "2025-06-04, **Dark matter mixing within the seesaw type II mechanism in the left-right symmetric model**, M. Dubinin et.al., [2506.04035v1](http://arxiv.org/abs/2506.04035v1)\n\n The seesaw type II mechanism is considered within the framework of a left-right chiral model with a gauge group $SU(2)\\_L\\times SU(2)\\_R\\times U(1)$, the lepton sector of which includes three generations of heavy Majorana neutrinos. The dependence of the mixing parameters of the lightest sterile neutrino as a dark matter particle on the scales of left-right symmetry breaking in the case of direct and inverse hierarchies of active neutrino masses is analyzed.\n\n", "2506.03934": "2025-06-04, **SuSAM-v2: improved superscaling description of electron and CC neutrino quasielastic scattering using effective mass dynamics**, V. L. Martinez-Consentino et.al., [2506.03934v1](http://arxiv.org/abs/2506.03934v1)\n\n We present an improved version of the Superscaling Analysis with Relativistic Effective Mass, denoted as SuSAM-v2. In the original SuSAM model, a universal scaling function was fitted to a selected set of quasielastic electron scattering (e,e') cross section data, using a phenomenological ansatz inspired by the Relativistic Mean Field model of nuclear matter. In this work, we refine the procedure by first fitting a longitudinal scaling function directly to experimental longitudinal response data. Subsequently, a separate transverse scaling function is extracted from purely transverse data, after subtracting the longitudinal contribution already determined. We find that the resulting transverse scaling function must exhibit an explicit dependence on the momentum transfer q in order to reproduce all kinematics consistently. The resulting SuSAM-v2 model simultaneously describes inclusive quasielastic cross sections and both longitudinal and transverse response functions in electron scattering. The model is then applied to neutrino-nucleus scattering, showing an improved prediction compared to the previous SuSAM-v1 version, due to a more accurate treatment of the relative contributions of the longitudinal and transverse weak nuclear responses.\n\n", "2506.03716": "2025-06-04, **The precision measurement of the electron anti-neutrino spectrum in beta-decay of $\\rm{^{144}Pr}$ nuclei**, A. V. Derbin et.al., [2506.03716v1](http://arxiv.org/abs/2506.03716v1)\n\n The $\\rm{^{144}Ce - ^{144}Pr}$ electron antineutrino source is one of the most suitable radiochemical sources for experiments searching for the oscillations of active neutrinos to the light sterile state. In the current work the $\\beta$-spectra of $\\rm{^{144}Ce - ^{144}Pr}$ source have been measured by two types of $\\beta$-spectrometers based on silicon Si(Li) detectors in order to determine the energy spectrum of electron anti-neutrino emitted in the $\\beta$-decay of $\\rm{^{144}Pr}$ nuclei. The nuclear form factor of the ground state beta transition in $\\rm{^{144}Pr - ^{144}Nd}$ has been obtained with high precision: $C(W) = 1 + (-0.0279\\pm 0.0003)W + (-0.076\\pm 0.003)W^{-1}$. The reduced cross section for the inverse beta decay reaction on hydrogen for the $\\rm{{^{144}Pr}}$ electron anti-neutrino source has been defined as $\\rm{(4.7448 \\pm 0.0006\\_{stat} \\pm 0.012\\_{syst}) \\times 10^{-44}~cm^2 {decay}^{-1}}$ that provides sufficient sensitivity to search for a sterile neutrino with a mass of $m\\_4 \\sim 1$~eV and a mixing angle $Sin^2(2\\theta\\_{14}) \\sim 0.005$ using standard disappearance method.\n\n", "2506.03581": "2025-06-04, **Gravitational waves from core-collapse supernovae with no electromagnetic counterparts**, Jade Powell et.al., [2506.03581v1](http://arxiv.org/abs/2506.03581v1)\n\n Core-collapse supernovae (CCSNe) are regularly observed electromagnetically, prompting targetted searches for their gravitational-wave emission. However, there are scenarios where these powerful explosions may not have any observable electromagnetic signal, but would still have strong detectable emission in gravitational waves and neutrinos. A regular CCSN explosion may be obscured by matter in the Galaxy. A star may undergo a failed CCSN explosion, where the stalled shockwave is not revived, and would eventually form a black hole. Higher mass progenitor stars may revive the shock, but form a black hole too quickly for the shockwave to reach the surface of the star and produce an electromagnetic signal. Previous work has shown that we can determine if a black hole forms from the CCSN neutrino emission if there are long duration sinusoidal modulations in the neutrino signal caused by the standing accretion shock instability (SASI). The SASI also produces an observable signature in the gravitational-wave emission. In this paper, we investigate if we can distinguish between different scenarios for electromagnetically dark CCSNe using the gravitational-wave emission alone. We find, using a reconstruction of the SASI mode, abrupt end times of the gravitational-wave emission, and the rate of change of frequency of the dominant mode, that we are able to accurately distinguish between an obscured CCSN, a failed CCSN, and an explosion with fast black hole formation.\n\n", "2506.03376": "2025-06-03, **Recent results from MicroBooNE**, Holly B. Parkinson et.al., [2506.03376v1](http://arxiv.org/abs/2506.03376v1)\n\n Modelling and reconstructing neutrino-nucleus scattering is difficult, but it is crucial to do it precisely to enable next-generation oscillation measurements. Liquid argon time projection chambers (LArTPCs), such as MicroBooNE, can be the tool for this job as they are excellent precision neutrino detectors with their ability to produce detailed three-dimensional interaction images and precise energy and spatial resolution. MicroBooNE currently possesses the world's largest neutrino-argon scattering data set collected over five years using the BNB and NuMI neutrino beams at Fermilab. The experiment has performed measurements over a broad range of physics topics including neutrino argon cross sections, searches for BSM physics, and investigations of the MiniBooNE LEE excess. Many of these measurements are essential for improving the modelling of nuclear effects for both MicroBooNE and future LArTPC neutrino experiments, such as DUNE. This talk will give an overview of recent MicroBooNE results, the analysis techniques that enable them, and prospects for future measurements.\n\n", "2506.03288": "2025-06-03, **$f$-mode oscillations in hot Neutron Stars: Effect of hyperons and neutrino trapping**, Nilaksha Barman et.al., [2506.03288v1](http://arxiv.org/abs/2506.03288v1)\n\n In this work, we present an equation of state formalism for hot Neutron Stars (NSs) which consistently includes the effects of finite temperature, hyperons as well as neutrino trapping, relevant for the study of proto-neutron stars, binary neutron star mergers and supernova explosions. Within a non-linear relativistic mean field description, the framework allows for a systematic variation of nuclear parameters within the range allowed by uncertainties in nuclear experimental data, ensuring compatibility with nuclear theory, astrophysical and heavy-ion data. We then investigate the role of nuclear and hypernuclear parameters on NS macroscopic properties and $f$-mode oscillations in hot neutron stars within Cowling approximation. Our results reveal that in hyperonic neutron stars with trapped neutrinos, the saturation nuclear density shows moderate to strong correlation with NS astrophysical observables. We also investigate the $C-Love$ universal relations for this model and provide fit relations for hot NS configurations in the neutrino-trapped regime.\n\n", "2506.03271": "2025-06-03, **Local-equilibrium theory of neutrino oscillations**, Lucas Johns et.al., [2506.03271v1](http://arxiv.org/abs/2506.03271v1)\n\n Miscidynamics describes coarse-grained neutrino transport under the assumption that flavor mixing is in local equilibrium. Here we introduce the concept of turbulent flavor-wave viscosity and develop techniques for including it in miscidynamics. This extension of the theory is necessary when neutrinos develop weak flavor instabilities as a result of astrophysical driving. The flavor-wave dispersion relation is obtained using a new and more general form of linear analysis, which does not require small flavor coherence. Flavor-wave transport is then approximated using wave kinetics and geometric optics. We hypothesize that the dynamical emergence of local oscillation invariants restricts the extent of flavor thermalization. In this view, flavor evolution is sculpted by both entropy-increasing and order-promoting factors.\n\n", "2506.03255": "2025-06-03, **Reducing Hadronic Uncertainty in Low-Energy Neutral-Current Processes**, Oleksandr Tomalak et.al., [2506.03255v1](http://arxiv.org/abs/2506.03255v1)\n\n We analyze the dominant hadronic uncertainty in low-energy neutral-current (anti)neutrino scattering, estimated at the $3$-$4$ per mille level. This uncertainty arises from limited knowledge of the charge-isospin correlation function of quark currents. We study the charge-charge and charge-isospin correlators within $\\mathrm{SU}(2)$ and $\\mathrm{SU}(3)$ chiral perturbation theory (ChPT). In $\\mathrm{SU}(2)$ ChPT, the two correlators are identical to all orders in the chiral and electromagnetic expansions. We further perform a one-loop $\\mathrm{SU}(3)$ ChPT calculation and discuss the relevant counterterms. Our findings reduce the hadronic uncertainty in neutral-current processes such as (anti)neutrino-electron and coherent elastic (anti)neutrino-nucleus scattering to the sub-permille level, $\\lesssim 1$ per mille.\n\n", "2506.02743": "2025-06-03, **Loop-corrected Trilinear Higgs Self-Couplings in the NMSSM with Inverse Seesaw Mechanism**, Thi Nhung Dao et.al., [2506.02743v1](http://arxiv.org/abs/2506.02743v1)\n\n The higher-order corrections for the SM-like Higgs boson mass and the trilinear Higgs self-couplings in the Next-to-Minimal Supersymmetric extension of the Standard Model (NMSSM) with Inverse Seesaw Mechanism are significant and highly correlated. We present here the full one-loop corrections to the trilinear Higgs self-couplings supplemented by the dominant top-Yukawa and strong coupling induced two-loop corrections from our previous calculations in the complex NMSSM. These corrections are performed consistently with the corresponding Higgs boson mass corrections. We discuss in detail the new effects from the extended neutrino and sneutrino sectors on both the trilinear Higgs self-couplings and the SM-like Higgs boson mass. When compared to the case of the NMSSM without Inverse Seesaw Mechanism, the new effects can be up to 10\\% for the effective SM-like trilinear Higgs self-couplings, and up to 4.5\\% for the SM-like Higgs boson mass for valid parameter points, i.e. points satisfying the Higgs data, the neutrino data, the constraints from the charged lepton flavor-violating decays, and the new physics constraints from the oblique parameters $S, T, U$. The new corrections are also included in the Higgs-to-Higgs decays for the heavy Higgs states and implemented in the new version of the Fortran code NMSSMCALC-nuSS.\n\n", "2506.02639": "2025-06-03, **Neutrino mass model at a three-loop level from a non-holomorphic modular $A_4$ symmetry**, Takaaki Nomura et.al., [2506.02639v1](http://arxiv.org/abs/2506.02639v1)\n\n We study a three-loop induced neutrino mass scenario from a non-holomorphic modular $A\\_4$ flavor symmetry and reach the minimum scenario leading predictions of the lepton masses, mixing angles, and Dirac and Majorana phases, which are shown through the chi square analyses. In addition, we discuss the lepton flavor violations, muon anomalous magnetic moment, lepton universality, and relic density of the dark matter candidate. And, we find that we need to extend our model if we satisfy the observed relic density of dark matter within the limit of perturbation where it can be done by adding one singlet scalar boson without changing predictions in neutrino sector.\n\n", "2506.02552": "2025-06-03, **Correlating lepton flavour violating $b \\to s$ and leptonic decay modes in a minimal abelian extension of the Standard Model**, Pietro Colangelo et.al., [2506.02552v1](http://arxiv.org/abs/2506.02552v1)\n\n We consider an abelian extension of the Standard Model (SM) comprising a new gauge group $U(1)^\\prime$, with the neutral gauge boson $Z^\\prime$ having flavour violating couplings to quarks and leptons. The fermion content is the same as in SM except for the addition of three right-handed neutrinos. The model describes the couplings of $Z^\\prime$ to fermions in terms of three rational parameters $\\epsilon\\_{1,2,3}$ that sum to zero imposing the cancellation of the gauge anomalies. Each $\\epsilon\\_i$ is common to all fermions in a generation, a feature producing correlations among quark and lepton observables. We focus on $b \\to s \\ell\\_1^- \\ell\\_2^+$ transitions for the lepton flavour conserving $\\ell\\_1=\\ell\\_2$ and lepton flavour violating case $\\ell\\_1 \\neq \\ell\\_2$. Small deviations with respect to the SM predictions are found in the first case, which reflects a feature of the model where quark and lepton sectors prevent each other to manifest large discrepancies with respect to SM. We investigate the correlations with the flavour violating leptonic decays $\\mu^- \\to e^- \\gamma$, $\\tau^- \\to \\mu^- \\mu^+ \\mu^-$. The experimental upper bound on the branching ratio of $\\mu^- \\to e^- \\gamma$ constrains the range for the lepton flavour violating $B\\_{d,s}$ decays, which however are predicted to be within the reach of the planned new facilities.\n\n"}, "dark matter": {"2506.04149": "2025-06-04, **Parity violation in photon quasinormal modes of black holes**, Sugumi Kanno et.al., [2506.04149v1](http://arxiv.org/abs/2506.04149v1)\n\n Given that black holes are ubiquitous in the universe and axion-like scalar fields are potential candidates for dark energy and/or dark matter, it is natural to consider cosmological black holes endowed with axion hair. We investigate the photon quasinormal modes of a Schwarzschild black hole with axion hair where the electromagnetic field is coupled to the axion field via a Chern-Simons interaction. We derive the master equations for the electromagnetic field as a set of coupled equations for parity-even and parity-odd modes and numerically compute quasinormal modes by using Leaver's continued fraction method. We find parity violation in the polarization of photons within the quasinormal mode spectrum. This parity violation in electromagnetic signals could serve as a new probe to explore the nature of the dark sector.\n\n", "2506.04101": "2025-06-04, **Investigating the HI distribution and kinematics of ESO444-G084 and [KKS2000]23: New insights from the MHONGOOSE survey**, Brenda Namumba et.al., [2506.04101v1](http://arxiv.org/abs/2506.04101v1)\n\n We present the HI distribution, kinematics, mass modeling, and disk stability of the dwarf irregular galaxies ESO444-G084 and [KKS2000]23 using high-resolution, high-sensitivity MHONGOOSE survey data from MeerKAT. ESO444-G084 shows centrally concentrated HI emission, while [KKS2000]23 exhibits irregular high-density clumps. Total HI fluxes measured down to 10^19 and 10^18 cm^-2 are nearly identical, indicating that the increased HI diameter at lower column densities results mainly from the larger beam, with no significant extra emission detected. We derive total HI masses of (1.1 +/- 0.1) x 10^8 and (6.1 +/- 0.3) x 10^8 solar masses for ESO444-G084 and [KKS2000]23, respectively. Using PyFAT and TiRiFiC, we extract 3D rotation curves that reveal disk-like kinematics in both galaxies. ESO444-G084 shows a warp beyond ~1.8 kpc and a fast-rising curve consistent with a centrally concentrated dark matter distribution, while [KKS2000]23's more gradual rise suggests a more extended halo. Mass modeling with an isothermal halo and stellar mass-to-light ratios of 0.20 for ESO444-G084 and 0.18 for [KKS2000]23 yields consistent results. We analyze disk stability using spatially resolved Toomre Q and gas-to-critical surface density ratios, linking these with H-alpha and FUV-based star formation. ESO444-G084 supports localized star formation despite global stability, while [KKS2000]23 appears gravitationally unstable yet lacks H-alpha, suggesting that turbulence, gas depletion, or past feedback suppresses star formation. No inflows or outflows are detected, indicating internal processes regulate star formation. This study highlights the interplay between HI morphology, kinematics, dark matter distribution, and disk stability, showing how internal processes shape dwarf galaxy evolution.\n\n", "2506.04100": "2025-06-04, **Deep Neural Networks Hunting Ultra-Light Dark Matter**, Pavel Kůs et.al., [2506.04100v1](http://arxiv.org/abs/2506.04100v1)\n\n Ultra-light dark matter (ULDM) is a compelling candidate for cosmological dark matter. If ULDM interacts with ordinary matter, it can induce measurable, characteristic signals in pulsar-timing data because it causes the orbits of pulsars in binary systems to osculate. In this work, we investigate the potential of machine learning (ML) techniques to detect such ULDM signals. To this end, we construct three types of neural networks: an autoencoder, a binary classifier, and a multiclass classifier. We apply these methods to four theoretically well-motivated ULDM models: a linearly coupled scalar field, a quadratically coupled scalar field, a vector field and a tensor field. We show that the sensitivity achieved using ML methods is comparable to that of a semi-analytical Bayesian approach, which to date has only been applied to the linear scalar case. The ML approach is readily applicable to all four ULDM models and, in the case of the multiclass classifier, can distinguish between them. Our results, derived from simulated data, lay the foundation for future applications to real pulsar-timing observations.\n\n", "2506.04074": "2025-06-04, **Probing the sensitivity of CTAO-N LSTs observations at large zenith angles to the multi-TeV gamma-ray emission from the inner 10 parsecs of the Galactic Center**, Shotaro Abe et.al., [2506.04074v1](http://arxiv.org/abs/2506.04074v1)\n\n Observations of the Galactic Center using Imaging Atmospheric Cherenkov Telescopes (IACTs), such as H.E.S.S., MAGIC, and VERITAS, have revealed a very-high-energy (VHE, $\\gtrsim 100$ GeV) gamma-ray source, HESS J1745$-$290, aligned with the dynamical center of the Milky Way. This source shows point-like emission ($\\lesssim 0.1^\\circ$) and a strong suppression in its energy-differential spectrum in the ten TeV energy regime, modeled well by a power-law with an exponential cutoff. The origin of this emission is debated, with candidate emission scenarios including dark matter annihilations, millisecond pulsars in the central stellar clusters, and hadronic interactions in the vicinity of Sagittarius A*. Deriving the sensitivity to these spectral models is key to discriminating the physical processes at work. We show that combining H.E.S.S., MAGIC, and VERITAS archival data can well described the observed emission by a power-law with an exponential energy cutoff within the present uncertainties. Given the near advent of the array of the Large-Sized Telescopes (LSTs) at CTAO-N, we timely simulate realistic upcoming observations of the central emission by the CTAO-N four-LST array, to derive the sensitivity to resolve the sharpness of the spectral energy cutoff. We find that 500 hours of four-LST observations taken at large zenith angles, possibly accumulated over several years, can significantly discriminate the dark-matter emission scenario from the leptonic and hadronic ones. Also, a preliminary 3$\\sigma$ hint for such discrimination could emerge within the first year. We demonstrate, for the first time, that CTAO-N is able to provide new insights on differentiating among the above-mentioned emission scenarios in the next several years.\n\n", "2506.03955": "2025-06-04, **Test of conformal gravity as an alternative to dark matter from the observations of elliptical galaxies**, Li-Xue Yue et.al., [2506.03955v1](http://arxiv.org/abs/2506.03955v1)\n\n As an alternative gravitational theory to General Relativity (GR), the Conformal Gravity (CG) has recently been successfully verified by observations of Type Ia supernovae (SN Ia) and the rotation curves of spiral galaxies. The observations of galaxies only pertain to the non-relativistic form of gravity. In this context, within the framework of the Newtonian theory of gravity (the non-relativistic form of GR), dark matter is postulated to account for the observations. On the other hand, the non-relativistic form of CG predicts an additional potential: besides the Newtonian potential, there is a so-called linear potential term, characterized by the parameter $\\gamma^*$, as an alternative to dark matter in Newtonian gravity. To test CG in its non-relativistic form, much work has been done by fitting the predictions to the observations of circular velocity (rotation curves) for spiral galaxies. In this paper, we test CG with the observations from elliptical galaxies. Instead of the circular velocities for spiral galaxies, we use the velocity dispersion for elliptical galaxies. By replacing the Newtonian potential with that predicted by non-relativistic form of CG in Hamiltonian, we directly extend the Jeans equation derived in Newtonian theory to that for CG. By comparing the results derived from the ellipticals with that from spirals, we find that the extra potential predicted by CG is not sufficient to account for the observations of ellipticals. Furthermore, we discover a strong correlation between $\\gamma^*$ and the stellar mass $M^*$ in dwarf spheroidal galaxies. This finding implies that the variation in $\\gamma^*$ violates a fundamental prediction of Conformal Gravity (CG), which posits that $\\gamma^*$ should be a universal constant.\n\n", "2506.03904": "2025-06-04, **Gravothermal expansion of dwarf spheroidal galaxies heated by dark subhaloes**, Jorge Peñarrubia et.al., [2506.03904v1](http://arxiv.org/abs/2506.03904v1)\n\n We use analytical and $N$-body methods to study the evolution of dwarf spheroidal galaxies (dSphs) embedded in dark matter (DM) haloes that host a sizeable subhalo population. Dark subhaloes generate a fluctuating gravitational field that injects energy into stellar orbits, driving a gradual expansion of dSphs. Despite the overall expansion, the stellar density profile preserves its initial shape, suggesting that the evolution proceeds in a self-similar manner. Meanwhile, the velocity dispersion profile, initially flat, evolves as the galaxy expands: the inner regions heat up, while the outer regions cool down. Kinematically, this resembles gravothermal collapse but with an inverted evolution, instead of collapsing the stellar system expands within a fluctuating halo potential. As the half-light radius $r\\_{\\rm half}$ approaches the halo peak velocity radius $r\\_{\\rm max}$, the expansion slows, and the velocity dispersion peaks at $\\sigma\\_{\\rm max} \\simeq 0.27 v\\_{\\rm max}$. The stellar heat capacity remains positive for deeply embedded stars but diverges near $r\\_{\\rm max}$, turning negative beyond this threshold, which indicates a phase transition in the dynamical response to energy injection. The relaxation time scales as $t\\_{\\rm rel} \\sim r\\_{\\rm half}^{3/2}$, showing that orbital diffusion slows as the galaxy expands. Ultra-faint dSphs, having the smallest sizes and shortest relaxation times, are particularly sensitive to the presence of dark subhaloes. Some of our dSph models expand beyond the detection of current photometric surveys, becoming `stealth' galaxies with half-light radii and velocity dispersions similar to ultra-diffuse galaxies (UDGs), but orders of magnitude lower luminosities, representing a distinct, yet currently undetected, population of DM-dominated satellites.\n\n", "2506.03810": "2025-06-04, **Molecular Dynamics Simulations on Nuclear Recoils in Silicon Crystals towards Single Electron-Hole Pair Ionization Yields**, Chang-Hao Fang et.al., [2506.03810v1](http://arxiv.org/abs/2506.03810v1)\n\n We have developed a novel methodology utilizing molecular dynamics simulations to evaluate the ionization yields of nuclear recoils in crystalline silicon. This approach enables analytical exploration of atomic-scale transport within the lattice without necessitating parameterization. The quenching factors across the nuclear recoil energy range from 20 eV to 10 keV have been thoroughly investigated. A remarkable agreement with experimental data is achieved, particularly for the minimal energy regime conducted to date, reaching the level of a single electron-hole pair. This work presents evidence of a crucial and fundamental distribution of the quenching factor, which can be associated to the collisional interactions underlying the transport phenomena. The region below 4 keV of the quenching factor, where discrepancies have been observed with the Lindhard's model, is found to be significantly attributed to the lattice binding effect and the specific crystal structure. In contrast, a gradual functional relationship is identified below approximately 100 eV, indicating that the quenching factor is influenced by the crystallographic orientation of the target material. From a distributional perspective, our analysis allows for the determination of the minimum exclusion mass for the dark matter nucleon elastic scattering channel at 0.29 $\\mathrm{GeV}/c^2$, thereby significantly enhancing sensitivity for the sub-$\\mathrm{GeV}/c^2$ mass region.\n\n", "2506.03678": "2025-06-04, **Searching for Dark Galaxies with HI detection from the Arecibo Legacy Fast ALFA (ALFALFA) survey**, Minseong Kwon et.al., [2506.03678v1](http://arxiv.org/abs/2506.03678v1)\n\n We present a catalog of 142 dark galaxy candidates in a region covered by the Arecibo Legacy Fast ALFA (ALFALFA) survey. We start with 344 ALFALFA HI sources without optical counterparts and remove those that do not seem to have dark galaxy origin. To do that, we first eliminate 83 sources that are known HI clouds probably formed from tidal interactions between galaxies and 13 sources that have optical counterparts. We then remove 56 sources located near other HI sources, which are likely to be HI clouds. We further exclude 10 sources that have nearby HI sources within the ALFALFA beam and 40 sources potentially associated with nearby galaxies. We perform visual inspection of optical images from DESI Legacy Imaging Survey with an $r$-band surface brightness limit of $\\sim 28.5 \\rm \\ mag\\ arcsec^{-2}$ as well as NUV images from GALEX to confirm the absence of stellar emission. We additionally inspect infrared images from WISE and AKARI for dust emission. As a result, we identify 142 dark galaxy candidates and analyze their physical properties by comparing with luminous galaxies. We find that the dark galaxy candidates generally have smaller dynamical masses, higher HI-to-dynamical mass ratios, and are located in less dense regions when compared to luminous galaxies, which is consistent with results from cosmological simulations. This sample provides an important testbed for studying the role of dark matter in galaxy formation and evolution.\n\n", "2506.03539": "2025-06-04, **Germanium Atomic Compton Scattering Measurements and ${ab}$ ${initio}$ Many-Body Calculations: Implications for Electronic recoil Dark Matter Detection**, Chang-Hao Fang et.al., [2506.03539v1](http://arxiv.org/abs/2506.03539v1)\n\n Diverse searches for direct dark matter (DM) in effective electromagnetic and leptophilic interactions resulting from new physics, as well as Weakly Interacting Massive Particles (WIMPs) with unconventional electronic recoils, are intensively pursued. Low-energy backgrounds from radioactive $\\gamma$ rays via Compton scattering and photon coherent scattering are unavoidable in terrestrial detectors. The interpretation of dark matter experimental data is dependent on a better knowledge of the background in the low-energy region. We provide a 2.3% measurement of atomic Compton scattering in the low momentum transfer range of 180 eV/c to 25 keV/c, using a 10-g germanium detector bombarded by a $^{137}\\mathrm{Cs}$ source with a 7.2 m-Curie radioactivity and the scatter photon collected by a cylindrical NaI[Tl] detector. The ability to detect Compton scattering's doubly differential cross section (DDCS) gives a special test for clearly identifying the kinematic restraints in atomic many-body systems, notably the Livermore model. Additionally, a low-energy-background comparison is made between coherent photon scattering and Compton scattering replacing the scattering function of ${GEANT4}$@software, which uses a completely relativistic impulse approximation (RIA) together with Multi-Configuration Dirac-Fock (MCDF) wavefunctions. For the purpose of investigating sub-GeV mass and electronic-recoil dark matter theories, signatures including low energy backgrounds via high energy $\\gamma$ rays in germanium targets are discussed.\n\n", "2506.03390": "2025-06-03, **The Roman View of Strong Gravitational Lenses**, Bryce Wedig et.al., [2506.03390v1](http://arxiv.org/abs/2506.03390v1)\n\n Galaxy-galaxy strong gravitational lenses can constrain dark matter models and the Lambda Cold Dark Matter cosmological paradigm at sub-galactic scales. Currently, there is a dearth of images of these rare systems with high signal-to-noise and angular resolution. The Nancy Grace Roman Space Telescope (hereafter, Roman), scheduled for launch in late 2026, will play a transformative role in strong lensing science with its planned wide-field surveys. With its remarkable 0.281 square degree field of view and diffraction-limited angular resolution of ~0.1 arcsec, Roman is uniquely suited to characterizing dark matter substructure from a robust population of strong lenses. We present a yield simulation of detectable strong lenses in Roman's planned High Latitude Wide Area Survey (HLWAS). We simulate a population of galaxy-galaxy strong lenses across cosmic time with Cold Dark Matter subhalo populations, select those detectable in the HLWAS, and generate simulated images accounting for realistic Wide Field Instrument detector effects. For a fiducial case of single 146-second exposures, we predict around 160,000 detectable strong lenses in the HLWAS, of which about 500 will have sufficient signal-to-noise to be amenable to detailed substructure characterization. We investigate the effect of the variation of the point-spread function across Roman's field of view on detecting individual subhalos and the suppression of the subhalo mass function at low masses. Our simulation products are available to support strong lens science with Roman, such as training neural networks and validating dark matter substructure analysis pipelines.\n\n", "2506.03334": "2025-06-03, **Could Planck Star Remnants be Dark Matter?**, Oem Trivedi et.al., [2506.03334v1](http://arxiv.org/abs/2506.03334v1)\n\n We explore the end state of gravitational collapse under quantum gravity effects and propose that Planck Star Remnants (PSR), formed via nonsingular bounces, could serve as viable dark matter candidates. Within the framework of Loop Quantum Cosmology, we model the collapse of a homogeneous matter distribution and show that the classical singularity is replaced by a quantum bounce at the Planck density. By analytically matching the Friedmann Lemaitre Robertson Walker (FLRW) interior to an exterior Schwarzschild spacetime using the Israel junction conditions, we demonstrate that the bounce remains causally hidden from external observers, avoiding any observable re-expansion. This naturally leads to the formation of stable, non-radiating PSR, whose radius coincides with the Schwarzschild radius when the black hole mass approaches the Planck mass as a result of Hawking evaporation. We suggest that such remnants may originate from evaporating primordial black holes in the early universe, and estimate the relic abundance needed for PSR to account for the observed dark matter density. We also discuss some crucial differences between PSR and previous proposals of Planck mass relics. The scenario is shown to be consistent with existing astrophysical and cosmological constraints, offering a unified framework connecting quantum gravitational collapse, and the nature of dark matter.\n\n", "2506.03269": "2025-06-03, **Parametric Coincidence in the Baryon to Dark Matter Ratio from Affleck-Dine Baryogenesis and UV Freeze-in Dark Matter**, Jae Hyeok Chang et.al., [2506.03269v1](http://arxiv.org/abs/2506.03269v1)\n\n We highlight that the observed concurrence between the baryon and dark matter relic densities can be explained via a parametric coincidence between two distinct production mechanisms: Affleck-Dine baryogenesis and dark matter UV freeze-in. In the Affleck-Dine mechanism, the baryon asymmetry is naturally proportional to the inflationary reheating temperature $T\\_{\\rm rh}$, which also plays a critical role in setting the relic abundance of UV freeze-in dark matter. Since Affleck-Dine baryogenesis requires flat directions in the potential, the framework is inherently supersymmetric, offering compelling UV freeze-in dark matter candidates such as the gravitino. We outline scenarios in which $T\\_{\\rm rh}$ simultaneously determines both relic abundances, resulting in a baryon-to-dark matter ratio of order unity that is largely insensitive to $T\\_{\\rm rh}$. We also discuss the conditions required to avoid Q-ball formation or dark matter production by other mechanisms, such as NLSP decays, to preserve the parametric coincidence between baryon and dark matter abundances.\n\n", "2506.03240": "2025-06-03, **The cusp-halo relation**, M. Sten Delos et.al., [2506.03240v1](http://arxiv.org/abs/2506.03240v1)\n\n Every halo of collisionless dark matter contains a $\\rho = A r^{-1.5}$ density cusp at its center. This prompt cusp is a relic of the halo's earliest moments and has a mass comparable to the cutoff scale in the spectrum of initial density perturbations. In this work, we provide a framework to predict for each halo the coefficient $A$ of its central cusp. We also present a \"cusp-NFW\" functional form that accurately describes the density profile of a halo with a prompt cusp at its center. Accurate characterization of each halo's central cusp is of particular importance in the study of warm dark matter models, for which the spectral cutoff is on an astrophysically relevant mass scale. To facilitate easy incorporation of prompt cusps into any halo modeling approach, we provide a code package that implements the cusp-halo relation and the cusp-NFW density profile.\n\n", "2506.03244": "2025-06-03, **Cosmic Outliers: Low-Spin Halos Explain the Abundance, Compactness, and Redshift Evolution of the Little Red Dots**, Fabio Pacucci et.al., [2506.03244v1](http://arxiv.org/abs/2506.03244v1)\n\n The Little Red Dots (LRDs) are high-redshift galaxies uncovered by JWST, characterized by small effective radii ($R\\_{\\rm eff} \\sim 80-300$ pc), number densities intermediate between typical galaxies and quasars, and a redshift distribution peaked at $z \\sim 5$. We present a theoretical model in which the LRDs descend from dark matter halos in the extreme low-spin tail of the angular momentum distribution. Within this framework, we explain their three key observational signatures: (i) abundance, (ii) compactness, and (iii) redshift distribution. Our model focuses on observed, not modeled, properties; it is thus independent of whether they are powered primarily by a black hole or stars. We find that the assumption that the prototypical LRD at $z \\sim 5$ originates from halos in the lowest $\\sim 1\\%$ of the spin distribution is sufficient to reproduce both their observed number densities and physical sizes. The redshift evolution of their observability is driven by the interplay between the evolving compact disk fraction and cosmological surface brightness dimming. This effect leads to a well-defined \"LRDs Era\" at $4<z<8$, during which the LRDs are common and detectable; at $z<4$, they are bright but rare, while at $z>8$, they are common but faint. Finally, we test the predicted redshift trend against observational data, finding excellent agreement. Additional observational support comes from their excess small-scale clustering and spectral signatures of extreme core densities, both of which are expected outcomes of galaxy formation in low-spin halos. These findings suggest that the LRDs are not a fundamentally distinct population but the natural manifestation of galaxies forming in the rarest, lowest angular momentum environments.\n\n", "2506.03132": "2025-06-03, **A Fuzzy Situation Eased: Cold Dark Matter with Multipoles Can Explain The Double Radio Quad Lens HS 0810+2554**, John H. Miller Jr et.al., [2506.03132v1](http://arxiv.org/abs/2506.03132v1)\n\n Originally observed in isophotal density contours of elliptical galaxies, higher order perturbations in the form of Fourier modes, or multipoles, are becoming increasingly recognized as necessary to account for angular mass complexity in strong lensing analyses. When smooth, elliptical CDM mass models fail, multipoles often emerge as solutions. With the discovery of two radio jets in the source quasar, the strong gravitational lens HS 0810+2554 can no longer be well fit by elliptical mass models, suggesting perturbations on small-scales. In this paper, we investigate the efficacy of multipoles $m=1$ (lopsidedness), $m=3$ (triangleness), and $m=4$ (boxiness and diskiness) in addressing the image positional anomalies of the two radio quads of HS 0810+2554. Due to the exact pairing and arrival sequence of the images being unknown, we consider all feasible image configurations. With 64 unique best-fit models, we achieve a fit of $\\chi=1.59$ ($\\chi^2=2.53$), with $m=1,3,4$ multipole strengths of 0.9%, 0.4%, and 0.6%, respectively, with images in the reverse time ordering. Elliptical+shear models from previous works find $\\chi\\!\\sim\\!7\\!-\\!10$, for comparison. With the morphological (i.e., standard) arrival sequence, we achieve a fit of $\\chi=2.95$ with two images being assigned to opposite sources. Therefore, CDM mass models with mass complexity in the form of multipoles are able to adequately explain the positional anomalies in HS 0810+2554. Alternative dark matter theories, like fuzzy dark matter, need not be invoked.\n\n", "2506.03091": "2025-06-03, **Sensitivity of a Gigahertz Fabry-Pérot Resonator for Axion Dark Matter Detection**, Jacob Egge et.al., [2506.03091v1](http://arxiv.org/abs/2506.03091v1)\n\n Axions are hypothetical pseudo-Nambu Goldstone bosons that could explain the observed cold dark matter density and solve the strong CP problem of quantum chromodynamics (QCD). Haloscope experiments commonly employ resonant cavities to search for a conversion of axion dark matter into photons in external magnetic fields. As the expected signal power degrades with increasing frequency, this approach becomes challenging at frequencies beyond tens of Gigahertz. Here, we propose a novel haloscope design based on an open Fabry-P\\'erot resonator. Operating a small-scale resonator at cryogenic temperatures and at modest magnetic fields should already lead to an unparalleled sensitivity for photon-axion couplings $g\\_{a\\gamma} \\gtrsim 3\\times10^{-12}\\,\\mathrm{GeV}^{-1}$ at 35GHz. We demonstrate how this sensitivity could be further improved using graded-phase mirrors and sketch possibilities to probe benchmark models of the QCD axion.\n\n", "2506.03023": "2025-06-03, **TDCOSMO 2025: Cosmological constraints from strong lensing time delays**, TDCOSMO Collaboration et.al., [2506.03023v2](http://arxiv.org/abs/2506.03023v2)\n\n We present cosmological constraints from 8 strongly lensed quasars (hereafter, the TDCOSMO-2025 sample). Building on previous work, our analysis incorporated new deflector stellar velocity dispersions measured from spectra obtained with the James Webb Space Telescope (JWST), the Keck Telescopes, and the Very Large Telescope (VLT), utilizing improved methods. We used integrated JWST stellar kinematics for 5 lenses, VLT-MUSE for 2, and resolved kinematics from Keck and JWST for RX J1131-1231. We also considered two samples of non-time-delay lenses: 11 from the Sloan Lens ACS (SLACS) sample with Keck-KCWI resolved kinematics; and 4 from the Strong Lenses in the Legacy Survey (SL2S) sample. We improved our analysis of line-of-sight effects, the surface brightness profile of the lens galaxies, and orbital anisotropy, and corrected for projection effects in the dynamics. Our uncertainties are maximally conservative by accounting for the mass-sheet degeneracy in the deflectors' mass density profiles. The analysis was blinded to prevent experimenter bias. Our primary result is based on the TDCOSMO-2025 sample, in combination with $\\Omega\\_{\\rm m}$ constraints from the Pantheon+ Type Ia supernovae (SN) dataset. In the flat $\\Lambda$ Cold Dark Matter (CDM), we find $H\\_0=72.1^{+4.0}\\_{-3.7}$ km s$^{-1}$ Mpc$^{-1}$. The SLACS and SL2S samples are in excellent agreement with the TDCOSMO-2025 sample, improving the precision on $H\\_0$ in flat $\\Lambda$CDM to 4.4%. Using the Dark Energy Survey SN Year-5 dataset (DES-SN5YR) or DESI-DR2 baryonic acoustic oscillations (BAO) likelihoods instead of Pantheon+ yields very similar results. We also present constraints in the open $\\Lambda$CDM, $w$CDM, $w\\_0w\\_a$CDM, and $w\\_{\\phi}$CDM cosmologies. The TDCOSMO $H\\_0$ inference is robust and consistent across all presented cosmological models, and our cosmological constraints in them agree with those from the BAO and SN.\n\n", "2506.02957": "2025-06-03, **SPINN: Advancing Cosmological Simulations of Fuzzy Dark Matter with Physics Informed Neural Networks**, Ashutosh Kumar Mishra et.al., [2506.02957v1](http://arxiv.org/abs/2506.02957v1)\n\n Physics-Informed Neural Networks (PINNs) have emerged as a powerful tool for solving differential equations by integrating physical laws into the learning process. This work leverages PINNs to simulate gravitational collapse, a critical phenomenon in astrophysics and cosmology. We introduce the Schr\\\"odinger-Poisson informed neural network (SPINN) which solve nonlinear Schr\\\"odinger-Poisson (SP) equations to simulate the gravitational collapse of Fuzzy Dark Matter (FDM) in both 1D and 3D settings. Results demonstrate accurate predictions of key metrics such as mass conservation, density profiles, and structure suppression, validating against known analytical or numerical benchmarks. This work highlights the potential of PINNs for efficient, possibly scalable modeling of FDM and other astrophysical systems, overcoming the challenges faced by traditional numerical solvers due to the non-linearity of the involved equations and the necessity to resolve multi-scale phenomena especially resolving the fine wave features of FDM on cosmological scales.\n\n", "2506.02956": "2025-06-03, **Local dark matter density from Gaia DR3 K-dwarfs using Gaussian processes**, Laurin Söding et.al., [2506.02956v1](http://arxiv.org/abs/2506.02956v1)\n\n Modern astrophysical surveys have produced a wealth of data on the positions and velocities of stars in the Milky Way with varying accuracies. An ever-increasing detail in observational data calls for more complex physical models and in turn more sophisticated statistical methods to extract information. We perform a vertical Jeans analysis, including a local approximation of the tilt term, using a sample of $200\\,000$ K-dwarf stars from the Gaia DR3 catalogue. After combination with the Survey-of-Surveys (SoS) catalogue, $160\\,888$ of those have radial velocity measurements. We use Gaussian processes as priors for the covariance matrix of radial and vertical velocities. Joint inference of the posterior distribution of the local dark matter density and the velocity moments is performed using geometric variational inference. We find a local dark matter density of ${\\rho\\_\\mathrm{dm} = 0.0131 \\pm 0.0041\\, \\mathrm{M}\\_\\odot\\,\\mathrm{pc}^{-3} = 0.50 \\pm 0.15\\, \\mathrm{GeV}\\,\\mathrm{cm}^{-3}}$ at the Sun's position, which is in agreement with most other recent analyses. By comparing a ($z$-dependent) Gaussian process prior with a ($z$-independent) scalar prior for the tilt term, we quantify its impact on estimates of the local dark matter density and argue that careful modelling is required to mitigate systematic biases.\n\n", "2506.02937": "2025-06-03, **Probing Dark Matter Spike with Gravitational Waves from Early EMRIs in the Milky Way Center**, Chen Feng et.al., [2506.02937v1](http://arxiv.org/abs/2506.02937v1)\n\n Cold dark matter may form dense structures around supermassive black holes (SMBHs), significantly influencing their local environments. These dense regions are ideal sites for the formation of extreme mass-ratio inspirals (EMRIs), in which stellar-mass compact objects gradually spiral into SMBH, emitting gravitational waves (GWs). Space-based gravitational-wave (GW) observatories such as LISA and Taiji will be sensitive to these signals, including early-stage EMRIs (E-EMRIs) that persist in the low-frequency band for extended periods. In this work, we investigate the impact of dark matter-induced dynamical friction on E-EMRIs in the Milky Way Center, model its effect on the trajectory, and calculate the resulting modifications to the GW spectrum. Our analysis suggests that this influence might be sizable and lead to detectable deviations in the spectrum, namely suppression at low frequencies and enhancement at high frequencies, therefore providing a potential probe for dark matter with future GW detectors in space, such as LISA and Taiji.\n\n", "2506.02848": "2025-06-03, **Active galactic nuclei through the prism of galaxy clusters: bounds on axion-like particles**, Denys Malyshev et.al., [2506.02848v1](http://arxiv.org/abs/2506.02848v1)\n\n Hypothetical axion-like particles (ALPs) are of interest because of their potential to act as dark matter or to reveal information about yet undiscovered fundamental constituents of matter. Such particles can be created when photons traverse regions of magnetic fields. The conversion probability depends on both the magnetic field parameters and photon energy, leading to multiple spectral absorption features as light passes through magnetized regions.   Traditionally, astrophysical searches have focused on detecting such features in individual objects. However, the limited understanding of properties of cosmic magnetic fields have hindered the progress. Here we introduce a new approach by analyzing stacked (rather than individual) spectra of active galactic nuclei (AGNs) positioned behind galaxy clusters -- gigantic magnetic field reservoirs. Stacking efficiently averages over the uncertainties in magnetic fields, revealing a unique step-like spectral signature of photon-to-ALP conversion.   With this approach we advance into previously inaccessible regions of the ALP parameter space for nano-electronvolt masses. Adopting this method will significantly improve existing bounds across a wide range of masses by using different telescopes and increasing the size of the stacked datasets. The Cherenkov Telescope Array Observatory, in particular, will extensively probe the parameter space where ALPs could serve as dark matter.\n\n", "2506.03226": "2025-06-03, **Cascade Relaxation of the Gravitating Vacuum as a Generator of the Evolving Universe**, V. N. Lukash et.al., [2506.03226v1](http://arxiv.org/abs/2506.03226v1)\n\n The cascade relaxation of a polarized vacuum in the expanding Universe is a chain of evolutionary epochs of decreasing its density with the exit of dominant fields (each in its own time) from the initial zero states to nonzero values, from the dominant scalar field in the early Universe to subsequent ones, including the $\\Lambda$-term in the modern Universe. The cascade vacuum relaxation creates the entire observable cosmology from the Friedmann model with small perturbations of the metric with non-power-law power spectra from which primordial black holes could have arisen, and gravitational waves over a wide wavenumber range to the formation of dark matter and energy, early galaxies, supermassive black holes, and the large-scale structure of the Universe. An observational model of cascade vacuum relaxation in the early Universe has been build, which contains two constants determined by observational data and does not require information on the potential of the fields. A solution has been obtained for the general relativity vacuum attractor, including, in addition to the two previously mentioned constants, the third constant (not yet limited by observations), which leads to an additional power of density perturbations on a small scale ($k>10\\,$Mpc$^{-1}$) in the form of a ``bump'', a two-power-law spectrum, etc.\n\n", "2506.02400": "2025-06-03, **Caustic fringes for wave dark matter**, Andrew Eberhardt et.al., [2506.02400v1](http://arxiv.org/abs/2506.02400v1)\n\n Wave dark matter is composed of particles sufficiently light that their de Broglie wavelength exceeds the average inter-particle separation. A typical wave dark matter halo exhibits granular substructures due to wave interference. In this paper, we explore the wave interference effects around caustics. These are locations of formally divergent density in cold collisionless systems. Examples include splashback in galaxy clusters, and tidal shells in merging galaxies, where the pile-up of dark matter close to apogee gives rise to caustics. We show that wave interference modifies the density profile in the vicinity of the caustics, giving rise to a fringe pattern well-described by the Airy function. This follows from approximating the gravitational potential as linear close to apogee. This prediction is verified in a series of numerical simulations in which the gravitational potential is computed exactly. We provide a formula expressing the fringe separation in terms of the wave dark matter mass and halo parameters, which is useful for interpreting and stacking data. The fringe separation near caustics can be significantly larger than the naive de Broglie scale (the latter set by the system's velocity dispersion). This opens up the possibility of detecting caustic fringes for a wide range of wave dark matter masses.\n\n"}, "supernova": {"2506.04184": "2025-06-04, **Core-collapse supernova parameter estimation with the upcoming Vera C. Rubin Observatory**, Andrea Simongini et.al., [2506.04184v1](http://arxiv.org/abs/2506.04184v1)\n\n The Vera Rubin Observatory's Legacy Survey of Space and Time (LSST) is expected to revolutionize time-domain optical astronomy as we know it. With its unprecedented depth, the LSST will survey the southern hemisphere sky, generating nearly 32 trillion observations over its nominal 10-year operation. Among these, approximately 10 million will be supernovae (SNe). These observations will uniquely characterize the SN population, enabling studies of known and rare SN types, detailed parameterization of their light curves, deep searches for new SN progenitor populations, the discovery of strongly lensed SNe, and the compilation of a large, well-characterized sample of superluminous SNe. We analyzed a sample of 22663 simulations of LSST light curves for core collapse SNe (CCSNe), modeled using the radiative transfer code STELLA. We analyzed this dataset with the software CASTOR, which enables the reconstruction of synthetic light curves and spectra via a machine learning technique that allows one to retrieve the complete parameter map of a SN. For each parameter we compared the observed and the true values, determining how LSST light curves alone will contribute to characterize the progenitor and the explosion. Our results indicate that LSST alone will not suffice for a comprehensive and precise characterization of progenitor properties and explosion parameters. The limited spectral coverage of LSST light curves (in most cases) does not allow for the accurate estimation of bolometric luminosity, and consequently, of the explosion energy and nickel yield. Additionally, the redshift-absorption degeneracy is difficult to resolve without supplementary information. These findings suggest that for the most interesting SNe, complementary follow-up observations using spectrographs and optical facilities (particularly in the infrared bands) will be essential for accurate parameter determination.\n\n", "2506.04066": "2025-06-04, **Europium, we have a problem. Modelling r-process enrichment across Local Group galaxies**, Marco Palla et.al., [2506.04066v1](http://arxiv.org/abs/2506.04066v1)\n\n Context: Europium (Eu) serves as a crucial tracer to understand the origin of rapid neutron-capture process (r-process) elements. An extensive effort was made in the last decade to model the chemical evolution of this element in the Galaxy. However, less attention was reserved to Eu in different galaxies of the Local Group (LG). Aims: By employing detailed and well-tested chemical evolution models, we investigate Eu enrichment across LG dwarf spheroidal galaxies, allowing for a direct comparison between model predictions for dwarf galaxies and the Milky Way (MW). Methods: Building upon an r-process enrichment framework that successfully reproduces the observed Eu abundance patterns as well as the supernova and compact binary merger rates in the MW, we build chemical evolution models for the Sagittarius, Fornax, and Sculptor dwarf spheroidal galaxies and test the enrichment scenario against the abundance patterns observed in these galaxies. Results: Models reproducing the Galactic Eu patterns significantly underestimate the [Eu/Fe] ratios observed in LG dwarfs. To address this \"missing Eu\" problem, we estimate the Eu production rate needed to match the observations and explore potential contributions either from prompt or delayed sources, assessing their compatibility with the MW observables. Conclusions: The same r-process enrichment frameworks cannot reproduce simultaneously the Eu patterns both in the MW and in dwarf galaxies. However, a scenario where additional Eu is provided by an increased production from delayed sources at low metallicity can theoretically reconcile the trends observed in the MW and in LG dwarfs, because of the small discrepancies (0.1 dex) between model predictions and observations found in this case. Further targeting and modelling of neutron-capture elements in LG galaxies are however needed to fill the gaps in our current understanding of the problem.\n\n", "2506.03955": "2025-06-04, **Test of conformal gravity as an alternative to dark matter from the observations of elliptical galaxies**, Li-Xue Yue et.al., [2506.03955v1](http://arxiv.org/abs/2506.03955v1)\n\n As an alternative gravitational theory to General Relativity (GR), the Conformal Gravity (CG) has recently been successfully verified by observations of Type Ia supernovae (SN Ia) and the rotation curves of spiral galaxies. The observations of galaxies only pertain to the non-relativistic form of gravity. In this context, within the framework of the Newtonian theory of gravity (the non-relativistic form of GR), dark matter is postulated to account for the observations. On the other hand, the non-relativistic form of CG predicts an additional potential: besides the Newtonian potential, there is a so-called linear potential term, characterized by the parameter $\\gamma^*$, as an alternative to dark matter in Newtonian gravity. To test CG in its non-relativistic form, much work has been done by fitting the predictions to the observations of circular velocity (rotation curves) for spiral galaxies. In this paper, we test CG with the observations from elliptical galaxies. Instead of the circular velocities for spiral galaxies, we use the velocity dispersion for elliptical galaxies. By replacing the Newtonian potential with that predicted by non-relativistic form of CG in Hamiltonian, we directly extend the Jeans equation derived in Newtonian theory to that for CG. By comparing the results derived from the ellipticals with that from spirals, we find that the extra potential predicted by CG is not sufficient to account for the observations of ellipticals. Furthermore, we discover a strong correlation between $\\gamma^*$ and the stellar mass $M^*$ in dwarf spheroidal galaxies. This finding implies that the variation in $\\gamma^*$ violates a fundamental prediction of Conformal Gravity (CG), which posits that $\\gamma^*$ should be a universal constant.\n\n", "2506.03836": "2025-06-04, **An independent estimate of H(z) at z = 0.5 from the stellar ages of brightest cluster galaxies**, S. Ilani Loubser et.al., [2506.03836v1](http://arxiv.org/abs/2506.03836v1)\n\n Several cosmological observations (e.g., Cosmic Microwave Background (CMB), Supernovae Type Ia, and local distance ladder measurements such as Cepheids) have been used to measure the global expansion rate of the Universe, i.e., the Hubble constant, $H\\_{0}$. However, these precision measurements have revealed tensions between different probes that are proving difficult to solve. Independent, robust techniques must be exploited to validate results or mitigate systematic effects. We use the Cosmic Chronometer (CC) method, which leverages the differential age evolution of passive galaxies, to measure $H(z)$, without any assumption of the underlying cosmology. Unlike previous CC studies, we used only brightest cluster galaxies (BCGs), the oldest and most massive galaxies in the Universe, to construct a pure and homogeneous sample. In this work we used a sample of 53 BCGs in massive, Sunyaev-Zel'dovich selected galaxy clusters (0.3 $< z <$ 0.7) with Southern African Large Telescope (SALT) spectroscopic observations. We used optical spectra to measure D4000$\\_{\\rm n}$ of the BCGs to obtain a new direct measurement of $H(z) = 72.1 \\pm 33.9(\\rm stat) \\pm 7.3$(syst) km s$^{-1}$ Mpc$^{-1}$ at $z=0.5$. By using BCGs, we significantly reduced the systematic errors to 10% by minimising the stellar mass and metallicity dependence of the method. The dominant uncertainty, and limitation for our study, is statistical, and we need larger, homogeneous samples of the oldest, most massive galaxies. By using the $Planck$+BAO prior of $\\Omega\\_{m}$ and $\\Omega\\_{\\Lambda}$, the projected Hubble constant is $H\\_{0}$ = $54.6 \\pm 25.7(\\rm stat) \\pm 5.5$(syst) km s$^{-1}$ Mpc$^{-1}$, consistent with both CMB and Cepheid measurements.\n\n", "2506.03245": "2025-06-03, **The Pandora project. II: how non-thermal physics drives bursty star formation and temperate mass-loaded outflows in dwarf galaxies**, Sergio Martin-Alvarez et.al., [2506.03245v1](http://arxiv.org/abs/2506.03245v1)\n\n Dwarf galaxies provide powerful laboratories for studying galaxy formation physics. Their early assembly, shallow gravitational potentials, and bursty, clustered star formation histories make them especially sensitive to the processes that regulate baryons through multi-phase outflows. Using high-resolution, cosmological zoom-in simulations of a dwarf galaxy from \\textit{the Pandora suite}, we explore the impact of stellar radiation, magnetic fields, and cosmic ray feedback on star formation, outflows, and metal retention. We find that our purely hydrodynamical model without non-thermal physics - in which supernova feedback is boosted to reproduce realistic stellar mass assembly - drives violent, overly enriched outflows that suppress the metal content of the host galaxy. Including radiation reduces the clustering of star formation and weakens feedback. However, the additional incorporation of cosmic rays produces fast, mass-loaded, multi-phase outflows consisting of both ionized and neutral gas components, in better agreement with observations. These outflows, which entrain a denser, more temperate ISM, exhibit broad metallicity distributions while preserving metals within the galaxy. Furthermore, the star formation history becomes more bursty, in agreement with recent JWST findings. These results highlight the essential role of non-thermal physics in galaxy evolution and the need to incorporate it in future galaxy formation models.\n\n", "2506.03023": "2025-06-03, **TDCOSMO 2025: Cosmological constraints from strong lensing time delays**, TDCOSMO Collaboration et.al., [2506.03023v2](http://arxiv.org/abs/2506.03023v2)\n\n We present cosmological constraints from 8 strongly lensed quasars (hereafter, the TDCOSMO-2025 sample). Building on previous work, our analysis incorporated new deflector stellar velocity dispersions measured from spectra obtained with the James Webb Space Telescope (JWST), the Keck Telescopes, and the Very Large Telescope (VLT), utilizing improved methods. We used integrated JWST stellar kinematics for 5 lenses, VLT-MUSE for 2, and resolved kinematics from Keck and JWST for RX J1131-1231. We also considered two samples of non-time-delay lenses: 11 from the Sloan Lens ACS (SLACS) sample with Keck-KCWI resolved kinematics; and 4 from the Strong Lenses in the Legacy Survey (SL2S) sample. We improved our analysis of line-of-sight effects, the surface brightness profile of the lens galaxies, and orbital anisotropy, and corrected for projection effects in the dynamics. Our uncertainties are maximally conservative by accounting for the mass-sheet degeneracy in the deflectors' mass density profiles. The analysis was blinded to prevent experimenter bias. Our primary result is based on the TDCOSMO-2025 sample, in combination with $\\Omega\\_{\\rm m}$ constraints from the Pantheon+ Type Ia supernovae (SN) dataset. In the flat $\\Lambda$ Cold Dark Matter (CDM), we find $H\\_0=72.1^{+4.0}\\_{-3.7}$ km s$^{-1}$ Mpc$^{-1}$. The SLACS and SL2S samples are in excellent agreement with the TDCOSMO-2025 sample, improving the precision on $H\\_0$ in flat $\\Lambda$CDM to 4.4%. Using the Dark Energy Survey SN Year-5 dataset (DES-SN5YR) or DESI-DR2 baryonic acoustic oscillations (BAO) likelihoods instead of Pantheon+ yields very similar results. We also present constraints in the open $\\Lambda$CDM, $w$CDM, $w\\_0w\\_a$CDM, and $w\\_{\\phi}$CDM cosmologies. The TDCOSMO $H\\_0$ inference is robust and consistent across all presented cosmological models, and our cosmological constraints in them agree with those from the BAO and SN.\n\n", "2506.03019": "2025-06-03, **Constraints on Barrow and Tsallis Holographic Dark Energy from DESI DR2 BAO data**, Giuseppe Gaetano Luciano et.al., [2506.03019v1](http://arxiv.org/abs/2506.03019v1)\n\n Barrow and Tsallis Holographic Dark Energy (HDE) are two recently proposed extensions of the standard HDE framework, incorporating generalized corrections to horizon entropy through the use of Barrow and Tsallis entropies. Tsallis entropy arises from non-extensive statistical phenomena which account for long-range correlations and deviations from additivity, while Barrow entropy emerges from quantum-gravitational effects on the horizon geometry, associated with fractal modifications and deformations. At the cosmological level, both scenarios lead to the same equations, nevertheless the involved parameters obey different theoretical bounds. In this work, we use observational data from Supernova Type Ia (SNIa), Cosmic Chronometers (CC) and Baryonic acoustic oscillations (BAO), including the recently released DESI DR2 dataset, to place constraints on both scenaria. We show that both can be in agreement with observations, although they cannot alleviate the $H\\_0$ tension. However, applying information criteria we deduce that both of them are not favoured comparing to $\\Lambda$CDM concordance cosmological paradigm.\n\n", "2506.02731": "2025-06-03, **Bulk/boundary Modular Quintessence and DESI**, Luis A. Anchordoqui et.al., [2506.02731v1](http://arxiv.org/abs/2506.02731v1)\n\n The latest DESI DR2 results, when combined with other independent cosmological data on the Cosmic Microwave Background and supernovas, suggest a preference for dynamical dark energy.   We propose a novel cosmological scenario, which features two distinct scalar fields. One governs the magnitude of the present-day dark energy density and is related to the size of extra-dimensions. Accounting for the observed smallness of this energy density requires the scalar to reside near the boundary of field space.   The second field, responsible for the time evolution of dark energy and associated with the string coupling, must instead lie in the bulk to remain consistent with the non-observation of light string states. We show that a natural candidate for such dark energy dynamics is a quintessence modular-invariant potential, in which the second scalar field rolls down a negatively curved slope, starting from a self-dual critical point. We find that this scenario is in good agreement with the latest findings by DESI.\n\n", "2506.02551": "2025-06-03, **Impact of convective overshooting on the single-degenerate model of Type Ia supernovae**, Xinghuan Wang et.al., [2506.02551v2](http://arxiv.org/abs/2506.02551v2)\n\n The single-degenerate (SD) model is one of the principal models for the progenitors of Type Ia supernovae (SNe Ia). However, it faces some challenges, the primary being its inability to account for the observed SN Ia birth rate. Many studies have attempted to address this issue by expanding the parameter space, defined by the initial donor star mass and orbital period, that can lead to SNe Ia, as well as by improving binary population synthesis. While these efforts have led to significant progress, many uncertainties in stellar physics persist, which influences the outcomes of such studies. Convective overshooting, which can significantly affect the internal structure of a star and subsequently its evolution within a binary system, is one of the most significant sources of uncertainty in stellar physics. We investigate the effect of convective overshooting on the parameter space and birth rate of SNe Ia within the SD model. We employed the common-envelope wind (CEW) model, a new version of the SD model, as our progenitor model. Using MESA, we obtained the parameter space that leads to SNe Ia for three different convective overshooting parameters and calculated the corresponding SN Ia birth rate. Convective overshooting expands the upper boundaries (corresponding to a larger initial donor mass) and right boundaries (corresponding to a longer initial orbital period) of the parameter space for systems with massive white dwarfs (WDs; >= 0.75Msun). However, the minimum WD mass and the parameter space for low-mass WDs - and, consequently, the calculated SN Ia birth rate - vary non-monotonically with convective overshooting parameters. The CEW model may explain the SNe Ia that interact with the circumstellar medium (CSM), i.e., SNe Ia-CSM. We find that the parameter space for SNe Ia-CSM increases with convective overshooting parameters, as does their birth rate.\n\n", "2506.02476": "2025-06-03, **A chemical close-up of the main body of the Sagittarius dwarf galaxy**, Alessio Liberatori et.al., [2506.02476v1](http://arxiv.org/abs/2506.02476v1)\n\n We present the chemical composition of a sample of 37 red giant branch (RGB) stars belonging to the main body of the remnant of the Sagittarius (Sgr) dwarf spheroidal galaxy. All stars were observed with the FLAMES-UVES high-resolution spectrograph. Twenty-three new targets are selected along the blue side of the RGB of Sgr, but outside the galaxy stellar nucleus, in order to avoid contamination by the stars of the metal-poor globular cluster M54. Additionally, we re-analyzed archival spectra of fourteen targets located on the red RGB. For this sample, we derive the abundances of 21 chemical species (from Oxygen to Europium) representing different nucleosynthetic sites. The sample covers a large range of metallicity, from [Fe/H]~-2 to ~ -0.4 dex and we can identify the transition between the enrichment phases dominated by core-collapse (CC-SNe) and Type Ia (SNe-Ia) supernovae. The observed [{\\alpha}/Fe] trend suggests a knee occurring at [Fe/H]~-1.5/-1.3 dex, compatible with the rather low star formation efficiency of Sgr. At lower [Fe/H], Sgr stars exhibit a chemical composition compatible with Milky Way stars of similar [Fe/H]. The only relevant exceptions are [Mn/Fe], [Zn/Fe], and [Eu/Fe]. At [Fe/H] higher than ~ -1.5/-1.3 dex, instead, the chemical pattern of Sgr significantly deviates from that of the Milky Way for almost all the elements analyzed in this study. Some of the abundance patterns reveal a lower contribution by very massive stars exploding as hypernovae (e.g. [Mn/Fe], [Zn/Fe]), a higher contribution by sub-Chandrasekhar progenitors of SNe Ia (e.g. [Ni/Fe]) and a high production efficiency of rapid neutron-capture elements ([Eu/Fe]).\n\n"}}