{"neutrino": {"2304.14020": "2023-04-27, **Lepton flavor physics at $μ^+ μ^+$ colliders**, Kåre Fridell et.al., [2304.14020v1](http://arxiv.org/abs/2304.14020v1)\n\n We discuss sensitivities to lepton flavor violating (and conserving) interactions at future muon colliders, especially at $\\mu^+\\mu^+$ colliders. Compared with the searches for rare decays of $\\mu$ and $\\tau$, we find that the TeV-scale future colliders have better sensitivities depending on the pattern of hierarchy in the flavor mixings. As an example, we study the case with the type-II seesaw model, where the flavor mixing parameters have direct relation to the neutrino mass matrix. At a $\\mu^+ \\mu^+$ collider, the number of events of the $\\mu^+ \\mu^+ \\to \\mu^+ \\tau^+$ process can be larger than $\\mathcal{O}(100)$ with the center of mass energy $\\sqrt s = 2$ TeV, and with an integrated luminosity ${\\cal L} = 1$ ab$^{-1}$, while satisfying bounds from rare decays of $\\mu$ and $\\tau$. We discuss impacts of the overall mass scale of neutrinos as well as CP violating phases to the number of expected events.\n\n", "2304.13665": "2023-04-26, **Asymptotic Analysis on Binned Likelihood and Neutrino Floor**, Jian Tang et.al., [2304.13665v1](http://arxiv.org/abs/2304.13665v1)\n\n Observations of suspected coherent elastic neutrino-nucleus scatterings by dark matter direct detection experiments highlight the need for an investigation into the so-called ``neutrino floor\". We focus on the discovery limit, a statistical concept to identify the neutrino floor, and analyze the asymptotic behaviour of the profile binned likelihood ratio test statistic where the likelihood is constructed by variate from events in each bin and pull terms from neutrino fluxes. To achieve the asymptotic result, we propose two novel methods: i) Asymptotic-Analytic method, which furnishes the analytic result for large statistics, is applicable for more extra nuisance parameters, and enables the identification of the most relevant parameters in the statistical analysis; ii) Quasi-Asimov dataset, which is analogous to Asimov dataset but with improved speed. Applying our methods to the neutrino floor, we significantly accelerate the computation procedure compared to the previous literature, and successfully address cases where Asimov dataset fails. Our derivation on the asymptotic behavior of the test statistic not only facilitates research into the impact of neutrinos on the search for dark matter, but may also prove relevant in similar application scenarios.\n\n", "2304.13546": "2023-04-26, **Linking Resonant leptogenesis with dynamics of the inverse seesaw theory with $ A_{4} $ flavor symmetry**, Maibam Ricky Devi et.al., [2304.13546v1](http://arxiv.org/abs/2304.13546v1)\n\n In this paper, we analyse resonant leptogenesis in a low scale inverse seesaw model with $A\\_4$ flavor symmetry, in a model we explored earlier to explain light neutrino masses and mixings, and also charged lepton flavor violating decay $\\mu\\rightarrow e\\gamma$. Six $ A\\_{4} $ scalar singlets and one $ A\\_{4} $ fermion triplet are included, which are charged under the group $A\\_{4}\\times U(1)\\_{X} \\times Z\\_{5} \\times Z\\_{4} $, with at least two degenerate RH (Right Handed) neutrinos. The light neutrino masses and leptogenesis both share a same origin with the heavy right handed neutrinos. Thus, we expound the possibility of generating resonant leptogenesis in this model at energies as low as 1 TeV. We then analyse our findings to envision if our model inclines more towards weak or strong washout.\n\n", "2304.13491": "2023-04-26, **Neutrino Oscillations by a Manifestly Coherent Mechanism and Massless vs. Massive Neutrinos**, Anca Tureanu et.al., [2304.13491v1](http://arxiv.org/abs/2304.13491v1)\n\n The neutrino oscillations in vacuum are derived in a manifestly coherent scheme. The mechanism is operative in a quantum field theoretical framework, justifying nevertheless a formal analogy with quantum mechanical two- (or more) level systems and their oscillatory behaviour. Both the flavour states and the massive states are eigenstates of certain Hamiltonians which, in special conditions, can be argued to share the same Hilbert space. In this scheme, flavour neutrinos are massless and play the role of asymptotic states for any interactions, including the weak interactions, while massive neutrinos are effective propagation states. The vacuum is interpreted as a medium, where the flavour neutrinos undergo coherent forward scatterings which modify their energy and mix their flavour. The treatment of matter conversion and MSW effect fits in naturally; the extension to other neutral particle oscillations, like $K\\_0-\\bar K\\_0$, is straightforward. The scheme is eclectic insofar as it combines seamlessly quantum field theory and quantum mechanics.\n\n", "2304.13303": "2023-04-26, **Determination of neutrino mass ordering from Supernova neutrinos with T2HK and DUNE**, Papia Panda et.al., [2304.13303v1](http://arxiv.org/abs/2304.13303v1)\n\n In this paper we study the possibility of determining the neutrino mass ordering from the future supernova neutrino events at the DUNE and T2HK detectors. We estimate the expected number of neutrino event rates from a future supernova explosion assuming GKVM flux model corresponding to different processes that are responsible for detecting the supernova neutrinos at these detectors. We present our results in the form of $\\chi^2$, as a function of supernova distance. For a systematic uncertainty of 5\\%, our results show that, the neutrino mass ordering can be determined at $5 ~\\sigma$ C.L. if the supernova explosion occurs at a distance of 44 kpc for T2HK and at a distance of 6.5 kpc for DUNE. Our results also show that the sensitivity of T2HK gets affected by the systematic uncertainties for the smaller supernova distances. Further, we show that in both DUNE and T2HK, the sensitivity gets deteriorated to some extent due to presence of energy smearing of the neutrino events. This occurs because of the reconstruction of the neutrino energy from the energy-momentum measurement of the outgoing leptons at the detector.\n\n"}, "dark matter": {"2304.14171": "2023-04-27, **Quantifying and mitigating the effect of snapshot interval in light-cone Epoch of Reionization 21-cm simulations**, Suman Pramanick et.al., [2304.14171v1](http://arxiv.org/abs/2304.14171v1)\n\n The Epoch of Reionization (EoR) neutral Hydrogen (HI) 21-cm signal evolves significantly along the line-of-sight (LoS) due to the light-cone (LC) effect. It is important to accurately incorporate this in simulations in order to correctly interpret the signal. 21-cm LC simulations are typically produced by stitching together slices from a finite number $(N\\_{\\rm RS})$ of ''reionization snapshot'', each corresponding to a different stage of reionization. In this paper, we have quantified the errors in the 21-cm LC simulation due to the finite value of $N\\_{\\rm RS}$. We show that this can introduce large discontinuities $(> 200 \\%)$ at the stitching boundaries when $N\\_{\\rm RS}$ is small $(= 2,4)$ and the mean neutral fraction jumps by $\\delta \\bar{x}\\_{\\rm HI} = 0.2,0.1$ respectively at the stitching boundaries. This drops to $17 \\%$ for $N\\_{\\rm RS} = 13$ where $\\delta \\bar{x}\\_{\\rm HI}=0.02$. We present and also validate a method for mitigating this error by increasing $N\\_{\\rm RS}$ without a proportional increase in the computational costs which are mainly incurred in generating the dark matter and halo density fields. Our method generates these fields only at a few redshifts, and interpolates them to generate reionization snapshots at closely spaced redshifts. We use this to generate 21-cm LC simulations with $N\\_{\\rm RS} = 26,51,101$ and $201$, and show that the errors go down as $N\\_{\\rm RS}^{-1}$.\n\n", "2304.14129": "2023-04-27, **Detecting Fundamental Vector Fields with LISA**, Shaun David Brocus Fell et.al., [2304.14129v1](http://arxiv.org/abs/2304.14129v1)\n\n The advent of gravitational wave astronomy has seen a huge influx of new predictions for potential discoveries of beyond the Standard Model fields. The coupling of all fundamental fields to gravity, together with its dominance on large scales, makes gravitational physics a rich laboratory to study fundamental physics. This holds especially true for the search for the elusive dark photon, a promising dark matter candidate. The dark photon is predicted to generate instabilities in a rotating black hole spacetime, birthing a macroscopic Bose-Einstein condensate. These condensates can especially form around super massive black holes, modifying the dynamical inspiralling process. This then opens another window to leverage future space-borne gravitational wave antennas to join the hunt for the elusive dark matter particle. This study builds a preliminary model for the gravitational waveform emitted by such a dressed extreme mass-ratio inspiral. Comparing these waveforms to the vacuum scenario allows projections to the potential constrainability on the dark photon mass by space-borne gravitational wave antennas. The superradiant instability of a massive vector field on a Kerr background is calculated and the modification to the dynamics of an inspiralling solar mass-scale compact object is determined with approximations on the backreaction effect of the cloud on the compact object. The end result is the projection that the LISA mission should be able to constrain the dark photon mass using extreme mass ratio inspirals in the range $[1.8 \\times 10^{-17}, 4.47 \\times 10^{-16}]$ eV.\n\n", "2304.14052": "2023-04-27, **The resonant probing spin-0 and spin-2 dark matter mediators with fixed target experiments**, I. V. Voronchikhin et.al., [2304.14052v1](http://arxiv.org/abs/2304.14052v1)\n\n We discuss the mechanism to produce electron-specific dark matter mediators of spin-0 and spin-2 in the electron fixed target experiments such as NA64 and LDMX. The positrons produced by the electromagnetic shower can produce the regarding mediators via annihilation on atomic electrons. That mechanism, for some selected kinematics, results in the enhanced sensitivity with respect to the bounds derived by the bremsstrahlung-like emission of the mediator in the specific parameter space. We derive the regarding experimental reach of the NA64 and LDMX.\n\n", "2304.13890": "2023-04-27, **Massive Dark Matter Halos at High Redshift: Implications for Observations in the JWST Era**, Yangyao Chen et.al., [2304.13890v1](http://arxiv.org/abs/2304.13890v1)\n\n Recent observations made by the JWST have revealed a number of massive galaxies at high redshift ($z$). The presence of these galaxies appears at odds with the current $\\Lambda$CDM cosmology. Here we investigate the possibility of alleviating the tension by incorporating uncertainties from three sources in counting massive galaxies at high $z$: cosmic variance, error in stellar mass estimate, and contribution by backsplash. We find that each of the sources can significantly increase the cumulative stellar mass density $\\rho\\_*(>M\\_*)$ at the high-mass end, and the combination of them can boost the density by more than one order of magnitude. Assuming a star formation efficiency of $\\epsilon\\_* \\sim 0.5$, cosmic variance alone can reduce the tension to $2\\sigma$ level, except the most massive galaxy at $z=8$. Including in addition a lognormal dispersion with a width of 0.3 dex in the stellar mass can bring the observed stellar mass density at $z \\sim 7 - 10$ to the $2\\sigma$ range of the cosmic variance. The tension is completely eliminated when gas stripped from backsplash halos is also taken into account. Our results highlight the importance of fully modeling uncertainties when interpreting observational data of rare objects. We use the constrained simulation, ELUCID, to investigate the descendants of high $z$ massive galaxies. We find that a significant portion of these galaxies end up in massive halos with mass $M\\_{\\rm halo} > 10^{13} h^{-1}M\\_\\odot $ at $z=0$. A large fraction of central galaxies in $M\\_{\\rm halo} \\geqslant 10^{14.5} h^{-1}M\\_\\odot$ halos today are predicted to contain significant amounts of ancient stars formed in massive galaxies at $z\\sim 8$. This prediction can be tested by studying the structure and stellar population of central galaxies in present-day massive clusters.\n\n", "2304.13809": "2023-04-26, **The Influence of Subhaloes on Host Halo Properties**, Lorena Mezini et.al., [2304.13809v1](http://arxiv.org/abs/2304.13809v1)\n\n Within the $\\Lambda$CDM cosmology, dark matter haloes are comprised of both a smooth component and a population of smaller, gravitationally bound subhaloes. These components are often treated as a single halo when halo properties, such as density profiles, are extracted from simulations. Recent work has shown that density profiles change substantially when subhalo mass is excluded. In this paper, we expand on this result by analysing the change in three specific host halo properties -- concentration ($c\\_{\\rm{NFW}}$), spin ($\\lambda\\_{\\rm Bullock}$), and shape ($c/a$), -- when calculated only from the smooth component of the halo. This analysis is performed on both Milky Way-mass haloes and cluster-mass haloes in high-resolution, zoom-in, $N$-body simulations. We find that when subhaloes are excluded the median value of (1) $c\\_{\\rm{NFW}}$ is enhanced by $\\approx 38 \\pm 12\\%$ and $\\approx 88 \\pm 7.7\\%$ for Milky Way mass ($10^{12.1}\\,\\text{M}\\_\\odot$) and cluster mass ($10^{14.8}\\,\\text{M}\\_\\odot$) haloes respectively, (2) $\\lambda\\_{\\rm Bullock}$ is reduced for Milky Way mass by $\\approx 16 \\pm 6.8\\%$ and cluster mass haloes by $\\approx 32 \\pm 8.9\\%$. Additionally, with the removal of subhaloes, cluster mass haloes tend to become more spherical as the ratio of minor-to-major axis, $c/a$, increases by $\\approx 12 \\pm 4\\%$, whereas Milky Way mass haloes remain approximately the same shape with $c/a$ changed by $\\approx 1.2 \\pm 5.6\\%$. The fractional change of each of these properties depends primarily on the amount of mass that is removed from the halo system and, to a lesser extent, mass accretion history. Our findings demonstrate that the properties of the smooth components of dark matter haloes are biased relative to the total mass of the halo including subhaloes.\n\n", "2304.13745": "2023-04-26, **Large-scale clustering of buried X-ray AGN: Trends in AGN obscuration and redshift evolution**, Akke Viitanen et.al., [2304.13745v1](http://arxiv.org/abs/2304.13745v1)\n\n In order to test active galactic nucleus (AGN) unification and evolutionary models, we measured the AGN clustering properties as a function of AGN obscuration defined in terms of hydrogen column density, $N\\_{\\rm H}$. In addition to measuring the clustering of unobscured ($N\\_{\\rm H} < 10^{22}\\,{\\rm cm}^{-2}$) and moderately obscured ($10^{22} \\leq N\\_{\\rm H} < 10^{23.5}$) AGNs, we also targeted highly obscured sources ($N\\_{\\rm H}\\geq 10^{23.5}$) up to redshifts of $z=3$. We have compiled one of the largest samples of X-ray-selected AGNs from a total of eight deep XMM/Chandra surveys. We measured the clustering as a function of both AGN obscuration and redshift using the projected two-point correlation function, $w\\_{\\rm p}(r\\_{\\rm p})$. We modeled the large-scale clustering signal, measured the AGN bias, $b(z, N\\_{\\rm H})$, and interpreted it in terms of the typical AGN host dark matter halo, $M\\_{\\rm halo}(z, N\\_{\\rm H}$). We find no significant dependence of AGN clustering on obscuration, suggesting similar typical masses of the hosting halos as a function of $N\\_{\\rm H}$. This result matches expectations of AGN unification models, in which AGN obscuration depends mainly on the viewing angle of the obscuring torus. We measured, for the first time, the clustering of highly obscured AGNs and find that these objects reside in halos with typical mass $\\log M\\_{\\rm halo} = 12.98\\_{-0.22}^{+0.17} [h^{-1} M\\_\\odot]$ ($12.28\\_{-0.19}^{+0.13}$) at low $z \\sim 0.7$ (high $z \\sim 1.8$) redshifts. We find that irrespective of obscuration, an increase in AGN bias with redshift is slower than the expectation for a constant halo mass and instead follows the growth rate of halos, known as the passive evolution track. This implies that for those AGNs the clustering is mainly driven by the mass growth rate of the hosting halos and galaxies across cosmic time.\n\n", "2304.14258": "2023-04-26, **Rotating Bardeen black hole surrounded by perfect fluid dark matter as a particle accelerator**, Qi-Quan Li et.al., [2304.14258v1](http://arxiv.org/abs/2304.14258v1)\n\n We study the event horizon of a rotating Bardeen black hole surrounded by perfect fluid dark matter and the black hole as a particle accelerator. The black hole is represented by four parameters: mass $M$, rotation parameter $a$, dark matter parameter $\\alpha$ and magnetic charge $g$. It is interesting that when we determine the values of magnetic charge $g$ and dark matter parameters $\\alpha$ we can get a critical rotation parameter $a\\_E$ and then we get a contour plane with $\\Delta$= 0 taking three parameters as coordinates. We also derive the effective potential of the particle and the centre-of-mass (CM) energy of the two particles outside the black hole by using the motion equation of the particle in the equatorial plane of the black hole. We find that the CM energy depends not only on the rotation parameter $a$, but also on the parameters $g$ and $\\alpha$. We discuss the CM energy for two particles colliding at the black hole horizon in the extreme and non-extreme cases, respectively. It is found that the CM energy can be arbitrarily high when the angular momentum of one of the two particles is the critical angular momentum under the background of extreme black holes and there is no such result for non-extreme black holes, because the particles do not reach the black hole horizon when the angular momentum of the particles is critical angular momentum. Therefore, we prove that the rotating Bardeen black hole surrounded by perfect fluid dark matter can be used as a particle accelerator.\n\n", "2304.13585": "2023-04-26, **Merging galaxy clusters in IllustrisTNG**, Ewa L. Lokas et.al., [2304.13585v1](http://arxiv.org/abs/2304.13585v1)\n\n Mergers between galaxy clusters are an important stage in the formation of the large-scale structure of the Universe. Some of the mergers show a spectacular bow shock that formed as a result of recent passage of a smaller cluster through a bigger one, the classic example of this being the so-called bullet cluster. In this paper, I describe ten examples of interacting clusters identified among 200 of the most massive objects, with total masses above $1.4 \\times 10^{14}$ M$\\_{\\odot}$, from the IllustrisTNG300 simulation by searching for prominent bow shocks in their temperature maps. Despite different mass ratios of the two merging clusters, the events are remarkably similar in many respects. In all cases, the companion cluster passed close to the main one only once, between 0.9 and 0.3 Gyr ago, with the pericenter distance of 100-530 kpc and a velocity of up to 3400 km s$^{-1}$. The subcluster, typically an order of magnitude smaller in mass than the main cluster before the interaction, loses most of its dark matter and gas in the process. The displacement between the collisionless part of the remnant and the bow shock is such that the remnant typically lags behind the shock or coincides with it, with a single exception of the merger occurring with the largest velocity. Usually about 1% of the gas cells in the merging clusters are shocked, and the median Mach numbers of these gas cells are around two. Due to the relatively small size of the simulation box, no close analog of the bullet cluster was found, but I identified one case that is similar in terms of mass, velocity, and displacement. The presented cases bear more resemblance to less extreme observed interacting clusters such as A520 and Coma.\n\n", "2304.13576": "2023-04-26, **Stochastic gravitational-wave background at 3G detectors as a smoking gun for microscopic dark matter relics**, G. Franciolini et.al., [2304.13576v1](http://arxiv.org/abs/2304.13576v1)\n\n Microscopic horizonless relics could form in the early universe either directly through gravitational collapse or as stable remnants of the Hawking evaporation of primordial black holes. In both cases they completely or partially evade cosmological constraints arising from Hawking evaporation and in certain mass ranges can explain the entirety of the dark matter. We systematically explore the stochastic gravitational-wave background associated with the formation of microscopic dark-matter relics in various scenarios, adopting an agnostic approach and discussing the limitations introduced by existing constraints, possible ways to circumvent the latter, and expected astrophysical foregrounds. Interestingly, this signal is at most marginally detectable with current interferometers but could be detectable by third-generations instruments such as the Einstein Telescope, strengthening their potential as discovery machines.\n\n", "2304.13361": "2023-04-26, **Quark and lepton model with flavor specific dark matter and muon $g-2$ in modular $A_4$ and hidden $U(1)$ symmetries**, Takaaki Nomura et.al., [2304.13361v1](http://arxiv.org/abs/2304.13361v1)\n\n We propose a quark and lepton model explaining their masses, mixings, and CP violating phases, introducing modular $A\\_4$ and hidden gauged $U(1)$ symmetries. The hidden $U(1)$ brings us heavier Majorana fermions that are requested by chiral anomaly cancellations, and we work on a canonical seesaw scenario due to their neutral particles.In this framework, we search for favorite parameter space to satisfy both the experimental values and show predictions, applying the $\\chi$ square analysis.Then, we discuss a bosonic dark matter candidate that only annihilates into muon state due to the modular $A\\_4$ flavor symmetry where we suppose the main interaction of dark matter to be Yukawa terms. And we study muon anomalous magnetic dipole moment where there are not any constraints of lepton flavor violations thanks to this flavor symmetry. Finally, we show the allowed space to satisfy the observed relic density of dark matter and the muon anomalous magnetic dipole moment.\n\n", "2304.13325": "2023-04-26, **Exploring CP-violation in $Y=0$ inert triplet with real singlet**, Shilpa Jangid et.al., [2304.13325v1](http://arxiv.org/abs/2304.13325v1)\n\n In this article, we examine the Standard Model extended with a $Y=0$ Higgs triplet and a real singlet. We consider the Higgs triplet to be odd under the $Z\\_2$ symmetry, and hence the lightest stable particle from the inert triplet becomes the dark matter candidate, whereas the real singlet is considered to be even under the $Z\\_2$ symmetry. A dimension-5 effective term is introduced with the help of a real singlet, which breaks the CP symmetry and gives an additional source of CP-violation in the fermion sector. The phase transition proceeds in two-steps, with the symmetry breaking in the singlet direction occurring first and later leading to the usual electroweak symmetry breaking minima, while electroweak baryogenesis is associated with the second step. The parameters chosen for the electroweak phase transition are found to be consistent with the Planck scale stability and the perturbativity using two-loop $\\beta$-functions. The DM mass bound for inert triplet, i.e., 1.2 TeV (below which it is under abundance), also comes out to be consistent with the strongly first-order phase transition, which was not possible solely with inert triplet. The upper bound on the triplet mass comes out to be $\\leq 3.8$ TeV, which satisfies the strongly first-order phase transition. This particular benchmark point also satisfies the correct baryon asymmetry of the Universe $(6.13 \\times 10^{-11})$, and the gravitational wave spectrum also lies within the detectable frequency range of LISA $(6.978 \\times 10^{-4} - 1.690 \\times 10^{-2} )$ Hz and BBO $(2.80\\times 10^{-3}-1.096)$ Hz experiments.\n\n", "2304.13243": "2023-04-26, **Direct detection of finite-size dark matter via electron recoil**, Wenyu Wang et.al., [2304.13243v1](http://arxiv.org/abs/2304.13243v1)\n\n In direct dark matter (DM) detection via scattering off the electrons, the momentum transfer plays a crucial role. Previous work showed that for self-interacting DM, if the DM particle has a size (the so-called puffy DM), the radius effect could dominate the momentum transfer and become another source of velocity dependence for self-scattering cross section. In this work we investigate the direct detection of puffy DM particles with different radii through electron recoil. We find that comparing with the available experimental exclusion limits dominated by the mediator effect for XENON10, XENON100 and XENON1T, the constraints on the puffy DM-electron scattering cross-section become much weaker for large radius DM particles. For small-radius DM particles, the constraints remain similar to the point-like DM case.\n\n"}, "supernova": {"2304.14253": "2023-04-27, **The observed number counts in luminosity distance space**, José Fonseca et.al., [2304.14253v1](http://arxiv.org/abs/2304.14253v1)\n\n Next generation surveys will provide us with an unprecedented number of detections of supernovae Type Ia and gravitational wave merger events. Cross-correlations of such objects offer novel and powerful insights into the large-scale distribution of matter in the universe. Both of these sources carry information on their luminosity distance, but remain uninformative about their redshifts; hence their clustering analyses and cross-correlations need to be carried out in luminosity distance space, as opposed to redshift space. In this paper, we calculate the full expression for the number count fluctuation in terms of a perturbation to the observed luminosity distance. We find the expression to differ significantly from the one commonly used in redshift space. Furthermore, we present a comparison of the number count angular power spectra between luminosity distance and redshift spaces. We see a wide divergence between the two at large scales, and we note that lensing is the main contribution to such differences. On such scales and at higher redshifts the difference between the angular power spectra in luminosity distance and redshift spaces can be roughly 50$\\%$. We also investigate cross-correlating different redshift bins using different tracers, i.e. one in luminosity distance space and one in redshift, simulating the cross-correlation angular power spectrum between background gravitational waves/supernovae and foreground galaxies. Finally, we show that in a cosmic variance limited survey, the relativistic corrections to the density-only term ought to be included.\n\n", "2304.13945": "2023-04-27, **Constraints on the Local Cosmic Void from the Pantheon Supernovae Data**, Ke Wang et.al., [2304.13945v1](http://arxiv.org/abs/2304.13945v1)\n\n In principle, the local cosmic void can be simply modeled by the spherically symmetric Lemaitre-Tolman-Bondi (LTB) metric. In practice, the real local cosmic void is probably not spherically symmetric. In this paper, to reconstruct the realistic profile of the local cosmic void, we divide it into several segments. Each segment with certain solid angle is modeled by its own LTB metric. Meanwhile, we divide the 1048 type Ia supernovae (SNIa) of Pantheon into corresponding subsets according to their distribution in the galactic coordinate system. Obviously, each SNIa subset can only be used to reconstruct the profile of one segment. Finally, we can patch together an irregular profile for the local cosmic void with the whole Pantheon sample. But our constraints are too weak to challenge the cosmic homogeneity and the cosmic isotropy.\n\n", "2304.13864": "2023-04-26, **Constraining mass-transfer and common-envelope physics with post-supernova companion monitoring**, Ryosuke Hirai et.al., [2304.13864v1](http://arxiv.org/abs/2304.13864v1)\n\n We present an analytical model that describes the response of companion stars after being impacted by a supernova in a close binary system. This model can be used to constrain the pre-supernova binary properties using photometry of the companion star several years after the explosion in a relatively simple manner. The derived binary parameters are useful in constraining the evolutionary scenario for the progenitors and the physics of binary interactions. We apply our model to the observed photometry of some known stripped-envelope supernova companions (SN1993J, SN2001ig, SN2006jc, SN2011dh, SN2013ge). Combined with other observational constraints such as the pre-supernova progenitor photometry, we find that SN1993J and SN2011dh likely had relatively massive companions on wide orbits, while SN2006jc may have had a relatively low-mass companion on a tight orbit. This trend suggests that type IIb supernova progenitors evolved from stable mass transfer channels and type Ibc progenitors may have formed from common-envelope channels. The constraints on orbital separation helps us probe the highly uncertain common-envelope physics for massive stars, especially with multiple epochs of companion observations.\n\n", "2304.13752": "2023-04-26, **Quasars as high-redshift standard candles**, Guido Risaliti et.al., [2304.13752v1](http://arxiv.org/abs/2304.13752v1)\n\n In the past few years, we built a Hubble diagram of quasars up to redshift z$\\sim$7, based on the nonlinear relation between quasars' x-ray and UV luminosities. Such a Hubble diagram shows a >4$\\sigma$ deviation from the standard flat $\\Lambda$CDM model at z>1.5. Given the important consequences of this result, it is fundamental to rule out any systematic effect in the selection of the sample and/or in the flux measurements, and to investigate possible redshift dependences of the relation, that would invalidate the use of quasars as standard candles. Here we review all the observational results supporting our method: the match of the Hubble diagram of quasars with that of supernovae in the common redshift range, the constant slope of the relation at all redshifts, the redshift non-evolution of the spectral properties of our sources both in the x-rays and in the UV. An independent test of our results requires the observation of other standard candles at high redshift. In particular, we expect that future observations of supernovas at z>2 will confirm the deviation from the concordance model found with the Hubble diagram of quasars.\n\n", "2304.13508": "2023-04-26, **Infrared spectroscopy of the 2022 eruption of the recurrent nova U Sco**, A. Evans et.al., [2304.13508v1](http://arxiv.org/abs/2304.13508v1)\n\n We present near-infrared spectroscopy of the 2022 eruption of the recurrent nova U Sco, over the period from 5.2 to 45.4 days after outburst. This is the most intensive infrared study of this nova. Our observations started early after the outburst and extended almost to the end of the ``Super Soft'' X-ray phase. A major find is the presence of coronal lines from day 9.41, one of the earliest appearances of these in any nova, classical or recurrent. The temperature of the coronal gas is $7\\times10^5$ K. There is also evidence for the presence of much cooler ($\\lesssim2.5\\times10^4$ K) gas. Remarkable changes are seen in the HeI $1.083\\mu$m line, the strength of which declines, then recovers, in anti-correlation with the X-ray behaviour. We conclude that shock ionisation is the dominant excitation mechanism for the coronal line emission. There is evidence in the infrared spectra for the presence of black body emission at $\\sim20000$ K, which we tentatively identify with the irradiated secondary, and for free-free/free-bound emission. For the previously determined binary inclination of $82.7$ degrees, the implied ejection velocities are as high as 22000 km s$^{-1}$. These velocities appear unprecedented in nova outflows, and are comparable to those seen in supernovae, thereby marking U Sco as a truly remarkable object.\n\n"}}