{"neutrino": {"2601.15255": "2026-01-21, **DAMSA Experiment Conceptual Design White Paper**, Prithak Bhattarai et.al., [2601.15255v1](http://arxiv.org/abs/2601.15255v1)\n\n DAMSA (DArk Messenger Searches at an Accelerator) is a novel short-baseline accelerator experiment aimed at probing short-lived physics processes, including searches for evidence of a dark sector of particle physics and well-motivated Standard Model signals. Motivated by open questions in neutrino physics and the absence of conclusive evidence for conventional weakly interacting massive particles, DAMSA targets MeV-to-sub-GeV dark-sector messengers with feeble couplings that can be produced in abundance at the PIP-II LINAC. By employing an ultra-short baseline of order one meter, DAMSA is uniquely positioned to overcome the beam-dump \"ceiling\" that limits sensitivity to promptly decaying particles in longer-baseline experiments. The conceptual design emphasizes a beam-dump production scheme combined with a compact detector optimized for rare decays while mitigating intense neutron-induced backgrounds inherent to high-power proton beams. To validate the experimental strategy and detector technologies, the Little DAMSA Path-Finder (LDPF) proof-of-concept experiment is proposed, focusing on axion-like particles decaying to two photons and operating with 300 MeV electron beams at FAST. Successful realization of LDPF will establish the feasibility of the DAMSA approach, enabling a broad and powerful program to explore short-lived new physics and precision Standard Model processes in a previously inaccessible regime. This conceptual design document outlines the technical details of DAMSA's physics goals, the beam facility proposals, key experimental challenges and how to overcome them, and the proposed experimental staging campaigns.\n\n", "2601.14851": "2026-01-21, **Testing the three massive neutrino paradigm: Constraints on Neutrino Properties and Interactions from Recent Experimental Data**, João Paulo Pinheiro et.al., [2601.14851v1](http://arxiv.org/abs/2601.14851v1)\n\n Neutrino physics offers unique insights into phenomena beyond the Standard Model (BSM). This thesis presents phenomenological investigations organized around three pillars: consolidation of the three-flavor oscillation paradigm, exploration of new physics viability, and precise determination of solar neutrino fluxes.   The theoretical framework introduces massive neutrinos, leptonic mixing, and flavor transitions, followed by experimental results emphasizing Borexino and NOvA data analyses.   The first pillar establishes the three-flavor framework through global analysis of solar, atmospheric, reactor, and accelerator data, providing updated determinations of mixing angles ($θ\\_{12}$, $θ\\_{13}$, $θ\\_{23}$) and mass-squared differences ($Δm^2\\_{21}$, $Δm^2\\_{31}$), while quantifying ambiguities in mass ordering and $θ\\_{23}$ octant.   The second pillar investigates Non-Standard Interactions (NSI) with electrons and quarks, combining Borexino data with COHERENT's CE$ν$NS measurements to establish bounds on propagation and detection couplings, excluding viable NSI parameter regions including potential LMA-D solutions.   The third pillar advances solar neutrino physics through precision flux determinations, integrating pp-chain and CNO-cycle measurements. Results show preference for high-metallicity Standard Solar Models and incompatibility between $3+1$ mixing parameters favored by Gallium experiments and solar observations.   This synthesis guides future experiments toward resolving mass ordering, CP violation, and dark sector interactions.\n\n", "2601.14831": "2026-01-21, **Benchmarking neutrino-nucleus quasielastic scattering model predictions against a missing energy profile obtained using a monoenergetic neutrino beam**, Jake McKean et.al., [2601.14831v1](http://arxiv.org/abs/2601.14831v1)\n\n We examine three exclusive nuclear ground state shell models implemented in the NEUT neutrino event generator and benchmark them against the recent JSNS$^2$ measurement of missing energy using a monoenergetic neutrino source. The nature of the measurement allows a detailed investigation of nuclear ground-state modeling using a neutrino source, and gives access to a direct measurement of the neutron spectral function in a $^{12}$C nucleus. The NEUT intranuclear cascade and nuclear deexcitation \\textsc{NucDeEx} are used to simulate inelastic final-state interactions and nuclear deexcitations respectively. We find that the spectral function (SF) models perform better than relativistic mean field models in modeling both the ground state and the tail of the missing energy distribution when the NEUT cascade and nuclear excitation channels are turned on. We also find that taking into account the missing energy threshold for single nucleon knockout interactions results in all nuclear models being accepted based on the obtained $p$-values.\n\n", "2601.14497": "2026-01-20, **The failed failed-supernova scenario of M31-2014-DS1**, Noam Soker et.al., [2601.14497v1](http://arxiv.org/abs/2601.14497v1)\n\n I examine a recently proposed failed-supernova scenario for the fading of the yellow supergiant event M31-2014-DS1, and find that it requires unlikely fine-tuned parameters to work, if at all. In the failed-supernova scenario, most of the yellow supergiant collapsed to form a black hole. Due to the energy carried by neutrinos from the cooling, collapsing core, gravity decreases, leading to the ejection of a small fraction of the outer envelope, some of which remains bound. The fallback accreted gas possesses large angular-momentum fluctuations due to the pre-collapse envelope convection. The fallback material forms intermittent accretion disks around the black hole that launch jets (or disk wind), which unbind most of the bound material. The failed-supernova scenario for M31-2014-DS1 requires that only <1% of the bound material be accreted by the black hole, but the jets do not shut down the backflow for over 10 years. I find this fine-tuned requirement unlikely. I also find that, due to the rapid radiative cooling of the outflow interaction zone with the outer gas, the expected radiation is about an order of magnitude or more above the observed value. These, as well as earlier challenges raised against the failed-supernova scenario, make the alternative type II intermediate-luminosity optical transient scenario, in which fading is due to dust ejection in a violent binary interaction, more likely. The fading event M31-2014-DS1 does not support the failed-supernova scenario predicted by the neutrino-driven explosion mechanism of core-collapse supernovae.\n\n", "2601.14450": "2026-01-20, **Neutrino production mechanisms in strongly magnetized quark matter: Current status and open questions**, Igor A. Shovkovy et.al., [2601.14450v1](http://arxiv.org/abs/2601.14450v1)\n\n We review the main neutrino emission mechanisms operating in dense quark matter under strong magnetic fields, with particular emphasis on conditions expected in the interiors of compact stars. We discuss the direct Urca and neutrino synchrotron processes in unpaired quark matter, incorporating the effects of Landau-level quantization. For the direct Urca process, the quantization of the electron energy spectrum plays a critical role, whereas quark quantization can often be neglected at sufficiently high baryon densities. The resulting field-dependent neutrino emissivity is anisotropic and exhibits an oscillatory behavior as a function of magnetic-field strength. We explore the implications of these effects for magnetar cooling and for possible anisotropic neutrino emission that could contribute to pulsar kicks. In addition, we review the $ν\\barν$ synchrotron emission process, which, although subdominant, provides valuable insights into the interplay between magnetic fields and weak interactions in dense quark matter. Overall, our analysis highlights the nontrivial influence of strong magnetic fields on neutrino production in magnetized quark cores, with potential consequences for the thermal and dynamical evolution of compact stars.\n\n", "2601.14394": "2026-01-20, **Gravitational Waves in an A4 Neutrino Mass Model**, Mu-Chun Chen et.al., [2601.14394v1](http://arxiv.org/abs/2601.14394v1)\n\n The A4 flavor symmetry has provided tremendous insight into the flavor structure of the lepton sector of the Standard Model, predicting a very good approximation to neutrino mixing angles, Tri-Bimaximal Mixing. A4 is spontaneously broken by a scalar called the flavon, and when this happens a number of degenerate vacua can form, resulting in so-called domain walls. These objects are not observed and hence need to be annihilated. This is usually done by explicitly breaking A4 by adding a bias term to the scalar potential. In this paper, we construct a new model invariant under A4 and Z4, which creates cosmologically viable domain walls, lifts the degeneracy of the vacuum giving a natural mechanism for domain walls to annihilate, as well as predicts realistic neutrino mixing angles; all utilizing cross couplings between flavons. The annihilation of the domain walls, with proper choice of wall tension and the consequent bias term, leads to a gravitational wave signal that is potentially detectable in near future gravitational wave experiments, and interestingly intersects with the observed Pulsar Timing Array signal.\n\n", "2601.14388": "2026-01-20, **Neutron star cooling implications and magnetic field of the Vela Junior central compact object from all XMM-Newton and Chandra spectra**, Wynn C. G. Ho et.al., [2601.14388v1](http://arxiv.org/abs/2601.14388v1)\n\n The central compact object (CCO) in the Vela Junior supernova remnant is a young neutron star whose relatively low X-ray flux and small distance suggest it has a mass high enough to activate fast neutrino cooling processes. Here we analyse all XMM-Newton MOS and pn and Chandra ACIS-S spectra of the Vela Junior CCO, with observations taking place over the 9 years from 2001 to 2010. We find that the best-fit flux and spectral model parameters do not vary significantly when treating each observation independently, and therefore we fit all the spectra simultaneously using various spectral models to characterize the predominantly thermal emission from the neutron star surface. Our results indicate the Vela Junior CCO has an atmosphere composed of hydrogen, a hot spot temperature (unredshifted) of 3.5x10^6 K, and a colder surface temperature of (6.6-8.8)x10^5 K. Possible absorption lines at ~0.6 keV and 0.9 keV provide evidence for the first-time of an average surface magnetic field B~3x10^10 G for this CCO, which is similar to the magnetic field of other CCOs. At the accurate new Vela Junior distance of 1.4 kpc, the observed luminosity that is dominated by the hot spot is ~5x10^32 erg s^-1. The luminosity from the rest of the colder surface is (1.3-4.0)x10^32 erg s^-1. The cool luminosity and temperature imply the Vela Junior CCO is indeed colder than many other young neutron stars and probably has a high mass that triggered fast neutrino cooling.\n\n", "2601.14386": "2026-01-20, **Emergent Large Lepton Mixing from Neutrino Refraction in Dark Matter**, Susobhan Chattopadhyay et.al., [2601.14386v1](http://arxiv.org/abs/2601.14386v1)\n\n We propose a novel origin for the disparity between quark and lepton flavor mixing based on the refractive nature of neutrino masses. We postulate that the fundamental mixing in both the quark and lepton sectors is CKM-like, together with tiny vacuum neutrino masses, while the observed PMNS mixing matrix emerges dynamically from coherent forward scattering of neutrinos on an ultralight dark matter background. The resulting in-medium Hamiltonian rotates CKM mixing angles into large effective lepton mixings, naturally realizing quark--lepton complementarity without invoking new flavor symmetries. This framework links neutrino mass generation, flavor mixing, and dark matter, and predicts environment-dependent neutrino oscillation effects testable in current and future experiments.\n\n", "2601.14376": "2026-01-20, **Neutrino Masses with Enhanced $B-L$ Symmetry**, Xiyuan Gao et.al., [2601.14376v1](http://arxiv.org/abs/2601.14376v1)\n\n Assuming all three known neutrinos are Dirac fermions, $U(1)\\_{B-L}$ can be an exact symmetry. We show that, if the condition of charge quantization is relaxed, the anomaly-free $B-L$ charges of two out of three right-handed neutrinos can be enhanced by arbitrarily large factors, while all other fermions retain their canonical charges. We call this setup as `enhanced $B-L$ symmetry' and promote it to be local. As long as this enhanced $B-L$ gauge symmetry remains unbroken, neutrinos stay chiral and massless at low energies. Nonzero neutrino masses then require sub-eV-scale symmetry breaking order parameters, which we associate with gravity-induced neutrino condensate. If the enhancement is large and the $B-L$ gauge boson $A'$ is lighter than the heaviest neutrino, then the neutrino decay into $A'$ directly constrains the gauge coupling, which can be significantly stronger than the baryon-based fifth-force tests. Through kinetic mixing with the photon, $A'$ can also mediate neutrino-electron and coherent neutrino-nucleus scatterings, leading to possible signatures in neutrino observatories and dark matter detectors.\n\n", "2601.14102": "2026-01-20, **Measurement of the Z$γ$ production cross section and search for anomalous neutral triple gauge couplings in pp collisions at $\\sqrt{s}$ = 13 TeV**, CMS Collaboration et.al., [2601.14102v1](http://arxiv.org/abs/2601.14102v1)\n\n A measurement of the fiducial cross section of the associated production of a Z boson and a high-$p\\_\\mathrm{T}$ photon, where the Z decays to two neutrinos, and a search for anomalous triple gauge couplings are reported. The results are based on data collected by the CMS experiment at the LHC in proton-proton collisions at $\\sqrt{s}$ = 13 TeV during 2016$-$2018, corresponding to an integrated luminosity of 138 fb$^{-1}$. The fiducial Z$γ$ cross section, where a photon with a $p\\_\\mathrm{T}$ greater than 225 GeV is produced in association with a Z, and the Z decays to a $ν\\barν$ pair (Z($ν\\barν$)$γ$), is measured to be 23.3$^{+1.4}\\_{-1.3}$ fb, in agreement, within uncertainties, with the standard model prediction. The differential cross section as a function of the photon $p\\_\\mathrm{T}$ has been measured and compared with standard model predictions computed at next-to-leading and at next-to-next-to-leading order in perturbative quantum chromodynamics. Constraints have been placed on the presence of anomalous couplings that affect the ZZ$γ$ and Z$γγ$ vertex using the $p\\_\\mathrm{T}$ spectrum of the photons. The observed 95% confidence level intervals for $CP$-conserving $h\\_3^γ$ and $h\\_4^γ$ are determined to be ($-$3.4, 3.5) $\\times$ 10$^{-4}$ and ($-$6.8, 6.8) $\\times$ 10$^{-7}$, and for $h\\_3^\\mathrm{Z}$ and $h\\_4^\\mathrm{Z}$ they are ($-$2.2, 2.2) $\\times$ 10$^{-4}$ and ($-$4.1, 4.2) $\\times$ 10$^{-7}$, respectively. These are the strictest limits to date on $h\\_3^γ$, $h\\_3^\\mathrm{Z}$ and $h\\_4^\\mathrm{Z}$.\n\n", "2601.13949": "2026-01-20, **Mineral Detection of Cosmic-Ray Boosted Dark Matter**, Jin-Wei Wang et.al., [2601.13949v1](http://arxiv.org/abs/2601.13949v1)\n\n We present the first dedicated analysis of cosmic-ray dark matter (CRDM) in paleo detectors. Owing to their large kinetic energies, CRDM particles generate nuclear-recoil tracks that extend to substantially larger lengths than those produced by dominant backgrounds from neutrinos and intrinsic radioactivity. Combined with the ultra-large effective geological exposure of $\\mathcal{O}(10^{5})~\\mathrm{t\\,yr}$, paleo detectors provide a uniquely sensitive probe of sub-GeV DM. Considering both constant and vector-mediator interactions, we find that paleo detectors improve the sensitivity to the DM--proton scattering cross section by one to two orders of magnitude compared with the latest XENONnT limits.\n\n"}, "dark matter": {"2601.15066": "2026-01-21, **Combined constraints on dark photons from high-energy collisions, cosmology, and astrophysics**, A. W. Romero Jorge et.al., [2601.15066v1](http://arxiv.org/abs/2601.15066v1)\n\n We investigate a dark sector coupled to the Standard Model (SM) through a kinetically mixed dark photon $U$ associated with a new $U(1)'$ gauge symmetry. Kinetic mixing $\\varepsilon$ induces an effective coupling to the electromagnetic current, while $U$ interacts with stable dark matter (DM) $χ$ via a dark gauge coupling $g\\_χ$. Our analysis is based on the parton-hadron-string dynamics (PHSD) transport approach, extended to include dark photon production and decay into dileptons ($U\\!\\to e^+e^-$). In PHSD, dark photons are produced in high-energy collisions through Dalitz decays of light mesons ($π^0,η,η',ω$), Delta-resonances ($Δ\\!\\to N U$), direct vector meson decays ($ρ,ω,φ\\!\\to U$), kaon decays, and $q\\bar q\\!\\to U$ annihilation. Building on previous PHSD benchmarks against dilepton data, we extract upper limits on $\\varepsilon^2(m\\_U,m\\_χ,α\\_χ)$ in both the visible regime ($m\\_U<2m\\_χ$), where $U\\!\\to e^+e^-$ dominates, and the invisible regime ($m\\_U>2m\\_χ$), where $U\\!\\toχ\\barχ$ is kinematically open. Cosmological and astrophysical constraints are incorporated in two complementary ways. First, we compute the velocity-dependent self-interaction cross section $σ/m\\_χ$ for Yukawa-mediated SIDM and confront it with bounds from dwarf galaxies, galaxy groups, and clusters. Second, we determine thermal relic target curves by computing the relic abundance and requiring $Ω\\_{\\rm DM}h^2\\simeq 0.12$, consistent with \\textit{Planck} measurements of the cosmic microwave background. Combining PHSD limits on $\\varepsilon^2$ with relic density and self-interaction requirements, we exclude regions of the $(m\\_χ,m\\_U)$ plane for each DM realization (Dirac, Majorana, or complex scalar) and identify benchmark scenarios in which heavy-ion, cosmological, and astrophysical constraints are simultaneously satisfied.\n\n", "2601.15027": "2026-01-21, **Construction of mirror pairs Calabi-Yau orbifolds of the Berglund-Hubsch type**, Sergei Aleshin et.al., [2601.15027v1](http://arxiv.org/abs/2601.15027v1)\n\n In this paper we have developed general algorithm for finding all orbifolds of Berglund-Hubsch-type Calabi-Yau manifolds and their mirrors. An explicit construction is formulated for finding all admissible deformations and groups defining mirror pairs of orbifolds. Then using our algorithm for one of the Calabi-Yau manifolds, defined by a Fermat-type polynomial, we found all mirror pairs of orbifolds. For this model, for each pair of orbifolds, the number of generations and the number of singlets i.e. particles participating only in gravitational interactions (dark matter particles) were found.\n\n", "2601.14661": "2026-01-21, **Constraints on Axion-Like Particles from Ultra-High-Energy Observations of 3HWC J1908+063 with HAWC**, R. Alfaro et.al., [2601.14661v1](http://arxiv.org/abs/2601.14661v1)\n\n Axion-like particles (ALPs) are hypothetical particles and compelling candidates for cold dark matter. Their existence could be probed through their conversions into photons in the presence of magnetic fields. In this work, we explore the effect of these photon-ALP conversions by searching for an attenuation in the observed gamma ray spectra of galactic sources that emit at energies of hundreds of TeV. We analyze data from the High-Altitude Water Cherenkov (HAWC) Observatory for the source 3HWC J1908+063. No evidence of photon-ALP conversions was found, and we set constraints on the ALP parameter space. Specifically, we derive exclusion limits for ALPs with masses in the range $10^{-8}~\\mathrm{eV} \\leq m\\_a \\leq 10^{-6}~\\mathrm{eV}$ and photon-ALP couplings in the range $10^{-12}~\\mathrm{GeV}^{-1} \\leq g\\_{aγ} \\leq 10^{-10}~\\mathrm{GeV}^{-1}$, based on HAWC observations.\n\n", "2601.14420": "2026-01-20, **The Role of Inner Halo Angular Momentum (Spin) in Shaping Dark Matter Bars in Milky Way Analogs**, Shouvik Ghosh et.al., [2601.14420v1](http://arxiv.org/abs/2601.14420v1)\n\n Studies of galactic bars have primarily focused on stellar bars, since they can be directly observed through ultraviolet to infrared wavebands. Cosmological as well as idealised simulations reveal that the dark matter (DM) haloes interact with baryonic matter, primarily the stellar bars, dynamically by means of the exchange of angular momentum. In these simulations, the spherical DM halo dynamically responds to interaction with the stellar bar by reshaping its orbital structure in the proximity of the stellar bar, forming a bar-like configuration, called as the Dark Matter (DM) bar. Using N-body simulations of Milky Way analogs we discuss the role of inner halo angular momentum, measured as halo spin parameter λ of the dark matter halo, on formation and evolutionary characteristics of the DM bars. Our systematic study involves haloes with initial spin configurations ranging from λ = 0 to 0.1. The result conveys that DM bar formation and its characteristics are extensively dependent on the initial spin parameter λ of the DM halo. We demonstrate that the strength of the dark matter bar gradually increases with an increase in halo spin in long-term evolution, with a significant impact of stellar bar buckling on dark matter bar strength. The evolutionary characteristics of the DM bar are strongly influenced by the initial spin of the host halo.\n\n", "2601.14377": "2026-01-20, **Cosmo-FOLD: Fast generation and upscaling of field-level cosmological maps with overlap latent diffusion**, Satvik Mishra et.al., [2601.14377v1](http://arxiv.org/abs/2601.14377v1)\n\n We demonstrate the capabilities of probabilistic diffusion models to reduce dramatically the computational cost of expensive hydrodynamical simulations to study the relationship between observable baryonic cosmological probes and dark matter at field level and well into the non-linear regime. We introduce a novel technique, Cosmo-FOLD (Cosmological Fields via Overlap Latent Diffusion) to rapidly generate accurate and arbitrarily large cosmological and astrophysical 3-dimensional fields, conditioned on a given input field. We are able to generate TNG300-2 dark matter density and gas temperature fields from a model trained only on ~1% of the volume (a process we refer to as `upscaling'), reproducing both large scale coherent dark matter filaments and power spectra to within 10% for wavenumbers k <= 5 h Mpc^-1. These results are obtained within a small fraction of the original simulation cost and produced on a single GPU. Beyond one and two points statistics, the bispectrum is also faithfully reproduced through the inclusion of positional encodings. Finally, we demonstrate Cosmo-FOLD's generalisation capabilities by upscaling a CAMELS volume of 25 (Mpc h^-1)^3 to a full TNG300-2 volume of 205 (Mpc h^-1)^3$ with no fine-tuning. Cosmo-FOLD opens the door to full field-level simulation-based inference on cosmological scale.\n\n", "2601.14370": "2026-01-20, **Hunting the first Cosmic Giants: formation and detectability of Direct Collapse Black Holes around high-redshift quasars**, Alessandro Trinca et.al., [2601.14370v1](http://arxiv.org/abs/2601.14370v1)\n\n The rapid emergence of supermassive black holes (SMBHs) in the early Universe poses a challenge to current models of black hole growth. One promising formation pathway is the direct collapse black hole (DCBH) scenario, in which gas in pristine, low-metallicity halos forms supermassive (or quasi-) stars leading to massive black holes seeds under specific environmental conditions. In this work, we investigate the potential host environments of DCBHs by coupling a semi-analytic model tracing BH formation and galaxy co-evolution with high-resolution N-body dark matter merger trees. This allows us to trace the population of DCBHs formed during the hierarchical assembly of a $\\sim 10^{12} ~\\rm M\\_\\odot$ dark matter halo hosting a bright $10^9 ~\\rm M\\_\\odot$ quasar at redshift $z \\approx 7$. We find that, when accounting for local fluctuations in the UV radiation field within this early cosmic structure, massive BH seeds can form via direct collapse as early as $z \\approx 22$. Even under more stringent conditions for heavy seed formation, tens of DCBHs are predicted to emerge within the simulated overdensity down to $z \\sim 14$, at which point metal enrichment of the intergalactic medium inhibits further episodes of direct collapse. A significant fraction of the massive black hole population formed at $z > 14$ is expected to survive in satellite galaxies that do not merge with the central halo down to $z \\approx 7$. We show that the existence of such a population of ungrown heavy BH seeds can be probed through deep JWST observations targeting regions surrounding bright high-redshift quasars, and we discuss tailored observational strategies to detect and identify these elusive systems.\n\n", "2601.14366": "2026-01-20, **Gravitational Waves and Primordial Black Holes produced by Dark Meta Stable Vacuum Decay**, Haipeng An et.al., [2601.14366v1](http://arxiv.org/abs/2601.14366v1)\n\n Inspired by string theory and cosmological constant problem, it is plausible that the Universe's vacuum structure is characterized by a landscape of metastable vacua. The existence of dark matter and dark energy further suggests that the dark sector may inhabit its own \"dark landscape\". If the dark vacuum is metastable, bubbles of lower-energy phases can nucleate at an approximately constant rate. Because the Hubble expansion rate is monotonically non-increasing with cosmic time, such nucleation can eventually lead to percolation and completion of a dark-sector phase transition. In this work, we investigate the phenomenological consequences of this transition, focusing on the resulting stochastic gravitational-wave background and the potential formation of primordial black holes. We find that the gravitational wave spectrum peaks at $k\\_{\\mathrm{peak}}=3.1 H\\_{\\mathrm{PT}}$, with an amplitude $Ω\\_{\\mathrm{GW}}^{\\mathrm{peak}}\\simeq1.5 Ω\\_γ(Δρ/ρ\\_{\\mathrm{tot}})^2$. Furthermore, the formation of primordial black holes is suppressed due to $ΔN\\_{\\mathrm{eff}}$ constraint.\n\n", "2601.14239": "2026-01-20, **Peculiar velocity fields from analytic solutions of General Relativity**, Roberto A. Sussman et.al., [2601.14239v1](http://arxiv.org/abs/2601.14239v1)\n\n Peculiar velocities are analyzed through cosmological perturbations in the Newtonian longitudinal gauge characterized by irrotational shear-free congruences in an Eulerian frame. We show that non-trivial peculiar velocity fields can be generated through Lorentzian boosts in the non-relativistic limit, where the Eulerian frame is obtained from analytic solutions of Einstein's equations sourced by an irrotational shear-free fluid with nonzero energy flux. This approach provides a physically viable interpretation of these analytic solutions, which (in general) admit no isometries, thus allowing, in principle, for modeling time and space varying 3-dimensional fields of peculiar velocities that can be contrasted with observational data on our local cosmography. As a ``proof of concept'' we examine the peculiar velocities of varying dark matter and dark energy perfect fluids with respect to the CMB frame using a simple, spherically symmetric particular solution. The resulting peculiar velocities are qualitatively compatible with observational data on the CMB dipole.\n\n", "2601.14235": "2026-01-20, **Opportunities in AI/ML for the Rubin LSST Dark Energy Science Collaboration**, LSST Dark Energy Science Collaboration et.al., [2601.14235v1](http://arxiv.org/abs/2601.14235v1)\n\n The Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) will produce unprecedented volumes of heterogeneous astronomical data (images, catalogs, and alerts) that challenge traditional analysis pipelines. The LSST Dark Energy Science Collaboration (DESC) aims to derive robust constraints on dark energy and dark matter from these data, requiring methods that are statistically powerful, scalable, and operationally reliable. Artificial intelligence and machine learning (AI/ML) are already embedded across DESC science workflows, from photometric redshifts and transient classification to weak lensing inference and cosmological simulations. Yet their utility for precision cosmology hinges on trustworthy uncertainty quantification, robustness to covariate shift and model misspecification, and reproducible integration within scientific pipelines. This white paper surveys the current landscape of AI/ML across DESC's primary cosmological probes and cross-cutting analyses, revealing that the same core methodologies and fundamental challenges recur across disparate science cases. Since progress on these cross-cutting challenges would benefit multiple probes simultaneously, we identify key methodological research priorities, including Bayesian inference at scale, physics-informed methods, validation frameworks, and active learning for discovery. With an eye on emerging techniques, we also explore the potential of the latest foundation model methodologies and LLM-driven agentic AI systems to reshape DESC workflows, provided their deployment is coupled with rigorous evaluation and governance. Finally, we discuss critical software, computing, data infrastructure, and human capital requirements for the successful deployment of these new methodologies, and consider associated risks and opportunities for broader coordination with external actors.\n\n", "2601.14048": "2026-01-20, **A systematic study of lepton flavor violating dark matter interactions via indirect detection in effective field theories**, Sahabub Jahedi et.al., [2601.14048v1](http://arxiv.org/abs/2601.14048v1)\n\n Lepton flavor violating (LFV) interactions involving dark matter (DM) particles remain a largely unexplored area. In this study, we systematically investigate LFV DM interactions within the framework of effective field theories by analyzing astrophysical photons and positrons produced from DM annihilation. Employing the astrophysical photon and positron data collected by Fermi-LAT, INTEGRAL, XMM-Newton, and AMS-02, we place meaningful constraints on all leading-order effective operators involving a DM pair and a flavor violating charged lepton pair. Our analysis covers the three well-known DM candidates: a scalar, a fermion, and a vector particle. For the photon flux, we consider contributions from final-state radiation, radiative decay, and inverse Compton scattering, and examine their respective sensitivity regions across different DM masses and photon energies. We find that for DM masses below $\\mathcal{O}(20\\,\\rm GeV)$, INTEGRAL provides the most stringent constraints on annihilation cross sections and effective operators in all three LFV channels, whereas AMS-02 offers the strongest constraints above $\\mathcal{O}(20\\,\\rm GeV)$.\n\n", "2601.13868": "2026-01-20, **The Characteristic Mass and Energy Conversion Efficiency in the Cusp-Core Transition of Dark Matter Haloes: Implications for Scaling Relations and Supernova feedbacks**, Michi Shinozaki et.al., [2601.13868v1](http://arxiv.org/abs/2601.13868v1)\n\n Galaxies in the nearby Universe, particularly dwarf systems, exhibit inner mass profiles of dark matter haloes that systematically depart from canonical cold dark matter expectations, signalling an interplay between baryonic feedback and the collisionless halo. We update an analytical cusp-core transition model by incorporating the effect of supernova-driven mass loss. Adapting this model to SPARC galaxies, we measure the energy conversion efficiency epsilon, defined as the fraction of supernova feedback energy that is used to change the central dark-matter potential. We find epsilon ~ 0.01 for nearby SPARC galaxies. Building on these measurements, we compare the dynamical energy required for a cusp-core transformation with the feedback energy available over burst cycles and identify a cusp-core transition forbidden region on the halo-stellar mass plane where transformation cannot occur. Galaxies with halo masses from 10^8 to 10^11 M\\_sun lie outside the forbidden region, whereas ultra-faint dwarf galaxies < 10^8 M\\_sun, galaxy groups and clusters > 10^11 M\\_sun fall within it, consistent with their high central densities and the inefficiency of core formation at very low and very high masses. This approach also explains the observed diversity of inner density profiles in low-mass systems, showing that both the star formation rate and the energy conversion efficiency govern them, with the latter emerging as a key parameter setting the strength of the cusp-core transition. Beyond the cusp-core problem, our observationally inferred energy conversion efficiency provides a model independent benchmark that strongly constrains galaxy formation models.\n\n", "2601.13766": "2026-01-20, **Projected sensitivity to light WIMP-like particles of the BULLKID-DM experiment**, Matteo Folcarelli et.al., [2601.13766v1](http://arxiv.org/abs/2601.13766v1)\n\n BULLKID-DM is an experiment designed for the direct searches of particle dark matter candidates with mass around 1 GeV, or below, and cross-section with nucleons smaller than $10^{-40}$ cm$^2$. The detector consists of a stack of diced silicon wafers, acting as arrays of particle absorbers, sensed by multiplexed Kinetic Inductance Detectors. The target will amount to 800 g subdivided in more than 2000 silicon dice, with the aim of controlling the background from natural radioactivity by creating a fully active structure and by applying fiducialization techniques. In this work we present the projected sensitivity of BULLKID-DM to light WIMP-like particles considering also the other future experiments in the field.\n\n", "2601.13765": "2026-01-20, **SIRIUS: Dark matter cusp evolution in dense dwarf galaxies**, Katsuhiro Kaneko et.al., [2601.13765v1](http://arxiv.org/abs/2601.13765v1)\n\n Dwarf galaxies have a wide variety of structures, such as dark matter (DM) distribution, stellar-to-halo mass ratio, and stellar density. Recent high-resolution simulations have shown a variety of stellar-to-halo mass ratios for dwarf galaxies with a DM halo mass of $\\sim 10^9 M\\_{\\odot}$ at $z=0$. In this study, we performed cosmological $N$-body/smoothed-particle hydrodynamic zoom-in simulations of dwarf galaxies with the highest gas and DM particle mass resolutions of 2.37 $M\\_{\\odot}$ and 12.8 $M\\_{\\odot}$, respectively. The stellar-to-DM halo mass ratio of one of our simulated dwarf galaxies was $\\sim 10^{-4}$, typical for satellites of the Milky Way. The stellar mass ($10^5 M\\_{\\odot}$) and half-mass radius (68 pc) were also similar to those of the satellites of the Milky Way. The power-law slope of the DM halo was $α= -1.1$. On the other hand, the other simulated galaxy exhibited a stellar-to-halo mass ratio of $\\sim 10^{-3}$ and a steeper power-law slope ($α=-1.9$) than the other; the presence of baryonic matter deepened the cusp. The mass of $>10^6 M\\_{\\odot}$ and a half-mass radius of $\\sim 36$ pc of this galaxy were similar to those of ultra-compact dwarf galaxies rather than the satellites of the Milky Way. This DM halo grew in mass earlier than the former one, and the central DM density was higher than that of the other even in the DM-only simulations.\n\n", "2601.13621": "2026-01-20, **Cosmological Budget of Entropy from Merging Black Holes**, Siyuan Chen et.al., [2601.13621v1](http://arxiv.org/abs/2601.13621v1)\n\n Black holes contain more entropy than any other component of the observable universe. Gravitational-wave observations from LIGO and Virgo have shown evidence of a previously unknown black hole mass range, which provides new information to update the entropy budget. Increases in entropy due to binary black hole mergers, as implied in the second law of thermodynamics, should also be added to the budget. In this study, we update the cosmological entropy budget for black holes in the stellar to lite-intermediate-mass range $(5-300~M\\_\\odot)$, originating from either supernovae or binary mergers, by utilizing a suite of population synthesis models and phenomenological fits derived from numerical relativity. We report three new insights: Firstly, the cumulative entropy from merging black holes surpasses the total entropy from cosmic microwave background photons around the onset of the Over-massive Black Hole Galaxy phase at $z\\sim 12$, suggesting that mergers played a more significant role in shaping the thermodynamic state of the early universe than relic radiation. Secondly, if primordial black holes constitute a nonzero fraction of dark matter, their early binary mergers establish an ``entropy floor\" in the Dark Ages and can dominate the cumulative merger-generated entropy history even for small abundances. Thirdly, by computing the cosmological density parameters, we highlight the thermodynamic asymmetry in black hole mergers, where the production of gravitational-wave energy is inefficient compared to the immense generation of Bekenstein-Hawking entropy.\n\n", "2601.13538": "2026-01-20, **MIU2Net: weak-lensing mass inversion using deep learning with nested U-structures**, Han W. G. et.al., [2601.13538v1](http://arxiv.org/abs/2601.13538v1)\n\n One of the primary goals of next-generation gravitational lensing surveys is to measure the large-scale distribution of dark matter, which requires accurate mass inversion to convert weak-lensing shear maps into convergence (kappa) fields. This work develops a mass inversion method tailored for upcoming space missions such as CSST and Euclid, aiming to recover both the mass distribution and the convergence power spectrum with high fidelity. We introduce MIU2Net, a versatile deep-learning framework for kappa-map reconstruction based on the U2-Net architecture. A new loss function is constructed to jointly estimate the convergence field and its frequency-domain energy distribution, effectively balancing optimal mean squared error and optimal power-spectrum recovery. The method incorporates realistic observational effects into shear fields, including shape noise, reduced shear, and complex masks. Under noise levels anticipated for future space-based lensing surveys, MIU2Net recovers the convergence power spectrum with 4% uncertainties up to l approximately 500, significantly outperforming Wiener filtering and MCALens. Beyond two-point statistics, the method accurately reconstructs the convergence distribution, peak centroid, and peak amplitude. Compared to other learning-based approaches such as DeepMass, MIU2Net reduces the root-mean-square error by 5% without smoothing and by 38% with a 1-arcmin smoothing scale. MIU2Net represents a substantial advancement in mass inversion methodology, offering improved accuracy in both RMSE and power-spectrum reconstruction. It provides a promising tool for mapping dark matter environments and large-scale structures in the era of next-generation space lensing surveys.\n\n"}, "supernova": {"2601.15187": "2026-01-21, **The early r-process nucleosynthesis scenarios**, Noam Soker et.al., [2601.15187v1](http://arxiv.org/abs/2601.15187v1)\n\n I compare seven actively studied r-process nucleosynthesis scenarios against observed properties of r-process elements in the early Universe, and conclude that the most likely scenario to contribute to the site of elements below the third r-process peak is the magnetorotational r-process scenario, and that of the third peak is the common envelope jets supernova (CEJSN) r-process scenario. The collapsar and CEJSN r-process scenario might also contribute to the lighter r-process elements, and the binary neutron star (NS-NS) merger r-process scenario might contribute to the third r-process peak. The magnetar, the wind from the newly born NS, and the accretion-induced collapse of a white dwarf r-process scenarios fall short in explaining observations. They might exist, but cannot be major contributors to the r-process in the early Universe. To constrain r-process scenarios in the early Universe, I require that they explain the large scatter in the r-process abundances of very metal-poor stars, account for the correlation between light r-process nucleosynthesis and iron production, and the lack of correlation between the third peak r-process production and iron production, as inferred from very metal-poor stars. I discuss the diversity of the CEJSN r-process scenario and encourage extending its exploration.\n\n", "2601.14864": "2026-01-21, **Dark Energy Survey: DESI-Independent Angular BAO Measurement**, J. Mena-Fernández et.al., [2601.14864v1](http://arxiv.org/abs/2601.14864v1)\n\n We present a measurement of the angular Baryon Acoustic Oscillation (BAO) scale from the completed Dark Energy Survey (DES) dataset excluding the area of overlap with the Dark Energy Spectroscopic Instrument (DESI). We follow the same methodology and validation process as in the DES Y6 BAO analysis. We interpret the impact of this measurement in the context of the statistical preference for $w\\_0w\\_a$CDM over $Λ$CDM when combined with DES Y5 Type Ia supernovae (SN), Planck Cosmic Microwave Background (CMB) and DESI BAO. Based on our previous work, using the full Y6 DES BAO sample, in combination with SN, CMB and DESI DR1 BAO, added 0.3$σ$ in this preference (from 3.7$σ$ to 4.0$σ$), but this ignored possible correlations between datasets. Using our new DESI-independent DES BAO likelihood instead, we find a smaller increase in the statistical preference for $w\\_0w\\_a$CDM, from 3.7$σ$ to 3.8$σ$ when using DESI DR1 BAO, and from 4.0$σ$ to 4.1$σ$ when updating to the more recent DESI DR2 BAO. These significances reduce to 3.1$σ$ when using the new calibrated DES SN-Dovekie. Alongside this work, we publicly release BAOfit\\_wtheta, the BAO fitting code for the angular correlation function used in the DES Y6 BAO analysis.\n\n", "2601.14830": "2026-01-21, **SN 2023zcu: A Type IIP SN with Early Flash Features**, Monalisa Dubey et.al., [2601.14830v1](http://arxiv.org/abs/2601.14830v1)\n\n We present a detailed photometric and spectroscopic analysis of the Type IIP supernova SN~2023zcu, which exploded in the galaxy NGC~2139 (redshift $z$ = 0.006). SN~2023zcu exhibits a well-sampled light curve covering the rise, plateau, and nebular phases. It has an optically thick phase of $100.6 \\pm 0.6$ d with a magnitude drop of $\\sim$1.7 mag in the {\\em V} band during the transition between the plateau and the nebular phases. Weak emission features in the early-time spectra indicate a low-level interaction between circumstellar material (CSM) and the SN ejecta. The spectral evolution is well sampled and exhibits a prominent P-Cygni profile of H$α$, a defining characteristic of Type IIP SNe. Signatures of metal-line formation (e.g., \\ion{Fe}{2}, \\ion{Ca}{2} near-infrared triplet) are also evident in the spectra as the SN evolves. Spectral modeling with the radiative-transfer code \\texttt{TARDIS} during the early photospheric phase (8.7--35.5 d since explosion) yields photospheric temperatures decreasing from $\\sim$9,000 to $\\sim$6,000 K and expansion velocities declining from $\\sim$10,000 to $\\sim$5,400 km s$^{-1}$. A tailored expanding photosphere method (EPM) fit based on the \\texttt{TARDIS} models provides a distance estimate of $27.8 \\pm 2.0$ Mpc. Nebular-phase spectra and bolometric light-curve modeling suggest a progenitor mass in the range 12--15 M$\\_\\odot$. This thorough analysis helps to constrain progenitor properties and explosion parameters, thereby strengthening our understanding of Type IIP SNe.\n\n", "2601.14801": "2026-01-21, **The Supernova Remnant G284.3$-$1.8 and Its Relation to the Gamma-ray Binary 1FGL J1018.6$-$5856**, Natsuki Terano et.al., [2601.14801v1](http://arxiv.org/abs/2601.14801v1)\n\n G284.3$-$1.8 is a supernova remnant with a radio shell and thermal X-ray emission. Located near its center is the gamma-ray binary 1FGL J1018.6$-$5856, although the physical association between the two systems is not clear yet. Our X-ray spectroscopy with Suzaku reveals that G284.3$-$1.8 and 1FGL J1018.6$-$5856 have compatible absorption column densities of $N\\_\\mathrm{H} = 6\\textrm{--}7 \\times 10^{21}~\\mathrm{cm}^{-2}$, indicating that the two systems have similar distances. The actual distance is determined as $3~\\mathrm{kpc}$ using $\\mathrm{^{12}CO}$ ($J=1\\textrm{--}0$) data obtained with NANTEN. The X-ray spectrum of G284.3$-$1.8 shows a strong K-shell emission line of Mg, confirming that the earlier claim that the SNR is one of the few Mg-rich SNRs. Comparing recent stellar models taking into account the \"shell merger\" processes, we find that the obtained Mg-to-Ne mass ratio of $M\\_\\mathrm{Mg}/M\\_\\mathrm{Ne} = 0.73^{+0.07}\\_{-0.03}$ and Si-to-Mg mass ratio of $M\\_\\mathrm{Si}/M\\_\\mathrm{Mg} = 0.44\\pm0.03$ suggest a supernova explosion that would have left a neutron star. The characteristics of 1FGL J1018.6$-$5856, on the other hand, are better explained with a model in which its compact object is neutron star. The present results, therefore, would suggest a possible scenario where G284.3$-$1.8 and 1FGL J1018.6$-$5856 are both remnants of a common supernova explosion although further observational tests are necessary.\n\n", "2601.14729": "2026-01-21, **Cosmological Constraints on f(T,B) Gravity from Observations of Early and Late Universe**, Yahia Al-Omar et.al., [2601.14729v1](http://arxiv.org/abs/2601.14729v1)\n\n We present a unified framework that combines early- and late-Universe observations to constrain three functional realizations of f(T,B) gravity: the linear, quadratic, and general power-law models. First, constraints on deviations from the standard weak interaction freeze-out temperature are derived using the most recent measurements of the primordial helium-4 mass fraction. Second, we perform a joint analysis incorporating five priors: Type Ia supernovae, baryon acoustic oscillations, cosmic chronometers, Big Bang Nucleosynthesis, and Cosmic Microwave Background in order to place bounds on the model parameters. The joint likelihood analysis significantly tightens the constraints compared to individual datasets. Third, we test the null, strong, and dominant energy conditions to evaluate the physical viability of the best-fit solutions across the cosmic redshift range. Our results show that all three f(T,B) models are consistent with current observations and exhibit stable behavior under the energy-condition criteria, supporting torsion-boundary modified gravity as a robust and viable alternative to General Relativity.\n\n", "2601.14393": "2026-01-20, **MeV absorption in gamma-ray bursts as a probe of their progenitor winds**, Gor Oganesyan et.al., [2601.14393v1](http://arxiv.org/abs/2601.14393v1)\n\n A small fraction of X-ray photons from gamma-ray bursts (GRBs), after escaping the relativistic jet, are scattered by electrons in the circumburst medium. Subsequent photon-photon absorption between the incoming MeV $γ$-rays and the back-scattered X-rays generate electron-positron pairs, enriching the surrounding medium with leptons. We investigate how these back-scattered photons modify the prompt GRB spectrum through $γ-γ$ absorption. In a dense and pair-loaded wind environment, the emerging spectra exhibit a broad attenuation structure, whose morphology is sensitive to the low-energy spectral index $α$. In particular, spectra with $α> -1$ develop a pronounced, saddle-shaped absorption between 1 and 100 MeV (rest frame). Such external MeV absorption could account for the spectral curvature seen in some bright GRBs, and may point to enhanced mass loss from their progenitor stars, consistent with early observations of core-collapse supernovae.\n\n", "2601.14257": "2026-01-20, **A self-consistent explanation of the MeV line in GRB 221009A unveils a dense circum-stellar medium**, O. S. Salafia et.al., [2601.14257v1](http://arxiv.org/abs/2601.14257v1)\n\n GRB~221009A has been the brightest gamma-ray burst (GRB) observed to date, and its afterglow has been characterised with unprecedented detail at TeV energies by LHAASO. Quite puzzlingly, it is also the most energetic GRB known. Among the riddles posed by this mysterious source, however, the sheer energetics are hardly the most intriguing: an unprecedented, narrow, luminous emission line at around 10 MeV has been uncovered by a detailed spectral analysis of \\textit{Fermi}/GBM data immediately following the brightest peak in the GRB prompt emission and the peak of the TeV afterglow. As noted in the discovery article, the temporal evolution of the line properties can be explained as being due to high-latitude emission from a geometrically thin, relativistically expanding shell where annihilation of a large number of electron-positron pairs took place. We show that this interpretation yields stringent constraints on the properties of such shell, that point to a process that happens at radii typical of external shocks. We then demonstrate that the shell could have been the blastwave associated with the GRB precursor, with the line arising after pair loading of such blastwave as it was illuminated by the bright and hard radiation of the GRB main event. The scenario, which also explains the abrupt initial rise of the LHAASO afterglow, requires the progenitor of the GRB to have been surrounded by a circum-stellar medium (CSM) extending out to a few $10^{15}\\,\\mathrm{cm}$, with a density $n\\_\\mathrm{ext}\\sim 10^{8}-10^{9}\\,\\mathrm{cm^{-3}}$ reminiscent of those found from studies of Type IIn supernovae. This provides a precious clue to the nature of the progenitor of this peculiar GRB, which could also be present in other bursts that feature a long quiescence followed by a bright emission episode with a hard spectrum.\n\n", "2601.14222": "2026-01-20, **Revisiting the Matter Creation Process: Observational Constraints on Gravitationally Induced Dark Energy and the Hubble Tension**, Tiziano Schiavone et.al., [2601.14222v1](http://arxiv.org/abs/2601.14222v1)\n\n The persistent Hubble tension and the lack of a fundamental explanation for dark energy motivate the exploration of alternative mechanisms capable of reproducing late-time cosmic acceleration. In this work, we revisit gravitationally induced particle creation as a phenomenological non-equilibrium process that can effectively mimic a dynamical dark-energy component. Within the thermodynamic framework of open systems, we model the production of an unspecified particle species with constant intrinsic equation-of-state parameter and consider four phenomenological parametrisations of the particle-creation rate. The modified continuity and Friedmann equations lead to an effective negative pressure and a redshift-dependent effective equation of state, which we constrain using Cosmic Chronometers, Pantheon+ supernovae, DESI DR2 BAO, a compressed CMB likelihood, and SH0ES data. Using the full dataset combination, we find that particle-creation models provide fits comparable to $Λ$CDM, yielding $H\\_0 \\simeq 69.3\\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$ and present-day effective dark-energy equation-of-state values close to $w^{\\rm eff}\\_{\\rm DE}(0)\\simeq -1$, with all models predicting an accelerating Universe ($q\\_0\\simeq -0.55$). When the Hubble tension is assessed using early- and late-time dataset splits, particle-creation scenarios reduce its statistical significance to the $\\simeq 2.4σ$--$3σ$ level, compared to the $4.3σ$ discrepancy obtained in $Λ$CDM. Although deviations from $Λ$CDM remain mild and Bayesian model comparison indicates no statistical preference between models, gravitationally induced particle creation emerges as a viable late-time extension of the standard cosmological model and provides a consistent phenomenological framework for exploring departures from $Λ$CDM.\n\n", "2601.13868": "2026-01-20, **The Characteristic Mass and Energy Conversion Efficiency in the Cusp-Core Transition of Dark Matter Haloes: Implications for Scaling Relations and Supernova feedbacks**, Michi Shinozaki et.al., [2601.13868v1](http://arxiv.org/abs/2601.13868v1)\n\n Galaxies in the nearby Universe, particularly dwarf systems, exhibit inner mass profiles of dark matter haloes that systematically depart from canonical cold dark matter expectations, signalling an interplay between baryonic feedback and the collisionless halo. We update an analytical cusp-core transition model by incorporating the effect of supernova-driven mass loss. Adapting this model to SPARC galaxies, we measure the energy conversion efficiency epsilon, defined as the fraction of supernova feedback energy that is used to change the central dark-matter potential. We find epsilon ~ 0.01 for nearby SPARC galaxies. Building on these measurements, we compare the dynamical energy required for a cusp-core transformation with the feedback energy available over burst cycles and identify a cusp-core transition forbidden region on the halo-stellar mass plane where transformation cannot occur. Galaxies with halo masses from 10^8 to 10^11 M\\_sun lie outside the forbidden region, whereas ultra-faint dwarf galaxies < 10^8 M\\_sun, galaxy groups and clusters > 10^11 M\\_sun fall within it, consistent with their high central densities and the inefficiency of core formation at very low and very high masses. This approach also explains the observed diversity of inner density profiles in low-mass systems, showing that both the star formation rate and the energy conversion efficiency govern them, with the latter emerging as a key parameter setting the strength of the cusp-core transition. Beyond the cusp-core problem, our observationally inferred energy conversion efficiency provides a model independent benchmark that strongly constrains galaxy formation models.\n\n", "2601.13785": "2026-01-20, **Still Accelerating: Type Ia supernova cosmology is robust to host galaxy age evolution**, Phil Wiseman et.al., [2601.13785v1](http://arxiv.org/abs/2601.13785v1)\n\n Type Ia supernovae are a cornerstone of modern cosmology, providing first evidence for cosmic acceleration and new tests of dark energy. Son et al. 2025 (S25) claim a strong redshift evolution in standardized supernova luminosities driven by supernova progenitor age, with dramatic cosmological implications: rapidly evolving dark energy, decelerating expansion, and a $9σ$ tension with $Λ$CDM. We show that the underpinning evidence required for this conclusion -- the supernova progenitor-age dependence, the redshift-dependent age difference, and their combined impact -- is either negligible or relies on effects already corrected for in modern supernova analyses. First, the S25 analysis omits the standard host-galaxy stellar mass correction that captures known environmental dependencies that also correlate with stellar age. Applying this correction to the S25 sample, we find no dependence of standardized supernova brightness on host age. Independent data also show no significant difference at low-redshift in standardized brightness between star-forming galaxies and several Gyr older quiescent galaxies of the same stellar mass. Second, the S25 scenario predicts strong redshift evolution of the host-mass effect. Data from the Dark Energy Survey supernova survey measure evolution of $-0.028 \\pm 0.034~\\mathrm{mag}\\,z^{-1}$, consistent with zero and altering the dark-energy equation-of-state measurement ($w$) by $<$0.01 if included. Third, we demonstrate that the claimed $\\sim5$~Gyr progenitor age difference between nearby and distant supernovae is overstated by factors of three to five largely due to a conflation of host galaxy age with supernova progenitor age. We conclude that type~Ia supernova cosmology remains robust for current measurements of dark energy.\n\n", "2601.13621": "2026-01-20, **Cosmological Budget of Entropy from Merging Black Holes**, Siyuan Chen et.al., [2601.13621v1](http://arxiv.org/abs/2601.13621v1)\n\n Black holes contain more entropy than any other component of the observable universe. Gravitational-wave observations from LIGO and Virgo have shown evidence of a previously unknown black hole mass range, which provides new information to update the entropy budget. Increases in entropy due to binary black hole mergers, as implied in the second law of thermodynamics, should also be added to the budget. In this study, we update the cosmological entropy budget for black holes in the stellar to lite-intermediate-mass range $(5-300~M\\_\\odot)$, originating from either supernovae or binary mergers, by utilizing a suite of population synthesis models and phenomenological fits derived from numerical relativity. We report three new insights: Firstly, the cumulative entropy from merging black holes surpasses the total entropy from cosmic microwave background photons around the onset of the Over-massive Black Hole Galaxy phase at $z\\sim 12$, suggesting that mergers played a more significant role in shaping the thermodynamic state of the early universe than relic radiation. Secondly, if primordial black holes constitute a nonzero fraction of dark matter, their early binary mergers establish an ``entropy floor\" in the Dark Ages and can dominate the cumulative merger-generated entropy history even for small abundances. Thirdly, by computing the cosmological density parameters, we highlight the thermodynamic asymmetry in black hole mergers, where the production of gravitational-wave energy is inefficient compared to the immense generation of Bekenstein-Hawking entropy.\n\n", "2601.13587": "2026-01-20, **The R2Pub Telescopes for Surveying: An Overview and Performance Evaluation of the System**, Xuan Song et.al., [2601.13587v1](http://arxiv.org/abs/2601.13587v1)\n\n The R2Pub telescope, built by the Beijing Planetarium, is a 60 cm equatorial binocular telescope located at the Daocheng site of Yunnan Observatories in China, at an altitude of about 4700 m. This paper presents an overview of the R2Pub telescope system, including its design, instrumentation, and survey capabilities, and reports an initial evaluation of its system performance. R2Pub is a prime-focus binocular system, with each optical tube covering a field of view of approximately 18 square degrees. It is designed to detect a wide range of transient and variable sources in the local universe, such as variable stars, eclipsing binaries, supernovae, gamma-ray burst afterglows, tidal disruption events, active galactic nuclei, and other unknown transients. The observatory infrastructure, including the dome, equatorial mount, optical tubes, and associated subsystems, has been fully constructed and installed, and the system has entered the commissioning phase. Benefiting from the high-altitude location, good seeing conditions, and dark sky background at the Daocheng site, performance tests during commissioning show that the R2Pub system can reach a 5-sigma limiting magnitude of about 18.7 mag in the Pan-STARRS r' band with a 60 s exposure. Ongoing observations with R2Pub are expected to contribute to studies of variable and transient phenomena and to enhance public outreach in astronomy. The binocular design enables simultaneous dual-band observations, providing instantaneous color information for transient sources and improving the classification and physical characterization of their properties and evolution.\n\n"}}