{"neutrino": {"2512.25038": "2025-12-31, **Anomalous (3+1)d Fermionic Topological Quantum Field Theories via Symmetry Extension**, Zheyan Wan et.al., [2512.25038v1](http://arxiv.org/abs/2512.25038v1)\n\n Discrete finite-group global symmetries may suffer from nonperturbative 't-Hooft anomalies. Such global anomalies can be canceled by anomalous symmetry-preserving topological quantum field theories (TQFTs), which contain no local point operators but only extended excitations such as line and surface operators. In this work, we study mixed gauge-gravitational nonperturbative global anomalies of Weyl fermions (or Weyl semimetals in condensed matter) charged under discrete Abelian internal symmetries in four-dimensional spacetime, with spacetime-internal fermionic symmetry $G=$Spin$\\times\\_{\\mathbb{Z}\\_2^{\\rm F}}\\mathbb{Z}\\_{2m}^{\\rm F}$ or Spin$\\times\\mathbb{Z}\\_n$ that contains fermion parity $\\mathbb{Z}\\_{2}^{\\rm F}$. We determine the minimal finite gauge group $K$ of anomalous $G$-symmetric TQFTs that can match the fermionic anomaly via the symmetry-extension construction $1 \\to K \\to G\\_{\\rm Tot} \\to G \\to 1$, where the anomaly in $G$ is trivialized upon pullback to $G\\_{\\rm Tot}$, computed by Atiyah-Patodi-Singer eta invariant. This allows one to replace a $G$-symmetric four-dimensional Weyl fermion by an anomalous $G$-symmetric discrete-$K$-gauge TQFT as an alternative low-energy theory in the same deformation class. As an application, we show that the four-dimensional Standard Model with 15 Weyl fermions per family, in the absence of a sterile right-handed neutrino $ν\\_R$, exhibits mixed gauge-gravitational global anomalies between baryon and lepton number symmetries $({\\bf B \\pm L})$ and spacetime diffeomorphisms. We identify the corresponding minimal $K$-gauge fermionic TQFT that cancels these anomalies and can be interpreted as a gapped, topologically ordered dark sector replacing missing Weyl fermions via symmetry extension, without invoking conventional Anderson-Higgs symmetry breaking.\n\n", "2512.25035": "2025-12-31, **Large Neutrino-Dark Matter Interactions: From Effective Field Theory to Ultraviolet Completions**, K. S. Babu et.al., [2512.25035v1](http://arxiv.org/abs/2512.25035v1)\n\n We develop a general effective field theory (EFT) framework for neutrino-dark matter (DM) interactions, and apply it to systematically find all possible gauge-invariant ultraviolet (UV) completions at a given EFT operator dimension. Our goal here is to find simple UV-complete models that can realize potentially large neutrino-DM interactions, while being consistent with all existing theoretical and experimental constraints. We first construct the leading non-derivative operator basis for neutrino-DM scattering in a low-energy effective theory with neutrinos and DM (DM-LEFT), together with its gauge-invariant embedding in the Standard Model EFT (DM-SMEFT). We then construct all renormalizable tree-level UV completions that generate the relevant DM-SMEFT operators up to dimension-8 using a topology-based classification. Using this framework, we present minimal UV-complete models for different DM types that can yield effective neutrino-DM couplings up to several orders of magnitude larger than the Fermi coupling, while satisfying all constraints, most notably from neutrino mass and from the charged-lepton sector. This includes a pseudo-Dirac fermion DM realization in the scotogenic neutrino mass model and models of Majorana DM inspired by type-II and inverse seesaw-based neutrino mass models. Phenomenological implications for DM thermal relic abundance and direct detection prospects, as well as various cosmological and laboratory constraints on the model parameter space, are also analyzed.\n\n", "2512.25028": "2025-12-31, **Universal Seesaw Pati-Salam Model with P for Strong CP**, K. S. Babu et.al., [2512.25028v1](http://arxiv.org/abs/2512.25028v1)\n\n We develop a universal seesaw version of the Pati-Salam model wherein quarks and leptons of each family are unified into common multiplets transforming as $ψ\\_L(2,1,4))+ ψ\\_R((1,2,4)$ under the $SU(2)\\_L \\times SU(2)\\_R \\times SU(4)\\_c$ gauge symmetry. Parity symmetry is spontaneously broken in the model, which helps in solving the strong CP problem without the axion. The Higgs sector of the model is very simple, consisting of a single pair of $H\\_L(2,1,4)+ H\\_R(1,2,4)$ fields. Fermion masses arise through mixing of the chiral fermions with vector-like quarks and leptons contained in $(1,1,15)$ as well as $(1,1,10)\\_L+(1,1,10)\\_R$ multiplets via a universal seesaw mechanism. Consistency of such a spectrum with the observed quark and lepton masses is established. The parity solution to the strong CP problem is shown to be effective in this framework, although there are new loop contributions to $\\overlineθ$, compared to the analogous left-right symmetric model, arising from color sextet and octet fermions, as well as from diagrams mediated by leptoquark bosons. We also find that, in this setup, although lepton number is broken, neutrino masses remain zero at the tree-level. Small and finite Majorana neutrino masses are induced via one-loop diagrams, which we analyze and show to be compatible with oscillation experiments.\n\n", "2512.25019": "2025-12-31, **Loop-Level Lepton Flavor Violation and Diphoton Signals in the Minimal Left-Right Symmetric Model**, Shufang Qiang et.al., [2512.25019v1](http://arxiv.org/abs/2512.25019v1)\n\n The left-right symmetric model (LRSM) could not only restore parity of the weak interaction, but also provide natural explanations of the tiny active neutrino masses via the seesaw mechanisms. The $SU(2)\\_R$-breaking scalar $H\\_3$ can induce lepton flavor violating (LFV) effects in the minimal version of LRSM at the 1-loop order, originating from the mixing of heavy right-handed neutrinos. If $H\\_3$ is light, say below the GeV scale, it will lead to rich signals, e.g. the LFV muon and tauon decays $\\ell\\_β\\to \\ell\\_α+ X$ ($X$ being either visible or invisible final states) and the anomalous supernova signatures. Combined with the diphoton coupling of $H\\_3$, the right-handed scale $v\\_R$ is excluded up to $2\\times10^9$ GeV. In the future, the $v\\_R$ scale can be probed up to $5\\times10^9$ GeV in high-precision muon experiments, and further up to $6\\times10^{11}$ GeV by supernova observations.\n\n", "2512.24804": "2025-12-31, **Minimal Modular Flavor Symmetry and Lepton Textures Near Fixed Points**, Zurab Tavartkiladze et.al., [2512.24804v1](http://arxiv.org/abs/2512.24804v1)\n\n An extension of the Standard Model with $Γ\\_2\\simeq S\\_3$ modular flavor symmetry is presented. We consider the construction of the lepton sector, augmented by two right-handed neutrino states, in the vicinity of the fixed points $τ= i\\infty $ and $τ= i$. Due to the residual symmetries at these points, and with the aid of non-holomorphic modular forms (which constitute representations of $S\\_3$) and by assigning specific transformation properties to the fermion fields, highly economical models (without flavon fields) are constructed with interesting Yukawa textures. All presented models strongly prefer the inverted ordering for the neutrino masses.\n\n", "2512.24215": "2025-12-30, **Neutrino Mass, Vacuum Stability and Higgs Inflation with Vector-Like Quarks and a Single Right-Handed Neutrino**, Canan Karahan et.al., [2512.24215v1](http://arxiv.org/abs/2512.24215v1)\n\n We investigate a Standard Model extension containing $n$ degenerate down-type isosinglet vector-like quarks (VLQs) with masses $M\\_{\\mathcal D}$ and Yukawa couplings $y\\_{\\mathcal D}$, supplemented by a single right-handed neutrino (RHN), aiming to simultaneously address neutrino mass generation, electroweak vacuum stability, and Higgs inflation. The VLQs play the dominant role in stabilizing the Higgs potential through their impact on the renormalization-group evolution, while the RHN generates light neutrino masses via a Type-I seesaw mechanism and smooths the high-scale running of the Higgs quartic coupling in the inflationary regime. We perform a two-loop Standard Model renormalization-group equation analysis supplemented by the one-loop contributions of the VLQs and the RHN, with proper matching across their mass thresholds. Using these RG trajectories, we identify the regions in $(n,\\, y\\_{\\mathcal D},\\, M\\_{\\mathcal D})$ that stabilize the Higgs potential up to the Planck scale while satisfying experimental constraints. Employing the RG-improved Higgs potential in the metric formulation of non-minimal Higgs inflation, we compute the inflationary observables $n\\_s$ and $r$. The SM+$(n)$VLQ+RHN framework yields predictions consistent with the combined Planck, WMAP, and BICEP/Keck data, while simultaneously ensuring electroweak vacuum stability and phenomenologically viable neutrino masses within well-defined regions of parameter space. For comparison, we also investigate the SM+$(n)$VLQ limit and present its vacuum stability and Higgs inflation predictions as a reference to quantify the stabilizing role of the VLQ sector.\n\n", "2512.24178": "2025-12-30, **A Seyfert galaxy as a hidden counterpart to a neutrino-associated blazar**, Emma Kun et.al., [2512.24178v1](http://arxiv.org/abs/2512.24178v1)\n\n The origin and production mechanisms of high-energy astrophysical neutrinos remain open questions in multimessenger astronomy. Previous studies have hinted at a possible linear correlation between the hard X-ray and high-energy neutrino emission in active galactic nuclei. New \\textit{NuSTAR} observations, first presented here, reveal that blazar PKS 1424+240, located within a prominent IceCube neutrino hotspot, is far fainter in hard X-rays than expected from this trend. Motivated by this apparent ambiguity, we identify the nearby Seyfert galaxy NGC 5610, also coincident with the hotspot, whose unabsorbed hard X-ray flux exceeds that of PKS 1424+240 by about an order of magnitude. When the local IceCube neutrino flux is apportioned between the two AGN in proportion to their hard X-ray emission, both align with the previously suggested X-ray-neutrino correlation. This suggests that certain IceCube hotspots may be unresolved blends of multiple AGN, and supports a multimessenger scenario in which high-energy neutrinos and hard X-rays originate from the same hadronic interactions, with the X-ray emission produced through cascade reprocessing.\n\n", "2512.24163": "2025-12-30, **Lepton-flavor violation in the MRSSMSeesaw**, Hao-Yi Liu et.al., [2512.24163v1](http://arxiv.org/abs/2512.24163v1)\n\n The Minimal R-symmetric Supersymmetric Standard Model with Seesaw (MRSSMSeesaw) extends the MRSSM by incorporating right-handed neutrinos to generate neutrino masses via the Type-I seesaw mechanism. This work presents a detailed analysis of lepton flavor violation (LFV) processes, including $\\ell\\_i \\rightarrow \\ell\\_j γ$, $\\ell\\_i \\rightarrow 3\\ell\\_j$, and Higgs decays $h \\rightarrow \\ell\\_i \\ell\\_j$, Based on the current experimental limitations, we carry out detailed parameter scanning and numerical calculations to analyse the effects of different sensitive parameters on LFV.The numerical results show that the non-diagonal elements involving the initial and final leptons are main sensitive parameters and LFV sources.\n\n", "2512.24132": "2025-12-30, **An $A_4$-Symmetric Double Seesaw for Neutrino Masses and Mixing in Light of JUNO results**, Swaraj Kumar Nanda et.al., [2512.24132v1](http://arxiv.org/abs/2512.24132v1)\n\n We discuss a double seesaw mechanism for generating light neutrino masses within the Standard Model extensions that include both right-handed neutrinos and extra gauge-singlet sterile fermions. The flavour structure of the double seesaw framework is invoked by an $A\\_4$ discrete symmetry which yields predictive textures for the Dirac neutrino mass matrix $M\\_D$, the mixing matrix $M\\_{RS}$ connecting right-handed and sterile neutrinos, and the bare Majorana mass matrix $M\\_S$ for the sterile neutrinos. The interesting feature of the present framework is that the combination of the double seesaw mechanism and $A\\_4$ flavour alignments yields a leading-order TBM structure, corrected by a single rotation in the (1-3) sector. We also derive analytic expressions for the heavy sterile eigenvalues and for the resulting light neutrino masses, thereby clarifying the role of the symmetry in shaping the neutrino mass hierarchy. We further incorporate the most recent JUNO measurements, which improve the precision of the solar mixing angle $\\sin^2θ\\_{12} \\simeq 0.31$, along with updated constraints on $\\sin^2θ\\_{13}$. We show that these results significantly restrict the allowed parameter space of the model. In particular, the observed value of $\\sin^2θ\\_{12}$ constrains the magnitude of the (1--3) rotation and the phases associated with the $A\\_4$ flavon couplings, while the value of $\\sin^2θ\\_{13}$ sharpens these restrictions further. Overall, the interplay between double seesaw dynamics, $A\\_4$ flavour symmetry, and the recent JUNO constraints yields a highly predictive framework for neutrino masses and mixings, offering a coherent explanation for the generation of light neutrino masses and testable predictions for future experiments.\n\n", "2512.24032": "2025-12-30, **Dark Matter-Driven Low-Scale Leptogenesis via Neutrino Portal**, Suresh Chand et.al., [2512.24032v1](http://arxiv.org/abs/2512.24032v1)\n\n We propose a novel framework for low-scale leptogenesis within an extension of the Standard Model (SM) that includes three SU(2) singlet right-handed neutrinos, a singlet charged neutral fermion, and a real scalar field. In this setup, the CP asymmetry arises through a rich interplay of mechanisms, including two-body decays of the lightest right-handed neutrino into leptons and Higgs or into dark-sector particles, as well as multiple 2 -> 2 scattering processes involving visible and dark states. Crucially, the CP-violating phases originate not only from conventional vertex and self-energy corrections but also from novel interference effects mediated by the dark sector, which significantly enrich the sources of asymmetry. A distinctive feature of our model is the direct connection between the dark sector and leptogenesis, providing a unified explanation for both the matter-antimatter asymmetry and DM abundance. This connection leads to enhanced CP violation in neutrino interactions and predicts new dark-sector particles accessible at the LHC.\n\n", "2512.23974": "2025-12-30, **Design, construction, and testing of the PandaX-xT cryogenics system**, Xu Wang et.al., [2512.23974v1](http://arxiv.org/abs/2512.23974v1)\n\n The PandaX-xT is a next-generation experiment with broad scientific goals, including the search for dark matter, Neutrinoless Double Beta Decay, and astrophysical neutrinos, using a dual-phase time projection chamber with about 43 tons of liquid xenon. A new cryogenics system of the PandaX-xT is described in this paper. It is developed to handle large mass of liquid xenon efficiently and safely, including two cooling towers for normal operation and one liquid-nitrogen coil for emergency case. Each cooling tower equipped with an AL600 Gifford-McMahon cryocooler features a 1300 W heater, specifically designed to maintain the cold finger's temperature at the desired setpoint. The performance of the cooling tower and the coil has been tested. The cryogenics system with two cooling towers has achieved about 1900~W cooling power at 178~K. The liquid nitrogen coil provides emergency cooling power of more than 1500~W at liquid xenon temperature. For the prototype of a 1-tonne liquid xenon detector, the fluctuation of xenon saturated vapor pressure remains below 1 kPa over one month, while the pressure is around 210~kPa.\n\n"}, "dark matter": {"2512.25044": "2025-12-31, **Primordial black hole dark matter from ultra-slow-roll inflation in Horndeski gravity**, Despina Totolou et.al., [2512.25044v1](http://arxiv.org/abs/2512.25044v1)\n\n Primordial black holes (PBHs) provide a well-motivated non-particle candidate for dark matter, requiring an enhancement of curvature perturbations on small inflationary scales consistent with observational constraints. In this work we study PBH production within Horndeski gravity, accounting for compatibility with the GW170817 constraint on the gravitational-wave speed and imposing a constant coupling to the Ricci scalar. Under these conditions, and assuming an inflaton field characterised by a canonical kinetic term and a smooth potential, the inflationary dynamics is controlled by the cubic Horndeski interaction. We show that a suitable kinetic dependence of the latter enhances the effective friction acting on the inflaton, inducing a transient ultra-slow-roll phase embedded in an otherwise standard slow-roll evolution. Interestingly, this mechanism amplifies the curvature power spectrum on small scales without introducing any feature in the potential. For representative parameter choices we find that pronounced peaks in the scalar power spectrum are generated, leading to the formation of asteroid-mass PBHs with masses of order $\\mathcal{O}(10^{-16})\\,M\\_\\odot$, which can account for a substantial fraction of the dark matter abundance, reaching $f\\_{\\rm PBH}\\simeq 0.9$, while satisfying current observational constraints. The resulting sharp features in the scalar power spectrum also imply potentially observable scalar-induced gravitational-wave signatures.\n\n", "2512.24973": "2025-12-31, **GEQIE Framework for Rapid Quantum Image Encoding**, Rafał Potempa et.al., [2512.24973v1](http://arxiv.org/abs/2512.24973v1)\n\n This work presents a Python framework named after the General Equation of Quantum Image Encoding (GEQIE). The framework creates the image-encoding state using a unitary gate, which can later be transpiled to target quantum backends. The benchmarking results, simulated with different noise levels, demonstrate the correctness of the already implemented encoding methods and the usability of the framework for more sophisticated research tasks based on quantum image encodings. Additionally, we present a showcase example of Cosmic Web dark-matter density snapshot encoding and high-accuracy retrieval (PCC = 0.995) to demonstrate the extendability of the GEQIE framework to multidimensional data and its applicability to other fields of research.\n\n", "2512.24924": "2025-12-31, **Discovery of a galaxy associated with the HI cloud FAST J0139+4328**, Ana Mitrašinović et.al., [2512.24924v1](http://arxiv.org/abs/2512.24924v1)\n\n The search for ``dark galaxies,'' a key prediction of the lambda cold dark matter, has yielded few viable candidates. Recently, FAST J0139+4328 was reported as the first isolated dark galaxy in the nearby universe, based on a neutral hydrogen (HI) detection and a non-detection in the Pan-STARRS1 survey. To verify the nature of this candidate, we obtained deep optical imaging, using the $1.4\\,\\mathrm{m}$ \\textit{Milanković} and $0.6\\,\\mathrm{m}$ \\textit{Nedeljković} telescopes, and spectroscopic follow-up of the field. We report the unambiguous discovery of a low-surface-brightness (LSB) optical counterpart at the location of the HI cloud. Furthermore, the detection of H$α$ emission via the $6\\,\\mathrm{m}$ Big Telescope Alt-Azimuthal (BTA) confirms that the stellar system lies at a redshift consistent with the HI source, establishing their physical association. Through detailed photometry and employing color-dependent mass-to-light scaling relations, we derive a total stellar mass of $M\\_\\star = (7.2 \\pm 3.7) \\times 10^6\\, M\\_{\\odot}$, about an order of magnitude higher than the previously estimated upper limit. Using the literature HI mass, this implies a gas-to-stellar mass ratio of $M\\_{\\mathrm{HI}} / M\\_{\\star} = 11.5 \\pm 6.4$. Our findings demonstrate that FAST J0139+4328 is not a dark galaxy but an extremely gas-rich LSB dwarf galaxy, whose stellar component was simply below the detection limit of the Pan-STARRS1 survey. This reclassification resolves the status of this prominent dark galaxy candidate and underscores the necessity of deep optical follow-up to classify faint HI-selected systems.\n\n", "2512.24753": "2025-12-31, **Probing a NED inspired Magnetically Charged Black Hole in the Hernquist Dark Matter Halo**, Sohan Kumar Jha et.al., [2512.24753v1](http://arxiv.org/abs/2512.24753v1)\n\n With an intent to examine the combined effect of non-linear electrodynamics (NED) and dark matter (DM), we obtain a static and spherically symmetric solution with the black hole (BH) magnetically charged and immersed in the Hernquist DM halo (MHDM). The position of the event horizon $r\\_h$ and the critical impact parameter $b\\_m$ are then probed to gauge the extent of influence magnetic charge $g$ and halo parameters $α$, $β$ have on them. A recurring outcome of our analysis with respect to different BH observables is the nullification of competing effects of charge and halo parameters, leading to observables obtaining values equal to those for a Schwarzschild BH. This is also observed for $r\\_h$ and $b\\_m$. We delve into unraveling the impact of NED and DM combined on the strong gravitational lensing (GL) and its related observables, such as the angular separation, relative magnification, and the angular position of the inner, closely packed bright ring. Interestingly, we find combinations of charge and halo parameters that leave the deflection angle unchanged from the Schwarzschild case, thereby leading to a situation where an MHDM BH and a Schwarzschild BH become indistinguishable. Similar results are also observed for lensing observables. Finally, utilizing observations related to the angular diameter of super-massive BHs (SMBHs) $M87^*$ and $SgrA^*$ and employing the $χ^2$ test, we extract bounds on $g$, $α$, and $β$ signifying the viability of our BH model as an SMBH.\n\n", "2512.24672": "2025-12-31, **An Effective Theory for Biased Tracers via the Boltzmann-Equation Approach**, Tomohiro Fujita et.al., [2512.24672v1](http://arxiv.org/abs/2512.24672v1)\n\n We develop an effective theory for biased tracers formulated at the level of the Boltzmann equation, providing a unified description of density and velocity bias. We introduce a general effective collision term in the tracer Boltzmann equation to encode tracer dynamics that are intrinsically different from those of dark matter. This collision operator leads to modified continuity and Euler equations, with source terms reflecting the collision-term physics. At linear order, this framework predicts time- and scale-dependent bias parameters in a self-consistent manner, encompassing peak bias as a special case while clarifying how velocity bias and higher-derivative effects arise. Applying the resulting bias model to redshift-space distortions, we show that the Boltzmann-equation approach reproduces the power spectrum of biased tracers obtained in the Effective Field Theory of Large-Scale Structure up to $k^4$ terms with fewer independent parameters.\n\n", "2512.24662": "2025-12-31, **Aspects of Sommerfeld Enhancement in the light of Halo gamma-ray excess**, Yongsoo Jho et.al., [2512.24662v1](http://arxiv.org/abs/2512.24662v1)\n\n We examine Sommerfeld enhancement in dark matter annihilation as a potential origin of the halo-like gamma-ray excess near $E\\_γ\\simeq 20$ GeV reported by Totani. A minimal model with a light CP-even scalar mediator naturally produces a velocity-dependent annihilation cross section consistent with thermal freeze-out, the Milky Way excess, and limits from dwarf spheroidal galaxies.\n\n", "2512.24350": "2025-12-30, **Self-Gravitating Scalar Field Configurations, Ultra Light Dark Matter and Galactic Scale Observations**, Bihag Dave et.al., [2512.24350v1](http://arxiv.org/abs/2512.24350v1)\n\n In this thesis, we investigate the possibility that dark matter consists of ultra light spin-zero particles with mass $m \\sim 10^{-22}\\ \\text{eV}$. We focus on the role of self-interactions, assuming all other non-gravitational couplings to Standard Model particles are negligible. Such ultra light dark matter (ULDM) is expected to form stable self-gravitating scalar field configurations (solitons), whose properties depend on the particle mass and self-coupling $λ$. Using solutions of the Gross-Pitaevskii-Poisson equations, we explore how galactic-scale observations can constrain $m$ and $λ$. We show that observational upper limits on the mass enclosed in central galactic regions can probe both attractive and repulsive self-interactions with strengths $λ\\sim \\pm 10^{-96} - 10^{-95}$. We further demonstrate that self-interactions can allow ULDM to describe observed rotation curves as well as satisfy an empirical soliton-halo mass relation in low surface brightness galaxies for $m \\sim 10^{-22}\\ \\text{eV}$ and $λ\\gtrsim 10^{-90}$. We also study tidal effects in satellite dwarf galaxies and find that attractive self-interactions can extend their lifetimes over cosmological timescales, allowing ULDM to evade recent constraints derived for the non-interacting case. Finally, we explore machine learning based inference of dark matter and baryonic parameters from galaxy rotation curves, showing that neural networks can recover parameters consistent with observations.\n\n", "2512.24309": "2025-12-30, **$S_8-H_0$ tension in a SI-ULDM scenario**, Jessica N. López-Sánchez et.al., [2512.24309v1](http://arxiv.org/abs/2512.24309v1)\n\n We study the cosmological impact of a transient self-interaction phase in Ultra-Light Dark Matter (ULDM), focusing on its simultaneous effects on the sound horizon and the late-time growth of structure. In the presence of a quartic self-interaction, the scalar field undergoes a short-lived radiation-like phase before evolving into matter-like behaviour, inducing a localized modification of the expansion history at early times. We develop a perturbative and model-independent framework in which the self-interaction energy density is parametrized as a localized contribution to the total energy budget. Within this approach, the responses of the sound horizon and the linear growth factor can be expressed as weighted integrals over cosmic time, with distinct kernels encoding the temporal sensitivity of each observable. This structure leads to a simple analytic relation linking the corresponding early- and late-time responses, and naturally predicts correlated shifts in $H\\_0$ and $S\\_8$ whose sign and magnitude depend on the timing of the self-interaction episode. Our results show that a single transient modification of the expansion history can interpolate between early-time effects on the sound horizon and late-time suppression of structure growth within a unified physical framework, providing an analytical understanding of their joint response.\n\n", "2512.24188": "2025-12-30, **Sommerfeld Enhancement from Background Force and the Galactic Center GeV Excess**, Yu Cheng et.al., [2512.24188v1](http://arxiv.org/abs/2512.24188v1)\n\n We study the impact of background-induced forces on dark matter (DM) annihilation and their implications for indirect detection. In the presence of a finite number density of background particles, loop-level interactions can generate an effective force that is significantly enhanced relative to the vacuum case. We construct a two-component DM model in which the dominant component is a fermionic particle $χ$ and the subdominant component is an ultralight pseudoscalar particle $φ$. The annihilation of $χ$ proceeds through the p-wave channel and produces gamma-ray emission. The finite density of $φ$ particles induces a background-enhanced force between $χ$ particles, leading to a sizable Sommerfeld enhancement of the annihilation. We show that a viable region of parameter space in this model can account for the gamma-ray excess observed in the Galactic Center using Fermi-LAT data. The background-induced force substantially amplifies the Sommerfeld enhancement and thus enlarges the parameter space capable of explaining the excess, highlighting the importance of background effects in astrophysical environments.\n\n"}, "supernova": {"2512.25064": "2025-12-31, **Feeling Blue: Constructing a Robust SALT3 UV Template and Constraining its Redshift Dependency**, Qinan Wang et.al., [2512.25064v1](http://arxiv.org/abs/2512.25064v1)\n\n Upcoming cosmological surveys will obtain numerous rest-frame ultraviolet (UV) observations of Type Ia supernovae (SNe Ia), yet there is concern about how standardizable SNe Ia are in the UV. In this work, we train a robust optical--UV SED model for SNe Ia (SALT3-UV) with the open-source model-training software $\\texttt{SALTshaker}$. We incorporate a spectroscopic UV data sample from HST, including 67 UV spectra from 18 nearby SNe Ia. Unlike previous training spectra, the HST spectra have sufficiently precise calibration that they do not require additional warping to match coincident photometric data. Additionally, while including this new SN Ia sample necessitates incorporating auxiliary photometric data from ZTF and ATLAS that have insufficient calibration for cosmological analyses, the improvements in the calibration of these data is anticipated in the near future. Compared to the previous SALT3-K21 model, the SALT3-UV model shows a significant improvement in the UV down to $2000\\mathring{\\text{A}}$, with over a threefold improvement in model uncertainty and a more physically accurate continuum and line features. We further evaluate potential redshift evolution in the UV template by separating the UV training sample into low- and high-$z$ subsamples. Our results reveal a non-negligible $\\gtrsim 0.05$ mag difference between low- and high-$z$ SALT3-UV models in the $g-$band at $z\\gtrsim0.5$ and the $u-$band at $z\\gtrsim0.2$. We demonstrate that, if confirmed, such evolution could lead to a few-percent bias in the measurement of $w$ if high-$z$ rest-frame UV data are included in future cosmological surveys such as LSST and $\\textit{Roman}$.\n\n", "2512.24918": "2025-12-31, **Cosmological dynamics and observational constraints of an interacting early scalar field coupled to radiation**, Dorian Araya et.al., [2512.24918v1](http://arxiv.org/abs/2512.24918v1)\n\n We study the cosmic evolution of an interacting scalar field radiation model, in which a minimally coupled scalar field exchanges energy with the radiation sector through an exponential coupling. Extending previous formulations, a non-relativistic matter component is included explicitly, which allows a self consistent description of cosmological dynamics from the radiation-dominated era to late-time acceleration. Analytical expressions for the background expansion are derived and characterized using kinematic diagnostics. We constrain the model using observational Hubble data, Type Ia Supernovae, baryon acoustic oscillations (including DESI DR2), and compressed cosmic microwave background distance information, performing a Bayesian MCMC analysis. The interaction parameter is found to be consistent with zero, though small deviations from standard radiation scaling are allowed. These deviations can partially alleviate the Hubble tension by modifying the sound horizon, but this is accompanied by correlated shifts in the matter density. The reconstructed expansion history remains close to LCDM at late times. Model comparison suggest that the interacting scenario is statistically competitive but not decisively preferred by current background data.\n\n", "2512.24677": "2025-12-31, **Destruction of the interstellar dust by a supernova**, Evgenii O. Vasiliev et.al., [2512.24677v1](http://arxiv.org/abs/2512.24677v1)\n\n Destruction of the interstellar dust proceeds primary behind supernova shocks. The previous estimates of the mass of the interstellar dust destroyed in the SN remnant do not take into account the physical properties of the ambient medium. Here we consider how some parameters, i.e. gas density and metallicity, can influence the destruction of the interstellar dust. We show that there are two regimes of the interstellar dust grains destruction in SN remnants: rapid and almost complete in compact low-mass SN remnants expanding in dense medium, and gradual and weak destruction in massive remnants evolving in the low-dense environment. When time for thermal sputtering is close to the dynamical one, i.e. to the SN remnant age, the mass of the interstellar dust destroyed in the SN remnant reaches its maximum value. We find that change of the ambient gas density results in the reduction of the dust mass logarithmically. We argue that dust cooling suppresses the interstellar dust destruction up to a factor of 1.6 by mass. This factor decreases for higher density of the ambient medium. We found that the dust mass depends linearly on gas metallicity as ${\\rm log}~M\\_d \\sim {\\rm [Z/H]}$ or, in other words, on the dust-to-gas ratio as $M\\_d \\sim ζ\\_d$. In turn, the destruction efficiency is higher in low-metallicity environments due to relatively longer adiabatic phase. We point out that the mass of the interstellar dust destroyed per one SN in a high density environment of the high star formation regions like in local ultraluminous infrared and high-redshift massive galaxies is about several times smaller than that in the Milky Way diffuse medium.\n\n", "2512.24670": "2025-12-31, **Dust destruction in bubbles driven by multiple supernovae explosions**, Evgenii O. Vasiliev et.al., [2512.24670v1](http://arxiv.org/abs/2512.24670v1)\n\n Dust lifetime derived from an isolated supernova (SN) evolution in the interstellar medium is known to be an order of magnitude shorter than the time needed to replenish dust mass by its production in various Galactic sources. We show, using 3-D numerical hydrodynamical simulations, that destruction of dust in the case of multiple SNe in a star cluster is markedly different from that in an isolated SN. We find that the mass of dust destroyed in the bubble does not grow for a considerable time, while SNe continue to explode. This regime is attained at saturation timescale, which is proportional to SNe rate in cluster. We show that the mass of dust destroyed in bubble per SN decreases for higher SN rate. Thus, the destruction efficiency -- defined as the ratio of the the total mass of dust destroyed by clustered SNe to that destroyed by the same number of isolated SNe -- in bubbles evolved in a homogeneous medium drops for massive clusters, e.g. around clusters with $M\\_\\ast > 4\\times 10^4 M\\_\\odot$ it is less $0.4$\\%. For lower mass clusters, the efficiency is proportional to the average time delay between SNe. We found that each cluster with $M\\_\\ast < 4\\times 10^4 M\\_\\odot$ destroys the same mass of dust as a single isolated SN. In a clumpy medium in bubbles formed around clusters with $M\\_\\ast \\sim 4\\times 10^4 M\\_\\odot$ and up to 4 times around $M\\_\\ast \\sim 8\\times 10^5 M\\_\\odot$. We argue that the interstellar dust swept up by multiple SNe almost completely survives in the shells of bubbles around such massive clusters. Therefore, the destruction of the interstellar dust is controlled by SNe in low-mass clusters. We point out that the interstellar dust lifetime for a given SN rate is at least a factor $\\sim 10$ longer as compared to the estimates derived from an isolated SN. (abridged)\n\n", "2512.24425": "2025-12-30, **Turbulence-Driven Corrugation of Collisionless Fast-Magnetosonic Shocks**, Immanuel Christopher Jebaraj et.al., [2512.24425v1](http://arxiv.org/abs/2512.24425v1)\n\n Collisionless fast-magnetosonic shocks are often treated as smooth, planar boundaries, yet observations point to organized corrugation of the shock surface. A plausible driver is upstream turbulence. Broadband fluctuations arriving at the front can continually wrinkle it, changing the local shock geometry and, in turn, conditions for particle injection and radiation. We develop a linear-MHD formulation that treats the shock as a moving interface rather than a fixed boundary. In this approach the shock response can be summarized by an effective impedance determined by the Rankine-Hugoniot base state and the shock geometry, while the upstream turbulence enters only through its statistics. This provides a practical mapping from an assumed incident spectrum to the corrugation amplitude, its drift along the surface, and a coherence scale set by weak damping or leakage. The response is largest when the transmitted downstream fast mode propagates nearly parallel to the shock in the shock frame, which produces a Lorentzian-type enhancement controlled by the downstream normal group speed. We examine how compression, plasma $β$, and obliquity affect these corrugation properties and discuss implications for fine structure in heliospheric and supernova-remnant shock emission.\n\n", "2512.24388": "2025-12-30, **A closer look at the young stellar group around Sh 2-295**, João Victor Corrêa-Rodrigues et.al., [2512.24388v1](http://arxiv.org/abs/2512.24388v1)\n\n Star formation is governed by multiple physical processes, making it inherently complicated. One excellent example is the Canis Major OB1/R1 Association, whose complex history of star formation is related to different episodes. Three supernova (SN) events potentially altered the environment and impacted star formation and stellar evolution. Prior investigations revealed two stellar groups of different ages associated with GU CMa and Z CMa. This work focusses on identifying the low-mass young stellar population near FZ CMa, located between these two groups and spatially related to the H II region Sh 2-295. Our main goal is to verify whether this group is age-mixed and characterise its physical properties. We analysed multi-object spectroscopic data acquired with Gemini/GMOS to search for typical features of T Tauri stars (TTs) and to determine their spectral types. Lithium absorption line ($λ$ 6708 $\\mathring{A}$) was used as a youth indicator, while H$α$ emission was investigated to probe accretion activity. We also derived ages based on optical photometry from Gaia DR3 and compared the projected spatial distribution to diffuse infrared (IR) emission. We identified 29 TTs, including six new members of the association and three Classical TTs (CTTs). The equivalent width of the Li I absorption line suggests an age of $8.1^{+2.1}\\_{-3.8}$ Myr, while optical photometric data indicate stellar ages ranging from $\\sim$1 to 14 Myr. Younger stars are concentrated around Sh 2-295, whereas the older ones are more widely dispersed. We increased the number of known TTs related to the CMa association. Our results support a scenario of multiple star-formation episodes, including a younger group that may have been triggered by the expansion of Sh 2-295. The influence of SN events appears limited in this context.\n\n", "2512.24203": "2025-12-30, **Abundance Stratification in Type Iax SN 2020rea with TARDIS**, Sohini Kayal et.al., [2512.24203v1](http://arxiv.org/abs/2512.24203v1)\n\n Using the 1D Monte Carlo-based radiative transfer code TARDIS, we investigate the spectral evolution of the Type Iax supernova (SN) 2020rea from -7 days before to +21 days after maximum light. Our best-fit models indicate stratified, velocity-dependent abundances at early times, successfully reproducing most observed spectral features. As the SN evolves, the ejecta transition from a layered to a more homogeneous composition, posing an alternative to pure deflagration models that predict fully mixed ejecta. These results highlight the need for further investigation, as current pure deflagration models cannot fully explain the origin or spectral properties of Type Iax SNe like SN 2020rea.\n\n"}}