{"neutrino": {"2406.11981": "2024-06-17, **Quiescent black hole X-ray binaries as multi-messenger sources**, Dimitrios Kantzas et.al., [2406.11981v1](http://arxiv.org/abs/2406.11981v1)\n\n Galactic cosmic rays (CRs) are of unknown origin, even though they have traditionally been connected to supernovae due to energetic arguments. In the last decades, Galactic black holes in X-ray binaries (BHXBs) have been proposed as candidate sources of CRs revising the CR paradigm. BHXBs launch two relativistic jets during outbursts, but recent observations suggest that such jets may be launched even during quiescence. A0620-00 is such a well-studied object that shows hints of jet emission. In this work, we study the simultaneous radio-to-X-ray spectrum detected from this source while in quiescence to better constrain the jet dynamics. Given that the majority of BHXBs spend their lifetime in quiescence (qBHXBs), we use the jet dynamics of A0620-00 to study a population of 100000 such sources distributed throughout the Galactic disc, and a further 10000 located in the Boxy Bulge around the Galactic centre. While the contribution to the CR spectrum is suppressed, we find that the cumulative intrinsic emission of qBHXBs from both the Boxy Bulge and the Galactic disc adds to the diffuse emission that various facilities detect from radio to TeV gamma rays. We examine the contribution of qBHXBs to the Galactic diffuse emission and investigate the possibility of SKA, INTEGRAL and CTAO to detect individual sources in the future. Finally, we compare the predicted neutrino flux to the recently presented Galactic diffuse neutrino emission by IceCube.\n\n", "2406.11956": "2024-06-17, **Weyl-invariant Einstein-Cartan gravity: unifying the strong CP and hierarchy puzzles**, Georgios K. Karananas et.al., [2406.11956v1](http://arxiv.org/abs/2406.11956v1)\n\n We show that the minimal Weyl-invariant Einstein-Cartan gravity in combination with the Standard Model of particle physics contains just one extra scalar degree of freedom (in addition to the graviton and the Standard Model fields) with the properties of an axion-like particle which can solve the strong CP-problem. The smallness of this particle's mass as well as of the cosmological constant is ensured by tiny values of the gauge coupling constants of the local Lorentz group. The tree value of the Higgs boson mass and that of Majorana leptons (if added to the Standard Model to solve the neutrino mass, baryogenesis and dark matter problems) are very small or vanishing, opening the possibility of their computability in terms of the fundamental parameters of the theory due to nonperturbative effects.\n\n", "2406.11438": "2024-06-17, **Search for Majorana Neutrinos with the Complete KamLAND-Zen Dataset**, S. Abe et.al., [2406.11438v1](http://arxiv.org/abs/2406.11438v1)\n\n We present a search for neutrinoless double-beta ($0\\nu\\beta\\beta$) decay of $^{136}$Xe using the full KamLAND-Zen 800 dataset with 745 kg of enriched xenon, corresponding to an exposure of $2.097$ ton yr of $^{136}$Xe. This updated search benefits from a more than twofold increase in exposure, recovery of photo-sensor gain, and reduced background from muon-induced spallation of xenon. Combining with the search in the previous KamLAND-Zen phase, we obtain a lower limit for the $0\\nu\\beta\\beta$ decay half-life of $T\\_{1/2}^{0\\nu} > 3.8 \\times 10^{26}$ yr at 90% C.L., a factor of 1.7 improvement over the previous limit. The corresponding upper limits on the effective Majorana neutrino mass are in the range 28-122 meV using phenomenological nuclear matrix element calculations.\n\n", "2406.11382": "2024-06-17, **Baryon-number-violating nucleon decays in ALP effective field theories**, Tong Li et.al., [2406.11382v1](http://arxiv.org/abs/2406.11382v1)\n\n The search for baryon-number-violating (BNV) nucleon decay is an intriguing probe of new physics beyond the SM in future neutrino experiments with enhanced sensitivity. The dark sector states such as an axion or axion-like particle (ALP) can induce nucleon decays with distinct signature and kinematics from the conventional nucleon decays. In this work, we study the ALP effective field theories (EFTs) with baryon number violation and the impact of light ALP on BNV nucleon decays. We revisit the dimension-8 BNV operators in the extended EFTs with an ALP field $a$ respecting shift symmetry. The low-energy EFT operators with $\\|\\Delta (B-L)\\|=2$ and $\\|\\Delta (B-L)\\|=0$ are matched to the baryon chiral perturbation theory. We obtain the effective chiral Lagrangian and the BNV interactions between ALP and baryons/mesons. The ALP interactions lead to two-body baryon decays $B\\to \\ell~({\\rm or}~\\nu)~a$ and three-body nucleon decays $N\\to M~\\ell~({\\rm or}~\\nu)~a$. We obtain the constraints on the UV scale from the invisible $\\Lambda^0$ decay search at BESIII, the invisible neutron decay search at KamLAND and proton decay search at Super-K. We also show the projections of some other baryon/nucleon decays and present the distinct distributions of kinematic observable.\n\n"}, "dark matter": {"2406.12797": "2024-06-18, **Dark Photon Dark Matter Radio Signal from the Milky Way Electron Density**, Ariel Arza et.al., [2406.12797v1](http://arxiv.org/abs/2406.12797v1)\n\n We consider Thomson-like processes between dark matter dark photons and free electrons in the Milky Way. The result is a radio signal background that can be detectable with current or future radio telescope arrays. In particular, we computed sensitivity prospects for the Atacama Large Millimeter Array (ALMA) radio telescope and for the future Square Kilometer Array (SKA), concluding that unconstrained parameter space in a wide range of dark photon masses can be probed.\n\n", "2406.12724": "2024-06-18, **Viscous Unified Dark Matter Models Under Scrutiny: Uncovering Inconsistencies from Dynamical System Analysis**, Guillermo Palma et.al., [2406.12724v1](http://arxiv.org/abs/2406.12724v1)\n\n Viscous unified dark matter models aim to describe the dark sector of the Universe, as the dark matter fluid itself gives rise to an accelerated expansion due to a negative bulk viscous pressure. However, in most studies, radiation is often disregarded as a minor factor in dynamical system analyses, overlooking whether radiation domination is achievable. In this paper, we rigorously examine this critical aspect for common parameterizations of bulk viscosity, denoted as $\\xi$, within two general classes of viscous unified models. Our findings reveal significant inconsistencies in models where $\\xi \\propto H^{1-2s} \\rho\\_{m}^{s}$ with $s\\leq 0$, and surprisingly, in models where $\\xi \\propto \\rho\\_{m}^{s}$ with exponents $s<0$, as they both fail to produce a radiation-dominated era. Moreover, the exponent $s$ must lye within the interval $0 \\leq s < 1/2$ for the latter model to correctly describes the cosmological evolution. These results underscore the need of including these constraints as a prior in statistical analyses of observational data, with implications for current statistical inferences for the second model, where both prior and best-fit values of $s$ often fall outside the acceptable range.\n\n", "2406.12554": "2024-06-18, **Populating secluded dark sector with ultra-relativistic bubbles**, Aleksandr Azatov et.al., [2406.12554v1](http://arxiv.org/abs/2406.12554v1)\n\n We study Dark Matter production during first order phase transitions from bubble-plasma collisions. We focus on scenarios where the Dark Matter sector is secluded and its interaction with the visible sector (including the Standard Model) originates from dimension-five and dimension-six operators. We find that such DM is generally heavy and has a large initial velocity, leading to the possibility of DM being warm today. We differentiate between the cases of weakly and strongly coupled dark sectors, where, in the latter case, we focus on glueball DM, which turns out to have very distinct phenomenological properties. We also systematically compute the Freeze-In production of the dark sector and compare it with the bubble-plasma DM abundances.\n\n", "2406.12532": "2024-06-18, **Magnetic field and kinetic helicity evolution in simulations of interacting disk galaxies**, Simon Selg et.al., [2406.12532v1](http://arxiv.org/abs/2406.12532v1)\n\n We carry out a parameter study of interacting disk galaxies with impact parameters ranging from central collisions to weakly interacting scenarios. The orientations of the disks are also varied. In particular, we investigate how magnetic field amplification depends on the these parameters. We use magnetohydrodynamics for gas disks in combination with live dark matter halos in adaptive mesh refinement simulations. The disks are initialized using a setup for isolated disks in hydrostatic equilibrium. Small-scale filtering of the velocity and magnetic field allows us to estimate the turbulent electromotive force (EMF) and kinetic helicity. Time series of the average magnetic field in central and outer disk regions show pronounced peaks during close encounters and mergers. This agrees with observed magnetic fields at different interaction stages. The central field strength exceeds 10 microgauss (corresponding to an amplification factor of 2 to 3) for small impact parameters. As the disks are increasingly disrupted and turbulence is produced by tidal forces, the small-scale EMF reaches a significant fraction of the total EMF. The small-scale kinetic helicity is initially antisymmetric across the disk plane. Albeit its evolution is sensitive to both the impact parameter and inclinations of the rotation axes with respect to the relative motion of the disks, antisymmetry is generally broken through interactions and the merger remnant has lost most of the initial helicity. The EMF and the magnetic field also decay rapidly after coalescence. The strong amplification during close encounters of the interacting galaxies are mostly driven by helical flows and a mean-field dynamo. The small-scale dynamo contributes significantly in post-interaction phases. However, the amplification of the magnetic field cannot be sustained.\n\n", "2406.12518": "2024-06-18, **Primordial Black Holes and Gravitational Waves in the $U(1)_{B-L}$ Extended Inert Doublet Model: A First-Order Phase Transition Perspective**, Indra Kumar Banerjee et.al., [2406.12518v1](http://arxiv.org/abs/2406.12518v1)\n\n We conduct an analysis of a $U(1)\\_{B-L}$ extended inert doublet model and obtained the parameter space allowing strong first order phase transitions. We show that a large part of the parameter space can cause double first-order phase transitions. Whereas both of these phase transitions can generate a detectable stochastic gravitational wave background, one of them can create primordial black holes with appreciable abundance. The primordial black holes generated at the high scale transition can account for the dark matter maintaining the correct relic abundance. We also show specific benchmark cases and their consequences from the aspect of primordial black holes and gravitational waves.\n\n", "2406.12483": "2024-06-18, **Spin-independent interactions of Dirac Fermionic Dark Matter in the composite Higgs models**, M. G. Belyakova et.al., [2406.12483v1](http://arxiv.org/abs/2406.12483v1)\n\n According to recent measurements, dark matter magnetic dipole moment is strongly constrained. In the composite Higgs models the magnetic dipole moment of the Dirac dark matter fermion and its mass can be suppressed by the approximate U(1) symmetry. We consider E\\_6 inspired composite Higgs model (E\\_6CHM) with U(1) symmetry violating operators, which give rise to dark matter's mass and coupling constant to Higgs boson. The dependence of the spin-independent dark matter-nucleon scattering cross section on the E\\_6CHM parameters is explored. We argue that there are regions of the parameter space which are still safe from all current constraints and may lead to spectacular LHC signatures.\n\n", "2406.12281": "2024-06-18, **Projected gravitational wave constraints on primordial black hole abundance for extended mass distributions**, Gabriel Luis Dizon et.al., [2406.12281v1](http://arxiv.org/abs/2406.12281v1)\n\n We investigate the projected minimum constraints set by next-generation gravitational wave detectors Einstein Telescope and LISA on the abundance of primordial black holes relative to dark matter for extended primordial black hole mass distributions. We consider broad power law distributions for a range of negative and positive exponents $\\gamma$ and use the IMRPhenomXAS waveforms to simulate binary sources up to mass ratios $q = 1000$ and redshifts $z=300$. Our results show that power law mass distributions loosen the $f\\_\\mathrm{PBH}$ constraint for increasing power law exponents, suggesting that extended distributions do not help in evading existing constraints. Interestingly, very negative values of $\\gamma$ yield constraints close to ones derived from a monochromatic distribution.\n\n", "2406.12122": "2024-06-17, **The Glow of Axion Quark Nugget Dark Matter: (I) Large Scale Structures**, Fereshteh Majidi et.al., [2406.12122v1](http://arxiv.org/abs/2406.12122v1)\n\n Axion quark nuggets (AQNs) are hypothetical objects with a mass greater than a few grams and sub-micrometer size, formed during the quark-hadron transition. Originating from the axion field, they offer a possible resolution of the similarity between visible and dark components of the Universe. These composite objects behave as cold dark matter, interacting with ordinary matter and resulting in pervasive electromagnetic radiation throughout the Universe. This work aims to predict the electromagnetic signature in large-scale structures from the AQN-baryon interaction, accounting for thermal and non-thermal radiations. We use Magneticum hydrodynamical simulations to describe the distribution and dynamics of gas and dark matter at cosmological scales. We calculate the electromagnetic signature from radio, starting at $\\nu \\sim$ 1 GHz, up to a few keV X-ray energies. We find that the AQNs signature is characterized by monopole and fluctuation signals. The amplitude of both signals strongly depends on the average AQN mass and the ionization level of the baryonic environment. We identify a most optimistic scenario with a signal often near the sensitivity limit of existing instruments, such as FIRAS and the South Pole Telescope for high-resolution. Fluctuations in the Extra-galactic Background Light caused by the AQN can be tested with space-based imagers Euclid and James Webb Space Telescope. We also identify a minimal configuration, still out of reach of existing instruments, but future experiments might be able to pose constraints on the AQN model. We conclude that this is a viable dark matter model, which does not violate the canons of cosmology, nor existing observations. The best chances for testing this model reside in 1) ultra-deep IR and optical surveys, 2) spectral distorsions of the CMB and 3) low-frequency (1 GHz < $\\nu $ < 100 GHz) and high-resolution ($\\ell > 10^4$) observations.\n\n", "2406.12106": "2024-06-17, **Challenges to the Lambda CDM Cosmology**, George Efstathiou et.al., [2406.12106v1](http://arxiv.org/abs/2406.12106v1)\n\n Observations of the cosmic microwave backgroundradiation are described to remarkable accuracy by the six-parameterLambda CDM cosmology. However, the key ingredients of this model, namely dark matter, dark energy and cosmic inflation are not understood at a fundamental level. It is therefore important to investigate tensions between the CMB and other cosmological probes. I will review aspects of tensions with direct measurements of the Hubble constant H\\_0, measurements of weak gravitational lensing, and the recent hints of evolving dark energy reported by the Dark Energy Spectroscopic Instrument (DESI) collaboration.\n\n", "2406.11989": "2024-06-17, **Advancing Stellar Streams as a Dark Matter Probe -- I: Evolution of the CDM subhalo population**, Paul Menker et.al., [2406.11989v1](http://arxiv.org/abs/2406.11989v1)\n\n Stellar streams, long thin streams of stars, have been used as sensitive probes of dark matter substructure for over two decades. Gravitational interactions between dark matter substructures and streams lead to the formation of low density \"gaps\" in streams, with any given stream typically containing no more than a few such gaps. Prior models for the statistics of such gaps have relied on several simplifying assumptions for the properties of the subhalo population in the cold dark matter scenario. With the expected forthcoming increase in the number of streams, and gaps, observed, in this work we develop a more detailed model for the statistics of subhalos interacting with streams, and test some of the assumptions made in prior works. Instead of using simple fits to N-body estimates of subhalo population statistics at z = 0 as in previous work, we make use of realizations of time-dependent subhalo populations generated from a fully physical model, incorporating structure formation, and subhalo orbital evolution, including tidal heating and stripping physics, which has been carefully calibrated to match results of cosmological N-body simulations. We find that this model predicts up to 60% more gaps on average in Pal-5-like streams than prior works.\n\n", "2406.11987": "2024-06-17, **The Nearly Universal Disk Galaxy Rotation Curve**, Raj Patel et.al., [2406.11987v1](http://arxiv.org/abs/2406.11987v1)\n\n The Universal Rotation Curve (URC) of disk galaxies was originally proposed to predict the shape and amplitude of any rotation curve (RC) based solely on photometric data. Here, the URC is investigated with an extensive set of spatially-resolved rotation curves drawn from the PROBES-I, PROBES-II, and MaNGA data bases with matching multi-band surface brightness profiles from the DESI-LIS and WISE surveys for 3,846 disk galaxies. Common URC formulations fail to achieve an adequate level of accuracy to qualify as truly universal over fully sampled RCs. We develop neural network (NN) equivalents for the proposed URCs which predict RCs with higher accuracy, showing that URC inaccuracies are not due to insufficient data but rather non-optimal formulations or sampling effects. This conclusion remains even if the total RC sample is pruned for symmetry. The latest URC prescriptions and their NN equivalents trained on our sub-sample of 579 disk galaxies with symmetric RCs perform similarly to the URC/NN trained on the complete data sample. We conclude that a URC with an acceptable level of accuracy ($\\Delta V\\_{\\rm circ} \\lesssim15$ per cent) at all radii would require a detailed modelling of a galaxy's central regions and outskirts (e.g., for baryonic effects leading to contraction or expansion of any dark-matter-only halo).\n\n", "2406.11963": "2024-06-17, **Lepton Collider as a window to Reheating**, Basabendu Barman et.al., [2406.11963v1](http://arxiv.org/abs/2406.11963v1)\n\n We propose a search strategy for MeV-scale feebly interacting massive particle (FIMP) dark matter (DM) at the $e^+e^-$ collider. We argue, detection of a mono-$\\gamma$ signal plus missing energy can indicate to an MeV-scale reheating temperature of the Universe, after addressing observed DM abundance and other relevant constraints.\n\n", "2406.11949": "2024-06-17, **Refining Galactic primordial black hole evaporation constraints**, Pedro De la Torre Luque et.al., [2406.11949v1](http://arxiv.org/abs/2406.11949v1)\n\n We revisit the role of primordial black holes (PBHs) as potential dark matter (DM) candidates, particularly focusing on light asteroid-mass PBHs. These PBHs are expected to emit particles through Hawking evaporation that can generate cosmic rays (CRs), eventually producing other secondary radiations through their propagation in the Milky Way, in addition to prompt emissions. Here, we perform a comprehensive analysis of CR signals resulting from PBH evaporation, incorporating the full CR transport to account for reacceleration and diffusion effects within the Milky Way. In particular, we revisit the $e^\\pm$ flux produced by PBHs, using Voyager 1, and study for the first time the diffuse X-ray emission from the up-scattering of Galactic ambient photons due to PBH-produced $e^\\pm$ via the inverse Compton effect using XMM-Newton data, as well as the morphological information of the diffuse 511 keV line measured by INTEGRAL/SPI. In doing so, we provide leading constraints on the fraction of DM that can be in form of PBHs in a conservative way, whilst also testing how different assumptions on spin and mass distributions affect our conclusions.\n\n", "2406.11609": "2024-06-17, **Single-epoch and Differential Astrometric Microlensing of Quasars**, R. Forés-Toribio et.al., [2406.11609v1](http://arxiv.org/abs/2406.11609v1)\n\n We propose and discuss a new experimental approach to measure the centroid shift induced by gravitational microlensing in the images of lensed quasars (astrometric microlensing). Our strategy is based on taking the photocenter of a region in the quasar large enough as to be insensitive to microlensing as reference to measure the centroid displacement of the continuum. In this way, single-epoch measurements of astrometric microlensing can be performed. Using numerical simulations, we show that, indeed, the centroid shift monotonically decreases as the size of the emitting region increases, and only for relatively large regions, like the broad line region (BLR), does the centroid shift become negligible. This opens interesting possibilities to study the stratification of the different emitters in the accretion disk and the BLR. We estimate the amplitude of the centroid shifts for 79 gravitationally lensed images and study more thoroughly the special cases Q2237+030 A, RXJ1131-1231 A, PG1115+080 A2 and SDSS J1004+4112 A. We propose to use spectro-astrometry to simultaneously obtain the photocenters of the continuum and of different emission line regions since, with the precision of forthcoming instruments, astrometric microlensing by $\\sim 1 M\\_\\odot$ mass microlenses may be detected in many quasar lensed images. When we consider more massive micro/millilenses, $M\\gtrsim 10 M\\_\\odot$, often proposed as the constituents of dark matter, the BLR becomes sensitive to microlensing and can no longer be used as a positional reference to measure centroid shifts. Differential microlensing between the images of a lensed quasar along several epochs should be used instead.\n\n", "2406.11417": "2024-06-17, **Primordial black hole formation during cosmic phase transitions**, Karsten Jedamzik et.al., [2406.11417v1](http://arxiv.org/abs/2406.11417v1)\n\n Primordial black holes (PBHs) may be part of the dark matter. It is shown here that PBHs form more easily during cosmic phase transitions. For approximately scale-invariant primordial curvature fluctuations the PBH mass function may therefore leave a record of the thermal history of the early Universe. In particular a peak is expected on the 1.9 solar mass scale due to the cosmic QCD transition.\n\n"}, "supernova": {"2406.12682": "2024-06-18, **The Impact of Stellar Radiative Feedback on Formation of Young Massive Clusters via Fast HI Gas Collisions**, Ryunosuke Maeda et.al., [2406.12682v1](http://arxiv.org/abs/2406.12682v1)\n\n Young massive clusters (YMCs) are dense aggregates of young stars and are often speculated as potential precursors to globular clusters. However, the formation mechanism of massive and compact gas clumps that precede YMCs remains unknown. In this paper, we study the formation of such massive clumps via fast HI gas collisions (~100 km/s) as suggested by recent observations and their subsequent evolution into YMCs by using three-dimensional magnetohydrodynamics simulations involving self-gravity and detailed thermal/chemical processes. In particular, the impact of ionization feedback from stellar radiation is included in an approximate fashion where the temperature within the HII regions is elevated to 10,000 K, while supernova feedback is not included. We examine whether the resulting massive clumps can survive this ionization feedback and evolve into YMCs. Our simulations reveal the emergence of gas clumps that do not only possess substantial mass (~10^5 M\\_sun) but also sufficient compactness (~5 pc). Notably, these clumps exhibit significantly higher escape velocities compared to the sound speed of the HII region, indicating effective gravitational retention of gas against feedback-induced evaporation. Consequently, these conditions foster efficient star formation within the massive gas clumps, ultimately leading to their evolution into YMCs. We also perform simulations involving lower-velocity gas collisions, approximately 15 km/s, typical shock velocities induced by galactic superbubbles.\n\n", "2406.12472": "2024-06-18, **Merger Precursor: Year-long Transients Preceding Mergers of Low-mass Stripped Stars with Compact Objects**, Daichi Tsuna et.al., [2406.12472v1](http://arxiv.org/abs/2406.12472v1)\n\n Binary mass transfer can occur at high rates due to rapid expansion of the donor's envelope. In the case where mass transfer is unstable, the binary can rapidly shrink its orbit and lead to a merger. In this work we consider the appearance of the system preceding merger, specifically for the case of a low-mass ($\\approx 2.5$-$3~M\\_\\odot$) helium star with a neutron star (NS) companion. Modeling the mass transfer history as well as the wind launched by super-Eddington accretion onto the NS, we find that such systems can power slowly rising transients with timescales as long as years, and luminosities of $\\sim 10^{40}$-$10^{41}$ erg s$^{-1}$ from optical to UV. The final explosion following the merger (or core-collapse of the helium star in some cases) leads to an interaction-powered transient with properties resembling Type Ibn supernovae (SNe), possibly with a bright early peak powered by shock cooling emission for merger-powered explosions. We apply our model to the Type Ibn SN 2023fyq, that displayed a long-term precursor activity from years before the terminal explosion.\n\n", "2406.11691": "2024-06-17, **A search for the fine-structure constant evolution from fast radio bursts and type Ia supernovae data**, Thais Lemos et.al., [2406.11691v1](http://arxiv.org/abs/2406.11691v1)\n\n The search for a space-time variation of the fundamental constants has been explored over the years to test our physical theories. In this paper, we use the dispersion measure ($DM$) of fast radio bursts (FRB) combined with type Ia supernovae (SNe) data to investigate a possible redshift evolution of the fine-structure constant ($\\alpha$), considering the runaway dilaton scenario, which predicts $\\frac{\\Delta \\alpha}{\\alpha} = - \\gamma\\ln{(1+z)}$, where $\\gamma$ is a constant proportional to the current value of the coupling between the dilaton field and hadronic matter. We derive all the relevant expressions for the $DM$ dependence concerning the fine-structure constant and constrain the parameter $\\gamma$ from measurements of 17 well-localized FRBs and 1048 SNe data from the Pantheon compilation. We also use Monte Carlo simulations to forecast the constraining power of larger samples of FRB measurements for data sets with $N = 500$ and $N = 1000$ points. We found that the uncertainty on $\\gamma$ can be improved by one order of magnitude and that limits on $\\frac{\\Delta \\alpha}{\\alpha}$ beyond $\\sigma \\sim 10^{-2}$ will depend crucially on better control of statistical and systematic uncertainties of upcoming FRB data.\n\n", "2406.11680": "2024-06-17, **ZTF SN Ia DR2: Exploring SN Ia properties in the vicinity of under-dense environments**, M. Aubert et.al., [2406.11680v1](http://arxiv.org/abs/2406.11680v1)\n\n The unprecedented statistics of detected Type Ia supernovae (SNe Ia) brought by the Zwicky Transient Facility enables us to probe the impact of the Large-Scale Structure on the properties of these objects. The goal of this paper is to explore the possible impact of the under-dense part of the large-scale structure on the intrinsic SALT2 light curve properties of SNe Ia and uncover possible biases in SN Ia analyses. With a volume-limited selection of ZTF-Cosmo-DR2 Type Ia supernovae overlapping with the SDSS-DR7 survey footprint, we investigate the distribution of their properties with regard to voids detected in the SDSS-DR7 galaxy sample. We further use Voronoi volumes as proxy for local density environments within the large-scale structure. We find a moderate dependency of the stretch toward the localisation around the void centre and none when considering colour. The local Voronoi volumes mostly affect the fraction of low/high stretch supernovae. With the current statistics available, we consider that the impact of high or low local density environment can be considered as a proxy for the colour of the host galaxy. Under-dense environments should not cause any biases in supernova analyses.\n\n", "2406.11539": "2024-06-17, **Origin of the strong sodium absorption of the lensed supernova 2016geu at z=0.4**, Christa Gall et.al., [2406.11539v1](http://arxiv.org/abs/2406.11539v1)\n\n The origin of strong sodium absorption, which has been observed for a few nearby Type Ia supernovae (SNe Ia), remains elusive. Here we analyse two high-signal-to-noise, intermediate-resolution VLT/X-shooter spectra at epochs $+$18 and $+$27 days past peak brightness of the strongly lensed and multiply-imaged Type Ia SN 2016geu which exploded at a redshift of $z = 0.4$. We show that SN 2016geu exhibits very strong, multiple Na I and Ca II absorption lines with a large total Na I D restframe equivalent width of 5.2 $\\pm$ 0.2 A, among the highest ever detected for a SN Ia and similar to only a handful of nearby SNe Ia with extraordinary large Na I D EWs. The absorption system is time-invariant and extends over a large velocity span $\\sim$ 250 km s$^{-1}$. The majority of the absorption is blueshifted relative to the strongest component, while there are both blueshifted and redshifted components relative to the systemic redshift of the galaxy. The column density ratios and widths of the absorption lines indicate that the absorption likely arises from a combination of interstellar dusty molecular clouds and circumgalactic in- and outflowing material, rather than circumstellar matter around the SN.\n\n", "2406.11155": "2024-06-17, **On the limitations of H alpha luminosity as a star formation tracer in spatially resolved observations**, Zipeng Hu et.al., [2406.11155v1](http://arxiv.org/abs/2406.11155v1)\n\n This study examines the limitations of H$\\alpha$ luminosity as a tracer of star formation rates (SFR) in spatially resolved observations. We carry out high-resolution simulations of a Milky Way-like galaxy including both supernova and photoionization feedback, and from these we generate synthetic H$\\alpha$ emission maps that we compare to maps of the true distribution of young stellar objects (YSOs) on scales from whole-galaxy to individual molecular clouds ($\\lesssim 100$ pc). Our results reveal significant spatial mismatches between H$\\alpha$ and true YSO maps on sub-100 pc scales, primarily due to ionizing photon leakage, with a secondary contribution from young stars drifting away from their parent molecular clouds. On small scales these effect contribute significantly to the observed anti-correlation between gas and star formation, such that there is noticeably less anti-correlation if we replace an H$\\alpha$-based star formation map with a YSO-based one; this in turn implies that previous studies have underestimated the time it takes for young stars to disperse their parent molecular clouds. However, these effects are limited in dense regions with hydrogen columns $N\\_\\mathrm{H} > 3 \\times 10^{21}$ cm$^{-2}$, where the H$\\alpha$- and YSO-based SFR maps show better agreement. Based on this finding we propose a calibration model that can precisely measure the SFR of large molecular clouds (mean radius > 100 pc) with a combination of H$\\alpha$ and CO observations, which provides a foundation for future study of star formation processes in extragalactic molecular clouds.\n\n", "2406.11111": "2024-06-17, **No evidence for a dip in the binary black hole mass spectrum**, Christian Adamcewicz et.al., [2406.11111v1](http://arxiv.org/abs/2406.11111v1)\n\n Stellar models indicate that the core compactness of a star, which is a common proxy for its explodability in a supernova, does not increase monotonically with the star's mass. Rather, the core compactness dips sharply over a range of carbon-oxygen core masses; this range may be somewhat sensitive to the star's metallicity and evolutionary history. Stars in this compactness dip are expected to experience supernovae leaving behind neutron stars, whereas stars on either side of this range are expected to form black holes. This results in a hypothetical mass range in which black holes should seldom form. Quantitatively, when applied to binary stripped stars, these models predict a dearth of binary black holes with component masses $\\approx 10 M\\_\\odot - 15 M\\_\\odot$. The population of gravitational-wave signals indicates weak evidence for a dip in the distribution of chirp masses of merging binary black holes near $\\approx 10 M\\_\\odot - 12 M\\_\\odot$. This feature could be linked to the hypothetical component mass gap described above, but this interpretation depends on what assumptions are made of the binaries' mass ratios. Here, we directly probe the distribution of binary black hole component masses to look for evidence of a gap. We find no evidence for this feature using data from the third gravitational-wave transient catalogue (GWTC-3). If this gap does exist in nature, we find that it is unlikely to be resolvable by the end of the current (fourth) LIGO-Virgo-KAGRA (LVK) observing run.\n\n"}}