{"neutrino": {"2303.13441": "2023-03-23, **Lindhard integral equation with binding energy applied to light and charge yields of nuclear recoils in noble liquid detectors**, Y. Sarkis et.al., [2303.13441v1](http://arxiv.org/abs/2303.13441v1)\n\n We present a model of the ionization efficiency, or quenching factor, for low-energy nuclear recoils, based on a solution to Lindhard integral equation with binding energy and apply it to the calculation of the relative scintillation efficiency and charge yield for nuclear recoils in noble liquid detectors. The quenching model incorporates a constant average binding energy together with an electronic stopping power proportional to the ion velocity, and is an essential input in an analysis of charge recombination processes to predict the ionization and scintillation yields. Our results are comparable to NEST simulations of LXe and LAr and are in good agreement with available data. These studies are relevant to current and future experiments using noble liquids as targets for neutrino physics and the direct searches for dark matter.\n\n", "2303.13423": "2023-03-23, **CE$ν$NS Experiment Proposal at CSNS**, Chenguang Su et.al., [2303.13423v1](http://arxiv.org/abs/2303.13423v1)\n\n The detection and cross section measurement of Coherent Elastic Neutrino-Nucleus Scattering (CE$\\nu$NS) is vital for particle physics, astrophysics and nuclear physics. Therefore, a new CE$\\nu$NS detection experiment is proposed in China. Undoped CsI crystals coupled with two Photon Multiplier Tubes (PMTs) each, will be cooled down to 77K and placed at China Spallation Neutron Source (CSNS) to detect the CE$\\nu$NS signals produced by neutrinos from stopped pion decays happening within the Tungsten target of CSNS. Owing to the extremely high light yield of pure CsI at 77K, even though only having a neutrino flux 60\\% weaker than COHERENT, the detectable signal event rate is still expected to be $0.14/day/kg$. Low radioactivity materials and devices will be used to construct the detector and strong shielding will be applied to reduce the radioactive and neutron background. Dual-PMT readout should be able to reject PMT-related background like Cherenkov light and PMT dark noise. With all the strategies above, we are hoping to reach a 5.1$\\sigma$ signal detection significance by a half-year data taking with a $12kg$ CsI. In this presentation, the design of the experiment will be presented. In addition, the estimation of signal, various kinds of background and expected signal sensitivity will be discussed.\n\n", "2303.13383": "2023-03-23, **Zee-model predictions for lepton flavor violation**, Julian Heeck et.al., [2303.13383v1](http://arxiv.org/abs/2303.13383v1)\n\n The Zee model provides a simple model for one-loop Majorana neutrino masses. The new scalars can furthermore explain the long-standing deviation in the muon's magnetic moment and the recent CDF measurement of the $W$-boson mass. Together, these observations yield predictions for lepton flavor violating processes that are almost entirely testable in the near future. The remaining parameter space makes testable predictions for neutrino masses.\n\n", "2303.13070": "2023-03-23, **Development of proton beam irradiation system for the NA65/DsTau experiment**, Shigeki Aoki et.al., [2303.13070v1](http://arxiv.org/abs/2303.13070v1)\n\n Tau neutrino is the least studied lepton of the Standard Model (SM). The NA65/DsTau experiment targets to investigate $D\\_s$, the parent particle of the $\\nu\\_\\tau$, using the nuclear emulsion-based detector and to decrease the systematic uncertainty of $\\nu\\_\\tau$ flux prediction from over 50% to 10% for future beam dump experiments. In the experiment, the emulsion detectors are exposed to the CERN SPS 400 GeV proton beam. To provide optimal conditions for the reconstruction of interactions, the protons are required to be uniformly distributed over the detector's surface with an average density of $10^5~\\rm{cm^{-2}}$ and the fluctuation of less than 10%. To address this issue, we developed a new proton irradiation system called the target mover. The new target mover provided irradiation with a proton density of $0.98~\\rm{cm^{-2}}$ and the density fluctuation of $2.0\\pm 0.3$% in the DsTau 2021 run.\n\n", "2303.13025": "2023-03-23, **High-Energy Neutrino Fluxes from Hard-TeV BL Lacs**, E. Aguilar-Ruiz et.al., [2303.13025v1](http://arxiv.org/abs/2303.13025v1)\n\n Blazars have been pointed out as promising high-energy (HE) neutrinos sources, although the mechanism is still under debate. The blazars with a hard-TeV spectrum, which leptonic models can hardly explain, can be successfully interpreted in the hadronic scenarios. Recently, Aguilar et al. proposed a lepto-hadronic two-zone model to explain the multi-wavelength observations of the six best-known extreme BL Lacs and showed that the hadronic component could mainly interpret very-high-energy (VHE) emission. In this work, we apply this hadronic model to describe the VHE gamma-ray fluxes of 14 extreme BL Lacs and estimate the respective HE neutrino flux from charge-pion decay products. Finally, we compare our result with the diffuse flux observed by the IceCube telescope, showing that the neutrino fluxes from these objects are negligible.\n\n"}, "dark matter": {"2303.13353": "2023-03-23, **Flavor Probes of Axion Dark Matter**, Robert Ziegler et.al., [2303.13353v1](http://arxiv.org/abs/2303.13353v1)\n\n Standard Model extensions with light axions are well-motivated by the observed Dark Matter abundance and the Peccei-Quinn solution to the Strong CP Problem. In general such axions can have large flavor-violating couplings to SM fermions, which naturally arise in scenarios where the Peccei-Quinn symmetry also explains the hierarchical pattern of fermion masses and mixings. I will discuss how these couplings allow for efficient axion production from the decays of SM particles, giving the opportunity to probe flavored axion Dark Matter with precision flavor experiments, astrophysics and cosmology.\n\n", "2303.13339": "2023-03-23, **On the origin of extreme trans-Neptunian objects within Modified Newtonian Dynamics**, Cezary Migaszewski et.al., [2303.13339v1](http://arxiv.org/abs/2303.13339v1)\n\n In this work, we investigate the dynamical origin of extreme trans-Neptunian objects (ETNOs) under the action of the External Field Effect (EFE), which is a consequence of Modified Newtonian Dynamics (MOND) applied to gravity around the Sun embedded in the gravitational field of the Galaxy. We perform N-body integrations of known ETNOs treated as massless particles and perturbed by four giant planets and EFE. Backward integrations show that these objects originated in the giant planet region, from where they were scattered and then evolved to their current orbits. A striking example of such evolution is Sedna, which may have been temporarily in a horseshoe orbit with Jupiter and Saturn only $30$~Myr ago. Another interesting example is the newly discovered retrograde ETNOs, whose dynamical connection with prograde ETNOs and Centaurs is shown. The EFE is considered as an alternative to Planet Nine in explaining the anomalous distribution of ETNO orbits, namely the orbital plane clustering and apsidal confinement. We also analyse the effect of MOND on the obliquity of the solar spin with respect to the invariant plane of the solar system. Finally, we discuss the significance of trans-Neptunian solar system in the context of the dark matter hypothesis.\n\n", "2303.13180": "2023-03-23, **Prospective Dark Matter Annihilation Signals From the Sagittarius Dwarf Spheroidal**, Thomas A. A. Venville et.al., [2303.13180v1](http://arxiv.org/abs/2303.13180v1)\n\n The Sagittarius Dwarf Spheroidal galaxy (Sgr) is investigated as a target for DM annihilation searches utilizing J-factor distributions calculated directly from a high-resolution hydrodynamic simulation of the infall and tidal disruption of Sgr around the Milky Way. In contrast to past studies, the simulation incorporates DM, stellar and gaseous components for both the Milky Way and the Sgr progenitor galaxy. The simulated distributions account for significant tidal disruption affecting the DM density profile. Our estimate of the J-factor value for Sgr, $J\\_{\\text{Sgr}}=1.48\\times 10^{10}\\ \\text{M}^2\\_\\odot\\ \\text{kpc}^{-5}$ ($6.46\\times10^{16}\\ \\text{GeV}\\ \\text{cm}^{-5}$), is significantly lower than found in prior studies. This value, while formally a lower limit, is likely close to the true J-factor value for Sgr. It implies a DM cross-section incompatibly large in comparison with existing constraints would be required to attribute recently observed $\\gamma$-ray emission from Sgr (Crocker, Macias et al. 2022; arXiv:2204.12054) to DM annihilation. We also calculate a J-factor value using an NFW profile fitted to the simulated DM density distribution to facilitate comparison with past studies. This NFW J-factor value supports the conclusion that most past studies have overestimated the dark matter density of Sgr on small scales. This, together with the fact that the Sgr has recently been shown to emit $\\gamma$-rays of astrophysical origin, complicate the use of Sgr in indirect DM detection searches.\n\n", "2303.13088": "2023-03-23, **Upper limit on scalar field dark matter from LIGO-Virgo third observation run**, Koki Fukusumi et.al., [2303.13088v1](http://arxiv.org/abs/2303.13088v1)\n\n If dark matter is a light scalar field weakly interacting with elementary particles, such a field induces oscillations of the physical constants, which results in time-varying force acting on macroscopic objects. In this paper, we report on a search for such a signal in the data of the two LIGO detectors during their third observing run (O3). We focus on the mass of the scalar field in the range of $10^{-13}-10^{-11}~{\\rm eV}$ for which the signal falls within the detectors' sensitivity band. We first formulate the cross-correlation statistics that can be readily compared with publically available data. It is found that inclusion of the anisotropies of the velocity distribution of dark matter caused by the motion of the solar system in the Milky Way Galaxy enhances the signal by a factor of $\\sim 2$ except for the narrow mass range around $\\simeq 3\\times 10^{-13}~{\\rm eV}$ for which the correlation between the interferometer at Livingston and the one at Hanford is suppressed. From the non-detection of the signal, we derive the upper limits on the coupling constants between the elementary particles and the scalar field for five representative cases. For all the cases where the weak equivalence principle is not satisfied, tests of the violation of the weak equivalence principle provide the tightest upper limit on the coupling constants. Upper limits from the fifth-force experiment are always stronger than the ones from LIGO, but the difference is less than a factor of $\\sim 5$ at large-mass range. Our study demonstrates that gravitational-wave experiments are starting to bring us meaningful information about the nature of dark matter. The formulation provided in this paper may be applied to the data of upcoming experiments as well and is expected to probe much wider parameter range of the model.\n\n", "2303.12983": "2023-03-23, **Lepton Flavor Portal Matter**, George N. Wojcik et.al., [2303.12983v1](http://arxiv.org/abs/2303.12983v1)\n\n The paradigm of portal matter represents a well-motivated extension to models with kinetic mixing/vector portal dark matter. In previous work, we constructed a simple leptonic portal matter model in which the portal matter fields could mediate a new physics correction to the anomalous magnetic moment of the muon consistent with the observed discrepancy between the measured value for this quantity and the SM prediction. Here, we present a version of this mechanism by constructing a model with an extended dark gauge sector in which SM and portal matter fields exist as members of the same dark gauge multiplets, which provides a natural extension of simple portal matter models. We find a rich phenomenology in this extended model, including nontrivial novel characteristics that do not appear in our earlier minimal construction, and discuss current experimental constraints and future prospects for this model. We find that a multi-TeV muon collider has excellent prospects for constraining or measuring the crucial parameters of this model.\n\n"}, "supernova": {"2303.13338": "2023-03-23, **A helium-burning white dwarf binary as a supersoft X-ray source**, J. Greiner et.al., [2303.13338v1](http://arxiv.org/abs/2303.13338v1)\n\n Type Ia supernovae are cosmic distance indicators, and the main source of iron in the Universe, but their formation paths are still debated. Several dozen supersoft X-ray sources, in which a white dwarf accretes hydrogen-rich matter from a non-degenerate donor star, have been observed and suggested as Type Ia supernovae progenitors. However, observational evidence for hydrogen, which is expected to be stripped off the donor star during the supernova explosion, is lacking. Helium-accreting white dwarfs, which would circumvent this problem, have been predicted for more than 30 years, also including their appearance as supersoft X-ray sources, but have so far escaped detection. Here we report a supersoft X-ray source with an accretion disk whose optical spectrum is completely dominated by helium, suggesting that the donor star is hydrogen-free. We interpret the luminous and supersoft X-rays as due to helium burning near the surface of the accreting white dwarf. The properties of our system provides evidence for extended pathways towards Chandrasekhar mass explosions based on helium accretion, in particular for stable burning in white dwarfs at lower accretion rates than expected so far. This may allow to recover the population of the sub-energetic so-called Type Iax supernovae, up to 30% of all Type Ia supernovae, within this scenario.\n\n"}}