{"neutrino": {"2308.04361": "2023-08-08, **Cosmic ray interactions with matter and radiation**, Pasquale Dario Serpico et.al., [2308.04361v1](http://arxiv.org/abs/2308.04361v1)\n\n The main goal of the present lectures is to outline the key particle interactions and energy loss mechanisms in the Galactic medium that high-energy particles are subject to. These interactions are an important ingredient entering the cosmic ray propagation equation, contributing to shape cosmic ray spectra. They also source the so-called secondary species, like gamma rays, neutrinos, \"fragile\" nuclei not synthesised in stars, and antiparticles, all routinely used as diagnostic tools in a multi-messenger context. These lectures are complementary to Denise Boncioli's ones, focusing instead on processes happening at ultra-high energies in the extragalactic environment. They include propaedeutic material to Felix Aharonian's and, to some extent, Stefano Gabici's and Carmelo Evoli's lectures.\n\n", "2308.04342": "2023-08-08, **A time variability test for neutrino sources identified by IceCube**, Pranav Dave et.al., [2308.04342v1](http://arxiv.org/abs/2308.04342v1)\n\n IceCube has reported evidence for neutrino emission from the Seyfert-II galaxy NGC 1068 and the blazar TXS 0506+056. The former was identified in a time-integrated search, and the latter using time-dependent and multi-messenger methods. A natural question is: are sources identified in time-integrated searches consistent with a steady neutrino source? We present a non-parametric method, TAUNTON, to answer this question. Motivated by the Cram\\'er-von Mises test, TAUNTON is an unbinned single-hypothesis method to identify deviations in neutrino data from the steady hypothesis. An advantage of TAUNTON is that it is sensitive to arbitrary deviations from the steady hypothesis. Here we present results of TAUNTON applied to a 8.7 year data-set of muon neutrino track events; the same data used to identify NGC 1068 at 4.2$\\sigma$. We use TAUNTON on 51 objects, a subset (with >4 signal neutrinos) of the 110 objects studied in the NGC 1068 publication. We set a threshold of 3$\\sigma$ pre-trial to identify sources inconsistent with the steady hypothesis. TAUNTON reports a p-value of 0.9 for NGC 1068, consistent with the steady hypothesis. Using the time integrated fit, data for TXS 0506+056 is consistent with the steady hypothesis at 1.7$\\sigma$. Time variability is not identified for TXS 0506+056 because there are few neutrino events.\n\n", "2308.04329": "2023-08-08, **Predicting gravitational waves from jittering-jets-driven core collapse supernovae**, Noam Soker et.al., [2308.04329v1](http://arxiv.org/abs/2308.04329v1)\n\n I estimate the frequencies of gravitational waves from jittering jets that explode core collapse supernovae (CCSNe) to crudely be 5-30 Hz, and with strains that might allow detection of Galactic CCSNe. The jittering jets explosion mechanism (JJEM) asserts that most CCSNe are exploded by jittering jets that the newly born neutron star (NS) launches within few seconds. According to the JJEM, instabilities in the accreted gas lead to the formation of intermittent accretion disks that launch the jittering jets. Earlier studies that did not include jets calculated the gravitational frequencies that instabilities around the NS emit to have a peak in the crude frequency range of 100-2000 Hz. Based on a recent study, I take the source of the gravitational waves of jittering jets to be the turbulent bubbles (cocoons) that the jets inflate as they interact with the outer layers of the core of the star at thousands of kilometres from the NS. The lower frequencies and larger strain than those of gravitational waves from instabilities in CCSNe allow future, and maybe present, detectors to identify the gravitational wave signals of jittering jets. Detection of gravitational waves from local CCSNe might distinguish between the neutrino-driven explosion mechanism and the JJEM.\n\n", "2308.04311": "2023-08-08, **VLBI Probes of Jet Physics in Neutrino-Candidate Blazars**, F. Eppel et.al., [2308.04311v1](http://arxiv.org/abs/2308.04311v1)\n\n In recent years, evidence has accumulated that some high-energy cosmic neutrinos can be associated with blazars. The strongest evidence for an individual association was found in the case of the blazar TXS 0506+056 in 2017. In July 2019, another track-like neutrino event (IC190730A) was found spatially coincident with the well-known bright flat-spectrum radio quasar PKS 1502+106. PKS 1502+106 was not found to be in a particularly elevated gamma-ray state, but exhibited a remarkably bright radio outburst at the time of the neutrino detection, similar to TXS 0506+056. We have performed a multi-frequency VLBI study from 15 GHz up to 86 GHz on TXS 0506+056, PKS 1502+106 and one additional neutrino-candidate blazar (PKS 0215+015) to study the radio structure of neutrino candidate blazars in response to their neutrino association. We have obtained target of opportunity observations with the VLBA for all three sources within $\\sim$1 month from their associated neutrino events and are performing multi-epoch studies of the jet kinematics at 15 GHz as part of the MOJAVE program. Here, we present first results on TXS 0506+056 at 86 GHz and one additional 43 GHz image obtained 27 days after IC170922A, closer in time to the neutrino event than previously published images. We also give an overview about our recent work on PKS 1502+106 and PKS 0215+015.\n\n", "2308.04154": "2023-08-08, **Probing Earth's Missing Potassium using the Unique Antimatter Signature of Geoneutrinos**, LiquidO Consortium et.al., [2308.04154v1](http://arxiv.org/abs/2308.04154v1)\n\n The formation of the Earth remains an epoch with mysterious puzzles extending to our still incomplete understanding of the planet's potential origin and bulk composition. Direct confirmation of the Earth's internal heat engine was accomplished by the successful observation of geoneutrinos originating from uranium (U) and thorium (Th) progenies, manifestations of the planet's natural radioactivity dominated by potassium (40K) and the decay chains of uranium (238U) and thorium (232Th). This radiogenic energy output is critical to planetary dynamics and must be accurately measured for a complete understanding of the overall heat budget and thermal history of the Earth. Detecting geoneutrinos remains the only direct probe to do so and constitutes a challenging objective in modern neutrino physics. In particular, the intriguing potassium geoneutrinos have never been observed and thus far have been considered impractical to measure. We propose here a novel approach for potassium geoneutrino detection using the unique antimatter signature of antineutrinos to reduce the otherwise overwhelming backgrounds to observing this rarest signal. The proposed detection framework relies on the innovative LiquidO detection technique to enable positron (e+) identification and antineutrino interactions with ideal isotope targets identified here for the first time. We also provide the complete experimental methodology to yield the first potassium geoneutrino discovery.\n\n", "2308.03978": "2023-08-08, **Cross Correlation of IceCube Neutrinos with Tracers of Large Scale Structure**, David Guevel et.al., [2308.03978v1](http://arxiv.org/abs/2308.03978v1)\n\n The origin of most astrophysical neutrinos is unknown, but extragalactic neutrino sources may follow the spatial distribution of the large-scale structure of the universe. Galaxies also follow the same large scale distribution, so establishing a correlation between galaxies and IceCube neutrinos could help identify the origins of the diffuse neutrinos observed by IceCube. Following a preliminary study based on the WISE and 2MASS catalogs, we will investigate an updated galaxy catalog with improved redshift measurements and reduced stellar contamination. Our IceCube data sample consists of track-like muon neutrinos selected from the Northern sky. The excellent angular resolution of track-like events and low contamination with atmospheric muons is necessary for the sensitivity of the analysis. Unlike a point source stacking analysis, the calculation of the cross correlation does not scale with the number of entries in the catalog, making the work tractable for catalogs with millions of objects. We present the development and performance of a two-point cross correlation of IceCube neutrinos with a tracer of the large scale structure.\n\n", "2308.03962": "2023-08-08, **Neutrinos and nucleosynthesis of elements**, Tobias Fischer et.al., [2308.03962v1](http://arxiv.org/abs/2308.03962v1)\n\n Neutrinos are known to play important roles in many astrophysical scenarios from the early period of the big bang to current stellar evolution being a unique messenger of the fusion reactions occurring in the center of our sun. In particular, neutrinos are crucial in determining the dynamics and the composition evolution in explosive events such as core-collapse supernovae and the merger of two neutron stars. In this paper, we review the current understanding of supernovae and binary neutron star mergers by focusing on the role of neutrinos therein. Several recent improvements on the theoretical modeling of neutrino interaction rates in nuclear matter as well as their impact on the heavy element nucleosynthesis in the supernova neutrino-driven wind are discussed, including the neutrino-nucleon opacity at the mean field level taking into account the relativistic kinematics of nucleons, the effect due to the nucleon-nucleon correlation, and the nucleon-nucleon bremsstrahlung. We also review the framework used to compute the neutrino-nucleus interactions and the up-to-date yield prediction for isotopes from neutrino nucleosynthesis occurring in the outer envelope of the supernova progenitor star during the explosion. Here improved predictions of energy spectra of supernova neutrinos of all flavors have had significant impact on the nucleosynthesis yields. Rapid progresses in modeling the flavor oscillations of neutrinos in these environments, including several novel mechanisms for collective neutrino oscillations and their potential impacts on various nucleosynthesis processes are summarized.\n\n", "2308.03856": "2023-08-07, **Enhanced Starting Track Real-time Stream for IceCube**, Jesse Osborn et.al., [2308.03856v1](http://arxiv.org/abs/2308.03856v1)\n\n IceCube real-time alerts allow for rapid follow-up observations of likely astrophysical neutrino events, enabling searches for multi-messenger counterparts. The Enhanced Starting Track Real-time Stream (ESTReS) is a real-time extension of the Enhanced Starting Track Event Selection (ESTES), a high astrophysical purity muon-neutrino sample recently used by IceCube to measure the astrophysical diffuse flux. A set of computationally cheap cuts allows us to run a fast filter in seconds. This online filter selects about 100 events per day to be sent to Madison, WI via satellite where the full ESTES event selection is applied within minutes. Events that pass the final set of cuts (ESTReS + ESTES) will be sent out as real-time alerts to the broader astrophysical community. ESTReS's unique contribution to the current real-time alerts will be events in the southern sky in the 5 TeV - 100 TeV range. We expect about 10.3 events per year which average 50% astrophysical purity. In this talk I will report the status of the ESTReS alert stream in the context of the IceCube real-time program.\n\n", "2308.03840": "2023-08-07, **Transients stemming from collapsing massive stars: The missing pieces to advance joint observations of photons and high-energy neutrinos**, Ersilia Guarini et.al., [2308.03840v1](http://arxiv.org/abs/2308.03840v1)\n\n Collapsing massive stars lead to a broad range of astrophysical transients, whose multi-wavelength emission is powered by a variety of processes including radioactive decay, activity of the central engine, and interaction of the outflows with a dense circumstellar medium. These transients are also candidate factories of neutrinos with energy up to hundreds of PeV. We review the energy released by such astrophysical objects across the electromagnetic wavebands as well as neutrinos, in order to outline a strategy to optimize multi-messenger follow-up programs. We find that, while a significant fraction of the explosion energy can be emitted in the infrared-optical-ultraviolet (UVOIR) band, the optical signal alone is not optimal for neutrino searches. Rather, the neutrino emission is strongly correlated with the one in the radio band, if a dense circumstellar medium surrounds the transient, and with X-rays tracking the activity of the central engine. Joint observations of transients in radio, X-rays, and neutrinos will crucially complement those in the UVOIR band, breaking degeneracies in the transient parameter space. Our findings call for heightened surveys in the radio and X-ray bands to warrant multi-messenger detections.\n\n", "2308.03838": "2023-08-07, **Solar neutrinos and $ν_2$ visible decays to $ν_1$**, André de Gouvêa et.al., [2308.03838v1](http://arxiv.org/abs/2308.03838v1)\n\n Experimental bounds on the neutrino lifetime depend on the nature of the neutrinos and the details of the potentially new physics responsible for neutrino decay. In the case where the decays involve active neutrinos in the final state, the neutrino masses also qualitatively impact how these manifest themselves experimentally. In order to further understand the impact of nonzero neutrino masses, we explore how observations of solar neutrinos constrain a very simple toy model. We assume that neutrinos are Dirac fermions and there is a new massless scalar that couples to neutrinos such that a heavy neutrino - $\\nu\\_2$ with mass $m\\_2$ - can decay into a lighter neutrino - $\\nu\\_1$ with mass $m\\_1$ - and a massless scalar. We find that the constraints on the new physics coupling depend, sometimes significantly, on the ratio of the daughter-to-parent neutrino masses, and that, for large enough values of the new physics coupling, the \"dark side\" of the solar neutrino parameter space - $\\sin^2\\theta\\_{12}\\sim 0.7$ - provides a reasonable fit to solar neutrino data. Our results generalize to other neutrino-decay scenarios, including those that mediate $\\nu\\_2\\to\\nu\\_1\\bar{\\nu}\\_3\\nu\\_3$ when the neutrino mass ordering is inverted mass and $m\\_2>m\\_1\\gg m\\_3$, the mass of $\\nu\\_3$.\n\n", "2308.03702": "2023-08-07, **Sensitivity of octant of $θ_{23}$, CP violation and mass hierarchy in NO$ν$A with multinucleon and detector effects**, Paramita Deka et.al., [2308.03702v1](http://arxiv.org/abs/2308.03702v1)\n\n In this work, we investigate how multinucleon enhancement and RPA (Random Phase Approximation) suppression can affect the measurement of three unknown neutrino oscillation parameters - the CP-violating phase $\\delta\\_{CP}$, the octant of the atmospheric mixing angle $\\theta\\_{23}$, and the determination of the mass hierarchy, in the appearance channel of the NO$\\nu$A experiment. We include the presence of the detector effect as well in the analysis, which is crucial for capturing realistic experimental scenarios. It is found that the analysis using our comprehensive model (QE(+RPA)+2p2h) exhibits significantly enhanced sensitivity compared to the pure QE interaction process, in all the cases. Also, the higher octant of $\\theta\\_{23}$, the lower half plane of $\\delta\\_{CP}$, and the normal mass hierarchy (HO-LHP-NH) exhibit improved sensitivity, enabling a more precise determination of the corresponding parameters. Furthermore, it is also noted that improving the performance of the detector also improves the results. Thus, including multinucleon effects and improving detector efficiency have the potential to enhance the capabilities of the NO$\\nu$A (and other long baseline) experiment in conducting precise parameter studies.\n\n", "2308.03356": "2023-08-07, **A relativistic model-free prediction for neutrinoless double beta decay at leading order**, Y. L. Yang et.al., [2308.03356v1](http://arxiv.org/abs/2308.03356v1)\n\n Starting from a manifestly Lorentz-invariant chiral Lagrangian, we present a model-free prediction for the transition amplitude of the process $nn\\rightarrow pp e^-e^-$ induced by light Majorana neutrinos, which is a key process of the neutrinoless double beta decay ($0\\nu\\beta\\beta$) in heavy nuclei employed in large-scale searches. Contrary to the nonrelativistic case, we show that the transition amplitude can be renormalized at leading order without any uncertain contact operators. The predicted amplitude defines a stringent benchmark for the previous estimation with model-dependent inputs, and greatly reduces the uncertainty of $0\\nu\\beta\\beta$ transition operator in the calculations of nuclear matrix elements. Generalizations of the present framework could also help to address the uncertainties in $0\\nu\\beta\\beta$ decay induced by other mechanisms. In addition, the present work motivates a relativistic ab initio calculation of $0\\nu\\beta\\beta$ decay in light and medium-mass nuclei.\n\n"}, "dark matter": {"2308.03850": "2023-08-07, **Gravitational Waves and the Galactic Potential**, Francisco Duque et.al., [2308.03850v1](http://arxiv.org/abs/2308.03850v1)\n\n Over the next decade, third-generation interferometers and the space-based LISA mission will observe binaries in galactic centers involving supermassive black holes with millions of solar masses. More precise measurements of more extreme events that probe stronger gravitational fields can have a tremendous impact on fundamental physics, astrophysics, and cosmology. However, at the galactic scale, accretion disks, dark matter halos, and dense populations of compact objects can interact gravitationally with coalescing bodies. The role these astrophysical structures play in the evolution and gravitational-wave signature of binary systems remains largely unexplored and previous studies have often relied on ad-hoc Newtonian approximations. In this thesis, we aim to improve this picture. We study how tidal deformations of matter surrounding black holes can mask off deviations from General Relativity. We also explore the deep connection between light rings -- closed orbits of massless particles -- and the proper oscillation modes of compact objects. We show that independently of the presence of an environment, the light ring controls the late-time appearance of infalling matter to distant observers and how the final black hole formed in a collision relaxes to stationarity. Finally, we develop the first fully-relativistic framework capable of studying gravitational wave emission in non-vacuum environments. We apply it to galactic black-hole binaries surrounded by a dark matter halo and observe the conversion between matter and gravitational waves. This coupling results in significant changes in the energy flux emitted, which could help constrain the properties of galactic matter distributions.\n\n", "2308.03841": "2023-08-07, **Ruling out Strongly Interacting Dark Matter-Dark Radiation Models from Joint Cosmic Microwave Background-Quasar Observations**, Atrideb Chatterjee et.al., [2308.03841v1](http://arxiv.org/abs/2308.03841v1)\n\n The cold dark matter (CDM) paradigm provides a remarkably good description of the Universe's large-scale structure. However, some discrepancies exist between its predictions and observations at very small sub-galactic scales. To address these issues, the consideration of a strong interaction between dark matter particles and dark radiation emerges as an intriguing alternative. In this study, we explore the constraints on those models using joint observations of Cosmic Microwave Background (CMB) and Quasars with our previously built parameter estimation package CosmoReionMC. At 2-$\\sigma$ confidence limits, this analysis rules out all strongly interacting Dark Matter - Dark Radiation models proposed to date, representing the most stringent constraint on those models to the best of our knowledge. Future research using a 21-cm experiment holds the potential to reveal stronger constraints or uncover hidden interactions within the dark sector.\n\n", "2308.03737": "2023-08-07, **Frequency of the dark matter subhalo collisions and bifurcation sequence arising formation of dwarf galaxies**, Koki Otaki et.al., [2308.03737v1](http://arxiv.org/abs/2308.03737v1)\n\n The cold dark matter (CDM) model predicts galaxies have 100 times more dark matter mass than stars. Nevertheless, recent observations report the existence of dark-matter-deficient galaxies with less dark matter than expected. To solve this problem, we investigate the physical processes of galaxy formation in head-on collisions between gas-containing dark matter subhaloes (DMSHs). Analytical estimation of the collision frequency between DMSHs associated with a massive host halo indicates that collisions frequently occur within 1/10th of the virial radius of the host halo, with a collision timescale of about 10 Myr, and the most frequent relative velocity increases with increasing radius. Using analytical models and numerical simulations, we show the bifurcation channel of the formation of dark-matter-dominated and dark-matter-deficient galaxies. In the case of low-velocity collisions, a dark-matter-dominated galaxy is formed by the merging of two DMSHs. In the case of moderate-velocity collisions, the two DMSHs penetrate each other. However the gas medium collides, and star formation begins as the gas density increases, forming a dwarf galaxy without dark matter at the collision surface. In the case of high-velocity collisions, shock-breakout occurs due to the shock waves generated at the collision surface reaching the gas surface, and no galaxy forms. For example, the simulation demonstrates that a pair of DMSHs with a mass of 10^9 Msun containing gas of 0.1 solar metallicity forms a dark-matter-deficient galaxy with a stellar mass of 10^7 Msun for a relative velocity of 200 km/s.\n\n", "2308.03724": "2023-08-07, **Quantum Gravity Effects on Dark Matter and Gravitational Waves**, Stephen F. King et.al., [2308.03724v1](http://arxiv.org/abs/2308.03724v1)\n\n We explore how quantum gravity effects, manifested through the breaking of discrete symmetry responsible for both Dark Matter and Domain Walls, can have observational effects through CMB observations and gravitational waves. To illustrate the idea we consider a simple model with two scalar fields and two $\\mathcal{Z}\\_2$ symmetries, one being responsible for Dark Matter stability, and the other spontaneously broken and responsible for Domain Walls, where both symmetries are assumed to be explicitly broken by quantum gravity effects. We show the recent gravitational wave spectrum observed by several pulsar timing array projects can help constrain such effects.\n\n", "2308.03680": "2023-08-07, **Investigation of spin-dependent dark matter in mono-photon production at high-energy colliders**, G. Gil da Silveira et.al., [2308.03680v1](http://arxiv.org/abs/2308.03680v1)\n\n Many theories about dark matter have emerged due to its strong theoretical appeal in explaining astrophysical phenomena. However, experimental and theoretical particle physics have yet not provided evidence that dark matter is part of the observable Universe. Our work aims to investigate the interaction between Standard Model (SM) fermions and different species of dark matter (DM) particles in high-energy collisions through interaction of a new massive vector mediator, Z'. The production of scalar and fermion DM pairs via fermion annihilation into the new vector boson is investigated near a resonance, where a SM signal from hard photon emission is considered as initial state radiation, namely a mono-photon production. Values of coupling constants between the DM and the SM particles are mapped in contrast to the Planck satellite data for thermal relic density DM computed in the correct framework for the relic density near a resonance, where a weaker suppression of the relic density is expected. We show for the CLIC and LHC kinematic regimes that certain mass ranges and coupling constants of these DM particles are in agreement with the expected relic density near a resonance and are not excluded by collider and astrophysical limits.\n\n", "2308.03468": "2023-08-07, **The mass density contrast in perturbed Friedman-Lemaitre-Robertson-Walker cosmologies**, Edward Malec et.al., [2308.03468v1](http://arxiv.org/abs/2308.03468v1)\n\n We analyze the evolution of the mass density contrast in spherical perturbations of flat Friedman-Lemaitre-Robertson-Walker cosmologies. Both dark matter and dark energy are included. In the absence of dark energy the evolution equation coincides with that obtained by Bonnor within the ``Newtonian cosmology''.\n\n", "2308.03342": "2023-08-07, **General spherically symmetric solution of Cotton gravity**, Merab Gogberashvili et.al., [2308.03342v1](http://arxiv.org/abs/2308.03342v1)\n\n In this paper we present the general spherically symmetric solution to the vacuum equations of Cotton gravity. The obtained metric solution reveals the presence of singularities at the photosphere of a spherical source, which obstruct the formation of Schwarzschild-like black holes. The solution is characterized by two integration constants that can be associated with the Hubble horizon and utilized to model the dark matter and dark energy. We examine the diverse features of the solution, including the introduction of long-range modifications to Newton's force through the incorporation of the velocity-squared repulsive term.\n\n", "2308.03298": "2023-08-07, **A New Halo Density Profile for Galaxies**, Fei Qin et.al., [2308.03298v1](http://arxiv.org/abs/2308.03298v1)\n\n More precise measurements of galaxy clustering will be provided by the next generation of galaxy surveys such as DESI, WALLABY and SKA. To utilize this information to improve our understanding of the Universe, we need to accurately model the distribution of galaxies in their host dark matter halos. In this work we present a new halo density profile model for galaxies, which makes predictions for the positions of galaxies in the host halo, different to the widely adopted Navarro-Frenk-White (NFW) profile, since galaxies tend to be found more in the outskirts of halos (nearer the virial radius) than an NFW profile. The parameterised density profile model is fit and tested using the DarkSage semi-analytic model of galaxy formation. We find that our density profile model can accurately reproduce the halo occupation distribution and galaxy two-point correlation function of the DarkSage simulation. We also derive the analytic expressions for the circular velocity and gravitational potential energy for this density profile. We use the SDSS DR10 galaxy group catalogue to validate this halo density profile model. Compared to the NFW profile, we find that our model more accurately predicts the positions of galaxies in their host halo and the galaxy two-point correlation function.\n\n"}, "supernova": {"2308.03830": "2023-08-07, **Photoevaporation versus enrichment in the cradle of the Sun**, Miti Patel et.al., [2308.03830v1](http://arxiv.org/abs/2308.03830v1)\n\n The presence of short-lived radioisotopes (SLRs) 26-Al and 60-Fe in the Solar system places constraints on the initial conditions of our planetary system. Most theories posit that the origin of 26-Al and 60-Fe is in the interiors of massive stars, and they are either delivered directly to the protosolar disc from the winds and supernovae of the massive stars, or indirectly via a sequential star formation event. However, massive stars that produce SLRs also emit photoionising far and extreme ultraviolet radiation, which can destroy the gas component of protoplanetary discs, possibly precluding the formation of gas giant planets like Jupiter and Saturn. Here, we perfom N-body simulations of star-forming regions and determine whether discs that are enriched in SLRs can retain enough gas to form Jovian planets. We find that discs are enriched and survive the photoionising radiation only when the dust radius of the disc is fixed and not allowed to move inwards due to the photoevaporation, or outwards due to viscous spreading. Even in this optimal scenario, not enough discs survive until the supernovae of the massive stars and so have zero or very little enrichment in 60-Fe. We therefore suggest that the delivery of SLRs to the Solar system may not come from the winds and supernovae of massive stars.\n\n", "2308.03834": "2023-08-07, **Systematic Investigation of Very Early-Phase Spectra of Type Ia Supernovae**, Mao Ogawa et.al., [2308.03834v1](http://arxiv.org/abs/2308.03834v1)\n\n It has been widely accepted that Type Ia supernovae (SNe Ia) are thermonuclear explosions of a CO white dwarf. However, the natures of the progenitor system(s) and explosion mechanism(s) are still unclarified. Thanks to the recent development of transient observations, they are now frequently discovered shortly after the explosion, followed by rapid spectroscopic observations. In this study, by modeling very early-phase spectra of SNe Ia, we try to constrain the explosion models of SNe Ia. By using the Monte Carlo radiation transfer code, TARDIS, we estimate the properties of their outermost ejecta. We find that the photospheric velocity of normal-velocity supernovae (NV SNe) in the first week is $\\sim$15000 km s$^{-1}$. The outer velocity, to which the carbon burning extends, spans the range between $\\sim$20000 and 25000 km s$^{-1}$. The ejecta density of NV SNe also shows a large diversity. For high-velocity supernovae (HV SNe) and 1999aa-like SNe, the photospheric velocity is higher, $\\sim$20000 km s$^{-1}$. They are different in the photospheric density, with HV SNe having higher density than 1999aa-like SNe. For all these types, we show that the outermost composition is closely related to the outermost ejecta density; the carbon burning layer and the unburnt carbon layer are found in the higher-density and lower-density objects, respectively. This finding suggests that there might be two sequences, the high-density and carbon-poor group (HV SNe and some NV SNe) and the low-density and carbon-rich group (1999aa-like and other NV SNe), which may be associated with different progenitor channels.\n\n", "2308.03484": "2023-08-07, **A Systematic Study of Associations between Supernova Remnants and Molecular Clouds**, Xin Zhou et.al., [2308.03484v1](http://arxiv.org/abs/2308.03484v1)\n\n We universally search for evidence of kinematic and spatial correlation of supernova remnant (SNR) and molecular cloud (MC) associations for nearly all SNRs in the coverage of the MWISP CO survey, i.e. 149 SNRs, 170 SNR candidates, and 18 pure pulsar wind nebulae (PWNe) in 1 deg < l < 230 deg and -5.5 deg < b < 5.5 deg. Based on high quality and unbiased 12CO/13CO/C18O (J = 1--0) survey data, we apply automatic algorithms to identify broad lines and spatial correlations for molecular gas in each SNR region. The 91 percent of SNR-MC associations detected previously are identified in this paper by CO line emission. Overall, there could be as high as 80 percent of SNRs associated with MCs. The proportion of SNRs associated with MCs is high within the Galactic longitude less than ~50 deg. Kinematic distances of all SNRs that are associated with MCs are estimated based on systemic velocities of associated MCs. The radius of SNRs associated with MCs follows a lognormal distribution, which peaks at ~8.1 pc. The progenitor initial mass of these SNRs follows a power-law distribution with an index of ~-2.3 that is consistent with the Salpeter index of -2.35. We find that SNR-MC associations are mainly distributed in a thin disk along the Galactic plane, while a small amount distributed in a thick disk. With the height of these SNRs from the Galactic plane below ~45 pc, the distribution of the average radius relative to the height of them is roughly flat, and the average radius increases with the height when above ~45 pc.\n\n", "2308.03456": "2023-08-07, **Bayesian inference from gravitational waves in fast-rotating, core-collapse supernovae**, Carlos Pastor-Marcos et.al., [2308.03456v1](http://arxiv.org/abs/2308.03456v1)\n\n Core-collapse supernovae (CCSNe) are prime candidates for gravitational-wave detectors. The analysis of their complex waveforms can potentially provide information on the physical processes operating during the collapse of the iron cores of massive stars. In this work we analyze the early-bounce rapidly rotating CCSN signals reported in the waveform catalog of Richers et al 2017, which comprises over 1800 axisymmetric simulations extending up to about $10$~ms of post-bounce evolution. It was previously established that for a large range of progenitors, the amplitude of the bounce signal, $\\Delta h$, is proportional to the ratio of rotational-kinetic energy to potential energy, T/\\|W\\|, and the peak frequency, $f\\_{\\rm peak}$, is proportional to the square root of the central rest-mass density. In this work, we exploit these relations to suggest that it could be possible to use such waveforms to infer protoneutron star properties from a future gravitational wave observation, if the distance and inclination are well known. Our approach relies on the ability to describe a subset of the waveforms in the early post-bounce phase in a simple template form depending only on two parameters, $\\Delta h$ and $f\\_{\\rm peak}$. We use this template to perform a Bayesian inference analysis of waveform injections in Gaussian colored noise for a network of three gravitational wave detectors formed by Advanced LIGO and Advanced Virgo. We show that it is possible to recover the injected parameters, peak frequency and amplitude, with an accuracy better than 10% for more than 50% of the detectable signals (given known distance and inclination angle). However, inference on waveforms from outside the Richers catalog is not reliable, indicating a need for carefully verified waveforms of the first 10 ms after bounce of rapidly rotating supernovae of different progenitors with agreement between different codes.\n\n"}}