{"neutrino": {"2405.07952": "2024-05-13, **White paper on ($α$, n) neutron yields calculation**, D. Cano-Ott et.al., [2405.07952v1](http://arxiv.org/abs/2405.07952v1)\n\n Understanding the radiogenic neutron production rate through the (${\\alpha}$, n) reaction is essential in many fields of physics like dark matter searches, neutrino studies, nuclear astrophysics and medical physics. This white paper provides a review of the current landscape of (${\\alpha}$, n) yields, neutron spectra and correlated ${\\gamma}$-rays calculations, and describes the existing tools and the available cross-sections. The uncertainties that contribute to (${\\alpha}$, n) yield calculations are also discussed with plans for a program to improve the accuracy of these estimates. Novel ideas to measure (${\\alpha}$, n) cross-sections for a variety of materials of interest are presented. The goal of this study is to reduce the uncertainty in the expected sensitivity of next-generation physics experiments in the keV--MeV regime.\n\n", "2405.07900": "2024-05-13, **Latest results from Super-Kamiokande**, Andrew D. Santos et.al., [2405.07900v1](http://arxiv.org/abs/2405.07900v1)\n\n Super-Kamiokande is the world's largest water Cherenkov experiment with its 50-kton tank of ultrapure water, recently doped with gadolinium to enhance neutron capture identification. It is a highly versatile, multi-purpose experiment in the MeV-TeV range, and here we will summarize the latest results and advancements in the atmospheric-$\\nu$, solar-$\\nu$, and Diffuse Supernova Neutrino Background analyses.\n\n", "2405.07894": "2024-05-13, **Neutrinos from captured dark matter in galactic stars**, Debajit Bose et.al., [2405.07894v1](http://arxiv.org/abs/2405.07894v1)\n\n Sub-GeV neutrinos produced in a stellar core may emerge from main sequence stars, white dwarfs and brown dwarfs producing possible observable signals of dark matter capture. A distribution of these stars near the Milky Way galactic center will produce a neutrino flux that can be probed at Earth based neutrino observatories like Super-Kamiokande. We demonstrate that this can provide a handle to probe dark matter masses in the 100 MeV - 2 GeV mass scales that compares favourably with present day direct detection bounds.\n\n", "2405.07695": "2024-05-13, **High-energy neutrinos from late-time jets of gamma-ray bursts with cocoon photons**, Riki Matsui et.al., [2405.07695v1](http://arxiv.org/abs/2405.07695v1)\n\n In gamma-ray bursts (GRBs), $\\sim$ 100 - 1000 s after the prompt emission, afterglow observations have consistently shown X-ray excesses detected in the form of flares (XFs; in long GRBs) or extended emission (EEs; in short GRBs). These observations are interpreted as emissions from jets launched by late central engine activity. However, the characteristics of these late-time jets, particularly the dissipation radius ($r\\_{\\rm diss}$), Lorentz factor ($\\Gamma$), and cosmic-ray loading factor ($\\xi\\_p$), remain unknown despite their importance. Here, in order to understand the properties of the late-time jets with future multi-messenger observations, we estimate the detectability of neutrinos associated with late-time emissions for a wide range of $r\\_{\\rm diss}$ and $\\Gamma$, assuming $\\xi\\_p=10$. We take into account external seed photons from the cocoon around the jets, which can enhance the neutrino production through photohadronic interaction in the jet dissipation region. Our results are still consistent with the upper limit obtained by IceCube. Our calculations indicate a promising prospect for neutrino detection with IceCube-Gen2 through the stacking of $\\sim 1000-2000$ events, for a wide range of $r\\_{\\rm diss}$ and $\\Gamma$. We found that setting an optimal energy threshold of 10 TeV can significantly reduce noise without negatively affecting neutrino detection. Furthermore, even in the case of non-detection, we show that meaningful constraints on the characteristics of the late-time jets can be obtained.\n\n", "2405.07330": "2024-05-12, **Simulating Heavy Neutral Leptons with General Couplings at Collider and Fixed Target Experiments**, Jonathan L. Feng et.al., [2405.07330v1](http://arxiv.org/abs/2405.07330v1)\n\n Heavy neutral leptons (HNLs) are motivated by attempts to explain neutrino masses and dark matter. If their masses are in the MeV to several GeV range, HNLs are light enough to be copiously produced at collider and accelerator facilities, but also heavy enough to decay to visible particles on length scales that can be observed in particle detectors. Previous studies evaluating the sensitivities of experiments have often focused on simple, but not particularly well-motivated, models in which the HNL mixes with only one active neutrino flavor. In this work, we accurately simulate models for HNL masses between 100 MeV and 10 GeV and arbitrary couplings to $e$, $\\mu$, and $\\tau$ leptons. We include over 150 HNL production channels and over 100 HNL decay modes, including all of the processes that can be dominant in some region of the general parameter space. The result is HNLCalc, a user-friendly, fast, and flexible library to compute the properties of HNL models. As examples, we implement HNLCalc to extend the FORESEE package to evaluate the prospects for HNL discovery at forward LHC experiments. We present sensitivity reaches for FASER and FASER2 in five benchmark scenarios with coupling ratios $\\|U\\_e\\|^2 : \\|U\\_\\mu\\|^2 : \\|U\\_{\\tau}\\|^2$ = 1:0:0, 0:1:0, 0:0:1, 0:1:1, and 1:1:1, where the latter two have not been studied previously. Comparing these to current constraints, we identify regions of parameter space with significant discovery prospects.\n\n", "2405.07321": "2024-05-12, **Status and Prospects of the JUNO Experiment**, Matthias Raphael Stock et.al., [2405.07321v1](http://arxiv.org/abs/2405.07321v1)\n\n The Jiangmen Underground Neutrino Observatory (JUNO) is a multi-purpose neutrino experiment currently under construction in China. It is located 52.5km away from two nuclear power plants in a newly constructed 700-m-deep underground laboratory. JUNO will be the largest liquid scintillator (LS) detector in the world comprising 20 kt of ultrapure LS filled in an acrylic sphere. Its main goal is to determine the neutrino mass ordering by measuring the energy spectrum of reactor neutrinos with highest accuracy. In addition, JUNO will cover precision measurements of oscillation parameters and several aspects in the field of astroparticle physics. Data taking will start in late 2024.\n\n", "2405.07313": "2024-05-12, **Scattering cross section of the long gravitino wave in Schwarzschild spacetime**, Yiknag Xiao et.al., [2405.07313v1](http://arxiv.org/abs/2405.07313v1)\n\n The scattering problem of the gravitino wave in Schwarzschild spacetime is explored. We employ the perturbative method to calculate the differential scattering cross section in the long wavelength limit, and demonstrate that it satisfies the same rule of the spin dependance as those of the scalar, neutrino, electromagnetic waves.\n\n", "2405.07243": "2024-05-12, **The origin of the 95 GeV excess in the flavor-dependent U(1)X model**, Zhao-feng Ge et.al., [2405.07243v1](http://arxiv.org/abs/2405.07243v1)\n\n This study investigates the excesses observed in the CMS diphoton and ditau data around 95 GeV within the framework of the flavor-dependent U(1)X model. The model introduces a singlet scalar to explain the nonzero neutrino masses. This newly introduced Higgs interacts directly with the quark sector, motivated by the aim to explain the flavor numbers of the fermion sector. Additionally, it undergoes mixing with the SM-like Higgs boson. The study suggests that designating this singlet Higgs state in this model as the lightest Higgs boson holds great potential for explaining the excesses around 95 GeV. In the calculations, we maintained the masses of the lightest and next-to-lightest Higgs bosons at around 95 GeV and 125 GeV respectively. It was found that the theoretical predictions on the signal strengthes {\\mu}(h95)\\_{\\gamma}{\\gamma}, {\\mu}(h95)\\_{\\tau}{\\tau} in the flavor-dependent U(1)X model can be fitted well to the excesses observed at CMS.\n\n", "2405.07230": "2024-05-12, **Acoustic Positioning for Deep Sea Neutrino Telescopes with a System of Piezo Sensors Integrated into Glass Spheres**, A. Albert et.al., [2405.07230v1](http://arxiv.org/abs/2405.07230v1)\n\n Position calibration in the deep sea is typically done by means of acoustic multilateration using three or more acoustic emitters installed at known positions. Rather than using hydrophones as receivers that are exposed to the ambient pressure, the sound signals can be coupled to piezo ceramics glued to the inside of existing containers for electronics or measuring instruments of a deep sea infrastructure. The ANTARES neutrino telescope operated from 2006 until 2022 in the Mediterranean Sea at a depth exceeding 2000m. It comprised nearly 900 glass spheres with 432mm diameter and 15mm thickness, equipped with photomultiplier tubes to detect Cherenkov light from tracks of charged elementary particles. In an experimental setup within ANTARES, piezo sensors have been glued to the inside of such - otherwise empty - glass spheres. These sensors recorded signals from acoustic emitters with frequencies from 46545 to 60235Hz. Two waves propagating through the glass sphere are found as a result of the excitation by the waves in the water. These can be qualitatively associated with symmetric and asymmetric Lamb-like waves of zeroth order: a fast (early) one with $v\\_e \\approx 5$mm/$\\mu$s and a slow (late) one with $v\\_\\ell \\approx 2$mm/$\\mu$s. Taking these findings into account improves the accuracy of the position calibration. The results can be transferred to the KM3NeT neutrino telescope, currently under construction at multiple sites in the Mediterranean Sea, for which the concept of piezo sensors glued to the inside of glass spheres has been adapted for monitoring the positions of the photomultiplier tubes.\n\n", "2405.07209": "2024-05-12, **Constrain the linear scalar perturbation theory of Cotton gravity**, Pengbo Xia et.al., [2405.07209v1](http://arxiv.org/abs/2405.07209v1)\n\n We perform a cosmological test of Cotton gravity, which describes gravity by cotton tensor. The model we consider allows for the same background evolution as the $\\Lambda$CDM model. We derive the cosmological perturbation theory of the scalar mode at the linear level, where the difference from the $\\Lambda$CDM model is characterized by the parameter $\\beta$. We incorporate Cotton gravity with a neutrino model and perform a Monte Carlo Markov Chain (MCMC) analysis using data from the Cosmic Microwave Background (CMB) and Sloan Digital Sky Survey (SDSS). The analysis constrains parameter $\\beta=-0.00008^{+0.00080}\\_{-0.00104}$ at the 1-$\\sigma$ confidence level. We conclude that currently, there is no obvious deviation between Cotton gravity and the $\\Lambda$CDM model in the linear cosmological perturbation level for observations.\n\n", "2405.07165": "2024-05-12, **Minimal Type-I Dirac seesaw and Leptogenesis under $A_{4}$ modular invariance**, Labh Singh et.al., [2405.07165v1](http://arxiv.org/abs/2405.07165v1)\n\n We present a Dirac mass model based on $A\\_{4}$ modular symmetry within Type-I seesaw framework. This extension of Standard Model requires three right-handed neutrinos and three heavy Dirac fermions superfields, all singlet under $SU(2)\\_{L}$ symmetry. The scalar sector is extended by the inclusion of a $SU(2)\\_{L}$ singlet superfield, $\\chi$. Here, the modular symmetry plays a crucial role as the Yukawa couplings acquire modular forms, which are expressed in terms of Dedekind eta function $\\eta(\\tau)$. Therefore, the Yukawa couplings follow transformations akin to other matter fields, thereby obviating the necessity of additional flavon fields. The acquisition of $vev$ by complex modulus $\\tau$ leads to the breaking of $A\\_{4}$ modular symmetry. We have obtained predictions on neutrino oscillation parameters, for example, the model favours ( \\theta\\_{23} ) to be in the lower octant and normal hierarchy for neutrino mass spectrum. Furthermore, we find that heavy Dirac fermions, in our model, can decay to produce observed baryon asymmetry of the Universe through Dirac leptogenesis.\n\n"}, "dark matter": {"2405.07915": "2024-05-13, **Discovery of highly anisotropic dielectric crystals with equivariant graph neural networks**, Yuchen Lou et.al., [2405.07915v1](http://arxiv.org/abs/2405.07915v1)\n\n Anisotropy in crystals plays a pivotal role in many technological applications. For example, anisotropic electronic and thermal transport are thought to be beneficial for thermoelectric applications, while anisotropic mechanical properties are of interest for emerging metamaterials, and anisotropic dielectric materials have been suggested as a novel platform for dark matter detection. Understanding and tailoring anisotropy in crystals is therefore essential for the design of next-generation functional materials. To date, however, most data-driven approaches have focused on the prediction of scalar crystal properties, such as the spherically averaged dielectric tensor or the bulk and shear elastic moduli. Here, we adopt the latest approaches in equivariant graph neural networks to develop a model that can predict the full dielectric tensor of crystals. Our model, trained on the Materials Project dataset of c.a. 6,700 dielectric tensors, achieves state-of-the-art accuracy in scalar dielectric prediction in addition to capturing the directional response. We showcase the performance of the model by discovering crystals with almost isotropic connectivity but highly anisotropic dielectric tensors, thereby broadening our knowledge of the structure-property relationships in dielectric crystals.\n\n", "2405.07546": "2024-05-13, **Dynamical systems of modified Gauss-Bonnet gravity: cosmological implications**, Ashutosh Singh et.al., [2405.07546v1](http://arxiv.org/abs/2405.07546v1)\n\n In this paper, we derive the field equations of modified Gauss-Bonnet gravity termed as $f(R,G)$ gravity for the non-flat Friedmann-Robertson-Walker (FRW) spacetime. We utilize the dynamical system approach to study the cosmic dynamics of two different class of $f(R,G)$ models composed of radiation and matter (cold dark matter and baryonic matter). The linear perturbations around the fixed points are studied to explore the corresponding stability of points. The cosmological implications are studied in $f(R,G)=f\\_0R^nG^{1-n}$ and $f(R,G)=f\\_0R^\\alpha+f\\_1G^\\beta$ models to identify the qualitative evolution of universe with the flat-FRW spacetime. The qualitative differences between the considered class of models are discussed in detail. The fixed points corresponding to the late-time accelerated and radiation phase of the universe will exist in the model but, the existence of fixed point corresponding to the matter dominated phase will depend on the functional form of $f(R,G)$. Furthermore, the autonomous systems are utilized to study the cosmographic parameters along with the statefinder diagnostic.\n\n", "2405.07531": "2024-05-13, **Apparent and emergent dark matter around a Schwarzschild black hole**, Reggie C. Pantig et.al., [2405.07531v1](http://arxiv.org/abs/2405.07531v1)\n\n Inspired by the two different dark matter frameworks that were studied recently: one that arises from the non-local effects of entanglement entropy as emergent gravity (characterized by the parameter $\\xi(M)$, and zero-point scale length $l$), and one from dark energy viewed as a superconducting medium (characterized by $\\eta(M)$, and screening length parameter $\\lambda\\_{\\rm G}$), two black hole solutions spherically surrounded with these dark matter models were derived. The effect of these two frameworks on SMBH was analyzed through the resulting deviations in the null regions and the black hole shadow. In addition, constraints to the parameters $\\xi$ and $\\eta$ (at $3\\sigma$ level) were found using the available EHT data for Sgr. A* and M87*. These constraints allow one to deduce the effective mass $M$, which causes uncertainties in the measurement. On the other hand, if the effective mass is known, one can also deduce the constants associated with $\\xi$, and $\\eta$. The former framework also introduces an Appell function, a hypergeometric function of two variables that separately allows the analysis of macroscopic and (hypothetical) microscopic black holes. This first framework was found to decrease the radii of the null regions respective to the Schwarzschild counterpart. The shadow radius, however, behaves reversibly. The result of the numerical analysis for the latter framework revealed increased values for the photonsphere and shadow radii. Remarkably, the study also showed that for SMBHs, the amplifying effects of $\\lambda\\_{\\rm G}$ are stronger than the scale length $l$. Finally, results of constraints, as an example, for the upper bound in $\\xi$ for M87* indicated that the effective mass causing the deviation was around $2.4\\times 10^{20} M\\_{\\odot}$ given that the observed Milgrom's constant is $5.4\\times 10^{-10} \\text{ m/s}^2$.\n\n", "2405.07484": "2024-05-13, **Extended Bose-Einstein condensate dark matter in $f(Q)$ gravity**, Aaqid Bhat et.al., [2405.07484v1](http://arxiv.org/abs/2405.07484v1)\n\n In this article, we attempt to explore the dark sector of the universe i.e. dark matter and dark energy, where the dark energy components are related to the modified $f(Q)$ Lagrangian, particularly a power law function $f(Q)= \\gamma \\left(\\frac{Q}{Q\\_0}\\right)^n$, while the dark matter component is described by the Extended Bose-Einstein Condensate (EBEC) equation of state for dark matter, specifically, $p = \\alpha \\rho + \\beta \\rho^2$. We find the corresponding Friedmann-like equations and the continuity equation for both dark components along with an interacting term, specifically $\\mathcal{Q} = 3b^2H \\rho$, which signifies the energy exchange between the dark sector of the universe. Further, we derive the analytical expression of the Hubble function, and then we find the best-fit values of free parameters utilizing the Bayesian analysis to estimate the posterior probability and the Markov Chain Monte Carlo (MCMC) sampling technique corresponding to CC+Pantheon+SH0ES samples. In addition, to examine the robustness of our MCMC analysis, we perform a statistical assessment using the Akaike Information Criterion (AIC) and Bayesian Information Criterion (BIC). Further from the evolutionary profile of the deceleration parameter and the energy density, we obtain a transition from the decelerated epoch to the accelerated expansion phase, with the present deceleration parameter value as $q(z=0)=q\\_0=-0.56^{+0.04}\\_{-0.03}$ ($68 \\%$ confidence limit), that is quite consistent with cosmological observations. In addition, we find the expected positive behavior of the effective energy density. Finally, by examining the sound speed parameter, we find that the assumed theoretical $f(Q)$ model is thermodynamically stable.\n\n", "2405.07215": "2024-05-12, **Testing Cotton gravity as dark matter substitute with weak lensing**, Geyu Mo et.al., [2405.07215v1](http://arxiv.org/abs/2405.07215v1)\n\n Harada proposed a modified theory of gravity called Cotton gravity, and argued that it successfully explains the rotation curves of $84$ galaxies without the need of dark matter. In this work we use galaxy-galaxy lensing technique to test whether the modification effect of Cotton gravity can indeed be a viable substitute for dark matter. Using the spherically symmetric solution of Cotton gravity, we obtain the deflection angle via Gauss-Bonnet theorem and the weak lensing shear. We use five galaxy catalogs divided in 5 stellar mass bins from the Sloan Digital Sky Survey Data Release 7 (SDSS DR7), each of which is further divided into blue star forming galaxy and red passive galaxy sub-catalogs. We find that Cotton gravity on its own has significant deviation from the measured galaxy-galaxy lensing signals, thus it cannot replace the role of dark matter. If we consider the combination of dark matter and Cotton gravity, the modification is tightly constrained. Our analysis also applies to other modified gravity theories whose an additional linear term appears in the Schwarzschild solution.\n\n"}, "supernova": {"2405.07964": "2024-05-13, **Early phase simultaneous multi-band observations of Type II supernova SN 2024ggi with Mephisto**, Xinlei Chen et.al., [2405.07964v1](http://arxiv.org/abs/2405.07964v1)\n\n We present early-phase good cadence simultaneous multi-band ($ugi$, $vrz$--bands) imaging of nearby supernova SN 2024ggi, which exploded in the nearby galaxy, NGC~3621. A quick follow-up was conducted within less than a day after the explosion and continued $\\sim$23 days. The $uvg$-band light curves display a rapid rise ($\\sim$1.4 mag day$^{-1}$) to maximum in $\\sim$4 days and absolute magnitude $M\\_{g}\\sim$--17.75 mag. The post-peak decay rate in redder bands is $\\sim$0.01 mag day$^{-1}$. Different colors (e.g., $u-g$ and $v-r$) of SN~2024ggi are slightly redder than SN~2023ixf. A significant rise ($\\sim$12.5 kK) in black-body temperature (optical) was noticed within $\\sim$2 days after the explosion, which successively decreased, indicating shock break out inside a dense circumstellar medium (CSM) surrounding the progenitor. Using semi-analytical modeling, the ejecta mass and progenitor radius were estimated as 1.2 M$\\_{\\odot}$ and $\\sim$550 R$\\_{\\odot}$, respectively. The archival deep images ($g,r,i,z$-bands) from the Dark Energy Camera Legacy Survey (DECaLS) were examined, and a possible progenitor was detected in each band ($\\sim$22--22.5 mag) and had a mass range of 14--17 M$\\_{\\odot}$.\n\n", "2405.07856": "2024-05-13, **The oldest stars with low neutron-capture element abundances and origins in ancient dwarf galaxies**, Hillary Diane Andales et.al., [2405.07856v1](http://arxiv.org/abs/2405.07856v1)\n\n We present a detailed chemical abundance and kinematic analysis of six extremely metal-poor ($-4.2 \\leq$ [Fe/H] $\\leq-$2.9) halo stars with very low neutron-capture abundances ([Sr/H] and [Ba/H]) based on high-resolution Magellan/MIKE spectra. Three of our stars have [Sr/Ba] and [Sr/H] ratios that resemble those of metal-poor stars in ultra-faint dwarf galaxies (UFDs). Since early UFDs may be the building blocks of the Milky Way, extremely metal-poor halo stars with low, UFD-like Sr and Ba abundances may thus be ancient stars from the earliest small galactic systems that were accreted by the proto-Milky Way. We label these objects as Small Accreted Stellar System (SASS) stars, and we find an additional 61 similar ones in the literature. A kinematic analysis of our sample and literature stars reveals them to be fast-moving halo objects, all with retrograde motion, indicating an accretion origin. Because SASS stars are much brighter than typical UFD stars, identifying them offers promising ways towards detailed studies of early star formation environments. From the chemical abundances of SASS stars, it appears that the earliest accreted systems were likely enriched by a few supernovae whose light element yields varied from system to system. Neutron-capture elements were sparsely produced and/or diluted, with $r$-process nucleosynthesis playing a role. These insights offer a glimpse into the early formation of the Galaxy. Using neutron-capture elements as a distinguishing criterion for early formation, we have access to a unique metal-poor population that consists of the oldest stars in the universe.\n\n", "2405.07783": "2024-05-13, **The $γ$-process nucleosynthesis in core-collapse supernovae II. Effect of the explosive recipe**, Lorenzo Roberti et.al., [2405.07783v1](http://arxiv.org/abs/2405.07783v1)\n\n The $\\gamma$-process in core-collapse supernovae (CCSNe) can produce a number of neutron-deficient stable isotopes heavier than iron (p-nuclei). However, current model predictions do to not fully reproduce the solar abundances. We investigate the impact of different explosion energies and parameters on the nucleosynthesis of p-nuclei, by studying stellar models with different initial masses and CCSN explosions. We find that the total p-nuclei yields are only marginally affected by the CCSN explosion prescriptions if the $\\gamma$-process production is already efficient in the stellar progenitors due to a C-O shell merger. In most of CCSN explosions from progenitors without C-O shell merger, the $\\gamma$-process yields increase with the explosion energy up to an order of magnitude, depending on the progenitor structure and the CCSN prescriptions. The trend of the p-nuclei production with the explosion energy is more complicated if we look at the production of single p-nuclei. The light p-nuclei tend to be the most enhanced with increasing the explosion energy. In particular, for the CCSN models where the $\\alpha$-rich freeze-out component is ejected, the yields of the lightest p-nuclei increase by up to three orders of magnitude. We provide the first extensive study using different sets of massive stars of the impact of varying CCSN explosion prescriptions on the production of the p-nuclei. Unlike previous expectations and recent results in the literature, we find that the average production of p-nuclei tends to increase with the explosion energy. We also confirm that the pre-explosive production of p-nuclei in C-O shell mergers is a robust result, independently from the subsequent explosive nucleosynthesis. A realistic range of variations in the evolution of stellar progenitors and in the CCSN explosions might boost the CCSN contribution to the galactic chemical evolution of p-nuclei.\n\n", "2405.07743": "2024-05-13, **The interaction of gravitational waves with matter**, Nigel T. Bishop et.al., [2405.07743v1](http://arxiv.org/abs/2405.07743v1)\n\n It is well-known that gravitational waves (GWs) undergo no absorption or dissipation when traversing through a perfect fluid. However, in the presence of a viscous fluid, GWs transfer energy to the fluid medium. In this essay, we present a review of our recent series of results regarding the interaction between gravitational waves and surrounding matter. Additionally, we examine the impact of a viscous fluid shell on gravitational wave propagation, focusing particularly on GW damping and GW heating. Furthermore, we explore the significance of these effects in various astrophysical scenarios such as core-collapse Supernovae and primordial gravitational waves.\n\n", "2405.07699": "2024-05-13, **The Red Supergiant Progenitor of Type II Supernova 2024ggi**, Danfeng Xiang et.al., [2405.07699v1](http://arxiv.org/abs/2405.07699v1)\n\n We present a detailed analysis of the progenitor and its local environment for the recently discovered type II supernova (SN) 2024ggi at a distance of about 6.7~Mpc, by utilizing the pre-explosion images from the Hubble Space Telescope (HST) and \\textit{Spitzer} Space Telescope. The progenitor is identified as a red, bright variable star, with absolute $F814W$-band magnitudes being $-$6.2 mag in 1995 to $-$7.2 mag in 2003, respectively, consistent with that of a normal red supergiant (RSG) star. Combining with the historical mid-infrared light curves, a pulsational period of about 379~days can be inferred for the progenitor star. Fitting its spectral energy distribution with stellar spectral models yields the stellar parameters of temperature, radius and bolometric luminosity as $T\\_*=3290\\_{-27}^{+19}$~K, $R\\_*=887\\_{-51}^{+60}$~R$\\_{\\odot}$, and log($L$/L$\\_{\\odot}$)$=4.92\\_{-0.04}^{+0.05}$, respectively. The above parameters indicate that the progenitor of SN 2024ggi is consistent with the stellar evolutionary track of a solar-metallicity massive star with an initial mass of $13\\_{-1}^{+1}$~M$\\_{\\odot}$. Moreover, our analysis indicates a relatively low mass loss rate (i.e., $< 3\\times10^{-6}$~M$\\_{\\odot}$~yr$^{-1}$) for the progenitor compared to that inferred from the flashed spectra and X-ray detection (i.e., $10^{-2}$$-$$ 10$$^{-5}$~M$\\_{\\odot}$~yr$^{-1}$), implying a significant enhancement in mass loss within a few years prior to the explosion.\n\n", "2405.07577": "2024-05-13, **Discovery of a shock-compressed magnetic field in the north-western rim of the young supernova remnant RX J1713.7-3946 with X-ray polarimetry**, Riccardo Ferrazzoli et.al., [2405.07577v1](http://arxiv.org/abs/2405.07577v1)\n\n Supernova remnants (SNRs) provide insights into cosmic-ray acceleration and magnetic field dynamics at shock fronts. Recent X-ray polarimetric measurements by the Imaging X-ray Polarimetry Explorer (IXPE) have revealed radial magnetic fields near particle acceleration sites in young SNRs, including Cassiopeia A, Tycho, and SN 1006. We present here the spatially-resolved IXPE X-ray polarimetric observation of the northwestern rim of SNR RX J1713.7-3946. For the first time, our analysis shows that the magnetic field in particle acceleration sites of this SNR is oriented tangentially with respect to the shock front. Because of the lack of precise Faraday-rotation measurements in the radio band, this was not possible before. The average measured polarization degree (PD) of the synchtrotron emission is 12.5 {\\pm} 3.3%, lower than the one measured by IXPE in SN 1006, comparable to the Tycho one, but notably higher than the one in Cassiopeia A. On sub-parsec scales, localized patches within RX J1713.7-3946 display PD up to 41.5 {\\pm} 9.5%. These results are compatible with a shock-compressed magnetic field. However, in order to explain the observed PD, either the presence of a radial net magnetic field upstream of the shock, or partial reisotropization of the turbulence downstream by radial magneto-hydrodynamical instabilities, can be invoked. From comparison of PD and magnetic field distribution with {\\gamma}-rays and 12 CO data, our results provide new inputs in favor of a leptonic origin of the {\\gamma}-ray emission.\n\n", "2405.07485": "2024-05-13, **The Energy Sources, the Physical Properties, and the Mass-loss History of SN 2017dio**, Deng-Wang Shi et.al., [2405.07485v1](http://arxiv.org/abs/2405.07485v1)\n\n We study the energy sources, the physical properties of the ejecta and the circumstellar medium (CSM), as well as the mass-loss history of the progenitor of SN 2017dio which is a broad-lined Ic (Ic-BL) supernova (SN) having unusual light curves (LCs) and signatures of hydrogen-rich CSM in its early spectrum. We find that the temperature of SN 2017dio began to increase linearly about 20 days after the explosion. We use the $^{56}$Ni plus the ejecta-CSM interaction (CSI) model to fit the LCs of SN 2017dio, finding that the masses of the ejecta, the $^{56}$Ni, and the CSM are $\\sim$ 12.41 M$\\_\\odot$, $\\sim$ 0.17 M$\\_\\odot$, and $\\sim$ 5.82 M$\\_\\odot$, respectively. The early-time photosphere velocity and the kinetic energy of the SN are respectively {$\\sim$ 1.89 $\\times 10^4$ km s$^{-1}$} and $\\sim$ 2.66 $\\times 10^{52}$ erg, which are respectively comparable to those of SNe Ic-BL and hypernovae (HNe). We suggest that the CSM of SN 2017dio might be {from an luminous-blue-variable-like outburst or} pulsational pair instability $\\sim$ 1.2$-$11.4 yr prior to the SN explosion{, or binary mass transfer}. {Moreover,} we find that its ejecta mass is larger than those of many SNe Ic-BL, and that its $^{56}$Ni mass ($M\\_{\\rm Ni}$) is approximately equal to the mean (or median) value of $M\\_{\\rm Ni}$ of SNe Ic-BL in the literature, but lower than $M\\_{\\rm Ni}$ of prototype HNe (e.g., SN 1998bw and SN 2003dh).\n\n", "2405.07446": "2024-05-13, **A Generic Model for Persistent Radio Source around Fast Radio Bursts**, Yushan Chen et.al., [2405.07446v1](http://arxiv.org/abs/2405.07446v1)\n\n The repeated fast radio burst FRB 121102A and FRB 190520B has been reported, along with a spatially coincident, compact, persistent radio emission. In this paper, we present a parameterized one-zone model, with a basic scenario that a relativistic magnetized wind from the pulsar sweeps up the surroundings, e.g. freely expanding supernova ejecta, giving rise to a power-law distribution of electron filled between the forward shock and the termination shock. We show that via appropriate adjustment of the model parameters, we can obtain the synchrotron radio emission properties from the one-zone model bright enough to account for observation, simply and analytically fitting the observed spectra well. Through dynamical evolution of the model, we can also obtain time-varying of relevant properties. This parameterized model does not depend on concrete physical models such as central engine, instead we can constraint physical model via comparison between parameters and observation, indicating the information about the central engine and surroundings. We also discuss the synchrotron self-Compton emission in our scenario in the end, but find no clue on the counterparts at other waveband.\n\n"}}