{"neutrino": {"2511.21650": "2025-11-26, **Updated bounds on the (1,2) neutrino oscillation parameters after first JUNO results**, Francesco Capozzi et.al., [2511.21650v1](http://arxiv.org/abs/2511.21650v1)\n\n Within the standard $3ν$ framework, we discuss updated bounds on the leading oscillation parameters related to the $(ν\\_1,\\,ν\\_2)$ states, namely, the squared mass difference $δm^2=m^2\\_2-m^2\\_1$ and the mixing parameter $\\sin^2θ\\_{12}$. A previous global analysis of 2024 oscillation data estimated $δm^2$ and $\\sin^2θ\\_{12}$ with fractional $1σ$ errors of about $2.3\\%$ and $4.5\\%$, respectively. First we update the analysis by applying the latest SNO+ constraints, that slightly shift the $(δm^2,\\,\\sin^2θ\\_{12})$ best fits. Then we apply the constraints placed by the first JUNO results, that significantly reduce the uncertainties of both parameters. Our updated global bounds (as of 2025) can be summarized as: $δm^2/10^{-5}{\\rm eV}^2 = 7.48\\pm 0.10$ and $\\sin^2θ\\_{12}=0.3085\\pm0.0073$ (with correlation $ρ=-0.20$), corresponding to $1σ$ uncertainties as small as $1.3\\%$ and $2.4\\%$, respectively. We also comment on minor physical and statistical effects that, in the future, may contribute to lift the current mass-ordering degeneracy of $(δm^2,\\,θ\\_{12})$ estimates.\n\n", "2511.21634": "2025-11-26, **Cosmological Probes of Lepton Parity Freeze-in Dark Matter: $ΔN_{\\rm eff}$ & Gravitational Waves**, Ernest Ma et.al., [2511.21634v1](http://arxiv.org/abs/2511.21634v1)\n\n In the canonical type-I seesaw mechanism for neutrino masses, a residual symmetry known as lepton parity: $(-1)^L$, remains preserved. Introducing a Majorana fermion $S$ with even lepton parity renders it naturally stable, making it a viable dark matter (DM) candidate. The addition of a lepton parity odd singlet scalar $σ$ allows for the coupling $N S σ$, where $N$ is the right-handed neutrino. If $S$ is not thermalized, then DM relic can be produced in two distinct ways: (i) for reheating temperature, $T\\_{\\rm rh}>m\\_{N}$, dominantly through the decay of $N$ ($N\\rightarrow Sσ$), and (ii) for $T\\_{\\rm EW}<T\\_{\\rm rh}\\ll m\\_{N}$, via standard model Higgs ($h$) decay ($h\\rightarrow SS$ at one loop). If the $σ-h$ quartic coupling is large, then it can lead to a strong first-order electroweak phase transition even if $\\langleσ\\rangle=0$. Alternatively, if $σ-h$ coupling is small, then $σ$ can freeze out with a larger abundance, and hence its decay ($σ\\rightarrow Sν$) at late epochs can give rise to additional relativistic degrees of freedom ($Δ{N}\\_{\\rm eff}$). Thus, the framework gives a viable DM with mass range varying from MeV to TeV and leaves observable imprints, via gravitational waves and $Δ{N}\\_{\\rm eff}$, which offer complementary probes, potentially detectable in future gravitational wave and CMB experiments.\n\n", "2511.21627": "2025-11-26, **Evidence For A Correlation Between Astrophysical Neutrinos and Radio Flares**, Yjan A. Gordon et.al., [2511.21627v1](http://arxiv.org/abs/2511.21627v1)\n\n We use data from the first two epochs of the Very Large Array Sky Survey (VLASS) and the IceCube Neutrino Observatory to search for evidence of a correlation between radio variability and the detection of astrophysical neutrinos. We find an excess number of associations between flaring radio sources and neutrinos that were detected between the first and second VLASS observations at $>2σ$ confidence. This excess is consistent with radio flares contributing $\\sim13\\,\\%$ of the astrophysical neutrinos observed by IceCube. Notably $>80\\,\\%$ of the radio flares associated with neutrinos are not detected at either $γ$-ray or X-ray wavelengths, highlighting the importance of radio observations for identifying potential electromagnetic counterparts to astrophysical neutrinos. No excess in the number of associations between the wider radio-variable population and the IceCube neutrinos is seen when no time constraint is placed on the neutrino detection. We predict that data from future VLASS epochs will see an excess number of associations between radio flares and neutrinos at the $>3σ$ level, and expected improvements to the positional constraints on the neutrinos may increase that confidence to $>5σ$, should our results be representative.\n\n", "2511.21532": "2025-11-26, **Simulations of high-energy neutrino emissions from blazars with the LeHa-Paris code**, Francesco Carenini et.al., [2511.21532v1](http://arxiv.org/abs/2511.21532v1)\n\n The identification of astrophysical sources responsible for high-energy cosmic neutrinos has long been a challenge. A significant milestone was achieved with the blazar TXS 0506+056, which was found to be in a flaring state of high gamma-ray emission and associated at the 3$σ$ level with a 290 TeV neutrino detected by IceCube in September 2017. This discovery motivated deeper exploration of the theoretical link between photon and neutrino emissions. In this context, simulations of proton-photon interactions in blazars and radiative processes are conducted using advanced numerical codes to predict neutrino spectra. The LeHa-Paris code, previously applied to TXS 0506+056, enables the computation of both leptonic and hadronic components of blazar spectral energy distributions, facilitating exploration of a broad parameter space. In this work, starting from the case of PKS 2155-304, one of the brightest and most studied High-frequency-peaked BL Lacs (HBLs), known for its extreme variability and subject of multi-wavelength observational campaigns, a methodology has been developed to extend neutrino flux templates, optimized via LeHa-Paris, to the full class of HBLs. Afterwards, neutrino emission models for a subset of HBLs from the 3HSP catalogue are derived.\n\n", "2511.21190": "2025-11-26, **Molybdenum and ruthenium in the Galactic disk: A closer look at their nucleosynthesis components**, Tamara Mishenina et.al., [2511.21190v1](http://arxiv.org/abs/2511.21190v1)\n\n The stellar origin of the elements molybdenum (Mo, Z=42) and ruthenium (Ru, Z=44) is still a matter of debate. Studying their abundances provides valuable insights into nucleosynthesis processes and the broader evolution of neutron-capture elements. We presented new observations of Mo and Ru, together with nearby neutron-capture elements strontium (Sr) and zirconium (Zr) for a new sample of 154 giant stars, located in the Galactic disk with metallicities -1 < [Fe/H] < +0.3. The abundances were determined under the assumption of the local thermodynamic equilibrium by fitting synthetic spectra. The abundances of Mo were derived from the Mo I lines at 5506 and 5533 A, the abundances of Ru were determined from Ru I lines at 4584, and 4757 A. For most of the giant stars observed in this work, Mo and Ru abundances were determined for the first time. We compare our observations with the signatures from different nucleosynthesis processes. Both the [Mo/Fe] and [Ru/Fe] in our stars show a decreasing trend with respect to increasing [Fe/H]. This pattern is similar to that of [Zr/Fe], whereas [Sr/Fe] exhibits a relatively flat trend with metallicity. Compared to the s-process ratios, all stars show a lower [Zr/Mo] and a higher [Ru/Mo], as expected from classical nucleosynthesis. Still, it is unclear if additional contributions from neutrino-wind components or the i-process is needed to explain the observed scatter of [Zr/Mo] and [Ru/Mo] in the Milky Way disk. Indeed, such a dispersion is consistent with the variations also seen in r-II stars at low metallicity and could therefore result from the combined contributions of r-process and s-process to galactic chemical evolution. The observed [Zr/Mo] and [Ru/Mo] scatter in r-II stars should be constrained by future investigations to define if any contributions of additional nucleosynthesis components are needed.\n\n"}, "dark matter": {"2511.21520": "2025-11-26, **Freeze-in at Low Reheating and Direct Detection of Fermion Dark Matter**, Amir Amiri et.al., [2511.21520v1](http://arxiv.org/abs/2511.21520v1)\n\n We investigate a low-reheating-temperature freeze-in scenario within a minimal model of fermionic dark matter interacting through a pseudoscalar mediator. In this setup, dark matter is produced via the decay of the pseudoscalar, which remains in thermal equilibrium with the Standard Model bath. We derive the thermalization and non-thermalization conditions for the new fields and obtain the corresponding direct-detection constraints and projections on the model based on LZ and DARWIN experiments, respectively.\n\n", "2511.21468": "2025-11-26, **Testing modified gravity with 3x2pt analyses in galaxy mocks**, Marc Alemany-Gotor et.al., [2511.21468v1](http://arxiv.org/abs/2511.21468v1)\n\n Stage-IV surveys will enable unprecedented tests of gravity on cosmological scales. However, assuming General Relativity in the analysis of large-scale structure could introduce systematic biases if gravity deviates from GR at these scales. Modified gravity theories, such as the Hu-Sawicki formulation of $f(R)$ gravity, offer an alternative explanation for cosmic acceleration without invoking a cosmological constant, while remaining consistent with Solar System tests through screening mechanisms. In this work, we quantify the cosmological parameter biases that arise when using a combination of galaxy clustering and weak-lensing data-vectors, the so-called 3x2pt analysis, from an $f(R)$ galaxy mock under the incorrect assumption of GR, using for the first time high-fidelity full-sky galaxy mock catalogues. We employ a pair of twin simulations: one with GR and one with Hu--Sawicki $f(R)$ gravity with $\\|f\\_{R0}\\| = 10^{-5}$. The mocks are built using an HOD method to populate the dark matter haloes with galaxies, calibrated against SDSS observations at low redshift. Using conservative scale cuts to minimise modelling uncertainties, we perform 3x2pt analyses and infer cosmological parameters through nested sampling, validating our pipeline with the GR mock. Our results show that when analysing the $f(R)$ galaxy mock assuming GR, the recovered cosmological parameters are very significantly biased, even when considering conservative scale cuts: the Figure of Bias reaches $\\sim12σ$ for both $\\{Ω\\_{\\rm m}, σ\\_8\\}$ and $S\\_8$. These biases persist even when marginalising over the galaxy bias and baryonic feedback, demonstrating that nuisance parameters cannot absorb the effects of modified gravity. We conclude that incorrectly assuming GR in a universe governed by $f(R)$ gravity leads to severe and detectable biases in cosmological inference for Stage-IV surveys.\n\n", "2511.21362": "2025-11-26, **Weak gravity at micron scales from dark bubble cosmology and its cosmological consequences**, Ulf Danielsson et.al., [2511.21362v1](http://arxiv.org/abs/2511.21362v1)\n\n The dark bubble model makes a positive cosmological constant natural in string theory, and predicts several new physical phenomena within reach in the near future. In this paper we study the experimental consequences of the model for the strength of gravity at scales of order $10^{-5}$m. Contrary to other models of gravity involving extra dimensions, the dark bubble model predicts gravity to become weaker rather than stronger at small scales, compared to Newtonian gravity. In particular, we provide explicit predictions of measurable deviations using table top experiments. We also show how the same effect reduces the effective force of gravity at high energy densities in cosmology, leading to a period of early inflation without the need for anything beyond radiation. We also discuss the quantum origin of the universe with a 5D black hole acting as a catalyst for the nucleation of the dark bubble and how it accounts for the present matter content in the universe. This leads to a prediction of $Ω\\_c \\approx 5\\times 10^{-4}$ for a positive curvature of the universe, suggesting an explanation of the why-now-problem of the cosmological constant. We end by speculating on how to incorporate AdS black shells as black hole mimickers within the dark bubble model.\n\n", "2511.21290": "2025-11-26, **Exploring muonphilic dark matter with the $Z_2$-even mediator at muon colliders**, Wanyun Chen et.al., [2511.21290v1](http://arxiv.org/abs/2511.21290v1)\n\n The Galactic Center GeV Excess (GCE) remains a compelling but enigmatic signal from the inner region of our galaxy. Muonphilic dark matter (DM), which couples exclusively to muons via a new mediator, provides a viable explanation for the GCE and relic density while naturally evading constraints from direct detection, collider searches and other multi-messenger observations. Based on the viable non-resonant parameter space identified in previous global fits, we perform a comprehensive study exploring the prospects for discovering such muonphilic DM in the context of a future $3$ TeV muon collider, focusing on simplified models with a $Z\\_2$-even mediator. Three distinct search strategies are investigated: visible on-shell mediator decays ($μ^{+}μ^{-}γ$ final state), invisible on-shell mediator decays (mono-photon plus missing energy), and mono-photon production via off-shell mediators. Through a detailed signal-background analysis using cut-and-count methods, we project the exclusion limits at $95\\%$ confidence level for seven representative models across a wide range of mediator masses. Our results demonstrate that the projected limits cover a significant portion of the viable parameter space that explains the GCE, establishing a muon collider as a decisive machine for testing the muonphilic DM hypothesis.\n\n", "2511.21071": "2025-11-26, **Cosmological tensions in Proca-Nuevo theory**, Hsu-Wen Chiang et.al., [2511.21071v1](http://arxiv.org/abs/2511.21071v1)\n\n We study the cosmological predictions of (extended) Proca-Nuevo theory. This vector-tensor theory enjoys stable homogeneous and isotropic solutions characterized by an effective dark energy fluid, with behavior that ranges from freezing quintessential to thawing phantom-like, serving as a motivated framework to scrutinize the cosmological tensions that affect the standard $Λ$CDM model. While the model we consider is sufficiently generic to encompass a large class of field theories, it distinguishes itself from scalar dark energy models (quintessential ones, kinetic ones and non-minimally coupled ones) by the presence of what would be classed as a vector degree of freedom which can be for instance inherited from more generic theories of gravity. We improve on previous work in several directions: we consider a general one-parameter class of background models; identify a so-called 'special' model and analyze observational constraints taking also into account perturbations and making use of wide up-to-date catalogs of datasets including recently released ones. We find that the one-parameter Proca-Nuevo model is preferred over $Λ$CDM at $1.5σ$ when fitting CMB and BAO data, and at $2.4σ$ when further adding low-redshift data. The Hubble tension is alleviated, dropping from $5.8σ$ to $2.3σ$ (resp. $1.5σ$) between CMB with (and resp. without) BAO data and local measurements. On the other hand, we find that the vector field generically introduces a significant enhancement of the effective Newton constant, so that matching the observed matter power spectrum requires a mild amount of tuning to suppress the impact of perturbations. Since, at the background level, Proca-Nuevo is degenerate with other classes of theories, our results are also relevant to a wider range of set-ups including and beyond vector-tensor models.\n\n", "2511.20952": "2025-11-26, **Oscillations of dark matter halos in galaxies**, V. V. Flambaum et.al., [2511.20952v1](http://arxiv.org/abs/2511.20952v1)\n\n Baryonic matter and dark matter in galaxies represent two substances linked by the gravitational interaction. Collisions of galaxies may create an offset between the centers of mass of these two components. Ignoring internal dynamics of particles in the dark matter halo and Keplerian rotations of stars in the galaxy, we focus on possible relative oscillations of the visible matter in the dark matter halo. This two-fluid model is somewhat similar to the ``giant dipole resonances'' in nuclei. We estimate possible amplitude and frequency of such oscillations assuming that the offset of the centers of mass is small as compared with the size of the galaxy. Such oscillations, if exist, should manifest themselves in anomalies of velocities of stars in the galaxy, such as the density waves and runaway stars which have orbit periods in resonance with oscillations. These matter -- dark matter oscillations may affect direction and magnitude of the dark matter wind coming to Earth.\n\n"}, "supernova": {"2511.21567": "2025-11-26, **Enhanced antineutrino emission from $β$ decay in core-collapse supernovae with self-consistent weak decay rates**, T. Dasher et.al., [2511.21567v1](http://arxiv.org/abs/2511.21567v1)\n\n Nuclear weak-interaction rates are known to exert a prominent effect in the late-stages of stellar collapse. Despite their importance, most studies to date on core-collapse supernovae (CCSNe) have focused primarily on the effects of electron captures, generally neglecting $β$ decay contributions. In this Letter, we present the first CCSNe simulation incorporating global $β$ decay rates from a microscopic theory. These are enabled by a large-scale evaluation of both electron capture and $β$ decay rates, obtained self-consistently utilizing the relativistic energy density functional theory and finite-temperature quasiparticle random-phase approximation. We find a significant enhancement of antineutrino emissivity by more than 4 orders of magnitude due to the inclusion of $β$ decay rates, as well as 3 orders of magnitude for antineutrino luminosity. It is expected that these new rates could help us constrain the model uncertainties related to weak-interaction processes, improving the prediction of antineutrino signal during the final stages of stellar death and potentially influencing the late-stage evolution of massive stars.\n\n"}}