{"neutrino": {"2408.11736": "2024-08-21, **Tau polarization effects in $ν_τ/ \\barν_τ$-tungsten interactions at the LHC energies**, Reinaldo Francener et.al., [2408.11736v1](http://arxiv.org/abs/2408.11736v1)\n\n Recent studies have demonstrated that the tau produced in charged current neutrino deeply inelastic interactions at the GeV -- TeV neutrino energy range is not fully polarized. In this paper we investigate the impact of the tau polarization on the pions generated in its decay. In particular, we consider tau neutrino - tungsten interactions at the LHC energies and estimate the associated pion momentum, energy and angular distributions. The contribution of the $F\\_5$ is also investigated. Our results indicate that the pion properties are sensitive to the tau polarization state as well as to the magnitude of $F\\_5$.\n\n", "2408.11353": "2024-08-21, **Multi-messenger connection in high-energy neutrino astronomy**, Ankur Sharma et.al., [2408.11353v1](http://arxiv.org/abs/2408.11353v1)\n\n Low fluxes of astrophysical neutrinos at TeV energies and the overwhelming background of atmospheric neutrinos below that, render the current paradigm of neutrino astronomy as a severely statistics limited one. While many hints have emerged, all the evidence gathered by IceCube and ANTARES, over the course of almost a decade and a half of operation, have fallen short of providing any conclusive answer to the puzzle of the origin of high-energy cosmic rays and neutrinos. The advancement of the field is thus closely associated with not only the neutrino observatories coming online in the next few years, but also on the coordinated efforts of the EM, GW and cosmic ray communities to develop dedicated channels and infrastructure that allows for swift and comprehensive multi-messenger follow-up of relevant events detected in any of the sectors. This paper highlights the strides that have been already taken in that direction and the fruits that they have born, as well as the challenges that lie ahead.\n\n", "2408.11118": "2024-08-20, **Loaded layer-cake model for cosmic ray interaction around exploding super-giant stars making black holes**, M. Allen et.al., [2408.11118v1](http://arxiv.org/abs/2408.11118v1)\n\n The AMS experiment on the International Space Station has provided detailed cosmic ray spectra for various elements, revealing that interactions significantly reduce fluxes up to about 100 GV rigidity. This necessitates revisiting current cosmic ray interaction models. A new model proposed here involves cosmic ray interactions first in the wind shock shell of supergiant stars and second in the OB-Superbubble around supernovae. These stars, including red and blue supergiants, produce black holes and drive electric currents in winds and jets. Variability in these winds creates temporary electric fields that accelerate particles, resulting in steep spectra with synchrotron losses, and analogous hadron spectra produce a flat magnetic irregularity spectrum. This model matches AMS data, explaining cosmic ray spectra below 100 GV. The model predicts a secondary/primary ratio slope of -1/3 and a primary flux reduction below 100 GV relative to a power-law spectrum with slope +2. Key aspects are: a larger interaction column due to heavy element enrichment and a minor secondary contribution even for elements like He, C, and O, as indicated by the $^3$He/$^4$He ratio. This model also accounts for cosmic ray anti-protons, gamma-ray spectra, and high-energy neutrinos, including contributions from ISM-SNe.\n\n", "2408.10926": "2024-08-20, **GRANDlib: A simulation pipeline for the Giant Radio Array for Neutrino Detection (GRAND)**, GRAND Collaboration et.al., [2408.10926v1](http://arxiv.org/abs/2408.10926v1)\n\n The operation of upcoming ultra-high-energy cosmic-ray, gamma-ray, and neutrino radio-detection experiments, like the Giant Radio Array for Neutrino Detection (GRAND), poses significant computational challenges involving the production of numerous simulations of particle showers and their detection, and a high data throughput. GRANDlib is an open-source software tool designed to meet these challenges. Its primary goal is to perform end-to-end simulations of the detector operation, from the interaction of ultra-high-energy particles, through -- by interfacing with external air-shower simulations -- the ensuing particle shower development and its radio emission, to its detection by antenna arrays and its processing by data-acquisition systems. Additionally, GRANDlib manages the visualization, storage, and retrieval of experimental and simulated data. We present an overview of GRANDlib to serve as the basis of future GRAND analyses.\n\n", "2408.10910": "2024-08-20, **Optimised neutron yield calculations from ($α,n$) reactions with the modified SOURCES4 code**, Mihaela Parvu et.al., [2408.10910v1](http://arxiv.org/abs/2408.10910v1)\n\n The sensitivity of underground experiments searching for rare events such as dark matter, neutrino interactions or several beyond the standard model phenomena is often limited by the background caused by neutrons from spontaneous fission and ($\\alpha,n$) reactions. A number of codes exist to calculate neutron yields and energy spectra due to these processes. In this paper we present new calculations of neutron production using the modified SOURCES4A code with recently updated cross-sections for ($\\alpha,n$) reactions and the comparison of the results with available experimental data. The cross-sections for ($\\alpha,n$) reactions in SOURCES4 have been taken from reliable experimental data where possible, complemented by the calculations with EMPIRE 2.19/3.2.3, TALYS 1.96 or evaluated data library JENDL-5 where the data were scarce or unavailable.\n\n", "2408.10828": "2024-08-20, **Scalable DAQ system operating the CHIPS-5 neutrino detector**, Belén Alonso Rancurel et.al., [2408.10828v1](http://arxiv.org/abs/2408.10828v1)\n\n The CHIPS R&D project focuses on development of low-cost water Cherenkov neutrino detectors through novel design strategies and resourceful engineering. This work presents an end-to-end DAQ solution intended for a recent 5 kt CHIPS prototype, which is largely based on affordable mass-produced components. Much like the detector itself, the presented instrumentation is composed of modular arrays that can be scaled up and easily serviced. A single such array can carry up to 30 photomultiplier tubes (PMTs) accompanied by electronics that generate high voltage in-situ and deliver time resolution of up to 0.69 ns. In addition, the technology is compatible with the White Rabbit timing system, which can synchronize its elements to within 100 ps. While deployment issues did not permit the presented DAQ system to operate beyond initial evaluation, the presented hardware and software successfully passed numerous commissioning tests that demonstrated their viability for use in a large-scale neutrino detector, instrumented with thousands of PMTs.\n\n", "2408.10632": "2024-08-20, **Neutrino Mass Origin and Flavored-QCD axion in an Extra-Dimension**, Y. H. Ahn et.al., [2408.10632v1](http://arxiv.org/abs/2408.10632v1)\n\n We propose a unified flavor model with the Standard Model fields on two 3-branes within an extra-dimensional setup, incorporating $\\Gamma\\_N\\times U(1)\\_X$ symmetry with a modulus and scalar field responsible for symmetry breaking. When compactified to four dimensions, Yukawa couplings, initially expressed as modular forms with mass dimensions, are normalized to conform to canonical four-dimensional theory, with the Yukawa coefficients being complex numbers of unit absolute value. We show that this model naturally explains the mass and mixing hierarchies of quarks and leptons, solves the strong CP problem, provides a natural solution to the hierarchy problem, and can inherently satisfy no axionic domain-wall problem. The $U(1)\\_X$ mixed gravitational anomaly-free condition necessitates that electrically neutral mirror bulk fermions couple to the normal neutrino field on the 3-brane, consistent with the boundary condition. Consequently, we demonstrate a mechanism for generating light neutrino masses, similar to the Weinberg operator, by transmitting the information of $U(1)\\_X$ breakdown between the two 3-branes. The scale of $U(1)\\_X$ breaking is estimated from neutrino data to be around $10^{15}$ GeV, leading to a QCD axion mass of approximately $2.5\\times10^{-9}$ eV. Through numerical analysis, we demonstrate that the model yields results consistent with current experimental data on quarks and leptons, and it also provides predictions for neutrinos.\n\n", "2408.10621": "2024-08-20, **Analyses of Neutrino Masses in the CP-Violating Standard Model**, Chilong Lin et.al., [2408.10621v1](http://arxiv.org/abs/2408.10621v1)\n\n This article examines the patterns of neutrino masses within the framework of an analytically solvable, CP-violating Standard Model (CPVSM). Using two experimentally determined mass-squared differences (MSDs), $\\Delta\\_a$ and $\\Delta\\_b$, three neutrino masses are predicted.   In the CPVSM, when $\\bf C$ = 0, or equivalently $\\gamma$ = 0, two of the three mass eigenvalues within a fermion type become degenerate. This suggests that the splitting of these masses may have resulted from a symmetry-breaking event in the early universe.   The study explores all six possible correspondences between the experimentally observed $\\Delta\\_a$ and $\\Delta\\_b$ and three quantities $\\Delta\\_{hl}$, $\\Delta\\_{ml}$, and $\\Delta\\_{hm}$. Of these six scenarios, four provide reasonable predictions for the neutrino masses, while two are logically excluded. The model predicts similar values for the heaviest neutrino mass, $m\\_h \\approx 5.0 \\cdot 10^{-2}$ eV, and the lightest mass, $m\\_l \\approx 6.091 \\cdot 10^{-3}$ eV. However, it offers two possible values for the middle mass: $m\\_m \\approx 4.973 \\cdot 10^{-2}$ eV or $m\\_m \\approx 1.055 \\cdot 10^{-2}$ eV. Additionally, CP violation in the lepton sector is predicted to be about 73 orders of magnitude weaker than that in the quark sector.\n\n"}, "dark matter": {"2408.11452": "2024-08-21, **A topological contribution to Bogoliubov coefficient for cosmological particle production**, Daniel J. H. Chung et.al., [2408.11452v1](http://arxiv.org/abs/2408.11452v1)\n\n Particle production in cosmology is often efficiently computed in terms of Bogoliubov transforms. Restricting to a particular class of dispersion relationships, we identify a map between the number of particles produced in a special kinematic limit and a Stokes phenomena related topology of analytic continuation of the Bogoliubov coefficient functions. Intuitively, this kinematic limit corresponds to the long wavelength limit although a more precise description depends on the nature of the curved spacetime. To identify the topology, we reformulate the usual Bogoliubov computations as a type of SU(1,1) gauged differential equation and utilize a special gauge together with a discrete symmetry that naturally characterizes the dispersion relationship. Using a dark matter model and a nonzero constant spatial curvature model, we estimate how such topological contributions will arise in physical applications.\n\n", "2408.11421": "2024-08-21, **Scrutinizing the Isotropic Gamma-Ray Background in Search of Dark Matter**, Ilias Cholis et.al., [2408.11421v1](http://arxiv.org/abs/2408.11421v1)\n\n The isotropic gamma-ray background (IGRB), measured by the Fermi Large Area Telescope, is the result of several classes of extragalactic astrophysical sources. Those sources include blazars, start-forming galaxies and radio galaxies. Also, ultra-high-energy cosmic rays interacting with the infrared background, contribute to the isotropic background. Using information from Fermi's gamma-ray sources catalog and the results of dedicated studies of these classes of sources, from observations at the infrared and radio, we model their contribution to the IGRB. In addition to conventional astrophysical sources, dark matter may be a component of the IGRB. We combine our model of conventional astrophysical sources and of dark matter annihilation in distant galaxies, marginalizing over relevant uncertainties, to derive constraints on the dark matter annihilation cross section, from the measured IGRB. In calculating the contribution from dark matter we include the flux from extragalactic halos and their substructure and also the subdominant contribution from Milky Way's halo at high galactic latitudes. The resulting constraints are competitive with the strongest current constraints from the dwarf spheroidal galaxies. Under certain dark matter assumptions, we also find an indication for a small excess flux in the isotropic background. Our results are consistent with the gamma-ray excess at GeV energies toward the galactic center.\n\n", "2408.11284": "2024-08-21, **Parametrized-Post-Newtonian Test of Black Hole Spacetime for Galactic Center Massive Black Hole Sgr A*: Formulation and $χ^2$ Fitting**, Hiromi Saida et.al., [2408.11284v1](http://arxiv.org/abs/2408.11284v1)\n\n We have performed a parametrized post-Newtonian (PPN) test of a black hole spacetime using observational data of the star S0-2/S2 orbiting the massive black hole at our galactic center Sgr A*. After introducing our PPN model of black hole spacetime, we report the result of $\\chi^2$ fitting of the PPN model with the observational data. A new finding through our PPN model is a detectability of the gravitational lens effect on the null geodesics connecting S0-2 and observer under the present observational uncertainties, if a PPN parameter is about one order larger than the value for general relativity case. On the other hand, the effect of black hole spin on the S0-2's motion is not detectable. Thus our present PPN test is performed with spherically symmetric vacuum black hole spacetime. The resultant value of the PPN parameter, which corresponds to the minimum $\\chi^2$, implies that the gravitational field of Sgr A* is not of Schwarzschild metric or that the existence of sufficient amount of dark matters around Sgr A*. However, the difference between the minimum $\\chi^2$ and the $\\chi^2$ of Schwarzschild case is not large enough to ensure a statistical significance of non-Schwarzschild result. A more precise statistical analysis than $\\chi^2$ statistics is necessary to extract a statistically significant information of the gravitational field of Sgr A* from present observational data. We will report a result by a Bayesian analysis in next paper.\n\n", "2408.11246": "2024-08-20, **Solving the strong CP problem with massless grand-color quarks**, Ravneet Bedi et.al., [2408.11246v1](http://arxiv.org/abs/2408.11246v1)\n\n We propose a solution to the strong CP problem that specifically relies on massless quarks and has no light axion. The QCD color group $SU(3)\\_c$ is embedded into a larger, simple gauge group (grand-color) where one of the massless, colored fermions enjoys an anomalous chiral symmetry, rendering the strong CP phase unphysical. The grand-color gauge group $G\\_{\\rm GC}$ is Higgsed down to $SU(3)\\_c\\times G\\_{c'}$, after which $G\\_{c'}$ eventually confines at a lower scale, spontaneously breaking the chiral symmetry and generating a real, positive mass to the massless, colored fermion. Since the chiral symmetry has a $G\\_{c'}$ anomaly, there is no corresponding light Nambu-Goldstone boson. The anomalous chiral symmetry can be an accidental symmetry that arises from an exact discrete symmetry without introducing a domain wall problem. Potential experimental signals of our mechanism include vector-like quarks near the TeV scale, pseudo Nambu-Goldstone bosons below the 10 GeV scale, light dark matter decay, and primordial gravitational waves from the new strong dynamics.\n\n", "2408.11158": "2024-08-20, **A Transition Edge Sensor Operated in Coincidence with a High Sensitivity Phonon Veto for Photon Coupled Rare Event Searches**, Roger K. Romani et.al., [2408.11158v1](http://arxiv.org/abs/2408.11158v1)\n\n Experimental searches for axions or dark photons that couple to the standard model photon require photosensors with low noise, broadband sensitivity, and near zero backgrounds. Here, we introduce a Transition Edge Sensor (TES) based photon sensor with a high sensitivity athermal phonon sensor coupled to the substrate on which the TES is deposited. We show that single photons absorbed locally in the TES have $\\sim$35% energy deposition in the electronic system of the TES, with $\\sim$26% of the photon energy absorbed by the athermal photon sensor (due to athermal phonons leaking out of the TES during the downconversion process). Backgrounds are observed to be largely coupled to either the TES or phonon system. At high energies, these backgrounds can be efficiently discriminated from TES photon absorption events, while at low energies, their leakage into the passage band is well modeled. With significant sensitivity improvements to both the photon and phonon channel, this coincidence technique could be used to suppress backgrounds in bosonic dark matter searches down to energies near the superconducting bandgap of the sensor.\n\n", "2408.11098": "2024-08-20, **Supermassive black holes from inflation constrained by dark matter substructure**, Shin'ichiro Ando et.al., [2408.11098v1](http://arxiv.org/abs/2408.11098v1)\n\n Recent James Webb Space Telescope observations of high-redshift massive galaxy candidates have initiated renewed interest in the important mystery around the formation and evolution of our Universe's largest supermassive black holes (SMBHs). We consider the possibility that some of them were seeded by the direct collapse of primordial density perturbations from inflation into primordial black holes and analyze the consequences of this on current dark matter substructures assuming non-Gaussian primordial curvature perturbation distributions. We derive bounds on the enhanced curvature perturbation amplitude from the number of dwarf spheroidal galaxies in our Galaxy, observations of stellar streams and gravitational lensing. We find this bound region significantly overlaps with that required for SMBH seed formation and enables us to probe Gaussian and non-Gaussian curvature perturbations corresponding to the SMBH seeds in the range ${\\cal O}(10^5$-$10^{12}) M\\_\\odot$.\n\n", "2408.11090": "2024-08-20, **High detection significance of the dark substructure in gravitational lens SDSSJ0946+1006 is revealed by image pixel supersampling**, Quinn E. Minor et.al., [2408.11090v1](http://arxiv.org/abs/2408.11090v1)\n\n Recent studies have shown that the dark substructure reported in the gravitational lens SDSSJ0946+1006 has a high central density which is in apparent tension with the $\\Lambda$CDM paradigm. However, the detection significance of the substructure has been found in Ballard et al. (2024) to be sensitive to the assumed prior on the smoothness of the source galaxy: a sufficiently noisy source allows for noise-level residuals even without including a subhalo in the model. Here we show that the detection significance of the substructure is higher than previously reported ($\\Delta\\ln Z \\approx 143$, equivalent to a $\\sim17\\sigma$ detection) by approximating the integration of light over each pixel via ray tracing and averaging over many subpixels--a technique known as supersampling--and this result is insensitive to the assumed prior on the source galaxy smoothness. Assuming a dark matter subhalo, supersampling also tightens the subhalo constraints: we find that the subhalo's projected mass enclosed within 1 kpc lies within the range $(2.2-3.4)\\times10^9M\\_\\odot$ at the 95\\% confidence level in our highest evidence model, while the log-slope of the subhalo's projected density profile at 1 kpc is steeper than $-1.75$ at the 95\\% confidence level, further establishing it as an outlier compared to expectations from CDM. Supersampling also allows us to identify a systematic within the data that has biased the slope of the primary lensing galaxy's density profile in prior studies, which we speculate might be due to the presence of dust or an imperfect foreground subtraction. Our analysis places the existence of the substructure in SDSSJ0946+1006 on firmer ground, and should motivate deeper follow-up observations to better constrain the properties of this substructure and clarify the severity of its apparent tension with $\\Lambda$CDM.\n\n", "2408.10983": "2024-08-20, **Search for GeV gamma-ray emission from SPT-CL J2012-5649 with six years of DAMPE data**, Siddhant Manna et.al., [2408.10983v1](http://arxiv.org/abs/2408.10983v1)\n\n We search for gamma-ray emission from the galaxy cluster SPT-CL J2012-5649 in the energy range from 3 GeV to 1 TeV using the DArk Matter Particle Explorer (DAMPE) telescope. For our analysis, we use three different templates: point source, radial disk and radial Gaussian. We do not detect a signal with significance $>3\\sigma$ for any of these templates at any location with $R\\_{200}$ of the cluster center. We obtain 95\\% c.l. upper limit on the energy flux between $\\sim 10^{-6}$ and $10^{-4} \\rm{MeV~cm^{-2}~s^{-1}}$ depending on the energy range. These upper limits are consistent with the a non-zero flux detected by Fermi-LAT (at $6\\sigma$ significance) for this cluster. This work represents the first proof of principle search for gamma-ray emission from a single galaxy cluster using DAMPE data.\n\n", "2408.10799": "2024-08-20, **Excluding Primordial Black Holes as Dark Matter Based on Solar System Ephemeris**, Abraham Loeb et.al., [2408.10799v1](http://arxiv.org/abs/2408.10799v1)\n\n Current cosmological constraints allow primordial black holes (PBHs) to constitute dark matter in the mass range of 10^{18}-10^{22}g. We show that a major portion of this logarithmic window can be ruled-out based on the Solar System ephemeris, given that the external mass enclosed within 50 au from the Sun did not change by more than ~5x10^{-14} solar masses per year in recent decades.\n\n", "2408.10735": "2024-08-20, **On the kinematic nature of apparent discs at high redshifts: Local counterparts are not dominated by ordered rotation but by tangentially anisotropic random motion**, Bitao Wang et.al., [2408.10735v1](http://arxiv.org/abs/2408.10735v1)\n\n It is not straightforward to physically interpret the apparent morphology of galaxies. Recent observations by James Webb Space Telescope (JWST) revealed a dominant galaxy population at high redshifts ($z>2$) that were visually classified as discs for their flattened shapes and/or exponential light profiles. The extensively accepted interpretation is that they are dynamically cold discs supported by bulk rotation. However, it is long known that flattened shapes and exponential profiles are not exclusive for rotating disc structure. To break degeneracy and assess the rotational support of typical high-$z$ galaxies in the JWST samples, those with active star formation and stellar masses $\\mathrm{lg}(\\mathcal{M}\\_{\\star}/\\mathcal{M}\\_{\\odot})\\sim9$, we study the kinematics of their equal-mass counterparts at $z=0$. While these local star-forming low-mass galaxies are photometrically similar to real dynamically cold discs, they are not supported by ordered rotation but primarily by random motion, and their flattened shapes result largely from tangential orbital anisotropy. Given the empirical and theoretical evidence that young galaxies are dynamically hotter at higher redshifts, our results suggest that the high-$z$ JWST galaxies may not be cold discs but are dynamically warm/hot galaxies with flattened shapes driven by anisotropy. While both having low rotational support, local low-mass galaxies possess oblate shapes, contrasting the prolate shapes (i.e. cigar-like) of low-mass systems at high redshifts. Such shape transition (prolate$\\Rightarrow$oblate) indicates an associated change in orbital anisotropy (radial$\\Rightarrow$tangential), with roots likely in the assembly of their host dark matter halos.\n\n", "2408.10585": "2024-08-20, **Probing Non-Thermal Gravitinos Through Large-Scale Structure Observations**, Weiyi Deng et.al., [2408.10585v2](http://arxiv.org/abs/2408.10585v2)\n\n We investigate the effects of non-thermally produced dark matter on large-scale structure formation, focusing on the gravitino dark matter. Our analysis shows that large-scale structure measurements from the SDSS LRG data offer a promising approach to probing non-thermally produced gravitinos. Specifically, if gravitinos resulting from neutralino decay constitute a fraction $F\\_\\text{dec}=0.35~(0.1)$ of the dark matter component, the data exclude bino-like neutralino with a mass $m\\_{\\chi\\_1^0}\\lesssim25~(11)\\text{ GeV}$. Furthermore, this constraint appears to be largely independent of the gravitino mass.\n\n", "2408.10559": "2024-08-20, **An Accreting Supermassive Black Hole Buried in a Faint Dwarf Galaxy**, Abhishek Paswan et.al., [2408.10559v1](http://arxiv.org/abs/2408.10559v1)\n\n In the last decade, there have been several discoveries of Active Galactic Nuclei (AGN) in dwarf galaxies including an AGN in an ultra-compact dwarf galaxy with a Black Hole mass $>$10$^{6}$ M$\\_{\\odot}$. However, finding a Supermassive Black Hole (SMBH) in a dwarf Low Surface Brightness (LSB) galaxy is rare. We report the discovery of a Seyfert type-2 class AGN which is associated with a nuclear SMBH of mass $\\sim$6.5 $\\times$ 10$^{6}$ M$\\_{\\odot}$ in a dwarf LSB galaxy ($\\mu\\_{0,r}$ $>$ 23.8 mag/arcsec$^{2}$) that we denote by MJ0818+2257. The galaxy was previously thought to be an outlying emission blob around the large spiral galaxy LEDA 1678924. In our current analysis, which includes the detection of the optical counterpart of MJ0818+2257, we study its ionized gas kinematics and find that the dynamical mass within the ionized gas disk is $\\sim$5.3 $\\times$ 10$^{9}$ M$\\_{\\odot}$. This is comparable to its stellar mass which is $\\sim$3$\\times$ 10$^{9}$ M$\\_{\\odot}$ and suggests that MJ0818+2257 is moderately dark matter-dominated within the stellar disk. The SMBH mass to galaxy stellar mass ratio is $M\\_{BH}/M(*)>0.022$ which is high compared to disk galaxies. Our detection of a SMBH in a bulgeless LSB dwarf galaxy raises questions about the growth of SMBHs in low-luminosity galaxies and suggests the possibility of detecting heavy, seed black holes from early epochs in LSB dwarf galaxies in the low redshift universe.\n\n"}, "supernova": {"2408.11770": "2024-08-21, **JWST Validates HST Distance Measurements: Selection of Supernova Subsample Explains Differences in JWST Estimates of Local H0**, Adam G. Riess et.al., [2408.11770v1](http://arxiv.org/abs/2408.11770v1)\n\n JWST provides new opportunities to cross-check the HST Cepheid/SNeIa distance ladder, which yields the most precise local measure of H0. We analyze early JWST subsamples (~1/4 of the HST sample) from the SH0ES and CCHP groups, calibrated by a single anchor (N4258). We find HST Cepheid distances agree well (~1 sigma) with all 8 combinations of methods, samples, and telescopes: JWST Cepheids, TRGB, and JAGB by either group, plus HST TRGB and Miras. The comparisons explicitly include the measurement uncertainty of each method in N4258, an oft-neglected but dominant term. Mean differences are ~0.03 mag, far smaller than the 0.18 mag \"Hubble tension.\" Combining all measures produces the strongest constraint yet on the linearity of HST Cepheid distances, 0.994+-0.010, ruling out distance-dependent bias or offset as the source of the tension at ~7 sigma. Yet, measurements of H0 from current JWST subsamples produce large sampling differences whose size and direction we can directly estimate from the full HST set. We show that Delta(H0)~2.5 km/s/Mpc between the CCHP JWST program and the full HST sample is entirely consistent with differences in sample selection. Combining all JWST samples produces a new, distance-limited set of 16 SNeIa at D<25 Mpc and more closely resembles the full sample thanks to \"reversion to the mean\" of larger samples. Using JWST Cepheids, JAGB, and TRGB, we find 73.4+-2.1, 72.2+-2.2, and 72.1+-2.2 km/s/Mpc, respectively. Explicitly accounting for SNe in common, the combined-sample three-method result from JWST is H0=72.6+-2.0, similar to H0=72.8 expected from HST Cepheids in the same galaxies. The small JWST sample trivially lowers the Hubble tension significance due to small-sample statistics and is not yet competitive with the HST set (42 SNeIa and 4 anchors), which yields 73.2+-0.9. Still, the joint JWST sample provides important crosschecks which the HST data passes.\n\n", "2408.11128": "2024-08-20, **Massive stellar triples on the edge: A numerical study of the evolution and final outcomes of destabilized massive triples**, C. W. Bruenech et.al., [2408.11128v1](http://arxiv.org/abs/2408.11128v1)\n\n Massive stars reside predominantly in triples or higher-order multiples. Their lives can be significantly affected by three-body interactions, making it an important area of study in the context of massive star evolution. In this study we provide a statistical overview of the lives and final outcomes of destabilized massive triples. A population of initially stable triples with a massive primary star are evolved from the zero-age main sequence using the code TRES, which combines stellar evolution with orbit-averaged dynamics. The triples that become unstable are transferred to a direct N-body code where they are simulated until the system disintegrates. This excludes systems undergoing mass transfer, such that the instability is caused by stellar winds or supernovae. Two suites of N-body simulations are performed; one with gravity as the only interaction, and one with stellar evolution included. We find that collisions occur in 35 - 40% of systems, with the variation coming from whether stellar evolution is included. The collisions mainly involve two main sequence stars (70 - 78%) or a main sequence and post-main sequence star (13 - 28%). We estimate a Galactic rate of collisions due to massive triple destabilization at 1.1 - 1.3 events per Myr. Furthermore, we find that the process of destabilization often ends in the ejection of one of the stellar bodies, specifically for 31 - 40% of systems. The ejected bodies have typical velocities of around 6 km/s, with a tail stretching to 102 km/s. If we assume that 20% of massive stars are runaway stars, then 0.1% of runaways originate from triple destabilization. Overall, our simulations show that triple instability affects approximately 2% of massive triples. However, we estimate that up to ten times as many systems can become unstable due to mass transfer in the inner binary, and these system may end up ejecting bodies at higher velocities.\n\n", "2408.11014": "2024-08-20, **Identifying jittering-jet-shaped ejecta in the Cygnus Loop supernova remnant**, Dmitry Shishkin et.al., [2408.11014v1](http://arxiv.org/abs/2408.11014v1)\n\n Analyzing images of the Cygnus Loop, a core-collapse supernova (CCSN) remnant, in different emission bands, we identify a point-symmetrical morphology composed of three symmetry axes that we attribute to shaping by three pairs of jets. The main jet axis has an elongated S shape, appearing as a faint narrow zone in visible and UV. We term it the S-shaped hose, and the structure of three symmetry lines, the point-symmetric wind rose. The two other lines connect a protrusion (an ear or a bulge) with a hole on the opposite side of the center (a nozzle or a cavity), structures that we identify in the X-ray, UV, visible, IR, and/or radio images. There is a well-known blowout at the southern end of the S-shaped hose, and we identify a possible opposite blowout at the northern end of the S-shaped hose. The point-symmetrical morphology of the Cygnus Loop is according to the expectation of the jittering jets explosion mechanism (JJEM) of CCSNe, where several to few tens of pairs of jets with stochastically varying directions explode the star. The three pairs of jets that shaped the wind-rose structure of the Cygnus Loop are the last energetic pairs of this series of jets. Our study further supports the JJEM as the main explosion mechanism of CCSNe.\n\n", "2408.10981": "2024-08-20, **Local two-dimensional simulations of the ignition of a helium shell detonation on a white dwarf by an impacting stream**, Nethra Rajavel et.al., [2408.10981v1](http://arxiv.org/abs/2408.10981v1)\n\n The double detonation model is one of the prevalent explosion mechanisms of Type Ia Supernovae (SNe Ia) wherein an outer helium shell detonation triggers a core detonation in the white dwarf (WD). The dynamically driven double degenerate double detonation (D6) is the double detonation of the more massive WD in a binary WD system where the localized impact of the mass transfer stream from the companion sets off the initial helium shell detonation. To have high numerical resolution and control over the stream parameters, we have implemented a study of the local interaction of the stream with the WD surface in 2D. In cases with lower base density of the shell, the stream's impact can cause surface detonation soon after first impact. With higher base densities, after the stream hits the surface, hot material flows around the star and interacts with the incoming stream to produce a denser and narrower impact. Our results therefore show that (1) a directly impacting stream for both a relatively high resolution and for a range of stream parameters can produce a surface detonation, (2) thinner helium shells ignite more promptly via impact, doing so sooner, and (3) there are lower limits on ignition in both shell density and incoming stream speed with lower limits on density being well below those shown by other work to be required for normal appearing SN Ia. This supports stream ignition and therefore the D6 scenario, as a viable mechanism for normal SNe Ia.\n\n", "2408.10721": "2024-08-20, **Viewing the explosion models of type Ia supernovae via the insight from terrestrial cellular detonation**, Kazuya Iwata et.al., [2408.10721v1](http://arxiv.org/abs/2408.10721v1)\n\n The cellular structure is considered to be a key as a criterion in initiation, propagation, and quenching of terrestrial detonation. While a few studies on type Ia supernovae, which are known to involve detonation, have addressed the importance of the cellular structure, further detailed treatment will benefit enhanced understanding of the explosion outcomes. In the present study, we bridge this gap in the astrophysics and engineering fields, focusing on the detonation in a heliumrich white dwarf envelope as the triggering process for the so-called double-detonation model. The cellular structures are quantified via high-resolution two-dimensional simulations. We demonstrate that widely-accepted terrestrial-experimental criteria for quenching and initiation of detonation can indeed explain the results of previous hydrodynamic simulations very well. The present study highlights the potential of continuing to apply the insight from terrestrial detonation experiments to astrophysical problems, specifically the long unresolved problem of the explosion mechanism of type Ia supernovae.\n\n", "2408.10707": "2024-08-20, **High-redshift Cosmology by Gamma-Ray Bursts: an overview**, Giada Bargiacchi et.al., [2408.10707v1](http://arxiv.org/abs/2408.10707v1)\n\n Several correlations among Gamma-Ray Bursts (GRBs) quantities, both in the prompt and afterglow emissions, have been established during the last decades, thus enabling the standardization of GRBs as cosmological probes. Since GRBs are observed up to redshift $z \\sim 9$, they represent a valuable tool to fill in the gap of information on the Universe evolution between the farthest type Ia supernovae and the Cosmic Microwave Background Radiation and to shed new light on the current challenging cosmological tensions. Without claiming for completeness, here we describe the state of the art of GRB correlations, their theoretical interpretations, and their cosmological applications both as standalone probes and in combination with other probes. In this framework, we pinpoint the importance of correcting the correlations for selection biases and redshift evolution to derive intrinsic relations, the assets of combining probes at different scales, and the need for the employment of the appropriate cosmological likelihood to precisely constrain cosmological parameters. Furthermore, we emphasize the benefits of the cosmographic approach to avoid any cosmological assumptions and the valuable applications of machine learning techniques to reconstruct GRB light curves and predict unknown GRB redshifts. Finally, we stress the relevance of all these factors, along with future observations, to definitely boost the power of GRBs in cosmology.\n\n", "2408.10704": "2024-08-20, **$Λ$CDM model against cosmography: A possible deviation after DESI 2024**, Saeed Pourojaghi et.al., [2408.10704v1](http://arxiv.org/abs/2408.10704v1)\n\n In this study, we present an analysis of the standard flat-$\\Lambda$CDM model using a cosmographic approach, incorporating recent DESI BAO observations and Supernovae Type Ia catalogues (SNIa), including the DES-SN5YR and Pantheon+ compilations. We find full consistency between the standard model and the cosmographic approach when considering DESI BAO and SNIa catalogues independently. When combining DESI BAO with SNIa data, we examine the impact of the Planck prior on the sound horizon at the drag epoch, $r\\_d$, and the Cepheid prior on the absolute magnitude, $M$. Applying the Planck prior on $r\\_d$ alone yields an $H\\_0$ value consistent with the Planck measurement, while applying the Cepheid prior on $M$ alone results in an $H\\_0$ value consistent with the SH0ES measurement. Without any priors, the $H\\_0$ value obtained has a large error margin, reconciling the Planck and SH0ES measurements. In all cases where individual priors are applied, we observe no significant tension between the flat-$\\Lambda$CDM model and the cosmographic approach. However, when both Planck and Cepheid priors are applied simultaneously, significant tensions arise between the model and cosmography. This tension is even more pronounced when excluding LRG1 and LRG2 from the DESI measurements. These results suggest that the standard model cannot simultaneously align with both high-redshift Planck CMB observations and local Cepheid measurements.\n\n", "2408.10560": "2024-08-20, **Optimizing the $L$-$σ$ Relation of HII Galaxies for Improving Cosmological Application**, Jiaze Gao et.al., [2408.10560v1](http://arxiv.org/abs/2408.10560v1)\n\n The basic premise of using HII starburst galaxies (HIIGs) as cosmic \"standard candels\" is that there is a significant correlation between the H$\\beta$ luminosity ($L$) and the velocity dispersion ($\\sigma$) of the ionized gas from HIIGs measurements, which can be called as the empirical $L$ - $\\sigma$ relation. However, the scaling $L$ - $\\sigma$ relation well-calibrated with the lower-redshift HIIGs is unfitted for the higher-redshift HIIGs. To solve this problem, we explore new relational expression for the $L$ - $\\sigma$ relation which should be suitable for both lower-redshift and higher-redshift HIIGs. After reconstructing the Hubble diagram with the Gaussian process (GP) method from the Pantheon+ supernovae Ia sample, we examine and compare six different revised formulas of $L$ - $\\sigma$ relation. Furthermore, we use the Bayesian evidence to compare the revised $L$ - $\\sigma$ relations with the analysis of a joint sample of 36 giant extragalactic HII regions (GEHRs) and 145 HIIGs. It turns out that the redshift-dependent bilinear correction and the quadratic $\\sigma$ based correction are significantly better than the others. Moreover, a quadratic $\\sigma$ based correction is the most supported one. It suggests that the appropriate corrections to the $L$ - $\\sigma$ relation should be considered when the HIIGs are used as a kind of cosmological probes.\n\n"}}