{"neutrino": {"2306.05389": "2023-06-08, **Towards distinguishing Dirac from Majorana neutrino mass with gravitational waves**, Stephen F. King et.al., [2306.05389v1](http://arxiv.org/abs/2306.05389v1)\n\n We propose to distinguish the nature of neutrino masses, Dirac vs Majorana, from the spectrum of gravitational waves generated. We study two simple models of Majorana and Dirac mass genesis motivated by generating small neutrino masses without assuming tiny Yukawa couplings. For Majorana neutrinos, spontaneous breaking of the gauged $B-L$ symmetry gives a cosmic string induced gravitational wave signal flat over a large range of frequencies, whereas for Dirac neutrinos, spontaneous and soft-breaking of a $Z\\_2$ symmetry generate a peaked gravitational wave spectrum from annihilation of domain walls. The striking difference between the shape of the spectra in the two cases can help differentiate between Dirac vs Majorana neutrino masses in the two class of models considered, complementing results of neutrinoless double beta decay experiments.\n\n", "2306.05333": "2023-06-08, **FCNC charmed-hadron decays with invisible singlet particles in light of recent data**, Geng Li et.al., [2306.05333v1](http://arxiv.org/abs/2306.05333v1)\n\n The flavor-changing neutral current (FCNC) decays of charmed hadrons with missing energy ($\\slashed E$) can serve as potentially promising hunting grounds for hints of new physics, as the standard-model backgrounds are very suppressed. A few of such processes have been searched for in recent experiments, particularly $D^0\\to\\slashed E$ by Belle and $D^0\\to\\pi^0\\slashed E$ and $\\Lambda\\_c^+\\to p\\slashed E$ by BESIII, resulting in upper bounds on their branching fractions. We consider them to illuminate the possible contributions of the quark transition $c\\to u\\slashed E$ with a couple of invisible spinless bosons carrying away the missing energy, assuming that they are not charge conjugates of each other and hence can have unequal masses. We find that these data are complementary in that they constrain different sets of the underlying operators and do not cover the same ranges of the bosons' masses, but there are regions not yet accessible. From the allowed parameter space, we show that other $D$-meson decays, such as $D\\to\\rho\\slashed E$, and the charmed-baryon ones $\\Xi\\_c\\to(\\Sigma,\\Lambda)\\slashed E$ can have sizable branching fractions and therefore may offer further probes of the new-physics interactions. We point out the importance of $D^0\\to\\gamma\\slashed E$ which are not yet searched for but could access parts of the parameter space beyond the reach of the other modes. In addition, we look at a scenario where the invisibles are instead fermionic, namely sterile neutrinos, and a scalar leptoquark mediates $c\\to u\\slashed E$. We discuss the implications of the aforesaid bounds for this model. The predictions we make for the various charmed-hadron decays in the different scenarios may be testable in the near future by BESIII and Belle II.\n\n", "2306.05280": "2023-06-08, **Chiral EFT calculation of neutrino reactions in warm neutron-rich matter**, Eunkyoung Shin et.al., [2306.05280v1](http://arxiv.org/abs/2306.05280v1)\n\n Neutrino scattering and absorption rates of relevance to supernovae and neutron star mergers are obtained from nuclear matter dynamical structure functions that encode many-body effects from nuclear mean fields and correlations. We employ nuclear interactions from chiral effective field theory to calculate the density, spin, isospin, and spin-isospin response functions of warm beta-equilibrium nuclear matter. We include corrections to the single-particle energies in the mean field approximation as well as vertex corrections resummed in the random phase approximation (RPA), including, for the first time, both direct and exchange diagrams. We find that correlations included through the RPA redistribute the strength of the response to higher energy for neutrino absorption and lower energy for antineutrino absorption. This tends to suppress the absorption rate of electron neutrinos across all relevant energy scales. In contrast, the inclusion of RPA correlations enhances the electron antineutrino absorption rate at low energy and supresses the rate at high energy. These effects are especially important at high-density and in the vicinity of the neutrino decoupling region. Implications for heavy element nucleosynthesis, electromagnetic signatures of compact object mergers, supernova dynamics, and neutrino detection from galactic supernovae are discussed briefly.\n\n", "2306.05258": "2023-06-08, **Probing Dual NSI and CP Violation in DUNE and T2HK**, Barnali Brahma et.al., [2306.05258v1](http://arxiv.org/abs/2306.05258v1)\n\n The latest results from the long baseline neutrino experiments show a hint of non-zero CP violation in the neutrino sector. In this article, we study the CP violation effects in the upcoming long-baseline neutrino experiments DUNE and T2HK. Non-standard interactions can affect the cleaner determination of CP violation parameter. It has been argued that the NSI can help alleviate the tension between the recent $\\delta\\_{CP}$ measurements of NO$\\nu$A and T2K experiments. We consider here the dual NSI due to $\\epsilon\\_{e\\mu}$ and $\\epsilon\\_{e\\tau}$, arising simultaneously to see the effects in neutrino oscillation probabilities. Moreover, the CP asymmetry parameter $A\\_{CP}$ exhibits a clear distinction between normal and inverted mass orderings in the DUNE experiment.\n\n"}, "dark matter": {"2306.05282": "2023-06-08, **Weakly Lensed Gravitational Waves: Probing Cosmic Structures with Wave-Optics Features**, Stefano Savastano et.al., [2306.05282v1](http://arxiv.org/abs/2306.05282v1)\n\n Every signal propagating through the universe is at least weakly lensed by the intervening gravitational field. In some situations, wave-optics phenomena (diffraction, interference) can be observed as frequency-dependent modulations of the waveform of gravitational waves (GWs). We will denote these signatures as Wave-Optics Features (WOFs) and analyze them in detail. Our framework can efficiently and accurately compute WOF in the single-image regime, of which weak lensing is a limit. The phenomenology of WOF is rich and offers valuable information: the dense cusps of individual halos appear as peaks in Green's function for lensing. If resolved, these features probe the number, effective masses, spatial distribution and inner profiles of substructures. High signal-to-noise GW signals reveal WOFs well beyond the Einstein radius, leading to a fair probability of observation by upcoming detectors such as LISA. Potential applications of WOF include reconstruction of the lens' projected density, delensing standard sirens and inferring large-scale structure morphology and the halo mass function. Because WOF are sourced by light halos with negligible baryonic content, their detection (or lack thereof) holds promise to test dark matter scenarios.\n\n", "2306.04991": "2023-06-08, **Neutral bremsstrahlung electroluminescence in noble liquids revisited**, A. Buzulutskov et.al., [2306.04991v1](http://arxiv.org/abs/2306.04991v1)\n\n Recent discovery of neutral bremsstrahlung (NBrS) mechanism of electroluminescence (EL) in noble gases in two-phase detectors for dark matter searches has led to a prediction that NBrS EL should be present in noble liquids as well. A rigorous theory of NBrS EL in noble liquids was developed accordingly in the framework of Cohen-Leckner and Atrazhev formalism. It has been recently followed by the first experimental observation of NBrS EL in liquid argon, which however deviates significantly from the previous theory. Given these results, we revise previous theoretical calculations of EL NBrS in noble liquids to be consistent with experiment. In particular, NBrS EL yield and spectra were calculated in this work for argon, krypton and xenon with momentum-transfer cross section of electron-atom scattering (instead of energy-transfer one) being used for calculation of NBrS cross section. The results for light noble liquids, helium and neon, are also reexamined.\n\n"}, "supernova": {"2306.05038": "2023-06-08, **The magnetic, spectroscopic, and photometric variability of the Wolf-Rayet star WR55**, S. P. Järvinen et.al., [2306.05038v1](http://arxiv.org/abs/2306.05038v1)\n\n Studies of magnetic fields in the most evolved massive stars, the Wolf-Rayet stars, are of special importance because they are progenitors of certain types of supernovae. The first detection of a magnetic field of the order of a few hundred Gauss in the WN7 star WR55, based on a few FORS2 low-resolution spectropolarimetric observations, was reported in 2020. In this work we present new FORS2 observations allowing us to detect magnetic and spectroscopic variability with a period of 11.90 h. No significant frequencies were detected in TESS and ASAS-SN photometric observations. Importantly, magnetic field detections are achieved currently only in two Wolf-Rayet stars, WR6 and WR55, both showing the presence of corotating interacting regions.\n\n", "2306.04992": "2023-06-08, **The hadronic equation of state of HESS J1731-347 from the relativistic mean-field model with tensor coupling**, Kaixuan Huang et.al., [2306.04992v1](http://arxiv.org/abs/2306.04992v1)\n\n A recent report has identified a central compact object (CCO) within the supernova remnant HESS J1731-347, with a mass and radius of $M=0.77^{+0.20}\\_{-0.17}M{\\odot}$ and $R=10.4^{+0.86}\\_{-0.78}$ km, respectively. To investigate this light compact star, a density-dependent relativistic mean-field (DDRMF) model, specifically the DDVT model, has been employed. The DDVT model incorporates tensor couplings of vector mesons, which {can} successfully describe the properties of finite nuclei, such as charge radius, binding energy, and spin-orbit splitting. The introduction of tensor coupling reduces the influence of scalar mesons and generates a softer equation of state (EOS) in the outer core of the neutron star. Moreover, it has been found that the crust segment plays a crucial role in reproducing the mass-radius relation of HESS J1731-347, indicating a preference for a soft crust EOS. By manipulating the coupling strength of the isovector meson in the DDVT parameter set, a reasonable hadronic EOS has been obtained, satisfying the constraints from the gravitational-wave signal GW170817, the simultaneous mass-radius measurements from the NICER collaboration, and the properties of finite nuclei. Notably, the mass-radius relations derived from this hadronic EOS also accurately describe the observables of HESS J1731-347. Therefore, based on our estimation, the CCO in HESS J1731-347 may represent the lightest known neutron star.\n\n"}}