{"neutrino": {"2305.12989": "2023-05-22, **Weighing neutrinos at the damping tail**, Eleonora Di Valentino et.al., [2305.12989v1](http://arxiv.org/abs/2305.12989v1)\n\n Model-independent mass limits assess the robustness of current cosmological measurements of the neutrino mass scale. Consistency between high-multipole and low-multiple Cosmic Microwave Background observations measuring such scale further valuate the constraining power of present data. We derive here up-to-date limits on neutrino masses and abundances exploiting either the Data Release 4 of the Atacama Cosmology Telescope (ACT) or the South Pole Telescope polarization measurements from SPT-3G, envisaging different non-minimal background cosmologies and marginalizing over them. Both the most constraining and marginalized bounds are competitive with those found with Planck data: we obtain $\\sum m\\_\\nu <0.139$ eV and $N\\_{\\textrm{eff}}= 2.82\\pm 0.25$ in a dark energy quintessence scenario, both at $95\\%$ CL. These limits translate into $\\sum m\\_\\nu <0.20$ eV and $N\\_{\\textrm{eff}}= 2.79^{+0.30}\\_{-0.28}$ after marginalizing over a plethora of well-motivated fiducial models. Our findings reassess both the strength and the reliability of cosmological neutrino mass constraints.\n\n", "2305.12830": "2023-05-22, **Revisiting coupled CDM-massive neutrino perturbations in diverse cosmological backgrounds**, Sourav Pal et.al., [2305.12830v1](http://arxiv.org/abs/2305.12830v1)\n\n Massive neutrinos are well-known to cause a characteristic suppression in the growth of structures at scales below the neutrino free-streaming length. A detailed understanding of this suppression is essential in the era of precision cosmology we are entering into, enabling us to better constrain the total neutrino mass and possibly probe (beyond)-$\\Lambda$CDM cosmological model(s). Instead of the usual N-body simulation or Boltzmann solver, in this article we consider a two-fluid framework at the linear scales, where the neutrino fluid perturbations are coupled to the CDM (+ baryon) fluid via gravity at redshifts of interest. Treating the neutrino mass fraction $f\\_\\nu$ as a perturbative parameter, we find a fully analytic solution to the system with redshift-dependent neutrino free-streaming length in $\\Lambda$CDM background. The perturbative scale-dependent solution is shown to be in excellent agreement with numerical solution of the two-fluid equations valid to all orders in $f\\_{\\nu}$, and also agrees with results from {\\texttt{CLASS}} to a good accuracy. We further generalize the framework to incorporate different evolving dark energy backgrounds and found sub-percent level differences in the suppression, all of which lie within the observational uncertainty of BOSS-like surveys. We also present a brief discussion on the prospects of the current analysis in the context of upcoming missions.\n\n", "2305.12654": "2023-05-22, **Challenges in Neutrino Mass Measurements**, Jyotsna Singh et.al., [2305.12654v1](http://arxiv.org/abs/2305.12654v1)\n\n Neutrino masses are yet unknown. We discuss the present state of absolute neutrino mass from $\\beta$ decay experiments; effective Majorana neutrino mass from neutrinoless double-beta decay experiments; neutrino mass squared differences from neutrino oscillation: solar, atmospheric, reactor and accelerator based experiments; sum of neutrino masses from cosmological observations. Current experimental challenges in the determination of neutrino masses are briefly discussed. The main focus is devoted to contemporary experiments.\n\n", "2305.12566": "2023-05-21, **Testing Unification and Dark Matter with Gravitational Waves**, Bartosz Fornal et.al., [2305.12566v1](http://arxiv.org/abs/2305.12566v1)\n\n We propose to search for a new type of gravitational wave signature relevant for particle physics models with symmetries broken at vastly different energy scales. The spectrum contains a characteristic double-peak structure consisting of a sharp peak from domain walls and a smooth bump from a first order phase transition in the early Universe. We demonstrate how such a gravitational wave signal arises in a new theory unifying baryon number and color into an SU(4) gauge group broken at the multi-TeV scale, and with lepton number promoted to an SU(2) gauge symmetry broken at the multi-EeV scale. The model contains two types of dark matter particles, explains the observed domination of matter over antimatter in the Universe, and accommodates nonzero neutrino masses. We discuss how future gravitational wave experiments, such as LISA, Big Bang Observer, DECIGO, Einstein Telescope, and Cosmic Explorer, can be utilized to look for this novel signature.\n\n", "2305.12378": "2023-05-21, **Neutrino mass matrix in neutrino-related processes**, M. I. Krivoruchenko et.al., [2305.12378v1](http://arxiv.org/abs/2305.12378v1)\n\n Techniques are developed for constructing amplitudes of neutrino-related processes in terms of the neutrino mass matrix, with no reference to the neutrino mixing matrix. The amplitudes of neutrino oscillations in vacuum and medium, quasi-elastic neutrino scattering, $\\beta$ decays and double-$\\beta$ decays are considered. The proposed approach makes extensive use of Frobenius covariants within the framework of Sylvester's theorem on matrix functions. The in-medium dispersion laws are found in quadratures for three flavors of Majorana neutrinos as an application of the developed formalism. The in-medium dispersion laws for Dirac neutrinos can be determined in the general case by searching for the roots of a polynomial of degree 6. In the rest frame of baryonic matter, the minimum energy of both Majorana and Dirac neutrinos is achieved at a finite neutrino momentum. In such cases, Dirac neutrinos occupy a hollow Fermi sphere at zero temperature and low densities. Fitting experimental data in terms of the neutrino mass matrix can provide better statistical accuracy in determining the neutrino mass matrix compared to methods using the neutrino mixing matrix at intermediate stages.\n\n", "2305.12367": "2023-05-21, **Weyl Neutrinos In Plane Symmetric Spacetimes**, Tekin Dereli et.al., [2305.12367v1](http://arxiv.org/abs/2305.12367v1)\n\n We investigate complex quaternion-valued exterior differential forms over 4-dimensional Lorentzian spacetimes and explore Weyl spinor fields as minimal left ideals within the complex quaternion algebra. The variational derivation of the coupled Einstein-Weyl equations from an action is presented, and the resulting field equations for both first and second order variations are derived and simplified. Exact plane symmetric solutions of the Einstein-Weyl equations are discussed, and two families of exact solutions describing left-moving and right-moving neutrino plane waves are provided. The study highlights the significance of adjusting a quartic self-coupling of the Weyl spinor in the action to ensure the equivalence of the field equations.\n\n"}, "dark matter": {"2305.13023": "2023-05-22, **Clustering of Primordial Black Holes from QCD Axion Bubbles**, Kentaro Kasai et.al., [2305.13023v1](http://arxiv.org/abs/2305.13023v1)\n\n We study the clustering of primordial black holes (PBHs) and axion miniclusters produced in the model proposed to explain the LIGO/Virgo events or the seeds of the supermassive black holes (SMBHs) in arXiv:2006.13137. It is found that this model predicts large isocurvature perturbations due to the clustering of PBHs and axion miniclusters, from which we obtain stringent constraints on the model parameters. Specifically, for the axion decay constant $f\\_a=10^{16}~\\mathrm{GeV}$, which potentially accounts for the seeds of the SMBHs, the PBH fraction in dark matter should be $f\\_\\mathrm{PBH}\\lesssim7\\times 10^{-10}$. Assuming that the mass of PBHs increases by more than a factor of $\\mathcal{O}(10)$ due to accretion, this is consistent with the observed abundance of SMBHs. On the other hand, for $f\\_a=10^{17}~\\mathrm{GeV}$ required to produce PBHs of masses detected in the LIGO/Virgo, the PBH fraction should be $f\\_\\mathrm{PBH}\\lesssim6\\times 10^{-8}$, which may be too small to explain the LIGO/Virgo events, although there is a significant uncertainty in calculating the merger rate in the presence of clustering.\n\n", "2305.12982": "2023-05-22, **Halo formation and evolution in SFDM and CDM: new insights from the fluid approach**, Horst Foidl et.al., [2305.12982v1](http://arxiv.org/abs/2305.12982v1)\n\n (abridged) We present simulations of halo formation and evolution in scalar field dark matter (SFDM) cosmologies in the Thomas-Fermi regime, aka ``SFDM-TF\", where a strong repulsive 2-particle self-interaction (SI) is included, being a valuable alternative to CDM, with the potential to resolve its ``cusp-core\" problem. In general, SFDM behaves like a quantum fluid. Previous literature has presented two fluid approximations for SFDM-TF, as well as simulations of halo formation. These results confirmed earlier expectations and are generally in mutual agreement, but discrepancies were also reported. Therefore, we perform dedicated 3D cosmological simulations for the SFDM-TF model, applying both fluid approximations, as well as for CDM. Our results are very well in accordance with previous works and extend upon them, in that we can explain the reported discrepancies as a result of different simulation setups. We find some interesting details: The evolution of both SFDM-TF and CDM halos follows a 2-stage process. In the early stage, the density profile in the center becomes close to a $(n=1.5)$-polytropic core, dominated by an \"effective\" velocity-dispersion pressure $P\\_{\\sigma}$ which is common to both dark matter models. Consecutively, for CDM halos, the core transitions into a central cusp. In SFDM-TF halos, the additional pressure $P\\_\\text{SI}$ due to SI determines the second stage of the evolution, where the central region follows closely a $(n=1)$-polytropic core, embedded in a nearly isothermal envelope, i.e. the outskirts are similar to CDM. We also encounter a new effect, namely a late-time expansion of both polytropic core plus envelope, because the size of the almost isothermal halo envelope is affected by the expansion of the background universe. So, an initial primordial core of $\\sim 100$ pc can evolve into a larger core of $\\gtrsim 1$ kpc, even without feedback from baryons.\n\n", "2305.12938": "2023-05-22, **Search for dark matter produced in association with a Higgs boson decaying to tau leptons at $\\sqrt{s}=13$ TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2305.12938v1](http://arxiv.org/abs/2305.12938v1)\n\n A search for dark matter produced in association with a Higgs boson in final states with two hadronically decaying $\\tau$-leptons and missing transverse momentum is presented. The analysis uses $139$ fb$^{-1}$ of proton-proton collision data at $\\sqrt{s}=13$ TeV collected by the ATLAS experiment at the Large Hadron Collider between 2015 and 2018. No evidence for physics beyond the Standard Model is found. The results are interpreted in terms of a 2HDM+$a$ model. Exclusion limits at 95% confidence level are derived. Model-independent limits are also set on the visible cross section for processes beyond the Standard Model producing missing transverse momentum in association with a Higgs boson decaying to $\\tau$-leptons.\n\n", "2305.12812": "2023-05-22, **Non-Linearity-Free prediction of the growth-rate $fσ_8$ using Convolutional Neural Networks**, Koya Murakami et.al., [2305.12812v1](http://arxiv.org/abs/2305.12812v1)\n\n The growth-rate $f\\sigma\\_8(z)$ of the large-scale structure of the Universe is an important dynamic probe of gravity that can be used to test for deviations from General Relativity. However, in order for galaxy surveys to extract this key quantity from cosmological observations, two important assumptions have to be made: i) a fiducial cosmological model, typically taken to be the cosmological constant and cold dark matter ($\\Lambda$CDM) model and ii) the modeling of the observed power spectrum from H$\\alpha$ emitters, especially at non-linear scales, which is particularly dangerous as most models used in the literature are phenomenological at best. In this work, we propose a novel approach involving convolutional neural networks (CNNs), trained on the Quijote N-body simulations, to predict $f\\sigma\\_8(z)$ directly and without assuming a model for the non-linear part of the power spectrum, thus avoiding the second of the aforementioned assumptions. We find that the predictions for the value of $f\\sigma\\_8$ from the CNN are in excellent agreement with the fiducial values, while the errors are within a factor of order unity from those of the traditionally optimistic Fisher matrix approach, assuming an ideal fiducial survey matching the specifications of the Quijote simulations. Thus, we find the CNN reconstructions provide a viable alternative in order to avoid the theoretical modeling of the non-linearities at small scales when extracting the growth-rate.\n\n", "2305.12808": "2023-05-22, **Qualification of piezo-electric actuators for the MADMAX booster system at cryogenic temperatures and high magnetic fields**, E. Garutti et.al., [2305.12808v1](http://arxiv.org/abs/2305.12808v1)\n\n We report on the qualification of a piezo-based linear stage for the manipulation of positions of dielectric discs in the booster of the MADMAX axion dark matter search experiment. A first demonstrator of the piezo drives, specifically developed for MADMAX, was tested at room temperature as well as at cryogenic temperatures down to 4.5 K and inside strong magnetic fields up to 5.3 T. These qualification measurements prove that the piezo-based linear stage is suited for MADMAX and fulfills the requirements.\n\n", "2305.12668": "2023-05-22, **Direct detection of cosmic ray-boosted puffy dark matter**, Wenyu Wang et.al., [2305.12668v1](http://arxiv.org/abs/2305.12668v1)\n\n For the light relativistic dark matter (DM) boosted by high energy cosmic ray, its scattering cross section with the nucleon is sensitively dependent on the momentum-transfer and such an dependence is caused by the mediator in the scattering. For puffy DM particle with a size, the momentum-transfer dependence can also arise from the DM radius effect. All these momentum-transfer dependences should be considered. In this note we study the direct detection limits on the cosmic ray-boosted puffy DM for a simplified model with a light mediator. For comparison, we first re-derive the direct detection limits on the cosmic ray-boosted point-like DM. We display the limits on various planes of parameters and find that the limits for the cosmic ray-boosted puffy DM are stronger than for the point-like DM.\n\n", "2305.12556": "2023-05-21, **Negligible Effects of Baryons on the Angular Momentum Scaling Relations of Galactic Dark Matter Halos**, S. Michael Fall et.al., [2305.12556v1](http://arxiv.org/abs/2305.12556v1)\n\n In cosmological simulations without baryons, the relation between the specific angular momentum $j\\_{\\rm h}$ and mass $M\\_{\\rm h}$ of galactic dark matter halos has the well-established form $j\\_{\\rm h} \\propto M\\_{\\rm h}^{2/3}$. This is invariably adopted as the starting point in efforts to understand the analogous relation between the specific angular momentum $j\\_{\\ast}$ and mass $M\\_{\\ast}$ of the stellar parts of galaxies, which are often re-expressed relative to the corresponding halo properties through the retention fractions $f\\_j = j\\_{\\ast} / j\\_{\\rm h}$ and $f\\_M = M\\_{\\ast} / M\\_{\\rm h}$. An important caveat here is that the adopted $j\\_{\\rm h} \\propto M\\_{\\rm h}^{2/3}$ relation could, in principle, be modified by the gravitational back-reaction of baryons on dark matter (DM). We have tested for this possibility by comparing the $j\\_{\\rm h}$-$M\\_{\\rm h}$ relations in the IllustrisTNG100 and TNG50 simulations that include baryons (full-physics runs) with their counterparts that do not (DM-only runs). In all cases, we find scaling relations of the form $j\\_{\\rm h} \\propto M\\_{\\rm h}^{\\alpha}$, with $\\alpha \\approx 2/3$ over the ranges of mass and redshift studied here: $M\\_{\\rm h} \\geq 10^{10} \\, M\\_{\\odot}$ and $0 \\leq z \\leq 2$. The values of $\\alpha$ are virtually identical in the full-physics and DM-only runs at the same redshift. The only detectable effect of baryons on the $j\\_{\\rm h}$-$M\\_{\\rm h}$ relation is a slightly higher normalization, by 12%-15% at $z=0$ and by 5% at $z=2$. This implies that existing estimates of $f\\_j$ based on DM-only simulations should be adjusted downward by similar amounts. Finally, we discuss briefly some implications of this work for studies of galaxy formation.\n\n"}, "supernova": {"2305.13305": "2023-05-22, **Type Ia Supernova Explosions in Binary Systems: A Review**, Zheng-Wei Liu et.al., [2305.13305v1](http://arxiv.org/abs/2305.13305v1)\n\n SNe Ia play a key role in the fields of astrophysics and cosmology. It is widely accepted that SNe Ia arise from thermonuclear explosions of WDs in binaries. However, there is no consensus on the fundamental aspects of the nature of SN Ia progenitors and their explosion mechanism. This fundamentally flaws our understanding of these important astrophysical objects. We outline the diversity of SNe Ia and the proposed progenitor models and explosion mechanisms. We discuss the recent theoretical and observational progress in addressing the SN Ia progenitor and explosion mechanism in terms of the observables at various stages of the explosion, including rates and delay times, pre-explosion companion stars, ejecta-companion interaction, early excess emission, early radio/X-ray emission from CSM interaction, surviving companions, late-time spectra and photometry, polarization signals, and SNR properties, etc. Despite the efforts from both the theoretical and observational side, the questions of how the WDs reach an explosive state and what progenitor systems are more likely to produce SNe Ia remain open. No single published model is able to consistently explain all observational features and the full diversity of SNe Ia. This may indicate that either a new progenitor paradigm or the improvement of current models is needed if all SNe Ia arise from the same origin. An alternative scenario is that different progenitor channels and explosion mechanisms contribute to SNe Ia. In the next decade, the ongoing campaigns with the JWST, Gaia and the ZTF, and upcoming extensive projects with the LSST and the SKA will allow us to conduct not only studies of individual SNe Ia in unprecedented detail but also systematic investigations for different subclasses of SNe Ia. This will advance theory and observations of SNe Ia sufficiently far to gain a deeper understanding of their origin and explosion mechanism.\n\n", "2305.12526": "2023-05-21, **The core starbursts of the galaxy NGC 3628: Radio very long baseline interferometry and X-ray studies**, Xiaolong Yang et.al., [2305.12526v1](http://arxiv.org/abs/2305.12526v1)\n\n We present radio very long baseline interferometry (VLBI) and X-ray studies of the starburst galaxy NGC 3628. The VLBI observation at 1.5 GHz reveals seven compact (0.7$-$7 parsec) radio sources in the central $\\sim$250 parsec region of NGC 3628. Based on their morphology, high radio brightness temperatures ($10^5-10^7$ K), and steep radio spectra, none of these seven sources can be associated with active galactic nuclei (AGNs); instead, they can be identified as supernova remnants (SNRs), with three of them appearing consistent with partial shells. Notably, one of them (W2) is likely a nascent radio supernova and appears to be consistent with the star formation rate of NGC 3628 when assuming a canonical initial mass function. The VLBI observation provides the first precise measurement of the diameter of the radio sources in NGC 3628, which allow us to fit a well-constrained radio surface brightness - diameter ($\\Sigma-D$) correlation by including the detected SNRs. Furthermore, future VLBI observations can be conducted to measure the expansion velocity of the detected SNRs. In addition to our radio VLBI study, we analyze Chandra and XMM-Newton spectra of NGC 3628. The spectral fitting indicates that the SNR activities could well account for the observed X-ray emissions. Along with the Chandra X-ray image, it further reveals that the X-ray emission is likely maintained by the galactic-scale outflow triggered by SN activities. These results provide strong evidence that SN-triggered activities play a critical role in generating both radio and X-ray emissions in NGC 3628 and further suggest that the galaxy NGC 3628 is in an early stage of starbursts.\n\n"}}