{"neutrino": {"2410.17854": "2024-10-23, **Probing Light Scalars and Vector-like Quarks at the High-Luminosity LHC**, A. Flórez et.al., [2410.17854v1](http://arxiv.org/abs/2410.17854v1)\n\n A model based on a $U(1)\\_{T^3\\_R}$ extension of the Standard Model can address the mass hierarchy between generations of fermions, explain thermal dark matter abundance, and the muon $g - 2$, $R\\_{(D)}$, and $R\\_{(D^*)}$ anomalies. The model contains a light scalar boson $\\phi'$ and a heavy vector-like quark $\\chi\\_\\mathrm{u}$ that can be probed at CERN's Large Hadron Collider (LHC). We perform a phenomenology study on the production of $\\phi'$ and ${\\chi}\\_u$ particles from proton-proton $(\\mathrm{pp})$ collisions at the LHC at $\\sqrt{s}=13.6$ TeV, primarily through $g{-g}$ and $t{-\\chi\\_\\mathrm{u}}$ fusion. We work under an effective field theory approach, in which the $\\chi\\_\\mathrm{u}$ and $\\phi'$ masses are free parameters. We perform a phenomenological analysis considering $\\chi\\_\\mathrm{u}$ final states to b-quarks, muons, and neutrinos, and $\\phi'$ decays to $\\mu^+\\mu^-$. A machine learning algorithm is used to maximize the signal sensitivity, considering an integrated luminosity of $3000$ $\\textrm{fb}^{-1}$. The proposed methodology can be a key mode for discovery over a large mass range, including low masses, traditionally considered difficult due to experimental constraints.\n\n", "2410.17824": "2024-10-23, **Search for supersymmetry in final states with missing transverse momentum and charm-tagged jets using 139 fb$^{-1}$ of proton-proton collisions at $\\sqrt{s}=$ 13 TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2410.17824v1](http://arxiv.org/abs/2410.17824v1)\n\n The paper presents a search for supersymmetric particles produced in proton-proton collisions at $\\sqrt{s}=$ 13 TeV and decaying into final states with missing transverse momentum and jets originating from charm quarks. The data were taken with the ATLAS detector at the Large Hadron Collider at CERN from 2015 to 2018 and correspond to an integrated luminosity of 139 fb$^{-1}$. No significant excess of events over the expected Standard Model background expectation is observed in optimized signal regions, and limits are set on the production cross-sections of the supersymmetric particles. Pair production of charm squarks or top squarks, each decaying into a charm quark and the lightest supersymmetric particle $\\tilde{\\chi}^0\\_1$, is excluded at 95% confidence level for squarks with masses up to 900 GeV for scenarios where the mass of $\\tilde{\\chi}^0\\_1$ is below 50 GeV. Additionally, the production of leptoquarks with masses up to 900 GeV is excluded for the scenario where up-type leptoquarks decay into a charm quark and a neutrino. Model-independent limits on cross-sections and event yields for processes beyond the Standard Model are also reported.\n\n", "2410.17608": "2024-10-23, **Multi-messenger signature of cosmic rays from the microquasar V4641 Sgr propagating along a Galactic Magnetic Field line**, Andrii Neronov et.al., [2410.17608v1](http://arxiv.org/abs/2410.17608v1)\n\n The recently detected extended, very-high-energy gamma-ray emission from the microquasar V4641 Sgr reveals a puzzling 200-parsec-long jet-like structure significantly misaligned with its radio jet. We propose that this gamma-ray structure is produced by high-energy cosmic-ray particles escaping from the microquasar along ordered field lines of the Galactic Magnetic Field and interacting with the interstellar medium. We show that if the gamma-ray emission is produced by interactions of high-energy cosmic ray nuclei, the system is detectable by future multi-km3 neutrino detectors. We argue that gamma-ray observations of jet-like features adjacent to high-energy sources in the Milky Way provide a new method to measure the regular and turbulent components of the Galactic magnetic field at different locations in the Milky Way.\n\n"}, "dark matter": {"2410.18039": "2024-10-23, **Local Primordial Non-Gaussian Bias at the Field Level**, James M. Sullivan et.al., [2410.18039v1](http://arxiv.org/abs/2410.18039v1)\n\n Local primordial non-Gaussianity (LPNG) couples long-wavelength cosmological fluctuations to the short-wavelength behavior of galaxies. This coupling is encoded in bias parameters including $b\\_{\\phi}$ and $b\\_{\\delta\\phi}$ at linear and quadratic order in the large-scale biasing framework. We perform the first field-level measurement of $b\\_{\\phi}$ and $b\\_{\\delta\\phi}$ using Lagrangian bias and non-linear displacements from N-body simulations. We compare our field level measurements with universality predictions and separate universe results, finding qualitative consistency, but disagreement in detail. We also quantify the information on $f\\_{\\mathrm{NL}}^{(\\mathrm{loc})}$ available in the field given various assumptions on knowledge of $b\\_{\\phi}$ at fixed initial conditions. We find that it is not possible to precisely constrain $f\\_{\\mathrm{NL}}^{(\\mathrm{loc})}$ when marginalizing over $b\\_{\\phi} f\\_{\\mathrm{NL}}^{(\\mathrm{loc})}$ even at the field level, observing a 2-3X degradation in constraints between a linear and quadratic biasing model on perturbative field-level mocks, suggesting that a $b\\_{\\phi}$ prior is necessary to meaningfully constrain $f\\_{\\mathrm{NL}}^{(\\mathrm{loc})}$ at the field level even in this idealized scenario. For simulated dark matter halos, the pure $f\\_{\\mathrm{NL}}^{(\\mathrm{loc})}$ constraints from both linear and quadratic field-level models appear biased when marginalizing over bias parameters including $b\\_{\\phi}$ and $b\\_{\\delta\\phi}$ due largely to the $f\\_{\\mathrm{NL}}^{(\\mathrm{loc})} - b\\_\\phi$ degeneracy. Our results are an important consistency test of the large-scale bias framework for LPNG and highlight the importance of physically motivated priors on LPNG bias parameters for future surveys.\n\n", "2410.17964": "2024-10-23, **A Model-Independent Bound on Light Dark Photon Dark Matter**, Naoya Kitajima et.al., [2410.17964v1](http://arxiv.org/abs/2410.17964v1)\n\n We derive a general and robust bound on dark photon dark matter with a mass acquired through the Higgs mechanism:$$m\\_{\\gamma'}/(q\\_H e\\_H)\\;\\gg \\;60\\,{\\rm eV}$$ where $m\\_{\\gamma'}$ is the dark photon mass, $e\\_H$ is the gauge coupling, and $q\\_H$ is the charge of the dark Higgs boson. This bound arises from the requirement that the symmetry breaking occurs and the dark photon must acquire mass through the Higgs mechanism by the time of redshift $z \\sim 10^6$ to form cold dark matter, independent of any specific production mechanism.\n\n", "2410.17916": "2024-10-23, **Reconciling PTA and JWST and preparing for LISA with \\texttt{POMPOCO}: a Parametrisation Of the Massive black hole POpulation for Comparison to Observations**, A. Toubiana et.al., [2410.17916v1](http://arxiv.org/abs/2410.17916v1)\n\n We develop a parametrised model to describe the formation and evolution of massive black holes, designed for comparisons with both electromagnetic and gravitational wave observations. Using an extended Press-Schechter formalism, we generate dark matter halo merger trees. We then seed and evolve massive black holes through parameterised prescriptions. This approach, which avoids solving differential equations, is computationally efficient, enabling us to analyse observational data and infer the parameters of our model in a fully Bayesian framework. We find that observations of the black hole luminosity function are compatible with the nHz gravitational wave signal (likely) measured by PTAs, provided we allow for an increased luminosity function at high redshift ($4-7$), as recently suggested by JWST observations. Our model can simultaneously reproduce the bulk of the $M\\_*-M\\_{\\rm BH}$ relation at $z-0$, as well as its outliers, something cosmological simulations struggle to do. The inferred model parameters are consistent with expectations from observations and more complex simulations: They favour heavier black hole seeds and short delays between halo and black hole mergers, while requiring supper-Edington accretion episodes lasting a few tens of million years, which in our model are linked to galaxy mergers. We find accretion to be suppressed in the most massive black holes below $z\\simeq 2.5$, consistently with the anti-hierarchical growth hypothesis. Finally, our predictions for LISA, although fairly broad, are in agreement with previous models. Our model offers a new perspective on the apparent tensions between the black hole luminosity function and the latest JWST and PTA results. Its flexibility makes it ideal to fully exploit the potential of future gravitational wave observations of massive black hole binaries with LISA.\n\n", "2410.17844": "2024-10-23, **Exploring the halo-galaxy connection with probabilistic approaches**, Natália V. N. Rodrigues et.al., [2410.17844v1](http://arxiv.org/abs/2410.17844v1)\n\n The connection between galaxies and dark matter halos encompasses a range of processes and play a pivotal role in our understanding of galaxy formation and evolution. Traditionally, this link has been established through physical or empirical models. Machine learning techniques are adaptable tools that handle high-dimensional data and grasp associations between numerous attributes. In particular, probabilistic models capture the stochasticity inherent to these complex relations. We compare different probabilistic machine learning methods to model the uncertainty in the halo-galaxy connection and efficiently generate galaxy catalogs that faithfully resemble the reference sample by predicting joint distributions of central galaxy properties conditioned to their host halo features. The analysis is based on the IllustrisTNG300 simulation. The methods model the distributions in different ways. We compare a multilayer perceptron that predicts the parameters of a multivariate Gaussian distribution, a multilayer perceptron classifier, and the method of normalizing flows. The classifier predicts the parameters of a Categorical distribution, which are defined in a high-dimensional parameter space through a Voronoi cell-based hierarchical scheme. We evaluate the model's performances under various sample selections based on halo properties. The three methods exhibit comparable results, with normalizing flows showing the best performance in most scenarios. The models reproduce the main features of galaxy properties distributions with high-fidelity and reproduce the results obtained with traditional, deterministic, estimators. Our results also indicate that different halos and galaxy populations are subject to varying degrees of stochasticity, which has relevant implications for studies of large-scale structure.\n\n", "2410.17727": "2024-10-23, **Attenuation of Boosted Dark Matter in Two Component Dark Matter Scenario**, Nilanjana Kumar et.al., [2410.17727v1](http://arxiv.org/abs/2410.17727v1)\n\n Boosted dark matter constitutes a small fraction of the total dark matter in the universe, with mass ranging from eV to MeV and often exhibiting (semi)relativistic velocity. Hence the likelihood of detecting boosted dark matter in earth-based direct detection experiments is relatively high. There is more than one explanation for the origin of the boosted dark matter(subdominant) including the two-component dark matter models where the heavier dark matter species(dominant) annihilates to nearly monoenergetic light dark matter particles in the galactic halo. If the dominant dark matter species is heavier (MeV-GeV), the subdominant light dark matter achieves very high velocity. These boosted dark matter particles suffer from elastic scattering with electrons and nuclei while crossing the atmosphere and the earth's crust before reaching underground experiments and hence the kinetic energy of the dark matter is attenuated. In the two component dark matter scenario, we show that the boost of the dark matter, kinetic energy and its attenuation highly depend on the dark matter masses. We perform a detailed study of the attenuation of boosted dark matter as a function of the DM-nucleus (without/with form factor) and DM-electron cross sections. For a 10 MeV dark matter with boost $\\sim$ 10-100, the effect of DM-electron scattering is found to be severe than the DM-nucleus scattering (with form factor) for scattering cross sections $\\sim 10^{-29}$cm$^2$. We also found that the attenuation of the kinetic energy results in a shift in the peak position of the boosted dark matter flux.\n\n", "2410.17544": "2024-10-23, **Gravitational waves from burdened primordial black holes dark matter**, Ngo Phuc Duc Loc et.al., [2410.17544v1](http://arxiv.org/abs/2410.17544v1)\n\n Primordial black holes (PBHs) are the natural candidate of dark matter (DM) as they only interact gravitationally and can evade any experiments on earth. In the standard semiclassical calculation of Hawking radiation, PBHs with mass below $10^{15}\\rm g$ evaporated by now and therefore cannot be DM. However, the recently-discovered quantum memory burden effect can significantly suppress the evaporation of PBHs after the half-decay time. This quantum effect could open up a new mass window below $10^{10} \\rm g$ where PBHs can still exist today and be DM. In this paper, we compute the gravitational wave (GW) signals associated with the formation of PBHs in this new mass window. We consider two formation scenarios: PBHs formed from inflationary perturbation and PBHs formed from collapse of Fermi-balls in a first-order phase transition (FOPT). GWs produced from these two scenarios have distinct features and, while the GW from inflation peaks at high frequency, the GW from FOPT peaks at lower frequency that can be within the reach of future experiments.\n\n", "2410.17480": "2024-10-23, **Early formation of supermassive black holes from the collapse of strongly self-interacting dark matter**, M. Grant Roberts et.al., [2410.17480v1](http://arxiv.org/abs/2410.17480v1)\n\n Evidence for high-redshift supermassive black holes challenges standard scenarios for how such objects form in the early universe. Here, we entertain the possibility that a fraction of the cosmological dark matter could be ultra-strongly self interacting. This would imply that gravothermal collapse occur at early times in the cores of dark matter halos, followed by accretion. We study under which conditions on the abundance and interaction strength and structure of such ultra self-interacting dark matter the black holes resulting from the end-point of gravothermal core collapse can seed the observed, early-forming supermassive black holes. We find, depending on the velocity dependence of the self-interaction cross section, a bimodal structure in the favored parameter space, where data points to either a small collapsing dark matter fraction with a large cross section, or a large fraction and a relatively small cross section. While self-interaction cross sections with different velocity dependence can explain observations, we find that the best, self-consistent results correspond to a Rutherford-like self-interaction, typical of long-range dark-sector forces with light mediators. We discuss complementary observational probes if this scenario is realized in nature, focusing especially on the expected intermediate mass black holes predicted to exist in smaller galaxies.\n\n"}, "supernova": {"2410.17699": "2024-10-23, **Constraining the CSM structure and progenitor mass-loss history of interacting supernovae through 3D hydrodynamic modeling: The case of SN 2014C**, S. Orlando et.al., [2410.17699v1](http://arxiv.org/abs/2410.17699v1)\n\n We investigate SN 2014C using three-dimensional hydrodynamic modeling, focusing on its early interaction with dense circumstellar medium (CSM). Our objective is to uncover the pre-supernova (SN) CSM structure and constrain the progenitor star's mass-loss history prior to core collapse. Our comprehensive model traces the evolution from the progenitor star through the SN event and into the SN remnant (SNR) phase. We simulate the remnant's expansion over approximately 15 years, incorporating a CSM derived from the progenitor star's outflows through dedicated hydrodynamic simulations. Analysis reveals that the remnant interacted with a dense toroidal nebula extending from $4.3\\times 10^{16}\\,$cm to $1.5\\times 10^{17}$ cm in the equatorial plane, with a thickness of approximately $1.2\\times 10^{17}$ cm. The nebula's density peaks at approximately $3\\times 10^6\\,$cm$^{-3}$ at the inner boundary, gradually decreasing as $\\approx r^{-2}$ at greater distances. This nebula formed due to intense mass-loss from the progenitor star between approximately 5000 and 1000 years before collapse. During this period, the maximum mass-loss rate reached about $8\\times 10^{-4}\\,M\\_{\\odot}\\,$yr$^{-1}$, ejecting $\\approx 2.5\\,M\\_{\\odot}$ of stellar material into the CSM. Our model accurately reproduces Chandra and NuSTAR spectra, including the Fe K line, throughout the remnant's evolution. Notably, the Fe line is self-consistently reproduced, originating from shocked ejecta, with $\\approx 0.05\\,M\\_{\\odot}$ of pure-Fe ejecta shocked during the remnant-nebula interaction. These findings suggest that the 3D geometry and density distribution of the CSM, as well as the progenitor star's mass-loss history, align with a scenario where the star was stripped through binary interaction, specifically common envelope evolution.\n\n", "2410.17684": "2024-10-23, **The MAGPI Survey: Insights into the Lyman-alpha line widths and the size of ionized bubbles at the edge of cosmic reionization**, T. Mukherjee et.al., [2410.17684v2](http://arxiv.org/abs/2410.17684v2)\n\n We present spectroscopic properties of 22 Lyman-alpha emitters(LAEs) at z=5.5-6.6 with Lyman-alpha(Lya) luminosity log($L\\_{Lya}$[$ergs^{-1}$])=42.4-43.5, obtained using VLT/MUSE as part of the Middle Ages Galaxy Properties with Integral Field Spectroscopy(MAGPI) survey. Additionally, we incorporate broad-band photometric data from the Subaru Hyper Suprime-Cam(HSC) for 17 LAEs in our sample. The HSC-y band magnitudes show that our LAEs are UV-bright, with rest-frame absolute UV magnitudes -19.7 < $M\\_{UV}$ < -23.3. We find that the Lya line width increases with luminosity, and this trend becomes more prominent at z > 6 where Lya lines become significantly broadened (> 260 $kms^{-1}$) at luminosities log($L\\_{Lya}$[$ergs^{-1}$]) > 43. This broadening is consistent with previous studies, suggesting that these sources are located inside larger ionized bubbles. We observe a slightly elevated ionizing photon production efficiency estimated for LAEs at z > 6, indicating that younger galaxies could be producing more ionizing photons per UV luminosity. A tentative anti-correlation between ionizing photon production efficiency and Lya rest-frame equivalent width is noticed, which could indicate a time delay between production and escape of ionizing photon primarily due to supernovae activity. Furthermore, we find a positive correlation between bubble radius and Lya line width, which again suggests that large ionized bubbles are created around these LAEs, allowing them to self-shield from the scattering effects of the intergalactic medium (IGM). We also detect two closely separated LAEs at z=6.046 (projected spatial separation is 15.92 kpc). The size of their respective bubbles suggests that they likely sit inside a common large ionized region. Such a closely-separated LAE pair increases the size of ionized bubble, potentially allowing a boosted transmission of Lya through neutral IGM. (Abridged)\n\n", "2410.17580": "2024-10-23, **Superluminous supernova SN 2018ibb: Circumstellar shell and spectral effects**, Nikolai N. Chugai et.al., [2410.17580v1](http://arxiv.org/abs/2410.17580v1)\n\n I explore observational effects of the cirsumstellar gas around superluminous supernova SN~2018ibb. High velocity Fe II narrow absorptions are reproduced in the model of fragmented cold dense shell. Unusual selective absorption in the emission doublet of [O I] is explained as an effect of the radiation scattering in Si II doublet lines in the supernova envelope.The strong emission of [O III] doublet at t\\_max + 565 days is proposed to originate from the supernova envelope, whereas its asymmetry is explained by the dust formation in the unshocked ejecta. Circumstellar interaction modeling combined with observational data suggests the cirsumstellar shell mass of about 0.14 Msun.\n\n"}}