{"neutrino": {"2406.04180": "2024-06-06, **Cogenesis by a sliding pNGB with symmetry non-restoration**, Eung Jin Chun et.al., [2406.04180v1](http://arxiv.org/abs/2406.04180v1)\n\n We show that a pseudo-Nambu-Goldstone boson (pNGB) with an initial misalignment angle can drive successful spontaneous baryogenesis, and become a good dark matter candidate if the corresponding global symmetry is non-restored at high temperatures. Considering a dimension-five explicit breaking operator, we find that the pNGB starts its motion with a sliding across rapidly decreasing potential barriers during which the baryon asymmetry is generated and frozen, and later it oscillates as dark matter. It is predicted that the pNGB mass and decay constant are around $5\\,{\\rm eV}$ and $3\\times10^6\\,{\\rm GeV}$, respectively, while the radial mode has a light mass $O(10)\\,{\\rm MeV}$ and a small mixing $O(10^{-4})$ with the Higgs boson. Applied to the Majoron in the type-I seesaw model, the heaviest right-handed neutrino is required to be as light as $100\\,{\\rm GeV}$. These predictions can be tested at kaon experiments, heavy neutral lepton searches, LHC, and future colliders.\n\n", "2406.03745": "2024-06-06, **Estimate for the neutrino magnetic moment from pulsar kick velocities induced at the birth of strange quark matter neutron stars**, Alejandro Ayala et.al., [2406.03745v1](http://arxiv.org/abs/2406.03745v1)\n\n We estimate the magnetic moment of electron neutrinos by computing the neutrino chirality flip rate that can occur in the core of a strange quark matter neutron star at birth. We show that this process allows neutrinos to anisotropically escape thus inducing the star kick velocity. The process is not subject to the no-go theorem since, although the flip from left- to right-handed neutrinos happens at equilibrium, the reverse process does not take place, given that right-handed neutrinos do not interact with matter and therefore detailed balance is lost. For simplicity, we model the star core as consisting of strange quark matter. We find that even when the energy released in right-handed neutrinos is a small fraction of the total energy released in left-handed neutrinos, the process describes kick velocities for natal conditions which are consistent with the observed ones and span the correct range of radii, temperatures and chemical potentials for typical magnetic field intensities. The neutrino magnetic moment is estimated to be $\\mu\\_\\nu \\sim 3.6 \\times 10^{-18}\\mu\\_B$, where $\\mu\\_B$ is the Bohr magneton. This value is more stringent than the bound found for massive neutrinos in a minimal extension of the standard model.\n\n"}, "dark matter": {"2406.04054": "2024-06-06, **Dynamics-based halo model for large scale structure**, Edgar M. Salazar et.al., [2406.04054v1](http://arxiv.org/abs/2406.04054v1)\n\n Accurate modelling of the one-to-two halo transition has long been difficult to achieve. We demonstrate that physically motivated halo definitions that respect the bimodal phase-space distribution of dark matter particles near halos resolves this difficulty. Specifically, the two phase-space components are overlapping and correspond to: 1) particles \\it orbiting \\rm the halo; and 2) particles \\it infalling \\rm into the halo for the first time. Motivated by this decomposition, Garc\\'ia [R. Garc\\'ia et. al., MNRAS 521, 2464 (2023)] advocated for defining haloes as the collection of particles orbiting their self-generated potential. This definition identifies the traditional one-halo term of the halo--mass correlation function with the distribution of orbiting particles around a halo, while the two-halo term governs the distribution of infalling particles. We use dark matter simulations to demonstrate that the distribution of orbiting particles is finite and can be characterised by a single physical scale $r\\_{\\rm h}$, which we refer to as the \\it halo radius. \\rm The two-halo term is described using a simple yet accurate empirical model based on the Zel'dovich correlation function. We further demonstrate that the halo radius imprints itself on the distribution of infalling particles at small scales. Our final model for the halo--mass correlation function is accurate at the $\\approx 2\\%$ level for $r \\in [0.1,50]\\ h^{-1}\\ Mpc$. The Fourier transform of our best fit model describes the halo--mass power spectrum with comparable accuracy for $k\\in [0.06, 6.0]\\ h\\ Mpc^{-1}$.\n\n", "2406.03990": "2024-06-06, **Galactic center GeV excess and classification of Fermi-LAT sources with machine learning**, Dmitry V. Malyshev et.al., [2406.03990v1](http://arxiv.org/abs/2406.03990v1)\n\n Excess of gamma rays with a spherical morphology around the Galactic center (GC) observed in the Fermi large area telescope (LAT) data is one of the most intriguing features in the gamma-ray sky. The excess has been interpreted by annihilating dark matter as well as emission from a population of unresolved millisecond pulsars (MSPs). We use a multi-class classification of Fermi-LAT sources with machine learning to study the distribution of MSP-like sources among unassociated Fermi-LAT sources near the GC. We find that the source count distribution of MSP-like sources is comparable with the MSP explanation of the GC excess.\n\n", "2406.03936": "2024-06-06, **Observational constraints on phenomenological emergent dark energy and barotropic dark matter characterized by a constant equation of state parameter**, Jianqi Liu et.al., [2406.03936v1](http://arxiv.org/abs/2406.03936v1)\n\n We propose a new cosmological model that considers dark matter as a barotropic fluid with a constant equation of state parameter and interprets dark energy as the phenomenological emergent dark energy rather than a cosmological constant. This proposal is based on extensive research on the extended properties of dark matter in the context of a cosmological constant and the intriguing findings that have emerged from our exploration of dark matter properties within the context of PEDE in our previous studies. We then place constraints on this model in light of the Planck 2018 Cosmic Microwave Background (CMB) anisotropies, baryon acoustic oscillation (BAO) measurements, the Pantheon compilation of Type Ia supernovae, a prior on $H\\_0$ that based on the latest local measurement by Riess et al., and the combination of KiDS and the VISTA Kilo-Degree Infrared Galaxy Survey (KiDS+VIKING-450). The results indicate a preference for a positive dark matter equation of state parameter at 68\\% confidence level for CMB+BAO, CMB+BAO+Pantheon and CMB+BAO+Pantheon+$H\\_0$ datasets. Furthermore, the Hubble tension between all of the datasets we used with R22 is very close to those of the PEDE, and the $S\\_8$ tension between Planck 2018 and KiDS+VIKING-450 is reduced from 2.3$\\sigma$ in the PEDE model to 0.4$\\sigma$ in the new model. However, Bayesian evidence indicates that PEDE favors our new model with very strong evidence from all the datasets considered in this study. Consequently, we conclude that the PEDE+$w\\_{\\rm dm}$ model is not a viable alternative to the PEDE model.\n\n", "2406.03829": "2024-06-06, **How much do we know the halo mass function? Predictions beyond resolution**, Weiguang Cui et.al., [2406.03829v1](http://arxiv.org/abs/2406.03829v1)\n\n As a common gravitation virialized object in the standard $\\Lambda$CDM cosmology, dark matter halo connects from the large-scale structure all the way down to galaxy and star formation. However, as the nature of dark matter particles is still unclear, the smallest halo that can be formed in the universe is still unknown. Based on some simple assumptions, this paper uses the \\textsc{hmf} package to investigate different halo functions used to quantify its number and mass distributions -- the halo mass function and the integrated/differential mass function (IMF/DMF) respectively. The halo mass in this study extends from the galaxy cluster to the dark matter particle mass at the GeV scale. Surprisingly, different fitting functions for the HMF are in remarkable agreement, a scatter within 2 orders of magnitude, down to dark matter particle mass, of which the halo mass spans about 80 orders of magnitude and the HMF covers over 100 orders of magnitude. The DMF reveals an interesting and consistent peak at $\\sim 10^{13} \\hMsun$, which implies galaxy groups have the highest contribution to the total matter mass. Furthermore, the effects of cosmology parameters on these halo functions are also examined with the most massive halos, or these halo functions at the most massive halo mass end, more sensitive to them. Different behaviours of these halo functions due to the changes in cosmology parameters can be used to break the degeneracy between them.\n\n"}, "supernova": {"2406.04087": "2024-06-06, **Contribution of young massive star clusters to Galactic diffuse $γ$-ray emission**, Stefano Menchiari et.al., [2406.04087v1](http://arxiv.org/abs/2406.04087v1)\n\n Context: Young massive stellar clusters (YMSCs) have emerged as potential $\\gamma$-ray sources, after the recent association of a dozen YMSCs with extended $\\gamma$-ray emission. The large size of the detected halos, comparable to that of the wind-blown bubble expected around YMSCs, makes the $\\gamma$-ray detection of individual YMSCs rather challenging. As a result, the emission from most of the Galactic YMSCs could be unresolved, thus contributing to the diffuse $\\gamma$-ray radiation observed along the Galactic Plane.   Aims: In this study, we estimate the possible contribution to the Galactic diffuse $\\gamma$-ray emission from a synthetic population of YMSCs, and we compare it with observations obtained with different experiments, from 1 GeV to hundreds of TeV, in two regions of the Galactic Plane.   Methods: As the population of galactic YMSCs is only known locally, we evaluate the contribution of $\\gamma$-ray emission relying on the simulation of synthetic populations of YMSCs based on the observed properties of local clusters. We compute the $\\gamma$-ray emission from each cluster assuming that the radiation is purely hadronic in nature and produced by cosmic rays accelerated at the cluster's collective wind termination shock.   Results: We find that the $\\gamma$-ray emission from unresolved YMSCs can significantly contribute to the observed Galactic diffuse flux, especially in the inner part of the Galaxy. The result is independent of the assumed particle transport, but an important role is played by Wolf-Rayet stars. The predicted $\\gamma$-ray flux should be considered as a lower limit, given that our calculation neglects the contribution of supernovae exploding in YMSCs.\n\n", "2406.04075": "2024-06-06, **The Vela Pulsar Progenitor Was Most Likely a Binary Merger**, Jeremiah W. Murphy et.al., [2406.04075v1](http://arxiv.org/abs/2406.04075v1)\n\n Stellar evolution theory restricted to single stars predicts a minimum mass for core-collapse supernovae (CCSNe) of around eight solar masses; this minimum mass corresponds to a maximum age of around 45 million years for the progenitor and the coeval population of stars. Binary evolution complicates this prediction. For example, an older stellar population around 100 million years could contain stellar mergers that reach the minimum mass for core collapse. Despite this clear prediction by binary evolution, there are few, if any CCSNe associated with a distinctly older stellar population...until now. The stellar population within 150 pc of the Vela Pulsar is inconsistent with single-star evolution only; instead, the most likely solution is that the stellar population is $\\ge$80 Myr old, and the brightest stars are mass gainers and/or mergers, the result of binary evolution. The evidence is as follows. Even though the main sequence is clearly dominated by a $\\ge$80-Myr-old population, a large fraction of the corresponding red giants is missing. The best-fitting single-star model expects 51.5 red giants, yet there are only 22; the Poisson probability of this is $1.7 \\times 10^{-6}$. In addition, there is an overabundance of bright, young-looking stars (25-30 Myrs old), yet there is not a corresponding young main sequence (MS). Upon closer inspection, the vast majority of the young-looking stars show either past or current signs of binary evolution. These new results are possible due to exquisite Gaia parallaxes and a new age-dating software called {\\it Stellar Ages}.\n\n", "2406.03936": "2024-06-06, **Observational constraints on phenomenological emergent dark energy and barotropic dark matter characterized by a constant equation of state parameter**, Jianqi Liu et.al., [2406.03936v1](http://arxiv.org/abs/2406.03936v1)\n\n We propose a new cosmological model that considers dark matter as a barotropic fluid with a constant equation of state parameter and interprets dark energy as the phenomenological emergent dark energy rather than a cosmological constant. This proposal is based on extensive research on the extended properties of dark matter in the context of a cosmological constant and the intriguing findings that have emerged from our exploration of dark matter properties within the context of PEDE in our previous studies. We then place constraints on this model in light of the Planck 2018 Cosmic Microwave Background (CMB) anisotropies, baryon acoustic oscillation (BAO) measurements, the Pantheon compilation of Type Ia supernovae, a prior on $H\\_0$ that based on the latest local measurement by Riess et al., and the combination of KiDS and the VISTA Kilo-Degree Infrared Galaxy Survey (KiDS+VIKING-450). The results indicate a preference for a positive dark matter equation of state parameter at 68\\% confidence level for CMB+BAO, CMB+BAO+Pantheon and CMB+BAO+Pantheon+$H\\_0$ datasets. Furthermore, the Hubble tension between all of the datasets we used with R22 is very close to those of the PEDE, and the $S\\_8$ tension between Planck 2018 and KiDS+VIKING-450 is reduced from 2.3$\\sigma$ in the PEDE model to 0.4$\\sigma$ in the new model. However, Bayesian evidence indicates that PEDE favors our new model with very strong evidence from all the datasets considered in this study. Consequently, we conclude that the PEDE+$w\\_{\\rm dm}$ model is not a viable alternative to the PEDE model.\n\n", "2406.03691": "2024-06-06, **Precise measurement of pion-bump structure using future MeV gamma-ray detectors**, Jiahao Liu et.al., [2406.03691v1](http://arxiv.org/abs/2406.03691v1)\n\n The pion-bump structure in the gamma-ray spectrum is a direct proof for the hadronic origin of the gamma rays, and thus the decisive evidence for the acceleration of hadronic cosmic rays in astrophysical objects. However, the identification of such a spectral feature is limited by the resolution and energy coverage of current gamma-ray instruments. Furthermore, there are unavoidable bremsstrahlung emissions from secondary and primary electrons, which may dominate the gamma-ray emission below the pion-bump. Thus, the study of this gamma-ray emission component can provide unique information on the acceleration and confinement of high-energy particles. In this paper, we studied the predicted gamma-ray spectrum assuming both hadronic or leptonic origin in mid-aged supernova remnants W44, we discuss the detection potential of future MeV missions on these emissions and possible implications.\n\n", "2406.03685": "2024-06-06, **Shockingly Bright Warm Carbon Monoxide Molecular Features in the Supernova Remnant Cassiopeia A Revealed by JWST**, J. Rho et.al., [2406.03685v1](http://arxiv.org/abs/2406.03685v1)\n\n We present JWST NIRCam (F356W and F444W filters) and MIRI (F770W) images and NIRSpec- IFU spectroscopy of the young supernova remnant Cassiopeia A (Cas A). We obtained the data as part of a JWST survey of Cas A. The NIRCam and MIRI images map the spatial distributions of synchrotron radiation, Ar-rich ejecta, and CO on both large and small scales, revealing remarkably complex structures. The CO emission is stronger at the outer layers than the Ar ejecta, which indicates the reformation of CO molecules behind the reverse shock. NIRSpec-IFU spectra (3 - 5.5 microns) were obtained toward two representative knots in the NE and S fields. Both regions are dominated by the bright fundamental rovibrational band of CO in the two R and P branches, with strong [Ar VI] and relatively weaker, variable strength ejecta lines of [Si IX], [Ca IV], [Ca V] and [Mg IV]. The NIRSpec-IFU data resolve individual ejecta knots and filaments spatially and in velocity space. The fundamental CO band in the JWST spectra reveals unique shapes of CO, showing a few tens of sinusoidal patterns of rovibrational lines with pseudo-continuum underneath, which is attributed to the high-velocity widths of CO lines. The CO also shows high J lines at different vibrational transitions. Our results with LTE modeling of CO emission indicate a temperature of 1080 K and provide unique insight into the correlations between dust, molecules, and highly ionized ejecta in supernovae, and have strong ramifications for modeling dust formation that is led by CO cooling in the early Universe.\n\n"}}