{"neutrino": {"2511.21650": "2025-11-26, **Updated bounds on the (1,2) neutrino oscillation parameters after first JUNO results**, Francesco Capozzi et.al., [2511.21650v1](http://arxiv.org/abs/2511.21650v1)\n\n Within the standard $3ν$ framework, we discuss updated bounds on the leading oscillation parameters related to the $(ν\\_1,\\,ν\\_2)$ states, namely, the squared mass difference $δm^2=m^2\\_2-m^2\\_1$ and the mixing parameter $\\sin^2θ\\_{12}$. A previous global analysis of 2024 oscillation data estimated $δm^2$ and $\\sin^2θ\\_{12}$ with fractional $1σ$ errors of about $2.3\\%$ and $4.5\\%$, respectively. First we update the analysis by applying the latest SNO+ constraints, that slightly shift the $(δm^2,\\,\\sin^2θ\\_{12})$ best fits. Then we apply the constraints placed by the first JUNO results, that significantly reduce the uncertainties of both parameters. Our updated global bounds (as of 2025) can be summarized as: $δm^2/10^{-5}{\\rm eV}^2 = 7.48\\pm 0.10$ and $\\sin^2θ\\_{12}=0.3085\\pm0.0073$ (with correlation $ρ=-0.20$), corresponding to $1σ$ uncertainties as small as $1.3\\%$ and $2.4\\%$, respectively. We also comment on minor physical and statistical effects that, in the future, may contribute to lift the current mass-ordering degeneracy of $(δm^2,\\,θ\\_{12})$ estimates.\n\n", "2511.21634": "2025-11-26, **Cosmological Probes of Lepton Parity Freeze-in Dark Matter: $ΔN_{\\rm eff}$ & Gravitational Waves**, Ernest Ma et.al., [2511.21634v1](http://arxiv.org/abs/2511.21634v1)\n\n In the canonical type-I seesaw mechanism for neutrino masses, a residual symmetry known as lepton parity: $(-1)^L$, remains preserved. Introducing a Majorana fermion $S$ with even lepton parity renders it naturally stable, making it a viable dark matter (DM) candidate. The addition of a lepton parity odd singlet scalar $σ$ allows for the coupling $N S σ$, where $N$ is the right-handed neutrino. If $S$ is not thermalized, then DM relic can be produced in two distinct ways: (i) for reheating temperature, $T\\_{\\rm rh}>m\\_{N}$, dominantly through the decay of $N$ ($N\\rightarrow Sσ$), and (ii) for $T\\_{\\rm EW}<T\\_{\\rm rh}\\ll m\\_{N}$, via standard model Higgs ($h$) decay ($h\\rightarrow SS$ at one loop). If the $σ-h$ quartic coupling is large, then it can lead to a strong first-order electroweak phase transition even if $\\langleσ\\rangle=0$. Alternatively, if $σ-h$ coupling is small, then $σ$ can freeze out with a larger abundance, and hence its decay ($σ\\rightarrow Sν$) at late epochs can give rise to additional relativistic degrees of freedom ($Δ{N}\\_{\\rm eff}$). Thus, the framework gives a viable DM with mass range varying from MeV to TeV and leaves observable imprints, via gravitational waves and $Δ{N}\\_{\\rm eff}$, which offer complementary probes, potentially detectable in future gravitational wave and CMB experiments.\n\n", "2511.21627": "2025-11-26, **Evidence For A Correlation Between Astrophysical Neutrinos and Radio Flares**, Yjan A. Gordon et.al., [2511.21627v1](http://arxiv.org/abs/2511.21627v1)\n\n We use data from the first two epochs of the Very Large Array Sky Survey (VLASS) and the IceCube Neutrino Observatory to search for evidence of a correlation between radio variability and the detection of astrophysical neutrinos. We find an excess number of associations between flaring radio sources and neutrinos that were detected between the first and second VLASS observations at $>2σ$ confidence. This excess is consistent with radio flares contributing $\\sim13\\,\\%$ of the astrophysical neutrinos observed by IceCube. Notably $>80\\,\\%$ of the radio flares associated with neutrinos are not detected at either $γ$-ray or X-ray wavelengths, highlighting the importance of radio observations for identifying potential electromagnetic counterparts to astrophysical neutrinos. No excess in the number of associations between the wider radio-variable population and the IceCube neutrinos is seen when no time constraint is placed on the neutrino detection. We predict that data from future VLASS epochs will see an excess number of associations between radio flares and neutrinos at the $>3σ$ level, and expected improvements to the positional constraints on the neutrinos may increase that confidence to $>5σ$, should our results be representative.\n\n", "2511.21532": "2025-11-26, **Simulations of high-energy neutrino emissions from blazars with the LeHa-Paris code**, Francesco Carenini et.al., [2511.21532v1](http://arxiv.org/abs/2511.21532v1)\n\n The identification of astrophysical sources responsible for high-energy cosmic neutrinos has long been a challenge. A significant milestone was achieved with the blazar TXS 0506+056, which was found to be in a flaring state of high gamma-ray emission and associated at the 3$σ$ level with a 290 TeV neutrino detected by IceCube in September 2017. This discovery motivated deeper exploration of the theoretical link between photon and neutrino emissions. In this context, simulations of proton-photon interactions in blazars and radiative processes are conducted using advanced numerical codes to predict neutrino spectra. The LeHa-Paris code, previously applied to TXS 0506+056, enables the computation of both leptonic and hadronic components of blazar spectral energy distributions, facilitating exploration of a broad parameter space. In this work, starting from the case of PKS 2155-304, one of the brightest and most studied High-frequency-peaked BL Lacs (HBLs), known for its extreme variability and subject of multi-wavelength observational campaigns, a methodology has been developed to extend neutrino flux templates, optimized via LeHa-Paris, to the full class of HBLs. Afterwards, neutrino emission models for a subset of HBLs from the 3HSP catalogue are derived.\n\n", "2511.21190": "2025-11-26, **Molybdenum and ruthenium in the Galactic disk: A closer look at their nucleosynthesis components**, Tamara Mishenina et.al., [2511.21190v1](http://arxiv.org/abs/2511.21190v1)\n\n The stellar origin of the elements molybdenum (Mo, Z=42) and ruthenium (Ru, Z=44) is still a matter of debate. Studying their abundances provides valuable insights into nucleosynthesis processes and the broader evolution of neutron-capture elements. We presented new observations of Mo and Ru, together with nearby neutron-capture elements strontium (Sr) and zirconium (Zr) for a new sample of 154 giant stars, located in the Galactic disk with metallicities -1 < [Fe/H] < +0.3. The abundances were determined under the assumption of the local thermodynamic equilibrium by fitting synthetic spectra. The abundances of Mo were derived from the Mo I lines at 5506 and 5533 A, the abundances of Ru were determined from Ru I lines at 4584, and 4757 A. For most of the giant stars observed in this work, Mo and Ru abundances were determined for the first time. We compare our observations with the signatures from different nucleosynthesis processes. Both the [Mo/Fe] and [Ru/Fe] in our stars show a decreasing trend with respect to increasing [Fe/H]. This pattern is similar to that of [Zr/Fe], whereas [Sr/Fe] exhibits a relatively flat trend with metallicity. Compared to the s-process ratios, all stars show a lower [Zr/Mo] and a higher [Ru/Mo], as expected from classical nucleosynthesis. Still, it is unclear if additional contributions from neutrino-wind components or the i-process is needed to explain the observed scatter of [Zr/Mo] and [Ru/Mo] in the Milky Way disk. Indeed, such a dispersion is consistent with the variations also seen in r-II stars at low metallicity and could therefore result from the combined contributions of r-process and s-process to galactic chemical evolution. The observed [Zr/Mo] and [Ru/Mo] scatter in r-II stars should be constrained by future investigations to define if any contributions of additional nucleosynthesis components are needed.\n\n", "2511.20767": "2025-11-25, **The Effect of the Fast-Flavor Instability on Core-Collapse Supernova Models: II. Quasi-Equipartition and the Impact of Various Angular Reconstruction Methods**, Tianshu Wang et.al., [2511.20767v1](http://arxiv.org/abs/2511.20767v1)\n\n In this work, we explore in a consistent fashion the effects of fast flavor conversion (FFC) in 1D and 2D core-collapse supernova (CCSN) simulations. In addition, we investigate the impact of various angular reconstruction methods and compare the ``3-species'' and ``4-species'' neutrino transport schemes. We find that the FFC effects are insensitive to the different methods tested and that the FFC alters supernova hydrodynamics is only minor ways. We also present a ``quasi-equipartition'' approximation which can be used to estimate the FFC-altered neutrino properties by post-processing the neutrino signals extracted from no-oscillation CCSN simulations. The relative errors in neutrino number and energy luminosities of this phenomenological method are less than 2\\% for 1D models, and less than 10\\% for 2D models. This method provides a simple way to include the effects of FFC on neutrino signals without implementing a complex and expensive FFC scheme or redoing simulations.\n\n", "2511.20757": "2025-11-25, **Reanalyzing DESI DR1: 2. Constraints on Dark Energy, Spatial Curvature, and Neutrino Masses**, Anton Chudaykin et.al., [2511.20757v1](http://arxiv.org/abs/2511.20757v1)\n\n We carry out an independent re-analysis of the Dark Energy Spectroscopic Instrument (DESI) public dataset, focusing on extensions to the standard cosmological model, $Λ$CDM. Utilizing the dataset and Effective Field Theory (EFT)-based pipeline described in Paper 1, we constrain cosmological models with massive neutrinos ($Λ$CDM+$M\\_ν$), spatial curvature ($oΛ$CDM), dynamical dark energy ($w\\_0w\\_a$CDM), and their combinations using the power spectrum and bispectrum of DESI galaxies and quasars. Our work also presents the first measurements of relevant non-minimal cosmological parameters from the combination of cosmic microwave background (CMB) and DESI full-shape (FS) data, which are made possible thanks to carefully chosen priors on EFT parameters. We find that the addition the FS likelihood to DESI's baryon acoustic oscillation (BAO) data improves the limits on the spatial curvature by a factor of two over the BAO only results, though the improvements are less significant with the CMB data. The dark energy equation of state figure-of-merit increases both with and without the supernovae data (SNe), by $\\approx30\\%$ and $\\approx20\\%$ relative to the CMB+BAO and CMB+BAO+SNe results, respectively. Our FS likelihood also yields the strongest CMB-independent constraint on the total neutrino mass $M\\_ν<0.32\\,{\\rm eV}$, with the $30\\%$ improvement due to the bispectrum. In combination with the CMB, we find a $14\\%$ improvement assuming the $Λ$CDM+$M\\_ν$ model (yielding $M\\_ν<0.059\\,{\\rm eV}$), but this increases to $22\\%$ when using non-minimal backgrounds: $M\\_ν<0.097\\,{\\rm eV}$ in $oΛ$CDM+$M\\_ν$ and $M\\_ν<0.13\\,{\\rm eV}$ in $w\\_0w\\_a$CDM+$M\\_ν$. Overall, our work illustrates that robust and substantial gains in constraining power can be obtained by incorporating the FS power spectrum and bispectrum measurements in analyses of non-minimal cosmological models.\n\n", "2511.20400": "2025-11-25, **Optimization of the X-Arapuca Photon Collection Efficiency for the DUNE Horizontal Drift Far Detector**, E. Bertolini et.al., [2511.20400v1](http://arxiv.org/abs/2511.20400v1)\n\n The Deep Underground Neutrino Experiment (DUNE) Far Detector (FD) Photon Detection System (PDS) employs the X-Arapuca concept, a photon trapping system relying on reflective surfaces and dichroic filters. In this paper are reported measurements, performed at the University of Milano-Bicocca, aimed at increasing the FD Horizontal Drift (HD) PDS module efficiency. The baseline implementation of the X-Arapuca concept for the FD-HD PDS module is close to the DUNE requirements as demonstrated in the collaborations laboratory testing. However, an increased performance would provide a safety margin for a detector planned to be operated for 30 years, without possibility of performing maintenance. A higher detector performance would also benefit the DUNE low energy physics program. The already proven Milano-Bicocca setup has been utilized to test different PDS module configurations comparing them to the original baseline. Exploiting prior knowledge of the X-Arapuca components and Geant4 based optical simulations it has been possible to achieve up to an ~84% performance increase over the baseline design. In the following it is presented the testing procedure, the performed measurements and a brief discussion on the obtained results.\n\n", "2511.20320": "2025-11-25, **Revisiting lepton flavor violation: $τ$ and meson decays**, Kevin A. Urquía-Calderón et.al., [2511.20320v1](http://arxiv.org/abs/2511.20320v1)\n\n The minimal type-I seesaw model provides a simple explanation of neutrino flavor oscillations and induces charged lepton flavor violation (cLFV). Despite extensive previous studies, semileptonic cLFV channels remain underexplored. Using updated form factors, decay constants, and oscillation data, we revisit $τ$ and meson decay channels, performing a systematic comparison across the seesaw parameter space. Surprisingly, we find that decays such as $τ\\to \\ellρ$ can dominate over purely leptonic $τ$-sector probes, including $τ\\to 3\\ell$ and even $τ\\to\\ell\\,γ$, in certain regions. In contrast, heavy-meson decays remain far below experimental sensitivity. Considering global constraints on the seesaw parameters, we derive branching ratios for the relevant cLFV processes and identify those within potential reach of next-generation experiments.\n\n", "2511.20184": "2025-11-25, **Search for the potential electromagnetic counterparts of neutrino events in SDSS galaxies at z<0.1**, O. Sergijenko. et.al., [2511.20184v1](http://arxiv.org/abs/2511.20184v1)\n\n Identification of electromagnetic emission in coincidence with high-energy neutrinos is fundamentally important for multimessenger astronomy. Such observations are essential for constraining source localization, determining the source type, and understanding emission mechanisms. Typically, they require following up a neutrino alert (IceCube issues two alert streams: Gold, with at least 50 percent probability of astrophysical origin, and Bronze, with at least 30 percent probability) with an electromagnetic facility, primarily in X-ray and gamma-ray bands. Another approach involves electromagnetic monitoring of hot spots in the IceCube skymap, i.e., positions exceeding the instrument sensitivity. An alternative method consists in performing correlation analysis across available neutrino events and source catalogs. We searched for spatial coincidence between galaxies from SDSS and high-energy neutrino events. The analysis includes IceCube Gold alerts and neutrino-electromagnetic coincidence events from AMON (Astrophysical Multimessenger Observatory Network), identified through the end of September 2025. We examined galaxies from the morphological catalog at redshifts 0.02 to 0.1, which contains 315,776 SDSS DR9 objects with absolute stellar magnitudes in the range from -24 to -13 in the r band. Among 59 IceCube Gold alerts, we found three with only one galaxy (SDSS J231231.52+033415.1) within the 50 percent containment radius. Among 24 neutrino-electromagnetic coincidence events, three more contain only one galaxy (SDSS J220711.14+122535.9) within the same radius. These six galaxies represent the most promising candidates for potential host galaxies of neutrino sources. We summarize their available multiwavelength data and the ZTF light curves obtained from 2018 to 2025.\n\n", "2511.20148": "2025-11-25, **Is the large uncertainty of $δ_{CP}$ fundamentally encoded in the neutrino quantum state?**, Michela Ignoti et.al., [2511.20148v2](http://arxiv.org/abs/2511.20148v2)\n\n The precise measurement of the leptonic CP-violating phase $δ\\_{CP}$ remains one of the major open challenges in neutrino physics, as current experiments achieve only very limited accuracy. We address this issue through the lens of quantum estimation theory. A distinctive feature of neutrino oscillation experiments is that they cannot freely optimize the probe or measurement, since both are constrained by the production and detection of flavor eigenstates. We therefore examine whether the large uncertainty in $δ\\_{CP}$ originates from intrinsic reasons, either of the neutrino quantum state or of flavor measurements, or if it instead stems from experimental limitations. By comparing quantum and classical Fisher information, we demonstrate that the limited sensitivity to $δ\\_{CP}$ originates primarily from the information content of flavor measurements. Furthermore, we show that targeting the second oscillation maximum, as in the ESS$ν$SB proposal, substantially enhances $δ\\_{CP}$ information compared to experiments centered on the first maximum.\n\n", "2511.19817": "2025-11-25, **Calibration Plan for the SBC 10-kg Liquid Argon Detector with 100 eV Target Threshold**, SBC collaboration et.al., [2511.19817v1](http://arxiv.org/abs/2511.19817v1)\n\n The Scintillating Bubble Chamber (SBC) Collaboration is designing a new generation of low background, noble liquid bubble chamber experiments with sub-keV nuclear recoil threshold. These experiments combine the electronic recoil blindness of a bubble chamber with the energy resolution of noble liquid scintillation, and maintain electron recoil discrimination at higher degrees of superheat (lower nuclear recoil thresholds) than Freon-based bubble chambers. A 10-kg liquid argon bubble chamber has the potential to set world leading limits on the dark matter nucleon cross-section for $O(\\mathrm{GeV}/c^{2})$ masses, and to perform a high statistics coherent elastic neutrino nuclear scattering measurement with reactor neutrinos. This work presents a detailed calibration plan to measure the detector response of these experiments, combining photoneutron scattering with two new techniques to induce sub-keV nuclear recoils: nuclear Thomson scattering and thermal neutron capture.\n\n"}, "dark matter": {"2511.21520": "2025-11-26, **Freeze-in at Low Reheating and Direct Detection of Fermion Dark Matter**, Amir Amiri et.al., [2511.21520v1](http://arxiv.org/abs/2511.21520v1)\n\n We investigate a low-reheating-temperature freeze-in scenario within a minimal model of fermionic dark matter interacting through a pseudoscalar mediator. In this setup, dark matter is produced via the decay of the pseudoscalar, which remains in thermal equilibrium with the Standard Model bath. We derive the thermalization and non-thermalization conditions for the new fields and obtain the corresponding direct-detection constraints and projections on the model based on LZ and DARWIN experiments, respectively.\n\n", "2511.21468": "2025-11-26, **Testing modified gravity with 3x2pt analyses in galaxy mocks**, Marc Alemany-Gotor et.al., [2511.21468v1](http://arxiv.org/abs/2511.21468v1)\n\n Stage-IV surveys will enable unprecedented tests of gravity on cosmological scales. However, assuming General Relativity in the analysis of large-scale structure could introduce systematic biases if gravity deviates from GR at these scales. Modified gravity theories, such as the Hu-Sawicki formulation of $f(R)$ gravity, offer an alternative explanation for cosmic acceleration without invoking a cosmological constant, while remaining consistent with Solar System tests through screening mechanisms. In this work, we quantify the cosmological parameter biases that arise when using a combination of galaxy clustering and weak-lensing data-vectors, the so-called 3x2pt analysis, from an $f(R)$ galaxy mock under the incorrect assumption of GR, using for the first time high-fidelity full-sky galaxy mock catalogues. We employ a pair of twin simulations: one with GR and one with Hu--Sawicki $f(R)$ gravity with $\\|f\\_{R0}\\| = 10^{-5}$. The mocks are built using an HOD method to populate the dark matter haloes with galaxies, calibrated against SDSS observations at low redshift. Using conservative scale cuts to minimise modelling uncertainties, we perform 3x2pt analyses and infer cosmological parameters through nested sampling, validating our pipeline with the GR mock. Our results show that when analysing the $f(R)$ galaxy mock assuming GR, the recovered cosmological parameters are very significantly biased, even when considering conservative scale cuts: the Figure of Bias reaches $\\sim12σ$ for both $\\{Ω\\_{\\rm m}, σ\\_8\\}$ and $S\\_8$. These biases persist even when marginalising over the galaxy bias and baryonic feedback, demonstrating that nuisance parameters cannot absorb the effects of modified gravity. We conclude that incorrectly assuming GR in a universe governed by $f(R)$ gravity leads to severe and detectable biases in cosmological inference for Stage-IV surveys.\n\n", "2511.21362": "2025-11-26, **Weak gravity at micron scales from dark bubble cosmology and its cosmological consequences**, Ulf Danielsson et.al., [2511.21362v1](http://arxiv.org/abs/2511.21362v1)\n\n The dark bubble model makes a positive cosmological constant natural in string theory, and predicts several new physical phenomena within reach in the near future. In this paper we study the experimental consequences of the model for the strength of gravity at scales of order $10^{-5}$m. Contrary to other models of gravity involving extra dimensions, the dark bubble model predicts gravity to become weaker rather than stronger at small scales, compared to Newtonian gravity. In particular, we provide explicit predictions of measurable deviations using table top experiments. We also show how the same effect reduces the effective force of gravity at high energy densities in cosmology, leading to a period of early inflation without the need for anything beyond radiation. We also discuss the quantum origin of the universe with a 5D black hole acting as a catalyst for the nucleation of the dark bubble and how it accounts for the present matter content in the universe. This leads to a prediction of $Ω\\_c \\approx 5\\times 10^{-4}$ for a positive curvature of the universe, suggesting an explanation of the why-now-problem of the cosmological constant. We end by speculating on how to incorporate AdS black shells as black hole mimickers within the dark bubble model.\n\n", "2511.21290": "2025-11-26, **Exploring muonphilic dark matter with the $Z_2$-even mediator at muon colliders**, Wanyun Chen et.al., [2511.21290v1](http://arxiv.org/abs/2511.21290v1)\n\n The Galactic Center GeV Excess (GCE) remains a compelling but enigmatic signal from the inner region of our galaxy. Muonphilic dark matter (DM), which couples exclusively to muons via a new mediator, provides a viable explanation for the GCE and relic density while naturally evading constraints from direct detection, collider searches and other multi-messenger observations. Based on the viable non-resonant parameter space identified in previous global fits, we perform a comprehensive study exploring the prospects for discovering such muonphilic DM in the context of a future $3$ TeV muon collider, focusing on simplified models with a $Z\\_2$-even mediator. Three distinct search strategies are investigated: visible on-shell mediator decays ($μ^{+}μ^{-}γ$ final state), invisible on-shell mediator decays (mono-photon plus missing energy), and mono-photon production via off-shell mediators. Through a detailed signal-background analysis using cut-and-count methods, we project the exclusion limits at $95\\%$ confidence level for seven representative models across a wide range of mediator masses. Our results demonstrate that the projected limits cover a significant portion of the viable parameter space that explains the GCE, establishing a muon collider as a decisive machine for testing the muonphilic DM hypothesis.\n\n", "2511.21071": "2025-11-26, **Cosmological tensions in Proca-Nuevo theory**, Hsu-Wen Chiang et.al., [2511.21071v1](http://arxiv.org/abs/2511.21071v1)\n\n We study the cosmological predictions of (extended) Proca-Nuevo theory. This vector-tensor theory enjoys stable homogeneous and isotropic solutions characterized by an effective dark energy fluid, with behavior that ranges from freezing quintessential to thawing phantom-like, serving as a motivated framework to scrutinize the cosmological tensions that affect the standard $Λ$CDM model. While the model we consider is sufficiently generic to encompass a large class of field theories, it distinguishes itself from scalar dark energy models (quintessential ones, kinetic ones and non-minimally coupled ones) by the presence of what would be classed as a vector degree of freedom which can be for instance inherited from more generic theories of gravity. We improve on previous work in several directions: we consider a general one-parameter class of background models; identify a so-called 'special' model and analyze observational constraints taking also into account perturbations and making use of wide up-to-date catalogs of datasets including recently released ones. We find that the one-parameter Proca-Nuevo model is preferred over $Λ$CDM at $1.5σ$ when fitting CMB and BAO data, and at $2.4σ$ when further adding low-redshift data. The Hubble tension is alleviated, dropping from $5.8σ$ to $2.3σ$ (resp. $1.5σ$) between CMB with (and resp. without) BAO data and local measurements. On the other hand, we find that the vector field generically introduces a significant enhancement of the effective Newton constant, so that matching the observed matter power spectrum requires a mild amount of tuning to suppress the impact of perturbations. Since, at the background level, Proca-Nuevo is degenerate with other classes of theories, our results are also relevant to a wider range of set-ups including and beyond vector-tensor models.\n\n", "2511.20952": "2025-11-26, **Oscillations of dark matter halos in galaxies**, V. V. Flambaum et.al., [2511.20952v1](http://arxiv.org/abs/2511.20952v1)\n\n Baryonic matter and dark matter in galaxies represent two substances linked by the gravitational interaction. Collisions of galaxies may create an offset between the centers of mass of these two components. Ignoring internal dynamics of particles in the dark matter halo and Keplerian rotations of stars in the galaxy, we focus on possible relative oscillations of the visible matter in the dark matter halo. This two-fluid model is somewhat similar to the ``giant dipole resonances'' in nuclei. We estimate possible amplitude and frequency of such oscillations assuming that the offset of the centers of mass is small as compared with the size of the galaxy. Such oscillations, if exist, should manifest themselves in anomalies of velocities of stars in the galaxy, such as the density waves and runaway stars which have orbit periods in resonance with oscillations. These matter -- dark matter oscillations may affect direction and magnitude of the dark matter wind coming to Earth.\n\n", "2511.20761": "2025-11-25, **Caustic crossings in giant arcs with extended dark matter objects**, Djuna Croon et.al., [2511.20761v1](http://arxiv.org/abs/2511.20761v1)\n\n Caustic-crossing stars observed in giant arcs behind galaxy clusters provide a powerful probe of dark matter substructure. While previous work has focused on point-like lenses such as primordial black holes, we extend this framework to extended dark objects (EDOs), including ultracompact minihalos formed from the collapse of primordial overdensities. We develop an analytic model of microlensing by EDOs embedded in a macrolensing cluster potential and derive the resulting caustics and light curves. Depending on the EDO size relative to the effective Einstein radius, we show that they may generate additional narrow caustics, leading to novel features in the light curve. Applying our framework to the MACS J1149 LS1 ``Icarus'' event, we constrain EDOs with radii up to $10^7 R\\_\\odot$. Our results demonstrate that caustic-crossing events complement galactic microlensing searches, as they can probe EDOs with larger physical size. We discuss the implications for current and future observations, which promise to deliver a statistical sample of caustic transients and correspondingly sharper constraints on dark objects.\n\n", "2511.20598": "2025-11-25, **Emergent Superfluidity of Hard-Core Excitons in Single-Layer Breathing-Kagome Nb$_3$Te$_x$Cl$_{8-x}$**, Mahtab A. Khan et.al., [2511.20598v1](http://arxiv.org/abs/2511.20598v1)\n\n We develop a microscopic theory of superfluidity for hard-core dark excitons on the triangular lattice by mapping the large-$U$ Bose--Hubbard model to an effective XXZ spin-$\\frac{1}{2}$ Hamiltonian including virtual hopping processes. Within this framework, we identify the superfluid phase that emerges between the two Mott-insulating endpoints at fillings 0 and 1, and derive its mean-field structure via a canted-spin solution. We then construct the corresponding continuum Landau-Ginzburg (LG) functional and analyze phase fluctuations and vortex dynamics. In two dimensions, the superfluid--normal transition is shown to be governed by a Berezinskii--Kosterlitz--Thouless (BKT) mechanism with a stiffness determined by microscopic parameters. Our results provide a unified description connecting lattice-scale exciton dynamics to continuum critical behavior in triangular geometries.\n\n", "2511.20595": "2025-11-25, **Inferring the Impacts of Baryonic Feedback from Kinetic Sunyaev-Zeldovich Cross-Correlations**, Alex Laguë et.al., [2511.20595v1](http://arxiv.org/abs/2511.20595v1)\n\n The complex processes of baryonic feedback associated with galaxy evolution are still poorly understood, and their impact on the clustering of matter on small scales remains difficult to quantify. While many fitting functions and emulators exist to model the matter power spectrum, their input parameters are not directly observable. However, recent studies using hydrodynamical simulations have identified a promising correlation between the gas content of halos and changes to the matter power spectrum from feedback. Building on these findings, we create the first fully data-driven power spectrum emulator. We utilize the kinematic Sunyaev-Zeldovich (kSZ) effect, a secondary anisotropy in the cosmic microwave background, as a tracer of free electrons in and around halos. We train a neural network to learn the mapping between the suppression of the matter power spectrum and the shape of the kSZ power spectrum extracted with a radial velocity template. We train and validate our algorithm using the FLAMINGO suite of hydrodynamical simulations, which encompasses a wide range of feedback models. Our emulator can reconstruct the matter power spectrum at the sub-percent level for scales $k\\leq 5\\;h/$Mpc and $0.2\\leq z \\leq 1.25$ directly from the data. Our model is robust and retains percent-level accuracy even for feedback models and cosmological parameter values not seen during training (except in a few extreme cases drastically different from the fiducial model). Due to its robustness, our algorithm offers a new way to identify the sources of suppression in the matter power spectrum, breaking the degeneracies between baryonic feedback and new physics. Finally, we present a forecast for reconstruction of the matter power spectrum combining maps of the microwave background anisotropies from a Simons Observatory-like experiment and galaxy catalogs from the Dark Energy Spectroscopic Instrument.\n\n", "2511.20498": "2025-11-25, **Magnetic Bulk Photovoltaic Effect in Bernal Bilayer Graphene**, Yuncheng Mao et.al., [2511.20498v1](http://arxiv.org/abs/2511.20498v1)\n\n Magnetic fields break time-reversal symmetry (TRS) and reshape a material's spatial symmetry. Because the bulk photovoltaic effect (BPVE) is exquisitely sensitive to symmetry, it offers a natural arena for magnetic-field control. Here, we explore how shift current (SC) and magnetic ballistic current (MBC) evolve and emerge in AB-stacked Bernal bilayer graphene subjected to in-plane and out-of-plane magnetic fields. We find that the SC responds only mildly to weak fields, behaving as an almost even function of field strength. In contrast, the MBC is activated directly by TRS breaking and grows linearly with weak fields at selected photon energies. Focusing on AB-bilayer graphene ribbon we investigate the behavior of SC and MBC under both weak and strong vertical fields. We uncover the strikingly opposite roles played by edge states in the SC: under weak fields these highly localized, sublattice- and layer-polarized edge modes are essentially dark, yet under strong fields - when Landau levels dominate - the same edge states swell in spatial extent and become intensely bright contributors to the SC response.\n\n", "2511.20739": "2025-11-25, **Game Theory in Cosmology**, Oem Trivedi et.al., [2511.20739v1](http://arxiv.org/abs/2511.20739v1)\n\n We present a game-theoretic statistical framework for cosmology, which we term \\textit{Cosmological Teleodynamics}. We recast the dark sector, cosmic acceleration, large-scale structure, and cosmic tensions as emergent consequences of nonlocal memory and intrinsically persistent organization in a self-gravitating Universe. By introducing a maximum-caliber weight on cosmic histories and a bias functional encoding structural memory, we derive modified Friedmann, Boltzmann, and Poisson equations that naturally generate dark energy-like acceleration, dark matter-like clustering, and scale-dependent growth suppression. We also show how this approach can naturally help alleviate the $H\\_0$ and $S\\_8$ tensions, can produce anisotropic velocity fields, and predict environment-dependent halo signatures that cannot arise from particle dark matter or scalar-field dark energy. We also derive a generalized horizon entropy and temperature, revealing a nonequilibrium statistical origin for cosmic acceleration and formulating a Law of Universal Arbitrage Equilibrium that governs the evolution of the Universe, showing that it is expanding towards a continuous form of Nash equilibrium. Cosmological Teleodynamics therefore offers a unified, emergent, and testable alternative to the conventional dark sector, rooted not in new particles but in the intrinsic statistical and systemic structure of cosmic memory, and shows that the universe itself operates like a giant potential game.\n\n", "2511.20461": "2025-11-25, **Chiral phonons in metal-organic frameworks as quantum sensors for the direct detection of dark matter**, Marek Matas et.al., [2511.20461v1](http://arxiv.org/abs/2511.20461v1)\n\n We investigate a new quantum sensor for dark matter direct detection with sub-eV sensitivity, focusing on several candidate materials that potentially host chiral phonons with large magnetic moments that can be directly read out with an external magnetometer. We focus on metal-organic frameworks (MOFs) as possible candidate materials for single chiral phonon detection due to their noncentrosymmetric structure, tunability, and the ability to host these excitations in stable acoustic bands. We identify several promising candidates and compare their projected dark matter detection sensitivity for all possible interactions identified within effective field theory. We establish that the expected sensitivity does not depend heavily on the specific choice of the MOF, enabling us to tailor the final material composition to facilitate the magnetic readout. We then propose a prototype setup able to test the direct readout of a chiral phonon sensor with a surface-integrated magnetometer.\n\n", "2511.20430": "2025-11-25, **$B^+\\to K^+ ν\\barν$ Excess and DM semi-annihilation**, Jongkuk Kim et.al., [2511.20430v1](http://arxiv.org/abs/2511.20430v1)\n\n In 2023, Belle II collaboration announced the observarion of the $B^+ \\to K^+ ν\\barν$ decay channel for the first time. This decay channel provides a clean signal with high precision in theoretical calculation. However, we encounter $2.8σ$ deviation from the Standard Model (SM) prediction. To resolve this excess, we study scalar dark matter (DM) model with local discrete $Z\\_3$ symmetry. Assuming dark $U(1)\\_X \\equiv U(1)\\_{L\\_μ- L\\_τ}$ symmetry, this $U(1)\\_{L\\_μ- L\\_τ}$ symmetry is spontaneously broken into local discrete $Z\\_3$ by non-zero vacuum expectation value of dark Higgs boson. Considering dark Higgs mass is $2$GeV, we can explain the recent ${\\rm Br} (B^+ \\to K^+ ν\\barν)$ excess reported from Belle II collaboration and relic abundance at the same time.\n\n", "2511.20414": "2025-11-25, **Black Hole merger rates in the first billion years in light of JWST data**, P. F. V. Cáceres-Burgos et.al., [2511.20414v1](http://arxiv.org/abs/2511.20414v1)\n\n Context. Recent James Webb Space Telescope (JWST) discoveries have unveiled an abundance of faint and massive Active Galactic Nuclei (AGNs) at high redshifts (z=4-9), that surpass by 10 to 100 times the extrapolated bolometric (Bol) and ultraviolet (UV) luminosity functions (LF) from previous AGN campaigns. The two main models that are put forward to explain these observations correspond to light seeds (150 Msol) accreting in episodes of super Eddington, and heavy seeds ($10^3$ - $10^5$ Msol) growing at the Eddington limit. Future gravitational observatories like the Laser Interferometer Satellite Antenna (LISA) will help disentangle these models by reporting the BH-BH merger events from mid to high redshifts. Aims. This work aims to report the predicted merger rates in the heavy seed scenario in light of recent JWST data. In our models we explore (i) instantaneous merging between BHs, (ii) delayed merging after a dynamical timescale, as well as extreme spin configurations (a=0.99, a=-0.99) to bracket BH mass growth. Methods. We use Delphi, a semi-analytical model that tracks baryonic physics over a hierarchical evolution of dark matter halos through cosmic time within the first billion years of the Universe. We calibrate this model for it to simultaneously reproduce galaxy and JWST-AGNs observables. Results. We show reasonable agreement with the Bolometric Luminosity function at z=6, where BHs must accrete 10-100 times more gas than in previous works calibrated to pre-JWST data. However, we underpredict (overpredict) the bright end $10^45.5$ erg s$^-1$ (all luminosity range) at z=7 (z=5) by 1-3.2 dex (0.22-1.6 dex). Regarding BH-BH merger events, the instantaneous (delayed) models predict a total of 28.06 (19.61) yr$^-1$ for BHs at z>=5, which is within the range of merger rates reported in previous literature.\n\n", "2511.20393": "2025-11-25, **Multiscalar-metric gravity: merging gravity, dark energy and dark matter**, Yu. F. Pirogov et.al., [2511.20393v1](http://arxiv.org/abs/2511.20393v1)\n\n The status of a modification of General Relativity (GR) -- Spontaneously Broken Relativity (SBR) -- for merging gravity, dark energy (DE) and dark matter (DM) is presented. The modification is principally grounded on a multiscalar-metric concept of spacetime endowed with two dynamical structures: a basic metric and a set of the reversible multiscalar fields. The latter ones serve geometrically as exceptional dynamical coordinates among arbitrary kinematical/observer's ones and physically as a kind of gravitational Higgs fields producing possible spontaneous breaking of the symmetry (SSB) of relativity. The effective field theory (EFT) of the extended gravity based on the multiscalar-metric spacetime -- the metagravity -- is discussed and some of its particular realizations beyond GR as SBR are explicated. Physically, SBR results in appearance of massive tensor and scalar gravitons. Some of the emerging consequences, problems and prospects for SBR for future deeper unification of gravity with matter in the context of the relativity and internal symmetries breaking are shortly discussed.\n\n", "2511.20268": "2025-11-25, **Magnetic Order Unlocks Optical Access to Dark Excitons in CrSBr**, Sophie Bork et.al., [2511.20268v1](http://arxiv.org/abs/2511.20268v1)\n\n Hybrid quasiparticles that intertwine magnetic and electronic degrees of freedom underpin emerging strategies for manipulating and transducing quantum information in solids. A key missing element has been the ability to optically access dark excitons - optically forbidden but functionally crucial states that shape energy flow, coherence, and spin dynamics in quantum materials. Here we show that exciton-magnon coupling provides an optical gateway to dark excitons in the antiferromagnetic van der Waals semiconductor CrSBr. Broadband femtosecond reflectivity reveals a dark exciton at 1.46 eV that is entirely absent in static optical spectra but becomes visible through its coherent hybridization with a GHz magnon. High-photon-energy excitation further allows active control of the hybrid dispersion, enabling strong renormalization and selective enhancement of exciton-magnon interactions. These results establish a general mechanism by which magnetic order renders dark excitons optically addressable, opening a pathway toward engineered hybrid spin-exciton platforms for microwave-to-optical quantum transduction.\n\n", "2511.20165": "2025-11-25, **Gravitational potential drives the concentration dependence of the stellar mass-halo mass relation**, Kai Wang et.al., [2511.20165v1](http://arxiv.org/abs/2511.20165v1)\n\n We investigate the origin of the scatter in the stellar mass-halo mass (SMHM) relation using the \\colibre cosmological hydrodynamical simulations. At fixed halo mass, we find a clear positive correlation between stellar mass and halo concentration, particularly in low-mass haloes between $10^{11}$ and $10^{12}\\,\\rm M\\_\\odot$, where all halo properties are computed from the corresponding dark-matter-only simulation. Two scenarios have been proposed to explain this trend: the earlier formation of higher-concentration haloes allows more time for star formation, or the deeper gravitational potential wells of higher-concentration haloes enhance baryon retention. To distinguish between them, we examine correlations between halo concentration, stellar mass, stellar age, and stellar metallicity. While, at fixed halo mass, halo concentration correlates with stellar age, stellar age itself shows only a weak correlation with stellar mass, indicating that early formation alone cannot account for the concentration-dependence in the scatter of the SMHM relation. In contrast, both stellar metallicity and halo concentration exhibit correlations with stellar mass. The connection between halo concentration and stellar metallicity persists even when simultaneously controlling for both halo mass and stellar mass. These results support the scenario in which the deeper gravitational potentials in higher-concentration haloes suppress feedback-driven outflows, thereby enhancing both baryon and metal retention.\n\n", "2511.19994": "2025-11-25, **A Focused Review of Quintom Cosmology: From Quintom Dark Energy to Quintom Bounce**, Tao-tao Qiu et.al., [2511.19994v1](http://arxiv.org/abs/2511.19994v1)\n\n The recently released data of DESI DR2 favors a dynamical dark energy theory, with the equation of state crossing the cosmological constant boundary $w=-1$. In this paper, we briefly review quintom cosmology, especially the quintom bounce. We will give three examples of a quintom bounce and one example of a cyclic universe with quintom matter.\n\n", "2511.19911": "2025-11-25, **Search for planetary-mass ultra-compact binaries using data from the first part of the LIGO--Virgo--KAGRA fourth observing run**, The LIGO Scientific Collaboration et.al., [2511.19911v1](http://arxiv.org/abs/2511.19911v1)\n\n We present a search for gravitational waves from inspiraling, planetary-mass ultra-compact binaries using data from the first part of the fourth observing run of LIGO, Virgo and KAGRA. Finding no evidence of such systems, we determine the maximum distance reach for such objects and their merger rate densities, independently of how they could have formed. Then, we identify classes of primordial black-hole mass distributions for which these rate limits can be translated into relevant constraints on the mass distribution of primordial black holes, assuming that they compose all of dark matter, in the mass range $[10^{-6},10^{-3}]M\\_\\odot$. Our constraints are consistent with existing microlensing results in the planetary-mass range, and provide a complementary probe to sub-solar mass objects.\n\n", "2511.19802": "2025-11-25, **Cold Dark Matter and Dark Energy Based on an Analogy with Superconductivity**, Guanming Liang et.al., [2511.19802v1](http://arxiv.org/abs/2511.19802v1)\n\n We present a novel candidate for cold dark matter consisting of condensed Cooper pairs in a theory of interacting fermions with broken chiral symmetry. Establishing the thermal history from the early radiation era to the present, the fermions are shown to behave like standard radiation at high temperatures, but then experience a critical era decaying faster than radiation, akin to freeze-out that sets the relic abundance. Through a second-order phase transition, fermion - antifermion pairs condense and the system asymptotes towards zero temperature and pressure. By the present era, the non-relativistic, massive condensate decays slightly faster than in the standard scenario -- a unique prediction that may be tested by combined measurements of the cosmic microwave background and large scale structure. We also show that in the case of massive fermions, the phase transition is frustrated, and freeze-out instead leaves a residual, long-lived\n\n"}, "supernova": {"2511.21567": "2025-11-26, **Enhanced antineutrino emission from $β$ decay in core-collapse supernovae with self-consistent weak decay rates**, T. Dasher et.al., [2511.21567v1](http://arxiv.org/abs/2511.21567v1)\n\n Nuclear weak-interaction rates are known to exert a prominent effect in the late-stages of stellar collapse. Despite their importance, most studies to date on core-collapse supernovae (CCSNe) have focused primarily on the effects of electron captures, generally neglecting $β$ decay contributions. In this Letter, we present the first CCSNe simulation incorporating global $β$ decay rates from a microscopic theory. These are enabled by a large-scale evaluation of both electron capture and $β$ decay rates, obtained self-consistently utilizing the relativistic energy density functional theory and finite-temperature quasiparticle random-phase approximation. We find a significant enhancement of antineutrino emissivity by more than 4 orders of magnitude due to the inclusion of $β$ decay rates, as well as 3 orders of magnitude for antineutrino luminosity. It is expected that these new rates could help us constrain the model uncertainties related to weak-interaction processes, improving the prediction of antineutrino signal during the final stages of stellar death and potentially influencing the late-stage evolution of massive stars.\n\n", "2511.20850": "2025-11-25, **Constraining the Synthesis of the Lightest p Nucleus 74Se**, A. Tsantiri et.al., [2511.20850v1](http://arxiv.org/abs/2511.20850v1)\n\n We provide the first experimental cross section of the $^{73}\\text{As}(p,γ)^{74}\\text{Se}$ reaction to constrain one of the main destruction mechanisms of the p nucleus $^{74}\\text{Se}$ in explosive stellar environments. The measurement was done using a radioactive $^{73}\\text{As}$ beam at effective center-of-mass energies of 2.9 and 2.3 MeV/nucleon. Along with the total cross-section measurement, statistical properties of the $^{74}\\text{Se}$ compound nucleus were extracted, constraining the reaction cross section in the upper Gamow window of the $γ$ process. The impact of the experimentally constrained reaction rate on $^{74}\\text{Se}$ production in Type II supernovae was investigated through Monte Carlo one-zone network simulations. The results indicate that the overproduction of $^{74}$Se by Type II supernova models cannot be resolved by nuclear physics alone and point toward the need for a more detailed understanding of the astrophysical conditions of relevance for the $γ$ process.\n\n", "2511.20775": "2025-11-25, **Ashes of Creation: JWST Uncovers Silicate Dust in Massive Star Clusters**, Daniel Maschmann et.al., [2511.20775v1](http://arxiv.org/abs/2511.20775v1)\n\n Dust production is a fundamental aspect of the baryonic cycle of star formation. It is known that dust is injected into the interstellar medium during early star formation by supernovae and later on by evolved stars. From individual objects, these mechanisms are well understood, but the overall dust production in star clusters at different evolutionary stages is still challenging to quantify. We present 22 massive (> 105M$\\_{\\odot}$) extra galactic star clusters with ages between 3 and 100 Myr exhibiting a compact dust morphology seen with JWST-MIRI. We only find PAH features associated with one star cluster and nineteen have already cleared themselves from their natal dust. Their main characteristic is a significant enhancement at 10$μ$m, which is likely due to silicate emission and cannot be explained by ionized gas. We discuss several possible explanations including dust production from evolved stars such as red super giants, more exotic star types like yellow hypergiants and luminous blue variable stars. Stochastic dust injection from supernovae or a single supernova in dense gas can also create significant silicate emission. However, for this scenario secondary tracers such as a X-ray signal are expected which we only observe in three star clusters. We find the most luminous 10$μ$m emitter to be the three most massive star clusters (> 106M$\\_{\\odot}$) which is at least a magnitude stronger than any known stellar sources indicating a rare mechanism that only appears at extreme masses and a short lifetime.\n\n", "2511.20752": "2025-11-25, **The galactic chemical evolution of carbon: Implications for stellar nucleosynthesis**, Daniel A. Boyea et.al., [2511.20752v1](http://arxiv.org/abs/2511.20752v1)\n\n Carbon (C) is thought to be produced by both core collapse supernovae (CCSN) and asymptotic giant branch (AGB) stars, but the relative contributions of these two sources are uncertain. We investigate the astrophysical origin of C using models of Galactic chemical evolution (GCE) appropriate for the Milky Way disk. We benchmark our results against APOGEE subgiant abundances. The trend between [C/Mg] and [Mg/H] is set by the total C yield as a function of metallicity. Observations indicate a gently rising [C/Mg] with [Mg/H], but AGB C production is predicted to decline with metallicity. Our sample therefore favours a scenario in which CCSN yields rise with metallicity to offset declining AGB C yields and drive a subtle increase in [C/Mg] with [Mg/H]. This result is consistent with massive star nucleosynthesis models incorporating rotation. The [C/Mg]-[Mg/Fe] trend is sensitive to delayed enrichment and therefore constrains the amount of AGB C production. Given the slope of this relation, we find that AGB stars likely account for 10-40 per cent of C at solar metallicity. Artificially shifting the AGB C yields towards lower mass stars with longer lifetimes also improves agreement with the observed [C/Mg]-[Mg/Fe] trend, possibly indicating a discrepancy with stellar evolution predictions or our assumed Fe production rate.\n\n", "2511.20589": "2025-11-25, **Evidence of an Energetic Magnetar Powering 1LHAASO J0500$+$4454**, J. A. J. Alford et.al., [2511.20589v1](http://arxiv.org/abs/2511.20589v1)\n\n We investigate the origin of unidentified, extended TeV source 1LHAASO J0500$+$4454, considering three possible origins: cosmic rays interacting with a molecular cloud (MC), particles accelerated in a currently undetected supernova remnant (SNR), and an energetic outflow powered by a pulsar. Upper limits on the CO and X-ray emission from the $γ$-ray emitting region disfavor the MC and SNR scenarios, respectively. If a nebula of inverse Compton scattering $e^{\\pm}$ powers 1LHAASO J0500$+$4454, then SED modeling indicates that the current particle energy in the nebula is $\\sim 4 \\times 10^{48}$ erg. If the coincident magnetar SGR 0501$+$4516's rotational energy powered 1LHAASO J0500$+$4454, then a conservative energy budget calculation requires an initial magnetar spin period $P\\_{0} \\lesssim 5$ ms and a spin-down timescale $τ\\_{\\rm sd} \\lesssim 30$ yr, which has implications for the origins of magnetars.\n\n", "2511.20566": "2025-11-25, **The origin of B-type runaway stars based on kinematics**, Yanjun Guo et.al., [2511.20566v1](http://arxiv.org/abs/2511.20566v1)\n\n Runaway stars depart their birthplaces with high peculiar velocities. Two mechanisms are commonly invoked to explain their origin, the binary supernova scenario (BSS) and the dynamical ejection scenario (DES). Investigating the kinematic properties of runaway stars is key to understanding their origins.We intend to investigate the origins of 39 B-type runaway stars from LAMOST using orbital traceback analysis. From the catalog of LAMOST, we selected 39 B-type runaway stars and determined their spectral subtypes from key absorption lines. We then derived atmospheric parameters for each star using the Stellar Label Machine (SLAM), which is trained on TLUSTY synthetic spectra computed under the non-local thermodynamic equilibrium (NLTE) assumption. Using the derived atmospheric parameters as input, we estimated stellar masses and ages with a machine learning model trained on PARSEC evolutionary tracks. We finally performed orbital traceback with GALPY to analyze their origins. Through orbital traceback, we find that 29 stars have trajectories entirely within the Galactic disk, whereas 10 are disk-passing yet still trace back to the disk. Two stars have trajectories that intersect those of known clusters. Their orbits show similar morphologies in both the $X-Y$ and $R-Z$ planes, and their [M/H] values are comparable, suggesting possible cluster origins. However, definitive confirmation will require additional evidence. In addition, the $V\\_{\\rm Sp} - v\\sin{i}$ plane shows that runaway stars with low peculiar space velocities but high $v\\sin{i}$ remain on the Galactic disk, whereas those with high peculiar space velocities but low $v\\sin{i}$ pass through the disk, possibly reflecting two distinct origins.\n\n", "2511.20542": "2025-11-25, **H II regions and supernova remnants associated with molecular clouds: A pilot study with the SARAO MeerKAT Galactic Plane Survey**, Moses O. Langa et.al., [2511.20542v1](http://arxiv.org/abs/2511.20542v1)\n\n Massive stars (mass beyond 8 solMass) release vast amounts of energy into the interstellar medium through their stellar winds, photoionising radiation and supernova explosions. These processes may compress nearby regions, triggering further star formation, but the significance of triggered star formation across the Galactic disc is not well understood. This pilot study combines 1.3 GHz continuum data from the South African Radio Astronomy Observatory (SARAO) MeerKAT Galactic Plane Survey (SMGPS) with 13CO (2-1) data from the Structure, Excitation, and Dynamics of the Inner Galactic Interstellar Medium (SEDIGISM) survey to identify and examine molecular clouds associated with H II regions and supernovae remnants (SNRs). We focus on their physical properties and massive star formation potential. We identify 268 molecular clouds from the SEDIGISM tile covering the Galactic plane region between 341 and 343 longitude deg and latitude deg equal to or less 0.5, of which 90 clouds (34 per cent) are associated with SMGPS extended sources. Compared to unassociated clouds, we find that associated clouds exhibit significantly higher mean mass (9600 solMass vs. 2500 solMass ) and average gas surface density (104 solMass / pc^2 vs. 67 solMass / pc^2 ), and slightly elevated but comparable virial parameters. We also find that the size-linewidth scaling relation is steeper for associated clouds compared to unassociated clouds. In addition, radio luminosity shows a positive correlation with total complex mass, and the ratio L\\_radio/L\\_complex increases with source size, consistent with an evolutionary sequence where expanding H II regions progressively disrupt their natal molecular environment. These findings suggest an enhanced dynamical activity for the associated clouds and support the hypothesis that feedback from massive stars influences molecular cloud properties and may trigger star formation.\n\n", "2511.20267": "2025-11-25, **Projection Effects in Barred Galaxies Causing Wrong Interpretation of Radial Flows**, E. Salibur et.al., [2511.20267v1](http://arxiv.org/abs/2511.20267v1)\n\n Galaxy disks in rotation are sometimes the site of radial flows, especially in their gas component. It is important to estimate the outflows, due to AGN or supernovae feedback, or inflows due to bar gravity torques. However, these radial flows may be confused with non-circular motions, which are quite frequent in the center of galaxy disks. We use a simulated giant, barred spiral galaxy from the GalMer database to study the non-circular motions induced by the bar. Our goal is to identify the spurious radial flows that kinematics modeling algorithms can detect, assuming circular orbits for the gas. Using mock data of a strongly barred galaxy, we quantify the radial velocities computed by the 3D-Barolo algorithm for different disk inclinations and several bar orientations in the plane of the sky: along the major and minor kinematic axes and at 45° from them. Our results show that projection effects cause kinematics modeling algorithms to confuse the radial component of velocity due to elliptical orbits with significant radial flows with mean values up to 84 km.s$^{-1}$, within the bar region. The computed rotation curve is also wrongly estimated inside the bar region, by as much as 150 km.s$^{-1}$ for the highest inclination.\n\n", "2511.20112": "2025-11-25, **Spatially Resolved Plasma Diagnostics of the Supernova Remnant DEM L71 using the Reflection Grating Spectrometer**, Yuki Amano et.al., [2511.20112v1](http://arxiv.org/abs/2511.20112v1)\n\n We present a spatially resolved high-resolution X-ray spectroscopy of the supernova remnant DEM L71 using the Reflection Grating Spectrometer (RGS) aboard XMM-Newton. Because of the large dispersion angle of the RGS, we are able to resolve individual emission lines and examine their spatial distributions within this moderately extended remnant. We derive line fluxes across different regions of DEM L71 and perform quantitative plasma diagnostics. Our analysis reveals that some regions have high forbidden-to-resonance ratios of O\\emissiontype{VII} He$α$ lines, suggesting a non-negligible contribution from additional physical processes, such as charge exchange and/or resonance scattering. Our results demonstrate that the RGS has potential to serve as an outstanding X-ray imaging spectrometer for moderately diffuse objects.\n\n", "2511.19948": "2025-11-25, **Symbiotic Stars (Including T Corona Borealis) Are Not Immediate Progenitors of Normal Type Ia Supernovae**, Bradley E. Schaefer et.al., [2511.19948v1](http://arxiv.org/abs/2511.19948v1)\n\n A popular solution to the Type Ia supernova (SNIa) progenitor problem is that the immediate progenitors are symbiotic star systems. This solution requires that the companion star of the exploding white dwarf must be a red giant star with a heavy stellar wind. This has been tested for 189 normal SNIa, with all tested systems being proven to not have the required red giant: (A) Zero-out-of-9 normal type Ia supernova remnants have any red giant ex-companion star near the center with limits of $M\\_V$$>$0.0. (B) Zero-out-of-2 normal SNIa in nearby galaxies have any red giant at the position as seen in archival pre-eruption images by HST to limits of $M\\_V$$>$0.0. (C and D) Zero-out-of-111 normal SNIa have any detected hydrogen or helium emission lines in their eruption spectra, with limits on entrained gas of $M\\_{\\rm H}$$<$0.22 and $M\\_{\\rm He}$$<$0.07 M$\\_{\\odot}$, which is the minimum mass lost by a red giant in a nearby blastwave. (E and F) Zero-out-of-9 nearby normal SNIa were detected in the radio or X-rays, as required from the ejecta/wind impact, to limits of $\\dot{M}\\_{\\rm wind}$$<$3$\\times$$10^{-9}$ M$\\_{\\odot}$ yr$^{-1}$. (G) Zero-out-of-$\\sim$69 normal SNIa display any brightening in the first few days to limits of $M\\_V$$>$$-$18, as required for a red giant companion when we are looking down its shadowcone. With zero-out-of-189 normal SNIa having any possibility of having a red giant companion, the fraction of SNIa with symbiotic progenitors is $<$0.53%. The overwhelming conclusion is that normal SNIa are not from symbiotic-progenitors in any measurable fraction.\n\n"}}