{"neutrino": {"2508.21034": "2025-08-28, **Dark Matter-Enhanced Probe of Relic Neutrino Clustering**, Writasree Maitra et.al., [2508.21034v1](http://arxiv.org/abs/2508.21034v1)\n\n We propose heavy decaying dark matter (DM) as a new probe of the cosmic neutrino background (C$\\nu$B). Heavy DM, with mass $\\gtrsim 10^9$ GeV, decaying into neutrinos can be a new source of ultra-high-energy (UHE) neutrinos. Including this contribution along with the measured astrophysical and predicted cosmogenic neutrino fluxes, we study the scattering of UHE neutrinos with the C$\\nu$B via standard weak interactions mediated by the $Z$-boson. We solve the complete neutrino transport equation, taking into account both absorption and reinjection effects, to calculate the expected spectrum of UHE neutrino flux at future neutrino telescopes, such as IceCube-Gen2 Radio. We argue that such observations can be used to probe the C$\\nu$B properties, and in particular, local C$\\nu$B clustering. We find that, depending on the absolute neutrino mass and the DM mass and lifetime, a local C$\\nu$B overdensity $\\gtrsim 10^6$ can be probed at IceCube-Gen2 Radio within 10 years of data taking.\n\n", "2508.20999": "2025-08-28, **Dark Forces Gathering**, Peter W. Graham et.al., [2508.20999v1](http://arxiv.org/abs/2508.20999v1)\n\n Recent observations of the cosmic microwave background (CMB) and baryon acoustic oscillations (BAO) show some tension with a $\\Lambda$CDM cosmology. For one, the cosmological parameters determined by the CMB are at odds with the expansion history determined by latest BAO measurements. In addition, the combined data has placed uncomfortably strong constraints on neutrino mass. Both effects can be interpreted as negative neutrino mass, one describing the change to the expansion history and the other one describing enhanced lensing. In this paper, we show the current tensions can be solved with a single change either to the lensing of the CMB or the expansion of the universe. We show additional lensing could arise from a variety of models with new light fields. However, these models rarely give the same signal in temperature and polarization, giving a concrete test of the scenario. Alternatively, dark sector models can explain the changes to the expansion by changing the evolution of the matter density. These models introduce new forces, giving rise to long range signals in the three-point statistics of galaxies. We discuss a range of other examples which all illustrate the pattern that additional signals should appear if these tensions are explained by beyond the Standard Model physics.\n\n", "2508.20988": "2025-08-28, **Chemical and Kinetic Equilibrium in Cosmology: Facts and Myths**, Stefano Profumo et.al., [2508.20988v1](http://arxiv.org/abs/2508.20988v1)\n\n We clarify that chemical and kinetic equilibration in the early Universe are distinct: neither implies the other, and the ordering of their decouplings need not be universal. We illustrate this with Standard-Model neutrino decoupling, strong-washout leptogenesis, dark-matter scenarios where kinetic decoupling precedes chemical freeze-out (resonant/forbidden, conversion/coannihilation, coscattering), and dark sectors at with temperatures distinct from the visible-sector temperature, with semi-annihilation or 3 $\\to$ 2 cannibal dynamics. The moral of the story is simple: Chemical equilibrium governs numbers, kinetic equilibrium governs shapes. In an expanding Universe the operators that control them rarely fade at the same time, and when they do not, the order of decoupling is model dependent. Turning to phase-space evolution whenever momentum selectivity matters is the surest way to obtain robust cosmological predictions.\n\n", "2508.20984": "2025-08-28, **Cosmic-ray boosted inelastic dark matter from neutrino-emitting active galactic nuclei**, R. Andrew Gustafson et.al., [2508.20984v1](http://arxiv.org/abs/2508.20984v1)\n\n Cosmic rays may scatter off dark matter particles in active galactic nuclei, where both the densities of cosmic rays and dark matter are expected to be very large. These scatterings could yield a flux of boosted dark matter particles directly detectable on Earth, which enhances the sensitivity of dark matter direct detection and neutrino experiments to light and inelastic dark matter models. Here we calculate the cosmic-ray boosted dark matter flux from the neutrino-emitting active galactic nuclei, NGC 1068 and TXS 0506+056, by considering realistic cosmic-ray distributions, deep inelastic scatterings, and mass splittings in the dark sector. From this we derive novel bounds from these sources on light and/or inelastic dark matter models with Super-K and XENONnT. We find that cosmic-ray boosted dark matter from neutrino-emitting active galactic nuclei can test regions of parameter space favored to reproduce the observed relic abundance of dark matter in the Universe, and that are otherwise experimentally inaccessible.\n\n", "2508.20952": "2025-08-28, **Very high-energy gamma-ray and neutrino emission from hadronic interaction in compact binary millisecond pulsars**, Vittoria Vecchiotti et.al., [2508.20952v1](http://arxiv.org/abs/2508.20952v1)\n\n Blackwidow and redback systems are millisecond pulsars in compact orbits with ultra-light and low-mass companions, respectively, collectively known as ``spider pulsars\". In such systems, an intrabinary shock can form between the pulsar and the companion winds, serving as a site for particle acceleration and associated non-thermal emission. Assuming that protons can be extracted from the neutron star surface and accelerated at the intrabinary shock and/or within the pulsar wind, we model the very high-energy gamma-ray and neutrino emissions ($0.1-10^3$~TeV) produced through interactions with the companion wind and the companion star. We first calculate the high-energy emissions using an optimistic combination of parameters to maximize the gamma-ray and neutrino fluxes. We find that, for energetic spider pulsars with a spin-down power $\\gtrsim 10^{35}\\rm erg\\, s^{-1}$ and a magnetic field of $\\sim 10^{3}\\, \\rm G$ in the companion region, the gamma-ray emission could be detectable as point sources by CTA and LHAASO, while the neutrino emission could be detectable by the future TRIDENT detector. Finally, we build a synthetic population of these systems, compute the cumulative neutrino flux expected from spider pulsars, and compare it with the Galactic neutrino diffuse emission measured by IceCube. We find that, under realistic assumptions on the fraction of the spin-down power converted into protons, the contribution of spiders to the diffuse Galactic neutrino flux is negligible.\n\n", "2508.20929": "2025-08-28, **Search for heavy neutral leptons in decays of W bosons produced in 13 TeV pp collisions using prompt signatures in the ATLAS detector**, ATLAS Collaboration et.al., [2508.20929v1](http://arxiv.org/abs/2508.20929v1)\n\n The existence of right-handed neutrinos with Majorana masses below the electroweak scale could help address the origins of neutrino masses, the matter-antimatter asymmetry, and dark matter. In this paper, leptonic decays of W bosons from 140 fb$^{-1}$ of 13 TeV proton-proton collisions at the LHC, reconstructed in the ATLAS experiment, are used to search for heavy neutral leptons produced through their mixing with muon or electron neutrinos in a scenario with lepton number violation. The search is conducted using prompt leptonic decay signatures. The considered final states require two same-charge leptons or three leptons, while vetoing three-lepton same-flavour topologies. No significant excess over the expected Standard Model backgrounds is found, leading to constraints on the heavy neutral lepton's mixing with muon and electron neutrinos for heavy-neutral-lepton masses. The analysis excludes $\\|U\\_{e}\\|^2$ values above $8\\times 10^{-5}$ and $\\|U\\_{\\mu}\\|^2$ values above $5.0 \\times 10^{-5}$ in the full mass range of 8-65 GeV. The strongest constraints are placed on heavy-neutral-lepton masses in the range 15--30 GeV of $\\|U\\_{e}\\|^2 < 1.1 \\times 10^{-5}$ and $\\|U\\_{\\mu}\\|^2 < 5 \\times 10^{-6}$.\n\n", "2508.20904": "2025-08-28, **Clustering of DESI galaxies split by thermal Sunyaev-Zeldovich effect**, M. Rashkovetskyi et.al., [2508.20904v1](http://arxiv.org/abs/2508.20904v1)\n\n The thermal Sunyaev-Zeldovich (tSZ) effect is associated with galaxy clusters - extremely large and dense structures tracing the dark matter with a higher bias than isolated galaxies. We propose to use the tSZ data to separate galaxies from redshift surveys into distinct subpopulations corresponding to different densities and biases independently of the redshift survey systematics. Leveraging the information from different environments, as in density-split and density-marked clustering, is known to tighten the constraints on cosmological parameters, like $\\Omega\\_m$, $\\sigma\\_8$ and neutrino mass. We use data from the Dark Energy Spectroscopic Instrument (DESI) and the Atacama Cosmology Telescope (ACT) in their region of overlap to demonstrate informative tSZ splitting of Luminous Red Galaxies (LRGs). We discover a significant increase in the large-scale clustering of DESI LRGs corresponding to detections starting from 1-2 sigma in the ACT DR6 + Planck tSZ Compton-$y$ map, below the cluster candidate threshold (4 sigma). We also find that such galaxies have higher line-of-sight coordinate (and velocity) dispersions and a higher number of close neighbors than both the full sample and near-zero tSZ regions. We produce simple simulations of tSZ maps that are intrinsically consistent with galaxy catalogs and do not include systematic effects, and find a similar pattern of large-scale clustering enhancement with tSZ effect significance. Moreover, we observe that this relative bias pattern remains largely unchanged with variations in the galaxy-halo connection model in our simulations. This is promising for future cosmological inference from tSZ-split clustering with semi-analytical models. Thus, we demonstrate that valuable cosmological information is present in the lower signal-to-noise regions of the thermal Sunyaev-Zeldovich map, extending far beyond the individual cluster candidates.\n\n", "2508.20844": "2025-08-28, **First Observation of Solar Neutrino Interactions on $^{13}$C**, SNO+ Collaboration et.al., [2508.20844v1](http://arxiv.org/abs/2508.20844v1)\n\n The SNO+ Collaboration reports the first evidence of $^{8}\\text{B}$ solar neutrinos interacting on $^{13}\\text{C}$ nuclei. The charged current interaction proceeds through $^{13}\\text{C} + \\nu\\_e \\rightarrow {}^{13}\\text{N} + e^-$ which is followed, with a 10 minute half-life, by ${}^{13}\\text{N} \\rightarrow {}^{13}\\text{C} + e^+ +\\nu\\_e .$ The detection strategy is based on the delayed coincidence between the electron and the positron. Evidence for the charged current signal is presented with a significance of 4.2$\\sigma$. Using the natural abundance of $^{13}\\text{C}$ present in the scintillator, 5.7 tonnes of $^{13}\\text{C}$ over 231 days of data were used in this analysis. The 5.6$^{+3.0}\\_{-2.3}$ detected events in the data set are consistent with the expectation of 4.7$^{+0.6}\\_{-1.3}$ events. This result is the second real-time measurement of CC interactions of $^{8}\\text{B}$ neutrinos with nuclei and constitutes the lowest energy observation of neutrino interactions on $^{13}\\text{C}$ generally. This enables the first direct measurement of the CC $\\nu\\_e$ reaction to the ground state of ${}^{13}\\text{N}$, yielding an average cross section of $(16.1 ^{+8.5}\\_{-6.7} (\\text{stat.}) ^{+1.6}\\_{-2.7} (\\text{syst.}) )\\times 10^{-43}$ cm$^{2}$ over the relevant $^{8}\\text{B}$ solar neutrino energies.\n\n", "2508.20726": "2025-08-28, **On the Transients Handler for the Cherenkov Telescope Array Observatory**, Tiffany Collins et.al., [2508.20726v1](http://arxiv.org/abs/2508.20726v1)\n\n The Cherenkov Telescope Array Observatory (CTAO) is a next-generation gamma-ray observatory in both the Southern (Paranal, Chile) and Northern Hemisphere (La Palma, Spain) and will consist of up to 100 imaging atmospheric Cherenkov telescopes. With sensitivity far exceeding current facilities, CTAO will provide detailed measurements of gamma rays from GeV up to a few 100s of TeV. CTAO has a nominal field of view of 10{\\deg} and will rely on external alerts from observatories such as IceCube (neutrinos), Fermi-LAT (GeV gamma rays), LIGO (gravitational waves (GWs)) or the upcoming Vera C. Rubin Observatory (optical) to trigger observations of targets of opportunity (ToOs). The Transients Handler (TH) is a subsystem of the Array Control and Data Acquisition that will provide the means of handling alerts and schedule follow-up observations. The TH is responsible for (i) filtering of thousands of internal and external alerts per night, (ii) processing of alerts according to the corresponding observation proposal to determine the optimal observation schedule with minimum interruptions to observations and (iii) broadcasting of events detected by CTAO to external facilities. In this work, we will discuss the architecture of the Transients Handler, its latest improvements and future updates\n\n", "2508.20520": "2025-08-28, **Toward 48 dB Spin Squeezing and 96 dB Signal Magnification for Cosmic Relic Searches with Nuclear Spins**, Marios Galanis et.al., [2508.20520v1](http://arxiv.org/abs/2508.20520v1)\n\n We recently showed that macroscopic nuclear spin ensembles prepared in coherent spin states can dramatically enhance the interaction rates of weakly interacting cosmic relics-such as dark matter and the cosmic neutrino background-through collective quantum effects analogous to Dicke superradiance, where the de-excitation and excitation rates scale as the square of the number of spins, $N^2$. We thus coined these processes superradiant interactions. In this paper, we propose a protocol to realize this enhancement and boost the discovery potential for such relics. We show how concepts from quantum optics can be adapted to nuclear spins coupled to superconducting circuits, enabling high-sensitivity systems. The spins are first initialized into a coherent spin state via a $\\pi/2$ Rabi pulse from the ground state. When the circuit is sufficiently detuned from resonance, the spin-circuit interaction implements a squeezing Hamiltonian. Because squeezing must outpace spin relaxation and dephasing, the protocol favors macroscopic ensembles and high-quality superconducting circuits. During this squeezing phase, the standard quantum variance is reduced by up to 4.8 orders of magnitude-equivalent to 48 dB of squeezing-for circuits with quality factors $Q \\sim 10^8$-$10^9$. The signal imprinted on the spins during the squeezing protocol can be magnified by further utilizing the squeezing interactions, easing the requirement for shot-noise-limited readout. This protocol has the potential to significantly accelerate axion and dark photon dark matter searches and extend the reach of existing axion experiments to probe QCD axion-nuclear spin couplings. More broadly, it paves the way for detecting coherent inelastic interactions from other cosmic relics-most notably the cosmic neutrino background-and establishes nuclear-spin-based systems as a new class of quantum, ultra-low-threshold detectors.\n\n", "2508.20482": "2025-08-28, **Mineral Detection of Neutrinos and Dark Matter 2025 Proceedings**, Shigenobu Hirose et.al., [2508.20482v1](http://arxiv.org/abs/2508.20482v1)\n\n The third ``Mineral Detection of Neutrinos and Dark Matter'' (MD$\\nu$DM'25) meeting was held May 20-23, 2025 in Yokohama, Japan, hosted by the Yokohama Institute for Earth Sciences, Japan Agency for Marine-Earth Science and Technology (JAMSTEC). These proceedings compile contributions from the workshop and update the progress of mineral detector research. MD$\\nu$DM'25 was the third such meeting, following the first in October of 2022 held at the IFPU in Trieste, Italy and the second in January of 2024 hosted by the Center for Neutrino Physics at Virginia Tech in Arlington, USA. Mineral detectors record and retain damage induced by nuclear recoils in synthetic or natural mineral samples. The damage features can then be read out by a variety of nano- and micro-scale imaging techniques. Applications of mineral detectors on timescales relevant for laboratory experiments include reactor neutrino monitoring and dark matter detection, with the potential to measure the directions as well as the energies of the induced nuclear recoils. For natural mineral detectors which record nuclear recoils over geological timescales, reading out even small mineral samples could be sensitive to rare interactions induced by astrophysical neutrinos, cosmic rays, dark matter and heavy exotic particles. A series of mineral detectors of different ages could measure the time evolution of these fluxes, offering a unique window into the history of our solar system and the Milky Way. Mineral detector research is highly multidisciplinary, incorporating aspects of high energy physics, condensed matter physics, materials science, geoscience, and AI/ML for data analysis. Although realizing the scientific potential of mineral detectors poses many challenges, the MD$\\nu$DM community looks forward to the continued development of mineral detector experiments and the possible discoveries that mineral detectors could reveal.\n\n", "2508.20389": "2025-08-28, **Unitarity test of lepton mixing via energy dependence of neutrino oscillation**, Ryuichiro Kitano et.al., [2508.20389v1](http://arxiv.org/abs/2508.20389v1)\n\n We study the method to test the unitarity of the lepton mixing matrix by using only the long baseline neutrino oscillation experiments, such as the combination of the T2HK experiment and the one with the $\\nu\\_e$ beam from a future neutrino factory at J-PARC. Without a specific parametrization, one can directly extract the elements of the lepton mixing matrix by observing the energy dependence of the oscillation probabilities. A non-trivial test of the unitarity under the three-generation assumption can thus be made possible by examining the orthogonality in a similar manner to the unitarity triangle in the quark sector. As the first trial, we perform the analysis based on the simplified situation where the matter effects in the neutrino oscillation can be neglected. Under this simplified analysis, we demonstrate the observation of the unitarity violation in the $3\\times3$ part of the lepton mixing matrix for a parameter set in the four-generation model. The statistically most significant measurement can be provided by the energy dependences of the combination of the CP conjugate modes, $\\nu\\_\\mu \\to \\nu\\_e$ and $\\bar \\nu\\_\\mu \\to \\bar \\nu\\_e$, at T2HK and, independently, by the T conjugate modes, $\\nu\\_\\mu \\to \\nu\\_e$ and $\\nu\\_e \\to \\nu\\_\\mu$, with the latter measured at the neutrino factory experiments.\n\n", "2508.20357": "2025-08-28, **Prospects for relic neutrino detection using nuclear spin experiments**, Yeray Garcia del Castillo et.al., [2508.20357v1](http://arxiv.org/abs/2508.20357v1)\n\n Direct detection of the cosmic neutrino background (C$\\nu$B) remains one of the most formidable experimental challenges in modern physics. In this work, we extend recent studies of C$\\nu$B-induced coherent transitions in polarised nuclear spin ensembles. Adopting an open quantum system framework, we model coherent neutrino effects in large spin ensembles using a Lindblad master equation that also incorporates realistic experimental imperfections such as local dephasing and imperfect polarisation. We solve the Lindblad equation numerically by way of a fast and computationally inexpensive method that can be extended to an arbitrarily large number of spins. Using our numerical solutions, we forecast the sensitivities of future experiments such as CASPEr to the local C$\\nu$B overdensity parameter $\\delta\\_\\nu$. Our findings indicate that a CASPEr-like experiment, though primarily aimed at axion dark matter search, could also constrain the C$\\nu$B overdensity to $\\delta\\_\\nu \\sim 10^{9}-10^{11}$ in configurations achievable by currently planned experimental efforts, and down to $\\delta\\_\\nu \\sim 10^7$ in the most optimised scenario. While C$\\nu$B detection remains out of reach in the foreseeable future, our results highlight the potential of using quantum sensing to probe fundamental physics.\n\n"}, "dark matter": {"2508.20994": "2025-08-28, **GW emission and relativistic dynamical friction in intermediate mass ratio inspirals**, P. Di Cintio et.al., [2508.20994v1](http://arxiv.org/abs/2508.20994v1)\n\n We present a set of preliminary simulations of intermediate mass ratio inspirals (IMRIs) inside dark matter (DM) spikes accounting for post-Newtonian corrections the interaction between the two black holes up to the order 2.5 in $c^2$, as well as relativistic corrections to the dynamical friction (DF) force exerted by the DM distribution. We find that, incorporating relativity reduces of a factor $1/2$ the inspiral time, for equivalent initial orbital parameters, with respect to the purely classical estimates. Vice versa, neglecting the DF of the spike systematically yields longer inspiral times.\n\n", "2508.20860": "2025-08-28, **Euclid preparation. LXXIV. Euclidised observations of Hubble Frontier Fields and CLASH galaxy clusters**, Euclid Collaboration et.al., [2508.20860v1](http://arxiv.org/abs/2508.20860v1)\n\n We present HST2EUCLID, a novel Python code to generate Euclid realistic mock images in the $H\\_{\\rm E}$, $J\\_{\\rm E}$, $Y\\_{\\rm E}$, and $I\\_{\\rm E}$ photometric bands based on panchromatic Hubble Space Telescope observations. The software was used to create a simulated database of Euclid images for the 27 galaxy clusters observed during the Cluster Lensing And Supernova survey with Hubble (CLASH) and the Hubble Frontier Fields (HFF) program. Since the mock images were generated from real observations, they incorporate, by construction, all the complexity of the observed galaxy clusters. The simulated Euclid data of the galaxy cluster MACS J0416.1$-$2403 were then used to explore the possibility of developing strong lensing models based on the Euclid data. In this context, complementary photometric or spectroscopic follow-up campaigns are required to measure the redshifts of multiple images and cluster member galaxies. By Euclidising six parallel blank fields obtained during the HFF program, we provide an estimate of the number of galaxies detectable in Euclid images per ${\\rm deg}^2$ per magnitude bin (number counts) and the distribution of the galaxy sizes. Finally, we present a preview of the Chandra Deep Field South that will be observed during the Euclid Deep Survey and two examples of galaxy-scale strong lensing systems residing in regions of the sky covered by the Euclid Wide Survey. The methodology developed in this work lends itself to several additional applications, as simulated Euclid fields based on HST (or JWST) imaging with extensive spectroscopic information can be used to validate the feasibility of legacy science cases or to train deep learning techniques in advance, thus preparing for a timely exploitation of the Euclid Survey data.\n\n", "2508.20711": "2025-08-28, **HSTPROMO Internal Proper Motion Kinematics of Dwarf Spheroidal Galaxies: II. Velocity Anisotropy and Dark Matter Cusp Slope of Sculptor**, Eduardo Vitral et.al., [2508.20711v1](http://arxiv.org/abs/2508.20711v1)\n\n We analyze three epochs of HST imaging over 20 years for the Sculptor dwarf spheroidal galaxy, measuring precise proper motions for 119 stars and combining them with 1760 existing line-of-sight velocities. This catalog yields the first radially-resolved 3D velocity dispersion profiles for Sculptor. We confirm mild oblate rotation, with major-axis velocities reaching $\\sim 2$ km s$^{-1}$ beyond 20.0 arcmin. Using a methodology similar to that in the first paper in this series, we solve the Jeans equations in oblate axisymmetric geometry to infer the galaxy's mass profile. Our modeling reveals a significant degeneracy due to the unknown galaxy inclination, which is overlooked under spherical symmetry assumptions. This degeneracy allows acceptable fits across a range of dark matter profiles, from cuspy to cored. While we do not directly constrain the inclination with our Jeans models, higher-order line-of-sight velocity moments provide useful additional constraints: comparisons with scalefree models from de Bruijne et al. (1996) favor highly flattened (more face-on) configurations. Adopting an inclination well consistent with these comparisons ($i = 57.1$ degrees), we find, alongside radial velocity anisotropy, a dark matter density slope of $\\Gamma\\_{\\rm dark} = 0.29^{+0.31}\\_{-0.41}$ within the radial extent of the 3D velocity data, ruling out a cusp with $\\Gamma\\_{\\rm dark} \\leq -1$ at 99.8% confidence. This confidence increases for lower inclinations and decreases drastically for nearly edge-on configurations. The results qualitatively agree with $\\Lambda$CDM, SIDM, and Fuzzy DM scenarios that predict core formation, while our specific measurements provide quantitative constraints on the prescriptions of feedback, cross sections, or particle masses required by these models, respectively.\n\n", "2508.20603": "2025-08-28, **High performance visualization for Astronomy and Cosmology: the VisIVO's pathway toward Exascale systems**, Eva Sciacca et.al., [2508.20603v1](http://arxiv.org/abs/2508.20603v1)\n\n Petabyte-scale data volumes are generated by observations and simulations in modern astronomy and astrophysics. Storage, access, and data analysis are significantly hampered by such data volumes and are leading to the development of a new generation of software tools. The Visualization Interface for the Virtual Observatory (VisIVO) has been designed, developed and maintained by INAF since 2005 to perform multi-dimensional data analysis and knowledge discovery in multivariate astrophysical datasets. Utilizing containerization and virtualization technologies, VisIVO has already been used to exploit distributed computing infrastructures including the European Open Science Cloud (EOSC).   We intend to adapt VisIVO solutions for high performance visualization of data generated on the (pre-)Exascale systems by HPC applications in Astrophysics and Cosmology (A\\&C), including GADGET (GAlaxies with Dark matter and Gas) and PLUTO simulations, thanks to the collaboration within the SPACE Center of Excellence, the H2020 EUPEX Project, and the ICSC National Research Centre. In this work, we outline the evolution's course as well as the execution strategies designed to achieve the following goals: enhance the portability of the VisIVO modular applications and their resource requirements; foster reproducibility and maintainability; take advantage of a more flexible resource exploitation over heterogeneous HPC facilities; and, finally, minimize data-movement overheads and improve I/O performances.\n\n", "2508.20507": "2025-08-28, **Forecasting 21-cm power spectrum sensitivity to dark Matter-baryon scattering**, Aryan Rahimieh et.al., [2508.20507v1](http://arxiv.org/abs/2508.20507v1)\n\n We explore the potential of upcoming 21-cm interferometric observations to probe interacting dark matter (IDM). We focus on scenarios where the dark matter-baryon scattering cross-section scales as $\\sigma(v) =\\sigma\\_{0} v^n$, with $\\sigma\\_{0}$ being the normalization constant, $v$ the relative velocity between dark matter and baryons, and $n$ characterizing the velocity dependence. Specifically, we emphasize two cases: Coulomb-like interaction ($n = -4$) and velocity-independent interaction ($n = 0$). Using detailed simulations of the 21-cm power spectrum and the Fisher matrix formalism, we forecast the sensitivity of the Hydrogen Epoch of Reionization Array (HERA), which targets the frequency range 50-225 MHz, to both IDM and astrophysical parameters. We marginalize over key astrophysical uncertainties, including star formation efficiency, ionizing photon escape fraction, and X-ray luminosity. Our results demonstrate that 21-cm power spectrum measurements can significantly improve sensitivity to IDM cross-section, with at least a factor of five improvement over global signal forecasts for the $n=0$ case, and more than an order of magnitude enhancement for the $n=-4$ scenario. These forecasts also significantly improve upon the existing bounds from cosmic microwave background and Milky Way satellite abundance observations. Our analysis also shows that the IDM cross-section exhibits no correlation with the parameters associated with star formation efficiency and ionizing photon escape fraction of Population-II stars. However, we find that the Coulomb-like cross-section is positively correlated with X-ray luminosity. Our results highlight the critical role of accounting for astrophysical uncertainties in obtaining robust inferences of dark matter-baryon interactions from future 21-cm power spectrum observations.\n\n", "2508.20494": "2025-08-28, **Galaxy Group Spin Alignment with Cosmic Filament in the TNG Simulation**, Wei Wang et.al., [2508.20494v1](http://arxiv.org/abs/2508.20494v1)\n\n We investigate the alignment between the spin vectors of galaxy groups and the axes of their nearest cosmic filaments using the TNG300-1 cosmological hydrodynamical simulation. By systematically analyzing a large sample of groups, we find a robust perpendicular alignment between group spin and filament orientation. Among all examined properties, only group mass and the distance to the nearest filament significantly affect the strength of this alignment: more massive groups and those closer to filaments exhibit a stronger perpendicular signal. In contrast, the alignment is largely insensitive to group richness, the stellar mass threshold used to select member galaxies, and redshift. We further quantify the bias introduced by using member galaxies as tracers of group spin, finding a typical misalignment angle of $\\sim38^\\circ$ between the spin measured from all dark matter particles and that inferred from member galaxies, independent of group richness or stellar mass cut. Our results provide a clear theoretical benchmark for interpreting observational measurements of spin-filament alignment and highlight the importance of considering group mass and environment. These findings help clarify the main factors influencing spin-filament alignment and provide useful context for future observational and theoretical studies of angular momentum in the cosmic web.\n\n", "2508.20402": "2025-08-28, **Post-Reheating Inflaton Production as a Probe of Reheating Dynamics**, Kunio Kaneta et.al., [2508.20402v1](http://arxiv.org/abs/2508.20402v1)\n\n Cosmological reheating bridges the inflationary epoch and the hot big bang phase, yet its underlying dynamics remain poorly understood. In this work, we investigate a minimal scenario in which the inflaton evolves under a simple power-law potential during reheating and interacts with other particles via renormalizable couplings. We show that inflaton quanta can be regenerated from the thermal bath even after the decay of the coherent inflaton field, unveiling a previously overlooked channel for inflaton particle production, which offers a novel window into probing reheating. Remarkably, this mechanism may also account for the observed dark matter abundance, providing a natural link between early Universe dynamics and present-day cosmological observations.\n\n"}, "supernova": {"2508.21069": "2025-08-28, **Rapid late-time reionization: constraints and cosmological implications**, Willem Elbers et.al., [2508.21069v1](http://arxiv.org/abs/2508.21069v1)\n\n We present constraints on the reionization optical depth, $\\tau$, obtained using several independent methods. First, we perform a non-parametric reconstruction of the reionization history, using Lyman-$\\alpha$ constraints on the evolution of the volume-averaged neutral hydrogen fraction, $x\\_\\mathrm{HI}(z)$, including recent results from the James Webb Space Telescope. When combined with baryon acoustic oscillation (BAO) measurements from DESI and Big Bang nucleosynthesis constraints, these data imply a rapid reionization history ($z\\_\\mathrm{mid}=7.00^{+0.12}\\_{-0.18}$ and $\\Delta z\\_{50}=1.12^{+0.12}\\_{-0.29}$) and a value of $\\tau=0.0492^{+0.0014}\\_{-0.0030}$, which is largely insensitive to the assumed cosmological model and independent of cosmic microwave background (CMB) data. The optical depth can also be measured from large-scale $(\\ell<30)$ CMB polarization data, yielding constraints that are similarly model-insensitive and consistent with the Ly$\\alpha$ bound. Third, $\\tau$ may be constrained from the attenuation of small-scale $(\\ell>30)$ CMB anisotropies, but the results are sensitive to the choice of cosmological model. Assuming $\\Lambda$CDM and combining small-scale CMB data with CMB lensing and type 1a supernovae (SNe) yields tight constraints that are compatible with the Ly$\\alpha$ bound. Adding galaxy clustering and lensing measurements brings the constraints further into agreement with the Ly$\\alpha$ bound. These independent results reinforce a consensus picture in which reionization is rapid and late. However, the combination of small-scale CMB, CMB lensing, and BAO data yields $\\tau=0.094\\pm0.011$, which is in $4\\sigma$ tension with our Ly$\\alpha$ bound. Non-standard reionization scenarios can reconcile some but not all constraints. Concordance is restored in alternative cosmological models, such as models with dynamical dark energy favoured by BAO, CMB, and SNe data.\n\n", "2508.21042": "2025-08-28, **The power of binaries on stripped-envelope supernovae across metallicity: uniform progenitor parameter space and persistently low ejecta masses, but subtype diversity**, D. Souropanis et.al., [2508.21042v1](http://arxiv.org/abs/2508.21042v1)\n\n Stripped-envelope supernovae (SESNe) originate from massive stars that lose their envelopes through binary interactions or stellar winds. The connection between SESN subtypes and their progenitors remains poorly understood, as does the influence of initial mass, binarity, explodability, and metallicity on their evolutionary pathways, relative rates, ejecta masses, and progenitor ages. Here, we investigate these properties across a wide metallicity range (0.01-2 $Z\\_{\\odot}$) using POSYDON, a state-of-the-art population synthesis code that incorporates detailed single- and binary-star model grids. We find that the common-envelope channel contributes less than 6% of SESNe, since unstable mass transfer is found less frequent than previously thought and rarely leads to CE survival when envelope binding energies are computed from detailed stellar models. The secondary channel accounts for less than 11%, while the vast majority of SESNe originate from primary stars in binaries undergoing stable mass-transfer episodes. These interactions maintain a largely metallicity-independent SESN parameter space, making the overall SESN rate almost insensitive to metallicity. In contrast, subtype fractions exhibit strong metallicity dependence, though their exact values remain affected by classification thresholds. The age distributions and therefore the progenitor masses of different SESN types also vary significantly with metallicity, revealing metallicity-dependent trends that can be tested observationally. Predicted SESN ejecta masses remain nearly constant across metallicity, in contrast to single-star models, and fall within observed ranges. Future transient surveys, combined with statistical environmental studies that constrain metallicity dependence, will provide decisive tests of these predictions and of the dominant role of binary interactions in shaping SESNe.\n\n", "2508.21027": "2025-08-28, **HST Deep Upper Limits Rule Out a Surviving Massive Binary Companion to the Type Ic Supernova 2012fh**, Benjamin F. Williams et.al., [2508.21027v1](http://arxiv.org/abs/2508.21027v1)\n\n Current explanations of the mass-loss mechanism for stripped-envelope supernovae remain divided between single and binary progenitor systems. Here we obtain deep ultraviolet (UV) imaging with the Hubble Space Telescope (HST) of the Type Ic SN 2012fh to search for the presence of a surviving companion star to the progenitor. We synthesize these observations with archival HST imaging, ground-based spectroscopy, and previous analyses from the literature to provide three independent constraints on the progenitor system. We fit the color-magnitude diagram of the surrounding population to constrain the most likely age of the system to be $<20$ Myr. Analysis of spectra of SN 2012fh provide an estimate of the He core mass of the progenitor star, $>5.6$ M$\\_{\\odot}$. We analyze deep HST images at the precise location after the SN faded to constrain the luminosity of any remaining main-sequence binary companion to be $\\log(L/L\\_{\\odot}) \\lesssim 3.35$. Combining observational constraints with current binary population synthesis models excludes the presence of a faint stellar companion to SN 2012fh at the $\\lesssim10\\%$ level. The progenitor was therefore either effectively isolated at the time of explosion or orbited by a black-hole companion. The latter scenario dominates if we only consider models that produce successful supernovae.\n\n", "2508.20971": "2025-08-28, **Cosmo-Learn: code for learning cosmology using different methods and mock data**, Reginald Christian Bernardo et.al., [2508.20971v1](http://arxiv.org/abs/2508.20971v1)\n\n We present cosmo\\_learn, an open-source python-based software package designed to simulate cosmological data and perform data-driven inference using a range of modern statistical and machine learning techniques. Motivated by the growing complexity of cosmological models and the emergence of observational tensions, cosmo\\_learn provides a standardized and flexible framework for benchmarking cosmological inference methods. The package supports realistic noise modeling for key observables in the late Universe, including cosmic chronometers, supernovae Ia, baryon acoustic oscillations, redshift space distortions, and gravitational wave bright sirens. We demonstrate the internal consistency of the simulated data with the input cosmology via residuals and parameter recovery using a fiducial $w$CDM model. Built-in learning and inference modules include traditional Markov Chain Monte Carlo, as well as more recent approaches such as genetic algorithms, Gaussian processes, Bayesian ridge regression, and artificial neural networks. These methods are implemented in a modular and extensible architecture designed to facilitate comparisons across inference strategies in a common pipeline. By providing a flexible and transparent simulation and learning environment, cosmo\\_learn supports both educational and research efforts at the intersection of cosmology, statistics, and machine learning.\n\n", "2508.20860": "2025-08-28, **Euclid preparation. LXXIV. Euclidised observations of Hubble Frontier Fields and CLASH galaxy clusters**, Euclid Collaboration et.al., [2508.20860v1](http://arxiv.org/abs/2508.20860v1)\n\n We present HST2EUCLID, a novel Python code to generate Euclid realistic mock images in the $H\\_{\\rm E}$, $J\\_{\\rm E}$, $Y\\_{\\rm E}$, and $I\\_{\\rm E}$ photometric bands based on panchromatic Hubble Space Telescope observations. The software was used to create a simulated database of Euclid images for the 27 galaxy clusters observed during the Cluster Lensing And Supernova survey with Hubble (CLASH) and the Hubble Frontier Fields (HFF) program. Since the mock images were generated from real observations, they incorporate, by construction, all the complexity of the observed galaxy clusters. The simulated Euclid data of the galaxy cluster MACS J0416.1$-$2403 were then used to explore the possibility of developing strong lensing models based on the Euclid data. In this context, complementary photometric or spectroscopic follow-up campaigns are required to measure the redshifts of multiple images and cluster member galaxies. By Euclidising six parallel blank fields obtained during the HFF program, we provide an estimate of the number of galaxies detectable in Euclid images per ${\\rm deg}^2$ per magnitude bin (number counts) and the distribution of the galaxy sizes. Finally, we present a preview of the Chandra Deep Field South that will be observed during the Euclid Deep Survey and two examples of galaxy-scale strong lensing systems residing in regions of the sky covered by the Euclid Wide Survey. The methodology developed in this work lends itself to several additional applications, as simulated Euclid fields based on HST (or JWST) imaging with extensive spectroscopic information can be used to validate the feasibility of legacy science cases or to train deep learning techniques in advance, thus preparing for a timely exploitation of the Euclid Survey data.\n\n", "2508.20787": "2025-08-28, **New gravitational-wave data support a bimodal black-hole mass distribution**, R. Willcox et.al., [2508.20787v1](http://arxiv.org/abs/2508.20787v1)\n\n Detailed stellar evolution and supernova models yield a bimodal black-hole mass distribution with a narrow peak around 10 solar masses from stars within a narrow range of progenitor properties and a second broader peak starting around 20 solar masses from very massive progenitors. This bimodal black-hole mass distribution leads to a characteristic distribution of chirp masses of merging binary black holes, with two main peaks arising from the merger of two black holes where both come either from the low- or the high-mass peak and a smaller peak in between from the mixed merger of a low-mass and a high-mass black hole. We carry out a population synthesis study of binary black hole formation and compare the results to the observed chirp masses of gravitational-wave events. We find that only the bimodal black-hole mass prescription is able to reproduce the structure of peaks and gaps in the observed chirp-mass distribution, which is not matched by predictions from other remnant mass prescriptions in the literature.\n\n", "2508.20644": "2025-08-28, **Challenging $Λ$CDM with Higher-Order GUP Corrections**, Andronikos Paliathanasis et.al., [2508.20644v1](http://arxiv.org/abs/2508.20644v1)\n\n We study quantum corrections to the $\\Lambda$CDM model model arising from a minimum measurable length in Heisenberg's uncertainty principle. We focus on a higher-order Generalized Uncertainty Principle, beyond the quadratic form. This generalized GUP introduces two free parameters, and we determine the modified Friedmann equation. This framework leads to a perturbative cosmological model that naturally reduces to $\\Lambda$CDM in an appropriate limiting case of the deformation parameters. We construct the modified cosmological scenario, analyze its deviations from the standard case, and examine it as a mechanism for the description of dynamical dark energy. To constrain the model, we employ Cosmic Chronometers, the latest Baryon Acoustic Oscillations from the DESI DR2 release, and Supernova data from the PantheonPlus and Union3 catalogues. Our analysis indicates that the modified GUP model is statistically competitive with the $\\Lambda$CDM scenario, providing comparable or even improved fits to some of the combined datasets. Moreover, the data constrain the deformation parameter of the GUP model, with the preferred value found to be negative, which corresponds to a phantom regime in the effective dynamical dark energy description.\n\n", "2508.20484": "2025-08-28, **Potassium abundances in extremely metal poor stars: Implications for nucleosynthesis in the final stages of massive star evolution**, M. N. Ishigaki et.al., [2508.20484v1](http://arxiv.org/abs/2508.20484v1)\n\n We present a potassium (K) abundance analysis in extremely metal-poor (EMP) stars based on high-resolution ($R\\sim 60000$) spectra obtained with the High Dispersion Spectrograph on the Subaru Telescope, covering the K I resonance lines at 766 and 769 nm. One-dimensional local thermodynamic equilibrium (LTE) abundances of K and other elements, including Na, Mg, Ca, Ti, Cr, and Ni, were derived using spectral synthesis. Non-local thermodynamic equilibrium (NLTE) corrections were applied to the K abundances by interpolating a precomputed grid of corrections based on stellar parameters and the LTE K abundance. We detected K I lines in seven stars with [Fe/H]$< -3.0$ and derived upper limits for other stars in the same metallicity regime, making this sample well-suited for investigating the nucleosynthesis origins of K in the early universe. We found that the [K/Fe] and [K/Ca] ratios of the seven stars are enhanced relative to the solar value, with a scatter of approximately 0.1 dex, as small as the typical measurement uncertainty. Under the assumption that each star formed from gas purely enriched by a single or a few massive stars' supernovae, the small scatter in [K/Fe] and [K/Ca], contrasted with the $\\sim$0.7 dex scatter in [Na/Mg] ratios (after NLTE correction), suggests that the production of K in massive stars or their supernovae is independent of the processes that drive Na/Mg variation. These findings demonstrate that K abundances in EMP stars, and their correlations with other elemental abundances, can serve as sensitive tracers of the physical mechanisms governing the final evolutionary stages of massive stars and their supernova explosions.\n\n"}}