{"neutrino": {"2406.11438": "2024-06-17, **Search for Majorana Neutrinos with the Complete KamLAND-Zen Dataset**, S. Abe et.al., [2406.11438v1](http://arxiv.org/abs/2406.11438v1)\n\n We present a search for neutrinoless double-beta ($0\\nu\\beta\\beta$) decay of $^{136}$Xe using the full KamLAND-Zen 800 dataset with 745 kg of enriched xenon, corresponding to an exposure of $2.097$ ton yr of $^{136}$Xe. This updated search benefits from a more than twofold increase in exposure, recovery of photo-sensor gain, and reduced background from muon-induced spallation of xenon. Combining with the search in the previous KamLAND-Zen phase, we obtain a lower limit for the $0\\nu\\beta\\beta$ decay half-life of $T\\_{1/2}^{0\\nu} > 3.8 \\times 10^{26}$ yr at 90% C.L., a factor of 1.7 improvement over the previous limit. The corresponding upper limits on the effective Majorana neutrino mass are in the range 28-122 meV using phenomenological nuclear matrix element calculations.\n\n", "2406.11382": "2024-06-17, **Baryon-number-violating nucleon decays in ALP effective field theories**, Tong Li et.al., [2406.11382v1](http://arxiv.org/abs/2406.11382v1)\n\n The search for baryon-number-violating (BNV) nucleon decay is an intriguing probe of new physics beyond the SM in future neutrino experiments with enhanced sensitivity. The dark sector states such as an axion or axion-like particle (ALP) can induce nucleon decays with distinct signature and kinematics from the conventional nucleon decays. In this work, we study the ALP effective field theories (EFTs) with baryon number violation and the impact of light ALP on BNV nucleon decays. We revisit the dimension-8 BNV operators in the extended EFTs with an ALP field $a$ respecting shift symmetry. The low-energy EFT operators with $\\|\\Delta (B-L)\\|=2$ and $\\|\\Delta (B-L)\\|=0$ are matched to the baryon chiral perturbation theory. We obtain the effective chiral Lagrangian and the BNV interactions between ALP and baryons/mesons. The ALP interactions lead to two-body baryon decays $B\\to \\ell~({\\rm or}~\\nu)~a$ and three-body nucleon decays $N\\to M~\\ell~({\\rm or}~\\nu)~a$. We obtain the constraints on the UV scale from the invisible $\\Lambda^0$ decay search at BESIII, the invisible neutron decay search at KamLAND and proton decay search at Super-K. We also show the projections of some other baryon/nucleon decays and present the distinct distributions of kinematic observable.\n\n", "2406.10944": "2024-06-16, **Testing unified models for the origin of ultrahigh-energy cosmic rays and neutrinos:Multimessenger approaches with x-ray observations**, Shigeru Yoshida et.al., [2406.10944v1](http://arxiv.org/abs/2406.10944v1)\n\n The unified models of astrophysical sources to account for ultrahigh-energy cosmic rays (UHECRs) and high-energy cosmic neutrinos with energies greater than 100 TeV have been discussed. Based on model-independent arguments, we argue that if the photomeson production is the dominant mechanism, the most probable candidate sources are x-ray transient objects, allowing for the semi-transparency for the photomeson production. We develop a generic model of high-energy neutrino emitters accompanied by x-ray emission, and present how multimessenger observations can place significant constraints on the source parameters that characterize the common sources of neutrinos and UHECRs, such as the cosmic-ray loading factor. The requirements of UHECR acceleration, escape, and energetics further constrain the magnetic field and the bulk Lorentz factor of the sources. The resulting bounds provide diagnoses of the unified models, which demonstrates the importance of current and future x-ray facilities such as MAXI and Einstein Probe.\n\n"}, "dark matter": {"2406.11609": "2024-06-17, **Single-epoch and Differential Astrometric Microlensing of Quasars**, R. Forés-Toribio et.al., [2406.11609v1](http://arxiv.org/abs/2406.11609v1)\n\n We propose and discuss a new experimental approach to measure the centroid shift induced by gravitational microlensing in the images of lensed quasars (astrometric microlensing). Our strategy is based on taking the photocenter of a region in the quasar large enough as to be insensitive to microlensing as reference to measure the centroid displacement of the continuum. In this way, single-epoch measurements of astrometric microlensing can be performed. Using numerical simulations, we show that, indeed, the centroid shift monotonically decreases as the size of the emitting region increases, and only for relatively large regions, like the broad line region (BLR), does the centroid shift become negligible. This opens interesting possibilities to study the stratification of the different emitters in the accretion disk and the BLR. We estimate the amplitude of the centroid shifts for 79 gravitationally lensed images and study more thoroughly the special cases Q2237+030 A, RXJ1131-1231 A, PG1115+080 A2 and SDSS J1004+4112 A. We propose to use spectro-astrometry to simultaneously obtain the photocenters of the continuum and of different emission line regions since, with the precision of forthcoming instruments, astrometric microlensing by $\\sim 1 M\\_\\odot$ mass microlenses may be detected in many quasar lensed images. When we consider more massive micro/millilenses, $M\\gtrsim 10 M\\_\\odot$, often proposed as the constituents of dark matter, the BLR becomes sensitive to microlensing and can no longer be used as a positional reference to measure centroid shifts. Differential microlensing between the images of a lensed quasar along several epochs should be used instead.\n\n", "2406.11417": "2024-06-17, **Primordial black hole formation during cosmic phase transitions**, Karsten Jedamzik et.al., [2406.11417v1](http://arxiv.org/abs/2406.11417v1)\n\n Primordial black holes (PBHs) may be part of the dark matter. It is shown here that PBHs form more easily during cosmic phase transitions. For approximately scale-invariant primordial curvature fluctuations the PBH mass function may therefore leave a record of the thermal history of the early Universe. In particular a peak is expected on the 1.9 solar mass scale due to the cosmic QCD transition.\n\n", "2406.11042": "2024-06-16, **Thermal and non-thermal DM production in non-Standard Cosmologies: a mini review**, Giorgio Arcadi et.al., [2406.11042v1](http://arxiv.org/abs/2406.11042v1)\n\n We provide a short review of some aspects of Dark Matter production in non Standard Cosmology. Considering the simplest Higgs portal model as definite particle physics setup, we consider the impact on the parameter space corresponding to the correct relic density, and the complementary experimental constraints, of the presence, during thermal production, of an exotic component dominating the energy density of the Universe. In the second part of the work we will focus on the case that such exotic component satisfies the equation of state of matter and it can produce DM non-thermally.\n\n", "2406.10969": "2024-06-16, **The 95GeV Excesses in the $\\mathbb{Z}_3$-symmetric Next-to Minimal Supersymmetric Standard Model**, Jingwei Lian et.al., [2406.10969v1](http://arxiv.org/abs/2406.10969v1)\n\n Recent analyses by CMS and ATLAS suggest a deviation in the di-photon channel at approximately 95 GeV, alongside a previously observed excess in $b\\bar{b}$ signals at a similar mass by LEP, potentially hinting at a new scalar particle. This study explores this possibility within the framework of the well-established $\\mathbb{Z}\\_3$-symmetric Next-to-Minimal Supersymmetric Standard Model. A comprehensive parameter scan was conducted, integrating constraints from dark matter relic density, direct detection experiments, and the properties of the observed 125 GeV Higgs boson. The results demonstrate that the model can accommodate the observed excesses with a singlet-dominated CP-even Higgs boson near 95 GeV. The model accurately predicts signal strengths of the di-photon and $b\\bar{b}$ channels at a level of $1\\sigma$. Furthermore, it accounts for the measured dark matter relic abundance through Bino-dominated neutralinos co-annihilation with Wino-like electroweakinos, all while remaining consistent with existing LHC constraints. These findings pave the way for future validation at the high-luminosity LHC and linear colliders, which may offer crucial tests of the model's predictions.\n\n", "2406.10912": "2024-06-16, **A systematic investigation on dark matter-electron scattering in effective field theories**, Jin-Han Liang et.al., [2406.10912v1](http://arxiv.org/abs/2406.10912v1)\n\n In this paper, we systematically investigate the general dark matter-electron interactions within the framework of effective field theories (EFT). We consider both the non-relativistic (NR) EFT and the relativistic EFT descriptions of the interactions with the spin of dark matter (DM) up to one, i.e., the scalar ($\\phi$), fermion ($\\chi$), and vector $(X)$ DM scenarios. We first collect the leading-order NR EFT operators describing the DM-electron interactions, and construct especially the NR operators for the vector DM case. Next, we consider all possible leading-order relativistic EFT operators including those with a photon field and perform the NR reduction to match them onto the NR EFT. Then we rederive the DM-bound-electron scattering rate within the NR EFT framework and find that the matrix element squared, which is the key input that encodes the DM and atomic information, can be compactly decomposed into three terms. Each term is a product of a DM response function $(a\\_{0,1,2})$, which is essentially a factor of Wilson coefficients squared, and its corresponding generalized atomic response function ($\\widetilde W\\_{0,1,2}$). Lastly, we employ the electron recoil data from the DM direct detection experiments (including XENON10, XENON1T, and PandaX-4T) to constrain all the non-relativistic and relativistic operators in all three DM scenarios. We set strong bounds on the DM-electron interactions in the sub-GeV region. Particularly, we find that the latest PandaX-4T S2-only data provide stringent constraints on dark matter with a mass greater than approximately 20 MeV, surpassing those from the previous XENON10 and XENON1T experiments.\n\n"}, "supernova": {"2406.11691": "2024-06-17, **A search for the fine-structure constant evolution from fast radio bursts and type Ia supernovae data**, Thais Lemos et.al., [2406.11691v1](http://arxiv.org/abs/2406.11691v1)\n\n The search for a space-time variation of the fundamental constants has been explored over the years to test our physical theories. In this paper, we use the dispersion measure ($DM$) of fast radio bursts (FRB) combined with type Ia supernovae (SNe) data to investigate a possible redshift evolution of the fine-structure constant ($\\alpha$), considering the runaway dilaton scenario, which predicts $\\frac{\\Delta \\alpha}{\\alpha} = - \\gamma\\ln{(1+z)}$, where $\\gamma$ is a constant proportional to the current value of the coupling between the dilaton field and hadronic matter. We derive all the relevant expressions for the $DM$ dependence concerning the fine-structure constant and constrain the parameter $\\gamma$ from measurements of 17 well-localized FRBs and 1048 SNe data from the Pantheon compilation. We also use Monte Carlo simulations to forecast the constraining power of larger samples of FRB measurements for data sets with $N = 500$ and $N = 1000$ points. We found that the uncertainty on $\\gamma$ can be improved by one order of magnitude and that limits on $\\frac{\\Delta \\alpha}{\\alpha}$ beyond $\\sigma \\sim 10^{-2}$ will depend crucially on better control of statistical and systematic uncertainties of upcoming FRB data.\n\n", "2406.11680": "2024-06-17, **ZTF SN Ia DR2: Exploring SN Ia properties in the vicinity of under-dense environments**, M. Aubert et.al., [2406.11680v1](http://arxiv.org/abs/2406.11680v1)\n\n The unprecedented statistics of detected Type Ia supernovae (SNe Ia) brought by the Zwicky Transient Facility enables us to probe the impact of the Large-Scale Structure on the properties of these objects. The goal of this paper is to explore the possible impact of the under-dense part of the large-scale structure on the intrinsic SALT2 light curve properties of SNe Ia and uncover possible biases in SN Ia analyses. With a volume-limited selection of ZTF-Cosmo-DR2 Type Ia supernovae overlapping with the SDSS-DR7 survey footprint, we investigate the distribution of their properties with regard to voids detected in the SDSS-DR7 galaxy sample. We further use Voronoi volumes as proxy for local density environments within the large-scale structure. We find a moderate dependency of the stretch toward the localisation around the void centre and none when considering colour. The local Voronoi volumes mostly affect the fraction of low/high stretch supernovae. With the current statistics available, we consider that the impact of high or low local density environment can be considered as a proxy for the colour of the host galaxy. Under-dense environments should not cause any biases in supernova analyses.\n\n", "2406.11539": "2024-06-17, **Origin of the strong sodium absorption of the lensed supernova 2016geu at z=0.4**, Christa Gall et.al., [2406.11539v1](http://arxiv.org/abs/2406.11539v1)\n\n The origin of strong sodium absorption, which has been observed for a few nearby Type Ia supernovae (SNe Ia), remains elusive. Here we analyse two high-signal-to-noise, intermediate-resolution VLT/X-shooter spectra at epochs $+$18 and $+$27 days past peak brightness of the strongly lensed and multiply-imaged Type Ia SN 2016geu which exploded at a redshift of $z = 0.4$. We show that SN 2016geu exhibits very strong, multiple Na I and Ca II absorption lines with a large total Na I D restframe equivalent width of 5.2 $\\pm$ 0.2 A, among the highest ever detected for a SN Ia and similar to only a handful of nearby SNe Ia with extraordinary large Na I D EWs. The absorption system is time-invariant and extends over a large velocity span $\\sim$ 250 km s$^{-1}$. The majority of the absorption is blueshifted relative to the strongest component, while there are both blueshifted and redshifted components relative to the systemic redshift of the galaxy. The column density ratios and widths of the absorption lines indicate that the absorption likely arises from a combination of interstellar dusty molecular clouds and circumgalactic in- and outflowing material, rather than circumstellar matter around the SN.\n\n", "2406.11155": "2024-06-17, **On the limitations of H alpha luminosity as a star formation tracer in spatially resolved observations**, Zipeng Hu et.al., [2406.11155v1](http://arxiv.org/abs/2406.11155v1)\n\n This study examines the limitations of H$\\alpha$ luminosity as a tracer of star formation rates (SFR) in spatially resolved observations. We carry out high-resolution simulations of a Milky Way-like galaxy including both supernova and photoionization feedback, and from these we generate synthetic H$\\alpha$ emission maps that we compare to maps of the true distribution of young stellar objects (YSOs) on scales from whole-galaxy to individual molecular clouds ($\\lesssim 100$ pc). Our results reveal significant spatial mismatches between H$\\alpha$ and true YSO maps on sub-100 pc scales, primarily due to ionizing photon leakage, with a secondary contribution from young stars drifting away from their parent molecular clouds. On small scales these effect contribute significantly to the observed anti-correlation between gas and star formation, such that there is noticeably less anti-correlation if we replace an H$\\alpha$-based star formation map with a YSO-based one; this in turn implies that previous studies have underestimated the time it takes for young stars to disperse their parent molecular clouds. However, these effects are limited in dense regions with hydrogen columns $N\\_\\mathrm{H} > 3 \\times 10^{21}$ cm$^{-2}$, where the H$\\alpha$- and YSO-based SFR maps show better agreement. Based on this finding we propose a calibration model that can precisely measure the SFR of large molecular clouds (mean radius > 100 pc) with a combination of H$\\alpha$ and CO observations, which provides a foundation for future study of star formation processes in extragalactic molecular clouds.\n\n", "2406.11111": "2024-06-17, **No evidence for a dip in the binary black hole mass spectrum**, Christian Adamcewicz et.al., [2406.11111v1](http://arxiv.org/abs/2406.11111v1)\n\n Stellar models indicate that the core compactness of a star, which is a common proxy for its explodability in a supernova, does not increase monotonically with the star's mass. Rather, the core compactness dips sharply over a range of carbon-oxygen core masses; this range may be somewhat sensitive to the star's metallicity and evolutionary history. Stars in this compactness dip are expected to experience supernovae leaving behind neutron stars, whereas stars on either side of this range are expected to form black holes. This results in a hypothetical mass range in which black holes should seldom form. Quantitatively, when applied to binary stripped stars, these models predict a dearth of binary black holes with component masses $\\approx 10 M\\_\\odot - 15 M\\_\\odot$. The population of gravitational-wave signals indicates weak evidence for a dip in the distribution of chirp masses of merging binary black holes near $\\approx 10 M\\_\\odot - 12 M\\_\\odot$. This feature could be linked to the hypothetical component mass gap described above, but this interpretation depends on what assumptions are made of the binaries' mass ratios. Here, we directly probe the distribution of binary black hole component masses to look for evidence of a gap. We find no evidence for this feature using data from the third gravitational-wave transient catalogue (GWTC-3). If this gap does exist in nature, we find that it is unlikely to be resolvable by the end of the current (fourth) LIGO-Virgo-KAGRA (LVK) observing run.\n\n"}}