{"neutrino": {"2404.07679": "2024-04-11, **Haldane graphene billiards versus relativistic neutrino billiards**, Dung Xuan Nguyen et.al., [2404.07679v1](http://arxiv.org/abs/2404.07679v1)\n\n We study fluctuation properties in the energy spectra of finite-size honeycomb lattices, graphene billiards, subject to the Haldane-model onsite potential and next-nearest neighbor interaction at critical points, referred to as Haldane graphene billiards in the following. The billiards had the shapes of a rectangular billiard with integrable dynamics, one with chaotic dynamics, and one whose shape has, in addition, threefold rotational symmetry. It had been shown that the spectral properties of the graphene billiards coincide with those of the nonrelativistic quantum billiard with the corresponding shape, both at the band edges and in the region of low energy excitations around the Dirac points at zero energy. There, the dispersion relation is linear and, accordingly, the spectrum is described by the same relativistic Dirac equation for massless half-spin particles as relativistic neutrino billiards, whose spectral properties agree with those of nonrelativistic quantum billiards with violated time-reversal invariance. Deviations from the expected behavior are attributed to differing boundary conditions and backscattering at the boundary, which leads to a mixing of valley states corresponding to the two Dirac points, that are mapped into each other through time reversal. We employ a Haldane model to introduce a gap at one of the two Dirac points so that backscattering is suppressed in the energy region of the gap and demonstrate that there the correlations in the spectra comply with those of the neutrino billiard of the corresponding shape.\n\n", "2404.07429": "2024-04-11, **Neutral-current background induced by atmospheric neutrinos at large liquid-scintillator detectors: III. Quantitative calculations for reactor neutrinos**, Jie Cheng et.al., [2404.07429v1](http://arxiv.org/abs/2404.07429v1)\n\n Atmospheric neutrinos contribute significantly to irreducible backgrounds through their neutral-current (NC) interactions with $^{12}$C nuclei in liquid-scintillator detectors, impacting diffuse supernova neutrino background, nucleon decay, and reactor neutrinos. This paper extends our prior work by systematically studying the NC backgrounds towards the MeV region of reactor neutrinos. We employ contemporary neutrino generator models from GENIE and NuWro for calculations, with a focus on predicting NC background in experimental searches for inverse-beta-decay signals below 100 MeV visible energy. We estimate the systematic uncertainty to our estimation of the NC background using various data-driven neutrino generator models, addressing factors such as the initial neutrino-nucleon NC interaction, the nuclear model, the final-state interaction model, the nucleus deexcitation, and the secondary interaction on final-state particles.\n\n"}, "dark matter": {"2404.07601": "2024-04-11, **Dilaton Forbidden Dark Matter**, Thomas Appelquist et.al., [2404.07601v1](http://arxiv.org/abs/2404.07601v1)\n\n Dilaton effective field theory (dEFT) describes the long distance behavior of certain confining, near-conformal gauge theories that have been studied via lattice computation. Pseudo-Nambu-Goldstone bosons (pNGBs), emerging from the breaking of approximate, continuous, internal symmetries, are coupled to an additional scalar particle, the dilaton, arising from the spontaneous breaking of approximate scale invariance. This effective theory has been employed to study possible extensions of the standard model. In this paper, we propose a complementary role for dEFT, as a description of the dark matter of the universe, with the pNGBs identified as the dark-matter particles. We show that this theory provides a natural implementation of the ``forbidden'' dark matter mechanism, and we identify regions of parameter space for which the thermal history of dEFT yields the measured dark matter relic density.\n\n"}, "supernova": {"2404.07873": "2024-04-11, **Supernova remnants of red supergiants: from barrels to Cygnus loops**, D M A Meyer et.al., [2404.07873v1](http://arxiv.org/abs/2404.07873v1)\n\n Core-collapse supernova remnants are the nebular leftover of defunct massive stars which have died during a supernova explosion, mostly while undergoing the red supergiant phase of their evolution. The morphology and emission properties of those remnants are a function of the distribution of circumstellar material at the moment of the supernova, the intrisic properties of the explosion, as well as those of the ambient medium. By means of 2.5 dimensional numerical magnetohydrodynamics simulations, we model the long term evolution of supernova remnants generated by runaway rotating massive stars moving into a magnetised interstellar medium. Radiative transfer calculations reveal that the projected non-thermal emission of the supernova remnants decreases with time, i.e. older remnants are fainter than younger ones. Older (80 kyr) supernova remnants whose progenitors were moving with space velocity corresponding to a Mach number M = 1 (v\\_star = 20 km/s ) in the Galactic plane of the ISM (nISM = 1/cm3 ) are brighter in synchrotron than when moving with a Mach number M = 2 (v\\_star = 40 km/s ). We show that runaway red supergiant progenitors first induce an asymmetric non thermal 1.4 GHz barrel like synchrotron supernova remnants (at the age of about 8 kyr), before further evolving to adopt a Cygnus loop like shape (at about 80 kyr). It is conjectured that a significative fraction of supernova remnants are currently in this bilateral-to-Cygnus-loop evolutionary sequence, and that this should be taken into account in the data interpretation of the forthcoming Cherenkov Telescope Array (CTA) observatory.\n\n", "2404.07714": "2024-04-11, **Self-interacting dark sectors in supernovae are fluid**, Damiano F. G. Fiorillo et.al., [2404.07714v1](http://arxiv.org/abs/2404.07714v1)\n\n We revisit supernova (SN) bounds on a hidden sector consisting of millicharged particles $\\chi$ and a massless dark photon. Unless the self-coupling is fine-tuned to be small, rather than exiting the SN core as a gas, the particles form a relativistic fluid and subsequent dark QED fireball, streaming out against the drag due to the interaction with matter. Novel bounds due to excessive energy deposition in the mantle of low-energy SNe can be obtained. The cooling bounds from SN~1987A are unexpectedly not affected in the free-streaming regime. The inclusion of $\\chi\\bar{\\chi}\\rightarrow \\rm SM$ substantially modifies the constraints in the trapping regime, which can only be treated hydrodynamically. Our results can be adapted to generic sub-GeV self-interacting dark sectors.\n\n", "2404.07455": "2024-04-11, **Supernova 1987A's keyhole: A long-lived jet-pair in the final explosion phase of core-collapse supernovae**, Noam Soker et.al., [2404.07455v1](http://arxiv.org/abs/2404.07455v1)\n\n I further study the manner by which a pair of opposite jets shape the `keyhole' morphological structure of the core-collapse supernova (CCSN) SN 1997A, now the CCSN remnant (CCSNR) 1987A. By doing so, I strengthen the claim that the jittering-jet explosion mechanism (JJEM) accounts for most, likely all, CCSNe. The `keyhole' structure comprises a northern low-intensity zone closed with a bright rim on its front and an elongated low-intensity nozzle in the south. This rim-nozzle asymmetry is observed in some cooling flow clusters and planetary nebulae that are observed to be shaped by jets. I build a toy model that uses the planar jittering jets pattern, where consecutive pairs of jets tend to jitter in a common plane, implying that the accreted gas onto the newly born neutron star at the late explosion phase flows perpendicular to that plane. This allows for a long-lived jet-launching episode. This long-lasting jet-launching episode launches more mass into the jets that can inflate larger pairs of ears or bubbles, forming the main jets' axis of the CCSNR that is not necessarily related to a possible pre-collapse core rotation. I discuss the relation of the main jets' axis to the neutron star's natal kick velocity.\n\n"}}