{"neutrino": {"2512.20594": "2025-12-23, **The Sensitivity of PUEO to Cosmogenic Neutrinos and Exotic Physics Scenarios**, Angelina Sherman et.al., [2512.20594v1](http://arxiv.org/abs/2512.20594v1)\n\n Several observatories designed to detect ultrahigh-energy neutrinos are planned for the next decade. The most imminent of these is the Payload for Ultrahigh Energy Observations (PUEO), a long-duration balloon-based experiment that will provide unprecedented sensitivity to neutrinos with energies in the range of ~ 1 - 1000 EeV. In this work, we assess the scientific reach of PUEO. In particular, we evaluate the sensitivity of this observatory to cosmogenic neutrinos and, in turn, to the proton fraction of the ultrahigh-energy cosmic-ray spectrum. We also consider the potential of PUEO to probe scenarios in which neutrinos are produced through the decays of ultraheavy dark matter particles or are radiated from cosmic strings. We find that PUEO will be able to constrain the proton composition of ultrahigh-energy cosmic rays in scenarios that feature very strong source evolution and in which protons are accelerated to extremely high energies. Although gamma-ray observations are generally more sensitive to decaying particles than neutrino observations, PUEO is expected to set the strongest neutrino-detector constraints above 10^19 eV. PUEO will also provide the strongest constraints on some models of cosmic strings.\n\n", "2512.20560": "2025-12-23, **A possible solution to the gallium anomaly moving beyond the leptonic wave function factorization**, M. Cadeddu et.al., [2512.20560v1](http://arxiv.org/abs/2512.20560v1)\n\n For over thirty years, a $\\sim20\\%$ deficit, now exceeding $5σ$, has persisted between measured and predicted neutrino capture rates on $^{71}$Ga, as observed in radioactive source experiments (namely GALLEX, SAGE, and more recently BEST) using $^{51}$Cr and $^{37}$Ar. This long-standing discrepancy, referred to as the gallium anomaly, has posed a significant challenge to our understanding of both experimental methods and theoretical predictions. In this work, we revisit the theoretical calculation of the neutrino capture cross-section by moving beyond the standard treatment of the leptonic wave functions, revealing limitations in the commonly used factorization approach based on the detailed balance principle. Incorporating phenomenologically constrained Gamow-Teller transition densities, able to correctly reproduce the precisely measured half-life of $^{71}{\\textrm{Ge}}$, we find that the revised cross-section can be significantly reduced, potentially resolving the gallium anomaly without invoking new physics.\n\n", "2512.20470": "2025-12-23, **Accelerator-Based Neutrino Beams**, Laura Fields et.al., [2512.20470v1](http://arxiv.org/abs/2512.20470v1)\n\n Over the past six decades, accelerator-based neutrino beams have revolutionized particle physics. Neutrinos created with accelerators have been used to discover the muon neutrino and tau neutrinos was discovered and to confirm the existence of neutrino oscillations. More recently, long-baseline experiments have offered the first experimental hint of CP violation in the neutrino sector. Building and operating such beams is an enormous technical challenge, yet they remain our most versatile tool for studying neutrinos. With new experiments such as DUNE and Hyper-Kamiokande, and ideas such as neutrino factories, the next generation of beams will address open questions about neutrino mass ordering, CP violation, and possible physics beyond the standard model.\n\n", "2512.20428": "2025-12-23, **Dirac Neutrinos and Gauged Lepton Number**, A. E. Cárcamo Hernández et.al., [2512.20428v1](http://arxiv.org/abs/2512.20428v1)\n\n We propose the first scotogenic neutrino mass model with gauged lepton number $U(1)\\_L$, which is spontaneously broken by three units $ΔL=3$ down to a residual discrete gauge symmetry $\\mathbb{Z}\\_6$. The latter guarantees that neutrinos acquire tiny Dirac masses via a one-loop scotogenic mechanism, simultaneously stabilizing the lightest electrically neutral particle with non-trivial charge under the preserved $\\mathbb{Z}\\_6$ symmetry. In our model there is a scalar particle identified as weakly interacting massive particle dark matter (DM) candidate. We analyzed its compatibility with the existing data on direct DM detection experiments and the DM relic abundance. We also address charged lepton flavor violating decays in our model and find that their predicted rates are within the reach of current experimental sensitivity.\n\n", "2512.19887": "2025-12-22, **Measurement of solar neutrino interaction rate below 3.49 MeV in Super-Kamiokande-IV**, Super-Kamiokande Collaboration et.al., [2512.19887v1](http://arxiv.org/abs/2512.19887v1)\n\n Super-Kamiokande has observed $^{8}\\text{B}$ solar neutrino elastic scattering at recoil electron kinetic energies ($E\\_{kin}$) as low as 3.49 MeV to study neutrino flavor conversion within the sun. At SK-observable energies, these conversions are dominated by the Mikheyev-Smirnov-Wolfenstein effect. An upturn in the electron neutrino survival probability in which vacuum neutrino oscillations become dominant is predicted to occur at lower energies, but radioactive background increases exponentially with decreasing energy. New machine learning approaches provide substantial background reduction below 3.49 MeV such that statistical extraction of solar neutrino interactions becomes feasible. This article presents an analysis of the solar neutrino interaction rate at $E\\_{kin}$ < 3.49 MeV with the full SK-IV period, using data from a wideband intelligent trigger when available and with a boosted decision tree for event selection. A solar neutrino signal is observed between 2.99 MeV < $E\\_{kin}$ < 3.49 MeV with $2.76σ$ significance and a data to unoscillated MC ratio of $0.307^{+0.112}\\_{-0.111}$. This additional low energy data has a negligible effect on the $1σ$ intervals of the fits to the solar neutrino energy spectrum but has a noticeable effect on the best fit when using the exponential parameterization.\n\n", "2512.19833": "2025-12-22, **Universal Seesaw Leptogenesis**, K. S. Babu et.al., [2512.19833v1](http://arxiv.org/abs/2512.19833v1)\n\n We study the implications for leptogenesis in a class of left-right symmetric model, where all fermion masses are induced through the Universal Seesaw mechanism. Unlike conventional analyses, we do not use the decays of the neutrino embedded in the right-chiral lepton doublet, but rather those of the gauge-singlet mediators required for neutrino mass generation in the canonical Type-I seesaw. Due to the generalized parity symmetry that doubles the fermionic degrees of freedom in this model, we can generate the required $CP$ violation in the heavy fermion decays with only a single generation of mediators. One of the distinct features of our scenario is that the bounds from thermalization or washout via gauge interactions typically encountered in the canonical left-right symmetric models do not apply here. Moreover, the heavy mediators can decay to both the left and the right-chiral neutrinos, leading to a cancellation in the resulting baryon asymmetry for decays above the left-right symmetry breaking scale. We discuss ways to avoid this cancellation and show that low scale left-right symmetry breaking above the current collider limits is viable. The right chiral neutrinos also obtain their masses from the seesaw mechanism, and the lightest one turns out to have a sub-eV scale mass. We find that its abundance is consistent with standard cosmology, and it acts as potentially observable dark radiation.\n\n", "2512.19794": "2025-12-22, **Probing invisible particles with charm**, Gudrun Hiller et.al., [2512.19794v1](http://arxiv.org/abs/2512.19794v1)\n\n We point out opportunities to probe invisible particles, left- and right-handed neutrinos, axion-like particles (ALPs) and dark photons $(Z^\\prime)$ with rare decays of charm hadrons. We employ and recast existing searches in $D \\to (π, ω) X$, $D^ 0 \\to X$ and $Λ\\_c \\to p X$, where $X$ denotes one of the above invisible final states including dineutrinos. The branching ratios are clean null tests of the standard model, yet, are essentially unconstrained for some parameters of light new physics, limited only by weak lifetime constraints at the level of $\\mathcal{O}(10^{-1})$. On the other hand, if models are probed, branching ratios still reach up to $10^{-3}$ ($Z^\\prime$) and $10^{-4}$ (ALPs). Chirality-preserving operators from heavy new physics in the dimension six standard model effective theory (SMEFT) imply tighter upper limits, up to few $\\times 10^{-5}$. Constraints on chirality-flipping heavy new physics, such as lepton number violation from dimension seven SMEFT, or with light sterile neutrinos, are weaker, with branching ratios up to few$\\times 10^{-4}$. Sensitivities to different couplings arise with $Λ\\_c \\to p X$ and $D \\to ππX$ decays, in particular in relation with the other modes. Processes can be studied at running and future experiments with high charm luminosities, BESIII, Belle II, a super-tau-charm factory (STCF) and $Z$-factories, such as FCC-ee and CEPC.\n\n", "2512.19784": "2025-12-22, **Shifting the neutrino fog: studying the Isospin-violating Dark Matter case**, Laura Duque et.al., [2512.19784v1](http://arxiv.org/abs/2512.19784v1)\n\n First observation of solar neutrinos through coherent elastic neutrino-nucleus scattering by dark matter (DM) direct detection (DD) experiments makes the study of the neutrino fog of the most relevance. This irreducible neutrino background depends on the target material as well as other experimental parameters. Recently, it has also been remarked the dependence of the neutrino fog on the DM models under consideration. In this work, we study the case of Isospin-violating dark matter (IVDM) models, discussing specific examples of DM models and making a detailed analysis of the implications of IVDM on the neutrino fog. We also explore the conditions under which this background can be mitigated for specific DM models.\n\n", "2512.19788": "2025-12-22, **Coherent Elastic Neutrino-Nucleus Scattering at the Japan Proton Accelerator Research Complex**, J. I. Collar et.al., [2512.19788v1](http://arxiv.org/abs/2512.19788v1)\n\n The Japan Proton Accelerator Research Complex (J-PARC) currently delivers a 1 MW, 3 GeV proton beam to the Materials and Life Science Experimental Facility (MLF). Power is expected to increase to 1.3 MW, driven by the needs of Hyper-Kamiokande. As a result, the MLF presently provides the highest neutron yield of any spallation source, while potentially holding the best current and foreseeable conditions for Coherent Elastic Neutrino-Nucleus Scattering (CE$ν$NS) experimentation. We explore this potential, using as examples detector technologies presently funded for construction and under development. We quantify their sensitivity to a rich variety of particle physics scenarios, finding that very-high-statistics CE$ν$NS measurements with significant sensitivity to relevant scenarios are feasible at this facility within the next few years.\n\n", "2512.19782": "2025-12-22, **$N_{\\textrm{eff}}$ Constraint on Pseudo-Dirac Neutrinos**, Chee Sheng Fong et.al., [2512.19782v1](http://arxiv.org/abs/2512.19782v1)\n\n After the electroweak symmetry breaking, we can write down two types of mass for the Standard Model neutrinos, Dirac or Majorana. It is often said that both types of mass cannot be distinguished in neutrino oscillation phenomena. This is in fact not true if neutrinos are pseudo-Dirac (strictly speaking still Majorana) where they mix almost maximally with sterile neutrinos to form pseudo-Dirac pairs. If this is indeed realized in Nature, what we observe experimentally as three mass eigenstates are actually three pairs of mass eigenstates with yet-to-be-measured new mass splitting among each pair. While the new mass squared splitting of the first and second mass eigenstates have stringent constraints from solar neutrino to be $\\|δm\\_{1,2}^2\\| \\lesssim10^{-11}\\,\\textrm{eV}^{2}$, the one regarding the third mass eigenstate has a weaker constraint $\\|δm\\_3^2\\| \\lesssim10^{-5}\\,\\textrm{eV}^{2}$. By keeping only one nonzero pseudo-Dirac mass squared splitting at a time, we derive an effective 3+1 description for the pseudo-Dirac scenario. Then we use the Cosmic Microwave Background (CMB) constraint on neutrino relativistic degrees of freedom $N\\_{\\textrm{eff}}$ to derive a new constraint $\\|δm\\_3^2\\| < 2 \\times 10^{-6}\\,{\\rm eV}^2$ and show that the future CMB-S4 and CMB-HD can improve this bound by an order of magnitude.\n\n", "2512.19667": "2025-12-22, **Picosecond laser test unit for photosensor characterization at ambient and low temperatures**, Matthias Raphael Stock et.al., [2512.19667v1](http://arxiv.org/abs/2512.19667v1)\n\n Accurate single photoelectron (SPE) characterization of photosensors is essential for controlling systematic uncertainties in low-light neutrino and dark matter detectors. We present a compact laboratory setup for the characterization of photosensors under controlled, low-light conditions. Specifically, we demonstrate its use with photomultiplier tubes (PMTs) operated at the SPE-level, using picosecond laser pulses and waveform digitization to determine key PMT properties. Measurements as a function of supply voltage and temperature ($-50^\\circ$C to $+20^\\circ$C) are performed on ET Enterprises 9821(Q)B tubes and a Hamamatsu R9980 assembly, which show exponential gain-voltage behavior and device-to-device variation. Cooling increases the gain by $\\sim 0.1\\,\\%/^\\circ$C, while the transit time spread (TTS) and peak-to-valley ratio (P/V) exhibit no clear temperature dependence. TTS decreases with voltage. Late pulses remain at the percent level and prepulses at the sub-percent level. Cable length affects both apparent gain and TTS. A model-independent, data-driven self-convolution method is introduced to quantify double photoelectron contributions from pulse charge spectra. The procedures provide a reproducible, practice-oriented reference for SPE-level PMT characterization and can be extended to other photosensor types.\n\n", "2512.19631": "2025-12-22, **Search for Quadruplet Scalars using Boosted Decision Trees at the LHC**, Amit Chakraborty et.al., [2512.19631v1](http://arxiv.org/abs/2512.19631v1)\n\n Beyond the Standard Model scenarios introduce additional scalar and fermion multiplets, which influence neutrino mass generation mechanisms and yield distinctive collider signatures. This work focuses on a particular scenario involving a neutral fermion quintuplet and a scalar quadruplet. The study examines the production and decay of the scalar quadruplet components at the LHC, emphasizing how their decay patterns, fermiophobic versus fermiophilic, depend on mass differences and Yukawa couplings with the fermion multiplets. A detailed collider analysis targeting final states with at least four leptons and two jets is conducted. The study also incorporates Standard Model backgrounds, leveraging multivariate techniques via Boosted Decision Trees. Results indicate discovery potential for scalar masses around 600-700 GeV and exclusion sensitivity extending beyond 1 TeV, highlighting the promising experimental signatures in the model and its role in probing new physics at colliders.\n\n", "2512.19437": "2025-12-22, **Ultra-high precision high voltage system for PTOLEMY**, R. Ammendola et.al., [2512.19437v1](http://arxiv.org/abs/2512.19437v1)\n\n The PTOLEMY project is prototyping a novel electromagnetic filter for high-precision $β$ spectroscopy, with the ultimate and ambitious long-term goal of detecting the cosmic neutrino background through electron capture on tritium bound to graphene. Intermediate small-scale prototypes can achieve competitive sensitivity to the effective neutrino mass, even with reduced energy resolution. To reach an energy resolution better than \\SI{500}{meV} at the tritium $β$-spectrum endpoint of \\SI{18.6}{keV}, and accounting for all uncertainties in the filtering chain, the electrode voltage must be controlled at the level of a few parts per million and monitored in real time. In this work, we present the first results obtained in this effort, using a chain of commercial ultra-high-precision voltage references, read out by precision multimeters and a \\emph{field mill} device. The currently available precision on high voltage is, in the conservative case, as low as \\SI{0.2}{ppm} per \\SI{1}{kV} single board and $\\lesssim$ \\SI{50}{mV} over the \\SI{10}{kV} series, presently limited by field mill read-out noise. However, assuming uncorrelated Gaussian noise extrapolation, the real precision could in principle be as low as \\SI{0.05}{ppm} over \\SI{20}{kV}.\n\n", "2512.19403": "2025-12-22, **Diagnosing the AGN population origin of TeV neutrinos with their spatial correlation**, Xiao-Bin Chen et.al., [2512.19403v1](http://arxiv.org/abs/2512.19403v1)\n\n The recent IceCube detection of TeV neutrinos from some nearby Seyfert galaxy (e.g., NGC~1068) suggests that active galactic nuclei (AGN) could make a significant contribution to the diffuse flux of astrophysical neutrinos. The absence of TeV gamma-rays from NGC~1068 indicates neutrino production in compact gamma-ray-opaque region. The vicinity of the supermassive black hole, such as disk-corona, is an ideal region, where the high radiation density leads to efficient neutrino production as well as the gamma-ray attenuation. Disk-corona models predict that the neutrino emission from AGNs correlates with X-ray emission, which traces the coronal activity. In this paper, we assess whether the X-ray AGN population origin for TeV neutrinos can be tested by using the spatial correlation between the neutrino population and X-ray AGN population with future neutrino telescopes. By performing simulations, we find that, the AGN origin of the neutrino background above 100\\,TeV can be tested at a confidence level of $\\sim2.4σ$ with five-year observations of IceCube-Gen2, which has an angular resolution of $\\sim0.2$ degree. With better angular resolution and sensitivity in the energy range of above $300$\\,TeV, a 30-${\\rm km^3}$ underwater neutrino telescope, such as High-energy Underwater Neutrino Telescope (HUNT), is expected to reach a significance of $\\sim8.6σ$ in testing the association after five years of exposure.\n\n", "2512.19301": "2025-12-22, **Optical Follow-Up Strategies for the Next Neutrino-Detected Galactic Core-Collapse Supernova**, P. A. Duverne et.al., [2512.19301v1](http://arxiv.org/abs/2512.19301v1)\n\n Core-collapse supernovae (CCSNe) are expected to produce intense bursts of neutrinos preceding the emergence of their electromagnetic (EM) counterparts. The prompt detection of such neutrino signals offers a unique opportunity to trigger early follow-up observations in the EM domain. We aim to assess the feasibility and efficiency of an optical-NIR follow-up strategy for CCSNe discovered via neutrino bursts, by modelling the spatial distribution of events and simulating realistic observational campaigns taking into account the size of the localization error box generated by triangulating the neutrino burst. We modelled the Galactic distribution of CCSNe, including the effects of interstellar extinction, and considered three main progenitor types: Wolf-Rayet stars, red and blue supergiants. We included the shock breakout in the EM signatures that could be detected following the neutrino burst. A population of CCSNe was generated and detected by different networks of neutrino observatories, including IceCube, KM3NeT, Super-Kamiokande, Hyper-Kamiokande, and JUNO. The resulting skymaps were used as input for GWEMOPT to produce optimized follow-up plans with two optical facilities: LSST and the TAROT robotic telescopes. Both LSST and TAROT exhibit comparable detection efficiencies for the simulated CCSN population. However, the TAROT network achieves similar success rates while requiring fewer pointings to cover the CCSN skymap. Our simulations demonstrate that neutrino follow-up campaigns can effectively CCSN optical counterparts using both large and small facilities. Depending on the neutrino network, the median number of pointings for the two tested optical facilities is of the order of 20 to 100 to find the EM emission. The number of images is larger for LSST than for TAROT by a factor of 2 to 4.\n\n", "2512.19138": "2025-12-22, **The Standard Model Prediction for the Rare Decay $B \\to X_s ν\\bar ν$**, Matteo Fael et.al., [2512.19138v1](http://arxiv.org/abs/2512.19138v1)\n\n We present updated and comprehensive Standard Model predictions for the inclusive rare decay $B \\to X\\_s ν\\barν$. Using a state-of-the-art determination of the short-distance coefficient, including NLO QCD and electroweak effects, and implementing a consistent treatment of heavy-quark masses and power corrections within the kinetic scheme, we compute the total decay rate and the neutrino invariant mass spectrum. We incorporate all known perturbative contributions in the heavy quark limit up to $\\mathcal{O}(α\\_s^3)$, evaluate non-perturbative corrections through the Heavy Quark Expansion up to $1/m\\_b^3$, and include estimates of four-quark operator matrix elements from HQET sum rules. We obtain the Standard Model branching ratios $\\text{Br}(B^0 \\to X\\_sν\\barν) = (3.35 \\pm 0.10)\\times 10^{-5} $ and $ \\text{Br}(B^+ \\to X\\_sν\\barν) = (3.62 \\pm 0.11)\\times 10^{-5}, $ representing a significant improvement in both central value and precision compared to previous determinations. We also provide predictions for partial rates with kinematic cuts relevant to Belle II. Our results are timely in view of recent measurements of $B \\to Kν\\barν$ and the first upper limits on inclusive $B \\to X\\_sν\\barν$, and they offer a robust baseline for future searches for physics beyond the Standard Model in $b\\to sν\\barν$ transitions.\n\n", "2512.19101": "2025-12-22, **Physical Conditions for Synthesis of Sc, Ti, and V in Neutrino-driven Supernovae**, Ryota Hatami et.al., [2512.19101v1](http://arxiv.org/abs/2512.19101v1)\n\n We present the results of simulations of nucleosynthesis in a core-collapse supernova (CCSN) including the neutrino process. Using the Si layer of $13M\\_\\odot$ zero-metal progenitor as the initial composition, we calculate the nucleosynthesis by adopting the temperature, density, neutrino flux, and duration of nucleosynthesis as arbitrary parameters and compare the results with the observed abundances ratio of Sc, Ti, and V in very metal-poor (VMP) stars taken from the Stellar Abundances for Galactic Archaeology (SAGA) database. As a result, for the first time, we identify the quantitative requirements on local physical conditions. To reproduce the abundances ratios in the VMP stars, the explosive nucleosynthesis should take place under the neutrino exposure, which is time integration of neutrino flux, of $σ\\_ν\\sim 10^{35}\\,\\mathrm{erg~cm^{-2}}$ and temperature of $2.0\\,\\mathrm{GK}\\leq T \\leq 3.2\\,\\mathrm{GK}$. The dependence on the density and each value of the neutrino flux and the duration of nucleosynthesis is weak. We also discuss whether the quantitative requirements are realized during the explosion. Although the requirements are difficult to be realized in the one-dimensional simulations, the non-monotonic thermal evolution shown in recent three-dimensional simulations may satisfy them. Because the evolution is likely caused by turbulent motion stemming from the initial asphericity of the progenitor, it is important to calculate the long-term three-dimensional supernova explosion of multi-dimensional metal-free progenitor models and follow the nucleosynthesis self-consistently.\n\n"}, "dark matter": {"2512.20616": "2025-12-23, **Dynamical Dark Energy models in light of the latest observations**, Javier de Cruz Pérez et.al., [2512.20616v1](http://arxiv.org/abs/2512.20616v1)\n\n In this paper, we study several models and parameterizations of dynamical dark energy (DE) that have been studied already in the past, in conjunction with the recently proposed model $w$XCDM, the running vacuum model (RVM) with and without a threshold at $z=1$ and two variants of it, the RRVM and the ``flipped RVM'', and compare them all with the concordance $Λ$CDM model and the popular $w\\_0w\\_a$CDM parameterization. We use two standard sets of cosmological data, one including distant supernovae from Pantheon$+$ and the other from DES-Y5. The rest of the data (BAO from DESI DR2 and CMB from Planck PR4) are shared by the two sets. They are analyzed with the help of \\texttt{CLASS}. No structure formation data are utilized for this analysis and no use is made of the SH0ES calibration of $H\\_0$. Even so, we find that the flipped RVM and to a lesser extent the $w$XCDM and the RVM with threshold, point to significant evidence of dynamical DE, at a level comparable to $w\\_0w\\_a$CDM, more conspicuously for the dataset that involves DES-Y5 observations. We also find that while more traditional models studied in the past, in which there is an exchange between vacuum energy and cold dark matter (through e.g. an interactive source proportional either to the density of dark matter or to that of vacuum) still hint at dynamical DE, the strength of the statistical signal (which we assess through information criteria and other estimators) is nevertheless less pronounced. Finally, we discuss the ability of the various models to explain the data by performing an analysis of their effective equation-of-state parameters and corresponding evolution of their dark energy densities.\n\n", "2512.20521": "2025-12-23, **Non-equilibrium Quantum Field Theory and Axion Electrodynamics in curved spacetimes**, Amedeo M. Favitta et.al., [2512.20521v1](http://arxiv.org/abs/2512.20521v1)\n\n Axions are hypothetical pseudoscalar particles introduced initially as a solution to the Strong CP problem in Quantum Chromodynamics (QCD), and they also arise naturally in a broad class of low-energy compactifications of string theory. Astrophysical, cosmological, and laboratory constraints require axions to be extremely weakly coupled to Standard Model particles, making them viable dark matter candidates .This PhD thesis presents original results developed over three years of research, focusing on axion cosmology and axion electrodynamics. These topics address the production of axions and their associated topological defects in the early Universe, as well as the interactions of axions with Standard Model particles. The analysis combines methods from non-equilibrium quantum field theory and quantum field theory in curved spacetimes. After reviewing the foundations of quantum field theory in curved spacetimes and cosmology, the thesis introduces the Strong CP problem and the Peccei-Quinn mechanism, including the PQWW axion model and its invisible extensions. Ultraviolet completions of QCD axion theories are discussed in both field-theoretic and extra-dimensional frameworks. A significant part of the thesis is devoted to axion electrodynamics, where a classical axion background modifies Maxwell's equations and electromagnetic observables. The non-equilibrium dynamics of self-interacting axion fields coupled to the Standard Model or to a dark sector are also studied using the two-particle-irreducible effective action, and applied to pre- and post-inflationary cosmological scenarios, yielding new insights and preliminary constraints.\n\n", "2512.20474": "2025-12-23, **Cosmological consequences of spontaneous symmetry breaking**, Giacomo Ferrante et.al., [2512.20474v1](http://arxiv.org/abs/2512.20474v1)\n\n The Standard Model of particle physics and the $Λ$CDM model of cosmology provide an incomplete description of our Universe. Both models face challenges, including explaining the nature of dark matter, the origin of the Universe's initial conditions, and the fine-tuning of the Higgs boson mass. This thesis investigates the cosmological implications of spontaneous symmetry breaking to address some of these issues, focusing on theories with a non-trivial vacuum structure. We introduce a novel class of elementary scalars called ''accidents'', which emerge as accidentally flat directions in the vacuum manifold: unlike Nambu-Goldstone boson directions, accident directions are not related to any symmetry. Radiative corrections induce a mass for the accidents that is one-loop suppressed with respect to naive expectations, making them naturally light. We propose that accidents can act as viable dark matter candidates, and as the inflaton driving cosmic inflation. We construct a model of hybrid inflation in which the inflaton potential is an accident direction and is naturally flat. In models of accident inflation where the vacuum manifold has a non-trivial topology, cosmic strings and domain walls form after the end of inflation. Such topological defects generate a stochastic background of gravitational waves. Finally, we investigate the cosmological production of dark magnetic monopoles. Focusing on 't Hooft-Polyakov monopoles from SO(3)$\\rightarrow$SO(2) symmetry breaking, we explore both second-order and first-order phase transitions, and we identify the regions of parameter space where the monopole relic density matches the one of dark matter. This model also features stable massive gauge bosons. We find that the relic density of dark gauge bosons is always far larger than the one of monopoles, concluding that dark monopoles cannot constitute a sizeable fraction of dark matter.\n\n", "2512.20375": "2025-12-23, **Leading order effective operators in quantum gravity**, Tommaso Antonelli et.al., [2512.20375v1](http://arxiv.org/abs/2512.20375v1)\n\n We explore the nature of higher dimensional operators generated by quantum gravity. Calculating the tree-level and one-loop effective operators generated by graviton exchange between fields of the standard model and those of a hidden sector, we show that the leading order operators generated by quantum gravity are non-local dimension 6 operators. Dimension 5 operators are not generated by perturbative (weak field) effects, although they might be generated by strong field effects such as Planck-scale fluctuations in spacetime. We investigate the consequences of our findings for models of ultralight scalar dark matter.\n\n", "2512.20327": "2025-12-23, **On Finite Temperature Quantum Field Theory: From Theoretical Foundations To Electroweak Phase Transition**, Mohamed Aboudonia et.al., [2512.20327v1](http://arxiv.org/abs/2512.20327v1)\n\n In the immediate aftermath of the Big Bang, the universe existed in an extremely hot, dense state in which particle interactions occurred not in a vacuum but within a thermal medium. Under such conditions, the standard framework of quantum field theory (QFT) requires a finite temperature extension, wherein propagators -- and hence the fundamental structure of the theory -- are modified to reflect thermal background effects. These thermal modifications are central to understanding the nature of electroweak symmetry breaking (EWSB) as a high temperature phase transition, potentially leading to qualitatively different vacuum structures for the Higgs field as the universe cooled. Finite temperature corrections naturally regulate ultraviolet divergences in propagators, hinting at a possible route toward ultraviolet completion. However, these same thermal effects exacerbate infrared pathologies and can lead to imaginary contributions to the effective potential, particularly when analysing metastable or multi-vacuum configurations. Additional theoretical challenges, such as gauge dependence and renormalization scale ambiguity, further obscure the precise characterization of the electroweak phase transition even in minimal extensions of the Standard Model (SM). This review presents the theoretical foundations of finite temperature QFT with an emphasis on how different field species respond to thermal effects, identifying the bosonic sector as the primary source of key theoretical subtleties. We focus particularly on the scalar extension of the SM, which offers a compelling framework for realizing first order electroweak phase transitions, electroweak baryogenesis, and accommodating dark matter candidates depending on the underlying $Z\\_2$ symmetry structure.\n\n", "2512.20318": "2025-12-23, **Exact Solution of Schrödinger equation for Complex Mass Quantum System under Complex Morse Potential to study emergent matter types and its phases**, Partha Sarathi et.al., [2512.20318v1](http://arxiv.org/abs/2512.20318v1)\n\n We present exact solutions of the Schrödinger equation for a quantum system with complex mass subjected to a complex Morse potential in the extended complex phase space. The normalized eigenfunctions and corresponding eigenspectra are derived within a non-Hermitian framework, ensuring consistent probability densities. Conditions for the reality of the spectra are established and used to analyze the dependence of eigenvalue behaviour on potential parameters. The study reveals distinct regimes of spectral characteristics arising from the interplay of complex mass, the Morse parameter, and eigenvalues, leading to the emergence of five intrinsic matter types. By analysing the energy eigenspectra, normalization conditions, and probability density profiles across parameter space, we identify regimes corresponding to real-spectrum Hermitian-like matter, quasi-stable or resonant states, purely complex quantum matter, non-physical, non-normalizable states, and a quasi-classical determinate regime in which the probability density becomes spatially static. One of these system exhibits a non-dissipative, collisionless state with long-range gravitational-like characteristics, suggesting a theoretical analogue for dark matter within a non-Hermitian quantum framework. Further, the five identified classes of matter may be interpreted as distinct phases of a single quantum system governed by complex mass and Morse parameters This classification elucidates the boundary between physical and non-physical regimes in complex quantum systems and provides a unified approach for interpreting stability, resonance, and emergent classicality arising from complex parameters.\n\n", "2512.20309": "2025-12-23, **Novel Light Dark Matter Detection with Quantum Parity Detector Using Qubit Arrays**, Xuegang Li et.al., [2512.20309v1](http://arxiv.org/abs/2512.20309v1)\n\n We present the design and the sensitivity reach of the Qubit-based Light Dark Matter detection experiment. We propose the novel two-chip design to reduce signal dissipation, with quantum parity measurement to enhance single-phonon detection sensitivity. We demonstrate the performance of the detector with full phonon and quasiparticle simulations. The experiment is projected to detect $\\gtrsim 30$ meV energy deposition with nearly $100\\%$ efficiency and high energy resolution. The sensitivity to $m\\_χ\\gtrsim 0.01$ MeV dark matter scattering cross section is expected to be advanced by orders of magnitude for both light and heavy mediators, and similar improvements will be achieved for axion and dark photon absorption in the $0.04$-$0.2$ eV mass range.\n\n", "2512.20290": "2025-12-23, **A non-compact QCD axion**, Georgios K. Karananas et.al., [2512.20290v1](http://arxiv.org/abs/2512.20290v1)\n\n We investigate the cosmology of an axion that is fundamentally non-compact. During inflation, fluctuations of the effectively massless field populate many QCD vacua, thereby evading conventional isocurvature constraints while generating domain walls -- without accompanying cosmic strings. A small non-QCD contribution to the axion potential is required to trigger the timely collapse of domain walls; as a consequence, a residual amount of CP violation in the strong sector must exist, potentially within reach of planned experiments. Non-compact axions can account for the entirety of the dark matter abundance, and the collapse of domain walls sources a stochastic gravitational-wave background at nanohertz frequencies. Such axion dynamics can be embedded in top-down constructions -- such as Weyl-invariant Einstein-Cartan gravity -- where the tilting of the axion potential arises automatically.\n\n", "2512.20193": "2025-12-23, **Decay of $f(R)$ quintessence into dark matter: mitigating the Hubble tension?**, Giovanni Montani et.al., [2512.20193v1](http://arxiv.org/abs/2512.20193v1)\n\n We propose a revised cosmological scenario that extends the $Λ$ Cold Dark Matter ($Λ$CDM) framework by incorporating metric $f(R)$ gravity in the Jordan frame. In this model, the dark energy component arises from a non-minimally coupled scalar field, decomposed into a smooth background (set to unity to recover General Relativity) and a rapidly varying, massive fluctuation that decays into the dark matter sector. In the near-GR limit, this setup provides a phenomenological extension of $Λ$CDM characterized by two additional parameters: the present-day value of the scalar fluctuation and a normalized decay rate. Using a Markov Chain Monte Carlo analysis of low-redshift cosmological data, comprising Type Ia Supernovae, Baryon Acoustic Oscillation (BAO), and Cosmic Chronometer measurements, we find that the proposed model achieves a better overall fit than $Λ$CDM, while the Bayesian evidence remains statistically inconclusive given the inclusion of two extra parameters. The model predicts a moderate increase in the inferred value of $H\\_0$ and an improved consistency with DESI BAO data when adopting the SH0ES prior. Furthermore, describing dark matter particle creation as a transition phase in the late Universe offers an intriguing physical interpretation, potentially capturing features already present in current data and providing a promising avenue to explore extensions of the standard cosmological model within modified gravity frameworks.\n\n", "2512.20037": "2025-12-23, **Microlensing Black Hole Shadows-II: Constraining Primordial Black Hole Dark Matter using the photon rings of M87 and Sgr A***, Himanshu Verma et.al., [2512.20037v1](http://arxiv.org/abs/2512.20037v1)\n\n The resolution of photon rings of Sgr~A$^*$ and M87 is the next milestone of upcoming EHT-like interferometries. We extend the formalism developed in our previous work~\\cite{Verma:2023hes} to constrain primordial black hole (PBH) dark matter using microlensing-induced distortions of black hole shadows. Building upon the theoretical framework for microlensing of photon rings, we apply this methodology to both Sgr A* and M87, considering multiple PBH populations: (i) PBH dark matter spikes around central supermassive black holes, (ii) NFW halo contributions in the Milky Way and M87 galaxies, and (iii) foreground Milky Way PBH dark matter affecting M87* observations. The microlensing signal manifests as a time-dependent asymmetry and deformation of the photon ring, providing the most sensitive observable for lensing effects. We assess the detectability of these signatures with future EHT-like interferometers. Our analysis reveals that M87* provides the strongest constraints on PBH dark matter. We show that the absence of photon-ring asymmetries in observations with angular resolution of order $0.1\\,μ{\\rm as}$ can constrain PBHs in the mass range $10^{-5}\\,M\\_\\odot \\lesssim M\\_{\\rm PBH} \\lesssim 10^{6}\\,M\\_\\odot$, with maximal sensitivity near $M\\_{\\rm PBH}\\sim10^{3}\\,M\\_\\odot$, for PBH dark matter fractions as small as $f\\_{\\rm PBH}\\sim10^{-2}$.\n\n", "2512.19787": "2025-12-22, **K-DRIFT Science Theme: Illuminating the Next Era of Galaxy Cluster Science**, Jaewon Yoo et.al., [2512.19787v1](http://arxiv.org/abs/2512.19787v1)\n\n The KASI Deep Rolling Imaging Fast Telescope (K-DRIFT) is a pioneering instrument designed to explore low-surface-brightness (LSB) phenomena. This white paper presents a compelling array of science cases that showcase K-DRIFT's unique capabilities in unraveling the mysteries of intracluster light (ICL) and other LSB components within galaxy clusters. Exploring the origin of ICL in galaxy clusters and comparing the spatial distributions of ICL and dark matter will offer new insights into galaxy cluster dynamics. Moreover, investigating LSB objects in galaxy clusters, such as LSB structures in the brightest cluster galaxy, ultra-diffuse galaxies, and tidal features, will enhance our understanding of galaxy evolution within the cluster environment. We present our strategies for addressing scientific queries, encompassing LSB observation and analysis techniques, specialized simulations, and machine-learning approaches. Additionally, we examine the potential synergies between K-DRIFT and other ongoing or forthcoming multi-wavelength surveys. This white paper advocates for the recognition and support of K-DRIFT as a dedicated tool for advancing our understanding of the universe's subtlest phenomena.\n\n", "2512.19783": "2025-12-22, **SN 2025ogs: A Spectroscopically-Normal Type Ia Supernova at z = 2 as a Benchmark for Redshift Evolution**, M. R. Siebert et.al., [2512.19783v1](http://arxiv.org/abs/2512.19783v1)\n\n The Nancy Grace Roman Space Telescope will provide a revolutionary measurement of the Universe's expansion kinematics, driven by dark matter and dark energy, out to $z \\approx 3$. The accuracy of this measurement is predicated on the assumption that standardized Type Ia supernova (SN Ia) luminosities do not evolve with redshift. If present, SN Ia luminosity evolution is expected to be most detectable in the dark matter-dominated era of the Universe ($z \\gtrsim 1.5$), with its effects becoming more easily distinguishable from dark energy variation at increasing redshift. We present JWST NIRCam and NIRSpec observations of SN 2025ogs, a normal SN Ia at $z = 2.05 \\pm 0.01$. This SN offers a key point of comparison for interpreting future high-redshift SN Ia samples. The NIRCam light curve indicates a blue color ($B - V = -0.27 \\pm 0.06$ mag) and a moderately fast decline ($Δm\\_{15}(B) = 1.55 \\pm 0.15$ mag), both within standard criteria for inclusion in cosmological analyses. Its luminosity distance is in $1.0σ$ agreement with a standard flat $Λ$CDM model, as well as with current cosmological constraints from the Dark Energy Survey (DES 5yr) and Pantheon+. The NIRSpec spectrum displays all of the hallmark absorption features of a normal SN Ia observed at peak brightness. We find that the rest-frame optical color, rest-frame near-ultraviolet properties, and Si II line strengths are all consistent with the moderately fast decline inferred from the light curve. Multiple absorption features (Ca II H&K, O I $\\lambda7774$, and the Ca II NIR triplet) all appear at a lower blueshift relative to a sample of low-$z$ SNe Ia. Together, these results suggest that SN Ia standardization remains robust at $z \\approx 2$, and also highlight the importance of JWST spectroscopy for uncovering evolutionary effects that could impact Roman's high-precision cosmology.\n\n", "2512.19666": "2025-12-22, **A cosmologist's take on Little Red Dots**, Valerio De Luca et.al., [2512.19666v1](http://arxiv.org/abs/2512.19666v1)\n\n The James Webb Space Telescope (JWST) has uncovered a population of compact, high-redshift sources, the Little Red Dots (LRDs), which may host supermassive black holes (BHs) significantly heavier than their stellar content compared with local scaling relations. These objects challenge standard models of early galaxy formation and may represent an extreme class of early BH hosts. In this paper, we investigate whether these BHs could have a primordial origin. We first show that the direct formation of these BH masses in the early Universe is excluded by stringent CMB $μ$-distortion limits. We then investigate the assembly of massive BHs from lighter, observationally allowed primordial black holes (PBHs) via hierarchical mergers, finding that, although this channel can operate depending on the merger history, it faces challenges in explaining the observations due to the rarity of the required high-redshift dark matter halos. Finally, we estimate gas accretion onto intermediate-mass PBHs, while jointly tracking metallicity evolution, and identify regions of parameter space in which such growth could reproduce the observed properties of LRDs. As a special case, we focus on the strongly lensed source QSO1, whose extremely low metallicity and large mass provide a stringent test of these formation channels.\n\n", "2512.19636": "2025-12-22, **Heavy neutral bosons and dark matter in the 3-3-1 model with axionlike particle**, T. T. Hieu et.al., [2512.19636v1](http://arxiv.org/abs/2512.19636v1)\n\n We consider heavy neutral bosons in the 3-3-1 model with axionlike particles (331ALP), including the Higgs boson and the $Z^\\prime$ boson which are outside the standard model (SM). Based on gluon-gluon fusion at the LHC, we investigate the signals of cross-sections in the parameter space region satisfying the current experimental limits of lepton flavor violating decay, including processes involving both charged leptons and Higgs boson, and provide predictions of $m\\_{h\\_2}\\geq 600 ~\\mathrm{GeV}$. A new gauge boson, labeled as $Z^{\\prime}$, is predicted $m\\_{Z^{\\prime}}\\geq 5.1 ~\\mathrm{TeV}$ based on the search for high-mass dilepton resonances at ATLAS and CMS. We also introduced the symmetry group $U(1)\\_{\\mathcal{N}}\\otimes \\mathcal{Z}\\_2^\\prime$ into the model to indicate dark matter candidates. Investigating the relic density of dark matter within experimentally permissible limits, we established a relationship between the mass of dark matter and the breaking scale of axion.\n\n", "2512.19633": "2025-12-22, **InterACTing dark radiation models after ACT**, William Cvetko et.al., [2512.19633v1](http://arxiv.org/abs/2512.19633v1)\n\n In this work we assess the implications of the Atacama Cosmology Telescope DR6 measurements for two interacting dark radiation scenarios previously shown to mitigate the Hubble tension. The first model, Wess-Zumino dark radiation (WZDR), features a mass threshold in the dark sector that induces a step-like reduction in the dark radiation abundance as the dark temperature evolves. The second model, new atomic dark matter (nuADaM), introduces dark radiation that remains coupled to a subcomponent of dark matter until shortly before matter-radiation equality. Earlier analyses using Planck data demonstrated that these interactions significantly relax constraints on the dark radiation density and allow values of $H\\_0$ consistent with local distance-ladder determinations. Incorporating ACT DR6, which extends CMB measurements deep into the high-$\\ell$ damping tail, we find that constraints on the additional radiation component tighten substantially in both scenarios, closing most of the parameter space that previously enabled higher values of $H\\_0$. We further analyze a generalized model including both free-streaming and self-interacting dark radiation, and show that the resulting constraints are consistent with ACT's findings for the limiting cases of purely free-streaming or purely self-interacting radiation. Overall, ACT DR6 significantly restricts interacting dark radiation as a solution to the Hubble tension.\n\n", "2512.19592": "2025-12-22, **Constraints on Solar Reflected Dark Matter from a combined analysis of XENON1T and XENONnT data**, XENON Collaboration et.al., [2512.19592v1](http://arxiv.org/abs/2512.19592v1)\n\n We report on a search for sub-GeV dark matter upscattered via the solar reflection mechanism in the heavy mediator scenario. Under the Standard Halo Model, keV to MeV dark matter produces nuclear recoils with energies below the detection threshold of liquid xenon time projection chambers. We enhance sensitivity to low-mass dark matter by considering dark matter-electron scattering, employing dedicated event selections to reduce the detection threshold, and exploiting the additional kinetic energy imparted to the dark matter particle by solar upscattering. Using XENON1T ionization-only and XENONnT low-energy electronic recoil datasets, we exclude previously unconstrained DM-electron scattering cross section for masses between $4.6\\, \\text{keV/}c^2$ and $20\\, \\text{keV/}c^2$, and between $0.2\\, \\text{MeV/}c^2$ and $2\\, \\text{MeV/}c^2$, reaching a minimum of $3.41\\times10^{-39}\\, \\text{cm}^2$ for a mass of $0.3\\, \\text{MeV/}c^2$ at 90\\% confidence level.\n\n", "2512.19476": "2025-12-22, **Analytical study of birefringent cavities for axion-like dark matter search**, Tadashi Kuramoto et.al., [2512.19476v1](http://arxiv.org/abs/2512.19476v1)\n\n Light polarization plays a crucial role in optical-cavity experiments; however, mirror birefringence presents a significant challenge that must be addressed carefully. In this study, a rigorous, nonperturbative framework is developed to quantify birefringence effects by incorporating variations in reflectance and polarization misalignment. We analyze the impact of this framework on the sensitivity of axion-like particle (ALP) dark-matter searches. The results show that both birefringence and misalignment contribute to sensitivity degradation in the low-mass regime; however, the adverse effects of misalignment can be mitigated by selecting a postselection angle greater than the misalignment angle. Furthermore, birefringence produces an additional resonance peak in the high-mass region, which remains largely unaffected by misalignment and postselection variations. This rigorous framework underscores the importance of considering birefringence in high-precision optical-cavity experiments for ALP detection.\n\n", "2512.19463": "2025-12-22, **Double Resonance Strategy for Interferometric Detection of Axions**, Spencer Green et.al., [2512.19463v1](http://arxiv.org/abs/2512.19463v1)\n\n We propose a double-resonant interferometric strategy for axion dark matter detection that combines microwave circuit resonance with Fabry--Pérot optical enhancement. In a strong magnetic field, axion--photon mixing induces a weak oscillating electric field, which is first amplified by a resonant circuit and then transduced into an optical phase shift via the electro-optic effect. Multiple coherent optical passes through the electro-optic medium accumulate this phase shift, enabling interferometric readout using mature optical techniques. We present the basic operating principle, discuss material requirements, and estimate the achievable sensitivity. For representative parameters, the projected reach extends into the parameter space of well-motivated QCD axion models.\n\n", "2512.19298": "2025-12-22, **Search for Axion-Like Particles from Nearby Pre-Supernova Stars**, Saurabh Mittal et.al., [2512.19298v1](http://arxiv.org/abs/2512.19298v1)\n\n Axion-like particles (ALPs) are hypothetical pseudoscalar bosons that arise in many extensions of the Standard Model and are well-motivated dark matter candidates. Nearby massive stars in the late stages of stellar evolution provide a promising environment for enhanced ALP production due to their high core temperatures and densities. We search for a combined signal of ALP-induced hard X-ray and soft $γ$-ray emission from 18 nearby pre-supernova stars using the full public 22-year INTEGRAL/SPI dataset, construct individual stellar spectra and link them in a coherent analysis. A maximum-likelihood approach is used to extract fluxes in the 20--2000 keV energy range. Stellar evolution models are employed to obtain the expected spectral shapes of ALP production processes peaking between 50--500 keV, depending on stellar mass and evolutionary stage. We construct a joint likelihood that incorporates uncertainties in stellar parameters to derive combined constraints on the coupling constants $g\\_{aγ}$ and $g\\_{ae}$ as a function of the ALP mass $m\\_a$. The hard X-ray and soft $γ$-ray fluxes of all selected stars are consistent with zero within uncertainties. We provide upper limits on the continuum emission and on the 511 keV and 1809 keV line fluxes. The combined upper limit on $g\\_{aγ} \\times g\\_{ae}$ is $(0.008 - 2) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) while the ALP-photon coupling is constrained to $g\\_{aγ} = (0.13 - 1.26) x 10^{-11}$ GeV$^{-1}$ (95% C.I.) for $m\\_a\\leqq10^{-11}$ eV, depending on the time to core collapse and magnetic field assumptions. Conservative limits of $(0.27 - 1.25) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) are obtained assuming all but one star are in the early He-burning phase. These results rank among the strongest limits on ALP couplings to date and demonstrate the importance of soft $γ$-ray observations for probing ALPs and massive star evolution.\n\n", "2512.19042": "2025-12-22, **Bose-Einstein Condensate dark matter with logarithmic nonlinearity**, Zahra Haghani et.al., [2512.19042v1](http://arxiv.org/abs/2512.19042v1)\n\n If dark matter is composed of massive bosons, a Bose-Einstein Condensation process must have occurred during the cosmological evolution. Therefore, galactic dark matter may be in a form of a self-gravitating condensate, in the presence of self-interactions. We consider the possibility that the self-interacting potential of the condensate dark matter is of the logarithmic form. In order to describe the condensate dark matter we use the Gross-Pitaevskii equation with a logarithmic nonlinearity, and the Thomas-Fermi approximation. With the use of the hydrodynamic representation of the Gross-Pitaevskii equation we obtain the equation of state of the condensate, which has the form of the ideal gas equation of state, with the pressure proportional to the dark matter density. The basic equation describing the density distribution of the static condensate is derived, and its solution is obtained in the form of a series solution, constructed with the help of the Adomian Decomposition Method. To test the model we consider the properties of the galactic rotation curves in the logarithmic Bose-Einstein Condensate dark matter scenario, by using a sample from the Spitzer Photometry and Accurate Rotation Curves (SPARC) data. The fit of the theoretical predictions of the rotation curves with the observational data indicate that the logarithmic Bose-Einstein Condensate dark matter model gives an acceptable description of the SPARC data, and thus it may be considered as a possible candidate for the in depth understanding of the dark matter properties.\n\n", "2512.19041": "2025-12-22, **Gravitational Production of Massive Spin-2 Particles During Reheating**, Sarunas Verner et.al., [2512.19041v1](http://arxiv.org/abs/2512.19041v1)\n\n We study the minimal gravitational portal for a massive spin-2 dark matter candidate $X\\_{μν}$ produced during perturbative reheating. The dark sector couples to the visible sector only via gravity, and we analyze two unavoidable channels: (i) inflaton condensate annihilation, $φ+φ\\to X+X$, and (ii) thermal scatterings, ${\\rm SM}+{\\rm SM}\\to X+X$, both mediated by graviton exchange. Working in the Fierz-Pauli framework for a free massive spin-2 field of mass $m\\_2$, we derive the graviton-mediated amplitudes and perform a full helicity decomposition of the final state. The relic abundance is obtained analytically in terms of $m\\_2$ and the reheating temperature $T\\_{\\rm RH}$. In the light mass regime $m\\_2 \\ll m\\_φ$ (with $m\\_φ$ the inflaton mass during oscillations), production is overwhelmingly dominated by the longitudinal (helicity-0) mode: the $2\\to2$ cross section is parametrically enhanced, scaling as $\\sim (m\\_φ/m\\_2)^4$, and yields efficient dark matter production despite purely gravitational couplings. Compared to lower-spin cases (spin-$0$, $1/2$, $1$, and $3/2$), massive spin-$2$ production is substantially more efficient for the same reheating history. Over most of the parameter space the inflaton condensate channel dominates the yield, while the thermal contribution is negligible. Avoiding overproduction typically requires either a relatively low $T\\_{\\rm RH}$ or a spin-$2$ mass near threshold, $m\\_2 \\lesssim m\\_φ$. This places the spin-$2$ portal on similar footing to other higher spins in reheating scenarios, while emphasizing the central role of the helicity-$0$ mode and the reheating history in setting the dark matter density.\n\n", "2512.18960": "2025-12-22, **Searching for Ultralight Dark Matter with M{ö}ssbauer Resonance**, Peng-Long Zhang et.al., [2512.18960v1](http://arxiv.org/abs/2512.18960v1)\n\n We investigate the feasibility of probing the interaction between ultralight scalar dark matter and atomic nuclei using a stationary Mossbauer spectroscopy scheme. The exceptional energy resolution of the Mossbauer resonance enables testing nuclear energy shifts arising from the local dark matter field. In principle, a stationary measurement allows faster data acquisition and becomes advantageous at higher dark matter masses in the range 10^{-15} - 10^{-8} eV. We present the projected sensitivity to the dark matter parameter space for three candidate Mossbauer isotopes, Ag-109, Sc-45, and Zn-67. Among them, Ag-109 provides the highest sensitivity, followed by Zn-67. For Ag-109, the scalar dark matter photon coupling f\\_gamma^{-1} can be constrained down to the level of 10^{-18} GeV^{-1}}, exceeding the sensitivity of several existing experiments. The scalar dark matter gluon coupling f\\_g^{-1} can be probed down to 10^{-21} GeV^{-1}, while the scalar dark matter quark coupling y\\_d can reach approximately 10^{-22} GeV^{-1}. These results demonstrate that Mossbauer based techniques offer a promising and competitive approach for probing ultralight dark matter interactions with Standard Model particles.\n\n", "2512.18959": "2025-12-22, **Scalar-Mediated Inelastic Dark Matter as a Solution to Small-Scale Structure Anomalies**, Zihan Wang et.al., [2512.18959v1](http://arxiv.org/abs/2512.18959v1)\n\n We propose a scalar-mediated Self-Interacting Dark Matter (SIDM) model to address small-scale structure anomalies such as the core-cusp and diversity problems. The model is composed by a leptophilic scalar mediator and a pseudo-Dirac dark matter candidate with a mass splitting of 100 eV.We imposed aA dark discrete $\\mathbb{Z}\\_2$ symmetry forbids tree-level elastic scattering. Therefore creates kinematic threshold that suppresses scattering in ultra-faint satellite galaxies while enabling large self-interaction cross-sections in dwarf galaxies via resonant enhancement. To satisfy Big Bang Nucleosynthesis (BBN) requirements, we introduce a dimension-5 magnetic dipole operator that enable the decay of the excited state ($χ\\_2 \\rightarrow χ\\_1 γ$). This operator also provides a unique, low-threshold signal for direct detection experiments, characterized by a distinct $1/E\\_R$ recoil spectrum. We identify a benchmark parameter space around ($m\\_χ\\approx 40$ GeV, $m\\_φ\\approx 20$ MeV) where non-perturbative coupled-channel dynamics successfully reconcile astrophysical observations with cosmological bounds, including CMB constraints on annihilation.\n\n"}, "supernova": {"2512.20616": "2025-12-23, **Dynamical Dark Energy models in light of the latest observations**, Javier de Cruz Pérez et.al., [2512.20616v1](http://arxiv.org/abs/2512.20616v1)\n\n In this paper, we study several models and parameterizations of dynamical dark energy (DE) that have been studied already in the past, in conjunction with the recently proposed model $w$XCDM, the running vacuum model (RVM) with and without a threshold at $z=1$ and two variants of it, the RRVM and the ``flipped RVM'', and compare them all with the concordance $Λ$CDM model and the popular $w\\_0w\\_a$CDM parameterization. We use two standard sets of cosmological data, one including distant supernovae from Pantheon$+$ and the other from DES-Y5. The rest of the data (BAO from DESI DR2 and CMB from Planck PR4) are shared by the two sets. They are analyzed with the help of \\texttt{CLASS}. No structure formation data are utilized for this analysis and no use is made of the SH0ES calibration of $H\\_0$. Even so, we find that the flipped RVM and to a lesser extent the $w$XCDM and the RVM with threshold, point to significant evidence of dynamical DE, at a level comparable to $w\\_0w\\_a$CDM, more conspicuously for the dataset that involves DES-Y5 observations. We also find that while more traditional models studied in the past, in which there is an exchange between vacuum energy and cold dark matter (through e.g. an interactive source proportional either to the density of dark matter or to that of vacuum) still hint at dynamical DE, the strength of the statistical signal (which we assess through information criteria and other estimators) is nevertheless less pronounced. Finally, we discuss the ability of the various models to explain the data by performing an analysis of their effective equation-of-state parameters and corresponding evolution of their dark energy densities.\n\n", "2512.20416": "2025-12-23, **From Cosmology to Cosmonomy**, Emmanuel N. Saridakis et.al., [2512.20416v1](http://arxiv.org/abs/2512.20416v1)\n\n For most of its history, cosmology was a qualitatively constrained discourse on the universe, shaped by limited observational access and the absence of global dynamical laws. This situation has changed decisively in recent decades. Modern cosmology is now driven by an unprecedented flow of high-precision data from a wide range of independent probes, including the cosmic microwave background, large-scale structure, supernovae, baryon acoustic oscillations, gravitational lensing, cosmic chronometers, redshift-space distortions, gravitational-wave standard sirens, and emerging 21-cm observations, among others. This observational wealth is matched by a concrete theoretical and mathematical framework, based on general relativity, which provides the dynamical equations governing the evolution of spacetime and matter at cosmic scales. Combined with explicit background and perturbative equations, this framework enables quantitative, predictive, and falsifiable descriptions of cosmic evolution. Thus, cosmology operates today as a nomological natural science of the observable universe, characterized by general laws, predictive power, and systematic empirical testing. We argue that this epistemic transformation motivates a corresponding conceptual shift, directly analogous to the historical transition from astrology to astronomy. In this sense, the transition from cosmology to \\emph{cosmonomy} should begin to be discussed among cosmologists, or, more precisely, among cosmonomers.\n\n", "2512.20383": "2025-12-23, **A Spectrum of Cosmological Rips and Their Observational Signatures**, Mikel Artola et.al., [2512.20383v1](http://arxiv.org/abs/2512.20383v1)\n\n We present a unified dark energy framework capable of generating a continuous spectrum of cosmological ``rip'' scenarios -- including the Big Rip, Grand Rip, Mild Rip, Little Rip, Little Sibling of the Big Rip, and the newly found Dollhouse Rip -- while ensuring a physically consistent evolution across cosmic history. Building on earlier phenomenological proposals, we introduce a barotropic equation-of-state parameter with a sigmoid-like correction to guarantee a strictly positive dark energy density and to avoid early-time pathologies commonly present in previous models. Using this formulation, closed-form analytic expressions for the energy density can be obtained. This, in turn, enables a systematic classification of future singularities based on the signs and magnitudes of two key parameters of the model. We test these scenarios with state-of-the-art cosmological probes, including DESI DR2 BAO, cosmic chronometers, CMB compressed likelihoods, and the Pantheon+ supernovae sample. According to our Bayesian analysis, all rip scenarios yield best-fit parameters compatible with $Λ$CDM at the $1σ$ level, with Bayes factors weakly favoring $Λ$CDM. The mild, logarithmic evolution of the proposed dark energy density prevents current observations from distinguishing among the different future fates. We conclude that, for rip cosmologies to gain observational support over $Λ$CDM, they must display more accentuated late-time dynamical features -- such as perhaps rapid transitions or a phantom-divide crossing -- within the redshift range probed by present surveys.\n\n", "2512.20193": "2025-12-23, **Decay of $f(R)$ quintessence into dark matter: mitigating the Hubble tension?**, Giovanni Montani et.al., [2512.20193v1](http://arxiv.org/abs/2512.20193v1)\n\n We propose a revised cosmological scenario that extends the $Λ$ Cold Dark Matter ($Λ$CDM) framework by incorporating metric $f(R)$ gravity in the Jordan frame. In this model, the dark energy component arises from a non-minimally coupled scalar field, decomposed into a smooth background (set to unity to recover General Relativity) and a rapidly varying, massive fluctuation that decays into the dark matter sector. In the near-GR limit, this setup provides a phenomenological extension of $Λ$CDM characterized by two additional parameters: the present-day value of the scalar fluctuation and a normalized decay rate. Using a Markov Chain Monte Carlo analysis of low-redshift cosmological data, comprising Type Ia Supernovae, Baryon Acoustic Oscillation (BAO), and Cosmic Chronometer measurements, we find that the proposed model achieves a better overall fit than $Λ$CDM, while the Bayesian evidence remains statistically inconclusive given the inclusion of two extra parameters. The model predicts a moderate increase in the inferred value of $H\\_0$ and an improved consistency with DESI BAO data when adopting the SH0ES prior. Furthermore, describing dark matter particle creation as a transition phase in the late Universe offers an intriguing physical interpretation, potentially capturing features already present in current data and providing a promising avenue to explore extensions of the standard cosmological model within modified gravity frameworks.\n\n", "2512.19886": "2025-12-22, **Detecting Strongly-Lensed Supernovae in Wide-field Space Telescope Imaging via Deep Learning**, Fawad Kirmani et.al., [2512.19886v1](http://arxiv.org/abs/2512.19886v1)\n\n Gravitationally lensed supernovae (SNe) are extremely rare and fade quickly; as a result, they are challenging to detect. To identify lensed SNe in large imaging datasets, current surveys primarily rely on the {\\it magnification} effect of gravitational lensing -- searching for transients that appear brighter than expected \\cite{c3}. In this work, we present a proof-of-concept study that uses a deep neural network to classify previously detected transients. Instead of relying on magnification, this network aims to identify doubly-imaged SNe with small separations ($<0.6$ arcsec) based on the {\\it distorted shape} of the transient object. This proposed method is most applicable to space-based imaging surveys from wide-field imaging observatories such as the upcoming Roman Space Telescope. To train and test our network, we use archival Hubble Space Telescope (HST) imaging surveys. Due to the extreme rarity of lensed SNe, we cannot train a neural network on actual lensed SN data. Instead, we have used HST imaging data to generate simulated imaging datasets for both training and testing. Our simulations use astrophysical priors to define the separations, relative brightnesses, and colors of each multiply-imaged SN. We have also simulated false positives (image artifacts and unlensed supernovae), which are much more prevalent than true lensed SN. Our deep learning model is trained to identify lensed SNe from a single difference image (i.e., not using multiple epochs). This network achieves a recall score of 99\\% on simulated gravitationally lensed SNe. The network successfully distinguishes between single supernovae (SNe) and those with gravitationally lensed SNe, as well as images with zero SNe, achieving recall scores of 90\\% and 96\\% for single-SNe and zero-SNe images, respectively.\n\n", "2512.19783": "2025-12-22, **SN 2025ogs: A Spectroscopically-Normal Type Ia Supernova at z = 2 as a Benchmark for Redshift Evolution**, M. R. Siebert et.al., [2512.19783v1](http://arxiv.org/abs/2512.19783v1)\n\n The Nancy Grace Roman Space Telescope will provide a revolutionary measurement of the Universe's expansion kinematics, driven by dark matter and dark energy, out to $z \\approx 3$. The accuracy of this measurement is predicated on the assumption that standardized Type Ia supernova (SN Ia) luminosities do not evolve with redshift. If present, SN Ia luminosity evolution is expected to be most detectable in the dark matter-dominated era of the Universe ($z \\gtrsim 1.5$), with its effects becoming more easily distinguishable from dark energy variation at increasing redshift. We present JWST NIRCam and NIRSpec observations of SN 2025ogs, a normal SN Ia at $z = 2.05 \\pm 0.01$. This SN offers a key point of comparison for interpreting future high-redshift SN Ia samples. The NIRCam light curve indicates a blue color ($B - V = -0.27 \\pm 0.06$ mag) and a moderately fast decline ($Δm\\_{15}(B) = 1.55 \\pm 0.15$ mag), both within standard criteria for inclusion in cosmological analyses. Its luminosity distance is in $1.0σ$ agreement with a standard flat $Λ$CDM model, as well as with current cosmological constraints from the Dark Energy Survey (DES 5yr) and Pantheon+. The NIRSpec spectrum displays all of the hallmark absorption features of a normal SN Ia observed at peak brightness. We find that the rest-frame optical color, rest-frame near-ultraviolet properties, and Si II line strengths are all consistent with the moderately fast decline inferred from the light curve. Multiple absorption features (Ca II H&K, O I $\\lambda7774$, and the Ca II NIR triplet) all appear at a lower blueshift relative to a sample of low-$z$ SNe Ia. Together, these results suggest that SN Ia standardization remains robust at $z \\approx 2$, and also highlight the importance of JWST spectroscopy for uncovering evolutionary effects that could impact Roman's high-precision cosmology.\n\n", "2512.19568": "2025-12-22, **On the Metric $f(R)$ gravity Viability in Accounting for the Binned Supernovae Data**, A. Valletta et.al., [2512.19568v1](http://arxiv.org/abs/2512.19568v1)\n\n In this work, two models of metric $f(R)$ gravity in the Jordan frame are investigated as a dynamical description of the late-time cosmic expansion using binned Type~Ia Supernovae data. The aim is to provide an explanation for the effective running of the Hubble constant observed in both the binned Pantheon Sample and the Master Sample. To this end, the effective running Hubble constant $\\mathcal{H}(z)$ is defined as the ratio between the modified Hubble parameter and that of the standard cosmological model ($Λ$CDM), multiplied by $H\\_0$. $\\mathcal{H}(z)$ serves as a diagnostic tool to capture deviations from the $Λ$CDM model.   The first model used is a general representation of metric $f(R)$ gravity in which the gravitational Lagrangian is encoded in an effective redshift-dependent function that mimics the evolution of the Hubble parameter. Due to the limited redshift range covered by the available Supernovae Data, this function can be reliably approximated by a second-order Taylor expansion.   While this more general formulation yields a phenomenological fit that is compatible with that of the $Λ$CDM for the binned Pantheon Sample, the model is not physically viable, as it generically leads to the emergence of an unphysical mass of the scalar field. This issue originates from an implicit restriction imposed on the Cauchy problem for the non-minimally coupled scalar field. To address this limitation, following previous studies, an additional condition on the modified Friedmann equation is introduced, enabling a fully consistent reformulation of the dynamics. The resulting framework not only preserves the agreement with Supernova~Ia data, but also provides a physical justification for the additional condition adopted in earlier analyses of late-time cosmological dynamics.\n\n", "2512.19565": "2025-12-22, **Do low-redshift observations open the doors to an open universe?**, Deng Wang et.al., [2512.19565v1](http://arxiv.org/abs/2512.19565v1)\n\n The detection of a significant deviation from a zero curvature would have profound consequences for inflationary theories and fundamental physics. Relative to high-redshift Planck's CMB measurements, indicating a $\\sim 2σ$ evidence for a closed universe, low-redshift observations of BAO and SN Ia have the advantages of weak dependence on early universe physics, independently observational systematics, and strong redshift dependence of distances in constraining the cosmic curvature. Using the integrated observations from DESI BAO and SN Ia, we find an unexpected $2σ$ evidence for an open universe, regardless of the SN Ia sample employed. When considering DESI, SN Ia and the acoustic scale $θ\\_\\star$ data, the preference for an open universe exceeds the $3σ$ level, reaching $5σ$ for the case of DESY5 Supernovae data. Therefore, low-redshift observations favor an open universe, and this preference persists even when alternative high-redshift priors are adopted. Our results point to the existence of an additional tension between high- and low-redshift observations, present also in non-flat models beyond the minimal $Λ$CDM scheme, thereby challenging the standard inflationary predictions.\n\n", "2512.19386": "2025-12-22, **Machine learning for the early classification of broad-lined Ic supernovae**, Laura Cotter et.al., [2512.19386v1](http://arxiv.org/abs/2512.19386v1)\n\n Science is currently at an age where there is more data than we know how to deal with. Machine learning (ML) is an emerging tool that is useful in drawing valuable science out of incomprehensibly large datasets, identifying complex trends in data that are otherwise overlooked. Moreover, ML can potentially enhance the quality and quantity of scientific data as it is collected. This paper explores how a new ML method can improve the rate of classification of rare Ic-BL supernovae (SNe). New parameters called magnitude rates were introduced to train ML models to identify SNe Ic-BL in large datasets. The same methodology was applied to a population of SN Ia transients to see if the methodology could be reproducible with another SN class. Three magnitudes, three time differences, two magnitude rates and the second derivative of these rates were calculated using the first three available photometric data points in a single filter. Initial investigations show that the Random Forest algorithm provides a strong foundation for the early classifications SNe Ic-BL and SNe Ia. Testing this model again on an unseen dataset shows that the model can identify upward of 13% of the total true SN Ic-BL population, significantly improving upon current methods. By implementing a dedicated observation campaign using this model, the number of SN Ic-BL classified and the quality of early-time data collected each year will see considerable growth in the near future.\n\n", "2512.19298": "2025-12-22, **Search for Axion-Like Particles from Nearby Pre-Supernova Stars**, Saurabh Mittal et.al., [2512.19298v1](http://arxiv.org/abs/2512.19298v1)\n\n Axion-like particles (ALPs) are hypothetical pseudoscalar bosons that arise in many extensions of the Standard Model and are well-motivated dark matter candidates. Nearby massive stars in the late stages of stellar evolution provide a promising environment for enhanced ALP production due to their high core temperatures and densities. We search for a combined signal of ALP-induced hard X-ray and soft $γ$-ray emission from 18 nearby pre-supernova stars using the full public 22-year INTEGRAL/SPI dataset, construct individual stellar spectra and link them in a coherent analysis. A maximum-likelihood approach is used to extract fluxes in the 20--2000 keV energy range. Stellar evolution models are employed to obtain the expected spectral shapes of ALP production processes peaking between 50--500 keV, depending on stellar mass and evolutionary stage. We construct a joint likelihood that incorporates uncertainties in stellar parameters to derive combined constraints on the coupling constants $g\\_{aγ}$ and $g\\_{ae}$ as a function of the ALP mass $m\\_a$. The hard X-ray and soft $γ$-ray fluxes of all selected stars are consistent with zero within uncertainties. We provide upper limits on the continuum emission and on the 511 keV and 1809 keV line fluxes. The combined upper limit on $g\\_{aγ} \\times g\\_{ae}$ is $(0.008 - 2) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) while the ALP-photon coupling is constrained to $g\\_{aγ} = (0.13 - 1.26) x 10^{-11}$ GeV$^{-1}$ (95% C.I.) for $m\\_a\\leqq10^{-11}$ eV, depending on the time to core collapse and magnetic field assumptions. Conservative limits of $(0.27 - 1.25) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) are obtained assuming all but one star are in the early He-burning phase. These results rank among the strongest limits on ALP couplings to date and demonstrate the importance of soft $γ$-ray observations for probing ALPs and massive star evolution.\n\n", "2512.19175": "2025-12-22, **DESI DR2 Constraints on the $R_h=ct$ Universe: Model Viability and Comparison with $Λ$CDM**, Amritansh Mehrotra et.al., [2512.19175v1](http://arxiv.org/abs/2512.19175v1)\n\n We carry out a comparative analysis of the standard $Λ$CDM cosmological model and the alternative $R\\_h=ct$ framework using recent observational data from cosmic chronometers, Type Ia supernova, and baryon acoustic oscillations. The study evaluates the ability of each model to reproduce the observed expansion history of the Universe through a joint statistical assessment based on the chi-squared statistics, Akaike Information Criterion (AIC), Bayesian Information Criteria (BIC), and Bayes factor. While both models yield acceptable fits, $Λ$CDM consistently attains lower information-criterion values and higher likelihood, indicating a superior overall performance. An examination of the redshift evolution of the Hubble parameter $H(z)$ and the deceleration parameter $q(z)$ shows that $Λ$CDM naturally captures the transition from early-time deceleration to late-time acceleration, where as $R\\_h=ct$ predicts a strictly linear expansion. We also estimate the age of the Universe within both models, finding that $Λ$CDM prediction agrees with the Planck 2018 result, while the linear expansion in $R\\_h=ct$ leads to an older cosmic age. Recent JWST observations of unexpectedly mature high-redshift galaxies have reopened the discussion regarding whether the Universe may be older than implied by the standard model; although these results remain under active investigation, they underscore that fully resolving cosmic evolution may require refinements beyond the concordance paradigm.\n\n", "2512.19077": "2025-12-22, **The First Model-Independent Upper Bound on Micro-lensing Signature of the Highest Mass Binary Black Hole Event GW231123**, Aniruddha Chakraborty et.al., [2512.19077v1](http://arxiv.org/abs/2512.19077v1)\n\n The recently discovered gravitational wave (GW) event, GW231123, is the highest mass binary black hole (BBH) merger detected to date by the LIGO-Virgo-KAGRA Collaboration. The inferred source masses of GW231123 lie in a mass range where stellar-progenitor black holes are rare to exist due to the pair instability supernovae mass gap, and hence alternative scenarios of origin of this inferred heavy mass black hole become important. One of such hypotheses of its origin is gravitational lensing that introduces modulations to the amplitude and phase of GWs and can make the inferred mass higher from the true value. In this work, we search for the lensing signatures from GW231123 and all other events in a model-independent approach using the technique \\texttt{$μ$-GLANCE} which carries out tests on its residual strain to look for common features across the detector network through cross-correlation and infers the lensing signal in a Bayesian framework. Our analysis tests yield no strong evidence in support for lensing, though it detects presence of potential residual in the data, which can be a micro-lensing signature with a modulation amplitude less than 0.8 at 95\\% C.I. However, our study finds that current waveform systematics for such heavy mass binary systems are large enough to shadow the detection of lensing from such short-duration GWs such as GW231123, and hence no concluding claim of lensing could be made at this stage. We conclude that if this event is lensed, then in near future, detection of similar lensed events will take place with current detector sensitivity and hence can open a potential discovery space of lensed GW signal with the aid of more accurate waveform models.\n\n", "2512.19066": "2025-12-22, **A Self-Consistent Hubble Expansion in f(T) Gravity model: Confrontation with Recent Observations**, K. S. Kavya et.al., [2512.19066v1](http://arxiv.org/abs/2512.19066v1)\n\n The accelerated expansion of the universe remains one of the most profound puzzles in modern cosmology, often attributed to dark energy within the framework of General Relativity. As an alternative, modified teleparallel gravity theories such as $f(T)$ gravity offer a purely geometric mechanism to explain cosmic acceleration. In this work, we construct a plane-symmetric anisotropic cosmological model in the framework of exponential $f(T)$ gravity, adopting the functional form $f(T) = T + u e^{-vT}$. A key novelty of this study is that the Hubble function $H(z)$ is derived self-consistently from the field equations rather than being prescribed phenomenologically. Furthermore, we provide the first comprehensive observational test of an anisotropic $f(T)$ model using a combination of DESI, gravitational-wave (GW) data, and complementary datasets including OHD, CMB, and Pantheon+SH0ES. Our best-fit analysis yields $70 \\lesssim H\\_0 \\lesssim 73~\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, $0.28 \\lesssim Ω\\_m \\lesssim 0.34$, and $-0.99 \\lesssim ω\\lesssim -0.69$, all consistent with current late-time cosmological observations. The model accurately reproduces the distance modulus of Type Ia supernovae and the luminosity-distance relation from gravitational-wave standard sirens. These results demonstrate that the proposed anisotropic exponential $f(T)$ model can account for the observed cosmic acceleration without invoking a dark-energy component, thereby offering a novel and observationally consistent framework for studying anisotropic extensions of gravity.\n\n"}}