{"neutrino": {"2507.17676": "2025-07-23, **Effect of Group-V Impurities on the Electronic Properties of Germanium Detectors: An Insight from First-Principles Calculations**, Sandip Aryal et.al., [2507.17676v1](http://arxiv.org/abs/2507.17676v1)\n\n The outstanding properties of high-purity germanium (HPGe) detectors, such as excellent energy resolution, high energy sensitivity, and a low background-to-signal ratio, make them essential and ideal candidates for detecting particle signatures in nuclear processes such as neutrino-less double beta decay. However, the presence of defects and impurities in HPGe crystals can lead to charge trapping, which affects carrier mobility and results in significant energy resolution degradation. In this work, we employ density functional theory with a hybrid functional to study the energetics of possible point defects in Ge. Our findings indicate that n-type group-V impurities, such as phosphorus (P), arsenic (As), and antimony (Sb), form more readily in Ge compared to nitrogen (N), Ge vacancies, and Ge interstitials. Unlike N dopants, which yield deep trap states, P, As, and Sb create shallow traps close to the conduction band edge of Ge. Furthermore, we predict that n-type defects can condense into defect complexes with Ge vacancies. These vacancy-impurity complexes form deep traps in Ge, similar to Ge vacancies, suggesting that both vacancies and vacancy-impurity complexes contribute to charge trapping in these detectors, thereby diminishing their performance.\n\n", "2507.17425": "2025-07-23, **Readout electronics for low occupancy High-Pressure Gas TPCs**, N. Khan et.al., [2507.17425v1](http://arxiv.org/abs/2507.17425v1)\n\n HPgTPCs have benefits such as low energy threshold, magnetisability, and 4$\\pi$ acceptance, making them ideal for neutrino experiments such as DUNE. We present the design of an FPGA-based solution optimised for ND-GAr, which is part of the Phase-II more capable near detector for DUNE. These electronics reduce the cost significantly compared to using collider readout electronics which are typically designed for much higher occupancy and therefore, for example, need much larger numbers of FPGAs and power per channel. We demonstrate the performance of our electronics with the TOAD at Fermilab in the US at a range of pressures and gas mixtures up to 4.5barA, reading out ~10000 channels from a multi-wire proportional chamber. The operation took place between April and July of 2024. We measure the noise characteristics of the system to be sufficiently low and we identify sources of noise that can be further mitigated in the next iteration. We also note that the cooling scheme used in the test requires improvement before full-scale deployment. Despite these necessary improvements, we show that the system can fulfil the needs of a HPgTPC for a fraction of the price of collider readout electronics.\n\n", "2507.17315": "2025-07-23, **Prospects for searching for sterile neutrinos in dynamical dark energy cosmologies using joint observations of gravitational waves and $γ$-ray bursts**, Lu Feng et.al., [2507.17315v1](http://arxiv.org/abs/2507.17315v1)\n\n In the era of third-generation (3G) gravitational-wave (GW) detectors, GW standard siren observations from binary neutron star mergers provide a powerful tool for probing the expansion history of the universe. Since sterile neutrinos can influence cosmic evolution by modifying the radiation content and suppressing structure formation, GW standard sirens offer promising prospects for constraining sterile neutrino properties within a cosmological framework. Building on this, we investigate the prospects for detecting sterile neutrinos in dynamical dark energy (DE) models using joint observations from 3G GW detectors and a future short gamma-ray burst detector, such as a THESEUS-like telescope. We consider three DE models: the $w$CDM, holographic DE (HDE), and Chevallier-Polarski-Linder (CPL) models. Our results show that the properties of DE can influence the constraints on sterile neutrino parameters. Moreover, the inclusion of GW data significantly improves constraints on both sterile neutrino parameters and other cosmological parameters across all three models, compared to the current limits derived from CMB+BAO+SN (CBS) observations. When GW data are included into the CBS dataset, a preference for $\\Delta N\\_{\\rm eff} > 0$ emerges at approximately the $1\\sigma$ level in the $w$CDM and CPL models, and reaches about $3\\sigma$ in the HDE model. Moreover, the upper limits on $m\\_{\\nu,{\\rm sterile}}^{\\rm eff}$ are reduced by approximately 13%, 75%, and 3% in the $w$CDM, HDE, and CPL models, respectively.\n\n", "2507.17283": "2025-07-23, **Pictorial and Documentary Guide for Research, Teaching, and Education through Astronomy, Physics, and Mathematics Pursued under the Umbrella of the United Nations (1974-2024)**, Hans J. Haubold et.al., [2507.17283v1](http://arxiv.org/abs/2507.17283v1)\n\n This paper was prepared for Open-Access-only publication as a guide reporting on Education (all aspects of space science and technology), Teaching (remote sensing and GIS, satellite meteorology and global climate, satellite communication, space and atmospheric sciences, global navigation satellite systems), and Research (solar neutrino problem, formation of structure in the Universe) in astronomy (solar physics, cosmology), physics (nuclear physics, neutrino physics), and mathematics (fractional calculus, special functions of mathematical physics) exercised over 50 years (1974-2024). In this period, more than twenty workshops were held and seven regional centres for space science and technology education were established in all regions of the world: Asia and the Pacific, Latin America and the Caribbean, Africa, Western Asia, and Europe. This effort was undertaken in cooperation with ESA, NASA, JAXA, and 193 member states of the United Nations under the auspices of the UN, also supported by the Committee on Space Research (COSPAR) and the International Astronomical Union (IAU). The paper provides access to most of the documents in the six official languages of the United Nations (Arabic, Chinese, English, French, Russian, and Spanish), proceedings, and published papers and books focusing on education, teaching, and research (listed in Google Scholar and Research Gate).\n\n", "2507.17266": "2025-07-23, **End-to-end reconstruction of ultra-high energy particle observables from radio detection of extensive air showers**, Kewen Zhang et.al., [2507.17266v1](http://arxiv.org/abs/2507.17266v1)\n\n The radio detection of very inclined air showers offers a promising avenue for studying ultra-high-energy cosmic rays (UHECRs) and neutrinos. Accurate reconstruction methods are essential for investigating the properties of primary particles. Recently, we developed an analytical least-squares method to reconstruct the electric field using three polarization components. The reconstruction yields no bias, with a 68\\% confidence interval of [-0.02, 0.02], and a standard deviation of 0.04. Using this reconstructed electric field, we perform a realistic reconstruction of the the properties of primary particles. We employ a spherical wave model combined with an angular distribution function (ADF) for arrival direction reconstruction, achieving an angular resolution of 0.04$^\\circ$. This paper also presents an energy reconstruction in which we account for the effects of geosynchrotron radiation in inclined air showers, we implement an air density correction in the energy reconstruction, resulting in a 10\\% resolution in energy estimation. These findings demonstrate the reliability and effectiveness of our reconstruction methodology, paving the way for future detection experiments using sparse antenna arrays.\n\n", "2507.16987": "2025-07-22, **Beyond the Veil: Charting WIMP Territories at the Neutrino Floor**, Giorgio Arcadi et.al., [2507.16987v1](http://arxiv.org/abs/2507.16987v1)\n\n We establish comprehensive theoretical benchmarks for Weakly Interacting Massive Particles (WIMPs) accessible to ultimate direct detection experiments, focusing on the challenging parameter space between current experimental limits and the irreducible neutrino background. We systematically examine both thermal freeze-out and freeze-in production mechanisms across a range of simplified dark matter models, including s-channel scalar and vector portals, t-channel mediator scenarios, and electroweakly interacting multiplets. For thermal relics, we identify parameter regions where suppressed direct detection cross-sections naturally arise through momentum-dependent interactions and blind-spot configurations, while maintaining the correct relic abundance. We extensively investigate freeze-in scenarios, demonstrating how feebly interacting massive particles (FIMPs) in portal models can populate experimentally accessible parameter space despite their ultra-weak couplings. Additionally, we explore how non-standard cosmological histories including early matter domination and fast-expanding Universe scenarios can dramatically alter the relationship between relic density and detection prospects, opening new avenues for discovery. Our analysis provides a roadmap for next-generation experiments approaching the neutrino floor, highlighting complementary detection strategies and identifying the most promising theoretical targets for ultimate sensitivity dark matter searches. These benchmarks establish the theoretical foundation for the final push toward comprehensive coverage of well-motivated WIMP parameter space.\n\n", "2507.16929": "2025-07-22, **Polarisation as a probe of neutrino emission from blazars**, G. F. Paraschos et.al., [2507.16929v1](http://arxiv.org/abs/2507.16929v1)\n\n The source of extragalactic neutrinos in the TeV-PeV range is a matter of very active research, with blazar jets having been postulated to be the origin of at least some of the detections. The blazar PKS 0735+178 is a prominent example; during its multi-band flare in late 2021 a neutrino event was reported by four observatories, with its origin consistent with the direction of that source. While no new jet component was observed to be ejected during that narrow time-frame, our analysis shows that a propagating shock front originating from the core region was the likely source of the multi-band flare, using very-long-baseline interferometry images of PKS 0735+178 in polarised light. Taken together, our findings are suggestive of a coherent scenario in which the shock may contribute to the acceleration of protons, with the target photons potentially originating either from the ambient medium surrounding the jet or from proton synchrotron radiation. The necessary conditions for neutrino emission via proton-photon interactions are, hence, present in this jet.\n\n", "2507.16891": "2025-07-22, **Vacuum muon decay and interaction with laser pulses**, B. King et.al., [2507.16891v1](http://arxiv.org/abs/2507.16891v1)\n\n Muons decay in vacuum mainly via the leptonic channel to an electron, an electron neutrino and a muon antineutrino. Previous investigations have concluded that muon decay can only be significantly altered in a strong electromagnetic field when the muonic strong-field parameter is of order unity, which is far beyond the reach of lab-based experiments at current and planned facilities. In this letter, an alternative mechanism is presented in which a laser pulse affects the vacuum decay rate of a muon outside the pulse. Quantum interference between the muon decaying with or without interacting with the pulse generates fringes in the electron momentum spectra and can increase the muon lifetime by up to a factor 2. The required parameters to observe this effect are available in experiments today.\n\n", "2507.16606": "2025-07-22, **Scalar-induced Neutrinoless Double Beta Decay in $SU(5)$**, P. S. Bhupal Dev et.al., [2507.16606v1](http://arxiv.org/abs/2507.16606v1)\n\n We discuss the role of heavy scalar fields in mediating neutrinoless double beta decay $(0\\nu\\beta\\beta)$ within the $SU(5)$ Grand Unified Theory framework, extended suitably to include neutrino mass. In such a minimal realistic $SU(5)$ setup for fermion masses, the scalar contributions to $0\\nu\\beta\\beta$ are extremely suppressed as a consequence of the proton decay bound. We circumvent this problem by imposing a discrete ${\\cal Z}\\_3$ symmetry. However, the scalar contributions to $0\\nu\\beta\\beta$ remain suppressed in this $SU(5) \\times {\\cal Z}\\_3$ model due to the neutrino mass constraint. We find that the $0\\nu\\beta\\beta$ contribution can be enhanced by extending the scalar sector with an additional $\\mathbf{15}$-dimensional scalar representation with suitable ${\\cal Z}\\_3$ charge. Such an extension not only yields realistic fermion mass spectra but also leads to experimentally testable predictions in upcoming ton-scale $0\\nu\\beta\\beta$ searches, which can be used as a sensitive probe of the new scalars across a broad range, from LHC-accessible scales up to $\\sim 10^{10}\\,\\text{GeV}$.\n\n", "2507.16589": "2025-07-22, **Cosmological Preference for a Positive Neutrino Mass at 2.7$σ$: A Joint Analysis of DESI DR2, DESY5, and DESY1 Data**, Guo-Hong Du et.al., [2507.16589v1](http://arxiv.org/abs/2507.16589v1)\n\n Neutrinos and dark energy (DE) have entered a new era of investigation, as the latest DESI baryon acoustic oscillation measurements tighten the constraints on the neutrino mass and suggest that DE may be dynamical rather than a cosmological constant. In this work, we investigate the cosmological implications of simultaneously incorporating $\\sum m\\_\\nu$ and $N\\_{\\rm eff}$ within the framework of dynamical DE. A joint analysis of DESI DR2, cosmic microwave background, DESY5 supernova, and DESY1 weak lensing data yields a total neutrino mass of $\\sum m\\_\\nu = 0.098^{+0.016}\\_{-0.037}\\,\\mathrm{eV}$, indicating a preference for a positive neutrino mass at the $2.7\\sigma$ level within the $w\\_0w\\_a$CDM framework. This work highlights the important influence of the strength of evidence for dynamically evolving DE on the measurement of neutrino mass, with stronger evidence for DE dynamics leading to a larger neutrino mass. These results underscore the importance of measuring the neutrino mass within the framework of dynamical DE, particularly in light of the forthcoming, more complete DESI data releases.\n\n", "2507.16551": "2025-07-22, **Exploring the properties of newborn pulsars with high-energy neutrinos**, Zi-Zhuo Xiao et.al., [2507.16551v1](http://arxiv.org/abs/2507.16551v1)\n\n Newborn pulsars resulting from core-collapse supernovae (CCSNe) are promising sources of high-energy (HE) cosmic rays and neutrinos. In this work, we focus on HE neutrinos generated by interactions between protons accelerated in relativistic pulsar winds and SN ejecta. Using a binned likelihood analysis, we evaluate the detection prospects of these neutrinos with IceCube and explore their potential for probing the initial spin period ($P$) and magnetic field strength ($B$) of newborn pulsars. Noticing a degeneracy in neutrino signal with $B/P^2$ across a broad parameter space, we find that HE neutrinos from a galactic newborn pulsar ($d=10$ kpc) with $(B/10^{12}~{\\rm G})(P/{\\rm ms})^{-2} \\gtrsim 0.003$ can be detected at $\\gtrsim 3\\sigma$ significance. Even in the absence of a nearby pulsar, the diffuse flux from the cosmologic population of pulsars could be probed by next-generation detectors like IceCube-Gen2 and GRAND200k. For galactic pulsars with $(B/10^{12}~{\\rm G})(P/{\\rm ms})^{-2} \\gtrsim 0.08$, the combination $B/P^2$ can be measured with an accuracy of better than 20\\% at the $3\\sigma$ confidence level. Additionally, we show that for pulsars with detectable HE neutrino signals, the emission can be clearly distinguished from neutrinos produced by interactions between SN ejecta and the circumstellar medium, due to their distinct temporal and spectral features.\n\n", "2507.16539": "2025-07-22, **Dark matter explanations for the neutrino emission from the Seyfert galaxy NGC 1068**, Kensuke Akita et.al., [2507.16539v1](http://arxiv.org/abs/2507.16539v1)\n\n We investigate the possibility that the high-energy neutrino flux observed from the Seyfert galaxy NGC 1068 originates from dark matter annihilations within the density spike surrounding the supermassive black hole at its center. The comparatively lower gamma-ray flux is attributed to a dark sector that couples predominantly to Standard Model neutrinos. To explain the absence of a corresponding neutrino signal from the center of the Milky Way, we propose two scenarios: (i) the disruption of the dark matter spike at the Milky Way center due to stellar heating, or (ii) the annihilation into a dark scalar that decays exclusively into neutrinos, with a decay length longer than the size of the Milky Way but shorter than the distance from Earth to NGC 1068.\n\n", "2507.16527": "2025-07-22, **Very-high-energy observations of the Seyfert galaxy NGC 4151 with MAGIC -- Indication of another gamma-ray obscured candidate neutrino source**, K. Abe et.al., [2507.16527v1](http://arxiv.org/abs/2507.16527v1)\n\n Seyfert galaxies are emerging as a promising source class of high-energy neutrinos. The Seyfert galaxies NGC 4151 and NGC 1068 have come up respectively as the most promising counterparts of a 3$\\sigma$ and of a 4.2$\\sigma$ neutrino excesses detected by IceCube in the TeV energy range. Constraining the very-high-energy (VHE) emission associated with the neutrino signal is crucial to unveil the mechanism and site of neutrino production. In this work, we present the first results of the VHE observations ($\\sim$29 hours) of NGC 4151 with the MAGIC telescopes. We detect no gamma-ray excess in the direction of NGC 4151, and we derive constraining upper limits on the VHE gamma-ray flux. The integral flux upper limit (at the 95% confidence level) above 200 GeV is $f = 2.3 \\times 10^{-12}$ cm$^{-2}$ s$^{-1}$. The comparison of the MAGIC and IceCube measurements suggests the presence of a gamma-ray obscured accelerator, and it allows us to constrain the gamma-ray optical depth and the size of the neutrino production site.\n\n", "2507.16392": "2025-07-22, **Recent advances on multimessenger astrophysics: Centaurus A, GW 170817, and KM3-230213A**, Cainã de Oliveira et.al., [2507.16392v1](http://arxiv.org/abs/2507.16392v1)\n\n We review recent advances in multimessenger astrophysics, with particular emphasis on Centaurus A and on two pivotal events: the gravitational-wave detection GW 170817 and the ultra-high-energy neutrino KM3-230213A. Centaurus A is the prototype multimessenger source. The GW 170817 event, arising from a binary neutron star merger, marked a transformative moment in astronomy through the joint observation of gravitational waves and a broad spectrum of electromagnetic signals. The KM3-230213A neutrino, detected by the KM3NeT Collaboration, is the most energetic neutrino observed to date and poses significant challenges for current models, given its tension with null results from IceCube and the Pierre Auger Observatory. We assess astrophysical interpretations, including galactic, cosmogenic, and transient extragalactic sources, as well as implications for cosmic-ray acceleration. These cases underscore the scientific potential of high-energy multimessenger events in probing both the extreme universe and new physics.\n\n", "2507.16244": "2025-07-22, **Probing Double-Peaked Gamma-Ray Spectra from Primordial Black Holes with Next-Generation Gamma-Ray Experiments**, C. J. Ouseph et.al., [2507.16244v1](http://arxiv.org/abs/2507.16244v1)\n\n Primordial black holes (PBHs), hypothesized to form in the early universe from gravitational collapse of density fluctuations, represent a well-motivated dark matter (DM) candidate. Their potential detection through gamma-ray signatures arising from Hawking radiation would provide definitive evidence for their existence and constrain their contribution to the DM abundance. Unlike conventional DM candidates, PBHs emit a unique, thermal-like spectrum of particles as they evaporate, including photons, neutrinos, and possible beyond-the-Standard Model particles. Future high-sensitivity gamma-ray observatories, such as e-ASTROGAM and other next-generation telescopes, will play a pivotal role in this search. With improved energy resolution and sensitivity, these missions can disentangle PBH-originating photons from astrophysical backgrounds, probe subtle spectral features such as multi-peak structures, and test exotic evaporation models. Such observations could either confirm PBHs as a viable DM component or place stringent limits on their abundance across critical mass windows. In this work, we explore the distinguishing features of a double-peaked gamma-ray spectrum produced by PBHs, focusing on the asteroid-mass window ($10^{15}$ g to $10^{17}$ g), where Hawking radiation peaks in the MeV to GeV range. Using a likelihood-based analysis, we demonstrate how future missions could discriminate between single- and double-peaked PBH scenarios, the latter arising in cosmological models predicting multi-modal PBH mass distributions. Our results highlight the diagnostic power of spectral shape analysis in identifying PBH populations and constrain the parameter space for which a double-peaked signal could be detectable above background.\n\n", "2507.16198": "2025-07-22, **Three-loop induced neutrino mass model in a non-invertible symmetry**, Hiroshi Okada et.al., [2507.16198v1](http://arxiv.org/abs/2507.16198v1)\n\n We propose a new type of radiatively induced neutrino masses at three-loop level based on the Ma model, introducing a non-invertible symmetry in the class under a ${\\mathbb Z\\_2}$ gauging of ${\\mathbb Z\\_6}$ symmetry and adding three isospin doublet vector-like fermions $L'$ and singlet boson $S\\_0$. Under this symmetry, the Yukawa interactions directly related to the neutrino masses are not allowed at tree-level. However it is allowed at one-loop level due to $L'$ and $S\\_0$ as well as $\\eta$, which is no longer invariant under this symmetry. Therefore, the symmetry is dynamically broken. Intriguingly, $\\eta$ plays important roles in contributing to both the radiative matrices $y^\\eta$ and $m\\_\\nu$. After constructing our model, we show some numerical analyses to satisfy the lepton flavor violations, muon anomalous magnetic dipole moment, and a boson dark matter candidate $S\\_0$ or $\\eta\\_R$ for the cases of normal hierarchy and inverted hierarchy. Then, we demonstrate allowed space for our input parameters.\n\n"}, "dark matter": {"2507.17693": "2025-07-23, **Estimating the baryon fraction in the IGM from well-localized FRBs and DESI data**, Thais Lemos et.al., [2507.17693v1](http://arxiv.org/abs/2507.17693v1)\n\n Current measurements of Baryon Acoustic Oscillations (BAO) from the Dark Energy Spectroscopic Survey (DESI DR2), when combined with data from Type Ia supernovae (SNe), challenge the observational viability of the $\\Lambda$-Cold Dark Matter ($\\Lambda$CDM) model, motivating combinations of independent datasets to estimate cosmological quantities. In a previous communication, we presented a cosmological independent method to constrain the baryon fraction in the IGM ($f\\_{\\mathrm{IGM}}$), where we derived relevant expressions for the dispersion measure ($\\mathrm{DM}$) in terms of luminosity distance, allowing us to estimate $f\\_{\\mathrm{IGM}}$ combining directly measurements of 17 well-localized FRBs and 1048 SNe from the Pantheon catalog. Here we revisit this method to constrain $f\\_{\\mathrm{IGM}}$, considering two parameterizations for the $f\\_{\\mathrm{IGM}}$: constant and time-dependent. We expand our sample by combining 107 well-localized Fast Radio Bursts (FRBs) with BAO measurements from DESI DR2 and SNe observations from DESY5, and the Pantheon+ catalog. We find through a Bayesian model selection analysis that a conclusive answer about the evolution of $f\\_{\\mathrm{IGM}}$ cannot be achieved from the current FRBs observational data. In particular, our results show weak evidence in favor of the constant case.\n\n", "2507.17607": "2025-07-23, **Minimal Dark Matter in the sky: updated Indirect Detection probes**, Mohammad Aghaie et.al., [2507.17607v1](http://arxiv.org/abs/2507.17607v1)\n\n Minimal Dark Matter is among the simplest and most predictive Dark Matter frameworks, with the Majorana SU(2) 5-plet as its smallest accidentally stable real representation. We present a comprehensive reassessment of its indirect-detection signals. The $\\gamma$-ray flux from both Sommerfeld-enhanced annihilations and bound-state formation is calculated, incorporating next-to-leading-order corrections and next-to-leading-log resummation of the relevant electroweak effects. In the Milky Way halo, bound-state formation dominates the flux near 100 GeV. The corresponding low-energy spectrum is used to place constraints based on Fermi-LAT observations of Galactic diffuse emission, while the high-energy part of the spectrum is employed to forecast the required observation time for several of the Milky Way's dwarf spheroidal galaxies using the Cherenkov Telescope Array Observatory (CTAO). Fermi-LAT data strongly disfavor the lower edge of the thermal mass window, even under conservative assumptions about the inner Galaxy density profile. Furthermore, several hundred hours of forthcoming CTAO observations of northern dwarfs should be sufficient to probe the central mass value.\n\n", "2507.17340": "2025-07-23, **Implications of the recent neutron decay measurements on the properties of compact objects -- a dark star with nucleonic shell ?**, M. Veselský et.al., [2507.17340v1](http://arxiv.org/abs/2507.17340v1)\n\n Recent experimental observation suggests that neutron decay is always accompanied by emission of electron while in 1% of cases proton is not emitted. We develop a scenario kinematically compatible with experimental observation, where neutron decay results in production of two dark matter particles of about half the mass of neutron and test properties of neutron stars with admixture of such particles. Constraints on mass and coupling to vector dark boson are obtained. The structure of the compact object is modified to a dark star with a shell of nucleonic matter around the nuclear saturation density.\n\n", "2507.17148": "2025-07-23, **Constraints on Axion Dark Matter by Spin-Dependent Macroscopic Force**, Dongyi Yang et.al., [2507.17148v1](http://arxiv.org/abs/2507.17148v1)\n\n Axion-like particles (ALPs) are hypothetical particles that serve as promising candidates for cold dark matter. Portals like inelastic axion scattering and axion propagated force have been employed to search for the upper limit of the ALPs' coupling with standard model particles. Other methods, like the axion-fermion interaction in the CASPEr experiment, integrate the dark matter motion into the measurement. We suggest a new method for detecting dark matter axions based on axionelectron elastic scattering. In the pseudoscalar axion model, this interaction can be seen as an effective magnetic field, so high-sensitivity atomic magnetometers can be utilized to measure this interaction. The scattering cross section of this process is significantly amplified by the high number density and occupation number of axion dark matter. The upper limit of the electron-axion coupling coefficient obtained from this process can reach two orders of magnitude higher than previous results at low axion mass, and will exceed the astrophysics limits by using a developing magnetometer. This scattering process also provides an efficient way to detect local structures of dark matter.\n\n", "2507.16932": "2025-07-22, **Detection of a dark matter sub-halo near the Sun from pulsar timing**, Sukanya Chakrabarti et.al., [2507.16932v1](http://arxiv.org/abs/2507.16932v1)\n\n Using pulsar accelerations, we identify and constrain the properties of a dark matter sub-halo in the Galaxy for the first time from analyzing the excess, correlated power in the acceleration field of binary pulsars. We find that this sub-halo has a mass of $1.02^{+3.47}\\_{-0.90} \\times 10^{7}~M\\_{\\odot}$ and is located at Galactic coordinates $d = 0.93^{+0.32}\\_{-0.38}$ kpc, $b=36.78^{+17.59}\\_{-23.55}$, $l=30.16^{+19.36}\\_{-23.82}$, or equivalently at Galactocentric coordinates $X = 7.52^{+0.34}\\_{-0.38}~\\rm$ kpc, $Y = 0.36^{+0.39}\\_{-0.43} ~\\rm kpc$, $Z = 0.53^{+0.41}\\_{-0.45} ~\\rm kpc$. We examine \\textit{Gaia} data and the atomic and molecular hydrogen data of our Galaxy and show that this excess power cannot arise from the gas or the stars in our Galaxy. Additionally, by analyzing the full sample of binary pulsars with available acceleration measurements that span 3.4 kpc in Galactocentric radius from the Sun and 3.6 kpc in vertical height, we find that massive (with mass $>10^{8}~M\\_{\\odot}~$) sub-halos are disfavored for the Milky Way within several kiloparsec of the Sun. The detection of a $10^{7}~M\\_{\\odot}$ sub-halo within a few kpc of the Sun is potentially consistent with the expected number counts of sub-halos in the prevailing $\\Lambda$CDM paradigm, for a substantial sub-halo mass fraction. The pulsar accelerations are however better fit by a compact object, such as arising from a primordial black hole or a sub-halo having a steep density profile, as in self-interacting dark matter. As the number and precision of direct acceleration measurements continues to grow, we will obtain tighter constraints on dark matter sub-structure in our Galaxy. These measurements now open a new avenue for studying dark matter and have implications across many fields of astrophysics - from understanding the nature of dark matter to galaxy formation.\n\n", "2507.16930": "2025-07-22, **Tidal adaptive softening and artificial fragmentation in cosmological simulations**, Robert A. Mostoghiu Paun et.al., [2507.16930v1](http://arxiv.org/abs/2507.16930v1)\n\n Traditional N-body methods introduce localised perturbations in the gravitational forces governing their evolution. These perturbations lead to an artificial fragmentation in the filamentary network of the Large Scale Structure, often referred to as \"beads-on-a-string.\" This issue is particularly apparent in cosmologies with a suppression of the matter power spectrum at small spatial scales, such as warm dark matter models, where the perturbations induced by the N-body discretisation dominate the cosmological power at the suppressed scales. Initial conditions based on third-order Lagrangian perturbation theory, which allow for a late-starting redshift, have been shown to minimise numerical errors contributing to such artefacts. In this work, we investigate whether the additional use of a spatially adaptive softening for dark matter particles, based on the gravitational tidal field, can reduce the severity of artificial fragmentation. Tidal adaptive softening significantly improves force accuracy in idealised filamentary collapse simulations over a fixed softening approach. However, it does not substantially reduce spurious haloes in cosmological simulations when paired with such optimised initial conditions. Nevertheless, tidal adaptive softening induces a shift in halo formation times in warm dark matter simulations compared to a fixed softening counterpart, an effect not seen in cold dark matter simulations. Furthermore, initialising the initial conditions at an earlier redshift generally results in z=0 haloes forming from Lagrangian volumes with lower average sphericity. This sphericity difference could impact post-processing algorithms identifying spurious objects based on Lagrangian volume morphology. We propose potential strategies for reducing spurious haloes without abandoning current N-body methods.\n\n", "2507.16904": "2025-07-22, **Dancing in the dark: probing Dark Matter through the dynamics of eccentric binary pulsars**, Giorgio Nicolini et.al., [2507.16904v1](http://arxiv.org/abs/2507.16904v1)\n\n We investigate the dynamics of eccentric binary pulsars embedded in dark matter environments. While previous studies have primarily focused on circular orbits in collisionless dark matter halos, we extend this framework to eccentric systems and explore their interaction with ultralight scalar fields. Adopting a perturbative approach, we compute the modifications to the orbital period induced by dark matter-driven dynamical friction. Our results show that orbital eccentricity amplifies the imprints of non-vacuum environments on binary dynamics, underscoring the potential of such systems as sensitive probes for dark matter signatures.\n\n", "2507.16894": "2025-07-22, **Fast and Fewrious: Stochastic binary perturbations from fast compact objects**, Badal Bhalla et.al., [2507.16894v1](http://arxiv.org/abs/2507.16894v1)\n\n Massive compact objects soften binaries. This process has been used for decades to constrain the population of such objects, particularly as a component of dark matter (DM). The effects of light compact objects, such as those in the unconstrained asteroid-mass range, have generally been neglected. In principle, low-energy perturbers can harden binaries instead of softening them, but the standard lore is that this effect vanishes when the perturber velocities are large compared to the binary's orbital velocity, as is typical for DM constituents. Here, we revisit the computation of the hardening rate induced by light perturbers. We show that although the perturbations average to zero over many encounters, many scenarios of interest for DM constraints are in the regime where the variance cannot be neglected. We show that a few fast-moving perturbers can leave stochastic perturbations in systems that are measured with great precision, and we use this framework to revisit the constraint potential of systems such as binary pulsars and the Solar System. This opens a new class of dynamical probes with potential applications to asteroid-mass DM candidates.\n\n", "2507.16889": "2025-07-22, **The Effects of Linear Matter Power Spectrum Enhancement on Dark Matter Substructure**, Ethan O. Nadler et.al., [2507.16889v1](http://arxiv.org/abs/2507.16889v1)\n\n We present cosmological dark matter (DM)--only zoom-in simulations of a Milky Way (MW) analog originating from enhanced linear matter power spectra $P(k)$ relative to the standard cold, collisionless DM (CDM) cosmology. We consider a Gaussian power excess in $P(k)$ followed by a cutoff in select cases; this behavior could arise from early-universe physics that alters the primordial matter power spectrum or DM physics in the radiation-dominated epoch. We find that enhanced initial conditions (ICs) lead to qualitative differences in substructure relative to CDM. In particular, the subhalo mass function (SHMF) resulting from ICs with both an enhancement and cutoff is amplified at high masses and suppressed at low masses, indicating that DM substructure is sensitive to features in $P(k)$. Critically, the amplitude and shape of the SHMF enhancement depend on the wave number of the $P(k)$ excess and the presence or absence of a cutoff on smaller scales. These alterations to the SHMF are mainly imprinted at infall rather than during tidal evolution. Additionally, subhalos are found systematically closer to the host center and their concentrations are increased in scenarios with $P(k)$ enhancement. Thus, nonlinear mode coupling must be captured to enable $P(k)$ reconstruction using DM substructure.\n\n", "2507.16720": "2025-07-22, **Abelian-Higgs vortices in the oscillating axion background**, Naoya Kitajima et.al., [2507.16720v1](http://arxiv.org/abs/2507.16720v1)\n\n We study the dynamics of Abelian-Higgs vortices in the background of a coherently oscillating axion field. We show that the electric field is induced in the magnetic core of the vortex due to the axion-photon conversion. Moreover, because the electromagnetic field is confined in the vortex and excluded from the superconducting bulk regions due to the Meissner effect, the vortex tube can be regarded as a cylindrical cavity, and our numerical analysis shows that the resonant cavity mode (TM010 mode) can be efficiently enhanced in this tube. We also focus on the interaction of two vortices in the oscillating axion background, resulting in attractive or repulsive forces, even in the case with the BPS limit. These new features open up a new possibility for the axion dark matter search using superconducting devices.\n\n", "2507.16614": "2025-07-22, **Cosmology with a Non-minimally Coupled Dark Matter Fluid I. Background Evolution**, Samuele Silveravalle et.al., [2507.16614v1](http://arxiv.org/abs/2507.16614v1)\n\n We explore a cosmological model in which dark matter is non-minimally coupled to gravity at the fluid level. While typically subdominant compared to Standard Model forces, such couplings may dominate dark matter dynamics. We show that this interaction modifies the early-time Friedmann equations, driving a phase of accelerated expansion that can resolve the horizon and flatness problems without introducing additional fields. At even earlier times, the coupling to spatial curvature may give rise to a cosmological bounce, replacing the initial singularity of standard cosmology. These results suggest that non-minimally coupled dark matter could offer a unified framework for addressing both the singularity and fine-tuning problems.\n\n", "2507.16604": "2025-07-22, **Forecast constraints on null tests of the $Λ$CDM model with SPHEREx**, Alejandro Mata Román et.al., [2507.16604v1](http://arxiv.org/abs/2507.16604v1)\n\n In this work we quantify the ability of the upcoming SPHEREx survey to constrain cosmological observables and test the internal consistency of the cosmological constant and cold dark matter ($\\Lambda$CDM) model. Using Fisher matrix forecasting, we assess the expected precision on Baryon Acoustic Oscillations (BAO) observables, such as the angular diameter distance $D\\_\\mathrm{A}(z)$ and the Hubble parameter $H(z)$. We further explore SPHEREx's potential to probe some of the fundamental assumptions of large-scale spatial homogeneity and isotropy, through model-independent reconstructions of several consistency tests of the $\\Lambda$CDM model. In addition, we also examine the effect of the model dependence of the resulting Fisher and covariance matrices, using a neural network (NN) classification approach. We find that, while it is commonly assumed the covariance matrix depends weakly on the model, in fact the NN can very accurately ($\\sim 98\\%$) detect the underlying fiducial cosmological model based solely on the covariance matrix of the data, thus challenging this assumption.\n\n", "2507.16526": "2025-07-22, **Impact of cavities on the detection of quadratically coupled ultra-light dark matter**, Clare Burrage et.al., [2507.16526v1](http://arxiv.org/abs/2507.16526v1)\n\n Ultra-light scalar fields may explain the nature of the dark matter in our universe. If such scalars couple quadratically to particles of the Standard Model the scalar acquires an effective mass which depends on the local matter energy density. The changing mass causes the field to deviate from its cosmological value in experimental environments. In this work we show that the presence of a local over-density enclosing the experiment, for example a cavity, vacuum chamber, or satellite can strongly suppress the value of the scalar and its gradient in the interior. This makes detection of such scalar dark matter challenging, and significantly relaxes constraints on strongly coupled models. We also discuss the possibility that quadratically coupled ultra-light scalar dark matter could be detected by the differential measurement of the force on two cavities of the same mass but different internal structure.\n\n", "2507.16468": "2025-07-22, **Dark Matter Admixed Strange Stars: An Effective Single-Fluid Approach**, Samstuti Chanda et.al., [2507.16468v1](http://arxiv.org/abs/2507.16468v1)\n\n We investigate the structural and physical properties of strange stars admixed with dark matter by modeling the total energy density as a weighted combination of quark matter and bosonic dark matter components regulated by a volume fraction. Both the components are assumed to be distributed throughout the star. The quark matter is described by a linear equation of state (EOS), whereas the bosonic dark matter follows an EOS with repulsive self-interactions. By combining these into a single effective EOS, we reduce the two-fluid system to an equivalent one-fluid model and numerically solve the Tolman-Oppenheimer-Volkoff (TOV) equations to obtain the mass-radius (M-R) relationship of the hybrid configuration. We systematically analyze how the stellar structure is modified by varying dark matter fractions, the mass of the dark matter particle and the self-repulsion coupling strength. Our results reveal distinct modifications to the M-R profiles and apparent phase behavior of the quark matter suggesting observable signatures that could offer insights into the properties of dark matter in extreme astrophysical environments. This model also provides a possible explanation for ultra-compact stars with small radii, such as XTE J1814-338, suggesting its potential nature as a hybrid star.\n\n", "2507.16465": "2025-07-22, **Dehnen-type dark matter wormholes in the $f(\\mathcal{R},\\mathcal{L}_m,\\mathcal{T})$ action**, A. Errehymy et.al., [2507.16465v1](http://arxiv.org/abs/2507.16465v1)\n\n We are exploring the possibility of traversable wormholes existing in a more realistic context. Specifically, we are looking at scenarios that don't rely on exotic factors, like having a mass shell at the throat or allowing particles and antiparticles to coexist without annihilation. To do this, we are constructing wormholes with double power-law density distributions, drawing inspiration from the Dehnen-type dark matter halo in the framework of generalized geometry-matter coupling gravity. Our investigation carefully considers the challenges of traversability and stability, as well as the roles of exotic matter, the exoticity parameter, and the anisotropy parameter. We have discovered solutions that describe asymmetric, asymptotically flat traversable wormholes, supported by a smooth metric and double power-law density distributions. These solutions successfully avoid the problems, giving us hope that such wormholes could actually exist in nature.\n\n", "2507.16246": "2025-07-22, **Split supersymmetry and hybrid inflation in light of Atacama Cosmology Telescope DR6 data**, Nobuchika Okada et.al., [2507.16246v1](http://arxiv.org/abs/2507.16246v1)\n\n Inspired by the recent measurement of the scalar spectral index, $n\\_s = 0.9743 \\pm 0.0034$, by the Atacama Cosmology Telescope (ACT) DR6 data, we present an update on the split supersymmetry hybrid inflation model, also known as $\\mu$-term hybrid inflation. The model employs a canonical K\\\"{a}hler potential but incorporates an additional renormalizable term in the superpotential $W$, which yields the MSSM $\\mu$-term following supersymmetry breaking. This additional term in $W$ is responsible for a high reheat temperature, $T\\_r \\gtrsim 10^{12}$ GeV, and consequently the necessity of split supersymmetry in this class of models. The predicted scalar spectral index is in excellent agreement with the ACT measurement and $r$, the tensor to scalar ratio, is estimated to be less than or of order $10^{-2} -10^{-3}$. For the running of the scalar spectral index we find $\\|dn\\_s/d \\ln k\\| = O(10^{-4})$. With $T\\_r \\gtrsim 10^{12}$ GeV, leptogenesis is readily implemented in this class of models. A wino-like LSP with mass of around 2 TeV is a plausible dark matter candidate.\n\n", "2507.16245": "2025-07-22, **The THESAN project: environmental drivers of Local Group reionization**, Yu Zhao et.al., [2507.16245v1](http://arxiv.org/abs/2507.16245v1)\n\n The timing of cosmic reionization across Local Group (LG) analogues provides insights into their early histories and surrounding large-scale structure. Using the radiation-hydrodynamic simulation THESAN-1 and its dark matter-only counterpart THESAN-DARK-1, we track the reionization histories of all haloes, including 224 LG analogues within the proximity of any of the 20 Virgo-like clusters with halo masses above 10^14 Msun at z=0 and their environments. The statistically controlled samples quantify how the reionization redshift (z\\_reion) correlates with halo mass, local overdensity, and present-day pair properties. Even at fixed mass, haloes in denser regions ionize earlier, and increasing the overdensity smoothing scale systematically suppresses small-scale structure, including local variations and environmental gradients in z\\_reion. Virgo-like clusters accelerate reionization in their surroundings out to ~5-10 cMpc, beyond which local overdensity again becomes the dominant factor. Within LG pairs, reionization timing offsets reach up to ~150 Myr and correlate with present-day halo separation, reflecting sensitivity to large-scale structure rather than mass ratio in driving asynchronous reionization. The results support an extreme inside-out picture where clustered sources rapidly ionize their immediate neighborhoods, while lower-density regions self-ionize later and voids wait for external homogenization. These links between environment and reionization timing explain the influence of protoclusters and help interpret fossil records in LG dwarfs around the Milky Way. For Milky Way analogues, we find a reionization redshift as early (late) as z\\_reion = 12.7^{+2.0}\\_{-1.7} (8.88^{+0.66}\\_{-0.70}) when considered on 125 ckpc (500 ckpc) scales, with LG analogues following an inside-out reionization picture.\n\n", "2507.16189": "2025-07-22, **An AI super-resolution field emulator for cosmological hydrodynamics: the Lyman-α forest**, Fatemeh Hafezianzadeh et.al., [2507.16189v1](http://arxiv.org/abs/2507.16189v1)\n\n We extend our super-resolution and emulation framework for cosmological dark matter simulations to include hydrodynamics. We present a two-stage deep learning model to emulate high-resolution (HR-HydroSim) baryonic fields from low-resolution (LR-HydroSim) simulations at redshift $z = 3$. The method takes as inputs an LR-HydroSim and the high-resolution initial conditions (HR-HydroICs). First, the model stochastically generates high-resolution baryonic fields from the LR-HydroSim. Second, a deterministic emulator refines these fields using HR-HydroICs to reconstruct small-scale structures including displacement, velocity, internal energy, and gas/star classification. Trained on paired low- and high-resolution simulations produced with \\texttt{MP-Gadget}, the model captures small-scale structures of the intergalactic medium and %Lyman-$\\alpha$ forest observables down to the 100 kpc pressure smoothing scale relevant to the Lyman-$\\alpha$ forest. The model achieves subpercent error for overdensity, temperature, velocity, and optical depth fields, a mean relative error of 1.07\\% in the large-scale flux power spectrum (\\(k < 3 \\times 10^{-2}\\ \\mathrm{s/km}\\)), and less than 10\\% error in the flux probability distribution function. Notably, the two-stage model reduces the compute time by a factor of $\\sim$450 compared to full smoothed particle hydrodynamics at the same resolution. This work demonstrates the potential of this framework as a powerful and efficient tool for generating high-resolution fields offering fast and accurate alternatives to traditional cosmological hydrodynamic simulations and enabling large-volume mock datasets for next-generation cosmological surveys.\n\n", "2507.16163": "2025-07-22, **Emergent field theory**, Erick I. Duque et.al., [2507.16163v1](http://arxiv.org/abs/2507.16163v1)\n\n The uniqueness theorems for general relativity and Yang-Mills theories can be circumvented by dropping the ubiquitous, yet often implicit, assumption that physical fields, such as the spacetime metric, are fundamental. The novel concept of emergent fields makes it possible to construct modified theories of gravity and forces where the spacetime metric and strength tensor fields emerge from a covariance analysis in the canonical formulation with nontrivial relations to the fundamental phase space and no additional degrees of freedom are required. This is an example of a post-Einstein-Yang-Mills theory that implies new physics. In particular, explicit realizations of the theory in symmetry-reduced systems have shown robust resolutions of the singularities that plague the classical theories in regions of extreme spacetime curvature, including nonsingular (SU(2)xU(1)-charged) black holes with a cosmologial constant and collapsing solutions, as well as Gowdy and FLRW cosmologies. Further applications include modifications in the spectrum of quasinormal modes and in the evaporation process of black holes, as well as relativistic formulations of long-range gravitational effects capable of modeling MOND as an alternative solution to the dark matter problem. New results here include an extension of the spherically symmetric system that couples SU(2) gauge fields and the generalization of previous dynamical, homogeneous solutions.\n\n", "2507.16147": "2025-07-22, **Observational constraints on phenomenological emergent dark energy and barotropic dark matter characterized by a constant equation of state parameter**, Jian-Qi Liu et.al., [2507.16147v1](http://arxiv.org/abs/2507.16147v1)\n\n While cold dark matter is widely supported by a range of cosmological observations, it encounters several difficulties at smaller scales. These issues have prompted the investigation of various alternative dark matter candidates, leaving the question \"What is dark matter?\" still open. In this work, we propose a new cosmological model that considers dark matter as a barotropic fluid with a constant equation of state parameter and interprets dark energy as the phenomenological emergent dark energy rather than a cosmological constant. We then place constraints on our new model using the Planck 2018 Cosmic Microwave Background (CMB) anisotropy measurements, Baryon Acoustic Oscillation (BAO) measurements from the Dark Energy Spectroscopic Instrument (DESI), the Pantheon Plus (PP) compilation of Type Ia supernovae (Ia SNe), and the Redshift Space Distortions (RSD) data from Gold2018. The results show statistically significant signal for positive dark matter equation of state and square of sound speed $w\\_{\\rm dm}=c\\_{\\rm s,dm}^2$ ($10^{7}w\\_{\\rm dm}$ = $4.0^{+2.5}\\_{-2.3}$ at the 95\\% confidence level) for the data combination CMB+DESI+PP+RSD. However, Bayesian evidence indicates that this data combination favors the $\\Lambda$CDM model with very strong evidence.\n\n", "2507.16142": "2025-07-22, **Influence of dark matter on quantum entanglement and coherence in curved spacetime**, Shu-Min Wu et.al., [2507.16142v1](http://arxiv.org/abs/2507.16142v1)\n\n Dark matter (DM) remains undetected, and developing theoretical models such as the promising perfect fluid dark matter (PFDM) is a key challenge in modern cosmology. In this work, we investigate the quantum characteristics of PFDM by analyzing the behavior of quantum entanglement and coherence for both fermionic and bosonic fields near a Schwarzschild black hole embedded in a PFDM halo. Our results reveal that PFDM can either enhance or degrade quantum entanglement and coherence, depending sensitively on its density. Notably, bosonic entanglement shows greater susceptibility to PFDM effects compared to fermionic entanglement, while fermionic coherence exhibits a stronger dependence on PFDM than its bosonic counterpart. These findings highlight the necessity of selecting appropriate quantum probes for DM detection based on the type of quantum resources, as different quantum fields exhibit significantly different responses to PFDM in curved spacetime.\n\n"}, "supernova": {"2507.17708": "2025-07-23, **Do Multi-Structural One-Off FRBs Trace Similar Cosmology History with Repeaters?**, Yu-Hao Zhu et.al., [2507.17708v1](http://arxiv.org/abs/2507.17708v1)\n\n Fast Radio Bursts (FRBs) are millisecond-duration transient events that are typically observed at radio wavelengths and cosmological distances but their origin remains unclear. Furthermore, most FRB origin models are related to the processes at stellar scales, involving neutron stars, blackholes, supernovae, etc. In this paper, our purpose is to determine whether multi-structural one-off FRBs and repeaters share similarities. To achieve this, we focus on analyzing the relationship between the FRB event rate and the star formation rate, complemented by statistical testing methods. Based on the CHIME/FRB Catalog 1, we calculate the energy functions for four subsamples, including apparent non-repeating FRBs (one-offs), repeaters, multi-structural one-offs, and the joint repeaters and multi-structural events, respectively. We then derive the FRB event rates at different redshifts for all four subsamples, all of which were found to share a similar cosmological evolution trend. However, we find that the multi-structural one-offs and repeaters are distinguishable from the KS and MWW tests.\n\n", "2507.17693": "2025-07-23, **Estimating the baryon fraction in the IGM from well-localized FRBs and DESI data**, Thais Lemos et.al., [2507.17693v1](http://arxiv.org/abs/2507.17693v1)\n\n Current measurements of Baryon Acoustic Oscillations (BAO) from the Dark Energy Spectroscopic Survey (DESI DR2), when combined with data from Type Ia supernovae (SNe), challenge the observational viability of the $\\Lambda$-Cold Dark Matter ($\\Lambda$CDM) model, motivating combinations of independent datasets to estimate cosmological quantities. In a previous communication, we presented a cosmological independent method to constrain the baryon fraction in the IGM ($f\\_{\\mathrm{IGM}}$), where we derived relevant expressions for the dispersion measure ($\\mathrm{DM}$) in terms of luminosity distance, allowing us to estimate $f\\_{\\mathrm{IGM}}$ combining directly measurements of 17 well-localized FRBs and 1048 SNe from the Pantheon catalog. Here we revisit this method to constrain $f\\_{\\mathrm{IGM}}$, considering two parameterizations for the $f\\_{\\mathrm{IGM}}$: constant and time-dependent. We expand our sample by combining 107 well-localized Fast Radio Bursts (FRBs) with BAO measurements from DESI DR2 and SNe observations from DESY5, and the Pantheon+ catalog. We find through a Bayesian model selection analysis that a conclusive answer about the evolution of $f\\_{\\mathrm{IGM}}$ cannot be achieved from the current FRBs observational data. In particular, our results show weak evidence in favor of the constant case.\n\n", "2507.17551": "2025-07-23, **GW231123: a product of successive mergers from $\\sim 10 $ stellar-mass black holes**, Yin-Jie Li et.al., [2507.17551v1](http://arxiv.org/abs/2507.17551v1)\n\n GW231123 is an exceptionally massive binary black hole (BBH) merger with unusually high component spins. Such extreme properties challenge conventional stellar evolution models predicting a black hole mass gap due to pair-instability supernovae. We analyze GW231123 using population-informed priors on BH mass and spin distributions to test possible formation scenarios: first-generation stellar collapse, hierarchical (multi-generation) mergers, and primordial origin. Our analysis strongly prefers scenarios where at least one component is a higher-generation BH. Both components are favored to have high spins, which rules out scenarios in which they are both first-generation (low spin) or primordial (nearly non-spin). We conclude that GW231123 is a hierarchical merger, with components plausibly originate from the successive mergers of $\\sim 6$ and $\\sim 4$ first-generation BHs, respectively. This suggests that repeated mergers can be frequent and even more massive intermediate-mass black holes may be produced. Thus mechanisms that can efficiently harden the BBHs' orbits are required, e.g., gas dynamical fraction in the disks of active galactic nucleus.\n\n", "2507.16970": "2025-07-22, **Monodromic Dark Energy and DESI**, Samuel Goldstein et.al., [2507.16970v1](http://arxiv.org/abs/2507.16970v1)\n\n Recent baryon acoustic oscillation (BAO) measurements from the Dark Energy Spectroscopic Instrument (DESI) collaboration have renewed interest in dynamical dark energy models, particularly those that cross the \"phantom divide\" ($w\\_{\\rm DE} = -1$). We present the first observational constraints on monodromic k-essence, a physically motivated scalar field dark energy scenario capable of realizing rapid oscillations about the phantom divide. Using cosmic microwave background (CMB) information, DESI DR2 BAO measurements, and Type Ia supernovae observations, we constrain the amplitude, frequency, phase, and power-law index describing the monodromic k-essence scenario at the background level. We find that the monodromic dark energy scenario can fit these datasets with a $\\chi^2$ that is comparable to the phenomenological $w\\_0$-$w\\_a$ parametrization. While the CMB and BAO data alone are consistent with the standard $\\Lambda$CDM model, the inclusion of DESY5 supernovae shows a preference for a non-zero amplitude, $A=0.44^{+0.16}\\_{-0.12}$ (fully marginalized 68% C.L.). Conversely, inclusion of the Pantheon-Plus supernovae provides no evidence for monodromic k-essence, with $A<0.43$ (95% C.L.). We show that constraints on both monodromic dark energy and $w\\_0$-$w\\_a$ models are sensitive to the DESI DR2 LRG2 BAO distance, especially in the absence of supernovae data.\n\n", "2507.16907": "2025-07-22, **Premature Ignition: Why the Single-Degenerate Channel Leads to Type Iax and Not Type Ia Supernovae**, Amir Michaelis et.al., [2507.16907v1](http://arxiv.org/abs/2507.16907v1)\n\n Type Ia supernovae (SNe Ia) are pivotal for the origins of the elements, the understanding of galactic chemical evolution, and serve as crucial cosmological distance indicators, yet their progenitor systems remain a central enigma in astrophysics. While both the growth of white dwarfs to near-Chandrasekhar mass and their explosion (the single-degenerate; SD) and mergers of two WDs leading to explosions (double-degenerate; DD) scenarios have been proposed, neither explains the observed diversity of thermonuclear transients and their properties, including the fainter Type Iax supernovae (SNe Iax). Here we show, through comprehensive three-dimensional hydrodynamic simulations, that as accreting WDs grow towards the Chandrasekhar mass (the SD channel), premature carbon ignition at sub-Chandrasekhar densities can trigger partial deflagrations that eject substantial mass in low-energy Iax outbursts. Such a process effectively serves as a self-limiting feedback loop, which stalls further mass growth. It naturally explains why the SD channel is precluded from producing standard, normal SNe Ia, and instead predominantly yields SNe Iax. Our findings significantly reframe the SD versus DD debate, with important implications for supernova rates, galactic chemical enrichment, and cosmological measurements.\n\n", "2507.16903": "2025-07-22, **Convection signatures in early-time gravitational waves from core-collapse supernovae**, Marco Cusinato et.al., [2507.16903v1](http://arxiv.org/abs/2507.16903v1)\n\n Gravitational waves emitted from core-collapse supernova explosions are critical observables for extracting information about the dynamics and properties of both the progenitor and the post-bounce~evolution of the system. They are prime targets for current interferometric searches and represent a key milestone for the capabilities of next-generation interferometers.   This study aims to characterize how the gravitational waveform associated with prompt stellar convection depends on the rotational rate and magnetic field topology of the progenitor star.   We carry out a series of axisymmetric simulations of a $16.5\\,\\mathrm{M}\\_\\odot$ red supergiant with five configurations of initial magnetic fields and varying degrees of initial rotation. We then analyze the contribution of early-time convection and the proto-neutron star core to the waveform using ensemble empirical mode decomposition, alongside spectral and Fourier analyses, to facilitate comparison and interpretation of the results.   Our simulations reveal that early post-bounce gravitational waves signals are dominated by the first six intrinsic mode functions, with variations due to rotation and magnetic fields influencing the signal strength. Strong magnetic fields decelerate core rotation, affecting mode excitation. Regardless of the initial rotation, convection consistently drives a low-frequency mode that lasts throughout the evolution. Additionally, our results show that the bounce signal is not consistently the strongest component of the waveform. Instead, we find that prompt convection generates a post-bounce signal of comparable or even greater amplitude.\n\n", "2507.16893": "2025-07-22, **Super-Eddington accretion onto black holes and its application to fallback accretion**, Tamar Faran et.al., [2507.16893v1](http://arxiv.org/abs/2507.16893v1)\n\n We study the problem of steady-state spherical accretion onto a black hole, in which the internal energy of the flow is governed by radiation and photon diffusion dominates the energy flux at large radii. In the free-fall limit, the fluid equations can admit two types of solutions for a given accretion rate: (1) accretion flows that become isothermal at large radii and (2) solutions in which the temperature at infinity vanishes as a power law of the radius. Using boundary layer theory, we obtain analytic solutions for the two cases and apply our results to fallback accretion onto a black hole following a failed supernova explosion. We give predictions for the observational signature of fallback accretion using realistic progenitor properties from MESA, both for a fully ionized inflow and for the more realistic case in which recombination/ionization take place due to low photospheric temperatures. The observed fading sources coincident with the failed-supernova candidates in NGC 6946 and M31 are too luminous to be powered by spherical accretion onto newly formed black holes; the observed sources are instead likely due to accretion of the turbulent, convective envelope of the supergiant progenitor.\n\n", "2507.16817": "2025-07-22, **Mixture-of-Expert Variational Autoencoders for Cross-Modality Embedding of Type Ia Supernova Data**, Yunyi Shen et.al., [2507.16817v1](http://arxiv.org/abs/2507.16817v1)\n\n Time-domain astrophysics relies on heterogeneous and multi-modal data. Specialized models are often constructed to extract information from a single modality, but this approach ignores the wealth of cross-modality information that may be relevant for the tasks to which the model is applied. In this work, we propose a multi-modal, mixture-of-expert variational autoencoder to learn a joint embedding for supernova light curves and spectra. Our method, which is inspired by the Perceiver architecture, natively accommodates variable-length inputs and the irregular temporal sampling inherent to supernova light curves. We train our model on radiative transfer simulations and validate its performance on cross-modality reconstruction of supernova spectra and physical parameters from the simulation. Our model achieves superior performance in cross-modality generation to nearest-neighbor searches in a contrastively-trained latent space, showing its promise for constructing informative latent representations of multi-modal astronomical datasets.\n\n", "2507.16766": "2025-07-22, **Discovery of SiC and Iron Dust Around AGB Stars in the very Metal-Poor Sextans A Dwarf Galaxy with JWST: Implications for Dust Production at High Redshift**, M. L. Boyer et.al., [2507.16766v1](http://arxiv.org/abs/2507.16766v1)\n\n Low-resolution infrared spectroscopy from JWST confirms the presence of SiC and likely metallic iron dust around asymptotic giant branch (AGB) stars in the Sextans A dwarf galaxy, which has a metallicity ~1%-7% Z\\_sun. While metal-poor carbon-rich AGB stars are known to produce copious amounts of amorphous carbon dust owing to the dredge up of newly synthesized carbon, this is the first time that Si- and Fe-bearing dust has been detected at this extreme metallicity. Of the six AGB stars observed, one is an intermediate-mass (~1.2-4 M\\_sun) carbon star showing SiC dust, and another is an oxygen-rich M-type star with mass ~4-5 M\\_sun that is likely undergoing hot bottom burning. The infrared excess of the M-type star is strong, but featureless. We tested multiple dust species, and find that it is best fit with metallic iron dust. Assuming its dust-production rate stays constant over the final 2-3x10^4 yr of its evolution, this star will produce ~0.9-3.7 times the iron dust mass predicted by models, with the range depending on the adopted stellar mass. The implications for dust production in high-redshift galaxies are potentially significant, especially regarding the assumed dust species used in dust evolution models and the timescale of AGB dust formation. Stars on the upper end of the AGB mass range can begin producing dust as early as 30-50 Myr after they form, and they may therefore rival dust production by supernovae at high redshift.\n\n", "2507.16757": "2025-07-22, **A double-degenerate scenario with a merger to explosion delay time to explain type Ia supernova SN 2020aeuh**, Noam Soker et.al., [2507.16757v1](http://arxiv.org/abs/2507.16757v1)\n\n I suggest the double-degenerate (DD) scenario with a merger-to-explosion delay (MED) time (the DD-MED scenario) of about 1-2 years to explain the rare properties of the recently analyzed type Ia supernova (SN Ia) SN 2020aeuh. The rare properties are the SN Ia ejecta interacting with a carbon-oxygen (CO)-rich circumstellar material (CSM) at approximately 50 days post-explosion. In this DD-MED scenario, two massive CO white dwarfs (WDs), masses of M1=1.1Mo and M2=1, merge to leave a rapidly rotating lonely WD of about the Chandrasekhar mass. The merger process ejects 0.7Mo to form a nonspherical CO-rich CSM. At the explosion, there is a lonely WD and a detached hydrogen- and helium-deficient CSM. Studies proposed the other lonely WD scenario, the core-degenerate (CD) scenario, to explain several specific SNe Ia and SN Ia remnants. SN 2020aeuh is the first particular SN Ia that is attributed to the DD-MED scenario. Besides being slightly brighter than typical SNe Ia and the CSM interaction, SN 2020aeuh is a normal SN Ia. Therefore, this study strengthens the claim that the lonely WD scenarios, i.e., the DD-MED and CD scenarios, account for most, if not all, normal SNe Ia; all SN Ia scenarios, whether lonely WD or not, might contribute to peculiar SNe Ia.\n\n", "2507.16700": "2025-07-22, **The GHOSDT Simulations: II. Missing Molecules in Simulations of a Self-Regulated Interstellar Medium**, Alon Gurman et.al., [2507.16700v1](http://arxiv.org/abs/2507.16700v1)\n\n Observations in the Galaxy and nearby spirals have established that the HI-to-H$\\_2$ transition at solar metallicity occurs at gas weight of $P\\_{\\rm DE}/k\\_B\\approx 10^4 \\ \\rm K \\ cm ^{-3}$, similar to solar neighbourhood conditions. Even so, state-of-the-art models of a self-regulated interstellar medium underproduce the molecular fraction ($R\\_{\\rm mol}\\equiv M\\_{\\rm H\\_2}/M\\_{\\rm HI}$) at solar neighbourhood conditions by a factor of $\\approx2-4$. We use the GHOSDT suite of simulations at a mass resolution range of $100-0.25\\ M\\_{\\odot}$ (effective spatial resolution range of $\\sim 20-0.05\\ \\rm pc$) run for 500 Myr to show how this problem is affected by modeling choices such as the inclusion of photoionizing radiation, assumed supernova energy, numerical resolution, inclusion of magnetic fields, and including a model for sub-grid clumping. We find that $R\\_{\\rm mol}$ is not converged even at a resolution of 1 $M\\_{\\odot}$, with $R\\_{\\rm mol}$ increasing by a factor of 2 when resolution is improved from 10 to $1\\ M\\_{\\odot}$. Models excluding either photoionization or magnetic fields result in a factor 2 reduction in $R\\_{\\rm mol}$. The only model that agrees with the observed value of $R\\_{\\rm mol}$ includes our sub-grid clumping model, which enhances $R\\_{\\rm mol}$ by a factor of $\\sim3$ compared with our fiducial model. This increases the time-averaged $R\\_{\\rm mol}$ to $0.25$, in agreement with the Solar circle value, and closer to the observed median value of $0.42$ in regions comparable to the solar neighbourhood in nearby spirals. Our findings show that small-scale clumping in the ISM plays a significant role in H$\\_2$ formation even in high-resolution numerical simulations.\n\n", "2507.16613": "2025-07-22, **Alpha clustering in warm and dense nuclear matter from heavy-ion collisions**, Rui Wang et.al., [2507.16613v1](http://arxiv.org/abs/2507.16613v1)\n\n Although light nuclear clusters are known to affect the properties of warm and dilute nuclear matter, their role in warm and dense nuclear matter remains unclear due to the lack of experimental evidence for their modifications by the Mott effect in such an environment. To address this issue, we resort to intermediate-energy heavy-ion collisions, where light clusters are mainly produced in the transiently formed warm and dense matter. A kinetic approach, which includes dynamically the formation and dissociation of light clusters, is employed to deduce the strength of the Mott effects and the $\\alpha$-particle fraction in warm and dense nuclear matter from the light-nuclei yields measured by the FOPI Collaboration in central Au$+$Au collisions at energies of $0.25A$ to $0.6A~\\rm GeV$. We find an unexpectedly abundant $\\alpha$ clustering in this environment, which will have profound implications for modeling the nuclear equation of state and describing supernovae and neutron star mergers.\n\n", "2507.16147": "2025-07-22, **Observational constraints on phenomenological emergent dark energy and barotropic dark matter characterized by a constant equation of state parameter**, Jian-Qi Liu et.al., [2507.16147v1](http://arxiv.org/abs/2507.16147v1)\n\n While cold dark matter is widely supported by a range of cosmological observations, it encounters several difficulties at smaller scales. These issues have prompted the investigation of various alternative dark matter candidates, leaving the question \"What is dark matter?\" still open. In this work, we propose a new cosmological model that considers dark matter as a barotropic fluid with a constant equation of state parameter and interprets dark energy as the phenomenological emergent dark energy rather than a cosmological constant. We then place constraints on our new model using the Planck 2018 Cosmic Microwave Background (CMB) anisotropy measurements, Baryon Acoustic Oscillation (BAO) measurements from the Dark Energy Spectroscopic Instrument (DESI), the Pantheon Plus (PP) compilation of Type Ia supernovae (Ia SNe), and the Redshift Space Distortions (RSD) data from Gold2018. The results show statistically significant signal for positive dark matter equation of state and square of sound speed $w\\_{\\rm dm}=c\\_{\\rm s,dm}^2$ ($10^{7}w\\_{\\rm dm}$ = $4.0^{+2.5}\\_{-2.3}$ at the 95\\% confidence level) for the data combination CMB+DESI+PP+RSD. However, Bayesian evidence indicates that this data combination favors the $\\Lambda$CDM model with very strong evidence.\n\n"}}