{"neutrino": {"2506.18566": "2025-06-23, **Cosmic Ray Detection with the IceTop Enhancement**, Megha Venugopal et.al., [2506.18566v1](http://arxiv.org/abs/2506.18566v1)\n\n IceTop is the cosmic-ray detector located on the surface of the IceCube Neutrino Observatory at the South Pole, consisting of 81 pairs of ice-Cherenkov tanks. The rise in the energy threshold of air-shower measurements in IceTop due to accumulating snow emphasized the need for the next generation of IceCube surface detectors. For this purpose, the Surface Array Enhancement (SAE) is set to comprise elevated scintillator panels and radio antennas controlled by hybrid DAQ systems. The detectors of the SAE are also expected to extend to the planned IceCube-Gen2 Surface Array. An initial study with a prototype station is already conducted. We briefly review the SAE and the deployment as well as the calibration status of the upcoming stations of the planned array of 32 stations. The focus of this contribution is on the radio detection of extensive air showers. A preliminary estimation of the position of the shower maximum ($X\\_\\mathrm{max}$), that is sensitive to the primary mass, with data from the 3 antennas of the prototype station was carried out. An extension of the method from previous analyses is also briefly discussed.\n\n", "2506.18490": "2025-06-23, **Flash Ionization of the Early Universe by Pop III.1 Supermassive Stars**, Jonathan C. Tan et.al., [2506.18490v1](http://arxiv.org/abs/2506.18490v1)\n\n The Pop III.1 theory for supermassive black hole (SMBH) formation predicts that a substantial fraction of the early universe was ionized by supermassive stars at redshifts $z\\sim20-30$, an era we refer to as ``The Flash''. This is followed by recombination to a mainly neutral state within a few tens of Myr. Here we discuss the implication of this ionization for the scattering optical depth of the cosmic microwave background (CMB), $\\tau$. We find a fiducial contribution of $\\tau\\_{\\rm PopIII.1}\\sim0.04$. Combining this with the contribution to reionization by standard galaxy populations at $z\\lesssim 10$ with $\\tau\\_{\\rm gal}\\simeq0.06$, yields a total of $\\tau\\simeq0.10$. As noted recently by several authors, such a value can help resolve apparent ``problems'' faced by $\\Lambda$CDM of negative neutrino masses and dynamical dark energy that have been implied by recent Baryonic Acoustic Oscillation (BAO) results from the Dark Energy Spectroscopic Instrument (DESI).\n\n", "2506.18051": "2025-06-22, **The Scotogenic Model with Two Inert Doublets: Parameters Space and Electroweak Precision Tests**, Abdelrahman AbuSiam et.al., [2506.18051v1](http://arxiv.org/abs/2506.18051v1)\n\n In this work, we study a scotogenic extension of the Standard Model featuring two inert scalar doublets and three singlet Majorana fermions, where neutrino masses are generated radiatively at one loop. The lightest among the Majorana fermions and neutral scalars can serve as dark matter candidates. We explore the parameter space, considering theoretical constraints (perturbativity, unitarity, vacuum stability) and experimental limits (lepton flavor violation, Higgs measurements, electroweak precision observables). Our analysis identifies regions where sizable Yukawa couplings naturally arise due to constructive interference in the scalar sector. Additionally, we estimate the oblique parameters, finding that only $\\Delta T$ is sensitive to charged mass splittings, while $\\Delta S$ and $\\Delta U$ remain small across the viable parameter space. However, 60\\% of the viable parameter space is excluded by the recent CMS measurement of the $W$ boson mass, since the shift $\\Delta M\\_W$ depends on the oblique parameters, particularly $\\Delta T$ that is sensitive to scalar mass splittings.\n\n"}, "dark matter": {"2506.18892": "2025-06-23, **$g$-mode oscillations of dark matter admixed neutron stars**, Swarnim Shirke et.al., [2506.18892v1](http://arxiv.org/abs/2506.18892v1)\n\n We investigate $g$-mode oscillations in dark matter admixed neutron stars employing a relativistic mean field model to describe hadronic matter and a model for self-interacting fermionic dark matter motivated by the neutron decay anomaly. Following the construction of such admixed configurations, we derive the equilibrium and adiabatic speeds of sound therein, leading to a computation of the star's $g$-mode spectrum in the Cowling approximation. In particular, we explore the effect of dark matter self-interaction, the nucleon effective mass and dark matter fraction on the principal $g$-mode frequency, and its first overtone. We show that the effect on $g$-mode frequency depends predominantly on the dark matter fraction, and demonstrate an equation of state-independent constraint for the latter. Prospects of identifying the presence of dark matter in neutron stars using $g$-mode are discussed.\n\n", "2506.18595": "2025-06-23, **Search for dark-matter axions beyond the quantum limit: the Cosmological Axion Sarov Haloscope (CASH) proposal**, Andrey L. Pankratov et.al., [2506.18595v1](http://arxiv.org/abs/2506.18595v1)\n\n Firmly established in astrophysical observations, dark matter evades direct detection in experiments. Axions and axion-like particles are among the leading dark-matter candidates, and numerous attempts to detect them in laboratories have been performed. Here, we propose to advance these efforts substantially, extending the sensitivity for dark-matter axions in the mass range $(38-54)~\\mu$eV down to the axion-photon couplings $g\\_{a\\gamma\\gamma}\\lesssim \\left(10^{-14}-10^{-15}\\right)$ GeV$^{-1}$, motivated by generic models of Quantum Chromodynamics axion. Single-photon detectors operating at ultra-low temperatures are key elements of the experiment. The projected sensitivity will be reached in one year of data taking with magnetic field of $(1-10)$ T, making Cosmological Axion Sarov Haloscope (CASH) the most sensitive haloscope in this mass range.\n\n", "2506.18477": "2025-06-23, **Cosmic Sign-Reversal: Non-Parametric Reconstruction of Interacting Dark Energy with DESI DR2**, Yun-He Li et.al., [2506.18477v1](http://arxiv.org/abs/2506.18477v1)\n\n A direct interaction between dark energy and dark matter provides a natural and important extension to the standard $\\Lambda$CDM cosmology. We perform a non-parametric reconstruction of the vacuum energy ($w=-1$) interacting with cold dark matter using the cosmological data from DESI DR2, Planck CMB, and three SNIa samples (PP, DESY5, and Union3). By discretizing the coupling function $\\beta(z)$ into 20 redshift bins and assuming a Gaussian smoothness prior, we reconstruct $\\beta(z)$ without assuming any specific parameterization. The mean reconstructed $\\beta(z)$ changes sign during cosmic evolution, indicating an energy transfer from cold dark matter to dark energy at early times and a reverse flow at late times. At high redshifts, $\\beta(z)$ shows a $\\sim 2\\sigma$ deviation from $\\Lambda$CDM. At low redshifts, the results depend on the SNIa sample: CMB+DESI and CMB+DESI+PP yield $\\beta(z)$ consistent with zero within $2\\sigma$, while CMB+DESI+DESY5 and CMB+DESI+Union3 prefer negative $\\beta$ at $\\sim2\\sigma$. Both $\\chi^2$ tests and Bayesian analyses favor the $\\beta(z)$ model, with CMB+DESI DR2+DESY5 showing the most significant support through the largest improvement in goodness of fit ($\\Delta\\chi^2\\_{\\rm MAP}=-17.76$) and strongest Bayesian evidence ($\\ln\\mathcal{B} = 5.98 \\pm 0.69$). Principal component analysis reveals that the data effectively constrain three additional degrees of freedom in the $\\beta(z)$ model, accounting for most of the improvement in goodness of fit. Our results demonstrate that the dynamical dark energy preference in current data can be equally well explained by such a sign-reversal interacting dark energy, highlighting the need for future observations to break this degeneracy.\n\n", "2506.18457": "2025-06-23, **Observable signatures of Black Holes with Hernquist Dark Matter Halo having a cloud of strings: From Geodesics to Shadow**, Faizuddin Ahmed et.al., [2506.18457v1](http://arxiv.org/abs/2506.18457v1)\n\n We present a comprehensive theoretical investigation of a novel black hole (BH) spacetime: a Schwarzschild BH embedded in a Hernquist-type dark matter halo (HDMH) and surrounded by a cloud of cosmic strings (CSs) -- collectively termed the Schwarzschild-HDMH with CS (SHDMHCS) configuration. By analyzing the spacetime geometry, we explore how key parameters -- the core radius and halo density of the dark matter, along with the string tension -- affect the geodesic motion of both massless and massive particles. Our results reveal that the combined influence of HDMH and CSs modifies the effective potentials for null and timelike geodesics, leading to distinct dynamical behavior compared to standard Schwarzschild geometry. We perform a perturbative analysis for scalar (spin-0), electromagnetic (spin-1), and Dirac (spin-1/2) fields, deriving the associated effective potentials and showing how both the dark halo and CSs alter field propagation and potential barriers. The shadow of the BH is studied in detail: we derive analytical expressions for photon sphere and shadow radii, finding that CSs tend to enlarge the shadow, while HDMH properties tend to shrink it. The combined effects of these parameters significantly influence the shadow's shape and size, producing potentially observable signatures. Our results establish that the SHDMHCS configuration yields distinct observational imprints detectable by present and forthcoming astrophysical instruments. This framework provides new tools for probing exotic matter distributions via gravitational wave observations, orbital dynamics, and high-resolution black hole imaging, offering a pathway to distinguish such configurations from simpler BH models in realistic environments.\n\n", "2506.18442": "2025-06-23, **Revisiting the Electroweak Supersymmetry from the Generalized Minimal Supergravity**, Imtiaz Khan et.al., [2506.18442v1](http://arxiv.org/abs/2506.18442v1)\n\n We explore the Electroweak Supersymmetry (EWSUSY) scenario within the Minimal Supersymmetric Standard Model (MSSM) under the Generalized Minimal Supergravity (GmSUGRA) framework, given that the anomalous magnetic moment of the muon may now be consistent with the Standard Model (SM) prediction, we consider both signs of the Higgsino mass parameter, $\\mu < 0$ and $\\mu > 0$. A comprehensive scan of the parameter space is performed, subject to the experimental constraints from the LHC SUSY searches, Planck 2018 relic density, and LUX-ZEPLIN (LZ) direct detection limits. We identify the viable regions featuring neutralino dark matter production via coannihilation with stau, chargino, stop, sbottom, and gluino, as well as through $A$-funnel, Higgs-resonance, and $Z$-resonance mechanisms. Notably, the $\\mu < 0$ scenario yields a broader allowed parameter space, including for the first time sbottom-neutralino coannihilation solutions in GmSUGRA, which are absent for $\\mu > 0$. While the Higgs-pole and $Z$-pole regions for $\\mu > 0$ are largely excluded by the current LZ bounds, substantial viable regions remain for $\\mu < 0$. Gluino coannihilation scenarios are strongly constrained by the current LHC data. The characteristic mass ranges of interest include sbottoms (0.7-1.3~TeV), stops (up to 1.0~TeV for $\\mu > 0$ and 1.3~TeV for $\\mu < 0$), staus and charginos (up to 1.5~TeV), and pseudoscalar Higgs bosons in the $A$-funnel (0.4-1.4~TeV). Moreover, the supersymmetric contributions to the muon anomalous magnetic moment remain within a $2\\sigma$ deviation from the SM prediction. And our findings suggest that significant portions of the parameter space can be probed at the future LHC SUSY searches and upcoming dark matter direct detection experiments.\n\n", "2506.18411": "2025-06-23, **A new Limit for Axion Dark Matter with SPACE**, M. A. Akgümüs et.al., [2506.18411v1](http://arxiv.org/abs/2506.18411v1)\n\n The axion, which has yet to be discovered, is a promising candidate for dark matter that emerges from Peccei-Quinn theory. This article presents the search for axion dark matter with the \"Student Project for an Axion Cavity Experiment\" (SPACE), which is also the first one in Germany. The hypothetical particle was looked for in the mass range from $16.626~\\mathrm{\\mu eV}$ to $16.653~\\mathrm{\\mu eV}$, corresponding to a frequency range of 4.020 GHz to 4.027 GHz, using a resonant cavity in a peak magnetic field of 14 T. No significant signal was found, allowing us to exclude an axion-photon coupling $g\\_{a\\gamma\\gamma} = 14.6 \\cdot 10^{-13}~\\mathrm{GeV}^{-1}$ for the full mass range and $g\\_{a\\gamma\\gamma} = 2.811 \\cdot 10^{-13}~\\mathrm{GeV}^{-1}$ at peak sensitivity with a 95\\% confidence level. This limit surpasses previous constraints by more than two orders of magnitude.\n\n", "2506.18153": "2025-06-22, **Self-Interacting Dark-Matter Spikes and the Final-Parsec Problem: Bayesian constraints from the NANOGrav 15-Year Gravitational-Wave Background**, Shreyas Tiruvaskar et.al., [2506.18153v1](http://arxiv.org/abs/2506.18153v1)\n\n A self-interacting dark-matter (SIDM) density spike around merging supermassive black holes (SMBHs) may be able to supply the dynamical friction needed to shrink binaries from $\\sim 1\\, \\mathrm{pc}$ to $\\sim 10^{-2} \\,\\mathrm{pc}$, thereby resolving the long-standing ``final-parsec problem.'' Embedding the binary-halo system in a cosmological population model, we evolve the inspiral under the combined influence of gravitational-wave (GW) emission and SIDM drag, compute the resulting nanohertz GW background, and confront it with the NANOGrav 15 year pulsar-timing data. A six-parameter Bayesian analysis, performed with a Gaussian-process-accelerated Markov chain Monte Carlo, yields posterior constraints on the cross-section per unit mass and maximum circular velocity values that were consistent with independent galaxy-rotation and cluster-lensing limits. Within this parameter space, the SIDM spike remains intact, supplies sufficient friction to overcome the stellar depletion barrier, and produces a characteristic-strain spectrum that matches the NANOGrav signal as well as phenomenological astrophysical models.\n\n", "2506.18077": "2025-06-22, **Radiatively Corrected Starobinsky Inflation and Primordial Gravitational Waves in Light of ACT Observations**, Waqas Ahmed et.al., [2506.18077v1](http://arxiv.org/abs/2506.18077v1)\n\n Nonminimal coupling between the inflaton and the Ricci scalar plays a crucial role in shaping the predictions of single-field inflationary models. While a quartic potential with such coupling represents one of the simplest realizations compatible with cosmological observations, it generically receives important radiative corrections when the inflaton interacts with other fields, particularly those involved in the reheating process. In this work, we focus on radiative corrections arising from bosonic scalar couplings and study their impact on inflationary dynamics within the nonminimally coupled quartic potential framework. We demonstrate that bosonic corrections, unlike fermionic ones, yield predictions more compatible with the latest constraints from the Atacama Cosmology Telescope (ACT) Data Release 6, especially when combined with Planck and BICEP/Keck data. We begin with a general model involving a gauge-singlet real scalar inflaton coupled to a complex scalar field, which could be the Standard Model Higgs or a GUT Higgs. As a concrete realization, we also investigate the case where the inflaton serves as a dark matter candidate through a Higgs portal interaction while highlighting its potential to generate observable levels of primordial gravitational waves. Notably, the nonminimally coupled inflation model studied here is field-theoretically equivalent to the Starobinsky model, and the inclusion of quantum corrections from scalar fields leads to characteristic imprints in the $(n\\_s, r)$ plane, allowing for refined constraints on scalar couplings from current and future observations.\n\n"}, "supernova": {"2506.18681": "2025-06-23, **TeV spectral bump of cosmic-ray protons and helium nuclei: the role of nearby supernova remnants**, Sourav Bhadra et.al., [2506.18681v1](http://arxiv.org/abs/2506.18681v1)\n\n The existence of nearby discrete cosmic-ray sources can lead to many interesting effects on the observed properties of cosmic rays. Recent measurements of cosmic rays with the CALET and the DAMPE experiments have revealed a bump-like new feature in the proton and helium spectra in the energy range of ~ (1-100) TeV/nucleon. The origin of the feature is not clearly understood. In this paper, considering an improved and more detailed analysis than previous works, and using an updated age and distance estimates of nearby supernova remnants along with an energy-dependent escape process for cosmic rays from the remnants, we show that the spectral bump can be explained by the contribution of cosmic rays from the nearby supernova remnants, in particular, the Vela remnant. We also show that the contribution from the nearby remnants agrees well with the observed spectra of the heavier cosmic-ray elements from carbon to iron as well as with the measured all-particle cosmic-ray spectrum beyond the knee region when combined with a background flux of cosmic rays originating from distant supernova remnants.\n\n", "2506.18518": "2025-06-23, **The undetectable fraction of core-collapse supernovae in luminous infrared galaxies**, I. Mäntynen et.al., [2506.18518v1](http://arxiv.org/abs/2506.18518v1)\n\n A large fraction of core-collapse supernovae (CCSNe) in luminous infrared galaxies (LIRGs) remain undetected due to extremely high line-of-sight host galaxy dust extinction, and strong contrast between the SN and the galaxy background in the central regions of LIRGs, where the star formation is concentrated. This fraction of undetected CCSNe, unaccounted for by typical extinction corrections, is an important factor in determining CCSN rates, in particular at redshifts $z \\gtrsim 1$, where LIRGs dominate the cosmic star formation. Our aim is to derive a robust estimate for the undetected fraction of CCSNe in LIRGs in the local Universe. Our study is based on the K-band multi-epoch SUNBIRD survey data set of a sample of eight LIRGs using the Gemini-North Telescope with the ALTAIR/NIRI laser guide star adaptive optics system. We used simulated SNe and a standard image subtraction method to determine limiting detection magnitudes for the data set. Subsequently, we used a Monte Carlo method to combine the limiting magnitudes with the survey cadence, and an adopted distribution of CCSN subtypes and their light curve evolution to determine SN detection probabilities. Lastly, we combined these probabilities with the intrinsic CCSN rates of the sample galaxies estimated based on their detailed radiative transfer modeling to derive the fraction of undetectable CCSNe in local LIRGs. For high angular resolution near-infrared surveys, we find an undetectable fraction of $66.0^{+8.6}\\_{-14.6}$\\%, assuming that CCSNe with host extinctions up to $A\\_V$ = 16 mag are detectable, corresponding to the most obscured CCSN discovered in our data set. Alternatively, assuming a host extinction limit of $A\\_V$ = 3 mag, corresponding to typical optical surveys, we find an undetectable CCSN fraction of $89.7^{+2.6}\\_{-4.4}$\\%.\n\n", "2506.18422": "2025-06-23, **From Barthel Randers Kropina Geometries to the Accelerating Universe: A Brief Review of Recent Advances in Finslerian Cosmology**, Amine Bouali et.al., [2506.18422v1](http://arxiv.org/abs/2506.18422v1)\n\n We review recent developments in cosmological models based on Finsler geometry and extensions of general relativity within this framework. Finsler geometry generalizes Riemannian geometry by allowing the metric tensor to depend on position and an additional internal degree of freedom, typically represented by a vector field at each point of the spacetime manifold. We explore whether Finsler-type geometries can describe gravitational interaction and cosmological dynamics. In particular, we examine the Barthel connection and $(\\alpha, \\beta)$ geometries, where $\\alpha$ is a Riemannian metric and $\\beta$ is a one-form. For a specific construction of $\\beta$, the Barthel connection coincides with the Levi-Civita connection of the associated Riemann metric. We review gravitational field and cosmological evolution in three geometries: Barthel-Randers ($F = \\alpha + \\beta$), Barthel-Kropina ($F = \\alpha^2 \\beta$), and the conformally transformed Barthel-Kropina geometry. After presenting the mathematical foundations of Finslerian-type modified gravity theories, we derive generalized Friedmann equations in these geometries assuming a Friedmann-Lema\\^itre-Robertson-Walker type metric. We also present the matter-energy balance equations, interpreting them from the perspective of thermodynamics with particle creation. The cosmological properties of Barthel-Randers and Barthel-Kropina models are explored in detail. The additional geometric terms in these models can be interpreted as an effective dark energy component, generating an effective cosmological constant. Several cosmological solutions are compared with observational data (Cosmic Chronometers, Type Ia Supernovae, Baryon Acoustic Oscillations) using MCMC analysis. A comparison with the $\\Lambda$CDM model shows that Finslerian models fit observational data well, suggesting they offer a viable alternative to general relativity.\n\n", "2506.18146": "2025-06-22, **Discovery of diffuse $γ$-ray emission in the vicinity of G213.0-0.6: Supernova remnant versus massive star-forming region**, Yuan Li et.al., [2506.18146v1](http://arxiv.org/abs/2506.18146v1)\n\n We report the discovery of high-energy $\\gamma$-ray emission in the vicinity of G213.0-0.6, which is debated as a supernova remnant (SNR) or an ionized hydrogen (H$\\_{\\rm{II}}$) region. Using 16-yr Pass 8 data from Fermi Large Area Telescope (Fermi-LAT), we found three extended sources with different photon spectra in this region, which will label as SrcA, SrcB and SrcC. Among them, the $\\gamma$-ray source SrcA with a log-parabola spectrum is spatially coincident with a star-forming region and several OB stars. The power-law spectra source SrcB is spatially coincident with a SNR radio shell. SrcC with a harder power-law photon spectrum is located outside of the radio shell structure. All of them are spatially coincident with a dense molecular cloud (MC) in the velocity range of 35 - 54 km s$^{-1}$. In this scenario, SrcB can be interpreted as the GeV counterpart of the SNR, and its $\\gamma$-ray emission originates from the shock-cloud interaction. SrcA and SrcC originate from the escaped CRs illuminating nearby MC. For SrcA, another possibility is that the $\\gamma$-ray emission originates from a young stellar cluster (YSC) associated with a star-forming region (SFR), however, the supporting evidence remains insufficient to draw a definitive conclusion.\n\n", "2506.17933": "2025-06-22, **Holographic dark energy models in $f(Q,T)$ gravity and cosmic constraint**, Xuwei Zhang et.al., [2506.17933v1](http://arxiv.org/abs/2506.17933v1)\n\n In this work, we propose a new model that combines holographic dark energy with modified gravity $f(Q,T)$ to explore a possible explanation for the accelerated expansion of the universe. We incorporate the holographic principle into non-metric gravity with non-minimal matter coupling and introduce the Barrow holographic dark energy model to account for a tighter corrections, allowing for a more generalized discussion. Furthermore, we perform parameter estimation using the latest observational data, including Type Ia supernova, BAO and Hubble parameter direct measurements. Our results show that the model provides a theoretical framework to describe late-time cosmic evolution and the universe's accelerated expansion. Despite the additional complexity introduced, the model offers a viable approach for investigating dark energy within modified gravity theories.\n\n", "2506.17926": "2025-06-22, **Cosmic Distance Duality Relation with DESI DR2 and Transparency**, Xuwei Zhang et.al., [2506.17926v1](http://arxiv.org/abs/2506.17926v1)\n\n The Cosmic Distance Duality Relation (CDDR), a fundamental assumption in modern cosmology, posits a direct link between angular diameter distance and luminosity distance. This study presents a comprehensive, model-independent, and data-driven test of the CDDR using a combination of cosmological observations, including Supernovae (SN), Baryon Acoustic Oscillations (BAO), and Hubble parameter ($H(z)$) measurements. We employ both Gaussian Process Regression (GPR) and a novel Compressed Point (CPI) method for reconstructing the CDDR, alongside four distinct parameterizations for potential deviations. Nuisance parameters, such as the supernova absolute magnitude and BAO scale, are rigorously handled via both joint numerical fitting (Method I) and analytic marginalization (Method II). Our findings reveal that while direct reconstruction of the CDDR exhibits no significant deviation (less than 1-$\\sigma$) under specific prior assumptions, a notable departure emerges when the SH0ES prior is incorporated, suggesting a systematic influence from the Hubble constant tension. Independently, our parameterized analysis corroborates the consistency of CDDR and confirms the equivalence of the two constraint methodologies. We also find no significant evidence for cosmic opacity. A comparative assessment of reconstruction techniques indicates that GPR generally yields higher precision. These results emphasize the critical role of prior choices and statistical methods in CDDR analyses, providing valuable insights into fundamental cosmological principles and the ongoing Hubble tension.\n\n"}}