{"neutrino": {"2601.05186": "2026-01-08, **Non-Thermal Leptogenesis in the BLSM with Inverse Seesaw Mechanism**, David Delepine et.al., [2601.05186v1](http://arxiv.org/abs/2601.05186v1)\n\n We investigate the viability of non-thermal leptogenesis in the gauged $U(1)\\_{B-L}$ extension of the Standard Model (BLSM) with an inverse seesaw (ISS) mechanism for neutrino mass generation. In this framework, right-handed neutrinos typically have $\\mathcal{O}(1)$ Yukawa couplings, which induce strong washout effects and render conventional thermal leptogenesis ineffective. We demonstrate that a successful baryogenesis scenario can nevertheless be realized through non-thermal leptogenesis, where right-handed neutrinos are produced from the decay of the heavy $B\\!-\\!L$ Higgs boson $χ$. We explicitly analyze the interplay between the dilution factor $T\\_R/M\\_χ$ and the washout parameter characteristic of the ISS, highlighting the tension between suppressing washout effects and maintaining sufficient reheating. We show that a viable lepton asymmetry can be generated provided the scalar mass spectrum is appropriately tuned, allowing for a reduced reheating temperature while keeping washout under control. The resulting lepton asymmetry is efficiently converted into the observed baryon asymmetry of the Universe via sphaleron processes. Our results establish that the inverse-seesaw $B\\!-\\!L$ model remains a predictive and robust framework for non-thermal leptogenesis and baryogenesis.\n\n", "2601.04939": "2026-01-08, **Multi-Messenger Studies with High-Energy Neutrinos and Gamma Rays: The WST Opportunity**, Fabian Schüssler et.al., [2601.04939v1](http://arxiv.org/abs/2601.04939v1)\n\n The search for the sources of ultra-high-energy cosmic rays (UHECRs) using high-energy neutrinos represents a frontier in high-energy astrophysics. However, a critical bottleneck remains: the ability to rapidly survey the sizable sky areas defined by the localization uncertainties of neutrino detectors and to provide rapid spectroscopic classification of the multitude of optical transients found within them.   By deploying a large field-of-view with high-multiplex Multi-Object Spectroscopy (MOS) on a large aperture telescope, one can instantaneously cover neutrino error circles, thus providing crucial spectroscopic classifications of potential counterparts discovered, for example, by the Vera C. Rubin Observatory (LSST) with unprecedented efficiency. Furthermore, simultaneous operation of a giant panoramic central Integral Field Spectrograph (IFS) would allow for detailed kinematic and environmental characterization of primary candidates. This facility would unlock deep synergies between next-generation neutrino telescopes (IceCube-Gen2, KM3NeT) and gamma-ray observatories (CTAO), transforming unique multi-messenger alerts into a comprehensive physical understanding.\n\n", "2601.04802": "2026-01-08, **Dark NSI & neutrino oscillations : probing via $δ_{CP}$ measurements at DUNE and T2HK**, Dharitree Bezboruah et.al., [2601.04802v1](http://arxiv.org/abs/2601.04802v1)\n\n We investigate the possibility of neutrinos interacting with a scalar dark matter field and the resulting implications for neutrino oscillations in the long-baseline sector. As our Universe is predominantly composed of dark matter, neutrinos propagating over astrophysical and terrestrial baselines inevitably traverse a dark matter background. The coherent forward scattering of neutrinos in such a background induces a medium-dependent correction to the mass-squared term in the effective neutrino Hamiltonian having opposing signs for neutrinos and antineutrinos. We study how the elements of this correction matrix, arising from coherent forward scattering of neutrinos with scalar dark matter background referred to as dark non-standard interactions (dark NSI), modify neutrino oscillation probabilities. Furthermore, we also study the effect of the off-diagonal elements and the associated phases on the measurement of leptonic CP violating phase focusing on the upcoming long-baseline superbeam experiments DUNE and T2HK. We show that dark NSI can lead to substantial enhancement or suppression of CP-violation sensitivity, depending on the true values of the dark NSI phases $φ\\_{αβ}$. We further explored how the synergy of DUNE and T2HK can effectively mitigate the degeneracies due to the dark NSI phases, and can restore or even enhance the CP sensitivity as compared to the standard oscillation scenario.\n\n", "2601.04464": "2026-01-08, **Propagating Uncertainties from Nuclear Physics to Gamma-rays in Core Collapse Supernovae**, Chris L Fryer et.al., [2601.04464v1](http://arxiv.org/abs/2601.04464v1)\n\n Nuclear yields are powerful probes of supernova explosions, their engines and their progenitors. In addition, as we improve our understanding of these explosions, we can use nuclear yields to probe dense matter and neutrino physics, both of which play a critical role in the central supernova engine. Especially with upcoming gamma-ray detectors that can directly detect radioactive isotopes out to increasing distances from gamma-rays emitted during their decay, nuclear yields have the potential to provide some of the most direct probes of supernova engines and stellar burning. To utilize these probes, we must understand and limit the uncertainties in their production. Uncertainties in the nuclear physics can be minimized by combining both laboratory experiments and nuclear theory. Similarly, astrophysical uncertainties caused by simplified explosion trajectories can be minimized by higher-fidelity stellar-evolution and supernova-engine models. This paper reviews the physics and astrophysics uncertainties in modeling nucleosynthetic yields, identifying the key areas of study needed to maximize the potential of supernova yields as probes of astrophysical transients and dense-matter physics.\n\n"}, "dark matter": {"2601.05235": "2026-01-08, **Mimicking Phantom Dark Energy with Evolving Dark Matter Mass**, Lorenzo La Penna et.al., [2601.05235v1](http://arxiv.org/abs/2601.05235v1)\n\n We present a general method to reproduce a given cosmological background through energy exchange between dark energy (DE) and dark matter (DM). This can be simply realized with a standard quintessence scalar field that controls the DM mass. In particular a background with phantom crossing can be effectively realized without introducing ghosts or other pathologies. For example one can reproduce exactly the background that gives the best fit to the recent DESI+CMB+DESY5 data, within the Chevallier-Polarski-Linder (CPL) parametrization of DE. Although the background evolution is identical, the perturbations differ, leading to modified growth of structures. If the DM mass varies at late times, early-time observables are not modified and can reproduce the main predictions of the target model, but late-time observables are affected. We discuss in particular the effects on the matter power spectrum, CMB lensing and ISW effect. When reproducing the best fit CPL background model, this scenario generically predicts $\\mathcal{O}(10\\%)$ deviations in such observables. However, for suitable choices of parameters, effects on the matter power spectrum can be smaller, motivating a detailed study. In general, energy exchange between DE and DM generates a mismatch between the matter power spectrum and the gravitational potential amplitudes compared to the decoupled case, that can lead to deviations observable in future experiments.\n\n", "2601.05203": "2026-01-08, **Symbolically regressing dark matter halo profiles using weak lensing**, Alicia Martín et.al., [2601.05203v1](http://arxiv.org/abs/2601.05203v1)\n\n The structure of dark matter haloes is often described by radial density profiles motivated by cosmological simulations. These are typically assumed to have a fixed functional form (e.g. NFW), with some free parameters that can be constrained with observations. However, relying on simulations has the disadvantage that the resulting profiles depend on the dark matter model and the baryonic physics implementation, which are highly uncertain. Instead, we present a method to constrain halo density profiles directly from observations. This is done using a symbolic regression algorithm called Exhaustive Symbolic Regression (ESR). ESR searches for the optimal analytic expression to fit data, combining both accuracy and simplicity. We apply ESR to a sample of 149 galaxy clusters from the HSC-XXL survey to identify which functional forms perform best across the entire sample of clusters. We identify density profiles that statistically outperform NFW under a minimum-description-length criterion. Within the radial range probed by the weak-lensing data ($R \\sim 0.3 - 3$ h$^{-1}$ Mpc), the highest-ranked ESR profiles exhibit shallow inner behaviour and a maximum in the density profile. As a practical application, we show how the best-fitting ESR models can be used to obtain enclosed mass estimates. We find masses that are, on average, higher than those derived using NFW, highlighting a source of potential bias when assuming the wrong density profile. These results have important knock-on effects for analyses that utilise clusters, for example cosmological constraints on $σ\\_8$ and $Ω\\_m$ from cluster abundance and clustering. Beyond the HSC dataset, the method is readily applicable to any data constraining the dark matter distribution in galaxies and galaxy clusters, such as other weak lensing surveys, galactic rotation curves, or complementary probes.\n\n", "2601.05069": "2026-01-08, **Constraining the Primoridal Black Hole Abundance with Space-Based Detectors**, Wencong Hong et.al., [2601.05069v1](http://arxiv.org/abs/2601.05069v1)\n\n Overdense regions can collapse into primordial black holes (PBHs) in the early universe, which are a compelling candidate for dark matter. Current constraints leave the asteroid-mass window the only possible one for PBH to account for all the dark matter, which can only be probed indirectly by the scalar-induced gravitational waves (GWs) sourced by the curvature perturbation which forms PBH. In this work, we explore the capabilities of future space-based gravitational wave detectors, including LISA, Taiji, and TianQin, to constrain such induced GWs as well as the PBH abundance. We systematically account for the width of the primordial curvature power spectrum, and find that the asteroid-mass window can be fully probed by all three space-based interferometers. If PBHs constitute the majority of dark matter, the induced GW leaves a strong signal in the mHz band with a signal-to-noise ratio of $10^3\\sim10^4$.\n\n", "2601.04735": "2026-01-08, **sidmkit: A Reproducible Toolkit for SIDM Phenomenology and Galaxy Rotation-Curve Modeling**, Nalin Dhiman et.al., [2601.04735v1](http://arxiv.org/abs/2601.04735v1)\n\n Self-interacting dark matter (SIDM) is a well-motivated extension of cold dark matter that can modify halo structure on galactic and group scales while remaining consistent with large-scale structure. However, practical SIDM work often requires bridging several layers, including microphysical scattering models, velocity-dependent effective cross sections, phenomenological astrophysical constraints, and (separately) data-driven halo fits, such as rotation curves. In this paper, we describe \\texttt{sidmkit}, a transparent and reproducible Python package designed to support SIDM ``micro$\\rightarrow$macro'' calculations and to provide a robust batch pipeline for fitting rotation curves in the SPARC data. On the SIDM side, \\texttt{sidmkit} implements velocity-dependent momentum-transfer cross sections for a Yukawa interaction using standard analytic approximations (Born, classical, and Hulthén-based) with a numerical partial-wave option for spot checks. It also provides consistent velocity-moment averaging for Maxwellian relative speeds, scattering-rate utilities, and curated literature \\emph{summary} constraints for regression tests and exploratory scans. On the rotation-curve side, we implement bounded non-linear least squares fits of NFW and Burkert halo models to SPARC baryonic decompositions, with optional mass-to-light priors and information-criterion summaries (AIC/BIC). For the demonstration dataset, we process 191 \\texttt{rotmod} galaxies (LTG+ETG bundles) and fit both NFW and Burkert models (382 total fits). We find that Burkert is preferred by $Δ\\mathrm{BIC} > 0$ for $65.4\\%$ of galaxies, with ``strong'' preference ($Δ\\mathrm{BIC}>6$) in $32.5\\%$ of galaxies;\n\n", "2601.04576": "2026-01-08, **Search for Ultralight Axion Dark Matter with a Levitated Ferromagnetic Torsional Oscillator**, Chunlong Li et.al., [2601.04576v1](http://arxiv.org/abs/2601.04576v1)\n\n We present a search for ultralight axion dark matter coupled to electron spins using a levitated ferromagnetic torsional oscillator (FMTO). This platform directly measures axion-induced torques on a macroscopic spin-polarized body, combining large spin density with strong mechanical isolation to probe magnetic fluctuations below 10 Hz while suppressing gradient-field noise. In a first implementation, the experiment yielded 18000 s of analyzable data at room temperature under high vacuum with optical readout and triple-layer magnetic shielding. A likelihood-based statistical framework, incorporating stochastic fluctuations in the axion-field amplitude, was used to evaluate the data. No excess consistent with an axion-induced pseudo-magnetic field was observed near 2e-14 eV. To account for possible shielding-induced signal attenuation, we quantify its effect and report both the uncorrected (g\\_aee < 1e-7) and attenuation-corrected (g\\_aee < 6e-5) 90% CL limits on the axion-electron coupling. Looking ahead, improvements guided by both noise-budget analysis and shielding-attenuation considerations, including optimized levitation geometry, cryogenic operation, and superconducting shielding, are expected to boost sensitivity by multiple orders of magnitude.\n\n"}, "supernova": {"2601.05233": "2026-01-08, **Three-dimensional scene reconstruction using Roman slitless spectra**, Tri L. Astraatmadja et.al., [2601.05233v1](http://arxiv.org/abs/2601.05233v1)\n\n The Nancy Grace Roman Space Telescope will carry out a wide-field imaging and slitless spectroscopic survey of Type Ia Supernovae to improve our understanding of dark energy. Crucial to this endeavor is obtaining supernova spectra uncontaminated by light from their host galaxies. However, obtaining such spectra is made more difficult by the inherent problem in wide-field slitless spectroscopic surveys: the blending of spectra of close objects. The spectrum of a supernova will blend with the host galaxy, even from regions distant from the supernova on the sky. If not properly removed, this contamination will introduce systematic bias when the supernova spectra are later used to determine intrinsic supernova parameters and to infer the parameters of dark energy. To address this problem we developed an algorithm that makes use of the spectroscopic observations of the host galaxy at all available observatory roll angles to reconstruct a three-dimensional (3d; 2d spatial, 1d spectral) representation of the underlying host galaxy that accurately matches the 2d slitless spectrum of the host galaxy when projected to an arbitrary rotation angle. We call this ``scene reconstruction''. The projection of the reconstructed scene can be subtracted from an observation of a supernova to remove the contamination from the underlying host. Using simulated Roman data, we show that our method has extremely small systematic errors and significantly less random noise than if we subtracted a single perfectly aligned spectrum of the host obtained before or after the supernova was visible.\n\n"}}