{"neutrino": {"2410.08163": "2024-10-10, **DESI forecast for Dark Matter-Neutrino interactions using EFTofLSS**, Markus R. Mosbech et.al., [2410.08163v1](http://arxiv.org/abs/2410.08163v1)\n\n We apply the Effective Field Theory of Large Scale Structure (EFTofLSS) to non-standard models of dark matter with suppressed small-scale structure imprinted by early-time physics, here exemplified by interacting dark matter (IDM) coupled to standard model neutrinos, and cross-check that the EFTofLSS has no trouble replicating the real-space halo-halo power spectrum from N-body simulations. We perform forecasts for a DESI ELG-like experiment using the redshift-space power spectrum and find that, under very conservative priors on these parameters, the EFTofLSS is not expected to yield strong constraints on dark matter interactions. However, with a better understanding of the evolution of counterterms and stochastic terms with redshift, realistic IDM models could in principle be detected using the full-shape power spectrum analysis of such a spectroscopic galaxy survey.\n\n", "2410.07905": "2024-10-10, **Candidate neutrino-emitting blazars sharing physical properties with TXS 0506+056**, Ilaria Viale et.al., [2410.07905v1](http://arxiv.org/abs/2410.07905v1)\n\n Context. The interest in blazars as candidate neutrino emitters grew after the 3{\\sigma} evidence for a joint photon-neutrino emission from the flaring blazar TXS 0506+056 in 2017. Blazars are a class of extragalactic sources with relativistic jets pointing toward Earth, showing a broadband emission explained in terms of leptonic and hadronic process, with the latter relevant for proton acceleration and neutrino production. Several models have been developed to explain the multi-messenger emission from TXS 0506+056, but the details of the neutrino production and the nature of the source are not yet fully understood. Aims. In this work we investigate sources with observational features as TXS 0506+056, aiming at a better understanding of their nature as flat spectrum radio quasars (FSRQs) or BL Lac Objects (BL Lacs) and their potential neutrino production. Methods. We select candidate neutrino-emitting blazars from the Fermi 4LAC-DR2 catalog by constraining a number of key parameters in specific ranges centered on the values measured for TXS 0506+056. We analyze the efficiency of the accretion mechanism and model their broadband spectral energy distribution in terms of lepto-hadronic emission, gaining information on their potential neutrino flux and detectability prospects at TeV energies. Results. Our study shows the selected sources to have a high energy emission dominated by leptonic processes, and part of them also shows a high accretion rate, features typical of FSRQs. Moreover, the very high energy and neutrino fluxes appear to be not detectable by the current and future instruments if the source is in an average emission state. Our results thus suggest some of the candidates to have an efficient accretion and could potentially be masquerading BL Lacs. Lastly, TXS 0506+056 seems to have a more uncertain situation for which no strong conclusions can be drawn on its nature.\n\n", "2410.07624": "2024-10-10, **Dark Matter Internal Pair Production -- A Novel Detection Mechanism**, Bhaskar Dutta et.al., [2410.07624v1](http://arxiv.org/abs/2410.07624v1)\n\n We propose a novel mechanism, dark matter internal pair production (DIPP), to detect dark matter candidates at beam dump facilities. When energetic dark matter scatters in a material, it can create a lepton-antilepton pair by exchanging a virtual photon with the nucleus, similar to the neutrino trident process. We demonstrate this process for dark matter coupled to dark photons in experiments such as DarkQuest, SBND, and DUNE ND experiments. Since the pair-produced lepton-antilepton pair carries a large fraction of the center-of-mass energy and also has similar energy profiles, they can be clearly distinguished from backgrounds. We utilize the above features to show that DIPP is effective in probing various dark matter models, especially at DUNE ND and DarkQuest, by looking for electron-positron and muon-antimuon signatures. We also consider a scenario with dark sector couplings to quarks and muons only to show that DIPP can probe a wide range of dark matter models with various final states.\n\n", "2410.07604": "2024-10-10, **The light burden of memory: constraining primordial black holes with high-energy neutrinos**, Marco Chianese et.al., [2410.07604v1](http://arxiv.org/abs/2410.07604v1)\n\n Recent studies point out that quantum effects, referred to as \"memory burden\", may slow down the evaporation of black holes. As a result, a population of light primordial black holes could potentially survive to the present day, thus contributing to the energy density of dark matter. In this work, we focus on light primordial black holes with masses $M\\_{\\rm PBH} \\lesssim 10^{9}~{\\rm g}$ that, due to the memory burden effect, are currently evaporating, emitting high-energy particles, among which neutrinos, in the local Universe. Analyzing the latest IceCube data, we place novel constraints on the combined parameter space of primordial black holes and the memory burden effect. We also study the projected reach of future neutrino telescopes such as IceCube-Gen2 and GRAND. We find that the neutrino observations are crucial to probe scenarios with highly-suppressed evaporation and light masses for primordial black holes.\n\n"}, "dark matter": {"2410.07856": "2024-10-10, **Tracking on-the-fly massive black hole binary evolution and coalescence in galaxy simulations: RAMCOAL**, Kunyang Li et.al., [2410.07856v1](http://arxiv.org/abs/2410.07856v1)\n\n The detection of gravitational waves (GWs) from massive black hole binary (MBHB) coalescence motivates the development of a sub-grid model. We present RAMCOAL, integrated into the RAMSES code, which simulates the orbital evolution of MBHBs, accounting for stellar and gaseous dynamical friction (DF), stellar scattering, circumbinary disk interactions, and GW emission at scales below the simulation resolution. Unlike post-processing approaches, RAMCOAL tracks the real-time evolution of MBHBs within hydrodynamical simulations of galaxies using local quantities to model dynamics and accretion. This enables more accurate predictions of both GW signals and the properties of merging black holes. We validate RAMCOAL across isolated and merging galaxy setups at resolutions of 10, 50, and 100 pc, with and without black hole accretion and feedback. In addition, we test the model in seven galaxy merger scenarios at 100 pc resolution. These tests demonstrate that RAMCOAL is largely resolution-independent and successfully captures the effects of DF from stars, dark matter, and gas, loss-cone scattering, viscous drag from circumbinary disks, and GW emission -- all within a realistic galactic environment, even at low resolutions. With RAMCOAL, we can better estimate MBHB coalescence rates and the GW background, while providing insights into the electromagnetic counterparts of GW sources. This approach bridges the gap between electromagnetic observations and GW detection, offering a more comprehensive understanding of MBHB evolution in cosmological simulations.\n\n", "2410.07792": "2024-10-10, **Barions and $Λ$CDM Model Problems**, A. Del Popolo et.al., [2410.07792v1](http://arxiv.org/abs/2410.07792v1)\n\n We examine the inner profiles of the rotation curves of galaxies in the velocity range from dwarf galaxies to Milky-way like galaxies, having maximum of rotation, $V\\_{\\rm max}$, in the range [30-250] km/s, whose diversity is much larger than that predicted by the $\\Lambda$CDM model. After showing that the scatter in the observed rotation curves is much larger that that predicted by dark matter-only cosmologies, we show how taking into account baryons, through a semi-analytical code, allows to create a a variety of rotation curves in agreement with observation. Simultaneoulsy, we show that the the quoted discrepancy does not need for different form of dark matter as advocated by [1], and [2]. We finally show how our model can reobtain the rotation curve of remarkable outliers like IC 2574, a 8 kpc cored profile having a challenging, and extremely low rising rotation curve, and UGC 5721 a cusp-like rotation curve galaxy. We suggest treating baryonic physics properly before introducing new exotic features, albeit legitimate, in the standard cosmological model\n\n", "2410.07562": "2024-10-10, **PSF Calibration of DAMPE for gamma-ray Observations**, Kai-Kai Duan et.al., [2410.07562v1](http://arxiv.org/abs/2410.07562v1)\n\n The DArk Matter Particle Explorer (DAMPE) is dedicated to exploring critical scientific domains including the indirect detection of dark matter, cosmic ray physics, and gamma ray astronomy. This study introduces a novel method for calibrating the Point Spread Function (PSF) of DAMPE, specifically designed to enhance the accuracy of gamma-ray observations. By leveraging data from regions near pulsars and bright Active Galactic Nuclei (AGNs), we have refined the PSF calibration process, resulting in an improved angular resolution that closely matches our observational data. This advancement significantly boosts the precision of gamma-ray detection by DAMPE, thereby contributing to its mission objectives in dark matter detection and gamma ray astronomy.\n\n"}, "supernova": {"2410.08199": "2024-10-10, **Spectropolarimetry of SN 2023ixf reveals both circumstellar material and helium core to be aspherical**, Manisha Shrestha et.al., [2410.08199v1](http://arxiv.org/abs/2410.08199v1)\n\n We present multi-epoch optical spectropolarimetric and imaging polarimetric observations of the nearby Type II supernova (SN) 2023ixf discovered in M101 at a distance of 6.85 Mpc. The first imaging polarimetric observations were taken +2.33 days (60085.08 MJD) after the explosion, while the last imaging polarimetric data points (+73.19 and +76.19 days) were acquired after the fall from the light curve plateau. At +2.33 days there is strong evidence of circumstellar material (CSM) interaction in the spectra and the light curve. A significant level of polarization $P\\_r = 0.88\\pm 0.06 \\% $ seen during this phase indicates that this CSM is aspherical. We find that the polarization evolves with time toward the interstellar polarization level ($0.35\\%$) during the photospheric phase, which suggests that the recombination photosphere is spherically symmetric. There is a jump in polarization ($P\\_r =0.65 \\pm 0.08 \\% $) at +73.19 days when the light curve falls from the plateau. This is a phase where polarimetric data is sensitive to non-spherical inner ejecta or a decrease in optical depth into the single scattering regime. We also present spectropolarimetric data that reveal line (de)polarization during most of the observed epochs. In addition, at +14.50 days we see an \"inverse P Cygn\" profile in the H and He line polarization, which clearly indicates the presence of asymmetrically distributed material overlying the photosphere. The overall temporal evolution of polarization is typical for Type II SNe, but the high level of polarization during the rising phase has only been observed in SN 2023ixf.\n\n", "2410.08141": "2024-10-10, **Parkes Radio and NuSTAR X-ray Observations of the Composite Supernova Remnant B0453-685 in the Large Magellanic Cloud**, Jordan Eagle et.al., [2410.08141v1](http://arxiv.org/abs/2410.08141v1)\n\n Gamma-ray emission is observed coincident in position to the evolved, composite supernova remnant (SNR) B0453-685. Prior multi-wavelength investigations of the region indicate that the pulsar wind nebula (PWN) within the SNR is the most likely origin for the observed gamma-rays, with a possible pulsar contribution that becomes significant at energies below E ~ 5GeV. Constraints on the PWN hard X-ray spectrum are important for the most accurate broadband representation of PWN emission and determining the presence of a gamma-ray pulsar component. The results of Parkes radio and NuSTAR X-ray observations are presented on PWN B0453-685. We perform a search for the central pulsar in the new Parkes radio data, finding an upper limit of 12uJy. A pulsation search in the new NuSTAR observation additionally provides a 3sigma upper-limit on the hard X-ray pulsed fraction of 56%. The PWN is best characterized with a photon index Gamma\\_X = 1.91 +\\- 0.20 in the 3-78keV NuSTAR data and the results are incorporated into existing broadband models. Lastly, we characterize a serendipitous source detected by Chandra and NuSTAR that is considered a new high mass X-ray binary candidate.\n\n", "2410.07956": "2024-10-10, **Constraints on compact objects from the Dark Energy Survey five-year supernova sample**, Paul Shah et.al., [2410.07956v1](http://arxiv.org/abs/2410.07956v1)\n\n Gravitational lensing magnification of Type Ia supernovae (SNe Ia) allows information to be obtained about the distribution of matter on small scales. In this paper, we derive limits on the fraction $\\alpha$ of the total matter density in compact objects (which comprise stars, stellar remnants, small stellar groupings and primordial black holes) of mass $M > 0.03 M\\_{\\odot}$ over cosmological distances. Using 1,532 SNe Ia from the Dark Energy Survey Year 5 sample (DES-SN5YR) combined with a Bayesian prior for the absolute magnitude $M$, we obtain $\\alpha < 0.12$ at the 95\\% confidence level after marginalisation over cosmological parameters, lensing due to large-scale structure, and intrinsic non-Gaussianity. Similar results are obtained using priors from the cosmic microwave background, baryon acoustic oscillations and galaxy weak lensing, indicating our results do not depend on the background cosmology. We argue our constraints are likely to be conservative (in the sense of the values we quote being higher than the truth), but discuss scenarios in which they could be weakened by systematics of the order of $\\Delta \\alpha \\sim 0.04$\n\n", "2410.07800": "2024-10-10, **The radial distribution of radio emission from SN1993J: Magnetic field amplification due to the Rayleigh-Taylor instability**, I. Marti-Vidal et.al., [2410.07800v1](http://arxiv.org/abs/2410.07800v1)\n\n [SHORTENED VERSION] Observations of radio emission from young core-collapse supernovae (CCSNe) allow one to study the history of the pre-supernova stellar wind, trace the density structure of the ejected material, and probe the magnetohydrodynamics that describe the interaction between the two, as the forward shock expands into the circumstellar medium. The radio shell of supernova SN1993J has been observed with very long baseline interferometry (VLBI) for ~20 years, giving one of the most complete pictures of the evolution of a CCSN shock. However, different results about the expansion curve and properties of the radio-emitting structure have been reported by different authors, likely due to systematics in the data calibration and/or model assumptions made by each team. We aim to perform an analysis of the complete set of VLBI observations of SN1993J that accounts for different instrumental and source-intrinsic effects, by exploring the posterior probability distribution of a complete data model, using Markov chains. Our model accounts for antenna calibration effects, as well as different kinds of radio-emission structures for the supernova. The posterior parameter distributions strongly favor a spherical shell-like radio structure with a nonuniform radial intensity profile, with a broad brightness distribution that peaks close to or just above the region where the contact discontinuity is expected to be located. There is clear evidence of a relative widening of the shell width beyond day 2600-3300 after the explosion, due to an increased deceleration of the inner shell boundary. These results suggest a scenario in which the magnetic field is amplified mainly by the Rayleigh-Taylor instability, which emanates from the contact discontinuity. Furthermore, the reverse shock enters a region of the ejecta at around 3000 days, where the density distribution is substantially flatter.\n\n", "2410.07747": "2024-10-10, **Theoretical expectations for high-mass X-ray binaries, supernova remnants, and their evolutionary paths: An overview talk for LIAC41: the eventful life of stellar multiples**, Ilya Mandel et.al., [2410.07747v1](http://arxiv.org/abs/2410.07747v1)\n\n In this invited talk at the 41st Li\\`ege International Astrophysical Colloquium on \"The eventful life of massive star multiples\", I reviewed some aspects of our current understanding of neutron stars and black holes as end products of stellar evolution as well as the evolutionary paths leading to the formation of high-mass X-ray binaries.\n\n"}}