{"neutrino": {"2410.12650": "2024-10-16, **Towards Designing Scalable Quantum-Enhanced Generative Networks for Neutrino Physics Experiments with Liquid Argon Time Projection Chambers**, Andrea Delgado et.al., [2410.12650v1](http://arxiv.org/abs/2410.12650v1)\n\n Generative modeling for high-resolution images in Liquid Argon Time Projection Chambers (LArTPC), used in neutrino physics experiments, presents significant challenges due to the complexity and sparsity of the data. This work explores the application of quantum-enhanced generative networks to address these challenges, focusing on the scaling of models to handle larger image sizes and avoid the often encountered problem of mode collapse. To counteract mode collapse, regularization methods were introduced and proved to be successful on small-scale images, demonstrating improvements in stabilizing the training process. Although mode collapse persisted in higher-resolution settings, the introduction of these techniques significantly enhanced the model's performance in lower-dimensional cases, providing a strong foundation for further exploration. These findings highlight the potential for quantum-enhanced generative models in LArTPC data generation and offer valuable insights for the future development of scalable hybrid quantum-classical solutions in nuclear and high-energy physics.\n\n", "2410.12638": "2024-10-16, **Neutrino and pair creation in reconnection-powered coronae of accreting black holes**, D. Karavola et.al., [2410.12638v2](http://arxiv.org/abs/2410.12638v2)\n\n A ubiquitous feature of accreting black hole systems is their hard X-ray emission which is thought to be produced through Comptonization of soft photons by electrons and positrons in the vicinity of the black hole, in a region with optical depth of order unity. The origin and composition of this Comptonizing region, known as the corona, is a matter open for debate. In this paper we investigate the role of relativistic protons accelerated in black-hole magnetospheric current sheets for the pair enrichment and neutrino emission of AGN coronae. Our model has two free parameters, namely the proton plasma magnetization $\\sigma\\_{\\rm p}$, which controls the peak energy of the neutrino spectrum, and the Eddington ratio $\\lambda\\_{\\rm Edd}$ (defined as the ratio between X-ray luminosity $L\\_{\\rm X}$ and Eddington luminosity $L\\_{\\rm Edd}$), which controls the amount of energy transferred to secondary particles. For sources with $\\lambda\\_{\\rm Edd} \\gtrsim \\lambda\\_{\\rm Edd, crit}$ (where $\\lambda\\_{\\rm Edd, crit} \\sim 10^{-1}$ for $\\sigma\\_{\\rm p}=10^5$ or $\\sim 10^{-2}$ for $\\sigma\\_{\\rm p}=10^7$), proton-photon interactions and $ \\gamma \\gamma$ annihilation produce enough secondary pairs to achieve Thomson optical depths $\\tau\\_{\\rm T} \\sim 0.1-10$. Additionally, we find that the neutrino luminosity scales as $L^2\\_{\\rm X}/L\\_{\\rm Edd}$ for $\\lambda\\_{\\rm Edd} \\lesssim \\lambda\\_{\\rm Edd, crit}$, while it is proportional to $L\\_{\\rm X}$ for higher $\\lambda\\_{\\rm Edd}$ values. We apply our model to four Seyfert galaxies, including NGC 1068, and discuss our results in light of recent IceCube observations.\n\n", "2410.12180": "2024-10-16, **Testable leptogenesis and $0νββ$ decay in extended seesaw model**, Gang Li et.al., [2410.12180v1](http://arxiv.org/abs/2410.12180v1)\n\n We investigate the possibility of observable neutrinoless double beta decay $( 0 \\nu \\beta\\beta)$ and viable leptogenesis within a low-scale extended inverse seesaw mechanism with additional sterile neutrinos. General effective field theory (EFT) considerations suggest that if there are experimentally observable signatures in $0 \\nu \\beta \\beta$-decay and a lepton asymmetry generated by heavy right-handed neutrino decays, thermal leptogenesis is likely to be unviable. However, in this work, we show that in the context of low-scale leptogenesis, one can obtain the observed baryon asymmetry of the universe and observable signatures of $0 \\nu \\beta \\beta$ decay in the presence of additional sterile neutrinos. In this framework, the light neutrino masses are suppressed by the extended seesaw parameter, $\\mu$, thereby allowing for $\\mathcal{O}(10\\, \\mathrm{TeV})$ right-handed (RH) neutrinos, while avoiding small Yukawa couplings as in other neutrino mass models and near degeneracies in the RH neutrino spectrum as required by the low-scale leptogenesis paradigm. Contributions to the $0 \\nu \\beta \\beta$-decay rate from additional sterile neutrinos can be appreciable, while the corresponding contributions to the early universe lepton asymmetry washout rate are suppressed by other parameters not entering the $0 \\nu \\beta \\beta$-decay amplitudes. We show that for keV-MeV scale, sterile neutrinos future ton-scale $0\\nu\\beta\\beta$-decay experiments offer potential signals while maintaining viable leptogenesis.\n\n"}, "dark matter": {"2410.12634": "2024-10-16, **Exploring Quantum Aspects of Dark Matter Axions and Dark Photons Transitions within a Resonant Cavity**, Ruifeng Zheng et.al., [2410.12634v1](http://arxiv.org/abs/2410.12634v1)\n\n When axionic dark matter interacts with a static magnetic field, it can convert into photons with energy near the axion's mass. Classical analysis shows that incorporating a resonant cavity significantly enhances this conversion rate, forming the basis for many experiments aimed at detecting dark matter axions. However, one question remains: Does the axion-photon conversion rate increase for a single axion-photon transition? Answering this issue could lead to optimizations in searching for axions by integrating quantum measurement techniques. In this paper, we demonstrate that at the quantum level, single axion-photon transitions are amplified by the cavity's quality factor $Q$; even if dark matter particles lack coherence, the conversion rate is still enhanced. Furthermore, the quantum perspective reveals an additional factor of $\\pi/2$ in the transition rate compared to the classical result. Additionally, we also provide an analysis of the scenario involving dark photon dark matter.\n\n", "2410.12554": "2024-10-16, **Féeton ($B-L$ Gauge Boson) Dark Matter Testable in Future Direct Detection Experiments**, Yu Cheng et.al., [2410.12554v1](http://arxiv.org/abs/2410.12554v1)\n\n In this paper, we revisit the f\\'eeton (gauge boson of $U(1)\\_{B-L}$ symmetry) dark matter scenario, and first point out the $U(1)$ gauge symmetry can be a linear combination of the $B-L$ and the SM hypercharge gauge symmetries. With the redefinition of $B-L$ charge of fermions, the coupling between electron and f\\'eeton can be enhanced. After showing the parameter space required from the DM stability and cosmic production, we discuss the potential for verifying them in dark matter direct detection experiments. The results show that future experiments, such as SuperCDMS, have a sensitivity to reach the f\\'eeton DM region consistent with its cosmic production.\n\n", "2410.12517": "2024-10-16, **Cosmological Roles of Dark Photons in Axion-induced Electroweak Baryogenesis**, Kwang Sik Jeong et.al., [2410.12517v1](http://arxiv.org/abs/2410.12517v1)\n\n By coupling to both the Higgs and electroweak gauge sectors, an axion can generate the matter-antimatter asymmetry in the universe via electroweak baryogenesis when the axion decay constant lies within the range of approximately $10^5$ and $10^7$ GeV, corresponding to axion masses between the MeV and GeV scales. In this work, we explore the intriguing possibility that the axion interacts with a dark sector, particularly with dark photons through anomalous couplings. Notably, axion-coupled dark photons can play multiple roles, including $(i)$ suppressing the branching ratio of axion decay to Standard Model (SM) particles, which would otherwise conflict with the constraints from supernovae explosions and Big Bang nucleosynthesis, $(ii)$ serving as a candidate for cold dark matter if they are massive and stable, and $(iii)$ contributing to dark radiation if they are ultralight. The axion decouples from the SM thermal bath when it becomes non-relativistic, facilitating the production of dark matter dark photons through the freeze-in mechanism, while dark radiation dark photons are thermally generated prior to the electroweak phase transition.\n\n", "2410.12446": "2024-10-16, **Natural anomaly-mediation from the landscape with implications for LHC SUSY searches**, Dibyashree Sengupta et.al., [2410.12446v1](http://arxiv.org/abs/2410.12446v1)\n\n Supersymmetric models with the anomaly-mediated SUSY breaking (AMSB) have run into serious conflicts with 1. LHC \\textit{sparticle} and Higgs mass constraints, 2. constraints from wino-like WIMP dark matter searches and 3. bounds from naturalness. These conflicts may be avoided by introducing changes to the underlying phenomenological models providing a setting for natural anomaly-mediation (nAMSB). We examine spectra of nAMSB arising from string landscape. Here, we investigated LHC constraints on nAMSB models that allow $m\\_{3/2}$ to lie within 90$-$200 TeV which may soon be discovered or falsified by a combination of 1. soft OS dilepton plus jet+ MET (OSDLJMET) searches which arise from higgsino pair production, 2. non-boosted hadronically decaying wino pair production searches and 3. same-sign diboson + MET searches arising from wino pair production followed by wino decay to W +higgsino. Some excess above SM background in the OSDLJMET channel already seems to be present in both ATLAS and CMS data.\n\n"}, "supernova": {"2410.12674": "2024-10-16, **Modified $f(R,T)$ theory in light of gravitational wave standard sirens**, Mahnaz Asghari et.al., [2410.12674v1](http://arxiv.org/abs/2410.12674v1)\n\n In this paper, we ponder observational constraints on the modified $f(R,T)$ gravity, where the gravitational action is a function of Ricci scalar $R$ plus the trace of the energy-momentum tensor $T$. For this purpose, we utilize recently available data, including cosmic microwave background, weak lensing, supernovae, baryon acoustic oscillations, and redshift-space distortions measurements, together with future gravitational wave data from Laser Interferometer Space Antenna (LISA). In particular, we create three LISA mock catalogs, namely Pop III, Delay, and No Delay, to improve the obtained constraints on cosmological parameters from current observations. Numerical analysis reveals that LISA standard sirens (SS) make improvements on constraining $f(R,T)$ model cosmological parameters. Moreover, MCMC results based on mock LISA SS denote strong evidence in favor of $f(R,T)$ gravity. Thereupon, we perceive that LISA SS are capable to provide novel constraints on modified theories of gravity.\n\n", "2410.12541": "2024-10-16, **Stripping of a neutron star in a close binary system in a pair with a black hole**, Nikita Kramarev et.al., [2410.12541v1](http://arxiv.org/abs/2410.12541v1)\n\n We consider the final evolutionary stages of a neutron star-black hole pair. According to the current paradigm, such systems eventually coalesce, which in some cases is accompanied by neutron-star tidal disruption. Using analytical methods, we show that the scenario of slow (of the order of several seconds) neutron-star stripping by the black hole is also possible, depending on the system parameters (the initial masses and intrinsic angular momenta of the components, the equation of state for the neutron star). Reaching the lower mass limit (about one tenth of the solar mass), the neutron star explodes to produce a comparatively powerful electromagnetic transient. Our population calculations show that the stripping mechanism is possible in 50-90% of the cases among all coalescing neutron star-black hole pairs, depending on the model assumptions about the evolution of close binary systems (the common-envelope efficiency parameter, the supernova explosion mechanism) and the initial metallicity of the stellar population. Because of the large mass of the ejected material, the kilonova emission in this scenario has good prospects of detection.\n\n", "2410.12517": "2024-10-16, **Cosmological Roles of Dark Photons in Axion-induced Electroweak Baryogenesis**, Kwang Sik Jeong et.al., [2410.12517v1](http://arxiv.org/abs/2410.12517v1)\n\n By coupling to both the Higgs and electroweak gauge sectors, an axion can generate the matter-antimatter asymmetry in the universe via electroweak baryogenesis when the axion decay constant lies within the range of approximately $10^5$ and $10^7$ GeV, corresponding to axion masses between the MeV and GeV scales. In this work, we explore the intriguing possibility that the axion interacts with a dark sector, particularly with dark photons through anomalous couplings. Notably, axion-coupled dark photons can play multiple roles, including $(i)$ suppressing the branching ratio of axion decay to Standard Model (SM) particles, which would otherwise conflict with the constraints from supernovae explosions and Big Bang nucleosynthesis, $(ii)$ serving as a candidate for cold dark matter if they are massive and stable, and $(iii)$ contributing to dark radiation if they are ultralight. The axion decouples from the SM thermal bath when it becomes non-relativistic, facilitating the production of dark matter dark photons through the freeze-in mechanism, while dark radiation dark photons are thermally generated prior to the electroweak phase transition.\n\n", "2410.12484": "2024-10-16, **Hot Star Winds**, Andreas A. C. Sander et.al., [2410.12484v1](http://arxiv.org/abs/2410.12484v1)\n\n The properties, impact, and fate of hot stars cannot be understood without considering their winds. Revealed to be an almost ubiquitous phenomenon in the regime of massive stars, the winds of hot stars arise from a complex physical mechanism that still provides a major challenge for our understanding of massive stars. Different flavours of hot stars vary significantly in their winds with current evolution models still having problems to connect the zoo of observed phenomena. Moreover, the driving of hot star winds is inherently connected to the opacities arising from spectral line transitions, making the properties and strength of the winds strongly dependent on metallicity and changing them over cosmic time.   In these proceedings, the current status in our understanding of hot star winds is briefly reviewed and recent progress in our perception of hot star winds and the consequences for the evolution of massive stars are presented. A particular emphasis is given on current efforts with hydrodynamically-consistent atmosphere models towards a better description of radiatively-driven mass loss of Wolf-Rayet stars with remaining hydrogen envelopes.\n\n", "2410.12275": "2024-10-16, **Nearby Supernova and Cloud Crossing Effects on the Orbits of Small Bodies in the Solar System**, Leeanne Smith et.al., [2410.12275v1](http://arxiv.org/abs/2410.12275v1)\n\n Supernova blasts envelop many surrounding stellar systems, transferring kinetic energy to small bodies in the systems. Geologic evidence from $^{60}\\rm Fe$ points to recent nearby supernova activity within the past several Myr. Here, we model the transfer of energy and resulting orbital changes from these supernova blasts to the Oort Cloud, the Kuiper belt, and Saturn's Phoebe ring. For the Oort Cloud, an impulse approximation shows that a 50 pc supernova can eject approximately half of all objects less than 1 cm while altering the trajectories of larger ones, depending on their orbital parameters. For stars closest to supernovae, objects up to $\\sim$100 m can be ejected. Turning to the explored solar system, we find that supernovae closer than 50 pc may affect Saturn's Phoebe ring and can sweep away Kuiper belt dust. It is also possible that the passage of the solar system through a dense interstellar cloud could have a similar effect; a numerical trajectory simulation shows that the location of the dust grains and the direction of the wind (from a supernova or interstellar cloud) has a significant impact on whether or not the grains will become unbound from their orbit in the Kuiper belt. Overall, nearby supernovae sweep micron-sized dust from the solar system, though whether the grains are ultimately cast towards the Sun or altogether ejected depends on various factors. Evidence of supernova-modified dust grain trajectories may be observed by New Horizons, though further modeling efforts are required.\n\n"}}