{"neutrino": {"2408.16748": "2024-08-29, **Non-detection of Neutrinos from the BOAT: Improved Constraints on the Parameters of GRB 221009A**, P. Veres et.al., [2408.16748v1](http://arxiv.org/abs/2408.16748v1)\n\n The IceCube neutrino observatory detects the diffuse astrophysical neutrino background with high significance, but the contribution of different classes of sources is not established. Because of their non-thermal spectrum, gamma-ray bursts (GRBs) are prime particle acceleration sites and one of the candidate classes for significant neutrino production. Exhaustive searches, based on stacking analysis of GRBs however could not establish the link between neutrinos and GRBs. Gamma-ray burst GRB 221009A had the highest time integrated gamma-ray flux of any detected GRB so far. The total fluence exceeds the sum of all Fermi Gamma-ray Burst Monitor (GBM) detected GRBs by a factor of two. Because it happened relatively nearby, it is one of the most favorable events for neutrino production from GRBs yet no neutrinos were detected. We calculate neutrino fluxes for this GRB in the TeV-PeV range using the most accurate, time-resolved spectral data covering the brightest intervals. We place limits on the physical parameters (Lorentz factor, baryon loading or emission radius) of the burst that are better by a factor of 2 compared to previous limits. The neutrino non-detection indicates a bulk Lorentz factor greater than 500 and possibly even 1000, consistent with other observations.\n\n", "2408.16742": "2024-08-29, **Chiral oscillations in quantum field theory**, Victor Bittencourt et.al., [2408.16742v1](http://arxiv.org/abs/2408.16742v1)\n\n Dirac particles have two intrinsic degrees-of-freedom, helicity and chirality. While helicity is conserved in time, chirality is not constant under time evolution for massive particles, yielding the phenomenon of chiral oscillations. So far, chiral oscillations have been mainly described in the framework of single particle relativistic quantum mechanics. In this paper, we present a quantum field theory approach to chiral oscillations in analogy with the one used to describe flavor mixing and oscillations. By taking the expectation value of chiral charges, we obtain the same chiral oscillation formula derived via standard relativistic quantum mechanics. We find that chiral charges are diagonalized by a Bogoliubov transformation: this implies that the vacuum for particles with definite chirality is orthogonal to the one for those with definite energy. In the case of neutrinos, our results can be further extended to include also flavor oscillations.\n\n", "2408.16316": "2024-08-29, **GRAND: status and perspectives**, Kumiko Kotera et.al., [2408.16316v1](http://arxiv.org/abs/2408.16316v1)\n\n GRAND (the Giant Radio Array for Neutrino Detection) is a proposed next-generation observatory of ultra-high-energy neutrinos, cosmic rays, and gamma rays of cosmic origin, with energies exceeding about 100 PeV. GRAND is envisioned as a collection of large-scale ground arrays of self-triggered radio antennas that target the radio emission from extensive air showers initiated by UHE particles. Three prototype arrays are in operation: GRAND@Nan\\c{c}ay in France, GRAND@Auger in Argentina, and GRANDProto300 in China. They test the detection principle and technology of GRAND, in preparation for its next phase, consisting of two arrays of 10'000 antennas each, in the Northern and Southern hemispheres, to be deployed from 2030 on. We present the concept of GRAND, its science goals, the status of the prototypes, their first measurements, and the technical and scientific perspectives that these measurements open for the field.\n\n"}, "dark matter": {"2408.16583": "2024-08-29, **Strange stars admixed with dark matter: equiparticle model in a two fluid approach**, Isabella Marzola et.al., [2408.16583v1](http://arxiv.org/abs/2408.16583v1)\n\n In this work we explore the possible scenario of strange stars admixed with fermionic or bosonic dark matter. For the description of the ``visible'' sector, we use a specific phenomenological quark model that takes into account in-medium effects for the quark masses through a suitable baryonic density dependence, in which the free parameters are chosen from the analysis of the stellar matter stability window (parametrizations presenting lower energy per baryon than iron nuclei). In the case of the dark sector, we investigate the predictions of fermionic and bosonic models. In the former we consider a spin $1/2$ dark particle, and the latter is described by a dark scalar meson. Both models present a repulsive vector interaction, particularly important for the bosonic model since it helps avoiding the collapse of the star due to the lack of the degeneracy pressure. Our results point out to possible stable strange stars configurations in agreement with data from PSR~J0030+0451, PSR~J0740+6620, NICER and HESS~J1731-347. As another feature, we find stars with dark matter halo configurations for lower values of the dark particle mass.\n\n", "2408.16579": "2024-08-29, **A Compaction Function Analysis of CMB $μ$ distortion Constraints on Primordial Black Holes**, Junyue Yang et.al., [2408.16579v1](http://arxiv.org/abs/2408.16579v1)\n\n Primordial black holes (PBHs) are considered viable candidates for dark matter and the seeds of supermassive black holes (SMBHs), with their fruitful physical influences providing significant insights into the conditions of the early Universe. Cosmic microwave background (CMB) $\\mu$ distortion tightly constrain the abundance of PBHs in the mass range of $10^4 \\sim 10^{11} M\\_{\\odot}$ recently, limiting their potential to serve as seeds for the SMBHs observed. Given that $\\mu$ distortion directly constrain the primordial power spectrum, it is crucial to employ more precise methods in computing PBH abundance to strengthen the reliability of these constraints. By a Press-Schechter (PS) type method utilizing the compaction function, we find that the abundance of PBHs could be higher than previously estimated constraints from $\\mu$ distortion observations. Furthermore, our analysis shows that variations in the shape of the power spectrum have a negligible impact on our conclusions within the mass ranges under consideration. This conclusion provides us a perspective for further research on the constrain of PBH by $\\mu$ distortion.\n\n", "2408.16533": "2024-08-29, **Static Planck stars from effective loop quantum gravity**, Edward Wilson-Ewing et.al., [2408.16533v1](http://arxiv.org/abs/2408.16533v1)\n\n Effective loop quantum gravity dynamics are derived for spherically symmetric spacetimes with a perfect fluid matter content. For homogeneous spacetimes, the effective dynamics agree with the standard results of loop quantum cosmology, while the equations for static solutions give an effective Tolman-Oppenheimer-Volkoff equation. There exist solutions to the effective Tolman-Oppenheimer-Volkoff equation that have a mass of the order of the Planck mass, a Planckian radius, and no horizon; these miniature stars could potentially contribute to dark matter, and could be an end state for an evaporating black hole.\n\n", "2408.16475": "2024-08-29, **Gravitational waves from thermal heavy scalar dark matter**, Parsa Hossein Ghorbani et.al., [2408.16475v1](http://arxiv.org/abs/2408.16475v1)\n\n We propose a gauge singlet scalar with mass around $1-10$ TeV as a thermal heavy dark matter candidate along with a dilaton as a Higgs portal mediator in a dimensionless scalar extension of the Standard Model. We demonstrate analytically that such a model gives rise to very strong first-order electroweak phase tyransition through supercooling. We calculate the corresponding gravitational wave signals due to bubble collisions during the phase transition. The produced gravitational waves can detected by future space-based gravitational wave detectors in the frequency range from $10^{-4}$ Hz to $0.1$ Hz.\n\n", "2408.16334": "2024-08-29, **Future targets for light gauge bosons from cosmic strings**, Hanyu Cheng et.al., [2408.16334v1](http://arxiv.org/abs/2408.16334v1)\n\n Cosmic strings, theoretical one-dimensional topological defects from the early universe, provide a valuable opportunity for exploring dark matter (DM) production and gravitational wave (GW) emission. Our study investigates the production of gauge bosons and GW emission from cosmic string decay, considering the constraints imposed by cosmological observations. We specifically examine how gauge bosons radiated from strings contribute to DM and dark radiation, with limits set by the observed DM abundance and cosmic microwave background data, respectively. Additionally, we analyze the gravitational wave spectrum of this model across both low and high frequencies. Notably, the spectrum typically follows a $f^{-1/3}$ pattern at high frequencies, beyond the pivot frequency $f\\_*$. We derive an analytical expression for the frequency $f\\_*$ and confirm its accuracy through numerical verification. Furthermore, we compare the GW spectrum of this model with the forecasted capabilities of future GW observatories, such as the Einstein Telescope, the Laser Interferometer Space Antenna, the Big Bang Observer, and $\\mu$Ares. Finally, we discuss how these considerations impact the model parameters, specifically the gauge boson mass and the energy scale of U(1) symmetry breaking, providing insights into how cosmic strings could enhance our understanding of DM and GW astronomy.\n\n"}, "supernova": {"2408.16383": "2024-08-29, **The Primary Flare Following a Stellar Collision in a Galactic Nucleus**, Yuval Brutman et.al., [2408.16383v1](http://arxiv.org/abs/2408.16383v1)\n\n High-velocity stellar collisions near supermassive black holes may result in a complete disruption of the stars. The initial disruption can have energies on par with supernovae and power a very fast transient. In this work we examine the primary flare that will follow the initial transient, which arises when streams of gas from the disrupted stars travel around the central black hole and collide with each other on the antipodal side with respect to the original collision. We present a simple analytic estimate for the properties of the flare, which depends on the distance of the collision from the central black hole and on the center of mass velocity of the colliding stars. We also present first of their kind radiation-hydrodynamics simulations of a few examples of stellar collisions and post-collision flow of the ejected gas, and calculate the expected bolometric light curves. We find that such post-collision flares are expected to be similar to flares which arise in tidal disruptions events of single stars.\n\n", "2408.16358": "2024-08-29, **Irradiation-driven mass transfer for massive companion stars in supersoft X-rays sources**, Weitao Zhao et.al., [2408.16358v1](http://arxiv.org/abs/2408.16358v1)\n\n Supersoft X-ray sources (SSSs) have been proposed as one of the progenitors for Type Ia supernovae. However, the exact origin of the quasi-periodic variability in the optical light curve remains a mystery.In this work, our goal is to investigate the effect of the feedback of an evolved main-sequence companion star on X-ray irradiation and find whether periodic X-ray irradiation of the companion star could reproduce periodic mass transfer.Using the Modules for Experiments in Stellar Astrophysics (MESA) code, we modeled the evolutionary track of the companion star under the influence of supersoft X-ray irradiation, and we calculated the resulting mass transfer rate. We find that the supersoft X-ray heating of the companion star can result in the expansion of the companion, causing it to greatly overflow its Roche lobe and thereby increasing the mass transfer rate. The periodic X-ray irradiation on the companion stars leads to periodic changes in the mass transfer rate. For a given companion star, higher irradiation efficiencies result in a higher mass transfer rate. Additionally, the mass transfer rate increases as the mass of the companion star decreases for a given irradiation efficiency. The companion star undergoing thermal timescale mass transfer is periodically irradiated by the X-rays from the WD, which can lead to periodic enhancement of the mass transfer rate. The mechanism could be the origin of the quasi-periodic optical light curve in supersoft X-ray sources.\n\n"}}