{"neutrino": {"2312.13278": "2023-12-20, **Kaluza-Klein Spectroscopy from Neutron Oscillations into Hidden Dimensions**, Gia Dvali et.al., [2312.13278v1](http://arxiv.org/abs/2312.13278v1)\n\n Neutrons and neutrinos are natural probes for new physics. Since they carry no conserved gauge quantum numbers, both can easily mix with the fermions from hidden sectors. A particularly interesting effect is the oscillation of a neutron or a neutrino into a fermion propagating in large extra dimensions. In fact, such a mixing has been identified as the possible origin of small neutrino mass. In this paper, we study neutron oscillations into an extra-dimensional fermion and show that this effect provides a resonance imaging of the Kaluza-Klein tower. The remarkable feature of this phenomenon is its generic nature: because of a fine spacing of the Kaluza-Klein tower, neutrons at a variety of energy levels, both free or within nuclei, find a bulk oscillation partner. In particular, the partner can be a Kaluza-Klein mode of the same species that gives mass to the neutrino. The existence of bulk states matching the neutron energy levels of nuclear spectra gives rise to tight constraints as well as to potentially observable effects. For a free neutron, we predict recurrent resonant oscillations occurring with the values of the magnetic field correlated with the KK levels. We derive bounds on extra dimensions from ultra-cold neutron experiments and suggest signatures for refined measurements, which, in particular, can probe the parameter space motivated by the Hierarchy Problem. Ultra-cold neutron experiments offer a unique way of Kaluza-Klein spectroscopy.\n\n", "2312.13197": "2023-12-20, **Photons from neutrinos: the gamma ray echo of a supernova neutrino burst**, Cecilia Lunardini et.al., [2312.13197v1](http://arxiv.org/abs/2312.13197v1)\n\n When a star undergoes core collapse, a vast amount of energy is released in a ~10 s long burst of neutrinos of all species. Inverse beta decay in the star's hydrogen envelope causes an electromagnetic cascade which ultimately results in a flare of gamma rays - an \"echo\" of the neutrino burst - at the characteristic energy of 0.511 MeV. We study the phenomenology and detectability of this flare. Its luminosity curve is characterized by a fast, seconds-long, rise and an equally fast decline, with a minute- or hour-long plateau in between. For a near-Earth star (distance D<1 kpc) the echo will be observable at near future gamma ray telescopes with an effective area of 10^3 cm^2 or larger. Its observation will inform us on the envelope size and composition. In conjunction with the direct detection of the neutrino burst, it will also give information on the neutrino emission away from the line of sight and will enable tests of neutrino propagation effects between the stellar surface and Earth.\n\n", "2312.13157": "2023-12-20, **Leptogenesis from a Phase Transition in a Dynamical Vacuum**, Dipendu Bhandari et.al., [2312.13157v1](http://arxiv.org/abs/2312.13157v1)\n\n We show that a phase transition may take place in the early Universe at a temperature $T\\_*$ via a Standard Model singlet scalar field which happens to couple to right handed neutrinos (RHN) resulting a temperature dependent mass for them that finally relaxes to a constant value after electroweak phase transition (EWPT). As a result, a requisite amount of lepton asymmetry can be produced at a temperature close to $T\\_*$ satisfying the observed baryon asymmetry of the Universe via sphaleron process even when the zero temperature masses of the RHNs fall in sub GeV regime providing a testable scenario for leptogenesis. Interestingly, the framework is also capable of predicting a primordial lepton asymmetry (generated at a temperature below the EWPT), as hinted by helium abundance measuring experiments, bearing a correlation with early phase of leptogenesis.\n\n", "2312.13142": "2023-12-20, **Neutrino spin oscillations in gravitational fields in noncommutative higher dimensions**, S. A. Alavi et.al., [2312.13142v1](http://arxiv.org/abs/2312.13142v1)\n\n Investigation of neutrino spin oscillation in the gravitational fields of black holes(BH) is one of the interesting topics in neutrino physics. On the other hand, in recent years, many studies have been devoted to the exploration of different physical phenomena in higher dimensions. Noncommutative geometry has also been in the focus of researchers in the past years to explore deeper and more accurate the structure of space time. In this work, the neutrino spin oscillation in the noncommutative higher dimensions gravitational fields of Schwarzschild and Reissner-Nordstrom metrics are studied. The effects of noncommutativity of space are calculated and its role in different dimensions are discussed. Finally upper bounds on noncommutativity parameter are obtained.\n\n", "2312.12991": "2023-12-20, **Multi-Calorimetry in Light-based Neutrino Detectors**, Anatael Cabrera et.al., [2312.12991v1](http://arxiv.org/abs/2312.12991v1)\n\n Neutrino detectors are among the largest photonics instruments built for fundamental research. Since its inception, neutrino detection has been inexorably linked to the challenging detection of scarce photons in huge instrumented volumes. Many discoveries in neutrino physics, including the neutrino itself, are inseparable from the evolution of the detector photonics interfaces, i.e. photo-sensors and readout electronics, to yield ever higher precision and richer detection information. The measurement of the energy of neutrinos, referred to as calorimetry, is pursued today to reach permille level systematics control precision, thus leading to further innovation in specialised photonics. This publication describes a novel articulation that detectors may be endowed with multiple photonics interfaces for simultaneous light detection to yield unprecedented high-precision calorimetry. This multi-calorimetry approach opens the novel notion of dual-calorimetry detectors as an evolution from the single-calorimetry setups used over several decades for most experiments so far. The dual-calorimetry design exploits unique response synergies between photon counting and photon-integration detection systems, including correlations and cancellations between calorimetric responses, to yield the unprecedented mitigation of the dominant response systematic effects today for the possible improved design of a new generation of neutrino experiments.\n\n", "2312.12907": "2023-12-20, **Solar neutrino measurements using the full data period of Super-Kamiokande-IV**, Super-Kamiokande Collaboration et.al., [2312.12907v1](http://arxiv.org/abs/2312.12907v1)\n\n An analysis of solar neutrino data from the fourth phase of Super-Kamiokande~(SK-IV) from October 2008 to May 2018 is performed and the results are presented. The observation time of the data set of SK-IV corresponds to $2970$~days and the total live time for all four phases is $5805$~days. For more precise solar neutrino measurements, several improvements are applied in this analysis: lowering the data acquisition threshold in May 2015, further reduction of the spallation background using neutron clustering events, precise energy reconstruction considering the time variation of the PMT gain. The observed number of solar neutrino events in $3.49$--$19.49$~MeV electron kinetic energy region during SK-IV is $65,443^{+390}\\_{-388}\\,(\\mathrm{stat.})\\pm 925\\,(\\mathrm{syst.})$ events. Corresponding $\\mathrm{^{8}B}$ solar neutrino flux is $(2.314 \\pm 0.014\\, \\rm{(stat.)} \\pm 0.040 \\, \\rm{(syst.)}) \\times 10^{6}~\\mathrm{cm^{-2}\\,s^{-1}}$, assuming a pure electron-neutrino flavor component without neutrino oscillations. The flux combined with all SK phases up to SK-IV is $(2.336 \\pm 0.011\\, \\rm{(stat.)} \\pm 0.043 \\, \\rm{(syst.)}) \\times 10^{6}~\\mathrm{cm^{-2}\\,s^{-1}}$. Based on the neutrino oscillation analysis from all solar experiments, including the SK $5805$~days data set, the best-fit neutrino oscillation parameters are $\\rm{sin^{2} \\theta\\_{12,\\,solar}} = 0.306 \\pm 0.013 $ and $\\Delta m^{2}\\_{21,\\,\\mathrm{solar}} = (6.10^{+ 0.95}\\_{-0.81}) \\times 10^{-5}~\\rm{eV}^{2}$, with a deviation of about 1.5$\\sigma$ from the $\\Delta m^{2}\\_{21}$ parameter obtained by KamLAND. The best-fit neutrino oscillation parameters obtained from all solar experiments and KamLAND are $\\sin^{2} \\theta\\_{12,\\,\\mathrm{global}} = 0.307 \\pm 0.012 $ and $\\Delta m^{2}\\_{21,\\,\\mathrm{global}} = (7.50^{+ 0.19}\\_{-0.18}) \\times 10^{-5}~\\rm{eV}^{2}$.\n\n", "2312.12836": "2023-12-20, **Questions of flavor physics and neutrino mass from a flipped hypercharge**, Duong Van Loi et.al., [2312.12836v1](http://arxiv.org/abs/2312.12836v1)\n\n The flavor structure of quarks and leptons is not yet fully understood, but it hints a more fundamental theory of non-universal generations. We therefore propose a simple extension of the Standard Model by flipping (i.e., enlarging) the hypercharge $U(1)\\_Y$ to $U(1)\\_X\\otimes U(1)\\_N$ for which both $X$ and $N$ depend on generations of both quark and lepton. By anomaly cancellation, this extension not only explains the existence of just three fermion generations as observed but also requires the presence of a right-handed neutrino per generation, which motivates seesaw neutrino mass generation. Furthermore, in its minimal version with a scalar doublet and two scalar singlets, the model naturally generates the measured fermion-mixing matrices while it successfully accommodates several flavor anomalies observed in the neutral meson mixings, $B$-meson decays, lepton-flavor-violating decays of charged leptons, as well as satisfying constraints from particle colliders.\n\n"}, "dark matter": {"2312.13249": "2023-12-20, **Astrometric Microlensing by Primordial Black Holes with The Roman Space Telescope**, James Fardeen et.al., [2312.13249v1](http://arxiv.org/abs/2312.13249v1)\n\n Primordial Black Holes (PBHs) could explain some fraction of dark matter and shed light on many areas of early-universe physics. Despite over half a century of research interest, a PBH population has so far eluded detection. The most competitive constraints on the fraction of dark matter comprised of PBHs ($f\\_{\\rm DM}$) in the $(10^{-9}-10)M\\_{\\odot}$ mass-ranges come from photometric microlensing and bound $f\\_{\\rm DM}\\lesssim10^{-2}-10^{-1}$. With the advent of the Roman Space Telescope with its sub-milliarcsecond (mas) astrometric capabilities and its planned Galactic Bulge Time Domain Survey (GBTDS), detecting astrometric microlensing signatures will become routine. Compared with photometric microlensing, astrometric microlensing signals are sensitive to different lens masses-distance configurations and contains different information, making it a complimentary lensing probe. At sub-mas astrometric precision, astrometric microlensing signals are typically detectable at larger lens-source separations than photometric signals, suggesting a microlensing detection channel of pure astrometric events. We use a Galactic simulation to predict the number of detectable microlensing events during the GBTDS via this pure astrometric microlensing channel. We find that the number of detectable events peaks at $\\approx 10^{3} f\\_{\\rm DM}$ for a population of $ 1 M\\_{\\odot}$ PBHs and tapers to $\\approx 10f\\_{\\rm DM}$ and $\\approx 100f\\_{\\rm DM}$ at $10^{-4}M\\_{\\odot}$ and $10^{3}M\\_{\\odot}$, respectively. Accounting for the distinguishability of PBHs from Stellar lenses, we conclude the GBTDS will be sensitive and PBH population at $f\\_{\\rm DM}$ down to $\\approx10^{-1}-10^{-3}$ for $(10^{-1}-10^{2})M\\_{\\odot}$ likely yielding novel PBH constraints.\n\n", "2312.13109": "2023-12-20, **Mechanical tuning of a rectangular axion haloscope operating around 8.4 GHz**, Jessica Golm et.al., [2312.13109v1](http://arxiv.org/abs/2312.13109v1)\n\n The axion haloscope is the currently most sensitive method to probe the vanishingly small coupling of this prominent Dark Matter candidate to photons. To scan a sizeable axion Dark Matter parameter space, the cavities that make up the haloscope need to be tuned efficiently. In this article, we describe a novel technique to tune axion haloscopes around $8.4$ GHz in a purely mechanical manner without the use of dielectrics. We achieve tuning by introducing a gap along the cavity geometry. Losses are added due to the leaking of the field out of the structure only if the gap becomes too large concerning the total width. A tuning range of around $600$ MHz is achieved, depending on the environmental conditions. We present the results of a corresponding prototype and outline prospects to further develop this technique.\n\n", "2312.12997": "2023-12-20, **Hunting Galactic Axion Dark Matter with Gravitationally Lensed Fast Radio Bursts**, Ran Gao et.al., [2312.12997v2](http://arxiv.org/abs/2312.12997v2)\n\n Ultralight axion or axionlike particles are one of the most promising candidates for dark matter because they are a well-motivated solution for the theoretical strong $CP$ problem and observational issues on small scales, i.e. the core-cusp problem and the satellite problem. A tiny coupling of axions and photons induces birefringence. We propose the differential birefringence measurements of multiple images of gravitationally lensed fast radio burst (FRB) systems as probes of the Galactic axion dark matter (ADM) background. In addition to general advantages of lensing systems, i.e. alleviating systematics and intrinsic astrophysical dependencies, precise measurements of lensing time delay and polarization angle in gravitationally lensed FRB systems make them a more robust and powerful probe. We show that, with a single lensed FRB system (which may be detected in large numbers in the SKA era), the axion-photon coupling under the ADM background could be constrained to be $g\\_{a\\gamma} < 7.3 \\times 10^{-11}~ \\mathrm{GeV^{-1}}$ for an axion mass $m\\_a\\sim10^{-20}~\\mathrm{eV}$. This will be of great significance in achieving synergistic searches of the Galactic ADM with other astrophysical probes and laboratorial experiments.\n\n", "2312.12985": "2023-12-20, **Cosmological implications of inflaton-mediated dark and visible matter scatterings after reheating**, Deep Ghosh et.al., [2312.12985v1](http://arxiv.org/abs/2312.12985v1)\n\n The initial density of dark matter (DM) particles, otherwise secluded from the standard model (SM), may be generated at reheating, with an initial temperature ratio for internal thermalizations, $\\xi\\_i=T\\_{\\rm DM,i}/T\\_{\\rm SM,i}$. This scenario necessarily implies inflaton-mediated scatterings between DM and SM after reheating, with a rate fixed by the relic abundance of DM and the reheat temperature. These scatterings can be important for an inflaton mass and reheat temperature as high as $\\mathcal{O}(10^7 {~\\rm GeV})$ and $\\mathcal{O}(10^9{~\\rm GeV})$, respectively, since the thermally averaged collision terms become approximately independent of the inflaton mass when the bath temperature is larger than the mass. The impact of these scatterings on DM cosmology is studied modeling the perturbative reheating physics by a gauge-invariant set of inflaton interactions upto dimension-5 with the SM gauge bosons, fermions and the Higgs fields. It is observed that an initially lower (higher) DM temperature will rapidly increase (decrease), even with very small couplings to the inflaton. There is a sharp lower bound on the DM mass below which the relic abundance cannot be satisfied due to faster back-scatterings depleting DM quanta to SM particles. For low DM masses, the CMB constraints become stronger due to the collisions for $\\xi\\_i<1$, probing values as small as $\\mathcal{O}(10^{-4})$, and weaker for $\\xi\\_i>1$. The BBN constraints become stronger due to the collisions for lower DM masses, probing $\\xi\\_i$ as small as $\\mathcal{O}(0.1)$, and weaker for higher DM mass. Thus inflaton-mediated collisions with predictable rates, relevant even for high-scale inflation models, can significantly impact the cosmology of light DM.\n\n", "2312.12883": "2023-12-20, **On the heat evolution of the early Universe**, K. A. Bronnikov et.al., [2312.12883v1](http://arxiv.org/abs/2312.12883v1)\n\n We discuss the heat history of the early Universe and its further evolution in the framework of modern cosmological models of general relativity (GR) and alternative theories of gravity. Of great importance are the new puzzling forms of matter comprising parts of our Universe, namely, dark energy and dark matter that crucially affect the Universe structure and evolution.\n\n"}, "supernova": {"2312.13280": "2023-12-20, **SN 2021adxl: A luminous nearby interacting supernova in an extremely low metallicity environment**, S. J. Brennan et.al., [2312.13280v1](http://arxiv.org/abs/2312.13280v1)\n\n SN 2021adxl is a slowly evolving, luminous, Type IIn supernova with asymmetric emission line profiles, similar to the well-studied SN 2010jl. We present extensive optical, near-ultraviolet, and near-infrared photometry and spectroscopy covering ~1.5 years post discovery. SN 2021adxl occurred in an unusual environment, atop a vigorously star-forming region that is offset from its host galaxy core. The appearance of Ly{\\alpha}, O II, as well as the compact core, would classify the host of SN 2021adxl as a Blueberry galaxy, analogous to the higher redshift Green Pea galaxies. Using several abundance indicators, we find a metallicity of the explosion environment of only 10% solar, the lowest reported metallicity for a Type IIn SN environment. SN 2021adxl reaches a peak magnitude of r ~ -20.2 mag and since discovery, SN 2021adxl has faded by only ~4 magnitudes in the r band with a cumulative radiated energy of ~1.5e50 erg over 18 months. SN 2021adxl shows strong signs of interaction with a complex circumstellar medium, seen by the detection of X-rays, revealed by the detection of coronal emission lines, and through multi-component hydrogen and helium profiles. In order to further understand this interaction, we model the H{\\alpha} profile using a Monte-Carlo electron scattering code. The blueshifted high-velocity component is consistent with emission from a radially thin, spherical shell resulting in the broad emission components due to electron scattering. Using the velocity evolution of this emitting shell, we find that the SN ejecta collide with circumstellar material of at least 5 Msun, assuming a steady-state mass-loss rate of 4-6e-3 Msun per year for the first ~200 days of evolution. Continuing the observations of SN 2021adxl may reveal signatures of dust formation or an infrared excess, similar to that seen for SN 2010jl.\n\n", "2312.13235": "2023-12-20, **Comprehensive Constraints on Dark Radiation Injection After BBN**, Alexander C. Sobotka et.al., [2312.13235v1](http://arxiv.org/abs/2312.13235v1)\n\n We derive constraints on the injection of free-streaming dark radiation after big bang nucleosynthesis (BBN) by considering the decay of a massive hidden sector particle into dark radiation. Such a scenario has the potential to alleviate the Hubble tension by introducing a new energy component to the evolution of the early universe. We employ observations of the cosmic microwave background (CMB) from $\\textit{Planck}$ 2018 and SPT-3G, measurements of the primordial deuterium abundance, Pantheon+ Type Ia supernovae data, and baryon acoustic oscillation (BAO) measurements from BOSS DR12 to constrain these decay scenarios. Pre-recombination decays are primarily restricted by observations of the CMB via their impact on the effective number of relativistic species. On the other hand, long-lived decay scenarios in which the massive particle lifetime extends past recombination tend to decrease the late-time matter density inferred from the CMB and are thus subject to constraints from Pantheon+ and BAO. We find that, when marginalizing over lifetimes of $\\tau\\_Y = [10^{-12.08}, 10^{-1.49}]$ Gyr, the decaying particle is limited at $2\\sigma$ to only contribute a maximum of $3\\%$ of the energy density of the universe. With limits on these decays being so stringent, neither short-lived nor long-lived scenarios are successful at substantially mitigating the Hubble tension.\n\n", "2312.13172": "2023-12-20, **On the galactic origin of ultra high energy cosmic rays**, V. N. Zirakashvili et.al., [2312.13172v2](http://arxiv.org/abs/2312.13172v2)\n\n It is shown that the acceleration of particles by a powerful relativistic jet associated with the activity of a supermassive black hole in the Galactic center several million years ago may explain the observed cosmic ray spectrum at energies higher than $10^{15}$ eV. The accelerated particles are efficiently confined in the extended magnetized gas halo created by the supernova and central black hole activity just after the Galaxy formation. We found that both the heavy and light chemical composition of ultra-high energy cosmic rays can be consistent with observations.\n\n", "2312.12862": "2023-12-20, **Discovery of optical emission from the supernova remnant G108.2-0.6 and its atomic environment**, Gunay Payli et.al., [2312.12862v1](http://arxiv.org/abs/2312.12862v1)\n\n We report the first detection of optical emission from the shell-type Galactic supernova remnant (SNR) G108.2$-$0.6. We obtained H$\\alpha$ images and long-slit spectra using the 1.5-m RTT150 telescope to examine the morphological and spectral characteristics of the SNR. We detected several filaments along its north and south regions, which is consistent with its SNR nature. The spectra exhibit [SII]/H$\\alpha$ ratios in the range of 0.4$-$1.1, indicating emission from shock-heated gas. The oxygen doublet emission lines [OI]$\\lambda$6300, $\\lambda$6363 detected in the south region also support the indicator of the presence of shocks. We estimate the electron density using the [SII] 6716/6731 ratio ranging from 15 to 1800 cm$^{-3}$. The spectra show a relatively low shock velocity of $V\\_{\\rm s}$ $\\sim$ 80 km s$^{-1}$ with the pre-shock cloud density of $n\\_{\\rm c}$ $\\sim$18$-$57 cm$^{-3}$. The H$\\alpha$/H$\\beta$ ratios show significant variation across the observed regions with extinction $E(B-V)$ ranging from 0.22 to 1.65. We also analyzed the archival HI data and estimated the kinematic distance to the SNR of $\\sim$0.8 kpc and dynamical age as $\\sim$70$\\pm$10 kyr of G108.2$-$0.6.\n\n"}}