{"neutrino": {"2305.00894": "2023-05-01, **Searching for $^{76}$Ge neutrinoless double beta decay with the CDEX-1B experiment**, B. T. Zhang et.al., [2305.00894v1](http://arxiv.org/abs/2305.00894v1)\n\n We operated a p-type point contact high purity germanium (PPCGe) detector (CDEX-1B, 1.008 kg) in the China Jinping Underground Laboratory (CJPL) for 500.3 days to search for neutrinoless double beta ($0\\nu\\beta\\beta$) decay of $^{76}$Ge. A total of 504.3 kg $\\cdot$ day effective exposure data was accumulated. The anti-coincidence and the multi/single-site event (MSE/SSE) discrimination methods were used to suppress the background in the energy region of interest (ROI, $1989-2089$ keV for this work) with a factor of 23. A background level of 0.33 counts/(keV $\\cdot$ kg $\\cdot$ yr) was achieved. The lower limit on the half life of $^{76}$Ge $0\\nu\\beta\\beta$ decay was constrained as $T\\_{1/2}^{0\\nu}\\ > \\ {2.2}\\times 10^{23}\\ \\rm yr\\ (90\\% \\ C.L.)$, corresponding to the upper limits on the effective Majorana neutrino mass: $\\langle m\\_{\\beta\\beta}\\rangle < 2.3-5.2\\ \\mathrm{eV}$.\n\n", "2305.00742": "2023-05-01, **Impact of isovector pairing fluctuation on neutrinoless double-beta decay in multi-reference covariant density functional theory**, C. R. Ding et.al., [2305.00742v1](http://arxiv.org/abs/2305.00742v1)\n\n We extend a multi-reference covariant density functional theory (MR-CDFT) by including fluctuations in quadrupole shapes and isovector pairing amplitudes simultaneously for the nuclear matrix elements (NMEs) of neutrinoless double-beta $(0\\nu\\beta\\beta)$ decay in the candidate nuclei $^{76}$Ge, $^{82}$Se, $^{100}$Mo, $^{130}$Te, and $^{136}$Xe assuming the mechanism of exchanging either light or heavy neutrinos. The results show that including isovector pairing fluctuations can increase the excitation energies of low-lying states by 10% to 50%, and enhance the NMEs of $0\\nu\\beta\\beta$ decay by about 40%-80%. This enhancement is systematically larger than that found in the previous non-relativistic calculation based on the Gogny force. Besides, we find that the NMEs are linearly correlated with the excitation energies of low-lying states while varying the isovector pairing strengths. This correlation could be utilized to constrain the NMEs while performing a statistical analysis of uncertainty arising from the pairing strengths between nucleons.\n\n", "2305.00392": "2023-04-30, **Bayesian Inference of Supernova Neutrino Spectra with Multiple Detectors**, Xu-Run Huang et.al., [2305.00392v1](http://arxiv.org/abs/2305.00392v1)\n\n We implement the Bayesian inference to retrieve energy spectra of all neutrinos from a galactic core-collapse supernova (CCSN). To achieve high statistics and full sensitivity to all flavours of neutrinos, we adopt a combination of several reaction channels from different large-scale neutrino observatories, namely inverse beta decay on proton and elastic scattering on electron from Hyper-Kamiokande (Hyper-K), charged current absorption on Argon from Deep Underground Neutrino Experiment (DUNE) and coherent elastic scattering on Lead from RES-NOVA. Assuming no neutrino oscillation or specific oscillation models, we obtain mock data for each channel through Poisson processes with the predictions, for a typical source distance of 10 kpc in our Galaxy, and then evaluate the probability distributions for all spectral parameters of theoretical neutrino spectrum model with Bayes' theorem. Although the results for either the electron-neutrinos or electron-antineutrinos reserve relatively large uncertainties (according to the neutrino mass hierarchy), a precision of a few percent (i.e., $\\pm 1 \\% \\sim \\pm 4 \\%$ at a credible interval of $2 \\sigma$) is achieved for primary spectral parameters (e.g., mean energy and total emitted energy) of other neutrino species. Moreover, the correlation coefficients between different parameters are computed as well and interesting patterns are found. Especially, the mixing-induced correlations are sensitive to the neutrino mass hierarchy, which potentially makes it a brand new probe to determine the neutrino mass hierarchy in the detection of galactic supernova neutrinos. Finally, we discuss the origin of such correlation patterns and perspectives for further improvement on our results.\n\n"}, "dark matter": {"2305.00890": "2023-05-01, **Search for dark photons with synchronized quantum sensor network**, Min Jiang et.al., [2305.00890v1](http://arxiv.org/abs/2305.00890v1)\n\n Ultralight dark photons constitute a well-motivated candidate for dark matter. Nevertheless, current constraints on the existence of dark photons with masses below MHz are predominantly set by cosmological or astrophysical limits. They behave as effective currents when coupled with standard model photons through kinetic mixing. When situated in electromagnetic shielded rooms, oscillating magnetic fields are generated with the maximum field strength proportional to the shield size. Here, we demonstrate a network of 15 atomic magnetometers, which are synchronized with the Global Positioning System (GPS) and are situated on the edges of two meter-scale shielded rooms, serving as a powerful tool to search for dark photons. Both the network multiple quantum sensors and the shield large size significantly enhance the expected dark-photon signals. Using this network, we constrain the kinetic mixing coefficient of dark photon dark matter over the mass range 1-500 Hz, which gives the strongest constraint of a terrestrial experiment within this mass window. Our prospect indicates that future data releases may go beyond the constraints from the Cosmic Microwave Background and the gas cloud cooling.\n\n", "2305.00808": "2023-05-01, **Recent Results from BABAR: Dark Matter, Axion-like Particles and Heavy Neutral Leptons, a contribution to the 2023 Electroweak session of the 57th Rencontres de Moriond**, Sophie Middleton et.al., [2305.00808v1](http://arxiv.org/abs/2305.00808v1)\n\n Three independent searches for new physics using data collected at BABAR are presented. Firstly, two searches for dark matter and baryogenesis: $B^{0}\\rightarrow \\Lambda + \\psi\\_{D}$ and $B^{+} \\rightarrow p + \\psi\\_{D}$ are detailed, where $\\psi\\_{D}$ is a new dark fermion. Neither signal is observed and new upper limits on the branching fractions, at the 90 $\\%$ confidence level (C.L), are placed at $\\mathcal{O}(10^{-5} - 10^{-6})$ across the mass range $1.0< m\\_{\\psi\\_{D}}<4.3$ GeV/c$^{2}$. Secondly, new limits on the coupling, $g\\_{aW}$, of an axion-like particle ($a$) to the $W$ boson, at the 90 $\\%$ C.L, are presented at $\\mathcal{O}(10^{-5})$ GeV$^{-1}$ for $a$ masses in the mass range 0.175 $<m\\_{a}<$ 4.78 GeV/c$^{2}$. Thirdly, a model-independent search for heavy neutral leptons (HNL) found new upper limits at the 95 $\\%$ C.L on the extended Pontecorvo-Maki-Nakagawa-Sakata (PMNS) matrix element, $\\|U\\_{\\tau 4}\\|^{2}$, which depend on the HNL mass hypothesis and vary from $2.31 \\times 10^{-2}$ to $5.04 \\times 10^{-6}$, across the mass range $100 < m\\_{4} < 1300$ MeV/c$^{2}$, with more stringent limits on higher HNL masses.\n\n", "2305.00779": "2023-05-01, **Invisible Decays of a Non-SM-like $H_2$ to Dark Matter in the N2HDM and the NMSSM**, Maien Binjonaid et.al., [2305.00779v1](http://arxiv.org/abs/2305.00779v1)\n\n We investigate two extensions of the standard model that include particle dark matter candidates: the N2HDM and the NMSSM. These models feature a non-SM-like CP-even scalar with a sub-TeV mass, denoted by $H\\_2$, among other particles. At a 13 TeV proton-proton collider, the primary production channel for such scalars is via the fusion of a pair of gluons. Subsequently, these scalars can decay invisibly into a pair of dark matter candidates, with some regions of the parameter space exhibiting a dominance of such decay over other modes. In the supersymmetric model, it is possible for the LSP and NLSP to be mass degenerate, leading to quasi-invisible $H\\_2$ decays to LSP+NLSP and NLSP+NLSP. We present the predictions of both models for this challenging scenario while ensuring compatibility with recent experimental constraints.\n\n", "2305.00401": "2023-04-30, **Methods and prospects for gravitational wave searches targeting ultralight vector boson clouds around known black holes**, Dana Jones et.al., [2305.00401v1](http://arxiv.org/abs/2305.00401v1)\n\n Ultralight bosons are predicted in many extensions to the Standard Model and are popular dark matter candidates. The black hole superradiance mechanism allows for these particles to be probed using only their gravitational interaction. In this scenario, an ultralight boson cloud may form spontaneously around a spinning black hole and extract a non-negligible fraction of the black hole's mass. These oscillating clouds produce quasi-monochromatic, long-duration gravitational waves that may be detectable by ground-based or space-based gravitational wave detectors. We discuss the capability of a new long-duration signal tracking method, based on a hidden Markov model, to detect gravitational wave signals generated by ultralight vector boson clouds, including cases where the signal frequency evolution timescale is much shorter than that of a typical continuous wave signal. We quantify the detection horizon distances for vector boson clouds with current- and next-generation ground-based detectors. We demonstrate that vector clouds hosted by black holes with mass $\\gtrsim 60 M\\_{\\odot}$ and spin $\\gtrsim 0.6$ are within the reach of current-generation detectors up to a luminosity distance of $\\sim 1$ Gpc. This search method enables one to target vector boson clouds around remnant black holes from compact binary mergers detected by gravitational-wave detectors. We discuss the impact of the sky localization of the merger events and demonstrate that a typical remnant black hole reasonably well-localized by the current generation detector network is accessible in a follow-up search.\n\n"}, "supernova": {}}