{"neutrino": {"2405.00641": "2024-05-01, **Tomography of flavoured leptogenesis with primordial blue gravitational waves**, Marco Chianese et.al., [2405.00641v1](http://arxiv.org/abs/2405.00641v1)\n\n We explore a scenario where an early epoch of matter domination is driven by the mass scale $M\\_N$ of the right-handed neutrinos, which also characterizes the different flavour regimes of leptogenesis. Such a matter-domination epoch gives rise to peculiar spectral imprints on primordial Gravitational Waves (GWs) produced during inflation. We point out that the characteristic spectral features are detectable in multiple frequency bands with current and future GW experiments in case of Blue GWs (BGWs) described by a power-law with a positive spectral index $(n\\_T >0)$ and an amplitude compatible with Cosmic Microwave Background (CMB) measurements. We find that the three-flavour leptogenesis regime with $M\\_N \\lesssim 10^9~{\\rm GeV}$ imprints BGWs more prominently than the two-flavour and one-flavour regimes characterized by a higher right-neutrino mass scale. In particular, a two-flavour (three-flavour) leptogenesis regime is expected to leave distinct imprints in the mHz ($\\mu$Hz) band. Moreover, we translate the current Big Bang Nucleosynthesis (BBN) and LIGO limits on the GW energy density into constraints on the flavour leptogenesis parameter space for different GW spectral index $n\\_T$. Interestingly, a three-flavour leptogenesis regime can offer a unique signal testable in the next LIGO run with a correlated signature in the PTA frequency band with an amplitude comparable to the one expected from supermassive black holes.\n\n", "2405.00272": "2024-05-01, **Search for charged lepton flavor violation in $J/ψ$ decays at BESIII**, Xudong Yu et.al., [2405.00272v1](http://arxiv.org/abs/2405.00272v1)\n\n In the Standard Model, charged lepton flavor violation (CLFV) is heavily suppressed by tiny neutrino mass, while many theoretical models can enhance CLFV effects up to detectable level. The observation of any CLFV process would be a clear signal of new physics beyond SM. BESIII experiment collected 10 billion $J/\\psi$ data and searched for CLFV processes $J/\\psi\\to e\\tau$ and $e\\mu$. The upper limits at the 90% confidence level are determined to be $\\mathcal{B}(J/\\psi\\to e\\tau)<7.5\\times 10^{-8}$ and $\\mathcal{B}(J/\\psi\\to e\\mu)<4.5\\times 10^{-9}$, respectively. Improving the previously experimental limits by two orders of magnitudes, the results are the most stringent CLFV searches in heavy quarkonium system.\n\n", "2405.00124": "2024-04-30, **Primordial black hole probes of heavy neutral leptons**, Valentina De Romeri et.al., [2405.00124v1](http://arxiv.org/abs/2405.00124v1)\n\n Primordial black holes (PBH), while still constituting a viable dark matter component, are expected to evaporate through Hawking radiation. Assuming the semi-classical approximation holds up to near the Planck scale, PBHs are expected to evaporate by the present time, emitting a significant flux of particles in their final moments, if produced in the early Universe with an initial mass of $\\sim 10^{15}$ g. These ''exploding'' black holes will release a burst of Standard Model particles alongside any additional degrees of freedom, should they exist. We explore the possibility that heavy neutral leptons (HNL), mixing with active neutrinos, are emitted in the final evaporation stages. We calculate the expected number of active neutrinos from such an event, including contributions due to the HNL decay for different assumptions on the mixings. We infer sensitivities on the active-sterile neutrino mixing and on the sterile neutrino mass, finding that, for instance, for the scenario where $U\\_{\\tau 4}\\neq 0$, IceCube could improve current constraints by $\\sim 2$ orders of magnitude, for HNLs masses between 0.1 - 1 GeV, for a PBH at a distance of $\\sim 10^{-4}$ pc from Earth.\n\n", "2405.00119": "2024-04-30, **Sterile neutrino dark matter within the $ν$SMEFT**, Kaori Fuyuto et.al., [2405.00119v1](http://arxiv.org/abs/2405.00119v1)\n\n Sterile neutrinos with masses at the $\\mathrm{keV}$ scale and mixing to the active neutrinos offer an elegant explanation of the observed dark matter (DM) density. However, the very same mixing inevitably leads to radiative photon emission and the non-observation of such peaked $X$-ray lines rules out this minimal sterile neutrino DM hypothesis. We show that in the context of the Standard Model effective field theory with sterile neutrinos ($\\nu$SMEFT), higher dimensional operators can produce sterile neutrino DM in a broad range of parameter space. In particular, $\\nu$SMEFT interactions can open the large mixing parameter space due to their destructive interference, through operator mixing or matching, in the $X$-ray emission. We also find that, even in the zero mixing limit, the DM density can always be explained by $\\nu$SMEFT operators. The testability of the studied $\\nu$SMEFT operators in searches for electric dipole moments, neutrinoless double beta decay, and pion decay measurements is discussed.\n\n", "2405.00094": "2024-04-30, **How to rule out $(g-2)_μ$ in $U(1)_{L_μ-L_τ}$ with White Dwarf Cooling**, Patrick Foldenauer et.al., [2405.00094v1](http://arxiv.org/abs/2405.00094v1)\n\n In recent years, the gauge group $U(1)\\_{L\\_\\mu-L\\_\\tau}$ has received a lot of attention since it can, in principle, account for the observed excess in the anomalous muon magnetic moment $(g-2)\\_\\mu$, as well as the Hubble tension. Due to unavoidable, loop-induced kinetic mixing with the SM photon and $Z$, the $U(1)\\_{L\\_\\mu-L\\_\\tau}$ gauge boson $A'$ can contribute to stellar cooling via decays into neutrinos. In this work, we perform for the first time an \\textit{ab initio} computation of the neutrino emissivities of white dwarf stars due to plasmon decay in a model of gauged $U(1)\\_{L\\_\\mu-L\\_\\tau}$. Our central finding is that an observation of the early-stage white dwarf neutrino luminosity at the 30% level could exclude (or partially exclude) the remaining allowed parameter space for explaining $(g-2)\\_\\mu$. In this work, we present the relevant white dwarf sensitivities over the entire $A'$ mass range. In particular, we have performed a rigorous computation of the luminosities in the resonant regime, where the $A'$ mass is comparable to the white dwarf plasma frequencies.\n\n", "2404.19746": "2024-04-30, **The Width of an Electron-Capture Neutrino Wave Packet**, B. J. P. Jones et.al., [2404.19746v1](http://arxiv.org/abs/2404.19746v1)\n\n We expand on the methodology outlined in previous work that predicted the width of an antineutrino wave packet emerging from a beta-decaying nucleus, to the case of a neutrino from electron capture decay. Based on this result, we also respond to a recent Beryllium Electron capture in Superconducting Tunnel junctions Experiment (BeEST) paper which utilizes this previous work in forming their measurement of the neutrino wave packet width. According to our interpretation, the direct limit on the neutrino wave packet width from electron capture decay ($e^- + \\mathrm{^{7}Be}\\rightarrow\\mathrm{^{7}Li+\\nu\\_e}$) using the BeEST analysis should map to $\\sigma\\_{\\nu,x}>6.2\\,\\mathrm{pm}$ while our theoretical prediction is $\\sigma\\_{\\nu,x}\\sim2.7\\,\\mathrm{nm}$.\n\n", "2404.19730": "2024-04-30, **Investigating the correlations between IceCube high-energy neutrinos and Fermi-LAT $γ$-ray observations. II**, Ming-Xuan Lu et.al., [2404.19730v1](http://arxiv.org/abs/2404.19730v1)\n\n Given that gamma rays with energies larger than TeV are severely absorbed by background radiation fields, for many extragalactic sources, the GeV-TeV gamma-ray observations are the messengers that are closest in energy to the TeV-PeV neutrinos observed by IceCube. Investigating whether there is a correlation between the gamma-ray and neutrino observations can help us identify high-energy neutrino sources and determine which sources are the main contributors to the all-sky diffuse neutrino flux of IceCube. In previous work, we have already studied the possible gamma-neutrino correlations by analyzing 10 years of IceCube muon-track data. In this work, we further investigate such correlations by employing the IceCube p-value sky map of the scan for point sources. We examine the spatial associations of hotspots in the neutrino sky map with various gamma-ray source samples: the third Fermi-LAT catalog of high-energy sources (3FHL), LAT 14-year source catalog (4FGL), the fourth catalog of active galactic nuclei (4LAC) and subsets of these samples. Among all the samples, the 3FHL sample shows a possible correlation with the neutrino hotspots, with a pre-trial p-value of $1.1\\times10^{-4}$ ($\\sim 3.9\\,\\sigma$). However, this is found to be caused by three already known neutrino sources/source candidates: NGC 1068, TXS 0506+056, and PKS 1424+240. In order to validate our analysis procedure and to test the robustness of the previously claimed correlation between the 5BZCAT blazars and neutrino hotspots, we also consider 5BZCAT blazars in our correlation study. We find that the way in which mock sources are generated in the simulation used to derive the chance coincidence probability may have a large impact on the claimed correlation.\n\n", "2404.19624": "2024-04-30, **Recent Neutrino Parameters Impact on the Effective Majorana Neutrino Mass in 0$νββ$ Decay**, Dongming Mei et.al., [2404.19624v1](http://arxiv.org/abs/2404.19624v1)\n\n We investigate how recent updates to neutrino oscillation parameters and the sum of neutrino masses influence the sensitivity of neutrinoless double-beta (0$\\nu\\beta\\beta$) decay experiments. Incorporating the latest cosmological constraints on the sum of neutrino masses and laboratory measurements on oscillations, we determine the sum of neutrino masses for both the normal hierarchy (NH) and the inverted hierarchy (IH). Our analysis reveals a narrow range for the sum of neutrino masses, approximately 0.06 eV/c$^2$ for NH and 0.102 eV/c$^2$ for IH. Utilizing these constraints, we calculate the effective Majorana masses for both NH and IH scenarios, establishing the corresponding allowed regions. Importantly, we find that the minimum neutrino mass is non-zero, as constrained by the current oscillation parameters. Additionally, we estimate the half-life of 0$\\nu\\beta\\beta$ decay using these effective Majorana masses for both NH and IH. Our results suggest that upcoming ton-scale experiments will comprehensively explore the IH scenario, while 100-ton-scale experiments will effectively probe the parameter space for the NH scenario, provided the background index can achieve 1 event/kton-year in the region of interest.\n\n", "2404.19530": "2024-04-30, **Prospects for weighing neutrinos in interacting dark energy models using joint observations of gravitational waves and $γ$-ray bursts**, Lu Feng et.al., [2404.19530v1](http://arxiv.org/abs/2404.19530v1)\n\n In this work, we explore the capability of future gravitational wave (GW) standard siren observations to constrain the total neutrino mass in some typical interacting dark energy (IDE) models. We examine the combined potential of the third-generation ground-based GW detector network and a short $\\gamma$-ray burst (GRB) detector similar to the THESEUS telescope for cosmological analysis. Our findings suggest that future GW standard siren observations could modestly refine the upper limit on the total neutrino mass, enhancing it by $5\\%$ to $10\\%$ over the existing limit given by the CMB+BAO+SN data. Additionally, the future observations are expected to significantly improve the constraints on $\\Omega\\_{\\rm m}$ and $H\\_0$. Moreover, the measurements could enhance the precision of the coupling strength $\\beta$ by $23\\%$ to $42\\%$.\n\n", "2404.19524": "2024-04-30, **DARWIN/XLZD: a future xenon observatory for dark matter and other rare interactions**, Laura Baudis et.al., [2404.19524v1](http://arxiv.org/abs/2404.19524v1)\n\n The DARWIN/XLZD experiment is a next-generation dark matter detector with a multi-ten-ton liquid xenon time projection chamber at its core. Its principal goal will be to explore the experimentally accessible parameter space for Weakly Interacting Massive Particles (WIMPs) in a wide mass-range, until interactions of astrophysical neutrinos will become an irreducible background. The prompt scintillation light and the charge signals induced by particle interactions in the liquid xenon target will be observed by VUV-sensitive, ultra-low background photosensors. Besides its excellent sensitivity to WIMPs with masses above $\\sim$5\\,GeV, such a detector with its large mass, low-energy threshold and ultra-low background level will also be sensitive to other rare interactions, and in particular also to bosonic dark matter candidates with masses at the keV-scale. We present the detector concept, discuss the main sources of backgrounds, the technological challenges and some of the ongoing detector design and R&D efforts, as well as the large-scale demonstrators. We end by discussing the sensitivity to particle dark matter interactions.\n\n", "2404.19502": "2024-04-30, **Interplay between Vector-like Lepton and Seesaw Mechanism:Oblique Corrections**, Shuyang Han et.al., [2404.19502v1](http://arxiv.org/abs/2404.19502v1)\n\n The non-vanishing neutrino mass strongly hints the existence of right-handed neutrinos (RHNs), singlets of the standard model (SM). However, they are highly decoupled from the SM and difficult to probe. In this work, we consider the Majorana RHNs from the type-I seesaw mechanism may well mix with the heavy neutral lepton dwelling in certain vector-like lepton (VLL), thus acquiring a sizable electroweak charge. Such a simple scenario yields many interesting consequences, and the imprint on oblique corrections, well expected from the mass splitting between components of VLL by virtue of VLL-RHN mixing, is our focus here. We analytically calculate the Peskin-Takeuchi parameters S, T and U with full details, carefully treating the Majorana loop to obtain the self consistent expressions free of divergence. Then, we constrain on the VLL-RHN system which only gives a sizable $T$ parameter using the PDG-2021 data and CDF-II data, separately, by imposing $T\\lesssim{\\cal O}(0.1)$. It is found that for the RHN and VLL below the TeV scale, with a properly large mixing, stands in the frontier of the electroweak precision test such as W-boson mass.\n\n", "2404.19471": "2024-04-30, **AGN constraints on neutrino-dark matter scattering**, James M. Cline et.al., [2404.19471v1](http://arxiv.org/abs/2404.19471v1)\n\n The IceCube collaboration has identified neutrinos of energy $\\sim 10-100$ TeV from the blazar TXS 0506+056 and the active galaxy NGC 1068, which must have traveled through a dense dark matter spike surrounding the supermassive black holes that power the galactic nuclei. We use this to set new constraints on dark matter-neutrino scattering, and interpret the results in terms of a dark photon that couples to baryon minus lepton number.\n\n", "2404.19322": "2024-04-30, **Neutrinos in Cosmology**, Eleonora Di Valentino et.al., [2404.19322v1](http://arxiv.org/abs/2404.19322v1)\n\n Neutrinos are the least known particle in the Standard Model of elementary particle physics. They play a crucial role in cosmology, governing the universe's evolution and shaping the large-scale structures we observe today. In this chapter, we review crucial topics in neutrino cosmology, such as the neutrino decoupling process in the very early universe. We shall also revisit the current constraints on the number of effective relativistic degrees of freedom and the departures from its standard expectation of 3. Neutrino masses represent the very first departure from the Standard Model of elementary particle physics and may imply the existence of new unexplored mass generation mechanisms. Cosmology provides the tightest bound on the sum of neutrino masses, and we shall carefully present the nature of these constraints, both on the total mass of the neutrinos and on their precise spectrum. The ordering of the neutrino masses plays a major role in the design of future neutrino mass searches from laboratory experiments, such as neutrinoless double beta decay probes. Finally, we shall also present the futuristic perspectives for an eventual direct detection of cosmic, relic neutrinos.\n\n", "2404.19191": "2024-04-30, **High-energy neutrino signals from supernova explosions: a new window into dark photon parameter space**, Vsevolod Syvolap et.al., [2404.19191v1](http://arxiv.org/abs/2404.19191v1)\n\n Dark photons, hypothetical feebly interacting massive vector bosons, appear in many extensions of the Standard Model. This study investigates their production and subsequent decay during supernova explosions. We demonstrate that the decay of dark photons, with masses ranging from 200 to 400 MeV, can lead to the emission of neutrinos with energies surpassing those emitted by supernovae. These neutrinos therefore serve as a distinct signal of new physics, allowing for the exploration of previously uncharted regions of the dark photon parameter space and complementing both accelerator-based searches and other astrophysical constraints. The signal is largely unaffected by the specifics of the supernova's temperature and density radial profiles outside the SN core, rendering the prediction both robust and model-independent. Our results indicate that searching for high-energy neutrinos accompanying supernova explosions provides a novel approach to probe physics beyond the Standard Model, including dark photons, heavy neutral leptons, and other feebly interacting particles with masses in the hundreds of MeV range.\n\n"}, "dark matter": {"2405.00669": "2024-05-01, **Euclid preparation. LensMC, weak lensing cosmic shear measurement with forward modelling and Markov Chain Monte Carlo sampling**, Euclid Collaboration et.al., [2405.00669v1](http://arxiv.org/abs/2405.00669v1)\n\n LensMC is a weak lensing shear measurement method developed for Euclid and Stage-IV surveys. It is based on forward modelling to deal with convolution by a point spread function with comparable size to many galaxies; sampling the posterior distribution of galaxy parameters via Markov Chain Monte Carlo; and marginalisation over nuisance parameters for each of the 1.5 billion galaxies observed by Euclid. The scientific performance is quantified through high-fidelity images based on the Euclid Flagship simulations and emulation of the Euclid VIS images; realistic clustering with a mean surface number density of 250 arcmin$^{-2}$ ($I\\_{\\rm E}<29.5$) for galaxies, and 6 arcmin$^{-2}$ ($I\\_{\\rm E}<26$) for stars; and a diffraction-limited chromatic point spread function with a full width at half maximum of $0.^{\\!\\prime\\prime}2$ and spatial variation across the field of view. Objects are measured with a density of 90 arcmin$^{-2}$ ($I\\_{\\rm E}<26.5$) in 4500 deg$^2$. The total shear bias is broken down into measurement (our main focus here) and selection effects (which will be addressed elsewhere). We find: measurement multiplicative and additive biases of $m\\_1=(-3.6\\pm0.2)\\times10^{-3}$, $m\\_2=(-4.3\\pm0.2)\\times10^{-3}$, $c\\_1=(-1.78\\pm0.03)\\times10^{-4}$, $c\\_2=(0.09\\pm0.03)\\times10^{-4}$; a large detection bias with a multiplicative component of $1.2\\times10^{-2}$ and an additive component of $-3\\times10^{-4}$; and a measurement PSF leakage of $\\alpha\\_1=(-9\\pm3)\\times10^{-4}$ and $\\alpha\\_2=(2\\pm3)\\times10^{-4}$. When model bias is suppressed, the obtained measurement biases are close to Euclid requirement and largely dominated by undetected faint galaxies ($-5\\times10^{-3}$). Although significant, model bias will be straightforward to calibrate given the weak sensitivity.\n\n", "2405.00635": "2024-05-01, **Bye bye, local bias: the statistics of the halo field are not determined by the local mass density**, Deaglan J. Bartlett et.al., [2405.00635v1](http://arxiv.org/abs/2405.00635v1)\n\n Bias models relating the dark matter field to the spatial distribution of halos are widely used in cosmological analyses. Many such models predict halos purely from the local matter density, an assumption which has not been verified in a model-agnostic setting. Bias models in perturbation theory require the inclusion of other local properties, but it is not clear whether this extends to non-perturbative approaches. We assess the validity of the assumption that only the local dark matter density can be used to predict the number density of halos in a model-independent way and in the non-perturbative regime. Utilising $N$-body simulations, we introduce a test wherein we study the properties of the halo counts field after spatial voxels with near-equal dark matter density have been permuted. If local-in-matter-density (LIMD) biasing were valid, the statistical properties of the permuted and un-permuted fields would be indistinguishable since both are equally fair draws of the stochastic biasing model. For voxels of side length $\\sim4-60\\,h^{-1}{\\rm\\,Mpc}$ and for halos less massive than $\\sim10^{15}\\,h^{-1}{\\rm\\,M\\_\\odot}$, the permuted halo field has significantly too much power on large scales compared to the truth. We interpret this as due to LIMD models removing small-scale power by not modelling correlations between neighbouring voxels. Since the permutation conserves the total variance of the halo counts field, large-scale power is substantially boosted to compensate. This conclusion is robust to the choice of initial conditions and cosmology. LIMD halo biasing cannot, therefore, reproduce the distribution of halos across a large range of scales and halo masses, no matter how complex the model. To reproduce this distribution accurately, one must allow the biasing to be a function of other quantities and/or remove the assumption that neighbouring voxels are statistically independent.\n\n", "2405.00207": "2024-04-30, **Primordial Black Hole Formation in a Dust Bouncing Model**, E. J. Barroso et.al., [2405.00207v1](http://arxiv.org/abs/2405.00207v1)\n\n Linear scalar cosmological perturbations have increasing spectra in the contracting phase of bouncing models. We study the conditions for which these perturbations may collapse into primordial black holes and the hypothesis that these objects constitute a fraction of dark matter. We compute the critical density contrast that describes the collapse of matter perturbations in the flat-dust bounce model with a parametric solution, obtained from the Lemaitre-Tolman-Bondi metric that represents the spherical collapse. We discuss the inability of the Newtonian gauge to describe perturbations in contracting models as the perturbative hypothesis does not hold in such cases. We carry the calculations for a different Gauge choice and compute the perturbations power spectra numerically. Finally, assuming a Gaussian distribution, we compute the primordial black hole abundance with the Press-Schechter formalism and compare it with observational constraints. From our analysis, we conclude that the primordial black hole formation in a dust-dominated contracting phase does not lead to a significant mass fraction of primordial black holes in dark matter today.\n\n", "2405.00147": "2024-04-30, **A deconstruction of methods to derive one-point lensing statistics**, Viviane Alfradique et.al., [2405.00147v1](http://arxiv.org/abs/2405.00147v1)\n\n Gravitational lensing is a crucial tool for exploring cosmic phenomena, providing insights into galaxy clustering, dark matter, and dark energy. Given the substantial computational demands of $N$-body simulations, approximate methods like $\\texttt{PINOCCHIO}$ and $\\texttt{turboGL}$ offer viable alternatives for simulating lensing probability density functions (PDFs). This paper evaluates these methods in contexts where baryonic effects are negligible, focusing on dark matter-dominated models and assessing their effectiveness across both weak and strong lensing regimes. Our comparative analysis reveals that these methods are particularly effective for applications involving electromagnetic and gravitational wave point sources, where strong lensing events are infrequent. Both $\\texttt{PINOCCHIO}$ and $\\texttt{turboGL}$ perform well in modeling the weak-lensing region influenced by mildly nonlinear structures. However, they lose accuracy in capturing small-scale nonlinear matter fields, owing to oversimplified assumptions about internal halo structures and reliance on perturbation theory. The analysis shows that $\\texttt{PINOCCHIO}$ achieves an 8-15% agreement with $N$-body simulations for the second-to-fourth moments of lensing PDFs. These findings aim to inform future studies on gravitational lensing of point sources, which are increasingly relevant with upcoming supernova and gravitational wave datasets.\n\n", "2405.00140": "2024-04-30, **Hydrodynamical simulations of merging galaxy clusters: giant dark matter particle colliders, powered by gravity**, Ellen L. Sirks et.al., [2405.00140v1](http://arxiv.org/abs/2405.00140v1)\n\n Terrestrial particle accelerators collide charged particles, then watch the trajectory of outgoing debris - but they cannot manipulate dark matter. Fortunately, dark matter is the main component of galaxy clusters, which are continuously pulled together by gravity. We show that galaxy cluster mergers can be exploited as enormous, natural dark matter colliders. We analyse hydrodynamical simulations of a universe containing self-interacting dark matter (SIDM) in which all particles interact via gravity, and dark matter particles can also scatter off each other via a massive mediator. During cluster collisions, SIDM spreads out and lags behind cluster member galaxies. Individual systems can have quirky dynamics that makes them difficult to interpret. Statistically, however, we find that the mean or median of dark matter's spatial offset in many collisions can be robustly modelled, and is independent of our viewing angle and halo mass even in collisions between unequal-mass systems. If the SIDM cross-section were sigma/m = 0.1cm^2/g = 0.18 barn/GeV, the 'bulleticity' lag would be ~5 percent that of gas due to ram pressure, and could be detected at 95 percent confidence in weak lensing observations of ~100 well-chosen clusters.\n\n", "2405.00112": "2024-04-30, **Transmon Qubit Constraints on Dark Matter-Nucleon Scattering**, Anirban Das et.al., [2405.00112v1](http://arxiv.org/abs/2405.00112v1)\n\n We recently pointed out that power measurements of single quasiparticle devices can be used to detect dark matter. These devices have the lowest known energy thresholds, far surpassing standard direct detection experiments, requiring energy deposition above only about an meV. We calculate dark matter induced quasiparticle densities in transmon qubits, and use the latest transmon qubit measurements that provide one of the strongest existing lab-based bounds on dark matter-nucleon scattering below about 100 MeV. We strongly constrain sub-component dark matter, using both a dark matter population thermalized in the Earth as well as the dark matter wind from the Galactic halo. We demonstrate future potential sensitivities using devices with low quasiparticle densities.\n\n", "2405.00108": "2024-04-30, **Flavor Phenomenology of Light Dark Vectors**, Jordi Folch Eguren et.al., [2405.00108v1](http://arxiv.org/abs/2405.00108v1)\n\n Light dark matter with flavor-violating couplings to fermions may be copiously produced in the laboratory as missing energy from decays of SM particles. Here we study the effective Lagrangian of a light dark vector with generic dipole or vector couplings. We calculate the resulting two-body decay rates of mesons, baryons and leptons as a function of the dark vector mass and show that existing experimental limits probe UV scales as large as $10^{12} \\,\\mathrm{GeV}$. We also derive the general RGEs in order to constrain the flavor-universal UV scenario, where all flavor violation arises radiatively proportional to the CKM matrix.\n\n", "2405.00103": "2024-04-30, **A 3D view on the local gravitational instability of cold gas discs in star-forming galaxies at $0 \\lesssim \\mathrm{z} \\lesssim 5$**, C. Bacchini et.al., [2405.00103v1](http://arxiv.org/abs/2405.00103v1)\n\n Local gravitational instability (LGI) is considered crucial for regulating star formation and gas turbulence in galaxy discs, especially at high redshift. Instability criteria usually assume infinitesimally thin discs or rely on approximations to include the stabilising effect of the gas disc thickness. We test a new 3D instability criterion for rotating gas discs that are vertically stratified in an external potential. This criterion reads $Q\\_{\\rm3D}<1$, where $Q\\_{\\rm3D}$ is the 3D analogue of the Toomre parameter $Q$. The advantage of $Q\\_{\\rm3D}$ is that it allows us to study LGI in and above the galaxy midplane in a rigorous and self-consistent way. We apply the criterion to a sample of 44 star-forming galaxies at $0\\lesssim\\mathrm{z}\\lesssim5$ hosting rotating discs of cold gas. The sample is representative of galaxies on the main sequence at $\\mathrm{z}\\approx 0$ and includes massive star-forming and starburst galaxies at $1\\lesssim\\mathrm{z}\\lesssim5$. For each galaxy, we first apply the Toomre criterion for infinitesimally thin discs, finding 10 unstable systems. We then obtain maps of $Q\\_{\\rm 3D}$ from a 3D model of the gas disc derived in the combined potential of dark matter, stars and the gas itself. According to the 3D criterion, two galaxies with $Q<1$ show no evidence of instability and the unstable regions that are 20% smaller than those where $Q<1$. No unstable disc is found at $0\\lesssim\\mathrm{z}\\lesssim 1$, while $\\approx 60$% of the systems at $2\\lesssim\\mathrm{z}\\lesssim5$ are locally unstable. In these latter, a relatively small fraction of the total gas ($\\approx 30$%) is potentially affected by the instability. Our results disfavour LGI as the main regulator of star formation and turbulence in moderately star-forming galaxies in the present-day Universe. LGI likely becomes important at high redshift, but the input by other mechanisms seems required [abridged]\n\n", "2405.00086": "2024-04-30, **Cosmic Ray-Boosted Dark Matter at IceCube**, Christopher Cappiello et.al., [2405.00086v1](http://arxiv.org/abs/2405.00086v1)\n\n Cosmic ray (CR) upscattering of dark matter is considered as one of the most straightforward mechanisms to accelerate ambient dark matter, making it detectable at high threshold, large volume experiments. In this work, we revisit CR upscattered dark matter signals at the IceCube detector, focusing on lower energy data than was considered before. We consider both scattering with electrons and nuclei. In the latter, we include both elastic and deep-inelastic scattering computations. As concrete examples, we consider two benchmark models; Fermion dark matter with vector and scalar mediators. We compare our model projections with the most current constraints and show that the IceCube detector can detect CR-boosted dark matter especially with masses below $\\sim$ 100 keV when scattering with electrons and $\\sim$ MeV in the nucleon scattering case.\n\n", "2405.00090": "2024-04-30, **Can the QCD axion feed a dark energy component?**, Kristjan Müürsepp et.al., [2405.00090v1](http://arxiv.org/abs/2405.00090v1)\n\n A pseudo Nambu-Goldstone boson (PNGB) coupled to a confining gauge group via an anomalous term is characterised, during the confining phase transition, by a temperature dependent mass $m^2(T) \\propto T^{-n}$. For $n>2$, a non-relativistic population of such particles dominating the cosmological energy density would act as dark energy (DE), accelerating the expansion. We study the possibility that a PNGB $\\varphi\\_b$ coupled to a hidden gauge group that is presently undergoing confinement could realise this scenario. To obtain the observed amount of DE, the number density of $\\varphi\\_b$ must be boosted by some mechanism. Assuming that the QCD axion $\\varphi\\_a$ constitutes the dark matter (DM), a non-adiabatic level crossing between $\\varphi\\_a$ and $\\varphi\\_b$ shortly before matter-DE equality can convert a small fraction of DM into DE, providing such mechanism and explaining the coincidence puzzle.\n\n", "2404.19655": "2024-04-30, **The Local Dark Matter Kinematic Substructure Based on LAMOST K Giants**, Hai Zhu et.al., [2404.19655v1](http://arxiv.org/abs/2404.19655v1)\n\n Numerical simulations indicate that correlations exist between the velocity distributions of stars and dark matter (DM). We study the local DM velocity distribution based on these correlations. We select K giants from LAMOST DR8 cross-matched with Gaia DR3, which has robust measurements of three-dimensional velocity and metallicity, and separate them into the disk, halo substructure and main halo components in the chemo-dynamical space utilizing the Gaussian Mixture Model. The substructure component is highly radially anisotropic, and possibly related to the Gaia-Enceladus-Sausage (GES) merger event, while the halo component is isotropic and accreted from the earliest mergers following the Maxwell-Boltzmann Distribution (Standard Halo Model, SHM). We find that the GES-like substructure contributes $\\sim85\\%$ of the local non-disk stars in the Solar neighbourhood, which is nearly invariant when applying different volume cuts or additional angular momentum constraints. Utilizing the metallicity-stellar-mass relation and the stellar-mass-halo-mass relation, we find that $\\sim25\\_{-15}^{+24}\\%$ of local DM is in the kinematic substructure. Combined with the stellar distributions of non-disk components, we compute the velocity distribution of local DM. The modified heliocentric velocity distribution of local DM shifts to a lower speed and has a sharper peak compared to the SHM, which yields updated detection limits for the DM direct detection experiments. Our work confirms that the local DM velocity distribution deviates from the SHM, and needs to be properly accounted in the DM detection experiments.\n\n", "2404.19338": "2024-04-30, **NMSSM Explanation for Excesses in the Search for Neutralinos and Charginos and a 95 GeV Higgs Boson**, Ulrich Ellwanger et.al., [2404.19338v1](http://arxiv.org/abs/2404.19338v1)\n\n The observed excesses in the search for neutralinos and charginos by ATLAS and CMS can be fitted simultaneously in the minimal supersymmetric standard model (MSSM) assuming a light higgsino mass, of magnitude less than about 250 GeV, and a compressed higgsino dominated neutralino and chargino spectrum, with $5-10\\%$ mass splittings. However, light higgsinos as dark matter would have far too large direct detection cross sections. We consider the next-to-MSSM (NMSSM) with an additional singlino-like lightest supersymmetric particle (LSP) a few GeV below the next-to-lightest supersymmetric particle (NLSP). Sparticles prefer to decay first into the NLSP and remnants from the final decay into the LSP are too soft to contribute to the observed signals. Co-annihilation in the higgsino-sector can generate a relic density in the WMAP/Planck window. The singlino-like LSP has automatically a direct detection cross section below present and future sensitivities: a direct detection signal in the near future would exclude this scenario. The singlet-like Higgs scalar of the NMSSM can have a mass around 95 GeV and signal cross sections in the $b\\bar{b}$ channel at LEP and in the $\\gamma\\gamma$ channel at the LHC compatible with the respective observations.\n\n"}, "supernova": {"2405.00608": "2024-05-01, **$f(T)$ gravity after DESI Baryon Acoustic Oscillation and DES Supernovae 2024 data**, Celia Escamilla-Rivera et.al., [2405.00608v1](http://arxiv.org/abs/2405.00608v1)\n\n In this letter we investigate new constraints on $f(T)$ gravity using the recent Baryon Acoustic Oscillation (BAO) data released by the Dark Energy Spectroscopic Instrument (DESI) and the Type Ia supernovae (SNIa) catalog from the full 5-years of the Dark Energy Survey Supernova Program (DES-SN5YR). The $f(T)$ cosmological models considered are characterised by power law late-time accelerated expansion. Our results show that the combination DESI BAO +$r\\_d$ CMB Planck suggests a Bayesian preference for late-time $f(T)$ cosmological models over $\\Lambda$CDM, obtaining a value of $H\\_0=72.4\\pm 2.9$[km/s/Mpc] in agreement with SH0ES collaboration.\n\n", "2405.00504": "2024-05-01, **JWST meets Chandra: a large population of Compton thick, feedback-free, and X-ray weak AGN, with a sprinkle of SNe**, Roberto Maiolino et.al., [2405.00504v1](http://arxiv.org/abs/2405.00504v1)\n\n We investigate the X-ray properties of a large sample of 71 broad line and narrow line AGN at 2<z<11 discovered by JWST in the GOODS fields, which have the deepest Chandra observations ever obtained. Despite the widespread presence of AGN signatures in their rest-optical and -UV spectra, the vast majority of them is X-ray undetected. The stacked X-ray data of the non-detected sources also results in a non-detection. The upper limit on the X-ray emission for many of these AGN is one or even two orders of magnitude lower than expected from a standard AGN SED. Heavy X-ray absorption by clouds with large (Compton thick) column density and low dust content, such as the Broad Line Region (BLR) clouds, can explain the X-ray weakness. In this scenario the BLR covering factor should be much larger than in low-z AGN or luminous quasar; this is supported by the larger equivalent width of the broad component of Halpha in JWST-selected AGN. We also find that the JWST-discovered AGN lack the prominent, fast outflows characterizing low-z AGN and luminous quasars, suggesting that, in JWST-selected AGN, dense gas lingers in the nuclear region, resulting in large covering factors. We also note that a large fraction of JWST-selected AGN match the definition of NLSy1, typically characterized by a steep X-ray spectrum, and this can further contribute to their observed weakness at high-z. Finally, we discuss that the broad Balmer lines used to identify type 1 AGN cannot be ascribed to Very Massive Stars, Tidal Disruption Events, or Supernovae, although we show that a minority of the faintest broad lines could potentially be associated with the echo of superluminous SNe or TDE. Scenarios in which the broad lines are ascribed to galactic outflows are also untenable. We emphasize that confirming any of the scenarios discussed above will require X-ray missions more sensitive than Chandra. (abridged)\n\n", "2405.00502": "2024-05-01, **Using non-DESI data to confirm and strengthen the DESI 2024 spatially-flat $w_0w_a$CDM cosmological parameterization result**, Chan-Gyung Park et.al., [2405.00502v1](http://arxiv.org/abs/2405.00502v1)\n\n We use a combination of Planck cosmic microwave background (CMB) anisotropy data and non-CMB data that include Pantheon+ type Ia supernovae, Hubble parameter [$H(z)$], growth factor ($f\\sigma\\_8$) measurements, and a collection of baryon acoustic oscillation (BAO) data, but not recent DESI 2024 BAO measurements, to confirm the DESI 2024 (DESI+CMB+PantheonPlus) data compilation support for dynamical dark energy with an evolving equation of state parameter $w(z) = w\\_0 + w\\_a z/(1+z)$. From our joint compilation of CMB and non-CMB data, in a spatially-flat cosmological model, we obtain $w\\_0 = -0.850 \\pm 0.059$ and $w\\_a = -0.59^{+0.26}\\_{-0.22}$ and find that this dynamical dark energy is favored over a cosmological constant by $\\sim 2\\sigma$. Our data constraints on the flat $w\\_0w\\_a$CDM model are slightly more restrictive than the DESI 2024 constraints, with the DESI 2024 and our values of $w\\_0$ and $w\\_a$ differing by $-0.27\\sigma$ and $0.44\\sigma$, respectively. Our data compilation slightly more strongly favors the flat $w\\_0w\\_a$CDM model over the flat $\\Lambda$CDM model than does the DESI 2024 data compilation.\n\n", "2405.00462": "2024-05-01, **Saturation Level of Ion Weibel Instability and Isotropization Length Scale in Electron-Ion Weibel-Mediated Shocks**, Taiki Jikei et.al., [2405.00462v1](http://arxiv.org/abs/2405.00462v1)\n\n Ion Weibel instability is considered to be the dominant physics for the dissipation in high-Mach number astrophysical shocks such as supernova remnant shocks and gamma-ray burst shocks. We study the instability dependence on various parameters using theory and particle-in-cell simulations. We demonstrate that electron physics determines the saturation level of the Weibel-generated magnetic field, even though the instability is driven by the ions. We discuss the application to astrophysical and laboratory laser experiment environments to clarify the roles of the ion Weibel instability. We develop a model for the isotropization length scale in Weibel-mediated shocks and compare its value to other characteristic length scales of each system. We find that electron heating to near equipartition is crucial for the formation of ultra-relativistic Weibel-mediated shocks. On the other hand, our results imply that non-relativistic shocks in typical interstellar medium are not purely mediated by the Weibel instability.\n\n", "2405.00337": "2024-05-01, **DEVILS/MIGHTEE/GAMA/DINGO: The Impact of SFR Timescales on the SFR-Radio Luminosity Correlation**, Robin H. W. Cook et.al., [2405.00337v1](http://arxiv.org/abs/2405.00337v1)\n\n The tight relationship between infrared luminosity (L$\\_\\mathrm{TIR}$) and 1.4 GHz radio continuum luminosity (L$\\_\\mathrm{1.4GHz}$) has proven useful for understanding star formation free from dust obscuration. Infrared emission in star-forming galaxies typically arises from recently formed, dust-enshrouded stars, whereas radio synchrotron emission is expected from subsequent supernovae. By leveraging the wealth of ancillary far-ultraviolet - far-infrared photometry from the Deep Extragalactic VIsible Legacy Survey (DEVILS) and Galaxy and Mass Assembly (GAMA) surveys, combined with 1.4 GHz observations from the MeerKAT International GHz Tiered Extragalactic Exploration (MIGHTEE) survey and Deep Investigation of Neutral Gas Origins (DINGO) projects, we investigate the impact of timescale differences between far-ultraviolet - far-infrared and radio-derived star formation rate (SFR) tracers. We examine how the SED-derived star formation histories (SFH) of galaxies can be used to explain discrepancies in these SFR tracers, which are sensitive to different timescales. Galaxies exhibiting an increasing SFH have systematically higher L$\\_\\mathrm{TIR}$ and SED-derived SFRs than predicted from their 1.4 GHz radio luminosity. This indicates that insufficient time has passed for subsequent supernovae-driven radio emission to accumulate. We show that backtracking the SFR(t) of galaxies along their SED-derived SFHs to a time several hundred megayears prior to their observed epoch will both linearise the SFR-L$\\_\\mathrm{1.4GHz}$ relation and reduce the overall scatter. The minimum scatter in the SFR(t)-L$\\_\\mathrm{1.4GHz}$ is reached at 200 - 300 Myr prior, consistent with theoretical predictions for the timescales required to disperse the cosmic ray electrons responsible for the synchrotron emission.\n\n", "2405.00153": "2024-04-30, **Supernova limits on 'QCD axion-like particles'**, Alessandro Lella et.al., [2405.00153v1](http://arxiv.org/abs/2405.00153v1)\n\n In this paper, we explore the phenomenology of massive Axion-Like Particles (ALPs) coupled to quarks and gluons, dubbed 'QCD ALPs', with an emphasis on the associated low-energy observables. ALPs coupled to gluons and quarks not only induce nuclear interactions at scales below the QCD-scale, relevant for ALP production in supernovae (SNe), but naturally also couple to photons similarly to the QCD-axion. We discuss the link between the high-energy formulation of ALP theories and their effective couplings with nucleons and photons. The induced photon coupling allows ALPs with masses $m\\_a\\gtrsim1$ MeV to efficiently decay into photons, and astrophysical observables severely constrain the ALP parameter space. We show that a combination of arguments related to SN events rule out ALP-nucleon couplings down to $g\\_{aN}\\gtrsim 10^{-11}- 10^{-10}$ for $m\\_a\\gtrsim1$ MeV - a region of the parameter space that was hitherto unconstrained.\n\n", "2405.00147": "2024-04-30, **A deconstruction of methods to derive one-point lensing statistics**, Viviane Alfradique et.al., [2405.00147v1](http://arxiv.org/abs/2405.00147v1)\n\n Gravitational lensing is a crucial tool for exploring cosmic phenomena, providing insights into galaxy clustering, dark matter, and dark energy. Given the substantial computational demands of $N$-body simulations, approximate methods like $\\texttt{PINOCCHIO}$ and $\\texttt{turboGL}$ offer viable alternatives for simulating lensing probability density functions (PDFs). This paper evaluates these methods in contexts where baryonic effects are negligible, focusing on dark matter-dominated models and assessing their effectiveness across both weak and strong lensing regimes. Our comparative analysis reveals that these methods are particularly effective for applications involving electromagnetic and gravitational wave point sources, where strong lensing events are infrequent. Both $\\texttt{PINOCCHIO}$ and $\\texttt{turboGL}$ perform well in modeling the weak-lensing region influenced by mildly nonlinear structures. However, they lose accuracy in capturing small-scale nonlinear matter fields, owing to oversimplified assumptions about internal halo structures and reliance on perturbation theory. The analysis shows that $\\texttt{PINOCCHIO}$ achieves an 8-15% agreement with $N$-body simulations for the second-to-fourth moments of lensing PDFs. These findings aim to inform future studies on gravitational lensing of point sources, which are increasingly relevant with upcoming supernova and gravitational wave datasets.\n\n", "2405.00113": "2024-04-30, **The Extremely Metal-Poor SN 2023ufx: A Local Analog to High-Redshift Type II Supernovae**, Michael A. Tucker et.al., [2405.00113v1](http://arxiv.org/abs/2405.00113v1)\n\n We present extensive observations of the Type II supernova (SN II) 2023ufx which is likely the most metal-poor SN II observed to-date. It exploded in the outskirts of a low-metallicity ($Z\\_{\\rm host} \\sim 0.1~Z\\_\\odot$) dwarf ($M\\_g = -13.23\\pm0.15$~mag; $r\\_e\\sim 1$~kpc) galaxy. The explosion is luminous, peaking at $M\\_g\\approx -18.5~$mag, and shows rapid evolution. The $r$-band (pseudo-bolometric) light curve has a shock-cooling phase lasting 20 (17) days followed by a 19 (23)-day plateau. The entire optically-thick phase lasts only $\\approx 55~$days following explosion, indicating that the red supergiant progenitor had a thinned H envelope prior to explosion. The early spectra obtained during the shock-cooling phase show no evidence for narrow emission features and limit the pre-explosion mass-loss rate to $\\dot{M} \\lesssim 10^{-3}~\\rm M\\_\\odot$/yr. The photospheric-phase spectra are devoid of prominent metal absorption features, indicating a progenitor metallicity of $\\lesssim 0.1~Z\\_\\odot$. The semi-nebular ($\\sim 60-130~$d) spectra reveal weak Fe II, but other metal species typically observed at these phases (Ti II, Sc II, Ba II) are conspicuously absent. The late-phase optical and near-infrared spectra also reveal broad ($\\approx 10^4~\\rm{km}~\\rm s^{-1}$) double-peaked H$\\alpha$, P$\\beta$, and P$\\gamma$ emission profiles suggestive of a fast outflow launched during the explosion. Outflows are typically attributed to rapidly-rotating progenitors which also prefer metal-poor environments. This is only the second SN II with $\\lesssim 0.1~Z\\_\\odot$ and both exhibit peculiar evolution, suggesting a sizable fraction of metal-poor SNe II have distinct properties compared to nearby metal-enriched SNe II. These observations lay the groundwork for modeling the metal-poor SNe II expected in the early Universe.\n\n", "2405.00111": "2024-04-30, **Vorticity Suppression by Particle Lag Effects in Shock-Driven Multiphase Instability**, Vasco O. Duke-Walker et.al., [2405.00111v1](http://arxiv.org/abs/2405.00111v1)\n\n Shock-driven multiphase mixing occurs in many physical systems such as explosive dispersal of chemical or biological agents, in the evolution of supernova remnants, and in supersonic and detonative combustion engines. This mixing process is driven by the Shock Driven Multiphase Instability (SDMI), a derivative of the canonical Richtmyer-Meshkov Instability (RMI). The SDMI deviates from the RMI as particle lag effects become significant, where a higher momentum deficit leads to longer equilibration times and a reduction in hydrodynamic mixing. In this work, the effect of particle lag (rate of momentum transfer) on the SDMI evolution was isolated and investigated utilizing solid nondeforming and nonevaporating particles of differing sizes while holding the effective density ratio (mass of particles in the interface) constant. Three particle sizes were selected with increasing velocity relaxation times. Experiments were conducted by accelerating a cylindrical interface comprised of air and seeded particles surrounded by clean (particle-free) air with a Mach 1.35 shock wave. The development of the multiphase interface was measured using particle imaging velocimetry (PIV). Circulation measurements showed a decrease in mixing with increasing particle size. Finally, a new model, derived from theory, is proposed to predict circulation deposition, mixing energy, in the SDMI based on shock strength, effective density ratio, and particle response times.\n\n", "2405.00096": "2024-04-30, **Pristine Inner Galaxy Survey (PIGS) IX. The largest detailed chemical analysis of very metal-poor stars in the Sagittarius dwarf galaxy**, Federico Sestito et.al., [2405.00096v1](http://arxiv.org/abs/2405.00096v1)\n\n The most metal-poor stars provide valuable insights into the early chemical enrichment history of a system, carrying the chemical imprints of the first generations of supernovae. The most metal-poor region of the Sagittarius dwarf galaxy remains inadequately observed and characterised. To date, only a handful of stars with [Fe/H]$<-2.0$ have been chemically analysed with high-resolution spectroscopy. In this study, we present the most extensive chemical abundance analysis of 12 low-metallicity stars with metallicities down to [Fe/H]$=-3.26$ and located in the main body of Sagittarius. These targets, selected from the Pristine Inner Galaxy survey, were observed using the MIKE high-resolution spectrograph at the Magellan-Clay telescope, which allows us to measure up to 17 chemical species. The chemical composition of these stars reflects the imprint of a variety of type~II supernovae. A combination of low- to intermediate-mass core-collapse and hypernovae ($\\sim10-70 M\\_{\\odot}$) is required to account for the abundance patterns of the lighter elements up to the Fe-peak. The trend of the heavy elements suggests the involvement of compact binary merger events and fast-rotating (up to $\\sim300$ km s$^{-1}$) intermediate-mass to massive metal-poor stars ($\\sim25-120 M\\_{\\odot}$) that are the sources of rapid- and slow-processes, respectively. Additionally, asymptotic giant branch stars contribute to a wide dispersion of [Ba/Mg] and [Ba/Eu]. The absence of an $\\alpha-$knee in our data indicates that type Ia supernovae did not contribute in the very metal-poor region ( [Fe/H]$\\leq-2.0$). However, they might have started to pollute the interstellar medium at [Fe/H]$>-2.0$, given the relatively low [Co/Fe] in this metallicity region.\n\n", "2404.19208": "2024-04-30, **Optical Spectroscopy of Type Ia Supernovae by the Carnegie Supernova Projects I and II**, N. Morrell et.al., [2404.19208v1](http://arxiv.org/abs/2404.19208v1)\n\n We present the second and final release of optical spectroscopy of Type Ia Supernovae (SNe Ia) obtained during the first and second phases of the Carnegie Supernova Project (CSP-I and CSP-II). The newly released data consist of 148 spectra of 30 SNe Ia observed in the course of the CSP-I, and 234 spectra of 127 SNe Ia obtained during the CSP-II. We also present 216 optical spectra of 46 historical SNe Ia, including 53 spectra of 30 SNe Ia observed by the Cal\\'an/Tololo Supernova Survey. We combine these observations with previously published CSP data and publicly-available spectra to compile a large sample of measurements of spectroscopic parameters at maximum light, consisting of pseudo-equivalent widths and expansion velocities of selected features, for 232 CSP and historical SNe Ia (including more than 1000 spectra). Finally, we review some of the strongest correlations between spectroscopic and photometric properties of SNe Ia. Specifically, we define two samples: one consisting of SNe Ia discovered by targeted searches (most of them CSP-I objects) and the other composed of SNe Ia discovered by untargeted searches, which includes most of the CSP-II objects. The analysed correlations are similar for both samples. We find a larger incidence of SNe Ia belonging to the Cool (CL)and Broad Line (BL) Branch subtypes among the events discovered by targeted searches, Shallow Silicon (SS) SNe Ia are present with similar frequencies in both samples, while Core Normal (CN) SNe Ia are more frequent in untargeted searches.\n\n"}}