{"neutrino": {"2310.02212": "2023-10-03, **Neutrino Emissions of TXS 0506+056 caused by a Supermassive Binary Black Hole Inspiral?**, Ilja Jaroschewski et.al., [2310.02212v1](http://arxiv.org/abs/2310.02212v1)\n\n The IceCube neutrino observatory detected two distinct flares of high-energy neutrinos from the direction of the blazar TXS 0506+056: a $\\sim 300$ TeV single neutrino on September 22, 2017 and a $3.5\\sigma$ signature of a dozen TeV neutrinos in 2014/2015. In a previous work, it was shown that these two episodes of neutrino emission could be due to an inspiral of a supermassive binary black hole (SMBBH) close to its merger at the core of TXS 0506+056. Such an inspiral can lead to quasi-periodic particle emission due to jet precession close to the final coalescence. This model made predictions on when the next neutrino emission episode must occur. On September 18, 2022, IceCube detected an additional, $\\sim 170$ TeV neutrino in directional coincidence with the blazar TXS 0506+056, being consistent with the model prediction. Additionally, in April 2021, the Baikal Collaboration reported the detection of a $224\\pm 75$ TeV neutrino, with TXS 0506+056 being in the uncertainty range of the event direction. We show that these four distinct flares of neutrino emission from TXS 0506+056 are consistent with a precessing jet scenario, driven by an inspiraling SMBBH. Using improved modeling, we are now able to constrain the total mass together with the mass ratio for the binary. We predict when the next neutrino flares from TXS 0506+056 should be happening. Finally, we estimate the detection potential of the Laser-interferometer Space Antenna (LISA) for the merger in the future.\n\n", "2310.02112": "2023-10-03, **Real-time Signal Detection for Cyclotron Radiation Emission Spectroscopy Measurements using Antenna Arrays**, A. Ashtari Esfahani et.al., [2310.02112v1](http://arxiv.org/abs/2310.02112v1)\n\n Cyclotron Radiation Emission Spectroscopy (CRES) is a technique for precision measurement of the energies of charged particles, which is being developed by the Project 8 Collaboration to measure the neutrino mass using tritium beta-decay spectroscopy. Project 8 seeks to use the CRES technique to measure the neutrino mass with a sensitivity of 40~meV, requiring a large supply of tritium atoms stored in a multi-cubic meter detector volume. Antenna arrays are one potential technology compatible with an experiment of this scale, but the capability of an antenna-based CRES experiment to measure the neutrino mass depends on the efficiency of the signal detection algorithms. In this paper, we develop efficiency models for three signal detection algorithms and compare them using simulations from a prototype antenna-based CRES experiment as a case-study. The algorithms include a power threshold, a matched filter template bank, and a neural network based machine learning approach, which are analyzed in terms of their average detection efficiency and relative computational cost. It is found that significant improvements in detection efficiency and, therefore, neutrino mass sensitivity are achievable, with only a moderate increase in computation cost, by utilizing either the matched filter or machine learning approach in place of a power threshold, which is the baseline signal detection algorithm used in previous CRES experiments by Project 8.\n\n", "2310.02085": "2023-10-03, **Fermilab Main Injector and Recycler Operations in the Megawatt Era**, A. P. Schreckenberger et.al., [2310.02085v1](http://arxiv.org/abs/2310.02085v1)\n\n Significant upgrades to Fermilab's accelerator complex have accompanied the development of LBNF (the Long Baseline Neutrino Facility) and DUNE (Deep Underground Neutrino Experiment). These improvements will facilitate 1-MW operation of the NuMI (Neutrinos at the Main Injector) beam for the first time this year through changes to the Recycler slip-stacking procedure and shortening of the Main Injector ramp time. The modifications to the Recycler slip-stacking and efforts to reduce the duration of the Main Injector ramp will be discussed. Additionally, details regarding further shortening of the ramp time and the subsequent impacts on future accelerator operations are presented.\n\n", "2310.02007": "2023-10-03, **Nuclear models for inclusive lepton-nucleus scattering in the quasi-elastic region and beyond**, Valerio Belocchi et.al., [2310.02007v1](http://arxiv.org/abs/2310.02007v1)\n\n High-precision measurements in neutrino oscillation experiments require a very accurate description of the lepton-nucleus scattering process. Several cross-section calculations are available, but important discrepancies are still present between different model predictions. For the quasi-elastic channel, dominated by one particle-one hole excitations, an overview over several nuclear models - specifically Relativistic Fermi Gas, SuperScaling Approach, Spectral Function, Hartree-Fock and Random Phase Approximation - is presented and compared with data for electron-nucleus scattering, a very important process for testing theoretical models validity, highlighting the specific features of each approach. Furthermore an ongoing microscopic calculation of the two particle-two hole excitations contribution to the electromagnetic response is presented, and some preliminary results are shown.\n\n", "2310.01832": "2023-10-03, **Quantum algorithm for the Vlasov simulation of the large-scale structure formation with massive neutrinos**, Koichi Miyamoto et.al., [2310.01832v1](http://arxiv.org/abs/2310.01832v1)\n\n It is now experimentally established that neutrino has finite mass, and investigating its cosmological implication is of significant importance also for fundamental physics. In particular, as a matter component, massive neutrino affects the formation of the large-scale structure (LSS) of the universe, and conversely, observations of the LSS can give constraints on the neutrino mass. Performing large numerical simulations of the LSS formation including massive neutrino along with conventional cold dark matter is thus an important task. For this, calculating the neutrino distribution in the phase space by solving the Vlasov equation is a more suitable approach than conventional $N$-body simulations, but it requires solving the PDE in the $(6+1)$-dimensional space and is thus computationally demanding: configuring $n\\_\\mathrm{gr}$ grid points in each coordinate and $n\\_t$ time grid points leads to $O(n\\_tn\\_\\mathrm{gr}^6)$ complexity. We propose an efficient quantum algorithm for this task. Linearizing the Vlasov equation by neglecting the relatively weak self-gravity of the neutrino, we perform the Hamiltonian simulation to produce quantum states that encode the phase space distribution of neutrino. We also propose a way to extract the power spectrum of the neutrino density perturbations as classical data from the quantum state by quantum amplitude estimation with accuracy $\\epsilon$ and query complexity of order $\\widetilde{O}((n\\_\\mathrm{gr} + n\\_t)/\\epsilon)$. As far as we know, this is the first quantum algorithm for the LSS simulation that outputs the quantity of practical interest with guaranteed accuracy.\n\n", "2310.01814": "2023-10-03, **Statistical Issues on the Neutrino Mass Hierarchy with $Δχ^{2}$**, Fatma Sawy et.al., [2310.01814v1](http://arxiv.org/abs/2310.01814v1)\n\n The Neutrino Mass Hierarchy Determination ($\\nu$ MHD) is one of the main goals of the major current and future neutrino experiments. The statistical analysis usually proceeds from a standard method, a single dimensional estimator $(1D-\\Delta \\chi^{2})$ that shows some draw-backs and concerns, together with a debatable strategy. The draw-backs and considerations of the standard method will be explianed through the following three main issues. First issue is the limited power of the standard method. The $\\Delta \\chi^{2}$ estimator provides us with different results when different simulation procedures were used. Second issue, when $\\chi^{2}\\_{min(NH)}$ and $\\chi^{2}\\_{min(IH)}$ are drawn in a $2D$ map, their strong positive correlation manifests $\\chi^{2}$ as a bi-dimensional instead of single dimensional estimator. The overlapping between the $\\chi^{2}$ distributions of the two hypotheses leads to the experiment sensitivity reduction. Third issue is the robustness of the standard method. When the JUNO sensitivity is obtained using different procedures, $\\Delta \\chi^{2}$ as one dimensional and $\\chi^{2}$ as two dimensional estimator, the experimental sensitivity varies with the different values of the atmospheric mass, the input parameter. We computed the oscillation of $\\vert\\overline{\\Delta \\chi^{2}} \\vert$ with the input parameter values, $\\vert\\Delta m^{2} \\vert\\_{input}$. The MH significance using the standard method, $\\Delta\\chi^{2}$, strongly depends on the values of the parameter $\\vert\\Delta m^{2} \\vert\\_{input}$. Consequently, the experiment sensitivity depends on the precision of the atmospheric mass. This evaluation of the standard method confirms the draw-backs.\n\n", "2310.01510": "2023-10-02, **Neutrinos from muon-rich ultra high energy electromagnetic cascades: The MUNHECA code**, AmirFarzan Esmaeili et.al., [2310.01510v1](http://arxiv.org/abs/2310.01510v1)\n\n An ultra high energy electromagnetic cascade, a purely leptonic process and initiated by either photons or $e^\\pm$, can be a source of high energy neutrinos. We present a public python3 code, MUNHECA, to compute the neutrino spectrum by taking into account various QED processes, with the cascade developing either along the propagation in the cosmic microwave background in the high-redshift universe or in a predefined photon background surrounding the astrophysical source. The user can adjust various settings of MUNHECA, including the spectrum of injected high energy photons, the background photon field and the QED processes governing the cascade evolution. We improve the modeling of several processes, provide examples of the execution of MUNHECA and compare it with some earlier and more simplified estimates of the neutrino spectrum from electromagnetic cascades.\n\n", "2310.01509": "2023-10-02, **Observational evidence for neutrino natal kicks from black-hole binary VFTS 243**, Alejandro Vigna-Gómez et.al., [2310.01509v1](http://arxiv.org/abs/2310.01509v1)\n\n The recently reported observation of VFTS 243 is the first example of a massive black-hole binary system with negligible binary interaction following black-hole formation. The black-hole mass ($\\approx 10\\ M\\_{\\odot}$) and near-circular orbit ($e\\approx 0.02$) of VFTS 243 suggest that the progenitor star experienced complete collapse, with energy-momentum being lost predominantly through neutrinos. VFTS 243 enables us to constrain the natal kick and neutrino-emission asymmetry during black-hole formation. At 68% C.L., the natal kick velocity (mass decrement) is $\\lesssim 10$ km/s ($\\lesssim 1.0\\ M\\_{\\odot}$). Most likely $\\approx 0.3\\ M\\_{\\odot}$ were ejected, presumably in neutrinos, and the black hole experienced a natal kick of $4$ km/s. The neutrino-emission asymmetry is $\\lesssim 4$%, with best fit values of $\\sim$0-0.2%. Such a small neutrino natal kick accompanying black-hole formation is in agreement with theoretical predictions.\n\n", "2310.01491": "2023-10-02, **First constraints on Non-minimally coupled Natural and Coleman-Weinberg inflation in the light of massive neutrino self-interactions and Planck+BICEP/Keck**, Nilay Bostan et.al., [2310.01491v1](http://arxiv.org/abs/2310.01491v1)\n\n In this work, for the first time in literature, we compare the predictions of non-minimally coupled Natural and Coleman-Weinberg potentials in the $n\\_s-r$ plane against the constraints from the latest cosmological data in an extended $\\Lambda$CDM model where we include non-standard self-interactions among massive neutrinos, mediated by a heavy scalar or vector boson. For the inflationary potentials, we consider two different formulations in gravity that are non-minimally coupled to the scalar field of the inflaton: \\textit{Metric and Palatini.} We only consider the self-interaction to be present among $\\tau$-neutrinos and only at moderate strengths. This is because strong interactions among $\\tau$-neutrinos, or any strength self-interaction among electron- and muon-neutrinos, as well as any strength flavor-universal interactions, are strongly disfavoured from particle physics experiments.   In terms of cosmological data, we use the latest public CMB datasets from Planck and BICEP/Keck collaborations, along with other data from CMB lensing, BAO, RSD, and SNe Ia luminosity distance measurements. We find that there are some situations where predictions from the inflationary models are ruled out at more than 2$\\sigma$ by the minimal $\\Lambda$CDM$+r$ model, but they are allowed in the self-interacting neutrino scenario.\n\n", "2310.01414": "2023-10-02, **Broadening of particle distributions in electron- and (anti)neutrino-nucleus scattering from QED interactions**, Oleksandr Tomalak et.al., [2310.01414v1](http://arxiv.org/abs/2310.01414v1)\n\n Proper interpretation of past, current, and future data on lepton-nucleus reactions requires a clear separation between quantum electrodynamics (QED) and strong interaction effects inside the nucleus. First studies of QED in-medium lepton dynamics have set a theoretical framework to derive electron-nucleus and (anti)neutrino-nucleus cross-section corrections. We employ this approach to quantitatively compute the effects of Glauber photon-mediated multiple re-scattering within the nuclear medium. We find that the relativistic charged lepton acquires momentum of order $10~\\mathrm{MeV}$ transverse to its direction of propagation inside the nucleus. This broadening sizably deflects expected electron tracks and suppresses scattering cross sections. Precise extraction of the nucleon and nuclear structure by electron and muon probes should, thus, take the QED nuclear medium angular redistribution of particles into account. Our results further show that the associated effects in (anti)neutrino-nucleus scattering with measured final-lepton energy are significant only at the kinematical endpoints.\n\n", "2310.01314": "2023-10-02, **Particle physics in the sub-keV energy regime**, Charles Mark Lewis et.al., [2310.01314v1](http://arxiv.org/abs/2310.01314v1)\n\n Coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) and other rare-event physics searches, like dark matter detection, have been especially furthered by increasing sensitivity to low-energy particle interactions. Experiments using multiple detector technologies have sought CE$\\nu$NS at the most intense terrestrial sources of neutrinos: spallation facilities and nuclear reactors. This thesis reports on the feasibility of using cryogenic pure CsI as an improved next-generation CE$\\nu$NS target at the up-and-coming European Spallation Source. Calibrations and simulations presented here predict an increase by a factor of at least $\\sim33$ in the rate of observable neutrino-induced events per unit mass, compared to past use of room-temperature CsI[Na]. Also reported is the first measurement of CE$\\nu$NS from antineutrinos at the Dresden Generating Station, a power nuclear reactor, employing a large-mass semiconducting germanium diode dubbed NCC-1701. In each section on detecting these neutrino couplings, the importance of understanding device response to low-energy nuclear recoils is highlighted. Finally, finding synergy for tools developed to extricate sub-keV CE$\\nu$NS signals, a search for the exotic mode of muon decay $\\mu^+ \\xrightarrow{} e^+X$ was performed. New sensitivity limits in previously untouched parameter space for a massive boson dark matter candidate of cosmological interest are presented.\n\n", "2310.01274": "2023-10-02, **Constraining MeV Neutrino Emission of Bright Transients with IceCube**, Nora Valtonen-Mattila et.al., [2310.01274v1](http://arxiv.org/abs/2310.01274v1)\n\n MeV neutrinos are produced in many astrophysical transients, such as stellar collapses and high-energy jets, where they play a role in sustaining and cooling energetic explosions. Detecting these neutrinos from sources outside the Milky Way is very difficult due to the small neutrino-nucleon cross section at MeV. Nevertheless, the non-observation of MeV neutrinos from high-energy transients may provide useful constraints on related neutrino production mechanisms where significant MeV production is expected. The IceCube Neutrino Observatory, a cubic kilometer neutrino detector operating with nearly 100% uptime at the South Pole, is sensitive to bursts of MeV neutrinos from astrophysical sources in and beyond the Milky Way. In this work, we describe the MeV neutrino detection system of IceCube and show results from several categories of astrophysical transients.\n\n", "2310.01125": "2023-10-02, **Searching for joint neutrino and gravitational wave emission from the environment of Active Galactic Nuclei**, Giacomo Bruno et.al., [2310.01125v1](http://arxiv.org/abs/2310.01125v1)\n\n With the observation of gravitational waves from merging compact binary systems, a new observing window of the universe has been opened. Most of the gravitational wave events currently detected are due to the merger of binary black hole systems. One way to better investigate such systems is to look for coincident emission in electromagnetic waves or neutrinos. For typical models of isolated binaries, no such emission is expected. However, one promising class of mergers is that of binary black holes in the accretion disk of active galactic nuclei. Such mergers potentially occur at high rates, since these environments naturally have high numbers of black holes, which can efficiently form binaries, merge rapidly, and potentially accrete matter fast due to the surrounding gas. Here, we propose a method to search for coincident gravitational wave and neutrino emission from the location of known AGN, using an unbinned maximum likelihood analysis, and apply it to currently available public data.\n\n"}, "dark matter": {"2310.02126": "2023-10-03, **Light QCD Axion Dark Matter from Double Level Crossings**, Hai-Jun Li et.al., [2310.02126v1](http://arxiv.org/abs/2310.02126v1)\n\n The even light QCD axion called the $Z\\_{\\mathcal N}$ axion can both solve the strong CP problem and account for the dark matter (DM). We point out that the double level crossings can naturally take place in the mass mixing between the $Z\\_{\\mathcal N}$ axion and axionlike particle (ALP). The first level crossing occurs much earlier than the QCD phase transition, while the second level crossing occurs exactly during the QCD phase transition if it exists. The $Z\\_{\\mathcal N}$ axion DM relic density can be suppressed or enhanced in the single level crossing, and suppressed in the double level crossings, depending on the onset of axion oscillations. The future axion experiments can detect these level crossing effects.\n\n", "2310.01996": "2023-10-03, **Updated bounds on Axion-Like Particle Dark Matter with the optical MUSE-Faint survey**, Elisa Todarello et.al., [2310.01996v1](http://arxiv.org/abs/2310.01996v1)\n\n Bounds are derived on the axion-like particle (ALP) to two-photon coupling in the mass range $2.65-5.27$ eV. The bounds are obtained by searching for the signal from ALP decay in the Multi Unit Spectroscopic Explorer (MUSE) observations of five dwarf spheroidal galaxies, under the assumption that ALPs constitute the dark matter component of the haloes. These bounds are of the same order and improve on the robustness of those of Reference~\\cite{Regis}, and currently represent the strongest bounds within the considered mass range.\n\n", "2310.01847": "2023-10-03, **Dark Matter Search with Cherenkov Telescope Array**, Nagisa Hiroshima et.al., [2310.01847v1](http://arxiv.org/abs/2310.01847v1)\n\n Many models of dark matter (DM) are now widely considered and probed intensively with accelerators, underground detectors, and astrophysical experiments. Among the various approaches, high-energy astrophysical observations are extremely useful to complement laboratory searches for some DM candidates. In the near future, the Cherenkov Telescope Array (CTA) should enable us to access much heavier weakly interacting massive particles, as well as a broad range of other DM candidates. In this talk, we describe DM searches with CTA.\n\n", "2310.01724": "2023-10-03, **A Strategy for Identifying Periodic Sources Contributing to the Galactic Center Excess**, Eric J. Baxter et.al., [2310.01724v1](http://arxiv.org/abs/2310.01724v1)\n\n The origin of the Galactic Center gamma-ray excess has not been conclusively determined after over a decade of careful study. The two most widely discussed possibilities are a population of millisecond pulsars (MSPs), and annihilation of dark matter particles. In contrast with annihilating dark matter, MSPs are expected to produce periodic emission. We show that even though the number of photons contributing to the excess is small, there is potentially sufficient information in the data from Fermi to detect a periodic MSP signal. Such a detection would definitively prove that at least some fraction of the excess is due to MSPs. We argue that this conclusion is robust to potential timing perturbations of the gamma-ray photons, such as those due to Earth's orbit, even if the number of parameters that must be used to model the perturbations is $\\sim 7$.\n\n", "2310.01480": "2023-10-02, **Vector Space Integration for Dark Matter Scattering**, Benjamin Lillard et.al., [2310.01480v1](http://arxiv.org/abs/2310.01480v1)\n\n I present a highly efficient integration method for scattering calculations, which can reduce the evaluation time of particularly challenging analyses by a factor of $10^7$. By projecting each item in the integrand onto vector spaces spanned by simple basis functions, a multidimensional numerical integral is replaced by a much easier exercise in matrix multiplication. This method can be generalized to any integrand that depends linearly on multiple input functions. In this paper I apply the method to dark matter (DM) direct detection with anisotropic target materials, where the DM scattering rate depends not only on the DM particle model, the astrophysical DM velocity distribution, and the properties of the target material, but now also on the $SO(3)$ orientation of the detector. The vector space calculation factorizes the astrophysics, the DM particle model, and the SM material properties from each other, while describing detector rotations by simple matrix multiplication acting on the basis functions. Difficult analyses, which otherwise would take decades or centuries on a computing cluster, can now be performed in a few hours on a laptop.\n\n", "2310.01483": "2023-10-02, **Wavelet-Harmonic Integration Methods**, Benjamin Lillard et.al., [2310.01483v1](http://arxiv.org/abs/2310.01483v1)\n\n A new integration method drastically improves the efficiency of the dark matter direct detection calculation. In this work I introduce a complete, orthogonal basis of spherical wavelet-harmonic functions, designed for the new vector space integration method. This factorizes the numeric calculation into a part that depends only on the astrophysical velocity distribution; a second part, depending only on the detector form factor; and a scattering matrix defined on the basis functions, which depends on the details of the dark matter (DM) particle model (e.g. its mass). For common spin-independent DM-Standard Model interactions, this scattering matrix can be evaluated analytically in the wavelet-harmonic basis. This factorization is particularly helpful for the more complicated analyses that have become necessary in recent years, especially those involving anisotropic detector materials or more realistic models of the local DM velocity distribution. With the new method, analyses studying large numbers of detector orientations and DM particle models can be performed about 10 million times faster.   This paper derives several analytic results for the spherical wavelets, including an extrapolation in the space of wavelet coefficients, and a generalization of the vector space method to a much broader class of linear functional integrals. Both results are highly relevant outside the field of DM direct detection.\n\n", "2310.01473": "2023-10-02, **A modern view of galaxies and their stellar populations**, Pavel Kroupa et.al., [2310.01473v1](http://arxiv.org/abs/2310.01473v1)\n\n A critical discourse is provided on the current status of the astrophysics of galaxies in view of open fundamental questions on the law of gravitation and the physics-driven variation of the galaxy-wide stellar initial mass function (GWIMF). The Einstein/Newtonian plus cold or warm dark-matter-based models face many significant but unresolved tensions (e.g. planes of satellites, the highly organised and symmetrical structure of the Local Group, the local Gpc-scale void). The accumulating nature of these indicates quite compellingly the need for a different theoretical framework. An example is the prediction, made in 1997, of the existence of satellite galaxies with near-exact properties to the Hercules dwarf spheroidal satellite galaxy discovered in 2007 if it is a tidal dwarf galaxy void of dark matter. Such results indicate that once the evidence is accepted that dark matter particles have no role in galaxies with gravitation being effectively Milgromian, then the resulting theoretical understanding of galaxies becomes much simpler and highly predictive with remarkable successes. Along with these scientific advancements, the recent observational data solidify the existence of one of the most important relations in star-formation theory, namely the mmax-Mecl relation. The data rule out stochastic star formation and confirm that the IMF becomes increasingly top-heavy with increasing star-formation rate density. Galaxies and their embedded-star-cluster building blocks are therefore self-regulated dynamical systems which are computationally accessible. Finding a theory for the formation of galaxies involves the development of a new cosmological model, which may differ substantially from the dark-matter based one. Very significant new opportunities have thus emerged for inquisitive and daring researchers which may appear risky now but almost certainly lead to major breakthroughs.\n\n", "2310.01411": "2023-10-02, **Evolution of Stellar Bars in Spinning Dark Matter Halos and Stellar Bulges**, Xingchen Li et.al., [2310.01411v1](http://arxiv.org/abs/2310.01411v1)\n\n We use high-resolution numerical simulations to follow the barred disk evolution in a suite of models with progressively more massive stellar bulges, with bulge-to-total (disk$+$bulge) mass ratios of $B/T\\sim 0-0.25$, embedded in dark matter (DM) halos with the spin $\\lambda \\sim 0 - 0.09$. We focus on models with a sequence of initial rotational support for bulges, and analyze their spinup and spindown. We find that (1) the presence of a bulge affects the evolution of stellar bars, i.e., the timescale of bar instability, bar pattern speed and its decay, and the vertical buckling instability. The bar strength is nearly independent of $B/T$ in halos with spin $\\lambda = 0$, and is suppressed by a factor $\\sim 2$ for halos with $\\lambda = 0.09$; (2) The main effect of the bulge is the destruction of the harmonic core which affects the buckling; (3) The bulge plays a minor role in the exchange of angular momentum between the barred disk and the DM halo, during its spinup and spindown; (4) Most interestingly, the buckling process triggers different response above/below the disk midplane, which anti-correlates with the bulge mass; (5) In spinning halos, the buckling process has a prolonged amplitude tail, extending by few Gyr, as verified by measuring distortions in the Laplace plane; (6) Furthermore, as verified by orbital spectral analysis, the bulge gains its spin from the bar mainly via the inner Lindblad resonance, while losing it via a number of resonances lying between the outer and inner Lindblad resonance.\n\n", "2310.01345": "2023-10-02, **The Superconducting Quasiparticle-Amplifying Transmon: A Qubit-Based Sensor for meV Scale Phonons and Single THz Photons**, Caleb W. Fink et.al., [2310.01345v1](http://arxiv.org/abs/2310.01345v1)\n\n With great interest from the quantum computing community, an immense amount of R&D effort has been invested into improving superconducting qubits. The technologies developed for the design and fabrication of these qubits can be directly applied to applications for ultra-low threshold particle detectors, e.g. low-mass dark matter and far-IR photon sensing. We propose a novel sensor based on the transmon qubit architecture combined with a signal-enhancing superconducting quasiparticle amplification stage. We refer to these sensors as SQUATs: Superconducting Quasiparticle-Amplifying Transmons. We detail the operating principle and design of this new sensor and predict that with minimal R&D effort, solid-state based detectors patterned with these sensors can achieve sensitivity to single THz photons, and sensitivity to $1\\,\\mathrm{meV}$ phonons in the detector absorber substrate on the $\\mu\\mathrm{s}$ timescale.\n\n", "2310.01344": "2023-10-02, **Measuring gravity by holding atoms**, Cristian D. Panda et.al., [2310.01344v1](http://arxiv.org/abs/2310.01344v1)\n\n Despite being the dominant force of nature on large scales, gravity remains relatively elusive to experimental measurement. Many questions remain, such as its behavior at small scales or its role in phenomena ascribed to dark matter and dark energy. Atom interferometers are powerful tools for probing Earth's gravity, the gravitational constant, dark energy theories and general relativity. However, they typically use atoms in free fall, which limits the measurement time to only a few seconds, and to even briefer intervals when measuring the interaction of the atoms with a stationary source mass. Recently, interferometers with atoms suspended for as long as 70 seconds in an optical lattice have been demonstrated. To keep the atoms from falling, however, the optical lattice must apply forces that are billion-fold as strong as the putative signals, so even tiny imperfections reduce sensitivity and generate complex systematic effects. As a result, lattice interferometers have yet to demonstrate precision and accuracy on par with their free fall counterparts and have yet to be used for precision measurement. Here, we optimize the sensitivity of a lattice interferometer and use a system of signal inversions and switches to suppress and quantify systematic effects. This enables us to measure the attraction of a miniature source mass, ruling out the existence of screened dark energy theories over their natural parameter space. More importantly, the combined accuracy of $6.2~\\rm{nm/s}^2$ is four times as good as the best similar measurements with freely falling atoms, demonstrating the advantages of lattice interferometry in fundamental physics measurements. Further upgrades may enable measuring forces at sub-millimeter ranges, the gravitational Aharonov-Bohm effect and the gravitational constant, compact gravimetry, and testing whether the gravitational field itself has quantum properties.\n\n", "2310.01023": "2023-10-02, **Secluded Scalar Dark Matter and the Muon Anomalous Magnetic Moment**, Karim Ghorbani et.al., [2310.01023v1](http://arxiv.org/abs/2310.01023v1)\n\n We consider a dark matter model with a singlet scalar, $\\chi$, as our dark matter (DM) candidate which is secluded from the Standard Model (SM) and annihilates to the singlet scalar, $\\phi$, via a contact interaction. The singlet scalar, $\\phi$, has a leptophilic interaction with the SM leptons and may decay leptonically at tree level, and decays into a pair of photons at loop level. The focus in this work is to consider DM masses below 10 GeV. It is found a viable secluded region in the parameter space after imposing the observed relic density. There is a one-loop interaction between scalar dark matter and the atomic electron in this model. We then apply the available direct detection bounds from Xenon10, Xenon1T, and DarkSide on the DM-electron elastic scattering cross section. While the model can explain the muon anomalous magnetic moment, we put bounds from current and future lepton collider experiments.\n\n", "2310.00904": "2023-10-02, **Exclusion of ALP Cogenesis Dark Matter in a Mass Window Above 100 $μ$eV**, Aaron Quiskamp et.al., [2310.00904v1](http://arxiv.org/abs/2310.00904v1)\n\n We report the results of Phase 1b of The ORGAN Experiment, a microwave cavity haloscope searching for dark matter axions in the $107.42-111.93~\\mu$eV mass range. The search excludes axions with two-photon coupling $g\\_{a\\gamma\\gamma}\\geq 4\\times 10^{-12}\\, \\textrm{GeV}^{-1}$ with $95\\%$ confidence interval, setting the best upper bound to date and with the required sensitivity to exclude the axion-like particle cogenesis model for dark matter in this range. This result was achieved using a tunable rectangular cavity, which mitigated several practical issues that become apparent when conducting high mass axion searches, and was the first such axion search to be conducted with such a cavity. It also represents the most sensitive axion haloscope experiment to date in the $\\sim100~\\mu$eV mass region.\n\n", "2310.00857": "2023-10-02, **Massive Scalar Field Perturbations of Black Holes Surrounded by Dark Matter**, Ramón Bécar et.al., [2310.00857v1](http://arxiv.org/abs/2310.00857v1)\n\n We consider scalar field perturbations in the background of black holes immersed in perfect fluid dark matter (PFDM). We find, by using the sixth order Wentzel-Kramers-Brillouin (WKB) approximation, that the longest-lived modes are the ones with higher angular number, for a scalar field mass smaller than a critical value, known as anomalous decay rate of the quasinormal modes, while that beyond this critical value the behaviour is inverted. Moreover, we show that it is possible to recover the real part of the quasinormal frequencies (QNFs), the imaginary part of the QNFs, and the critical scalar field mass, of the Schwarzschild background for different values of the PFDM intensity parameter $k$, respectively. For values of $k$ smaller than these values, the mentioned quantities are greater than the Schwarzschild background. However, beyond of these values of $k$, these quantities are smaller than the Schwarzschild background.\n\n"}, "supernova": {"2310.02213": "2023-10-03, **Turbulent Structure In Supernova Remnants G46.8-0.3 And G39.2-0.3 From THOR Polarimetry**, Russell Shanahan et.al., [2310.02213v1](http://arxiv.org/abs/2310.02213v1)\n\n We present the continued analysis of polarization and Faraday rotation for the supernova remnants (SNRs) G46.8-0.3 and G39.2-0.3 in L-band (1-2 GHz) radio continuum in The HI/OH/Recombination line (THOR) survey. In this work, we present our investigation of Faraday depth fluctuations from angular scales comparable to the size of the SNRs down to scales less than our 16\" beam (<~0.7 pc) from Faraday dispersion (sigma\\_phi). From THOR, we find median sigma\\_phi of 15.9 +/- 3.2 rad m^-2 for G46.8-0.3 and 17.6 +/- 1.6 rad m^-2 for G39.2-0.3. When comparing to polarization at 6cm, we find evidence for sigma\\_phi >~ 30 rad m^-2 in localized regions where we detect no polarization in THOR. We combine Faraday depth dispersion with the rotation measure (RM) structure function (SF) and find evidence for a break in the SF on scales less than the THOR beam. We estimate the RM SF of the foreground interstellar medium (ISM) using the SF of extra-Galactic radio sources (EGRS) and pulsars to find that the RM fluctuations we measure originate within the SNRs for all but the largest angular scales.\n\n", "2310.02127": "2023-10-03, **Status of the Medium-Sized Telescopes for the Cherenkov Telescope Array Observatory**, Federica Bradascio et.al., [2310.02127v1](http://arxiv.org/abs/2310.02127v1)\n\n The Cherenkov Telescope Array Observatory (CTAO) is a next-generation ground-based gamma-ray observatory that will study the universe at very high energy using atmospheric Cherenkov light. CTAO will comprise over 67 telescopes of three different sizes, located in the northern and southern hemispheres. Among these, the Medium-Sized Telescope (MST) will play a crucial role in CTAO's observations, providing excellent sensitivity and angular resolution for gamma rays in the energy range of 100 GeV to 5 TeV. The MST is based on a modified single-mirror Davies-Cotton design, featuring a segmented mirror with a diameter of 12 meters, a total reflective surface of 88 square meters, and a focal length of 16 meters. It will cover an approximately 8-degree field of view and be equipped with two different cameras: NectarCAM and FlashCam, at the northern and southern CTAO sites, respectively. The MST's design is optimized for efficient observation of extended sources, including supernova remnants and pulsar wind nebulae, as well as the study of gamma-ray bursts and active galactic nuclei. Currently, the MST is in the midst of production and testing stages with the aim of being installed in 2025 for the CTAO Pathfinder project. In this project, one MST telescope will be deployed at each CTAO site to provide on-site experience with pre-production components. This approach facilitates cost and risk reduction before starting serial production. This contribution provides an overview of the current status and plans of the MST's construction at both the northern and southern CTAO sites, as well as details on the telescope and camera designs and their expected performance.\n\n", "2310.01797": "2023-10-03, **On the influence of shock-cloud interactions on the nonthermal X-ray emission from the supernova remnant RCW 86**, Aya Bamba et.al., [2310.01797v1](http://arxiv.org/abs/2310.01797v1)\n\n It is an open issue how the surrounding environment of supernova remnant shocks affect nonthermal X-rays from accelerated electrons, with or without interacting dense material. We have conducted spatially resolved X-ray spectroscopy of the shock-cloud interacting region of RCW 86 with XMM-Newton. It is found that bright soft X-ray filaments surround the dense cloud observed with 12CO and HI emission lines. These filaments are brighter in thermal X-ray emission, and fainter and possibly softer in synchrotron X-rays, compared to those without interaction. Our results show that the shock decelerates due to the interaction with clouds, which results in an enhancements of thermal X-ray emission. This could possibly also explain the softer X-ray synchrotron component, because it implies that those shocks that move through a low density environment, and therefore decelerate much less, can be more efficient accelerators. This is similar to SN 1006 and Tycho, and is in contrast to RX J1713.7-3946. This difference among remnants may be due to the clumpiness of dense material interacting with the shock, which should be examined with future observations.\n\n", "2310.01531": "2023-10-02, **A comprehensive hydrodynamical study of SB DEM L50: understanding off-centre SNe and soft X-ray luminosity**, Rogelio Orozco-Duarte et.al., [2310.01531v1](http://arxiv.org/abs/2310.01531v1)\n\n The superbubbles (SBs) carved in the interstellar medium by stellar winds and supernovae (SNe) are filled with hot ($T>$10$^{6}$~K) gas that produces soft X-ray emission (0.3-2.0\\,keV). Models that assume a constant density medium and central SNe events fail to reproduce the soft X-ray luminosity that is observed in some SBs. We address this problem by generating models that trace the history of SNe in the SB and that produce off-centre SNe, that account for the missing soft X-ray emission. We test the models against archival, radio, optical, and X-ray observations of the SB DEM\\,L50 located in the Large Magellanic Cloud. The soft X-ray properties of DEM L50, including its high luminosity, makes it a perfect candidate to test our models. Furthermore, the multiple wave-band observations of this object will help us to assess how well our models can reproduce other SB properties beside its soft X-ray properties. We find that a configuration where DEM L50 forms at the edge of a filament reproduces the observed soft X-ray luminosity, optical morphology, shell velocity, and swept-up mass of neutral gas. This configuration is supported by IR observations of the LMC. In addition, we find that off-centre SNe, which enhance soft X-ray emission, naturally occur for all of the initial ambient conditions we tested in our models. Finally, we show that an off-centre SN can explain the observed soft X-ray luminosity of DEM L50, and that the resulting luminosity is consistent with a plasma in non-equilibrium ionisation.\n\n", "2310.01514": "2023-10-02, **The search for failed supernovae with the Large BinocularTelescope: The Mid-IR Counterpart to N6946-BH1**, C. S. Kochanek et.al., [2310.01514v1](http://arxiv.org/abs/2310.01514v1)\n\n We present JWST MIRI 5.6, 10 and 21 micron observations of the candidate failed supernova N6946-BH1 along with HST WFPC/IR 1.1 and 1.6 micron data and ongoing optical monitoring data with the LBT. There is a very red, dusty source at the location of the candidate which has only ~10-15% of the luminosity of the progenitor star. The source is very faint in the HST near-IR observations (~10^3 Lsun) and is not optically variable to a limit of ~10^3 Lsun at R-band. The dust is likely silicate and probably has to be dominated by very large grains as predicted for dust formed in a failed SN. The required visual optical depths are modest, so we should begin to have a direct view of the source in the near-IR in only a few years.\n\n", "2310.01501": "2023-10-02, **SpectAcLE: An Improved Method for Modeling Light Echo Spectra**, Roee Partoush et.al., [2310.01501v1](http://arxiv.org/abs/2310.01501v1)\n\n Light echoes give us a unique perspective on the nature of supernovae and non-terminal stellar explosions. Spectroscopy of light echoes can reveal details on the kinematics of the ejecta, probe asymmetry, and reveal details on its interaction with circumstellar matter, thus expanding our understanding of these transient events. However, the spectral features arise from a complex interplay between the source photons, the reflecting dust geometry, and the instrumental setup and observing conditions. In this work we present an improved method for modeling these effects in light echo spectra, one that relaxes the simplifying assumption of a light curve weighted sum, and instead estimates the true relative contribution of each phase. We discuss our logic, the gains we obtain over light echo analysis method(s) used in the past, and prospects for further improvements. Lastly, we show how the new method improves our analysis of echoes from Tycho's supernova (SN 1572) as an example.\n\n", "2310.01498": "2023-10-02, **Considering the Single and Binary Origins of the Type IIP SN 2017eaw**, K. Azalee Bostroem et.al., [2310.01498v1](http://arxiv.org/abs/2310.01498v1)\n\n Current population synthesis modeling suggests that 30-50% of Type II supernovae originate from binary progenitors, however, the identification of a binary progenitor is challenging. One indicator of a binary progenitor is that the surrounding stellar population is too old to contain a massive single star.Measurements of the progenitor mass of SN 2017eaw are starkly divided between observations made temporally close to core-collapse which show a progenitor mass of 13-15 solar masses (final helium core mass of 4.4 to 6.0 solar masses - which is a more informative property than initial mass) and those from the stellar population surrounding the SN which find M<10.8 solar masses (helium core mass <3.4 solar masses). In this paper, we reanalyze the surrounding stellar population with improved astrometry and photometry, finding a median age of 16.8 (+3.2, -1.0) Myr for all stars younger than 50 Myr (helium core mass of 4.7 solar masses) and 85.9 (+3.2, -6.5) Myr for stars younger than 150 Myr. 16.8 Myr is now consistent with the helium core mass range derived from the temporally near explosion observations for single stars. Applying the combined constraints to population synthesis models, we determine that the probability of the progenitor of SN 2017eaw being an initially single-star is 65% compared to 35% for prior binary interaction. 85.9 Myr is inconsistent with any formation scenarios. We demonstrate that combining progenitor age constraints with helium core mass estimates from red supergiant SED modeling, late-time spectra, and indirectly from light curve modeling can help to differentiate single and binary progenitor scenarios and provide a framework for the application of this technique to future observations.\n\n", "2310.01482": "2023-10-02, **HI discs of L$_{\\ast}$ galaxies as probes of the baryonic physics of galaxy evolution**, Jindra Gensior et.al., [2310.01482v1](http://arxiv.org/abs/2310.01482v1)\n\n Understanding what shapes the cold gas component of galaxies, which both provides the fuel for star formation and is strongly affected by the subsequent stellar feedback, is a crucial step towards a better understanding of galaxy evolution. Here, we analyse the HI properties of a sample of 46 Milky Way halo-mass galaxies, drawn from cosmological simulations (EMP-Pathfinder and FIREbox). This set of simulations comprises galaxies evolved self-consistently across cosmic time with different baryonic sub-grid physics: three different star formation models [constant star formation efficiency (SFE) with different star formation eligibility criteria, and an environmentally-dependent, turbulence-based SFE] and two different feedback prescriptions, where only one sub-sample includes early stellar feedback. We use these simulations to assess the impact of different baryonic physics on the HI content of galaxies. We find that the galaxy-wide HI properties agree with each other and with observations. However, differences appear for small-scale properties. The thin HI discs observed in the local Universe are only reproduced with a turbulence-dependent SFE and/or early stellar feedback. Furthermore, we find that the morphology of HI discs is particularly sensitive to the different physics models: galaxies simulated with a turbulence-based SFE have discs that are smoother and more rotationally symmetric, compared to those simulated with a constant SFE; galaxies simulated with early stellar feedback have more regular discs than supernova-feedback-only galaxies. We find that the rotational asymmetry of the HI discs depends most strongly on the underlying physics model, making this a promising observable for understanding the physics responsible for shaping the interstellar medium of galaxies.\n\n", "2310.01293": "2023-10-02, **Modelling the AM CVn and Double Detonation Supernova Progenitor Binary System CD-30$^{\\circ}$11223**, Kunal Deshmukh et.al., [2310.01293v1](http://arxiv.org/abs/2310.01293v1)\n\n We present a detailed modelling study of CD-30$^{\\circ}$11223 (CD-30), a hot subdwarf (sdB)-white dwarf (WD) binary identified as a double detonation supernova progenitor, using the open-source stellar evolution software MESA. We focus on implementing binary evolution models carefully tuned to match the observed characteristics of the system including $\\log g$ and $T\\_{\\rm eff}$. For the first time, we account for the structure of the hydrogen envelope throughout the modelling, and find that the inclusion of element diffusion is important for matching the observed radius and temperature. We investigate the two sdB mass solutions (0.47 and 0.54 $M\\_{\\odot}$) previously proposed for this system, strongly favouring the 0.47 $M\\_{\\odot}$ solution. The WD cooling age is compared against the sdB age using our models, which suggest an sdB likely older than the WD, contrary to the standard assumption for compact sdB-WD binaries. Subsequently, we propose a possible alternate formation channel for CD-30. We also perform binary evolution modelling of the system to study various aspects such as mass transfer, orbital period evolution and luminosity evolution. Our models confirm CD-30 as a double detonation supernova progenitor, expected to explode $\\approx55$ Myr from now. The WD accretes a $\\approx0.17$ $M\\_{\\odot}$ thick helium shell that causes a detonation, leaving a 0.30 $M\\_{\\odot}$ sdB ejected at $\\approx$750 km/s. The final 15 Myr of the system are characterised by helium accretion which dominates the system luminosity, possibly resembling an AM CVn-type system.\n\n", "2310.01226": "2023-10-02, **Modeling the Galactic center gamma-ray emission with more realistic cosmic-ray dynamics**, Andrés Scherer et.al., [2310.01226v1](http://arxiv.org/abs/2310.01226v1)\n\n Very-high-energy gamma-ray observations of the Galactic center (GC) show extended emission that is strongly correlated with the morphology of the central molecular zone (CMZ). The best explanation for that emission is a hadronic interaction between cosmic rays (CRs) and ambient gas, where a CR central and continuous source accelerates protons up to 1 PeV (\"PeVatron\"). However, current models assume very simplistic CR dynamics. Our goal is to verify if more realistic CR dynamics for the GC environment are consistent with current gamma-ray observations, and whether they could be constrained by upcoming observations with the Cherenkov Telescope Array (CTA). We generated synthetic gamma-ray maps using a CR transport model with spherical injection, different diffusion regimes (in and out of the CMZ), polar advection, and mono-energetic particles of 1 PeV, and including different CR populations injected from the Arches, Quintuplet, and nuclear clusters of young massive stars, plus supernova Sgr A East. We adopted two different 3D gas distributions consistent with the observed gas column density, either with or without an inner cavity. In order to reproduce the existing observations detected by the High Energy Stereoscopic System (HESS), a ring-like gas distribution, with its mass set by the standard Galactic CO-to-H$\\_2$ conversion factor, and CR acceleration from all relevant sources are required. For a conversion factor one order of magnitude lower, injection rates that are ten times higher are needed. We show that CTA will be able to differentiate between models with different CR dynamics, proton sources, and CMZ morphology, owing to its unprecedented sensitivity and angular resolution. More realistic CR dynamics suggest that the CMZ has a large inner cavity and that the GC PeVatron is a composite CR population accelerated by the Arches, Quintuplet, and nuclear star clusters, and Sgr A East.\n\n"}}