{"neutrino": {"2401.08346": "2024-01-16, **Graviton-Photon Oscillations in an Expanding Universe**, Peter Anninos et.al., [2401.08346v1](http://arxiv.org/abs/2401.08346v1)\n\n Through the Gertsenshtein effect, the presence of a large external B-field may allow photons and gravitons to mix in a way that resembles neutrino oscillations and is even more similar to axion-photon mixing. Assuming a background B-field (or any field that behaves like one), we examine the Gertsenshtein mechanism in the context of FLRW expanding universe models, as well as de Sitter space. The conformal invariance of Maxwell's equations and the conformal noninvariance of the Einstein equations preclude the operation of the Gertsenshtein effect at all scales. In general we find for the matter- and radiation-dominated cases, graviton-oscillations are possible only at late conformal times or when the wavelengths are much shorter than the horizon ($\\k\\eta \\gg 1$), but that the time-dependent oscillations eventually damp out in any case. For the de Sitter universe, we find that oscillations are possible only at early conformal times ($\\eta \\ll H^{-1}$) and for wavelengths short compared to the Hubble radius, but eventually freeze in when wavelengths become longer than the Hubble radius. In principle a Gertsenshtein-like mechanism might influence the balance of particle species in an inflationary phase before freezing in; however, we find that in all our models the mixing length is larger than the Hubble radius. We discuss several possible remedies to this situation.\n\n"}, "dark matter": {"2401.08288": "2024-01-16, **On the origins of CMB anomalies and testing a new theory of inflationary quantum fluctuations**, Enrique Gaztañaga et.al., [2401.08288v1](http://arxiv.org/abs/2401.08288v1)\n\n In this paper, we present compelling evidence suggesting a statistical violation of parity symmetry (a discrete symmetry that is separate from isotropy) in the Cosmic Microwave Background (CMB) map, measured through two-point temperature correlations. This parity asymmetric CMB challenges our understanding of the quantum physics of the early Universe rather than LCDM ($\\Lambda$ Cold-Dark-Matter). We commence by conducting a comprehensive analysis of the Planck CMB, focusing on the distribution of power in low-multipoles and temperature anticorrelations at parity conjugate points in position space. We find tension with the near scale-invariant power-law power spectrum of Standard Inflation (SI), with p-values of the order $\\mathcal{O}\\left( 10^{-4}-10^{-3} \\right)$. Subsequently, we explore the recently proposed direct-sum inflation (DSI), where a quantum fluctuation arises as a direct-sum of two components evolving forward and backward in time at parity conjugate points in physical space. We found that DSI is consistent with data on parity asymmetry, the absence of power at $\\theta>60^{\\circ}$, and power suppression at low-even-multipoles which are major data anomalies in the SI. Furthermore, we discover that the parameters characterizing the hemispherical power asymmetry anomaly become statistically insignificant when the large SI quadrupole amplitude is reduced to align with the data. DSI explains this low quadrupole with a p-value of $3.5\\%$, 39 times higher than SI. Combining statistics from parameters measuring parity and low-$\\ell$ angular power spectrum, we find that DSI is 50-650 times more probable than SI. In summary, our investigation suggests that CMB temperature fluctuations exhibit homogeneity and isotropy but parity-violating consistent with predictions of DSI. This observation provides tantalizing evidence for the quantum mechanical nature of gravity.\n\n", "2401.08283": "2024-01-16, **Characterising the intra-cluster light in The Three Hundred simulations**, Ana Contreras-Santos et.al., [2401.08283v1](http://arxiv.org/abs/2401.08283v1)\n\n We characterise the intra-cluster light (ICL) in ensembles of full-physics cluster simulations from The Three Hundred project, a suite of 324 hydrodynamical resimulations of cluster-sized halos. We identify the ICL as those stellar particles bound to the potential of the cluster itself, but not to any of its substructures, and separate the brightest cluster galaxy (BCG) by means of a fixed 50 kpc aperture. We find the total BCG+ICL mass to be in agreement with state-of-the-art observations of galaxy clusters. The ICL mass fraction of our clusters is between 30 and 50 per cent of the total stellar mass within $R\\_{500}$, while the BCG represents around 10 percent. We further find no trend of the ICL fraction with cluster halo mass, at least not in the range $[0.2,3]\\cdot10^{15}h^{-1}M\\_\\odot$ considered here. For the dynamical state, characterised both by theoretical estimators and by the recent merging history of the cluster, there is a clear correlation, such that more relaxed clusters and those that have undergone fewer recent mergers have a higher ICL fraction. Finally, we investigate the possibility of using the ICL to explore the dark matter (DM) component of galaxy clusters. We compute the volumetric density profile for the DM and ICL components and show that, up to $R\\_{500}$, the ratio between the two can be described by a power law. Working with the velocity dispersion profiles instead, we show that the ratio can be fit by a straight line. Providing the parameters of these fits, we show how the ICL can be used to infer DM properties.\n\n", "2401.08143": "2024-01-16, **New insights on the dynamics of satellite galaxies: effects of the figure rotation of a host galaxy**, Genta Sato et.al., [2401.08143v1](http://arxiv.org/abs/2401.08143v1)\n\n We investigate a mechanism to form and keep a planar spatial distribution of satellite galaxies in the Milky Way (MW), which is called the satellite plane. It has been pointed out that the {\\Lambda}CDM cosmological model hardly explains the existence of such a satellite plane, so it is regarded as one of the serious problems in the current cosmology. We here focus on a rotation of the gravitational potential of a host galaxy, i.e., so-called a figure rotation, following the previous suggestion that this effect can induce the tilt of a so-called tube orbit. Our calculation shows that a figure rotation of a triaxial potential forms a stable orbital plane perpendicular to the rotational axis of the potential. Thus, it is suggested that the MW's dark halo is rotating with its axis being around the normal line of the satellite plane. Additionally, we find that a small velocity dispersion of satellites is required to keep the flatness of the planar structure, namely the standard derivation of their velocities perpendicular to the satellite plane needs smaller than their mean rotational velocity on the plane. Although not all the MW's satellites satisfy this condition, some fraction of them called member satellites, which are prominently on the plane, satisfy it. We suggest that this picture explaining the observed satellite plane can be achieved by the filamentary accretion of dark matter associated with the formation of the MW and a group infall of member satellites along this cosmic filament.\n\n", "2401.08130": "2024-01-16, **Modification of the Sommerfeld effect due to coannihilator decays**, Feng Luo et.al., [2401.08130v1](http://arxiv.org/abs/2401.08130v1)\n\n In dark matter coannihilation scenarios, Sommerfeld factors of coannihilators are usually important in calculations of dark matter thermal relic abundance. Due to interconversions between coannihilators and dark matter particles, the calculation of the Sommerfeld factor for a pair of annihilating coannihilators may be different compared to the one for a pair of stable particles. The instability of coannihilators indicates that two coannihilators can only come towards each other from a finite distance, while previous calculations of Sommerfeld factors essentially assume an infinite initial separation. By studying a scattering problem within the non-relativistic quantum mechanics framework, we derive Sommerfeld factors for a generic finite-range central-force potential. As a proof of concept, we focus our discussions on the $s$-wave Sommerfeld factor for a Coulomb potential. We find that the Sommerfeld factor for a pair of unstable particles is less prominent than the one for stable particles. By applying the result to a simple coannihilation scenario, we conclude that the modification of annihilating coannihilators' Sommerfeld factors induced by coannihilator decays can lead to $\\mathcal{O}(1\\%) - \\mathcal{O}(10\\%)$ changes of the DM thermal relic abundance.\n\n"}, "supernova": {"2401.08289": "2024-01-16, **The hidden companion in J1527: a 0.69 solar-mass white dwarf?**, Zhi-Xiang Zhang et.al., [2401.08289v1](http://arxiv.org/abs/2401.08289v1)\n\n Finding nearby neutron stars can probe the supernova and metal-enrichment histories near our Solar system. Recently, Lin et al. 2023 reported an exciting neutron star candidate, 2MASS J15274848+3536572 (hereafter J1527), with a small Gaia distance of 118 parsecs. They claim that J1527 harbors an unseen neutron star candidate with an unusually low mass of $0.98\\pm0.03\\,M\\_{\\odot}$. In this work, we use the Canada-France-Hawaii Telescope high-resolution spectrum to measure J1527's orbital inclination independently. Our spectral fitting suggests an orbital inclination of $63\\pm2$ degrees. Instead, by fitting a complex hybrid variability model consisting of the ellipsoidal-variation component and the star-spot modulation to the observed light curve, Lin et al. 2023 obtains an orbital inclination of $45.2\\_{-0.20}^{+0.13}$ degrees. We speculate that the orbital inclination obtained by the light-curve fitting is underestimated, since J1527's light curves are obviously not pure ellipsoidal variations. According to our new inclination ($i\\sim 63$ degrees), the mass of the unseen compact object is reduced to $0.69\\pm0.02\\,M\\_\\odot$, which is as massive as a typical white dwarf.\n\n", "2401.08234": "2024-01-16, **Detection of the neutral iron line from the supernova remnant W49B with Suzaku**, Nari Suzuki et.al., [2401.08234v1](http://arxiv.org/abs/2401.08234v1)\n\n Recent studies of supernova remnants (SNRs) have revealed that some SNRs exhibit a neutral iron line emission at 6.4 keV. This line has been proposed to originate from the interaction of high-energy particles formed in the SNR shell with the surrounding cold matter. We searched for the neutral iron line emission in the SNR W49B. Significant detection of the 6.4 keV line is found in the northwest region, close to the molecular cloud interacting with the SNR shell. In addition, an excess emission at 8-9 keV, in which K\\_gamma, K\\_delta, and K\\_epsilon lines of He-like iron exist, is also significantly found in the region where the radio shell is not bright. We discuss the origin of the 6.4 keV line and the excess emission at 8-9 keV.\n\n", "2401.08168": "2024-01-16, **Observational evidence for local vertical constraining of \\HI by molecular cloud complexes**, Meera Nandakumar et.al., [2401.08168v1](http://arxiv.org/abs/2401.08168v1)\n\n A massive molecular cloud complex represents local gravitational potential that can constrain the vertical distribution of surrounding stars and gas. This pinching effect results in the local corrugation of the scale height of stars and gas which is in addition to the global corrugation of the mid-plane of the disc. For the first time, we report observational evidence for this pinching on the \\HI vertical structures in the Galactic region ($20^{\\circ}< l<40^{\\circ}$), also called W41--W44 region. The \\HI vertical distribution is modelled by a double Gaussian profile that physically represents a narrow dense gas distribution confined to the mid-plane embedded in a wider diffuse \\HI. We find that the estimate of the \\HI scale height distribution of wider components, shows corrugated structures at the locations of molecular complexes, as theoretically predicted in literature. While the narrow component is less affected by the pinching, we found a hint of the disc being disrupted by the active dynamics in the local environment of the complex, e.g., supernova explosions. Molecular complexes of mass of several $10^6$ solar mass, associated with the mini-starburst region W43 and the supernova remnant W41 show the strongest evidence for the pinching; here a broad trough, with an average width of $\\sim400$ pc and height $\\sim300$ pc, in the disc thickness of the wider component is prominently visible. Searching for similar effect on the stars as well as in the location of other complexes in the Milky Way and other galaxies will be useful to establish this phenomenon more firmly.\n\n"}}