{"neutrino": {"2503.16355": "2025-03-20, **DEMNUni: the Sunyaev-Zel'dovich effect in the presence of massive neutrinos and dynamical dark energy**, Davide Luchina et.al., [2503.16355v1](http://arxiv.org/abs/2503.16355v1)\n\n In recent years, the study of secondary anisotropies in the Cosmic Microwave Background has become a fundamental instrument to test our understanding of Cosmology and Astrophysics. Using a set of lightcones produced with the ``Dark Energy and Massive Neutrino Universe'' $N$-body simulations we study how different dark energy models and neutrino masses impact the properties of the Sunyaev-Zel'dovich (SZ) effects, focusing on the signal arising from galaxy clusters and groups. We analyse the distribution of values, Compton-$y$ parameter for the thermal SZ effect and $\\Delta T/T$ for the kinematic SZ effect, and study their angular power spectra. We find that the distribution of logarithmic Compton parameter can be fitted with a skewed Gaussian, with a mean that, at fixed dark energy model, decreases linearly with an approximate slope of $10 f\\_\\nu$. Regarding the power spectrum of the thermal SZ effect, we find that an increase in $\\sum {m\\_\\nu}$ is observed as a power-law scaling with respect to $\\sigma\\_8^{\\mathrm{cb}}$, with exponents ranging from 7.2 to 8.2. We also find that four cosmological models, one with $\\sum {m\\_\\nu} = 0.16$ eV and three with $\\sum {m\\_\\nu} = 0.32$ eV, fit equally well the Planck data for the Compton-$y$. For all the \\texttt{DEMNUni} models we forecast the cumulative signal-to-noise for thermal SZ observations with the LAT instrument of Simons Observatory; furthermore, we compute a tailored $\\chi\\_\\mathrm{SNR}^2$ estimator to infer if they can be distinguished from the reference $\\Lambda$CDM. We also provide estimates for the power spectrum of the cluster component of the kinematic SZ effect, in all the different cosmological scenarios.\n\n", "2503.16293": "2025-03-20, **Lepton number violating/conserving heavy baryons four-body decays, in presence of two almost degenerated heavy neutrinos**, Fabiola Fortuna et.al., [2503.16293v1](http://arxiv.org/abs/2503.16293v1)\n\n We study the four-body heavy baryon decay, including two leptons in the final state, of the form $B\\_A \\to B\\_B P \\ell\\_\\alpha \\ell\\_\\beta$, which can be either a lepton number conserving (LNC) or a lepton number violating (LNV) process (where $B$, $P$ and $\\ell$ are baryons, pseudoscalar mesons and leptons, respectively), including all kinematic allowed lepton pair possibilities. We work beyond the simplified assumption of a single heavy Majorana neutrino mixing with the active sector, considering potential interference effects when including two nearly degenerate heavy Majorana neutrinos. Particularly, we provide a first estimate of the decay channels involving different flavors for the external leptons (e.g., muon-tau), and elaborate on the interference pattern due to leptons exchange. We show that the results for the two heavy almost degenerate neutrinos can be recast into a single Majorana neutrino, and exhibit the features for both the LNC and LNV scenarios. We determine the potential exclusion region for the mass and heavy-light mixing parameters, of the neutrinos driving the decay, including finite size detector effects. We also obtain the Branching ratio as a function of the heavy neutrino mass for the current upper limit of the heavy-light mixings.\n\n", "2503.16273": "2025-03-20, **Neutrino emission and corona heating induced by high-energy proton interactions in Seyfert galaxies**, A. Neronov et.al., [2503.16273v1](http://arxiv.org/abs/2503.16273v1)\n\n Recent detection of very-high-energy neutrino emission from Seyfert type active galactic nuclei (AGN) provides a new insight into the physics of the AGN central engines. We notice that if high-energy protons responsible for neutrino emission are accelerated close to the surface of the accretion disk, the neutrino flux may have no unambiguously identifiable electromagnetic counterpart. This is because the electromagnetic power released in interactions of high-energy protons would only contribute to the heating of the disk surface and corona above the disk, rather than escape from the source. Given that the heat deposited in the corona is released in the hard X-ray range we notice that there still might be an \"indirect\" electromagnetic counterpart of the neutrino signal: the hard X-ray flux variability may be strongly or weakly correlated with the neutrino flux variations, depending on the importance of the high-energy proton heating in the disk/corona heat balance. If heating by high-energy protons provides a sizable contribution to the overall corona heating rate, the overall flux of diffuse GeV neutrino background from Seyfert galaxies may be comparable to the X-ray background flux and the high-energy tail of this background can provide a sizable contribution to the astrophysical neutrino flux in the TeV band.\n\n", "2503.16213": "2025-03-20, **Search for heavy neutral leptons in decays of W bosons using leptonic and semi-leptonic displaced vertices in $\\sqrt{s} = 13$ TeV $pp$ collisions with the ATLAS detector**, ATLAS Collaboration et.al., [2503.16213v1](http://arxiv.org/abs/2503.16213v1)\n\n A search is performed for long-lived heavy neutral leptons (HNLs), produced through the decay of a $W$ boson along with a muon or electron. Two channels are explored: a leptonic channel, in which the HNL decays into two leptons and a neutrino, and a semi-leptonic channel, in which the HNL decays into a lepton and a charged pion. The search is performed with 140~fb$^{-1}$ of $\\sqrt{s} = 13$ TeV proton--proton collision data collected by ATLAS during Run 2 of the Large Hadron Collider. No excess of events is observed; Dirac-like and Majorana-like HNLs with masses below 14.5 GeV and mixing coefficients as small as 10$^{-7}$ are excluded at the 95% confidence level. The results are interpreted under different assumptions on the flavour of the leptons from the HNL decays.\n\n", "2503.16160": "2025-03-20, **Extending evolution mapping to massive neutrinos with COMET**, A. Pezzotta et.al., [2503.16160v1](http://arxiv.org/abs/2503.16160v1)\n\n We introduce an extension of the evolution mapping framework to cosmological models that include massive neutrinos. The original evolution mapping framework exploits a degeneracy in the linear matter power spectrum when expressed in ${\\rm Mpc}$ units, which compresses its dependence on cosmological parameters into those that affect its shape and a single extra parameter $\\sigma\\_{12}$, defined as the RMS linear variance in spheres of radius $12 {\\rm Mpc}$. We show that by promoting the scalar amplitude of fluctuations, $A\\_{\\rm s}$, to a shape parameter, we can additionally describe the suppression due to massive neutrinos at any redshift to sub-0.01\\% accuracy across a wide range of masses and for different numbers of mass eigenstates. This methodology has been integrated into the public COMET package, enhancing its ability to emulate predictions of state-of-the-art perturbative models for galaxy clustering, such as the effective field theory (EFT) model. Additionally, the updated software now accommodates a broader cosmological parameter space for the emulator, enables the simultaneous generation of multiple predictions to reduce computation time, and incorporates analytic marginalisation over nuisance parameters to expedite posterior estimation. Finally, we explore the impact of different infrared resummation techniques on galaxy power spectrum multipoles, demonstrating that any discrepancies can be mitigated by EFT counterterms without impacting the cosmological parameters.\n\n", "2503.16124": "2025-03-20, **Effects of tau-neutrino detection on non-standard interactions at DUNE with a short discussion on the nature of neutrino mixing**, Xin Yue Yu et.al., [2503.16124v1](http://arxiv.org/abs/2503.16124v1)\n\n In this paper, we investigate the effects of $\\nu\\_\\tau$ and $\\bar{\\nu}\\_\\tau$ detection at the DUNE far detector on the experiment's sensitivity to Non-Standard Interactions (NSI) in neutrino propagation. We show that the strongest observable NSI effect in the $\\nu\\_\\tau$ and $\\bar{\\nu}\\_\\tau$ appearance probabilities arises from $\\epsilon\\_{\\mu\\tau}$. We have studied the hierarchy sensitivity, CP violation sensitivity and octant sensitivity of DUNE from $\\nu\\_\\tau$ and $\\bar{\\nu}\\_\\tau$ appearance channels in presence of NSI. We have also studied the detection sensitivity of NSI phases and the future constaints on NSI parameters from the tau neutrino appearance channels in DUNE. Additionally, we examine the role of $\\nu\\_\\tau$ detection in constraining the unitary nature of the PMNS matrix. These studies emphasize the importance of incorporating $\\nu\\_\\tau$ detection in long-baseline neutrino experiments such as DUNE.\n\n"}, "dark matter": {"2503.16415": "2025-03-20, **Apparent $w<-1$ and a Lower $S_8$ from Dark Axion and Dark Baryons Interactions**, Justin Khoury et.al., [2503.16415v1](http://arxiv.org/abs/2503.16415v1)\n\n We show that a simple coupling between dark energy and dark matter can simultaneously address two distinct hints at new physics coming from cosmological observations. The first is the recent evidence from the DESI project and supernovae observations that the dark energy equation of state~$w$ is evolving over cosmic time from an earlier value that is~$<-1$ to a present-day value~$>-1$. The second observation is the so-called~$S\\_8$ tension, describing the suppression of the growth of matter overdensities compared to that expected in the~$\\Lambda$CDM model. We propose a stable, technically natural particle physics implementation of this idea, in which dark matter consists of dark baryons in a strongly-coupled hidden sector, and the dark energy field is the associated dark axion. The time-variation of the dark matter mass results in an effective dark energy equation of state that exhibits a phantom crossing behavior consistent with recent results. It also results in a slight delay in matter-radiation equality, which suppresses the overall growth of density perturbations.\n\n", "2503.16379": "2025-03-20, **The impact of baryons on the sparsity of simulated galaxy clusters from The Three Hundred Project**, P. S. Corasaniti et.al., [2503.16379v1](http://arxiv.org/abs/2503.16379v1)\n\n Measurements of the sparsity of galaxy clusters can be used to probe the cosmological information encoded in the host dark matter halo profile, and infer constraints on the cosmological model parameters. Key to the success of these analyses is the control of potential sources of systematic uncertainty. As an example, the presence of baryons can alter the cluster sparsity with respect to predictions from N-body simulations. Similarly, a radial dependent mass bias, as in the case of masses inferred under the hydrostatic equilibrium (HE) hypothesis, can affect sparsity estimates. We examine the imprint of baryonic processes on the sparsity statistics. Then, we investigate the relation between cluster sparsities and gas mass fraction. Finally, we perform a study of the impact of HE mass bias on sparsity measurements and the implication on cosmological parameter inference analyses. We use catalogues of simulated galaxy clusters from The Three Hundred project and run a comparative analysis of the sparsity of clusters from N-body/hydro simulations implementing different feedback model scenarios. Sparsities which probe the mass profile across a large radial range are affected by the presence of baryons in a way that is particularly sensitive to astrophysical feedback, whereas those probing exclusively external cluster regions are less affected. In the former case, we find the sparsities to be moderately correlated with measurements of the gas fraction in the inner cluster regions. We infer constraints on $S\\_8$ using synthetic average sparsity measurements generated to evaluate the impact of baryons, selection effects and HE bias. In the case of multiple sparsities these lead to highly bias results. Hence, we calibrate linear bias models that enable us to correct for these effects and recover unbiased constraints that are significantly tighter than those inferred from single sparsity analyses.\n\n", "2503.16173": "2025-03-20, **Precision cross-sections for advancing cosmic-ray physics and other applications: a comprehensive programme for the next decade**, D. Maurin et.al., [2503.16173v1](http://arxiv.org/abs/2503.16173v1)\n\n Cosmic-ray physics in the GeV-to-TeV energy range has entered a precision era thanks to recent data from space-based experiments. However, the poor knowledge of nuclear reactions, in particular for the production of antimatter and secondary nuclei, limits the information that can be extracted from these data, such as source properties, transport in the Galaxy and indirect searches for particle dark matter. The Cross-Section for Cosmic Rays at CERN workshop series has addressed the challenges encountered in the interpretation of high-precision cosmic-ray data, with the goal of strengthening emergent synergies and taking advantage of the complementarity and know-how in different communities, from theoretical and experimental astroparticle physics to high-energy and nuclear physics. In this paper, we present the outcomes of the third edition of the workshop that took place in 2024. We present the current state of cosmic-ray experiments and their perspectives, and provide a detailed road map to close the most urgent gaps in cross-section data, in order to efficiently progress on many open physics cases, which are motivated in the paper. Finally, with the aim of being as exhaustive as possible, this report touches several other fields -- such as cosmogenic studies, space radiation protection and hadrontherapy -- where overlapping and specific new cross-section measurements, as well as nuclear code improvement and benchmarking efforts, are also needed. We also briefly highlight further synergies between astroparticle and high-energy physics on the question of cross-sections.\n\n", "2503.16111": "2025-03-20, **Gravitational lensing due to charged galactic wormhole**, Md Khalid Hossain et.al., [2503.16111v1](http://arxiv.org/abs/2503.16111v1)\n\n We propose the back reaction to the charged galactic wormhole spacetime based on Yoshiaki Sofue's exponential dark matter density profile to find exact solutions. The charges act as an additional component to the static wormhole, which is primarily formed by the galactic dark matter density. Unlike traditional mass-based models, this solution incorporates charge effects within a realistic dark matter distribution, revealing unique interactions between dark matter, electromagnetic fields, and spacetime curvature. This study confirms the criteria for wormhole formation, designating it the \"Charged Galactic Wormhole,\" and offers a new framework for investigating galactic structures, with potential observational signatures that deepen our understanding of dark matter and spacetime. Later, the proper radial distance and the embedding surface were also analyzed. Furthermore, the deflection of light around a charged galactic wormhole was investigated, along with a comprehensive review of the resulting image. The deflection of massive objects (charge less) near charged galactic wormholes is studied using the Gauss-Bonnet and Rindler-Ishak methods, with a detailed comparison of the results from both approaches. Additionally, in both the Rindler-Ishak (RI) and Gauss-Bonnet (GB) methods, when v tends to 1 i.e. when particle's velocity comparable to the speed of light , the results from these approaches converge, producing the same outcome as strong gravitational lensing.\n\n", "2503.16087": "2025-03-20, **Long-lived Quasinormal Modes and Gray-Body Factors of black holes and wormholes in dark matter inspired Weyl Gravity**, B. C. Lütfüoğlu et.al., [2503.16087v1](http://arxiv.org/abs/2503.16087v1)\n\n We calculate quasinormal modes and gray-body factors of a massive scalar field in the background of three compact objects in the Weyl gravity: Schwarzschild-like black holes, known as Mannheim-Kazanas solution, non-Schwrazschild-like black holes and traversable wormholes found recently in [P. Jizba, K. Mudru\\v{n}ka, Phys.Rev.D 110 (2024) 12, 124006]. We show that the spectrum of the massive field is qualitatively different from massless one both in the frequency and time domains. While the mass term leads to much longer lifetime of the modes, the arbitrarily long-lived modes, known as quasi-resonances, are not achieved.\n\n", "2503.15907": "2025-03-20, **Detection for Intermediate-mass Binary Black Holes in Population III Star Clusters with TianQin**, Hanzhang Wang et.al., [2503.15907v1](http://arxiv.org/abs/2503.15907v1)\n\n Context. Population III star clusters are predicted to form in unenriched dark matter halos. Direct N-body simulation of Pop III clusters implies the possible formation and merger of intermediate-mass binary black holes (IMBBHs). The gravitational wave signals could be detected by space-borne gravitational wave detectors like TianQin. Aims. This study evaluates the potential of TianQin in detecting IMBBHs from Pop III star clusters, focusing on key factors such as the detection horizon, detection number, and Fisher uncertainty. Methods. A Monte Carlo simulation is employed to derive IMBBH sources, utilizing the IMRPhenomD waveform model to simulate catalogs of observable IMBBH mergers. The mass and redshift distributions are derived from direct N-body simulations of IMBBHs in Population III star clusters. Detection numbers are determined by calculating the signal-to-noise ratios (SNR) of the simulated signals and applying thresholds for detection. Fisher uncertainty is obtained through Fisher information matrix analysis. Results. The findings suggest that TianQin could achieve detection numbers within 5 years ranging from 1 in the most pessimistic scenario to 253 in the most optimistic scenario. Furthermore, TianQin can precisely constrain the IMBBH mass with a relative uncertainty of $10^{-6}$, coalescence time $t\\_c$ within 1 second, and sky location $\\bar{\\Omega}\\_S$ within 1 $\\rm{deg}^2$. However, the luminosity distance $D\\_L$ and inclination angle $\\iota$ exhibit substantial degeneracies, limiting their precise estimation.\n\n"}, "supernova": {"2503.16415": "2025-03-20, **Apparent $w<-1$ and a Lower $S_8$ from Dark Axion and Dark Baryons Interactions**, Justin Khoury et.al., [2503.16415v1](http://arxiv.org/abs/2503.16415v1)\n\n We show that a simple coupling between dark energy and dark matter can simultaneously address two distinct hints at new physics coming from cosmological observations. The first is the recent evidence from the DESI project and supernovae observations that the dark energy equation of state~$w$ is evolving over cosmic time from an earlier value that is~$<-1$ to a present-day value~$>-1$. The second observation is the so-called~$S\\_8$ tension, describing the suppression of the growth of matter overdensities compared to that expected in the~$\\Lambda$CDM model. We propose a stable, technically natural particle physics implementation of this idea, in which dark matter consists of dark baryons in a strongly-coupled hidden sector, and the dark energy field is the associated dark axion. The time-variation of the dark matter mass results in an effective dark energy equation of state that exhibits a phantom crossing behavior consistent with recent results. It also results in a slight delay in matter-radiation equality, which suppresses the overall growth of density perturbations.\n\n", "2503.16317": "2025-03-20, **Proto-neutron star oscillations including accretion flows**, Dimitra Tseneklidou et.al., [2503.16317v1](http://arxiv.org/abs/2503.16317v1)\n\n The gravitational wave signature from core-collapse supernovae (CCSNe) is dominated by quadrupolar oscillation modes of the newly born proto-neutron star (PNS), and could be detectable at galactic distances. We have developed a framework for computing the normal oscillation modes of a PNS in general relativity, including, for the first time, the presence of an accretion flow and a surrounding stalled accretion shock. These new ingredients are key to understand PNS oscillation modes, in particular those related to the standing-accretion-shock instability (SASI). Their incorporation is an important step towards accurate PNS asteroseismology. For this purpose, we perform linear and adiabatic perturbations of a spherically symmetric background, in the relativistic Cowling approximation, and cast the resulting equations as an eigenvalue problem. We discretize the eigenvalue problem using collocation Chebyshev spectral methods, which is then solved by means of standard and efficient linear algebra methods. We impose boundary conditions at the accretion shock compatible with the Rankine-Hugoniot conditions. We present several numerical examples to assess the accuracy and convergence of the numerical code, as well as to understand the effect of an accretion flow on the oscillation modes, as a stepping stone towards a complete analysis of the CCSNe case.\n\n", "2503.16242": "2025-03-20, **Gamma-Ray Burst Jets in Circumstellar Material: Dynamics, Breakout, and Diversity of Transients**, Hamid Hamidani et.al., [2503.16242v1](http://arxiv.org/abs/2503.16242v1)\n\n Recent observations indicate that stripped-envelope core-collapse supernovae are often surrounded by dense circumstellar material (CSM). Motivated by this, we develop an analytic model to systematically study the dynamics of long gamma-ray burst (LGRB) jet propagation in various CSM environments. We derive a general formula for the jet head velocity ($\\beta\\_{\\rm h}$) and breakout time ($t\\_{\\rm b}$) valid across Newtonian, relativistic, and intermediate regimes, accounting for a previously unrecognized dependence on $1 - \\beta\\_{\\rm h}$. Our results highlight a fundamental distinction between jet propagation in massive stars, where $\\beta\\_{\\rm h}\\ll 1$, and in extended CSM, where $1-\\beta\\_{\\rm h}\\ll 1$. We establish an analytic success/failure criterion for jets and express it in terms of jet and CSM parameters, revealing a strong dependence on CSM radius. To quantify the relativistic nature of the jet-cocoon system, we introduce the energy-weighted proper velocity $\\overline{\\Gamma\\beta}$. We identify three possible jet outcomes-(a) successful jets ($\\overline{\\Gamma\\beta} \\sim 10-100$), (b) barely failed jets ($\\overline{\\Gamma\\beta} \\sim 1$), and (c) completely failed jets ($\\overline{\\Gamma\\beta} \\sim 0.1$)-and constrain their respective jet/CSM parameter spaces. We show that in (b) and (c), large CSM radii can power luminous fast blue optical transients via cocoon cooling emission. This theoretical framework provides a basis for future observational and theoretical studies to elucidate the link between LGRBs, intermediate GRBs, low-luminosity LGRBs, and their environments.\n\n", "2503.16099": "2025-03-20, **Evolution of binary stars**, Pablo Marchant et.al., [2503.16099v1](http://arxiv.org/abs/2503.16099v1)\n\n Binary stars are pairs of stars that are gravitationally bound, providing in some cases accurate measurements of their masses and radii. As such, they serve as excellent testbeds for the theory of stellar structure and evolution. Moreover, binary stars that orbit each other at a sufficiently small distance will interact during their lifetimes, leading to a multitude of different evolutionary pathways that are not present in single star evolution. Among other outcomes, this can lead to the production of stellar mergers, rejuvenated and chemically contaminated accreting stars, stars stripped of their hydrogen envelopes and gravitational wave sources. For stars massive enough to undergo a supernova, binary interaction is expected to impact the evolution of most of them, making the understanding of binary evolution a critical element to comprehend stellar populations and their impact at large scales.\n\n", "2503.15977": "2025-03-20, **Hide and seek with a Neutron Star. Hint of Neutron Star activity in SN 2015ap light curve**, Fabio Ragosta et.al., [2503.15977v1](http://arxiv.org/abs/2503.15977v1)\n\n Aims. We present a detailed study of the unique SN 2015ap, a very energetic event, notable for its exceptionally high bolometric peak magnitude if compared to other well-know Type Ib supernovae. We analyzed its multi-wavelength light curve, which exhibited a possible period modulation that could result from a geometrical effect. Methods. We analyzed the modulation present at all available bands in SN 2015ap's light curves using a Bayesian approach for measuring the period of variability. Additionally, narrow Ha emission is observed in late-time spectra, exhibiting periodic velocity shifts likely originating from hydrogen gas stripped from a companion and accreted onto the compact remnant. Results. We propose that SN 2015ap's significant light curve modulation arise from accretion onto a neutron star as the remnant of SN 2015ap. Our multi-wavelength observations reveal a sinusoidal modulation with a period of 8.4 days, confirmed by periodic variations in the Ha emission lines. Traditional models of circumstellar medium interactions cannot account for these features due to the unusually high ejection rates required. Using the Taylor-Spruit dynamo model, we suggest that the interaction between accreting matter and the neutron star's magnetosphere could account for the observed periodic modulation. This implies assuming an ejecta-companion interaction because the accretion from fallback ejecta alone would not produce the observed modulation. The binary configuration, characterized by a separation of less than 50 Ro, supports a magnetized neutron star central engine as the primary mechanism, rather than models involving circumstellar material interaction.\n\n", "2503.15943": "2025-03-20, **Null tests with Gaussian Process**, Shengqing Gao et.al., [2503.15943v1](http://arxiv.org/abs/2503.15943v1)\n\n We investigate the null tests of spatial flatness and the flat $\\Lambda$CDM model using the Baryon Acoustic Oscillation (BAO) data measured by the Dark Energy Spectroscopic Instrument, the cosmic chronometers (CCH) $H(z)$ data, and the Union3 and Pantheon Plus type Ia supernovae (SNe Ia) datasets. We propose a novel non-parametric reconstruction of $F\\_{AP}$, $D\\_M/r\\_d$ and $D'\\_M/r\\_d$ from the DESI BAO data to perform the $Ok$ diagnostic, and we also conduct the $Ok$ diagnostic using the combination of CCH and SNe Ia data. The novel method avoids the issue of the dependence on cosmological parameters such as the value of the Hubble constant. There is no evidence of deviation from the flat $\\Lambda$CDM model, nor is there any indication of dynamical dark energy found in the observational data. Since we employ a non-parametric reconstruction method, all the conclusions drawn in this paper remain robust and agnostic to any cosmological model and gravitational theory.\n\n"}}