{"neutrino": {"2405.05921": "2024-05-09, **In-medium changes of nucleon cross sections tested in neutrino-induced reactions**, B. Bogart et.al., [2405.05921v1](http://arxiv.org/abs/2405.05921v1)\n\n Historically studied in the context of heavy-ion collisions, the extent to which free nucleon-nucleon forces are modified in-medium remains undetermined by these data sets. Therefore, we investigate the impact of NN in-medium modifications on neutrino-nucleus cross section predictions using the GiBUU transport model. We find that including an in-medium lowering of the NN cross section and density dependence on $\\Delta$ excitation improves agreement with MicroBooNE neutrino-argon scattering data. This is observed for both proton and neutral pion spectra in charged-current muon neutrino and neutral-current single pion production datasets. The impact of collision broadening of the $\\Delta$ resonance is also investigated.\n\n", "2405.05877": "2024-05-09, **Performance evaluation of electron multiplier tubes as a high-intensity muon beam monitor**, Takashi Honjo et.al., [2405.05877v1](http://arxiv.org/abs/2405.05877v1)\n\n Upgrade work towards increasing the beam intensity of the neutrino production beamline at J-PARC is underway. Tertiary muon beam monitoring is essential for stable operation of the beamline. Accordingly, we are planning to replace the present muon monitor detectors with electron multiplier tubes (EMTs). We investigated the linearity and radiation tolerance of EMTs using a 90 MeV electron beam at the Research Center for Electron Photon Science. EMTs show higher radiation tolerance than the Si sensors which are presently used as one of the muon monitor detectors for the T2K long-baseline neutrino oscillation experiment at J-PARC. The signal yield decrease is found to be less than 10% after a beam irradiation equivalent to 132-days of operation at the future J-PARC beam power of 1.3 MW. The observed yield decrease is likely due to dynode deterioration, based on the results of a detailed investigation. The studies described here confirm that EMTs can be used as a high-intensity muon beam monitor.\n\n", "2405.05743": "2024-05-09, **Development, Characterization and Production of a novel Water-based Liquid Scintillator based on the Surfactant TRITON X-100**, Hans Th. J. Steiger et.al., [2405.05743v1](http://arxiv.org/abs/2405.05743v1)\n\n Water-based Liquid Scintillator (WbLS) is a novel detector medium for particle physics experiments. Applications range from the use as hybrid Cherenkov/scintillation target in low-energy and accelerator neutrino experiments to large-volume neutron vetoes for dark matter detectors. Here, we present a novel WbLS featuring new components (the surfactant Triton-X and vitamin C for long-term stability), a new production recipe, and a thorough characterization of its properties. Moreover, based on neutron scattering data we are able to demonstrate that the pulse shape discrimination capabilities of this particular LS are comparable to fully-organic LAB based scintillators.\n\n", "2405.05700": "2024-05-09, **Parallelizing Air Shower Simulation for Background Characterization in IceCube**, Kevin Meagher et.al., [2405.05700v1](http://arxiv.org/abs/2405.05700v1)\n\n The IceCube Neutrino Observatory is a cubic kilometer neutrino telescope located at the Geographic South Pole. For every observed neutrino event, there are over $10^6$ background events caused by cosmic ray air shower muons. In order to properly separate signal from background, it is necessary to produce Monte Carlo simulations of these air showers. Although to-date, IceCube has produced large quantities of background simulation, these studies still remain statistics limited. The first stage of simulation requires heavy CPU usage while the second stage requires heavy GPU usage. Processing both of these stages on the same node will result in an underutilized GPU but using different nodes will encounter bandwidth bottlenecks. Furthermore, due to the power-law energy spectrum of cosmic rays, the memory footprint of the detector response often exceeded the limit in unpredictable ways. This proceeding presents new client-server code which parallelizes the first stage onto multiple CPUs on the same node and then passes it on to the GPU for photon propagation. This results in GPU utilization of greater than 90% as well as more predictable memory usage and an overall factor of 20 improvement in speed over previous techniques.\n\n", "2405.05694": "2024-05-09, **Matter Asymmetries in the $Z_N$ Dark matter -companion Models**, Shao-Long Chen et.al., [2405.05694v1](http://arxiv.org/abs/2405.05694v1)\n\n A class of $Z\\_{N\\geq 3}$-symmetric WIMP dark matter models that are characterized by the semi-annihilation into the companion of dark matter has been proposed in ref.~\\cite{Guo:2021rre}, providing a mechanism to evade the stringent direct detection constraint. In this work, we point out that such models naturally provide the three Sakharov elements necessary for dark matter asymmetry, and moreover this asymmetry can be transferred to the visible sector with a proper link to the leptonic or quark sector. In our minimal $Z\\_3$ example, the migration to the leptonic sector is via the asymmetric companion decay into neutrinos, and the lepton asymmetry can be further transferred to the quark sector. The CP violation parameter in the model is suppressed in the limit of static annihilation of dark matter, and the lift from thermal motion has been studied for the first time. A preliminary numerical analysis based on the Boltzmann equations shows that both correct relic density of dark matter and baryon asymmetry can be accommodated.\n\n", "2405.05554": "2024-05-09, **RELICS: a REactor neutrino LIquid xenon Coherent elastic Scattering experiment**, Chang Cai et.al., [2405.05554v1](http://arxiv.org/abs/2405.05554v1)\n\n Coherent elastic neutrino-nucleus scattering (CEvNS) provides a unique probe for neutrino properties Beyond the Standard Model (BSM) physics. REactor neutrino LIquid xenon Coherent Scattering experiment (RELICS), a proposed reactor neutrino program using liquid xenon time projection chamber (LXeTPC) technology, aims to investigate the CEvNS process of antineutrinos off xenon atomic nuclei. In this work, the design of the experiment is studied and optimized based on Monte Carlo (MC) simulations. To achieve a sufficiently low energy threshold for CEvNS detection, an ionization-only analysis channel will be adopted for RELICS. A high emission rate of delayed electrons after a big ionization signal is the major background, leading to an analysis threshold of 120 photo-electrons in the CEvNS search. The second largest background, nuclear recoils induced by cosmic-ray neutrons, is suppressed via a passive water shield. The physics potential of RELICS was explored with a 32 kg-yr exposure at a baseline of 25 m from a reactor core with a 3 GW thermal power. In an energy range of 120 to 240 PEs, we the expected 13673.5 CEvNS and 2133.7 background events.The sensitivity of RELICS to the weak mixing angle was investigated at a low momentum transfer. Our study has shown that RELICS can further improve the constraints on the non-standard neutrino interaction (NSI) compared to the best results. RELICS set out to develop a powerful surface-level detection technology for low-energy neutrinos from reactors.\n\n"}, "dark matter": {"2405.05888": "2024-05-09, **Quantum entanglement enables single-shot trajectory sensing for weakly interacting particles**, Zachary E. Chin et.al., [2405.05888v1](http://arxiv.org/abs/2405.05888v1)\n\n Sensors for mapping the trajectory of an incoming particle find important utility in experimental high energy physics and searches for dark matter. For a quantum sensing protocol that uses projective measurements on a multi-qubit sensor array to infer the trajectory of an incident particle, we show that entanglement can dramatically reduce the particle-sensor interaction strength $\\theta$ required for perfect trajectory discrimination. Within an interval of $\\theta$ above this reduced threshold, any unentangled sensor requires $\\Theta(\\log(1/\\epsilon))$ repetitions of the protocol to estimate the particle trajectory with $\\epsilon$ error probability, whereas an entangled sensor can succeed with zero error in a single shot.\n\n", "2405.05798": "2024-05-09, **A PAge-like Unified Dark Fluid Model**, Junchao Wang et.al., [2405.05798v1](http://arxiv.org/abs/2405.05798v1)\n\n The unified dark fluid model unifies dark matter and dark energy into a single component, providing an alternative and more concise framework for interpreting cosmological observations. We introduce a PAge-like Unified Dark Fluid (PUDF) model based on the PAge approximation (Huang 2020), which is parameterized by the age of the universe and an $\\eta$ parameter indicating the deviation from Einstein-De Sitter Universe. The PUDF model shares many similar features of the standard Lambda cold dark matter ($\\Lambda$CDM) model and can effectively describe the large-scale structure formation and late-time cosmic acceleration. We constrain the PUDF model with the Planck 2018 cosmic microwave background anisotropies, baryon acoustic oscillation measurements including those from the most recent DESI 2024, the Pantheon+ sample of Type Ia supernovae, and the Cosmic Chronometers compilation. Although the PUDF performs well in fitting all the cosmological datasets, the joint analysis of the data still favors the $\\Lambda$CDM model over the PUDF model, according to the Bayesian evidence of model comparison.\n\n", "2405.05732": "2024-05-09, **Constraints on primordial black holes from LIGO-Virgo-KAGRA O3 events**, M. Andrés-Carcasona et.al., [2405.05732v1](http://arxiv.org/abs/2405.05732v1)\n\n Primordial black holes (PBH) can efficiently form black hole binaries in the early universe. We update the resulting constraints on PBH abundance using data from the third observational run (O3) of LIGO-Virgo-KAGRA. To capture a wide range of PBH scenarios, we consider a variety of mass functions, including critical collapse in the QCD epoch in the presence of non-Gaussianities. Applying hierarchical Bayesian analysis to a population binaries consisting of primordial and astrophysical black holes, we find that, in every scenario, the PBHs can make up at most $f\\_{\\rm PBH} \\lesssim 10^{-3}$ of dark matter in the mass range $1-200~M\\_\\odot$. The shape and strength of the constraints are insensitive to the type of non-Gaussianities, the modifications to the mass function during the QCD epoch, or the modelling of the astrophysical PBH population.\n\n", "2405.05728": "2024-05-09, **Incoherent Fermionic Dark Matter Absorption with Nucleon Fermi Motion**, Shao-Feng Ge et.al., [2405.05728v1](http://arxiv.org/abs/2405.05728v1)\n\n We investigate the incoherent regime of the fermionic dark matter absorption by nuclei using the relativistic Fermi gas model and nuclear form factors. With the momentum transfer being roughly equal to the dark matter mass $m\\_\\chi$, the incoherent regime contributes significantly to the absorption process for $m\\_\\chi \\gtrsim 100$ MeV with a spin-independent operator and for even smaller mass with a spin-dependent one. We also compare the situations for various target nuclei ($^{131}$Xe, $^{72}$Ge, $^{40}$Ar, $^{20}$Ne and $^4$He) that are typically used in the dark matter direct detection. A heavier nucleus actually has the advantage of probing the incoherent scattering of the fermionic absorption dark matter. Observing both the coherent and incoherent contributions would be an important justification of the fermionic dark matter absorption.\n\n"}, "supernova": {"2405.05819": "2024-05-09, **X-ray signatures of galactic outflows into the circumgalactic medium**, Ranita Jana et.al., [2405.05819v1](http://arxiv.org/abs/2405.05819v1)\n\n We present a set of controlled hydrodynamical simulations to study the effects of strong galactic outflows on the density and temperature structures, and associated X-ray signatures, of extra-planar and circumgalactic gas. We consider three initial state models, isothermal, isentropic, and rotating cooling-flow, for the hot circumgalactic medium (CGM) into which the outflows are driven. The energy sources are either stellar winds and supernovae, or active galactic nuclei. We consider energy injection rates in the range $10^{40} < \\dot{E}\\_{\\rm inj} <10^{44.5}$ erg s$^{-1}$, and compute the time-dependent soft X-ray (0.5-2 keV) surface brightness. For $\\dot{E}\\_{\\rm inj} \\gtrsim 10^{41} - 10^{42}$ erg s$^{-1}$, with the exact threshold depending on the initial CGM state, the X-ray response is dominated by dense hot gas in the forward shock that eventually fades into the CGM as a sound wave. The shock surrounds an inner hot bubble leading to a radial flattening of the X-ray surface brightness. For lower energy injection rates, the X-ray surface brightness of the initial CGM state is almost unaffected. We present analytic approximations for the outflow shock propagation and the associated X-ray emissions.\n\n", "2405.05798": "2024-05-09, **A PAge-like Unified Dark Fluid Model**, Junchao Wang et.al., [2405.05798v1](http://arxiv.org/abs/2405.05798v1)\n\n The unified dark fluid model unifies dark matter and dark energy into a single component, providing an alternative and more concise framework for interpreting cosmological observations. We introduce a PAge-like Unified Dark Fluid (PUDF) model based on the PAge approximation (Huang 2020), which is parameterized by the age of the universe and an $\\eta$ parameter indicating the deviation from Einstein-De Sitter Universe. The PUDF model shares many similar features of the standard Lambda cold dark matter ($\\Lambda$CDM) model and can effectively describe the large-scale structure formation and late-time cosmic acceleration. We constrain the PUDF model with the Planck 2018 cosmic microwave background anisotropies, baryon acoustic oscillation measurements including those from the most recent DESI 2024, the Pantheon+ sample of Type Ia supernovae, and the Cosmic Chronometers compilation. Although the PUDF performs well in fitting all the cosmological datasets, the joint analysis of the data still favors the $\\Lambda$CDM model over the PUDF model, according to the Bayesian evidence of model comparison.\n\n", "2405.05586": "2024-05-09, **Modelling the galaxy radio continuum from star formation and active galactic nuclei in the Shark semi-analytic model**, Samuel P. Hansen et.al., [2405.05586v1](http://arxiv.org/abs/2405.05586v1)\n\n We present a model of radio continuum emission associated with star formation (SF) and active galactic nuclei (AGN) implemented in the Shark semi-analytic model of galaxy formation. SF emission includes free-free and synchrotron emission, which depend on the free-electron density and the rate of core-collapse supernovae with a minor contribution from supernova remnants, respectively. AGN emission is modelled based on the jet production rate, which depends on the black hole mass, accretion rate and spin, and includes synchrotron self-absorption. Shark reproduces radio luminosity functions (RLFs) at 1.4 GHz and 150 MHz for 0 $\\leq$ z $\\leq$ 4, and scaling relations between radio luminosity, star formation rate and infrared luminosity of galaxies in the local and distant universe in good agreement with observations. The model also reproduces observed number counts of radio sources from 150 MHz to 8.4 GHz to within a factor of two on average, though larger discrepancies are seen at the very bright fluxes at higher frequencies. We use this model to understand how the radio continuum emission from radio-quiet AGNs can affect the measured RLFs of galaxies. We find current methods to exclude AGNs from observational samples result in large fractions of radio-quiet AGNs contaminating the \"star-forming galaxies\" selection and a brighter end to the resulting RLFs. We investigate how this effects the infrared-radio correlation (IRRC) and show that AGN contamination can lead to evolution of the IRRC with redshift. Without this contamination our model predicts a redshift- and stellar mass-independent IRRC, except at the dwarf-galaxy regime.\n\n"}}