{"neutrino": {"2510.13723": "2025-10-15, **Unified Origin of Dirac Neutrino and Asymmetric Dark Matter Masses via a Dirac-Type Leptogenesis**, Megumi Ishida et.al., [2510.13723v1](http://arxiv.org/abs/2510.13723v1)\n\n We propose a simple and unified framework that simultaneously explains the origins of light Dirac neutrino masses, asymmetric dark matter (ADM), and the baryon asymmetry of the Universe. The model is based on an extended $U(1)\\_X$ Froggatt-Nielsen--like mechanism, which naturally generates suppressed Yukawa couplings and realizes a Dirac seesaw for neutrino masses. An additional $\\mathbb{Z}\\_4$ symmetry stabilizes the dark sector, where chiral fermions charged under $\\mathbb{Z}\\_4$ serve as ADM candidates. Leptogenesis occurs through the out-of-equilibrium decays of heavy Dirac neutrinos, where the generated asymmetry is shared between the visible and dark sectors due to exact lepton-number conservation. The same suppression mechanism that explains the smallness of neutrino masses also determines the GeV-scale ADM mass. Numerical studies demonstrate that a fully asymmetric DM scenario is realized, consistent with relic abundance, Big Bang nucleosynthesis, and direct detection constraints. This framework provides an experimentally testable connection between neutrino physics, dark matter, and baryogenesis within an anomaly-free setup.\n\n", "2510.13574": "2025-10-15, **Hyperons and $Δ$'s in rotating protoneutron stars: Local properties**, Franciele M. da Silva et.al., [2510.13574v1](http://arxiv.org/abs/2510.13574v1)\n\n The structural evolution of rotating protoneutron stars encodes essential information about their observable signatures, while microscopic properties provide complementary knowledge to advance observational investigations. Using a relativistic mean-field model with density-dependent couplings that account for temperature and particle composition, we investigate rotation, neutrino-emission-driven changes in angular momentum, particle distributions, temperature profiles, and sound speed to probe the internal dynamics of protoneutron star matter. Additionally, we track the evolution of macroscopic quantities such as energy distribution and gravitational mass and establish direct links between microphysics and global evolution. Extending the framework of Phys. Rev. D 112, 023007 (2025), which focuses on the global properties of rotating protoneutron star evolution, our results reveal that protoneutron star deformation and thermal evolution are governed by angular momentum, mass, and composition. Exotic matter (hyperons and $\\Delta$-resonances) and rapid rotation enhance deformation leading to a reduction in core temperature, whereas slowly rotating stars like PSR J0740$+$6620 remain nearly spherical. Our predicted equatorial radii for PSR J0740$+$6620, $13.0\\ \\mathrm{km} < R\\_e < 13.5\\ \\mathrm{km}$, are consistent with NICER measurements. These findings constrain the EoS, requiring a self-consistent treatment of rotation, mass-dependent compression, and composition-driven modeling to accurately model protoneutron star evolution in the context of multi-messenger astrophysics.\n\n", "2510.13403": "2025-10-15, **Evidence for Neutrino Emission from X-ray Bright Active Galactic Nuclei with IceCube**, R. Abbasi et.al., [2510.13403v1](http://arxiv.org/abs/2510.13403v1)\n\n Recently, IceCube reported neutrino emission from the Seyfert galaxy NGC 1068. Using 13.1 years of IceCube data, we present a follow-up search for neutrino sources in the northern sky. NGC 1068 remains the most significant neutrino source among 110 preselected gamma-ray emitters while also being spatially compatible with the most significant location in the northern sky. Its energy spectrum is characterized by an unbroken power-law with spectral index $\\gamma = 3.4 \\pm 0.2$. Consistent with previous results, the observed neutrino flux exceeds its gamma-ray counterpart by at least two orders of magnitude. Motivated by this disparity and the high X-ray luminosity of the source, we selected 47 X-ray bright Seyfert galaxies from the Swift/BAT spectroscopic survey that were not included in the list of gamma-ray emitters. When testing this collection for neutrino emission, we observe a 3.3$\\sigma$ excess from an ensemble of 11 sources, with NGC 1068 excluded from the sample. Our results strengthen the evidence that X-ray bright cores of active galactic nuclei are neutrino emitters.\n\n", "2510.13231": "2025-10-15, **Coscattering Dark Matter in Scotogenic Models**, Ang Liu et.al., [2510.13231v1](http://arxiv.org/abs/2510.13231v1)\n\n The Scotogenic mechanism is an appealing pathway to naturally explain the common origin of dark matter and tiny neutrino mass. However, the conventional scotogenic dark matter usually suffers stringent constraints from the non-observation of lepton flavor violation and direct detection. To generate the non-zero neutrino masses, at least two generations of dark particles are required. For example, two real scalar singlets $\\phi\\_1$ and $\\phi\\_2$ are involved in the scotogenic inverse model, which are odd under the $Z\\_2$ symmetry. In this paper, we consider the masses of dark scalars are nearly degenerate $m\\_{\\phi\\_1}\\lesssim m\\_{\\phi\\_2}$, which opens new viable pathway for the generation of dark matter $\\phi\\_1$, such as the coscattering process $\\phi\\_1\\text{SM}\\to \\phi\\_2 \\text{SM}$ and coannihilation processes $\\phi\\_1 \\phi\\_2 \\to \\text{SM SM}$ via the Higgs portal or Yukawa portal interactions. We explore the parameter space to produce the correct relic density through coscattering, as well as the contrastive coannihilation channel. We then comprehensively study the constraints of dark matter from Higgs decay, direct detection, and indirect detection. For the heavier dark scalar, the three-body decay $\\phi\\_2\\to\\phi\\_1 f\\bar{f}$ not only alerts the predictions of big bang nucleosynthesis and cosmic microwave background, but also leads to the observable displaced vertex signature at colliders.\n\n", "2510.13173": "2025-10-15, **The BUTTON-30 detector at Boulby**, J. Bae et.al., [2510.13173v1](http://arxiv.org/abs/2510.13173v1)\n\n The BUTTON-30 detector is a 30-tonne technology demonstrator designed to evaluate the potential of hybrid event detection, simultaneously exploiting both Cherenkov and scintillation light to detect particle produced in neutrino interactions. The detector is installed at a depth of 1.1 km in the Boulby Underground Laboratory allowing to test the performance of this new technology underground in a low background environment. This paper describes the design and construction of the experiment.\n\n", "2510.13133": "2025-10-15, **Phenomenology of light baryon resonances**, Michael Döring et.al., [2510.13133v1](http://arxiv.org/abs/2510.13133v1)\n\n Protons and neutrons are the building blocks of matter, glued together in nuclei by strong interactions. They can be excited by pions, real and virtual photons, neutrinos and other probes. These excitations are referred to as light baryon resonances. A short, pedagogical overview of the field is presented including experimental progress, interpretation of light baryon resonances, and a focus on analysis methods to extract the resonance spectrum from data.\n\n", "2510.12978": "2025-10-14, **Toward First-Principles Multi-Messenger Predictions: Coupling Nuclear Networks with GR Radiation-MHD in {\\tt Gmunu}**, Patrick Chi-Kit Cheong et.al., [2510.12978v1](http://arxiv.org/abs/2510.12978v1)\n\n We present a new implementation of nuclear reaction networks in the \\texttt{G}eneral-relativistic \\texttt{mu}ltigrid \\texttt{nu}merical (\\texttt{Gmunu}) code, a framework for general relativistic radiation magnetohydrodynamics (GRRMHD). The extended code self-consistently evolves nuclear species coupled to hydrodynamics, magnetic fields, and neutrino radiation transport under the conformal flatness approximation to Einstein's equations. Four approximate nuclear networks are included, with stiff source terms integrated using implicit-explicit Runge-Kutta schemes. Validation is performed through benchmarks including conserved-to-primitive recovery with a tabulated stellar equation of state, one-zone silicon burning, and hydrodynamic tests of shock tubes, acoustic pulses, and detonation fronts of Type Ia supernovae. These tests confirm accurate coupling between nuclear reactions and fluid dynamics, conserving electron and nuclear mass fractions to machine precision.   As an application, we conduct spherically symmetric core-collapse supernova simulations. The models reproduce the expected non-exploding behavior of standard progenitors, while enhanced neutrino heating revives the shock. Including nuclear burning modifies the post-shock composition and dynamics, converting silicon and oxygen layers into iron-group nuclei and strengthening the explosion. This demonstrates the impact of explosive burning on ejecta composition and shock evolution, and establishes the stability of the coupled GR radiation-MHD-nuclear framework. The implementation is fully compatible with multidimensional GRMHD simulations and represents the first GRRMHD code combining M1 neutrino transport with fully coupled nuclear burning.\n\n", "2510.12900": "2025-10-14, **Updated Constraints on Large Extra Dimensions from Reactor Antineutrino Experiments**, T. Gökalp Elaçmaz et.al., [2510.12900v1](http://arxiv.org/abs/2510.12900v1)\n\n We investigate constraints on large extra dimensions (LED) using the latest results from reactor antineutrino experiments. Specifically, we analyze the full data sets from Daya Bay, RENO, KamLAND, NEOS, and STEREO to derive updated bounds. For the case of one extra dimension, we find constrains on its radius $a$ of $a \\lesssim 0.58~{\\rm \\mu m}$ ($a \\lesssim 0.12~{\\rm \\mu m}$) at the $99\\%$ confidence level for normal (inverted) ordering, an improvement of approximately $\\sim 20\\%$ ($\\sim 25\\%$) with respect to previous bounds, assuming a massless lightest active neutrino. Furthermore, we present new limits on $4+d$ LED scenarios, with $d = 2, 3, 4$ denoting the number of extra dimensions, based on the same reactor data and assuming equal radii for all extra dimensions. We find that the constraints become increasingly stringent with a larger number of extra dimensions. In particular, $d = 4$ with a massless lightest active neutrino, we obtain limits of $a \\lesssim 0.28~{\\rm \\mu m}$ for normal and $a \\lesssim 0.05~{\\rm \\mu m}$ for inverted orderings at the $99\\%$ confidence level.\n\n", "2510.12873": "2025-10-14, **New Spallation Background Rejection Techniques to Greatly Improve the Solar Neutrino Sensitivity of JUNO**, Obada Nairat et.al., [2510.12873v1](http://arxiv.org/abs/2510.12873v1)\n\n While the potential of the Jiangmen Underground Neutrino Observatory (JUNO) to measure solar neutrinos is known, realizing this potential requires new techniques to reduce detector backgrounds. One of the most serious backgrounds is due to the beta decays of unstable nuclei produced through muon breakup (spallation) of nuclei. This background is much more significant in JUNO compared to Super-Kamiokande due to JUNO's shallower depth and its lack of directional information. We present the first detailed theoretical calculations of spallation backgrounds in JUNO, showing the underlying physical processes and new ways to cut backgrounds while preserving signals. A key point is showing the importance of neutron tagging to identify hadronic showers, which are rare but produce almost all of the dangerous isotopes. With our new techniques, JUNO will be able to reduce deadtime (signal loss) by a factor of five and to reduce the running time needed to meet sensitivity goals by a factor of two. This will give JUNO greatly improved sensitivity to $^8$B and $hep$ solar neutrinos, as we will explore in a separate paper.\n\n", "2510.12661": "2025-10-14, **Measurement of the tau anomalous magnetic moment using Ultra-peripheral collisions with the ALICE detector in Run 3 Pb-Pb data**, Roman Lavička et.al., [2510.12661v1](http://arxiv.org/abs/2510.12661v1)\n\n The anomalous magnetic moment of the tau lepton ($a\\_{\\tau}$) is a sensitive probe for the search for deviations from the Standard Model predictions and thus for new physics. This study investigates the feasibility of measuring $a\\_{\\tau}$ using ultra-peripheral collisions (UPCs) at the LHC, where photon-photon interactions ($\\gamma\\gamma \\to \\tau^+ \\tau^-$) produce tau lepton pairs. We focus on events recorded by the ALICE detector during Run 3 Pb-Pb data-taking. Events are selected in the decay channel where one tau decays into an electron and neutrinos, and the other decays into a charged pion, or three charged pions, and neutrinos. These samples are enhanced with decays into muons, which are inseparable in the ALICE detector. The clean environment of UPCs minimizes hadronic background, while the advanced particle identification capabilities of the ALICE Time Projection Chamber (TPC) and Time-of-Flight (TOF) systems allow for efficient separation of electrons, pions, and background particles. In this talk, prospects for measuring this process by ALICE in Run 3, which benefits from high statistics and improved systematics uncertainties, will be discussed. Results will provide tighter constraints on $a\\_{\\tau}$, contributing to the broader effort to test the Standard Model's robustness and explore physics beyond it.\n\n", "2510.12634": "2025-10-14, **High-energy photons from Gamma-Ray Bursts, but no neutrinos**, A. De Rújula et.al., [2510.12634v1](http://arxiv.org/abs/2510.12634v1)\n\n The Cannon-Ball model of Gamma-Ray Bursts and their afterglows--described in the text and in innumerable previous occasions--is extremely successful and predictive. In a few intrinsically bright GRBs, gamma-rays with energies in the TeV range have been observed. The CB model, I argue, has no difficulty in describing the origin and approximate properties of these high-energy gamma rays and the extreme difficulty of observing their accompanying neutrinos.\n\n", "2510.12449": "2025-10-14, **Constraining neutrino electromagnetic properties with recent low-energy electron recoil data at dark matter direct detection experiments**, M. Demirci et.al., [2510.12449v1](http://arxiv.org/abs/2510.12449v1)\n\n Neutrinos that are elastically scattered off atomic electrons provide a unique opportunity to investigate the Standard Model (SM) and beyond SM physics. In this work, we explore the new physics effects of neutrino electromagnetic properties through elastic neutrino-electron scattering using solar neutrinos at the low energy range of PandaX-4T and XENONnT experiments. The properties of interest include the neutrino magnetic moment, millicharge, and charge radius, all of which are natural consequences of non-zero neutrino masses. We investigate their effects by incorporating each property into the Standard Model (SM) framework, given the measured the solar neutrino flux. By analyzing the latest Run 0 and Run 1 datasets from the PandaX-4T experiment, together with recent results from XENONnT, we derive new constraints on each electromagnetic property of neutrino. We present both flavor-independent results, obtained using a common parameter for all three neutrino flavors, and flavor-dependent results, derived by marginalizing over the three neutrino flavor components. Bounds we obtained are comparable or improved compared to those reported in the previous studies.\n\n", "2510.12248": "2025-10-14, **Constraining Heavy Neutral Leptons Coupled to the Tau-Neutrino Flavor at the Large Hadron Collider**, Edis D. Tireli et.al., [2510.12248v1](http://arxiv.org/abs/2510.12248v1)\n\n Displaced vertex (DV) signatures at colliders offer a powerful probe of new long-lived particles beyond the Standard Model. Among the best-motivated candidates are heavy neutral leptons (HNLs) - heavier counterparts of Standard Model neutrinos - which can account for the origin of neutrino masses and potentially produce di-leptonic DV signatures.   In this study, we demonstrate how existing DV searches at the LHC can be extended to probe HNLs that couple predominantly to the tau-neutrino flavor. While current search strategies rely on identifying a prompt lepton alongside a displaced vertex, we show that analyzing events without a prompt lepton enables sensitivity to the process $pp \\to W \\to \\tau N$, where the tau decays hadronically and the HNL subsequently decays to a lepton pair and a neutrino.   We perform detailed Monte Carlo simulations of this process with HNLs decaying to $\\mu^+\\mu^-$ or $e^+e^-$ final states, apply ATLAS-inspired selection criteria, and optimize signal sensitivity. In particular, we demonstrate that appropriate cuts in the plane of di-lepton invariant mass and DV radial position significantly enhance signal visibility. We propose several such optimized strategies and show that even with Run 2 data $139~\\text{fb}^{-1}$ , existing bounds can be improved by more than an order of magnitude. Future high-luminosity runs may strengthen sensitivity by up to three orders of magnitude compared to current limits.\n\n"}, "dark matter": {"2510.13770": "2025-10-15, **Gauge-Invariant Gravitational Waves from Cogenesis in a $B-L$ Conserving Universe**, Wan-Zhe Feng et.al., [2510.13770v1](http://arxiv.org/abs/2510.13770v1)\n\n An analysis of baryogenesis and stochastic gravitational wave production is presented for an extension of the standard model where the dark sector consists of dark matter particles charged under a $U(1)\\_x$ gauge symmetry, while a subset of dark fields also carry lepton number but no $U(1)\\_x$ charge. We demonstrate that with CP violation induced by Yukawa couplings, equal and opposite lepton asymmetries are generated in the visible and hidden sectors. Subsequent evolution preserves lepton number separately in each sector, and sphaleron interactions partially convert the lepton asymmetry into baryon asymmetry near the temperature of the first-order phase transition. Further, we discuss stochastic gravitational wave background production for the first-order phase transition using a gauge-independent bubble nucleation dynamics which yields spectra also valid in the supercooled low-temperature regime with {$T\\_p/m\\_{A\\_x} \\ll 1$} where $T\\_p$ is the percolation temperature and $m\\_{A\\_x}$ is the dark photon mass. A parameter-space scan identifies regions that simultaneously account for cogenesis of baryon asymmetry and dark matter and predict stochastic gravitational wave signals within reach of current (NANOGrav, EPTA, PPTA) and future detectors at higher frequencies, providing a unified framework for cogenesis and associated gravitational wave production.\n\n", "2510.13604": "2025-10-15, **Mass and spin coevolution of black holes inspiralling through dark matter**, Theophanes K. Karydas et.al., [2510.13604v1](http://arxiv.org/abs/2510.13604v1)\n\n In extreme/intermediate-mass-ratio inspirals (E/IMRIs) embedded in dark-matter (DM) spikes, the secondary black hole can accrete collisionless particles from the surrounding halo. We study how the companion's spin controls this process, and the ensuing back-reaction on the magnitude and direction of the companion's spin vector. We find that higher spin suppresses the mass accretion rate but enhances the accretion-induced torques, driving spin-down and secular alignment of the companion's spin with the orbital plane. Collisionless DM accretion generically imprints a near-universal mass-spin correlation characterized by a spin-evolution parameter $s \\simeq 2.8$, much larger than is the case for typical astrophysical environments, and largely independent of the local DM density and the spike slope. The associated spin-down proceeds on astrophysically relevant timescales, thus observations of rapidly spinning IMRI companions would disfavor the presence of dense DM environments, providing constraints complementary to those arising from dynamical friction.\n\n", "2510.13477": "2025-10-15, **Probing Primordial black holes with the distortion of Stochastic Gravitational Wave Background**, Mingqi Sun et.al., [2510.13477v1](http://arxiv.org/abs/2510.13477v1)\n\n The stochastic gravitational-wave background (SGWB), arising from the incoherent superposition of numerous compact binary coalescences, serves as a powerful probe of both astrophysical populations and fundamental physics. In this work, we investigate the influence of gravitational lensing on the SGWB, focusing on primordial black holes (PBHs) as potential lenses. Assuming PBHs as dark matter candidates with a broad cosmic distribution, we show that their lensing optical depth can be significantly enhanced, producing pronounced effects with relative deviations at the 10^-1 level. By systematically varying the PBH mass (M\\_PBH) and abundance (f\\_PBH), we demonstrate that the mass predominantly determines the frequency-dependent diffraction features of the spectrum, while the abundance primarily amplifies the overall lensing-induced deviation. Although the SGWB from binary black holes has not yet been observed, our analytical results provide theoretical insight into the possible imprint of lensing on its spectrum and suggest that future detections could offer a novel avenue to constrain dark matter scenarios.\n\n", "2510.13436": "2025-10-15, **Examining a new form of non-standard dark matter using DESI DR2 data**, Yan-Hong Yao et.al., [2510.13436v1](http://arxiv.org/abs/2510.13436v1)\n\n In this work, we propose a non-standard dark matter (NSDM) model in which the equation of state (EoS) of dark matter (DM) is parameterized as $w\\_{\\rm dm} = w\\_2 a^2$, and this DM model is motivated by the idea that DM must become cold dark matter (CDM) in the neighborhood of the scale factor $a = 0$, which implies that both the EoS of DM, $w\\_{\\rm dm}$, and its derivative with respect to the scale factor, ${\\rm d}w\\_{\\rm dm}/{\\rm d}a$, vanish at $a = 0$. By incorporating the latest cosmological datasets -- including the Planck2018 Cosmic Microwave Background (CMB) distance priors, the Baryon Acoustic Oscillation measurements from the Data Release 2 of the Dark Energy Spectroscopic Instrument (DESI), together with three independent Type Ia Supernova datasets, namely the Dark Energy Survey Year 5 (DESY5) compilation, the Union3 compilation, and the PantheonPlus sample -- we constrain the $\\Lambda w\\_2$DM, $ww\\_2$DM, and $w\\_0w\\_aw\\_2$DM models, which are constructed by replacing CDM with NSDM in the $\\Lambda $CDM, $w$CDM, and $w\\_0w\\_a$CDM models, respectively. We find that there is a preference for a negative DM EoS at more than the $3\\sigma$ confidence level for the data combinations CMB+DESI+Union3 and CMB+DESI+DESY5. Moreover, for all data combinations, replacing CDM with NSDM in the $w$CDM and $w\\_0w\\_a$CDM models significantly reduces the probability of violating the null energy condition. Furthermore, both $ww\\_2$DM and $w\\_0w\\_aw\\_2$DM are favored over $\\Lambda $CDM with a significance comparable to that of the $w\\_0w\\_a$CDM model.\n\n", "2510.13289": "2025-10-15, **Dark sector at BESIII**, Vindhyawasini Prasad et.al., [2510.13289v1](http://arxiv.org/abs/2510.13289v1)\n\n Dark matter (DM) plays a crucial role in explaining the observed astrophysical anomalies, galaxy rotation curves, and other fundamental characteristics of the Universe. Many extensions of the Standard Model (SM), such as the dark hidden-sector model, provide an attractive framework in which DM can couple to SM particles via various portals. These portals give rise to several possible new particles beyond the SM, such as light Higgs bosons, dark photons, and axion-like particles. Furthermore, the origin of DM and the observed asymmetry between visible matter and antimatter may be connected through the introduction of a dark baryon. If the masses of these hypothetical particles lie in the few-GeV range, they can be explored at high-intensity $e^+e^-$ collider experiments, such as the BESIII experiment. This report presents a review of recent BESIII results related to searches for dark-sector particles.\n\n", "2510.13153": "2025-10-15, **Dependency of the Bar Formation Timescale On The Halo Spin**, Bin-Hui Chen et.al., [2510.13153v1](http://arxiv.org/abs/2510.13153v1)\n\n Bars are among the most prominent structures in disk galaxies. While the widely accepted swing-amplification theory provides a qualitative framework for their formation, the detailed physical processes remain incompletely understood. Previous studies have shown that the bar formation timescale in isolated galaxies depends exponentially on the disk mass fraction (the so-called \"Fujii relation\") and linearly on disk hotness and thickness. However, the influence of dark matter halo spin on bar formation has not been systematically investigated. In this work, we construct a suite of $N$-body models of disk and halo with varying disk mass fractions and amounts of random motions. By introducing prograde and retrograde spins in the dark matter halo, we explore how halo spin modifies the established empirical relations governing bar formation timescales. We find that these relations remain valid in both prograde and retrograde halo spin models. For rapid bar formation (short timescale), the effect of halo spin is nearly negligible. In contrast, for moderately slow bar formation, prograde (retrograde) halo spin tends to accelerate (suppress) bar onset. In cases of extremely slow bar formation, halo spin introduces a stronger but more stochastic influence. These trends might arise from the exchange of angular momentum between the stellar disk and the dark matter halo.\n\n", "2510.13129": "2025-10-15, **Numerical Cosmology**, Romain Teyssier et.al., [2510.13129v1](http://arxiv.org/abs/2510.13129v1)\n\n In these lecture notes, we describe the current state-of-the-art for numerical simulations of large-scale structure and galaxy formation. Numerical simulations play a central role in the preparation and the exploitation of large-scale galaxy surveys, in which galaxies are the fundamental observational objects. We first describe basic methods for collisionless N-body dynamics that enable us to model dark matter accurately by solving the Vlasov-Poisson equations. We then discuss simple methods to populate dark matter halos with galaxies, such as Halo and Sub-halo Abundance Matching techniques and baryonification techniques for capturing baryonic effects on the matter distribution. We finally describe how to model the gas component by solving the Euler-Poisson equations, focusing on the foundational assumptions behind these equations, namely local thermo-dynamical equilibrium, and the nature of the truncation errors of the numerical scheme, namely numerical diffusion. We show a few examples of simulations of a Milky-Way-like halo without cooling, with cooling and with star formation. We finally describe different subgrid prescriptions recently developed to model star formation, supernovae feedback and active galactic nuclei and how they impact cosmological simulations.\n\n", "2510.12984": "2025-10-14, **When Tiny Halos Stir Spacetime: Gravitational Waves from Fifth-Force Mergers**, Xinpeng Wang et.al., [2510.12984v1](http://arxiv.org/abs/2510.12984v1)\n\n Dark matter fermions interacting via attractive fifth forces mediated by a light mediator can form dark matter halos in the very early universe. We show that bound systems composed of these halos are capable of generating gravitational wave (GW) signals detectable today, even when the individual halos are very light. The Yukawa force dominates the dynamics of these halo binaries, rather than gravity. As a result, large GW signals can be produced at initially extremely high frequencies, which are then redshifted to frequency bands accessible to current or future GW observatories. In addition, the resulting GW signals carry distinctive features that enable future observations to distinguish them from conventional ones. Notably, even if only a tiny fraction of dark matter experiences strong fifth-force interactions, such effects provide a new avenue to discover self-interacting dark matter through GW observations.\n\n", "2510.12877": "2025-10-14, **Dark Matter-Electron Interactions Alter the Luminosity and Spectral Index of M87**, Abdelaziz Hussein et.al., [2510.12877v1](http://arxiv.org/abs/2510.12877v1)\n\n We investigate the possibility that cosmic-ray electron cooling through dark matter-electron scatterings contributes to the low radiative efficiency observed in radio-loud galaxies such as M87. Light dark matter can scatter efficiently off electrons in M87, lowering the observed bolometric luminosity compared to astrophysical expectations. This consideration allows us to probe previously unexplored regions of the parameter space of dark matter-electron interactions. We further model the cosmic-ray electron distribution by numerically solving a diffusion equation along the jet and find that efficient dark matter-electron interactions can induce a flattening of the spectral index at different distances from the central supermassive black hole, in better alignment with radio observations from M87.\n\n", "2510.12791": "2025-10-14, **Dark Matter Boosted by Terrestrial Collisions**, Zamiul Alam et.al., [2510.12791v1](http://arxiv.org/abs/2510.12791v1)\n\n Inelastic dark matter (IDM) models feature an energy threshold for scattering with Standard Model particles, which enables their consistency with the increasingly stringent limits placed by direct detection experiments. In a typical construction, elastic scattering is absent at tree level, and a lighter dark matter state must first upscatter into a heavier state in order to interact with the nuclei in the detector. We model the excitation of IDM in the Earth followed by its downscattering inside a detector, and we show that considering this process markedly enhances the sensitivity of existing detectors. In particular, current limits based on XENON100 and XENON1T data can be extended to significantly larger mass splittings.\n\n", "2510.12585": "2025-10-14, **OCTOPUS: A Versatile, User-Friendly, and Extensible Public Code for General-Relativistic Ray-Tracing in Spherically Symmetric and Static Spacetimes**, Shiyang Hu et.al., [2510.12585v1](http://arxiv.org/abs/2510.12585v1)\n\n This paper presents OCTOPUS, a relativistic ray-tracing algorithm developed within a Fortran-based, OpenMP-accelerated framework, designed for asymptotically flat, spherically symmetric curved spacetimes. The code efficiently and accurately computes key relativistic features -- including the black hole event horizon, photon rings, critical curves, and innermost stable circular orbits -- and simulates black hole shadows, redshift factor distributions, accretion disk images, toroidal images, as well as gravitational lensing, light curves, and gravitational radiation from hot-spots. OCTOPUS provides an automated, modular solution for qualitative studies of black hole observables and multi-messenger correlations between electromagnetic and gravitational signals in curved spacetime. Its implementation requires only the metric potential and its first-, second-, and third-order radial derivatives as input, ensuring low user barriers while remaining highly extensible and adaptable. Using a Schwarzschild black hole surrounded by a Dehnen-type dark matter halo, we thoroughly validate the algorithm's precision, efficiency, and functionality, and investigate how dark matter halo parameters affect observational signatures. Our results demonstrate that increasing the scale and density of the dark matter halo strengthens the spacetime's gravitational field, an effect clearly reflected in black hole images and supported by hot-spot light curve signatures. A future version of OCTOPUS, with expanded capabilities for axisymmetric spacetimes, is planned for release.\n\n", "2510.12551": "2025-10-14, **Non-linear structure formation with elastic interactions in the dark sector**, Jose Beltrán Jiménez et.al., [2510.12551v1](http://arxiv.org/abs/2510.12551v1)\n\n Cosmological models where dark matter interacts with dark energy via a pure momentum transfer and with no energy exchange (i.e. elastic) provide compelling scenarios for addressing the apparent lack of structures at low redshift. In particular, it has been shown that measurements of $S\\_8$ may show a statistically significant preference for the presence of elastic interactions. In this work we implement a specific realisation of these scenarios into an $N$-body code to explore the non-linear regime. We include two populations of particles to describe the interacting dark matter and the non-interacting baryons respectively. On linear scales we recover the suppression of structures obtained from Boltzmann codes, while non-linear scales exhibit an enhancement of the matter power. We find that fewer massive halos are formed at low redshift as a consequence of the elastic interaction and that dark matter halos are more compact than in the standard model. Furthermore, the ratio of dark matter and baryons density profiles is not constant. Finally, we corroborate that baryons efficiently cluster around dark matter halos so they provide good tracers of the dark matter velocity field despite the presence of the interaction. This shows that the interaction is not sufficiently strong as to disrupt virialised structures.\n\n", "2510.12396": "2025-10-14, **Search for dark matter production in association with bottom quarks and a lepton pair in proton-proton collisions at $\\sqrt{s}$ = 13 TeV**, CMS Collaboration et.al., [2510.12396v1](http://arxiv.org/abs/2510.12396v1)\n\n A search is performed for dark matter produced in association with bottom quarks and a pair of electrons or muons in data collected with the CMS detector at the LHC, corresponding to 138 fb$^{-1}$ of integrated luminosity of proton-proton collisions at a center-of-mass energy of 13 TeV. For the first time at the LHC, the associated production of a bottom quark-antiquark pair and a new heavy neutral Higgs boson (H) that subsequently decays into a leptonically decaying Z boson and a pseudoscalar (a) is explored. The latter acts as a dark matter mediator in the context of the two Higgs doublet model plus a pseudoscalar (2HDM+a). Multivariate techniques that target a wide range of mass configurations for the H and a particles are used. The observations are consistent with the expectations from standard model processes. Upper limits at 95% confidence level are set on the product of cross section and branching fraction of the new particles, ranging from 10$^{-2}$ pb for an H mass of 400 GeV to 10$^{-3}$ pb for an H mass of 2000 GeV. Constraints on the parameter space of a benchmark 2HDM+a model are derived and compared with expectations in the context of cosmological predictions.\n\n", "2510.12270": "2025-10-14, **Experimental tests of the calibration of high precision differential astrometry for HWO**, Manon Lizzana et.al., [2510.12270v1](http://arxiv.org/abs/2510.12270v1)\n\n Many different scientific applications require sub-micro arcsecond precision astrometry, including researching rocky exoplanets in the vicinity of the Sun and studying dark matter. The Habitable Worlds Observatory (HWO) is a promising candidate to carry an astrometric instrument because it provides a stable, space-based telescope with a large aperture, which allows faint sources and small displacements to be observed. This paper presents the characterization of an appropriate detector for an astrometric instrument: the 46Mpx Gigapyx from Pyxalis. Moreover it explains the implementation of a testbed enabling interferometric characterization of pixel positions. Finally, the paper introduces a method for calibrating the telescope's optical distortion. This method was implemented in simulation and tested thanks to an optical bench developed at IPAG in France.\n\n", "2510.12263": "2025-10-14, **Is Milky Way stable all the way ? A TNG50 view from cosmic noon to the present day**, K. Aditya et.al., [2510.12263v1](http://arxiv.org/abs/2510.12263v1)\n\n We investigate the stability of Milky Way analogs (MWAs) in the \\texttt{TNG50} simulation against the growth of local axisymmetric instabilities, tracing their evolution from cosmic noon ($z=2.5$) to the present day ($z=0$). Using a two-component stability criterion that accounts for stars, gas, and the force field of the dark matter halo, we compute the net stability parameter ($Q\\_{T}$), the critical gas surface density ($\\Sigma\\_{c}$), and the instability timescale ($\\tau$) for 10 barred and 10 unbarred MWAs. We find that these galaxies remain stable to axisymmetric instabilities at all epochs, with $Q\\_{T}^{\\min}>2$. The stability levels increase toward higher redshift, where enhanced gas velocity dispersion counterbalances the destabilizing effect of larger gas fractions. Further, the barred MWAs consistently show lower $Q\\_{T}^{\\min}$ than unbarred ones. The gas density remains subcritical ($\\Sigma\\_{g}<\\Sigma\\_{c}$) across radii and epochs, implying that local axisymmetric instabilities are not the primary channel for star formation. Growth timescales are short (a few Myr) in central regions but increase exponentially to several Gyr in the outer disc, naturally explaining the concentration of star formation toward galactic centers. We study the effect of gas dissipation and turbulence in ISM and find that while MWAs are stable against axisymmetric instabilities $(Q\\_{T}>1)$, a combination of gas dissipation and turbulence in ISM can destabilize the disc at small scales even when $Q\\_{T}>1$.\n\n", "2510.12257": "2025-10-14, **The importance of being non-minimally coupled: scalar Hawking radiation from regular black holes**, Marco Calzà et.al., [2510.12257v1](http://arxiv.org/abs/2510.12257v1)\n\n In curved space-time, a scalar field $\\phi$ is generically expected to couple to curvature, via a coupling of the form $\\xi\\phi^2R$. Yet in the study of Hawking emission from regular black holes (RBHs), where scalar fields are often introduced as simple probes of the geometry, and the Ricci scalar is generically non-zero, this non-minimal coupling is almost always ignored. We revisit this assumption by studying scalar Hawking emission from four representative RBHs (the Bardeen, Hayward, Simpson-Visser, and D'Ambrosio-Rovelli space-times), within two benchmark cases: the conformal case $\\xi=1/6$, and a large negative value $\\xi=-10^4$ motivated by Higgs inflation. We compute the graybody factors and emission spectra, showing that the latter can be either enhanced or suppressed, even by several orders of magnitude. A crucial role is played by the sign of the term $\\xi fR$, with $f(r)=-g\\_{tt}$ in Schwarzschild-like coordinates, as it determines whether the non-minimal coupling suppresses or enhances the geometric potential barrier. For the D'Ambrosio-Rovelli case with large negative $\\xi$, the low-energy emission spectrum is enhanced by up to five orders of magnitude, since $\\xi fR<0$ throughout the space-time, leading to a deep potential well which broadens the transmissive window. The deviations we find can be particularly relevant in the case where primordial RBHs are dark matter candidates, given the impact of the non-minimal coupling on their evaporation history.\n\n", "2510.12848": "2025-10-14, **Constraining Ultra-Light Dark Matter mass with Dwarf Galaxy Rotation Curves**, Tian-yao Fang et.al., [2510.12848v1](http://arxiv.org/abs/2510.12848v1)\n\n While ultra-light bosonic dark matter (ULDM) in a Bose-Einstein condensate (BEC) state could naturally account for the central core in some galaxies and resolve the core-cusp problem, the dark matter density distribution in the outer regions of galaxies remains less explored. We propose a trial wavefunction to model the ULDM distribution beyond the BEC core. We derive the corresponding rotation velocity curve, which shows excellent agreement with those of 12 dwarf spheroidal galaxies. The best-fit ULDM particle mass for each dwarf galaxy falls within a strikingly narrow range of $m=(1.8-3.2)\\times 10^{-23}\\text{eV}$.\n\n"}, "supernova": {"2510.13765": "2025-10-15, **Optimizing Supernova Classification with Interpretable Machine Learning Models**, Anurag Garg et.al., [2510.13765v1](http://arxiv.org/abs/2510.13765v1)\n\n Photometric classification of Type Ia supernovae (SNe Ia) is critical for cosmological studies but remains difficult due to class imbalance and observational noise. While deep learning models have been explored, they are often resource-intensive and lack interpretability. We present a computationally efficient and interpretable classification framework that maintains high performance on imbalanced datasets. We emphasize the use of PR-AUC and F1-score as more informative metrics than ROC-AUC in severely imbalanced settings. Using an XGBoost ensemble optimized via Bayesian hyperparameter tuning, we classified light curves from the Supernova Photometric Classification Challenge (SPCC), comprising 21,318 events with a 3.19 imbalance ratio (non-Ia to Ia). Our model achieved a PR-AUC of $0.993^{+0.03}\\_{-0.02}$, an F1-score of $0.923 \\pm 0.008$, and a ROC-AUC of $0.976 \\pm 0.004$, matching or exceeding deep learning performance on precision-recall trade-offs while using fewer resources. Despite slightly lower overall accuracy, our method balances false positives and false negatives, improving the efficiency of spectroscopic follow-up. We show that optimized ensemble models offer a reproducible and lightweight alternative to complex architectures, particularly for large-scale surveys such as the Legacy Survey of Space and Time (LSST) where transparency and efficiency are essential.\n\n", "2510.13741": "2025-10-15, **Dynamics and Observational Signatures of Core-Collapse Supernovae with Central Engines: Hydrodynamics Simulations with Monte Carlo Post-Processing**, Kiran Eiden et.al., [2510.13741v1](http://arxiv.org/abs/2510.13741v1)\n\n A long-lived central engine embedded in expanding supernova ejecta can alter the dynamics and observational signatures of the event, producing an unusually luminous, energetic, and/or rapidly-evolving transient. We use two-dimensional hydrodynamics simulations to study the effect of a central energy source, varying the amount, rate, and isotropy of the energy deposition. We post-process the results with a time-dependent Monte Carlo radiation transport code to extract observational signatures. The engine excavates a bubble at the centre of the ejecta, which becomes Rayleigh-Taylor unstable. Sufficiently powerful engines are able to break through the edge of the bubble and accelerate, shred, and compositionally mix the entire ejecta. The breakout of the engine-driven wind occurs at distinct rupture points, and the outflowing high-velocity gas may eventually give rise to radio emission. The dynamical impact of the engine leads to faster rising optical light curves, with photon escape facilitated by the faster expansion of the ejecta and the opening of low-density channels. For models with strong engines, the spectra are initially hot and featureless, but later evolve to resemble those of broad-line Ic supernovae. Under certain conditions, line emission from ionized, low-velocity material near the centre of the ejecta may be able to escape and produce narrow emission similar to that seen in interacting supernovae. We discuss how variability in the engine energy reservoir and injection rate could give rise to a heterogeneous set of events spanning multiple observational classes, including the fast blue optical transients, broad-line Ic supernovae, and superluminous supernovae.\n\n", "2510.13629": "2025-10-15, **The Supernova 1987A system and its recent evolution - a review**, Michael J. Barlow et.al., [2510.13629v1](http://arxiv.org/abs/2510.13629v1)\n\n Supernova 1987A was the closest supernova event to be observed in nearly 400 years. The outflowing ejecta from the explosion continues to interact with extended circumstellar material and with the equatorial ring (ER) in the triple ring system, while observations of the system have continued across the whole electromagnetic spectrum. This review mainly focuses on works published over the past ten years on Supernova 1987A and its remnant. These include (a) submillimetre, infrared and X-ray studies of molecules, ions and dust in the ejecta, and (b) infrared, optical and X-ray studies of dust and ionized gas in the ER and in the surrounding circumstellar medium, including their time evolution as the ER is shocked and eroded by the impact of high velocity ejecta. Since 2022, the James Webb Space Telescope has become available for high angular resolution infrared observations of Supernova 1987A and has made significant contributions to both (a) and (b) above. Its discovery of redshifted narrow-line emission from multiple ion species located at the centre of the ejecta strongly requires the presence there of either a cooling hot neutron star, or a pulsar wind nebula, to power the emission.\n\n", "2510.13436": "2025-10-15, **Examining a new form of non-standard dark matter using DESI DR2 data**, Yan-Hong Yao et.al., [2510.13436v1](http://arxiv.org/abs/2510.13436v1)\n\n In this work, we propose a non-standard dark matter (NSDM) model in which the equation of state (EoS) of dark matter (DM) is parameterized as $w\\_{\\rm dm} = w\\_2 a^2$, and this DM model is motivated by the idea that DM must become cold dark matter (CDM) in the neighborhood of the scale factor $a = 0$, which implies that both the EoS of DM, $w\\_{\\rm dm}$, and its derivative with respect to the scale factor, ${\\rm d}w\\_{\\rm dm}/{\\rm d}a$, vanish at $a = 0$. By incorporating the latest cosmological datasets -- including the Planck2018 Cosmic Microwave Background (CMB) distance priors, the Baryon Acoustic Oscillation measurements from the Data Release 2 of the Dark Energy Spectroscopic Instrument (DESI), together with three independent Type Ia Supernova datasets, namely the Dark Energy Survey Year 5 (DESY5) compilation, the Union3 compilation, and the PantheonPlus sample -- we constrain the $\\Lambda w\\_2$DM, $ww\\_2$DM, and $w\\_0w\\_aw\\_2$DM models, which are constructed by replacing CDM with NSDM in the $\\Lambda $CDM, $w$CDM, and $w\\_0w\\_a$CDM models, respectively. We find that there is a preference for a negative DM EoS at more than the $3\\sigma$ confidence level for the data combinations CMB+DESI+Union3 and CMB+DESI+DESY5. Moreover, for all data combinations, replacing CDM with NSDM in the $w$CDM and $w\\_0w\\_a$CDM models significantly reduces the probability of violating the null energy condition. Furthermore, both $ww\\_2$DM and $w\\_0w\\_aw\\_2$DM are favored over $\\Lambda $CDM with a significance comparable to that of the $w\\_0w\\_a$CDM model.\n\n", "2510.13187": "2025-10-15, **Some problems associated with the standardization of the light curve of type 1a supernovae**, A. P. Mahtessian et.al., [2510.13187v1](http://arxiv.org/abs/2510.13187v1)\n\n We show that the parameters used to standardize the luminosity of Type 1a supernovae in the SALT2 and SiFTO models are strongly dependent on the redshift z. Consequently, when standardized with increasing z, the average absolute magnitudes of Type 1a supernovae are artificially increased. This means that for a given apparent magnitude they are, on average, assigned larger distances than they actually are, creating the appearance of their recession with acceleration and requiring the introduction of the concept of antigravity (dark energy) to explain it. We also show that after standardization, Type 1a supernovae cease to be standard candles. We therefore argue that such a standardization is not suitable for measuring the distances to Type 1a supernovae, and hence the accelerating expansion of the Universe is called into question.\n\n", "2510.13129": "2025-10-15, **Numerical Cosmology**, Romain Teyssier et.al., [2510.13129v1](http://arxiv.org/abs/2510.13129v1)\n\n In these lecture notes, we describe the current state-of-the-art for numerical simulations of large-scale structure and galaxy formation. Numerical simulations play a central role in the preparation and the exploitation of large-scale galaxy surveys, in which galaxies are the fundamental observational objects. We first describe basic methods for collisionless N-body dynamics that enable us to model dark matter accurately by solving the Vlasov-Poisson equations. We then discuss simple methods to populate dark matter halos with galaxies, such as Halo and Sub-halo Abundance Matching techniques and baryonification techniques for capturing baryonic effects on the matter distribution. We finally describe how to model the gas component by solving the Euler-Poisson equations, focusing on the foundational assumptions behind these equations, namely local thermo-dynamical equilibrium, and the nature of the truncation errors of the numerical scheme, namely numerical diffusion. We show a few examples of simulations of a Milky-Way-like halo without cooling, with cooling and with star formation. We finally describe different subgrid prescriptions recently developed to model star formation, supernovae feedback and active galactic nuclei and how they impact cosmological simulations.\n\n", "2510.13121": "2025-10-15, **Strong Progenitor Age-bias in Supernova Cosmology. II. Alignment with DESI BAO and Signs of a Non-Accelerating Universe**, Junhyuk Son et.al., [2510.13121v1](http://arxiv.org/abs/2510.13121v1)\n\n Supernova (SN) cosmology is based on the key assumption that the luminosity standardization process of Type Ia SNe remains invariant with progenitor age. However, direct and extensive age measurements of SN host galaxies reveal a significant (5.5{\\sigma}) correlation between standardized SN magnitude and progenitor age, which is expected to introduce a serious systematic bias with redshift in SN cosmology. This systematic bias is largely uncorrected by the commonly used mass-step correction, as progenitor age and host galaxy mass evolve very differently with redshift. After correcting for this age-bias as a function of redshift, the SN dataset aligns more closely with the w0waCDM model recently suggested by the DESI BAO project from a combined analysis using only BAO and CMB data. This result is further supported by an evolution-free test that uses only SNe from young, coeval host galaxies across the full redshift range. When the three cosmological probes (SNe, BAO, CMB) are combined, we find a significantly stronger (> 9{\\sigma}) tension with the {\\Lambda}CDM model than that reported in the DESI papers, suggesting a time-varying dark energy equation of state in a currently non-accelerating universe.\n\n", "2510.13070": "2025-10-15, **Galactic chemical evolution with the short-lived isotopes Mn-53, Fe-60, Hf-182, and Pu-244**, Benjamin Wehmeyer et.al., [2510.13070v1](http://arxiv.org/abs/2510.13070v1)\n\n We run a three-dimensional Galactic chemical evolution (GCE) model to follow the propagation of Mn-53 from supernovae of type Ia (SNIa), Fe-60 from core-collapse supernovae (CCSNe), Hf-182 from intermediate mass stars (IMSs), and Pu-244 from neutron star mergers (NSMs) in the Galaxy. We compare the GCE of these short-lived radioactive isotopes (SLRs) to recent detections on the deep-sea floor. We find that although these SLRs originate from different sites, they often arrive conjointly on Earth.\n\n", "2510.13015": "2025-10-14, **Exploring the connection between compact object mergers and fast X-ray transients: The cases of LXT 240402A & EP250207b**, R. L. Becerra et.al., [2510.13015v1](http://arxiv.org/abs/2510.13015v1)\n\n The connection between compact object mergers and some extragalactic fast X-ray transients (FXRTs) has long been hypothesized, but never ultimately established. In this work, we investigate two FXRTs, the LEIA X-ray Transient LXT\\,240402A and the Einstein Probe EP\\,250207b, whose precise positions lie close to nearby ($z\\!\\lesssim\\!0.1$) quiescent galaxies with negligible probability of chance coincidence, identifying them as particularly promising cases of merger-driven explosions in the local Universe. We used Chandra to derive accurate localizations for both events and secure otherwise ambiguous associations with their optical counterparts. Deep optical and near-infrared observations with VLT, GTC, and LBT were performed to characterize the surrounding environment and search for kilonova emission, the hallmark of neutron star mergers. Complementary early-time X-ray monitoring with Swift and Einstein Probe was used to constrain the non-thermal afterglow. We find that both FXRTs remain compatible with a compact binary merger progenitor, which produced low-mass ejecta and kilonova emission subdominant to the afterglow. However, alternative explanations such as a distant ($z\\!\\gtrsim\\!1$) core-collapse supernova cannot be conclusively ruled out.\n\n", "2510.12881": "2025-10-14, **Revealing evolution of Dark Energy density from observations**, José Blanco et.al., [2510.12881v1](http://arxiv.org/abs/2510.12881v1)\n\n We present a model--independent reconstruction of the normalized dark energy density function, $X(z) \\equiv \\rho\\_{\\mathrm{de}}(z)/\\rho\\_{\\mathrm{de}}(0)$, derived directly from the DES-SN5YR Type~Ia supernova sample. The analysis employs an inversion formalism that relates the derivative of the distance modulus, $\\mu^{\\prime}(z)$, to the expansion history, allowing the data to determine the shape of $X(z)$ without assuming a specific equation--of--state or dark energy density parameterization.   A statistically optimized binning of the supernova sample (using 17 intervals following the Freedman--Diaconis criterion and 34 following Scott's rule) ensures a stable estimation of $\\mu^{\\prime}(z)$ and a controlled propagation of uncertainties throughout the inversion process.   The resulting $X(z)$ remains statistically consistent with a constant value within one standard deviation across the entire redshift range, showing no significant evidence for an evolving dark energy component at present. In a direct comparison among $\\Lambda$CDM, CPL, and the quadratic $X^2(z)$ parameterization -- where CPL and $X^2(z)$ each introduce two additional free parameters relative to $\\Lambda$CDM -- the CPL model attains the best statistical agreement with the data, albeit only marginally and strictly within this restricted model set.   These outcomes indicate that current observations are compatible with an almost constant dark energy density ($w \\simeq -1$), while the inversion framework remains sensitive to subtle departures that forthcoming high--precision surveys could resolve.\n\n", "2510.12674": "2025-10-14, **Tycho supernova exploded inside a planetary nebula (SNIP)**, Noam Soker et.al., [2510.12674v1](http://arxiv.org/abs/2510.12674v1)\n\n I examine recent observations of the type Ia supernova remnant (SNR Ia) Tycho and conclude that Tycho is an SN Ia inside a planetary nebula (SNIP). The observations reveal two opposite protrusions, termed ears, projected on the main shell of Tycho. The pair of ear structures resembles that of the SNRs Ia Kepler, SNR G299-2.9, and SNR G1.9+0.3, which earlier studies considered as SNIPs. The requirement that the explosion occurs within hundreds of thousands of years after the formation of the planetary nebula (by the second star to evolve) makes the core-degenerate scenario the most likely for Tycho. Several other possible scenarios lead to an SNIP, but they are unlikely for Tycho. The identification of Tycho as an SNIP leads to two general conclusions. (1) The fraction of SNIPs among normal SNe Ia is very large, ~70-90%. Namely, the vast majority of normal SNe Ia are SNIPs. (2) To accommodate the large fraction of SNIPs, the delay time distribution of normal SNe Ia includes not only the stellar evolution timescale (as usually assumed), but also includes pockets of younger stellar populations in galaxies without ongoing star formation; the SNIPs come from the younger stellar populations in galaxies.\n\n", "2510.12627": "2025-10-14, **Alleviating the $H_0$ tension through new interacting dark energy model in light of DESI DR2**, Yi-Min Zhang et.al., [2510.12627v1](http://arxiv.org/abs/2510.12627v1)\n\n The $H\\_0$ tension has become one of the most significant challenges in modern cosmology. The recent DESI DR2 data has shown a significant preference for dynamical dark energy, yet this has further exacerbated the $H\\_0$ tension. In this work, we explore the potential of new interacting dark energy models ($\\widetilde{\\Lambda}$CDM and $e\\widetilde{\\Lambda}$CDM) to alleviate the $H\\_0$ tension. We perform observational constraints using the latest baryon acoustic oscillation data from DESI DR2, cosmic microwave background (CMB) data from Planck and Atacama Cosmology Telescop, and type Ia supernova data from DESY5 and PantheonPlus, as well as the SH0ES data. From our analysis, we observe the dynamical scale parameter of the cosmological constant, $\\delta\\_{\\Lambda} = -0.410^{+0.140}\\_{-0.120}$, in the $e\\widetilde{\\Lambda}$CDM model using the CMB+DESI+SH0ES data, which deviates from $\\Lambda$CDM at the $3.2\\sigma$ level. Due to the anti-correlation between $\\delta\\_{\\Lambda}$ and $H\\_0$, a negative $\\delta\\_{\\Lambda}$ results in a higher inferred $H\\_0$. Consequently, we obtain $H\\_0 = 71.90 \\pm 1.00~\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, reducing the $H\\_0$ tension to $0.8\\sigma$. Even without SH0ES, the CMB+DESI data alone still alleviate the $H\\_0$ tension to $1.7\\sigma$. Overall, the $e\\widetilde{\\Lambda}$CDM model not only deviates from the $\\Lambda$CDM model but also demonstrates a significant capability to alleviate the $H\\_0$ tension.\n\n", "2510.12562": "2025-10-14, **Modeling gamma-ray signatures of particle acceleration in stellar clusters from GeV to PeV**, A. Inventar et.al., [2510.12562v1](http://arxiv.org/abs/2510.12562v1)\n\n Young massive stellar clusters (YMSCs) have recently regained interest as PeVatron candidates, potentially accounting for the cosmic-ray (CR) knee as alternatives to isolated supernova remnants (SNRs). LHAASO's unique capability to detect photons above 0.1 PeV, hence tracing multi-PeV CRs, can provide critical constraints on galactic acceleration models when combined with H.E.S.S. and Fermi-LAT data. We investigate the transport of particles from YMSCs acceleration sites, namely wind termination shocks (WTS) or embedded SNRs, to nearby dense molecular clouds where proton-proton interactions produce high-energy gamma rays. We determine the necessary conditions, such as the distance between the acceleration site and the target, or the cluster's power and age, for detectable gamma-ray excesses and identify viable systems through parameter space exploration. By comparing with observations, we can constrain key physical parameters including WTS efficiency, diffusion coefficient and injection slope. Our analysis also examines whether some of LHAASO's unidentified sources might correspond to such cluster-cloud systems.\n\n", "2510.12491": "2025-10-14, **A Catalog of Filaments in the Central Molecular Zone**, Richard G. Arendt et.al., [2510.12491v1](http://arxiv.org/abs/2510.12491v1)\n\n We present a catalog of 1.28 GHz radio filaments observed by MeerKAT over the innermost 200 pc of the Galaxy (roughly $\\pm 1.5\\deg$), which includes the central molecular zone (CMZ). The catalog is generated by repurposing software developed for the automated detection of filaments in solar coronal loops. There are two parts to the catalog. The first part, the main catalog, provides a point-by-point listing of locations and basic observational properties along each detected filament. The second part is a summary catalog which provides a listing of mean, median, or total values of various properties for each filament. Tabulated quantities include position, length, curvature, brightness, and spectral index. The catalogs contain a heterogeneous mix of filamentary structures, including nonthermal radio filaments (NRFs), and parts of supernova remnants (SNRs) and thermally emitting regions (e.g. H II regions). We discuss criteria for selecting useful subsamples of filaments from the catalogs, and some of the details encountered in examining filaments or selections of filaments from the catalogs.\n\n", "2510.12203": "2025-10-14, **Computational advances and challenges in simulations of turbulence and star formation**, Christoph Federrath et.al., [2510.12203v1](http://arxiv.org/abs/2510.12203v1)\n\n We review recent advances in the numerical modeling of turbulent flows and star formation. An overview of the most widely used simulation codes and their core capabilities is provided. We then examine methods for achieving the highest-resolution magnetohydrodynamical turbulence simulations to date, highlighting challenges related to numerical viscosity and resistivity. State-of-the-art approaches to modeling gravity and star formation are discussed in detail, including implementations of star particles and feedback from jets, winds, heating, ionization, and supernovae. We review the latest techniques for radiation hydrodynamics, including ray tracing, Monte Carlo, and moment methods, with comparisons between the flux-limited diffusion, moment-1, and variable Eddington tensor methods. The final chapter summarizes advances in cosmic-ray transport schemes, emphasizing their growing importance for connecting small-scale star formation physics with galaxy-scale evolution.\n\n", "2510.12197": "2025-10-14, **Violent mergers can explain the inflated state of some of the fastest stars in the Galaxy**, Aakash Bhat et.al., [2510.12197v1](http://arxiv.org/abs/2510.12197v1)\n\n A significant number of hypervelocity stars with velocities between $1500-2500$ km/s have recently been observed. The only plausible explanation so far is that they have been produced through thermonuclear supernovae in white dwarf binaries. Since these stars are thought to be surviving donors of Type Ia supernovae, a surprising finding was that these stars are inflated, with radii an order of magnitude more than expected for Roche-lobe filling donors. Recent attempts at explaining them have combined 3-dimensional hydrodynamical supernova explosion simulations with 1-dimensional stellar modelling to explain the impact of supernova shocks on runaway white dwarfs. However, only the hottest and most compact of those runaway stars can so far marginally be reproduced by detailed models of runaways from supernova explosions. In this and a companion paper, we introduce a new \\textsc{Arepo} simulation of two massive CO white dwarfs that explode via a violent merger. There, the primary white dwarf ignites when the secondary is on its last orbit and plunging towards the primary. In the corresponding aftermath, the core of the secondary white dwarf of 0.16 M$\\_\\odot$, remains bound, moving at a velocity of $\\sim2800$ km/s. We map this object into MESA, and show that this runaway star can explain the observations of two hypervelocity stars that were dubbed D6-1 and D6-3 based on their original discovery motivated by the D6 scenario, though the violent merger scenario presented here is somewhat distinct from the D6 scenario.\n\n", "2510.12079": "2025-10-14, **Short-Lived Radioisotopic enrichment from AGB interlopers in low-mass star-forming regions**, Joseph W. Eatson et.al., [2510.12079v1](http://arxiv.org/abs/2510.12079v1)\n\n The decay of Short-Lived Radioisotopes (SLRs) can be a significant source of heating early in protoplanetary systems, though how a protoplanetary disk becomes enriched with these SLRs far above the galactic background level remains an open question. Observational evidence suggests that this enrichment occurs during the period from when the disk forms to when it progresses into a protoplanetary system, and is homogenous throughout the resultant planetary system. Whilst SLRs such as 26Al and 60Fe can be injected into disks through interaction with Wolf-Rayet winds and supernovae, these outflows can disrupt disks, and in the case of low-mass star-forming regions high-mass stars may not form at all. Recent research has determined the existence of AGB ``interlopers'', Asymptotic Giant Branch stars that pass close to or through star-forming regions that could be an alternative source of SLR enrichment to WR winds and supernovae. In this paper we study the effect of AGB interlopers on star-forming regions from a dynamical perspective, determining the enrichment amount of 26Al and 60Fe in disks within small clusters via numerous N-body simulations via a parameter space exploration. We find that enrichment is widespread from AGB stars, with efficient enrichment dependent on the time at which the interloper intersects the star-forming region. Velocity is a factor, though interlopers travelling at 30 km/s are capable of enriching many disks in a star-forming region assuming they encounter a disk when the interloper is more evolved.\n\n"}}