{"neutrino": {"2410.23258": "2024-10-30, **Subphotospheric Emission from Short Gamma-Ray Bursts. II.~Signatures of Non-Thermal Dissipation in the Multi-Messenger Signals**, Annika Rudolph et.al., [2410.23258v1](http://arxiv.org/abs/2410.23258v1)\n\n Building on a general relativistic magnetohydrodynamic simulation of a short gamma-ray burst (sGRB) jet with initial magnetization $\\sigma\\_0=150$, propagating through the dynamical ejecta from a binary neutron star merger, we identify regions of energy dissipation driven by magnetic reconnection and collisionless sub-shocks within different scenarios. We solve the transport equations for photons, electrons, protons, neutrinos, and intermediate particles up to the photosphere, accounting for all relevant radiative processes, including electron and proton acceleration, and investigate the potential impact of magnetic reconnection occurring in different regions along the jet. We find the photon spectra undergo non-thermal modifications below the photosphere, observable in both on-axis and off-axis emission directions, as well as across different scenarios of energy dissipation and subsequent particle acceleration. Interestingly, the spectral index of the photon energy distribution can at most vary by $\\sim20\\%$ across all different dissipation scenarios. Depending on the dissipation mechanism at play, neutrino signatures may accompany the photon signal, pointing to efficient proton acceleration and shedding light on jet physics. Although our findings are based on one jet simulation, they point to a potential universal origin of the non-thermal features of the Band spectrum observed in sGRBs.\n\n", "2410.23257": "2024-10-30, **Right-handed interactions in puzzling $B$-decays**, Damir Bečirević et.al., [2410.23257v1](http://arxiv.org/abs/2410.23257v1)\n\n We explain the difference between the measured decay widths of $b \\to c \\tau \\nu$ processes and of $B\\to K\\nu\\bar{\\nu}$ and their values predicted in the Standard Model by introducing the right-handed interactions both to quarks and to leptons. At low energy scales, in addition to the Standard Model particles, we assume the presence of an additional neutral lepton (right-handed neutrino). We then show a specific realization of such a scenario in a model with a single scalar leptoquark ($S\\_1$), and discuss the corresponding phenomenology.\n\n", "2410.23098": "2024-10-30, **Measurements of hadron production in 90 GeV/c proton-carbon interactions**, H. Adhikary et.al., [2410.23098v1](http://arxiv.org/abs/2410.23098v1)\n\n This paper presents the multiplicity of neutral and charged hadrons produced in 90 GeV$/c$ proton-carbon interactions from a dataset taken by the NA61/SHINE experiment in 2017. Particle identification via dE/dx was performed for the charged hadrons $\\pi^\\pm$, $K^\\pm$, and $p / \\bar{p}$; the neutral hadrons $K^0\\_S$, $\\Lambda$, and $\\bar{\\Lambda}$ were identified via an invariant mass analysis of their decays to charged hadrons. Double-differential multiplicity results as a function of laboratory momentum and polar angle are presented for each particle species; these results provide vital constraints on the predicted neutrino beam flux for current and future long-baseline neutrino oscillation experiments.\n\n", "2410.23014": "2024-10-30, **Impact of scalar NSI with off-diagonal parameters at DUNE and P2SO**, Sambit Kumar Pusty et.al., [2410.23014v1](http://arxiv.org/abs/2410.23014v1)\n\n In this paper, we studied the impact of the off-diagonal SNSI parameters in the future long-baseline neutrino oscillation experiments DUNE and P2SO. In our analysis, we found that the sensitivities of these experiments altered in a very non-trivial way due to the presence of these parameters. Depending on the values of these parameters, they can either completely mimic the standard scenario or can wash out their CP sensitivity. For large values of parameters $\\eta\\_{e\\mu}$ and $\\eta\\_{e\\tau}$, we obtained larger mass ordering and octant sensitivities as compared to the standard three flavour scenario. For the parameter $\\eta\\_{\\mu\\tau}$, the mass ordering sensitivity and the precision of $\\Delta m^2\\_{31}$ deteriorated compared to the standard scenario. Our results also showed that the sensitivities significantly influenced by the phases of the off-diagonal parameters.\n\n", "2410.22945": "2024-10-30, **Broad-band, high-gain, low-frequency Antennas for Radio Detection of Earth-skimming Tau Neutrinos**, Tim Huege et.al., [2410.22945v1](http://arxiv.org/abs/2410.22945v1)\n\n A promising approach to detect high-energy tau neutrinos is through the measurement of impulsive radio emission from horizontal air showers initiated in the Earth's atmosphere. Observations at frequencies between 30 and 80 MHz seem particularly promising -- if high-gain antennas focused at the horizon and blocking out as much as possible of the noisy sky are employed. Due to the large wavelengths, however, designing an antenna with the required properties is highly non-trivial at such low frequencies. In this article, we explore suitable antenna designs that provide the desired high gain, possess a smooth beam, are insensitive to ground conditions, are easily impedance-matched over the wide band, and are mechanically simple for deployment in large numbers in inaccessible terrain. In particular, we consider the \"rhombus\" antenna design for both horizontally and vertically polarized radiation a very attractive option for tau neutrino detection efforts in the atmosphere with the radio technique.\n\n", "2410.22878": "2024-10-30, **High Energy Neutrino Studies in the forward direction with FASER experiment at the LHC**, Osamu Sato et.al., [2410.22878v1](http://arxiv.org/abs/2410.22878v1)\n\n The FASER experiment studies the neutral decay products from LHC collision of 13.6 TeV centre of mass energy at 480m distant away. There could be Beyond Standard Model (BSM) particles such like dark photons or axion like particles etc.., and also high energy neutrinos. The neutrino target is an Emulsion Cloud Chamber with tungsten plates who can measure all three neutrino flavours with clear separation. Recently, FASER has measured the muon and electron neutrino cross-section with a nucleon as $ \\sigma(\\nu\\_{e} + N) = 1.2^{+0.8}\\_{-0.7}\\times 10^{-38} cm^{2}/GeV$ and $ \\sigma(\\nu\\_{\\mu} + N) = 0.5 \\pm{0.2}\\times 10^{-38} cm^{2}/GeV$ in the unexplored energy region of a few hundred GeV to a few TeV so far.\n\n", "2410.22835": "2024-10-30, **Revisiting the model for radiative neutrino masses with dark matter in the $\\mathrm{U(1)}_{B-L}$ gauge theory**, Shinya Kanemura et.al., [2410.22835v1](http://arxiv.org/abs/2410.22835v1)\n\n The radiative seesaw model with gauged $\\mathrm{U(1)}\\_{B-L}\\times\\mathbb{Z}\\_2$ extension is a well-motivated scenario which gives consistent predictions of active neutrino masses and the abundance of dark matter. Majorana masses of right-handed neutrinos, the lightest of which can be identified as dark matter, are given by the spontaneous breaking of the $\\mathrm{U(1)}\\_{B-L}$ gauge symmetry. We revisit this model with the latest constraints from dark matter searches, neutrino oscillations, flavor experiments and collider experiments. We explore the feasible parameter space of this model, and find that there are still allowed regions under the latest experimental constraints. We present new viable benchmark scenarios for this model, i.e., the right-handed neutrino dark matter scenario and the scalar dark matter scenario. We also mention the testability of these benchmark scenarios at future experiments.\n\n", "2410.22781": "2024-10-30, **A New Particle Pusher with Hadronic Interactions for Modeling Multimessenger Emission from Compact Objects**, Minghao Zou et.al., [2410.22781v1](http://arxiv.org/abs/2410.22781v1)\n\n We propose novel numerical schemes based on the Boris method in curved spacetime, incorporating both hadronic and radiative interactions for the first time. Once the proton has lost significant energy due to radiative and hadronic losses, and its gyroradius has decreased below typical scales on which the electromagnetic field varies, we apply a guiding center approximation (GCA). We fundamentally simulate collision processes either with a Monte-Carlo method or, where applicable, as a continuous energy loss, contingent on the local optical depth. To test our algorithm for the first time combining the effects of electromagnetic, gravitational, and radiation fields including hadronic interactions, we simulate highly relativistic protons traveling through various electromagnetic fields and proton backgrounds. We provide unit tests in various spatially dependent electromagnetic and gravitational fields and background photon and proton distributions, comparing the trajectory against analytic results. We propose that our method can be used to analyze hadronic interactions in black hole accretion disks, jets, and coronae to study the neutrino abundance from active galactic nuclei.\n\n", "2410.22333": "2024-10-29, **Hypothesis tests and model parameter estimation on data sets with missing correlation information**, Lukas Koch et.al., [2410.22333v1](http://arxiv.org/abs/2410.22333v1)\n\n Ideally, all analyses of normally distributed data should include the full covariance information between all data points. In practice, the full covariance matrix between all data points is not always available. Either because a result was published without a covariance matrix, or because one tries to combine multiple results from separate publications. For simple hypothesis tests, it is possible to define robust test statistics that will behave conservatively in the presence on unknown correlations. For model parameter fits, one can inflate the variance by factor to ensure that things remain conservative at least up to a chosen confidence level. This paper describes a class of robust test statistics for simply hypothesis tests, as well as an algorithm to determine the necessary inflation factor model parameter fits. It then presents some example applications of the methods to real neutrino interaction data and model comparisons.\n\n", "2410.21956": "2024-10-29, **Testing tree level TeV scale tyep-I and type-II seesaw scenarios in $μ$TRISTAN**, Arindam Das et.al., [2410.21956v1](http://arxiv.org/abs/2410.21956v1)\n\n We investigate TeV scale type-I and type-II seesaw scenarios at the tree level at the $\\mu^+ e^-$ and $\\mu^+ \\mu^+$ colliders in the $\\mu$TRISTAN experiment. In minimal type-I seesaw scenario we consider two generations of Standard Model (SM) singlet heavy Majorana type Right Handed Neutrinos (RHNs) which couples with SM gauge boson through light-heavy neutrino mixing. We consider a minimal scenario where one (other) generation of the RHN dominantly couples with electron (muon). Generating events for the signal and generic SM backgrounds for the final states $e^- \\nu jj$ and $\\mu^+ \\nu jj$ from $\\mu^+ e^-$ collision at $\\sqrt{s}=346$ GeV and 1 ab$^{-1}$ luminosity, we estimate limits on the light-heavy neutrino mixing angles with respect to heavy neutrino mass for two generations of the heavy neutrinos. Comparing with the existing limits we find such limits could be two orders of magnitude stronger than electroweak precision data. Further, we study the effect of doubly charged scalar boson $(H^{++})$ from the type-II seesaw scenario in $\\mu^+ \\mu^+$ collision at $\\sqrt{s}=2$ TeV. In this case we consider $\\mu^+ \\mu^+ \\to \\ell\\_i^+ \\ell\\_j^+$ and $\\mu^+ \\mu^+ \\to H^{++} Z/ \\gamma$ processes followed by the same sign dilepton decay of $H^{++}$. We find that events involving $e^+ e^+$ among these final states could provide significant difference between the normal and inverted orderings of the neutrino mass which could be probed in $\\mu$TRISTAN collider at 5$\\sigma$ significance in future.\n\n", "2410.21945": "2024-10-29, **Rapid cooling of the Cassiopeia A neutron star due to superfluid quantum criticality**, Hao-Fu Zhu et.al., [2410.21945v1](http://arxiv.org/abs/2410.21945v1)\n\n The rapid cooling of the neutron star in Cassiopeia A is speculated to arise from an enhanced neutrino emission caused by the onset of $^3P\\_2$-wave neutron superfluidity in the core. However, the neutrino emissivity due to Cooper-pair breaking and formation is too small to yield the observed cooling rate. Here, we show that such a rapid cooling can be explained once the non-Fermi liquid behavior of the non-superfluid neutron liquid induced by superfluid quantum criticality is included into the theoretical description of neutron star cooling, without assuming the existence of additional energy loss processes. Our results indicate that the neutron star in Cassiopeia A remains in the thermal relaxation stage, which is greatly prolonged by the non-Fermi liquid behavior. The good agreement between our theoretical results and recent observational cooling data points to the pivotal role played by superfluid quantum criticality in neutron stars.\n\n", "2410.21925": "2024-10-29, **Redshift-Space Distortion constraints on neutrino mass and models to alleviate the Hubble tension**, Yo Toda et.al., [2410.21925v1](http://arxiv.org/abs/2410.21925v1)\n\n We discuss the neutrino mass and Hubble tension solutions and examine their effects on the Redshift-Space Distortion (RSD) observations. An analysis with RSD data indicates smaller amplitude of perturbation. Including RSD data results in a slightly weaker upper limit on the neutrino mass than that derived for data without RSD, which is common in other extended models too. We have evaluated the impacts of RSD observations on some extended models, including the varying electron mass model, a time-dependent dark energy model with two parameter equations of state (EOS), and a model where the number of neutrino species is free. When we estimate the cosmological parameters for data including RSD, we found that the EOS parameter for dark energy is larger than that of the cosmological constant, and the effective number of neutrino species is smaller than the standard value, which infers a smaller present Hubble parameter $H\\_0$. From the viewpoint of cosmological tensions, the varying electron mass model with non-zero neutrino mass option looks promising to relax the Hubble tension and the $S\\_8$ tension simultaneously.\n\n", "2410.21881": "2024-10-29, **Neutrino detection rates from lepto-hadronic model simulations of bright blazar flares**, Joshua Robinson et.al., [2410.21881v1](http://arxiv.org/abs/2410.21881v1)\n\n There is mounting evidence that blazars are the sources of part of the very-high-energy astrophysical neutrino flux detected by IceCube. In particular, there have been several spatial and temporal coincidences of individual IceCube neutrino events with flaring blazars, the most prominent of them being IceCube-170922A, coincident with a multi-wavelength flare of TXS~0506+056. Motivated by this, we used the time-dependent lepto-hadronic code OneHaLe to model the spectral energy distributions and light curves of a sample of bright $\\gamma$-ray flares of blazars detected by Fermi-LAT, for which Kreter et al. (2020) provided calorimetric estimates of the expected neutrino detection rates. Flares were modelled with temporal changes of the proton injection spectra. Our analysis shows that the calorimetric approach overestimates the increase in neutrino production by a factor of typically $\\sim 10$ if the $\\gamma$-ray emission is dominated by proton-synchrotron radiation.\n\n", "2410.21850": "2024-10-29, **Quantum coherence between mass eigenstates of a neutrino can be destroyed by its mass-momentum entanglement**, Shi-Biao Zheng et.al., [2410.21850v2](http://arxiv.org/abs/2410.21850v2)\n\n If a neutrino or antineutrino produced in the decay of an unstable particle is not entangled to its accompanying particles, its mass is necessarily correlated with its momentum. In this note, I illustrate this entanglement would destroy the quantum coherence between the neutrino's mass eigenstates in both the momentum and position representations, which was overlooked by other authors in previous investigations of entanglement and coherence associated with neutrino oscillations.\n\n", "2410.21843": "2024-10-29, **A more novel approach of radiative linear seesaw in a modular $A_4$ symmetry**, Takaaki Nomura et.al., [2410.21843v1](http://arxiv.org/abs/2410.21843v1)\n\n We propose a radiatively induced linear seesaw model that is perfectly realized at leading order by a modular $A\\_4$ symmetry. Because this group also has a flavor symmetry, we obtain some predictions concentrating on two specific regions at nearby fixed points $\\tau=\\omega$ and $i$. Through our numerical chi square analysis, we show predictions for each the case depending on the neutrino mass ordering; normal and inverted one.\n\n"}, "dark matter": {"2410.23019": "2024-10-30, **High Precision Astrometry Science in the Context of Space Mission Prospectives**, Fabien Malbet et.al., [2410.23019v1](http://arxiv.org/abs/2410.23019v1)\n\n Astrometry is one of the oldest branches of astronomy which measures the position, the proper motion and parallax of celestial objects. Following the Hipparcos and Gaia missions that have measured several billions of them using global astrometry, we propose to increase astrometry precision on pointed objects using differential astrometry in a large field in order to unravel rocky planets in habitable zones of stars in the Sun vicinity and investigate the nature of dark matter in galactic environments as recommended by the ESA Senior Committee in the Voyager 2050 prospective. Substantial technology developments in a number of critical areas is needed in order to reach the highest required precision of sub-micro-arcsecond. One of them is CMOS image sensors using the stitching technique to merge the multiple design structures on the wafer and produce array with very large number of pixels. Another one is to calibrate the pixel positions using projecting modulating interferometric laser fringes on the array. Finally, the distortion of the optical system can be monitored and compensated using reference stars as metrology sources. The final precision depends on the diameter and the field of view of the telescope that is used as well as the time spent on each target. We present here the science goals that can be achieved with such missions either within the framework of an ESA Medium-class mission or even in the NASA most challenging Habitable Worlds Observatory, a large space telescope recommended by the American Astronomy and Astrophysics prospective for the 2020s and designed specifically to search for signs of life on planets orbiting other stars.\n\n", "2410.22863": "2024-10-30, **Impact of extreme ultraviolet radiation on the scintillation of pure and xenon-doped liquid argon**, P. Agnes et.al., [2410.22863v1](http://arxiv.org/abs/2410.22863v1)\n\n The Xenon-Argon Technology (X-ArT) collaboration presents a study on the dynamics of pure and xenon-doped liquid argon (LAr) scintillation. Using two types of silicon photomultipliers sensitive to different wavelength ranges, we identify a long-lived extreme ultraviolet (EUV) radiative component that enhances the light yield. This component is present in both pure and xenon-doped LAr, becoming more pronounced at higher xenon concentrations, where it complements the traditional collisional energy transfer process. To explain this mechanism, we develop a comprehensive model of the Xe-doped LAr scintillation process that integrates both collisional and radiative contributions. Additionally, we investigate how xenon doping affects LAr scintillation light yield and pulse shape discrimination. Finally, we hypothesize that the EUV component may explain the emission of spurious electrons, a known challenge in light dark matter searches using noble liquids. By characterizing the scintillation dynamics in Xe-doped LAr, identifying the long-lived EUV component, and exploring the potential origin of spurious electrons, this work lays the groundwork for optimizing detector performance and advancing the design and sensitivity of future noble liquids particle detectors.\n\n", "2410.22702": "2024-10-30, **Beyond Hawking evaporation of black holes formed by dark matter in compact stars**, Ujjwal Basumatary et.al., [2410.22702v1](http://arxiv.org/abs/2410.22702v1)\n\n The memory burden effect is an explicit resolution to the information paradox by which an evaporating black hole acquires quantum hair, which then suppresses its rate of mass loss with respect to the semi-classical Hawking rate. We show that this has significant implications for particle dark matter that captures in neutron stars and forms black holes that go on to consume the host star. In particular, we show that constraints on the nucleon scattering cross section and mass of spin-0 and spin-1/2 dark matter would be extended by several orders of magnitude.\n\n", "2410.22433": "2024-10-29, **Graphene calorimetric single-photon detector**, Bevin Huang et.al., [2410.22433v1](http://arxiv.org/abs/2410.22433v1)\n\n Single photon detectors (SPDs) are essential technology in quantum science, quantum network, biology, and advanced imaging. To detect the small quantum of energy carried in a photon, conventional SPDs rely on energy excitation across either a semiconductor bandgap or superconducting gap. While the energy gap suppresses the false-positive error, it also sets an energy scale that can limit the detection efficiency of lower energy photons and spectral bandwidth of the SPD. Here, we demonstrate an orthogonal approach to detect single near-infrared photons using graphene calorimeters. By exploiting the extremely low heat capacity of the pseudo-relativistic electrons in graphene near its charge neutrality point, we observe an electron temperature rise up to ~2 K using a hybrid Josephson junction. In this proof-of-principle experiment, we achieve an intrinsic quantum efficiency of 87% (75%) with dark count < 1 per second (per hour) at operation temperatures as high as 1.2 K. Our results highlight the potential of electron calorimetric SPDs for detecting lower-energy photons from the mid-IR to microwave regimes, opening pathways to study space science in far-infrared regime, to search for dark matter axions, and to advance quantum technologies across a broader electromagnetic spectrum.\n\n", "2410.22412": "2024-10-29, **Predicting the Dark Matter -- Baryon Abundance Ratio**, Abhishek Banerjee et.al., [2410.22412v1](http://arxiv.org/abs/2410.22412v1)\n\n We discuss relaxation solutions to the dark matter - baryon coincidence problem in the context of QCD axion dark matter. In relaxation solutions, a moduli dynamically adjusts the mass of dark matter and baryons until their energy densities are $\\mathrm{O}(1)$ the same. Because the QCD axion is heavily connected to QCD, scanning the QCD axion mass inherently also scans the proton mass. In the context of relaxation solutions, this implies that the ratio of dark matter to baryon abundances ($\\Omega\\_{\\rm DM}/\\Omega\\_{\\rm B}$) is a ratio of beta functions showing that these models can only accommodate discrete values of $\\Omega\\_{\\rm DM}/\\Omega\\_{\\rm B}$ thereby ``predicting\" the ratio of the dark matter to baryon abundances. The original composite axion model has only a single integer degree of freedom $N$, the size of the gauge group, and we show that when $N=8$ the observed value of $\\Omega\\_{\\rm DM}/\\Omega\\_{\\rm B} = 5.36$ is reproduced to within its percent level error bars. Novel tests of this model include more precise measurements of $\\Omega\\_{\\rm DM}/\\Omega\\_{\\rm B}$, a better lattice determination of the dependence of the proton mass on the high energy QCD gauge coupling, as well as more traditional tests such as fifth force experiments.\n\n", "2410.22413": "2024-10-29, **Eliminating Incoherent Noise: A Coherent Quantum Approach in Multi-Sensor Dark Matter Detection**, Jing Shu et.al., [2410.22413v1](http://arxiv.org/abs/2410.22413v1)\n\n We propose a novel dark matter detection scheme by leveraging quantum coherence across a network of multiple quantum sensors. This method effectively eliminates incoherent background noise, thereby significantly enhancing detection sensitivity. This is achieved by performing a series of basis transformation operations, allowing the coherent signal to be expressed as a combination of sensor population measurements without introducing background noise. We present a comprehensive analytical analysis and complement it with practical numerical simulations. These demonstrations reveal that signal strength is enhanced by the square of the number of sensors, while noise, primarily due to operational infidelity rather than background fluctuations, increases only linearly with the number of sensors. Our approach paves the way for next-generation dark matter searches that optimally utilize an advanced network of sensors and quantum technologies.\n\n", "2410.22409": "2024-10-29, **Scalar relics from the hot Big Bang**, David Cyncynates et.al., [2410.22409v1](http://arxiv.org/abs/2410.22409v1)\n\n In this Letter, we motivate the fact that couplings between a scalar field and the Standard Model with strengths $10^{-6}(m\\_\\phi/{\\rm eV})^{-1/4}$ relative to gravity yield the total measured cosmological dark matter abundance over a broad mass range of $10^{-12}$ to $10^{14}\\ \\rm{eV}$. Remarkably, this result holds with minimal sensitivity to whether the scalar couples to electrons, photons, hadrons, or other particles at laboratory energy scales, thereby linking fifth force experiments to the search for dark matter.\n\n", "2410.22406": "2024-10-29, **WALLABY Pilot Survey: Star Formation Enhancement and Suppression in Gas-rich Galaxy Pairs**, Qifeng Huang et.al., [2410.22406v1](http://arxiv.org/abs/2410.22406v1)\n\n Galaxy interactions can significantly affect the star formation in galaxies, but it remains a challenge to achieve a consensus on the star formation rate (SFR) enhancement in galaxy pairs. Here, we investigate the SFR enhancement of gas-rich galaxy pairs detected by the Widefield ASKAP L-band Legacy All-sky Blind surveY (WALLABY). We construct a sample of 278 paired galaxies spanning a stellar mass ($M\\_\\ast$) range from $10^{7.6}$ to $10^{11.2}M\\_\\odot$. We obtain individual masses of atomic hydrogen (HI) for these paired galaxies, using a novel deblending algorithm for HI data cubes. Quantifying the interaction stages and strengths with parameters motivated by first principles, we find that at fixed stellar and HI mass, the alteration in SFR of galaxy pairs starts when their dark matter halos encounter. For galaxies with stellar mass lower than $10^9M\\_\\odot$, their SFRs show tentative suppression of 1.4 sigma after the halo encounter, and then become enhanced when their HI disks overlap, regardless of mass ratios. In contrast, the SFRs of galaxies with $M\\_\\ast > 10^9M\\_\\odot$ increase monotonically toward smaller projected distances and radial velocity offsets. When a close companion is present, a pronounced SFR enhancement is found for the most HI-poor high-mass galaxies in our sample. Collecting the observational evidence, we provide a coherent picture of the evolution of galaxy pairs, and discuss how the tidal effects and hydrodynamic processes shape the SFR enhancement. Our results provide a coherent picture of gas-rich galaxy interactions and impose constraints on the underlying physical processes.\n\n", "2410.22252": "2024-10-29, **Spin Trio: a dark matter scenario**, Mohammad Hossein Rahimi Abkenar et.al., [2410.22252v1](http://arxiv.org/abs/2410.22252v1)\n\n We investigate a beyond Standard Model (SM) featuring four new fields. Three fields with different spins - scalar ($ S $), spinor ($ \\psi $), and vector ($ V\\_{\\mu} $) - together form the three-component dark matter (DM), while the fourth scalar field ($ \\phi $) carries a unit charge under a dark $ U\\_{D}(1) $ gauge symmetry, enabling SM-DM interactions via the Higgs portal. Although the model maintains classical scale invariance, loop effects break electroweak symmetry. The parameter space is constrained by scale invariance, DM relic density, and direct detection results. Our study aims to identify feasible model regions and evaluate detectability in future experiments. We analyze processes like DM annihilations, semi-annihilations, and conversions, integrating them into Boltzmann equations to calculate DM abundances. Random parameter scans reveal regions compatible with current data, including constraints from direct detection experiments like XENONnT and PandaX-4T . Our results show the model's viability across a broad range of DM masses.\n\n", "2410.22185": "2024-10-29, **Cosmological evolution of dark matter subhaloes under tidal stripping by growing Milky Way-like galaxies**, Yudai Kazuno et.al., [2410.22185v1](http://arxiv.org/abs/2410.22185v1)\n\n We present the findings of a comprehensive and detailed analysis of merger tree data from ultra-high-resolution cosmological $N$-body simulations. The analysis, conducted with a particle mass resolution of $5 \\times 10^3 h^{-1} M\\_{\\odot}$ and a halo mass resolution of $10^7 h^{-1} M\\_{\\odot}$, provides sufficient accuracy to suppress numerical artefacts. This study elucidates the dynamical evolution of subhaloes associated with the Milky Way-like host haloes. Unlike more massive dark matter haloes, which have been extensively studied, these subhaloes follow a distinct mass evolution pattern: an initial accretion phase, followed by a tidal stripping phase where mass is lost due to the tidal forces of the host halo. The transition from accretion to stripping, where subhaloes reach their maximum mass, occurs around a redshift of $z\\simeq1$. Smaller subhaloes reach this point earlier, while larger ones do so later. Our analysis reveals that over 80 per cent of subhaloes have experienced mass loss, underscoring the universality of tidal stripping in subhalo evolution. Additionally, we derived the eccentricities and pericentre distances of subhalo orbits from the simulations and compare them with those of nearby satellite galaxies observed by the Gaia satellite. The results demonstrate a significant alignment between the orbital elements predicted by the cold dark matter model and the observed data, providing robust support for the model as a credible candidate for dark matter.\n\n", "2410.22168": "2024-10-29, **Ultraheavy multiscattering dark matter: DUNE, CYGNUS, kilotonne detectors, and tidal streams**, Harsh Aggarwal et.al., [2410.22168v1](http://arxiv.org/abs/2410.22168v1)\n\n In direct searches of dark matter, multi-scatter signatures are now being sought to probe scattering cross sections that are large enough to make the detector optically thick to incident particles. We provide some significant updates to the multi-scatter program. Using considerations of energy deposition, we derive the reaches in cross section and mass of various proposed large-volume detectors: a kilotonne fiducial mass \"module of opportunity\" at DUNE, a kilotonne xenon detector suggested for neutrinoless double beta decay, the gaseous detector CYGNUS, and the dark matter detectors XLZD and Argo. Where the velocity vector can be reconstructed event-by-event, the Galactic dark matter velocity distribution may be inferred. We exploit this to show that halo substructure such as tidal streams can be picked up if they make up about 10% of the local dark matter density.\n\n", "2410.22094": "2024-10-29, **Dark Radiation production in axion misalignment mechanisms and the cosmological tensions**, José María Pérez-Poyatos et.al., [2410.22094v1](http://arxiv.org/abs/2410.22094v1)\n\n We investigate the production of dark radiation (DR) from axions and axion-like particles (ALPs) as potential origins of dark matter. Focusing on the dark matter misalignment mechanism, we examine non-thermal, pre-inflationary scenarios that could lead to the generation of DR. A key part of our analysis involves a Bayesian approach to confront ALP parameter space with current cosmological data. Additionally, we explore how DR production could offer solutions to persistent cosmological anomalies, particularly those related to the Hubble constant $H\\_0$ tension and the $S\\_8$ parameter discrepancy. Our findings aim to shed new light on the role of ALPs in addressing these open issues in cosmology.\n\n", "2410.22072": "2024-10-29, **Prospects for Axion Dark Matter Searches at LISA-like Interferometers**, Yue-Hui Yao et.al., [2410.22072v1](http://arxiv.org/abs/2410.22072v1)\n\n Axion or axion-like particle has been one of the leading candidates for dark matter. Due to its tiny coupling with photon, axion dark matter in the background can induce distinct phase velocities of light with different parity, an effect known as axion-induced birefringence. Here, we propose a modification to the polarization state of the inter-spacecraft laser link in LISA-like interferometers in space to make them sensitive to this birefringence effect. We discuss the prospects of using Sagnac combinations to search for axion dark matter and derive the corresponding sensitivity. With this setup, we show that next-generation laser interferometers in space would have great sensitivities on the axion-photon coupling with axion mass around $10^{-19}~\\text{eV}\\sim 10^{-14}~\\text{eV}$.\n\n", "2410.21874": "2024-10-29, **Invisible Higgs decay from dark matter freeze-in at stronger coupling**, Oleg Lebedev et.al., [2410.21874v2](http://arxiv.org/abs/2410.21874v2)\n\n We study the Higgs boson decay into dark matter (DM) in the framework of freeze-in at stronger coupling. Even though the Higgs-DM coupling is significant, up to order one, DM does not thermalize due to the Boltzmann suppression of its production at low temperatures. We find that this mechanism leads to observable Higgs decay into invisible final states with the branching fraction of 10% and below, while producing the correct DM relic abundance. This applies to the DM masses down to the MeV scale, which requires a careful treatment of the hadronic production modes. For DM masses below the muon threshold, the Boltzmann suppression is not operative and the freeze-in nature of the production mechanism is instead guaranteed by the smallness of the electron Yukawa coupling. As a result, MeV DM with a significant coupling to the Higgs boson remains non-thermal as long as the reheating temperature does not exceed $\\mathcal{O}(100)\\;$MeV. Our findings indicate that there are good prospects for observing light non-thermal DM via invisible Higgs decay at the LHC and FCC.\n\n", "2410.21777": "2024-10-29, **Scalar dark matter multiplet of global $O(N)$ symmetry**, U-Rae Kim et.al., [2410.21777v1](http://arxiv.org/abs/2410.21777v1)\n\n We study two types of models involving a scalar dark matter multiplet of global $O(N)$ symmetry. These models are distinguished by the absence (Type I) or presence (Type II) of a scalar mediator with $Z\\_{2}$ symmetry. We derive the allowed regions for the dark matter mass and new scalar couplings based on constraints from Higgs invisible decay, the relic abundance of dark matter, and the spin-independent dark matter-nucleon scattering cross section. Within the allowed parameter space, we also discuss the vacuum stability of the Higgs potential and the perturbativity of the scalar couplings in both models. We find that the Type I model cannot achieve stable electroweak vacuum, whereas the Type II model can have both a stable vacuum and perturbative couplings up to the Planck scale.\n\n", "2410.21718": "2024-10-29, **Detection of Dark Matter using levitated nanoparticles within a Bessel-Gaussian beam via Yukawa coupling**, Iftekher S. Chowdhury et.al., [2410.21718v1](http://arxiv.org/abs/2410.21718v1)\n\n We present a novel experimental approach to detect dark matter by probing Yukawa interactions, commonly referred to as a fifth force, between dark matter and baryonic matter. Our method involves optically levitating nanoparticles within a Bessel-Gaussian beam to detect minute forces exerted by potential dark matter interaction with test masses. The non-diffracting properties of Bessel-Gaussian beams, combined with feedback cooling techniques, provide exceptional sensitivity to small perturbations in the motion of the nanoparticles. This setup allows for precise control over trapping conditions and enhances the detection sensitivity to forces on the order of \\(10^{-18}\\) N. We explore the parameter space of the Yukawa interaction, focusing on the coupling strength (\\(\\alpha\\)) and interaction range (\\(\\lambda\\)), and discuss the potential of this experiment to place new constraints on dark matter couplings, complementing existing direct detection methods.\n\n"}, "supernova": {"2410.23190": "2024-10-30, **Diffusive shock acceleration of dust grains at supernova remnants**, P. Cristofari et.al., [2410.23190v1](http://arxiv.org/abs/2410.23190v1)\n\n Diffusive shock acceleration (DSA) is a prominent mechanism for energizing charged particles up to very large rigidities at astrophysical collisionless shocks. In addition to ions and electrons, it has been proposed that interstellar dust grains could also be accelerated through diffusive shock acceleration, for instance, at supernova remnants (SNRs). Considering interstellar dust grains of various size and composition, we investigate the possibility of grain acceleration at young SNR shocks (throughout the free expansion and Sedov-Taylor phases) and the maximum energies reached by the accelerated grains. We investigate the potential implications on the abundance of refractory species relative to volatile elements in the cosmic-ray composition. We rely on semi-analytical descriptions of particle acceleration at strong shocks, and on self-similar solutions for the dynamics of SNR shock waves. For simplicity, type Ia thermonuclear SNRs expanding in uniform interstellar medium are considered. We find that the acceleration of dust grains at relativistic speed is possible, up to Lorentz factor of $\\sim 10^{2}$, kinetic energy $E\\_{\\rm k}/\\text{nuc}\\sim 10^2$ GeV/nuc for the smaller grains of size $a\\sim 5 \\times 10^{-7}$ cm. We find that the subsequent sputtering of grains can produce nuclei with a rigidity sufficient to be injected in the process of diffusive shock acceleration. Such scenario can help naturally account for the overabundance of refractory elements in the Galactic cosmic-ray composition, provided that a fraction $\\eta \\sim 10^{-3}-10^{-2}$ of dust grains swept up by a SNR are energized through DSA.\n\n", "2410.23167": "2024-10-30, **Massive star evolution models incorporating $α$-enhanced composition -- I. BPASS Single star models**, Conor M Byrne et.al., [2410.23167v1](http://arxiv.org/abs/2410.23167v1)\n\n Stellar evolution modelling is fundamental to many areas of astrophysics including stellar populations in both nearby and distant galaxies. It is heavily influenced by chemical composition. Observations of distant galaxies and nucleosynthesis calculations show that $\\alpha$-process elements are enriched faster than iron group elements. We present a dense grid of single-star models calculated using the BPASS stellar evolution code and covering masses ($0.1\\le\\mathrm{M/M}\\_\\odot\\le316$), metallicity mass fractions ($10^{-5} \\le Z \\le 0.04$) and $\\alpha$-to-iron abundance ratios ($-0.2\\le[\\alpha/\\mathrm{Fe}]\\le+0.6$). By comparing Solar-scaled models to ones enriched in $\\alpha$-process elements, we find that stellar radii, surface temperatures, Main Sequence lifetimes, supernova progenitor properties and supernova rates are all sensitive to changes in [$\\alpha$/Fe]. Lifetimes of low-mass stars differ by up to 0.4 dex, while surface temperatures of massive stars at the end of the Main Sequence also differ by around 0.4 dex. Inferred supernova rates when [Fe/H] is unknown can be highly uncertain. Models with different [$\\alpha$/Fe] but comparable iron abundances show smaller variations, indicating that while iron primarily defines the course of evolution; $\\alpha$-enhancement nonetheless has an impact of up to 0.1 dex on stellar properties. Such changes are small for individual stars, but have a large cumulative effect when considering an entire stellar population as demonstrated by isochrone fitting to nearby clusters. Changes in radii and lifetimes have further consequences for a stellar population including binary stars, as they influence the timing, nature and occurrence rate of mass transfer events.\n\n", "2410.23093": "2024-10-30, **Differentiable Conservative Radially Symmetric Fluid Simulations and Stellar Winds -- jf1uids**, Leonard Storcks et.al., [2410.23093v1](http://arxiv.org/abs/2410.23093v1)\n\n We present jf1uids, a one-dimensional fluid solver that can, by virtue of a geometric formulation of the Euler equations, model radially symmetric fluid problems in a conservative manner, i.e., without losing mass or energy. For spherical problems, such as ideal supernova explosions or stellar wind-blown bubble expansions, simulating only along a radial dimension drastically reduces compute and memory demands compared to a full three-dimensional method. This simplification also alleviates constraints on backpropagation through the solver. Written in JAX, jf1uids is a GPU-compatible and fully differentiable simulator. We demonstrate the advantages of this differentiable physics simulator by retrieving the wind's parameters for an adiabatic stellar wind expansion from the final fluid state using gradient descent. As part of a larger \"stellar winds, cosmic rays and machine learning\" research track, jf1uids serves as a solid foundation to be extended with additional physics modules, foremost cosmic rays and a neural-net powered gas-cooling surrogate and improved by higher order and more accurate numerical schemes. All code is available under https://github.com/leo1200/jf1uids/.\n\n", "2410.22580": "2024-10-29, **Supernova Shocks in Molecular Clouds: Shocks Driven into Dense Cores in IC 443 and 3C 391**, William T. Reach et.al., [2410.22580v1](http://arxiv.org/abs/2410.22580v1)\n\n Supernova shocks into dense molecular cores in IC 443 (clumps B, C, and G) and 3C 391 were observed using the Stratospheric Observatory for Infrared Astronomy and complemented by archival data from the Herschel Space Observatory. The pure rotational transitions 0-0 S(1) and S(5) of H2, and the ground-state 110-101 transition of H2O, are all broadened, arising from molecules that survive the passage of the shock front. Theoretical models from the Paris-Durham shock code were analyzed to generate synthetic profiles that approximately match the observations. The observations can be fit with two shock conditions, which approximate the range of densities in the pre-shock molecular cloud. The width and brightness of the S(5) lines require shocks into gas with a density of order 2,000 cm-3, into which the IC 443 blast wave drives shocks with speed 60 km/s. The brightness and narrower width of the S(1) lines requires different shocks, into gas with density of order 10^5 cm-3, with shock speeds of 10 km/s. The H2O velocity distribution is also consistent with these shocks. The existence of shocks into dense gas shows that the bright shocked clumps in IC~443 were prestellar cores. It is unlikely that they will form stars soon after the passage of the shock front, given the input of kinetic and thermal energy from the shocks.\n\n", "2410.22416": "2024-10-29, **ERGO-ML: A continuous organization of the X-ray galaxy cluster population in TNG-Cluster with contrastive learning**, Urmila Chadayammuri et.al., [2410.22416v1](http://arxiv.org/abs/2410.22416v1)\n\n The physical properties of the intracluster medium (ICM) reflect signatures of the underlying gravitational potential, mergers and strong interactions with other halos and satellite galaxies, as well as galactic feedback from supernovae and supermassive black holes (SMBHs). Traditionally, clusters have been characterized in terms of summary statistics, such as halo mass, X-ray luminosity, cool-core state, luminosity of AGN, and number of merging components. In this paper of the Extracting Reality from Galaxy Observables with Machine Learning series (ERGO-ML), we instead consider the full information content available in maps of X-ray emission from the ICM. We employ Nearest Neighbour Contrastive Learning (NNCLR) to identify and populate a low-dimensional representation space of such images. Using idealized X-ray maps of the 352 clusters of the TNG-Cluster cosmological magnetohydrodynamical simulation suite, we take three orthogonal projections of each cluster at eight snapshots within the redshift range $0\\leq z<1$, resulting in a dataset of $\\sim$8,000 images. Our findings reveal that this representation space forms a continuous distribution from relaxed to merging objects, and from centrally-peaked to flat emission profiles. The representation also exhibits clear trends with redshift, with halo, gas, stellar, and SMBH mass, with time since a last major merger, and with indicators of dynamical state. We show that an 8-dimensional representation can be used to predict a variety of cluster properties, find analogs, and identify correlations between physical properties, thereby suggesting causal relationships. Our analysis demonstrates that contrastive learning is a powerful tool for characterizing galaxy clusters from their images alone, allowing us to derive constraints on their physical properties and formation histories using cosmological hydrodynamical galaxy simulations.\n\n", "2410.22401": "2024-10-29, **Fast Transients from Magnetic Disks Around Non-Spinning Collapsar Black Holes**, Justin Bopp et.al., [2410.22401v1](http://arxiv.org/abs/2410.22401v1)\n\n Most black holes (BHs) formed in collapsing stars have low spin, though some are expected to acquire a magnetic accretion disk during the collapse. While such BH disks can launch magnetically driven winds, their physics and observational signatures have remained unexplored. We present global 3D general relativistic magnetohydrodynamic simulations of collapsing stars that form slowly spinning BHs with accretion disks. As the disk transitions to a magnetically arrested state, it drives mildly relativistic, wobbling, collimated magnetic outflows through two mechanisms: steady outflows along vertical magnetic field lines (''Blandford-Payne jets'') and magnetic flux eruptions. With an isotropic-equivalent energy of $E\\_{\\rm iso}\\approx10^{52}\\,{\\rm erg}$, exceeding that of relativistic jets from BHs with spin $a\\lesssim 0.25$, the disk outflows unbind the star, ultimately capping the final BH mass at $ M\\_{\\rm BH} \\approx 4\\,M\\_\\odot$. Once the outflows emerge from the star, they produce mildly relativistic shock breakout, cooling, and $^{56}{\\rm Ni}$-decay emission. Our cooling emission estimates suggest a bright near-ultraviolet and optical signal at absolute magnitude $M\\_{\\rm AB}\\approx-16$ lasting for several days. This indicates that disk winds could be responsible for the first peak in the double-peaked light curves observed in Type Ib/c supernovae (SNe) or power another class of transients. The detection rate in the upcoming Rubin Observatory and ULTRASAT/UVEX will enable us to differentiate between competing models for the origin of the first SN peak and provide constraints on the physics and formation rate of accretion disks in core-collapse SNe.\n\n", "2410.22396": "2024-10-29, **The 10 pc Neighborhood of Habitable Zone Exoplanetary Systems: Threat Assessment from Stellar Encounters & Supernovae**, Tisyagupta Pyne et.al., [2410.22396v1](http://arxiv.org/abs/2410.22396v1)\n\n The habitability of a planet is influenced by both its parent star and the properties of its local stellar neighborhood. Potential threats to habitability from the local stellar environment mainly arise from two factors: cataclysmic events such as powerful stellar explosions and orbital perturbations induced by close stellar encounters. Among the 4,500+ exoplanet-hosting stars, about 140+ are known to host planets in their habitable zones. In this study, we use \\textit{Gaia DR3} data to investigate the 10~pc stellar neighborhood of the 84 habitable zone systems (HZS) closest to the Sun. We assess the possible risks that local stellar environment of these HZS pose to their habitability. In particular, we find that HD~165155 has a high stellar density around it, making it likely to experience at least one flyby encounter within a span of 5~Gyr. We also identified two high-mass stars ($M \\geq 8 M\\_\\odot$) as potential progenitors of supernovae, which could threaten the long-term survivability of habitable zone systems HD~48265 and TOI-1227. Further, to quantify the similarity between habitable zone stars and the Sun, as well as their respective 10~pc stellar environments, we employ various astrophysical parameters to define a Solar Similarity Index (SSI) and a Neighborhood Similarity Index (NSI). Our analysis suggests that HD~40307 exhibits the closest resemblance to the solar system, while HD~165155 shows the least resemblance.\n\n", "2410.22276": "2024-10-29, **Non-LTE Synthetic Observables of a Multidimensional Model of Type Ia Supernovae**, Samuel J. Boos et.al., [2410.22276v1](http://arxiv.org/abs/2410.22276v1)\n\n Many promising explosion models for the elusive origin of Type Ia supernovae (SNe Ia) ultimately fail to completely reproduce a number of observed properties of these events. One limiting factor for many of these models is the use of the local thermodynamic equilibrium (LTE) assumption in the calculation of their synthetic observables, which has been shown to prevent the accurate prediction of a number of fundamental features of SNe Ia. The inclusion of high-accuracy non-LTE physics, however, increases computational cost and complexity such that multidimensional non-LTE calculations are often unfeasible, which can be problematic for models that are inherently multidimensional. In this work, we conduct radiative transfer calculations using 1D profiles that each correspond with a line of sight from an asymmetric, 2D SN Ia model. We find, in LTE, that the synthetic observables from these calculations efficiently reproduce those from the 2D calculation when an equivalence of bolometric luminosities between the 1D and 2D treatments is enforced. This allows for the accurate calculation of synthetic observables in 1D while still preserving multidimensional effects associated with the model. We leverage this to produce high accuracy observables from 1D non-LTE calculations, showing significantly improved agreement with observation, including a roughly 50% reduction of $B$-band decline rate into congruence with the observed Phillips relation. Additionally, our non-LTE observables show Si II $\\lambda$5972 pEWs that are much more similar to observation, while spanning multiple Branch classes, suggesting that some spectral classifications of SNe Ia arise from line of sight effects.\n\n", "2410.22138": "2024-10-29, **On the Ubiquity of Extreme Baryon Concentrations in the Early Universe**, Alvio Renzini et.al., [2410.22138v2](http://arxiv.org/abs/2410.22138v2)\n\n Early JWST observations have revealed the ubiquitous presence in the early Universe, up to z about 16, of extreme baryon concentrations, namely forming globular clusters, extremely dense galaxies that may or may not be UV bright, and supermassive black holes in relatively low-mass galaxies. This paper is trying to pinpoint which physical conditions may have favored the formation of such concentrations, that appear to be very common at high redshifts while their formation being progressively more and more rare at lower redshifts. Building on local globular cluster evidence, it is argued that such conditions can consist in a combination of a 10 Myr extended feedback free time, coupled to low angular-momentum densities in deep local minima of the ISM vorticity field, where baryon concentrations are more likely to form. It is argued that the former condition would follow from more massive stars failing to explode as supernovae, and the latter one from low vorticity prevailing in the early Universe, in contrast to later times with their secular increase of the angular momentum density due to the cumulative effect of tidal interactions.\n\n", "2410.22073": "2024-10-29, **SN 1885A and supernova remnants in the centre of M31 with LOFAR**, Deepika Venkattu et.al., [2410.22073v1](http://arxiv.org/abs/2410.22073v1)\n\n We present the first LOFAR image of the centre of M31 at a frequency of 150 MHz. We clearly detect three supernova remnants, which, along with archival VLA data at 3 GHz and other published radio and X-ray data allows us to characterize them in detail. Our observations also allow us to obtain upper limits the historical SN 1885A which is undetected even at a low frequency of 150 MHz. From analytical modelling we find that SN 1885A will stay in its free-expansion phase for at least another couple of centuries. We find an upper limit of $n\\_{\\rm H}~\\lesssim 0.04$ cm$^{-3}$ for the interstellar medium of SN 1885A, and that the SN ejecta density is not shallower than $\\propto r^{-9}$ (on average). From the $2.6\\sigma$ tentative detection in X-ray, our analysis shows that non-thermal emission is expected to dominate the SN 1885A emission. Comparing our results with those on G1.9+0.3, we find that it is likely that the asymmetries in G1.9+0.3 make it a more efficient radio and X-ray emitter than SN 1885A. For Braun 80, 95 and 101, the other remnants in this region, we estimate ages of 5200, 8100, and 13,100 years, and shock speeds of 1150, 880, and 660 km s$^{-1}$}, respectively. Based on this, the supernova rate in the central 0.5 kpc $\\times$ 0.6 kpc of M31 is at least one per $\\sim 3000~{\\rm yr}$. We estimate radio spectral indices of $-0.66\\pm0.05$, $-0.37\\pm0.03$ and $-0.50\\pm0.03$ for the remnants, respectively, which match fairly well with previous studies.\n\n", "2410.21980": "2024-10-29, **Impact of cosmology dependence of baryonic feedback in weak lensing**, Pranjal R. S. et.al., [2410.21980v2](http://arxiv.org/abs/2410.21980v2)\n\n Robust modeling of non-linear scales is critical for accurate cosmological inference in Stage IV surveys. For weak lensing analyses in particular, a key challenge arises from the incomplete understanding of how non-gravitational processes, such as supernovae and active galactic nuclei - collectively known as baryonic feedback - affect the matter distribution. Several existing methods for modeling baryonic feedback treat it independently from the underlying cosmology, an assumption which has been found to be inaccurate by hydrodynamical simulations. In this work, we examine the impact of this coupling between baryonic feedback and cosmology on parameter inference at LSST Y1 precision. We build mock 3$\\times$2pt data vectors using the Magneticum suite of hydrodynamical simulations, which span a wide range of cosmologies while keeping subgrid parameters fixed. We perform simulated likelihood analyses for two baryon mitigation techniques: (i) the Principal Component Analysis (PCA) method which identifies eigenmodes for capturing the effect baryonic feedback on the data vector and (ii) HMCode2020 (Mead et al. 2021) which analytically models the modification in the matter distribution using a halo model approach. Our results show that the PCA method is robust to the coupling between cosmology and baryonic feedback, whereas, when using HMCode2020 there can be up to $0.5\\sigma$ bias in $\\Omega\\_\\text{m}$-$S\\_8$. For HMCode2020, the bias also correlates with the input cosmology while for PCA we find no such correlation.\n\n", "2410.21828": "2024-10-29, **The Proper Motion of the High Galactic Latitude Pulsar Calvera**, Michela Rigoselli et.al., [2410.21828v1](http://arxiv.org/abs/2410.21828v1)\n\n Calvera (1RXS J141256.0+792204) is a pulsar of characteristic age 285 kyr at a high Galactic latitude of b=+37{\\deg}, detected only in soft thermal X-rays. We measure a new and precise proper motion for Calvera using Chandra HRC-I observations obtained 10 years apart. We also derive a new phase-connected ephemeris using 6 years of NICER data, including the astrometric position and proper motion as fixed parameters in the timing solution. Calvera is located near the center of a faint, circular radio ring that was recently discovered by LOFAR and confirmed as a supernova remnant (SNR) by the detection of gamma-ray emission with Fermi/LAT. The proper motion of $78.5 \\pm 2.9$ mas/yr at position angle $241{\\deg}.3 \\pm 2{\\deg}.2$ (in Galactic coordinates) points away from the center of the ring, a result which differs markedly from a previous low-significance measurement, and greatly simplifies the interpretation of the SNR/pulsar association. It argues that the supernova indeed birthed Calvera <10 kyr ago, with an initial spin period close to its present value of 59 ms. The tangential velocity of the pulsar depends on its uncertain distance, $v\\_t=(372 \\pm 14) d\\_{1 kpc}$ km/s, but is probably dominated by the supernova kick, while its progenitor could have been a runaway O or B star from the Galactic disk.\n\n"}}