{"neutrino": {"2407.07878": "2024-07-10, **The Cosmological Preference for Negative Neutrino Mass**, Daniel Green et.al., [2407.07878v1](http://arxiv.org/abs/2407.07878v1)\n\n The most precise determination of the sum of neutrino masses from cosmological data, derived from analysis of the cosmic microwave background (CMB) and baryon acoustic acoustic oscillations (BAO) from the Dark Energy Spectroscopic Instrument (DESI), favors a value below the minimum inferred from neutrino flavor oscillation experiments. We explore which data is most responsible of this puzzling aspect of the current constraints on neutrino mass and whether it is related to other anomalies in cosmology. We demonstrate conclusively that the preference for negative neutrino masses is a consequence of larger than expected lensing of the CMB in both the two- and four-point lensing statistics. Furthermore, we show that this preference is robust to changes in likelihoods of the BAO and CMB optical depth analyses given the available data. We then show that this excess clustering is not easily explained by changes to the expansion history and is likely distinct from the preference for for dynamical dark energy in DESI BAO data. Finally, we discuss how future data may impact these results, including an analysis of Planck CMB with mock DESI 5-year data. We conclude that the negative neutrino mass preference is likely to persist even as more cosmological data is collected in the near future.\n\n", "2407.07813": "2024-07-10, **Dispersive determination of the fourth generation lepton masses**, Hsiang-nan Li et.al., [2407.07813v1](http://arxiv.org/abs/2407.07813v1)\n\n We continue our previous determination of the masses of the sequential fourth generation quarks in an extension of the Standard Model, and predict the mass $m\\_4$ ($m\\_L$) of the fourth generation neutrino $\\nu\\_4$ (charged lepton $L$) by solving the dispersion relation associated with heavy fermion decays. The results $m\\_4\\approx 170$ GeV and $m\\_L\\approx 270$ GeVare extracted from the dispersive analyses of the $t\\to d e^+\\nu\\_4$ and $L^-\\to \\nu\\_1 \\bar t d$ decay widths, respectively, where $t$ ($d$, $e^+$, $\\nu\\_1$) denotes a top quark (down quark, positron, light neutrino). The predictions are then cross-checked by examining the $L^-\\to \\nu\\_4 \\bar u d$ decay, $\\bar u$ being an anti-up quark. It is shown that the fourth generation leptons with the above masses survive the current experimental bounds from Higgs boson decays into photon pairs and from the oblique parameters. We also revisit how the existence of the fourth generation leptons impacts the dispersive constraints on the neutrino masses and the Pontecorvo-Maki-Nakagawa-Sakata (PMNS) matrix elements. It is found that the unitarity of the $3\\times 3$ PMNS matrix holds well up to corrections of $O(m\\_\\nu^2/m\\_W^2)$, $m\\_\\nu$ ($m\\_W$) being a light neutrino (the $W$ boson) mass, whose mixing angles and $CP$ phase prefer the values $\\theta\\_{12}\\approx 34^\\circ$, $\\theta\\_{23}\\approx 46^\\circ$, $\\theta\\_{13}\\approx 4^\\circ$ and $\\delta\\approx 235^\\circ$ in the normal-ordering scenario for neutrino masses. On the contrary, the unitarity of the $3\\times 3$ Cabibbo-Kobayashi-Maskawa matrix is violated at the level $m\\_b^2/m\\_W^2\\sim 10^{-3}$, $m\\_b$ being the $b$ quark mass, as the same formalism is applied to the quark mixing.\n\n"}, "dark matter": {"2407.07839": "2024-07-10, **Galactic Halos and rotating bosonic dark matter**, Jorge Castelo Mourelle et.al., [2407.07839v1](http://arxiv.org/abs/2407.07839v1)\n\n Rotating bosonic dark matter halos are considered as potential candidates for modeling dark matter in galactic halos. These bosonic dark matter halos can be viewed as a dilute and very extended version of bosonic stars, and the methods used for the calculation and analysis of the latter objects can be directly applied. Bosonic stars, a hypothetical type of astrophysical objects, are categorized into two primary families, based on the nature of the particles composing them: Einstein-Klein-Gordon stars and Proca stars. We examine various models from both families and the rotation curves which their contribution induces in different galaxies, to identify the most plausible candidates that explain the flattening of orbital velocities observed in galactic halos. By exploring different combinations of our dark matter models with observable galactic features, we propose an interesting source to compensate for the apparent lack of matter in dwarf and spiral galaxies, providing a possible explanation for this longstanding astronomical puzzle.\n\n", "2407.07770": "2024-07-10, **Challenges in modeling the dark matter halo of NGC 1052-DF2: Cored versus cuspy halo models**, K. Aditya et.al., [2407.07770v1](http://arxiv.org/abs/2407.07770v1)\n\n The discovery of NGC 1052-DF2 and subsequent modeling have shown that NGC 1052-DF2 is deficient in dark matter and is in conflict with the standard stellar-to-halo mass ratio. In this work, we aim to resolve the degeneracy between the dynamical models on the mass estimate of the NGC 1052-DF2.We constructed mass models of NGC 1052-DF2 using an anisotropic distribution function with a radially varying anisotropy parameter and studied the effect of the various model parameters on the dark matter estimates. We used the observed stellar photometry as an input parameter to construct the distribution function and employed a Markov Chain Monte Carlo (MCMC) method to estimate the dark matter model parameters.We find that mass models with a cuspy dark matter halo have comparable $\\chi^{2}$ to models with zero dark matter. Moreover, the cuspy dark matter halo fails to consistently account for the observed velocity dispersion in the inner and outer regions of the galaxy. Consequently, we rule out the possibility of a cuspy dark matter halo for describing the mass models of NGC 1052 - DF2. Our study shows that the cored dark matter halo model with a total mass of $\\log(M\\_{DM}/M\\_{\\odot})=10.5$ explains the observed kinematics but requires an extraordinarily large scale length (20kpc) and an outer cutoff radius (26kpc). While the cored mass model provides a comparatively better fit, our findings emphasize that the mass models are largely unconstrained by the available kinematic data. Our results suggest that NGC 1052 - DF2 may not only have an ultra-diffuse stellar distribution but that it can, within uncertainties in the available kinematic data, potentially host an ultra-diffuse dark matter distribution compatible with the standard stellar-to-halo mass relation (SHMR) predicted by galaxy formation and evolution models\n\n", "2407.07769": "2024-07-10, **HSTPROMO Internal Proper Motion Kinematics of Dwarf Spheroidal Galaxies: I. Velocity Anisotropy and Dark Matter Cusp Slope of Draco**, Eduardo Vitral et.al., [2407.07769v1](http://arxiv.org/abs/2407.07769v1)\n\n We analyze four epochs of HST imaging over 18 years for the Draco dwarf spheroidal galaxy. We measure precise proper motions (PMs) for hundreds of stars and combine these with existing line-of-sight (LOS) velocities. This provides the first radially-resolved 3D velocity dispersion profiles for any dwarf galaxy. These constrain the intrinsic velocity anisotropy and resolve the mass-anisotropy degeneracy. We solve the Jeans equations in oblate axisymmetric geometry to infer the mass profile. We find the velocity dispersion to be radially anisotropic along the symmetry axis and tangentially anisotropic in the equatorial plane, with a globally-averaged value $\\overline{\\beta\\_{\\mathrm B}}=-0.20^{+ 0.28}\\_{- 0.53}$, (where $1 - \\beta\\_{\\mathrm B} \\equiv \\langle v\\_{\\mathrm{ tan}}^2 \\rangle / \\langle v\\_{\\mathrm{ rad}}^2 \\rangle$ in 3D). The logarithmic dark matter (DM) density slope over the observed radial range, $\\Gamma\\_{\\mathrm{ dark}}$, is $-0.83^{+ 0.32}\\_{- 0.37}$, consistent with the inner cusp predicted in $\\Lambda$CDM cosmology. As expected given Draco's low mass and ancient star formation history, it does not appear to have been dissolved by baryonic processes. We rule out cores larger than 487, 717, 942 pc at respective 1-, 2-, 3-$\\sigma$ confidence, thus imposing important constraints on the self-interacting DM cross-section. Spherical models yield biased estimates for both the velocity anisotropy and the inferred slope. The circular velocity at our outermost data point (900 pc) is $24.19^{+ 6.31}\\_{- 2.97} \\ \\mathrm{km~s^{-1}}s$. We infer a dynamical distance of $75.37^{+ 4.73}\\_{- 4.00}$ kpc, and show that Draco has a modest LOS rotation, with $\\left<v / \\sigma \\right> = 0.22 \\pm 0.09$. Our results provide a new stringent test of the so-called `cusp-core' problem that can be readily extended to other dwarfs.\n\n"}, "supernova": {"2407.07583": "2024-07-10, **Extended gamma-ray emission from particle escape in pulsar wind nebulae -- Application to HESS J1809-193 and HESS J1825-137**, Pierrick Martin et.al., [2407.07583v1](http://arxiv.org/abs/2407.07583v1)\n\n There is growing evidence from gamma-ray observations at high and very high energies that particle escape is a key aspect shaping the morphological properties of pulsar wind nebulae (PWNe) at various evolutionary stages. We aim to provide a simple model for the gamma-ray emission from these objects including the transport of particles across the different components of the system. We applied it to sources HESS J1809-193 and HESS J1825-137. We developed a multi-zone framework applicable to dynamically young PWNe, taking into account the diffusive escape of relativistic electron-positron pairs out of the nebula into the parent supernova remnant (SNR) and their confinement downstream of the magnetic barrier of the forward shock until an eventual release into the surrounding interstellar medium (ISM). For a wide range of turbulence properties in the nebula, the GeV-TeV inverse-Compton radiation from pairs that escaped into the remnant can be a significant if not dominant contribution to the emission from the system. It may dominate the pion-decay radiation from cosmic rays accelerated at the forward shock and advected downstream of it. In the TeV-PeV range, the contribution from particles escaped into the ISM can exceed by far that of the SNR+PWN components. Applied to HESS J1809-193 and HESS J1825-137, we found that spatially extended GeV-TeV emission components can be accounted for mostly from particles escaped into the ISM, while morphologically more compact components above 50-100TeV are ascribed to the PWNe. In these two cases, the model suggests high turbulence in the nebula and a forward shock accelerating cosmic rays up to ~100TeV at most. The model provides the temporal and spectral properties of the flux of particles originally energized by the pulsar wind and ultimately released in the ISM. (Abridged).\n\n", "2407.07509": "2024-07-10, **The contribution of winds of star clusters to the Galactic cosmic-ray population**, Giada Peron et.al., [2407.07509v1](http://arxiv.org/abs/2407.07509v1)\n\n Cosmic rays are energetic nuclei that permeate the entire Galactic disk. Their existence requires the presence of powerful particle accelerators. While Galactic supernova explosions may supply the required energy, there is growing evidence that they cannot explain all of the observed properties of cosmic rays, such as their maximum particle energy and isotopic composition. Among Galactic objects, winds from stellar clusters meet the energetic requirement and provide a suitable environment for particle acceleration. The recent detection of some of these objects in gamma rays confirms that they indeed harbor high-energy particles.However, as most supernovae explode inside stellar clusters, it is difficult to distinguish the contribution of winds to particle acceleration. Here we report the detection of young star clusters in the nearby Vela molecular ridge star forming region. The young age of the systems guarantees an unbiased estimate of the stellar CR luminosity free from any supernova or pulsar contamination and allows us to draw conclusions on the acceleration efficiency and the total power supplied by these objects. We demonstrate that much more than 1% of the wind mechanical power is converted into CRs and consequently conclude that a small but non-negligible fraction ~ 1-10% of the CR population is contributed by stellar clusters.\n\n", "2407.07417": "2024-07-10, **High $γ$-ray escape time in 2003fg-like supernovae: A challenge to proposed models**, Amir Sharon et.al., [2407.07417v1](http://arxiv.org/abs/2407.07417v1)\n\n A rare subclass of Type Ia supernovae (SNe Ia), named after the prototype SN 2003fg, includes some of the brightest SNe Ia, often called \"super Chandrasekhar-mass\" SNe Ia. We calculate the $\\gamma$-ray deposition histories and the $^{56}$Ni mass synthesized in the explosion, $M\\_\\mathrm{Ni56}$, for eight 2003fg-like SNe. Our findings reveal that the $\\gamma$-ray escape time, $t\\_0$, for these objects is $ t\\_0\\approx45\\text{-}60 \\,$ days, significantly higher than that of normal SNe Ia. 2003fg-like SNe are distinct from normal SNe Ia in the $ t\\_0 $-$ M\\_\\mathrm{Ni56} $ plane, with a noticeable gap between the two populations. The observed position of 2003fg-like SNe in this plane poses a significant challenge for theoretical explosion models. We demonstrate that the merger of two white dwarfs (WDs) and a single star exceeding the Chandrasekhar limit fail to reproduce the observed $ t\\_0 $-$ M\\_\\mathrm{Ni56} $ distribution. However, preliminary calculations of head-on collisions of massive WDs show agreement with the observed $ t\\_0 $-$ M\\_\\mathrm{Ni56} $ distribution.\n\n", "2407.07336": "2024-07-10, **Testing the cosmic distance duality relation using strong gravitational lensing time delays and Type Ia supernovae**, Jing-Zhao Qi et.al., [2407.07336v1](http://arxiv.org/abs/2407.07336v1)\n\n We present a comprehensive test of the cosmic distance duality relation (DDR) using a combination of strong gravitational lensing (SGL) time delay measurements and Type Ia supernovae (SNe Ia) data. We investigate three different parameterizations of potential DDR violations. To bridge the gap between SGL and SNe Ia datasets, we implement an artificial neural network (ANN) approach to reconstruct the distance modulus of SNe Ia. Our analysis uniquely considers both scenarios where the absolute magnitude of SNe Ia ($M\\_B$) is treated as a free parameter and where it is fixed to a Cepheid-calibrated value. Using a sample of six SGL systems and the Pantheon+ SNe Ia dataset, we find no statistically significant evidence for DDR violations across all parameterizations. The consistency of our findings across different parameterizations not only reinforces confidence in the standard DDR but also demonstrates the robustness of our analytical approach.\n\n", "2407.07309": "2024-07-10, **Coordinated JWST Imaging of Three Distance Indicators in a SN Host Galaxy and an Estimate of the TRGB Color Dependence**, Taylor J. Hoyt et.al., [2407.07309v1](http://arxiv.org/abs/2407.07309v1)\n\n Boasting a 6.5m mirror in space, JWST can increase by several times the number of supernovae (SNe) to which a redshift-independent distance has been measured with a precision distance indicator (e.g., TRGB or Cepheids); the limited number of such SN calibrators currently dominates the uncertainty budget in distance ladder Hubble constant (H0) experiments. JWST/NIRCAM imaging of the Virgo Cluster galaxy NGC4536 is used here to preview JWST program GO-1995, which aims to measure H0 using three stellar distance indicators (Cepheids, TRGB, JAGB/carbon stars). Each population of distance indicator was here successfully detected -- with sufficiently large number statistics, well-measured fluxes, and characteristic distributions consistent with ingoing expectations -- so as to confirm that we can acquire distances from each method precise to about 0.05mag (statistical uncertainty only). We leverage overlapping HST imaging to identify TRGB stars, cross-match them with the JWST photometry, and present a preliminary constraint on the slope of the TRGB's F115W-(F115W}-F444W) relation equal to -0.99 +/- 0.16 mag/mag. This slope is consistent with prior slope measurements in the similar 2MASS J-band, as well as with predictions from the BASTI isochrone suite. We use the new TRGB slope estimate to flatten the two-dimensional TRGB feature and measure a (blinded) TRGB distance relative to a set of fiducial TRGB colors, intended to represent the absolute fiducial calibrations expected from geometric anchors such as NGC4258 and the Magellanic Clouds. In doing so, we empirically demonstrate that the TRGB can be used as a standardizable candle at the IR wavelengths accessible with JWST.\n\n"}}