{"neutrino": {"2501.07540": "2025-01-13, **Advection Algorithms for Quantum Neutrino Moment Transport**, Evan Grohs et.al., [2501.07540v1](http://arxiv.org/abs/2501.07540v1)\n\n Neutrino transport in compact objects is an inherently challenging multi-dimensional problem. This difficulty is compounded if one includes flavor transformation -- an intrinsically quantum phenomenon requiring one to follow the coherence between flavors and thus necessitating the introduction of complex numbers. To reduce the computational burden, simulations of compact objects that include neutrino transport often make use of momentum-angle-integrated moments (the lowest order ones being commonly referred to as the energy density and flux) and these quantities can be generalized to include neutrino flavor, i.e., they become quantum moments. Numerous finite-volume approaches to solving the moment evolution equations for classical neutrino transport have been developed based on solving a Riemann problem at cell interfaces. In this paper we describe our generalization of a Riemann solver for quantum moments, specifically decomposing complex numbers in terms of a (signed) magnitude and phase instead of real and imaginary parts. We then test our new algorithm in numerous cases showing a neutrino fast flavor instability, varying from toy models with analytic solutions to snapshots from neutron star merger simulations. Compared to previous algorithms for neutrino transport with flavor mixing, we find uniformly smaller growth rates of the flavor transformation along with concomitantly larger length-scales, and that the results are a better match with the growth rates seen from multi-angle codes.\n\n", "2501.07362": "2025-01-13, **Science objectives of the Einstein Probe mission**, Weimin Yuan et.al., [2501.07362v1](http://arxiv.org/abs/2501.07362v1)\n\n The Einstein Probe (EP) is an interdisciplinary mission of time-domain and X-ray astronomy. Equipped with a wide-field lobster-eye X-ray focusing imager, EP will discover cosmic X-ray transients and monitor the X-ray variability of known sources in 0.5-4 keV, at a combination of detecting sensitivity and cadence that is not accessible to the previous and current wide-field monitoring missions. EP can perform quick characterisation of transients or outbursts with a Wolter-I X-ray telescope onboard. In this paper, the science objectives of the Einstein Probe mission are presented. EP is expected to enlarge the sample of previously known or predicted but rare types of transients with a wide range of timescales. Among them, fast extragalactic transients will be surveyed systematically in soft X-rays, which include {\\gamma}-ray bursts and their variants, supernova shock breakouts, and the predicted X-ray transients associated with binary neutron star mergers. EP will detect X-ray tidal disruption events and outbursts from active galactic nuclei, possibly at an early phase of the flares for some. EP will monitor the variability and outbursts of X-rays from white dwarfs, neutron stars and black holes in our and neighbouring galaxies at flux levels fainter than those detectable by the current instruments, and is expected to discover new objects. A large sample of stellar X-ray flares will also be detected and characterised. In the era of multi-messenger astronomy, EP has the potential of detecting the possible X-ray counterparts of gravitational wave events, neutrino sources, and ultra-high energy {\\gamma}-ray and cosmic ray sources. EP is expected to help advance the studies of extreme objects/phenomena and their underlying physical processes revealed in the dynamic X-ray universe, as well as studies in other areas of X-ray astronomy.\n\n", "2501.07250": "2025-01-13, **Large Language Models: New Opportunities for Access to Science**, Jutta Schnabel et.al., [2501.07250v1](http://arxiv.org/abs/2501.07250v1)\n\n The adaptation of Large Language Models like ChatGPT for information retrieval from scientific data, software and publications is offering new opportunities to simplify access to and understanding of science for persons from all levels of expertise. They can become tools to both enhance the usability of the open science environment we are building as well as help to provide systematic insight to a long-built corpus of scientific publications. The uptake of Retrieval Augmented Generation-enhanced chat applications in the construction of the open science environment of the KM3NeT neutrino detectors serves as a focus point to explore and exemplify prospects for the wider application of Large Language Models for our science.\n\n", "2501.07152": "2025-01-13, **Neutrino Physics at the LHC: Status and Prospects**, Felix Kling et.al., [2501.07152v1](http://arxiv.org/abs/2501.07152v1)\n\n The LHC is not only the most powerful collider built to date but also the source of an intense beam of the most energetic neutrinos ever produced by humankind. After nearly 15 years of LHC operation, these neutrinos have been observed for the first time by the FASER and SND@LHC experiments. This breakthrough marks the dawn of a new field: collider neutrino physics. Further neutrino measurements at the LHC will offer novel opportunities to advance neutrino physics, constrain the strong interaction in uncharted kinematic regimes, provide critical input for addressing outstanding questions in astroparticle physics, and search for phenomena predicted by scenarios of physics beyond the Standard Model. This proceeding reviews the existing and proposed neutrino detectors, presents their first results, and summarizes their physics potential.\n\n", "2501.07080": "2025-01-13, **Neutrino-dominated relativistic viscous accretion flows around rotating black holes with shocks**, Amit Kumar et.al., [2501.07080v1](http://arxiv.org/abs/2501.07080v1)\n\n We investigate the relativistic, viscous, advective, neutrino-dominated accretion flows (NDAFs) around rotating stellar mass black holes, incorporating neutrino cooling. By adopting an effective potential to describe the spacetime geometry around the rotating black holes, we self-consistently solve the governing NDAF equations to obtain global transonic accretion solutions. Our findings indicate that, depending on the model parameters, namely energy ($\\varepsilon$), angular momentum ($\\lambda$), accretion rate ($\\dot{m}$), viscosity ($\\alpha$) and black hole spin ($a\\_{\\rm k}$), NDAFs may harbor standing shocks where the Rankine-Hugoniot shock conditions (RHCs) are satisfied. Utilizing these shock-induced NDAF solutions, we compute the neutrino luminosity ($L\\_{\\nu}$) and neutrino annihilation luminosity ($L\\_{\\nu \\bar{\\nu}}$) across a wide range of model parameters. We further calculate maximum neutrino luminosity ($L\\_{\\nu}^{\\rm max}$) and neutrino annihilation luminosity ($L\\_{\\nu \\bar{\\nu}}^{\\rm max}$) resulting in $L\\_{\\nu}^{\\rm max} \\sim 10^{51-53}$ erg s$^{-1}$ ($10^{48-51}$ erg s$^{-1}$) and $L\\_{\\nu \\bar{\\nu}}^{\\rm max} \\sim 10^{48-52}$ erg s$^{-1}$ ($10^{42-49}$ erg s$^{-1}$) for $a\\_{\\rm k}=0.99$ (0.0). These findings suggest that shocked NDAF solutions are potentially promising to explain the energy output of gamma-ray bursts (GRBs). We employ our NDAF model formalism to elucidate $L^{\\rm obs}\\_{\\nu \\bar{\\nu}}$ for five GRBs with known redshifts and estimate their accretion rate (${\\dot m}$) based on the spin ($a\\_{\\rm k}$) of the central source of GRBs under consideration.\n\n"}, "dark matter": {"2501.07456": "2025-01-13, **Effect of dark matter halo on transonic accretion flow around a galactic black hole**, Subhankar Patra et.al., [2501.07456v1](http://arxiv.org/abs/2501.07456v1)\n\n We investigate the transonic accretion flow in the spacetime of a supermassive black hole (BH) coupled to an anisotropic dark matter fluid, as proposed by Cardoso {\\it et al}. We essentially compare the accretion properties of the Cardoso BH with those of an isolated Schwarzschild BH. The Cardoso BH is described by the halo mass ($M\\_{\\rm H}$) and its characteristic length scale ($a\\_0$). Various classes of accretion solution topologies (e.g., O, A, and I-types), including the shock solutions, are obtained by solving the dynamical equations of the flow in a fully general relativistic framework. We find that the accretion solutions are substantially influenced by the halo parameters ($M\\_{\\rm H}, a\\_0$) when the dark matter distribution is concentrated near the BH horizon. In this context, we also observe that various shock properties, such as the shock radius, flow density compression, and temperature compression across the shock fronts, are potentially affected by the dark halo. Interestingly, the existing shock parameter space, defined by the flow angular momentum and energy, is largely reduced for higher halo compactness compared to that of the Schwarzschild BH. Furthermore, different observational signatures of the accretion disc, like the spectral energy distribution (SED), slope of the SED, and bolometric luminosity, are found to exhibit strong deviations from the known results in the usual Schwarzschild BH model. These unique features offer a possible valuable tool for characterizing the presence or absence of a dark matter halo around a galactic BH.\n\n", "2501.07361": "2025-01-13, **Probing the sign-changeable interaction between dark energy and dark matter with DESI baryon acoustic oscillations and DES supernovae data**, Tian-Nuo Li et.al., [2501.07361v1](http://arxiv.org/abs/2501.07361v1)\n\n There is a possibility of interaction between dark energy and dark matter, and this interaction may also undergo a sign change during the evolution of the universe. In this paper, we utilize the latest observational data to constrain models of a sign-changeable interaction. The data we employ, in addition to the cosmic microwave background data, also encompass the first-year baryon acoustic oscillation data from DESI and the type Ia supernova data of the full 5-year observation from DES. To achieve high generality, we investigate four interacting dark energy (IDE) models with different forms of the interaction term $Q$: (i) IDE1 with $Q = \\beta(a)H\\rho\\_{\\rm de}$; (ii) IDE2 with $Q = \\beta(a)H\\rho\\_{\\rm c}$; (iii) IDE3 with $Q = \\beta(a)H\\_0\\rho\\_{\\rm de}$; (iv) IDE4 with $Q = \\beta(a)H\\_0\\rho\\_{\\rm c}$. From the analysis, we observe that $\\beta(z) > 0$ at early times and $\\beta(z) < 0$ at late times, with the coupling $\\beta(z)$ crossing the non-interacting line $\\beta(z) = 0$ during cosmic evolution at the 2$\\sigma$ confidence level for the IDE1, IDE3, and IDE4 models. However, for the IDE2 model, $\\beta(z)$ remains consistently negative and does not cross $\\beta(z) = 0$ at the 2$\\sigma$ confidence level. Our findings indicate that the energy transfer is from dark matter to dark energy when dark matter dominates the universe, and from dark energy to dark matter when dark energy dominates, for the IDE1 and IDE3 models. Furthermore, Bayesian evidence suggests that the IDE1 and IDE3 models are moderately preferred over the $\\Lambda$CDM model. The overall outcomes of this study clearly indicate that, based on current observational data, the sign-changeable IDE models are quite compelling and merit further attention.\n\n", "2501.07176": "2025-01-13, **Constraints on extended axion structures from the lensing of fast radio bursts**, Jan Tristram Acuña et.al., [2501.07176v1](http://arxiv.org/abs/2501.07176v1)\n\n Axions are hypothetical pseudoscalar particles that have been regarded as promising dark matter (DM) candidates. On the other hand, extended compact objects such as axion stars, which are supported by gravity and axion self interactions, may have also been formed in the early Universe and comprise part of DM. In this work, we consider the lensing of electromagnetic signals from distant sources by axion stars, as a way to constrain the properties of axion stars and fundamental axion parameters. Accounting for the effect of the finite size of the axion star, we study the lensing effect induced by gravity and the axion-photon coupling. The latter effect is frequency dependent, and is relevant in the low frequency band, which motivates the use of fast radio burst (FRB) signals as a probe. We calculate the predicted number of lensed FRB events by specifying the fundamental axion parameters, axion star radial profile, fraction of DM residing in axion stars, and imposing lensing criteria based on the flux ratio and time delay between the brightest images from lensing. Assuming an optimistic case of $10^4$ observed FRB events, and a timing resolution of $1~\\mu{\\rm s}$, the lack of observed FRB lensing events in CHIME allows us to probe axion stars with mass $ \\gtrsim 2 \\times 10^{-2} M\\_\\odot$, corresponding to axion masses $\\lesssim 10^{-10}{\\rm eV}$. We obtain constraints for even lighter axion stars up to $\\sim 10^{-3} M\\_\\odot$, when the axion-photon interactions are taken into account. Our results indicate that FRB lensing lead to constraints that are competitive with conventional microlensing searches operating in the optical band.\n\n", "2501.07052": "2025-01-13, **Impact of dark matter distribution on neutron star properties**, Ankit Kumar et.al., [2501.07052v1](http://arxiv.org/abs/2501.07052v1)\n\n We investigate the structural and observable impacts of dark matter (DM) on neutron stars using a combined equation of state that integrates the relativistic mean field (RMF) model for baryonic matter with a variable density profile for DM, incorporating DM-baryon interactions mediated by the Higgs field. Employing three RMF parameter sets (NL3, BigApple, and IOPB-I) for baryonic matter, we analyze mass-radius relations, maximum mass, and tidal deformability, focusing on DM density scaling ($\\alpha$) and steepness ($\\beta$) parameters. Our findings reveal that increased DM concentration significantly enhances NS compactness, shifting mass-radius profiles and reducing tidal deformability. The DM influence strongly depends on the steepness of the DM density profile, where high $\\beta$ values lead to strongly confined DM within the NS core, resulting in more compact and less deformable configurations. Observational constraints from PSR J0740+6620 and GW170817 impose consistent structural limits on DM fractions across different equations of state models, narrowing the allowable parameter space for DM and linking specific combinations of $\\alpha M\\_{\\chi}$ ($M\\_{\\chi}$ being the mass of dark matter particle) and $\\beta$ values to viable NS structures. This study highlights the interplay among DM concentration, nuclear stiffness, and observational data in shaping NS structure, offering insights into future constraints on DM in high-density astrophysical environments.\n\n", "2501.07001": "2025-01-13, **Dark matter halo dynamics in 2D Vlasov Simulations: a self-similar approach**, Abineet Parichha et.al., [2501.07001v1](http://arxiv.org/abs/2501.07001v1)\n\n Understanding dark matter halo dynamics can be pivotal in unravelling the nature of dark matter particles. Analytical treatment of the multistream flows inside the turnaround region of a collapsed cold dark matter (CDM) halo using various self-similar approaches already exist. In this work, we aim to determine the extent of self-similarity in 2D halo dynamics and the factors leading to deviations from it by studying numerical simulations of monolithically growing CDM halos. We have adapted the Fillmore and Goldreich (FG) self-similar solutions assuming cylindrical symmetry to data from 2D Vlasov-Poisson (ColDICE package) simulations of CDM halos seeded by sine wave initial conditions. We measured trajectories in position and phase-space, mass and density profiles and compared these to predictions from the FG model. We find that after turn-around and subsequent shell crossing, particles undergo a period of relaxation, typically about 1-2 oscillations about the center before they start to trace the self-similar fits and continue to do so as long as their orbits are predominantly radial. Overplotting the trajectories from different snapshots in scale-free position-time and phase spaces shows strikingly good superposition, a defining feature of self-similarity. The radial density profiles measured from simulations: $\\rho \\propto r^{-\\alpha}, \\alpha = 0.9 - 1.0$ are consistent with FG's prediction $\\alpha=1$ for 2D halos. Deviations from the model, on the other hand, are evidently linked to relaxation, inhibited motion due to periodic boundaries, transverse motion in the halo interior, and deficit of infalling mass in limited simulation volume. It could not be conclusively established if the halos tend to grow circular over time. Extension of this work to actual 3D CDM cosmologies necessitates further detailed study of self-similar solutions with ellipsoidal collapse and transverse motion.\n\n"}, "supernova": {"2501.07538": "2025-01-13, **Testing $γδ$CDM Model in the Redshift Bins**, Furkan Şakir Dilsiz et.al., [2501.07538v1](http://arxiv.org/abs/2501.07538v1)\n\n The Hubble crisis is the discrepancy in the values of the Hubble constant inferred from diverse observations in the late and early Universe, being of the order 5$\\sigma$. Instead of resolution, the conflict is getting larger with further late-time observations. A fundamental constant should be and remain constant throughout the cosmological history and thus at all redshifts. The fact that it turns out to be a function of redshift in the $\\Lambda$CDM model points out that either there is a problem with the current cosmological model, indicating unknown new physics, or there are unknown systematics in some of the observations. In this work, we investigate the redshift dependence of the Hubble constant in the $\\gamma\\delta$CDM cosmological model, which is a new cosmological model based on $f(R)$ gravity in an anisotropic background. Through data analysis with the Pantheon+ type Ia supernovae, the cosmic chronometers Hubble, and both the old and the Dark Energy Spectroscopic Instrument (DESI) baryon acoustic oscillation data, we establish that the Hubble constant in our model does not evolve with redshift. We also confirm that our model fits the aforementioned data better than the $\\Lambda$CDM model by checking various information criteria. The value of the Hubble constant obtained in the $\\gamma\\delta$CDM model is in the 1$\\sigma$ bound of the late Universe observations.\n\n", "2501.07361": "2025-01-13, **Probing the sign-changeable interaction between dark energy and dark matter with DESI baryon acoustic oscillations and DES supernovae data**, Tian-Nuo Li et.al., [2501.07361v1](http://arxiv.org/abs/2501.07361v1)\n\n There is a possibility of interaction between dark energy and dark matter, and this interaction may also undergo a sign change during the evolution of the universe. In this paper, we utilize the latest observational data to constrain models of a sign-changeable interaction. The data we employ, in addition to the cosmic microwave background data, also encompass the first-year baryon acoustic oscillation data from DESI and the type Ia supernova data of the full 5-year observation from DES. To achieve high generality, we investigate four interacting dark energy (IDE) models with different forms of the interaction term $Q$: (i) IDE1 with $Q = \\beta(a)H\\rho\\_{\\rm de}$; (ii) IDE2 with $Q = \\beta(a)H\\rho\\_{\\rm c}$; (iii) IDE3 with $Q = \\beta(a)H\\_0\\rho\\_{\\rm de}$; (iv) IDE4 with $Q = \\beta(a)H\\_0\\rho\\_{\\rm c}$. From the analysis, we observe that $\\beta(z) > 0$ at early times and $\\beta(z) < 0$ at late times, with the coupling $\\beta(z)$ crossing the non-interacting line $\\beta(z) = 0$ during cosmic evolution at the 2$\\sigma$ confidence level for the IDE1, IDE3, and IDE4 models. However, for the IDE2 model, $\\beta(z)$ remains consistently negative and does not cross $\\beta(z) = 0$ at the 2$\\sigma$ confidence level. Our findings indicate that the energy transfer is from dark matter to dark energy when dark matter dominates the universe, and from dark energy to dark matter when dark energy dominates, for the IDE1 and IDE3 models. Furthermore, Bayesian evidence suggests that the IDE1 and IDE3 models are moderately preferred over the $\\Lambda$CDM model. The overall outcomes of this study clearly indicate that, based on current observational data, the sign-changeable IDE models are quite compelling and merit further attention.\n\n", "2501.07226": "2025-01-13, **SN 2023xwi: Forbidden line emission in the peak spectrum of a Ca-strong transient**, C. -G. Touchard-Paxton et.al., [2501.07226v1](http://arxiv.org/abs/2501.07226v1)\n\n We present an extensive optical photometric and spectroscopic investigation into the calcium-rich supernova (SN) - SN2023xwi. Observations from a variety of ground-based telescopes follow the SN from 8 days pre-peak brightness to 87 days post-peak, covering both early-time (photospheric) and late-time (nebular) phases of the supernova. Objects of this class are characterised by nebular spectra that are dominated by [Ca II] $\\lambda \\lambda$ 7291, 7324 emission. SN 2023xwi displays a unique peculiarity in that its forbidden [Ca II] feature is visible in its peak photospheric spectrum - far earlier than expected in current models. This is one of the strongest and earliest detections of this feature in Ca-rich SNe in photospheric-phase spectra. We investigate the velocity evolution of this spectral feature and show that it cannot be easily explained by conventional progenitor systems. From our observations, we propose a SN progenitor embedded in an environment polluted by a recurrent He-nova AM CVn system.\n\n", "2501.07134": "2025-01-13, **PISN 2018ibb: radioactive emission of [O III] lines**, Nikolai N. Chugai et.al., [2501.07134v1](http://arxiv.org/abs/2501.07134v1)\n\n Supernova 2018ibb of the PISN category related to the dynamical instability of oxygen core in a supermassive star induced by pair-creation shows at the nebular stage strong [\\oiii] emission lines of an uncertain origin. I propose a simple model that demonstrates a possibility of [O III] lines emission from the supernova oxygen matter ionized and heated by the $^{56}$Co radioactive decay. The reason is pinpointed by which the [O III] line luminosity among supernovae of PISN category can vary in a broad range.\n\n", "2501.07099": "2025-01-13, **Constraints on $Λ(t)$CDM cosmology using Cosmic Chronometers and Supernova data**, Yerlan Myrzakulov et.al., [2501.07099v1](http://arxiv.org/abs/2501.07099v1)\n\n In this manuscript, we investigate the constraints on dynamical vacuum models within the framework of $\\Lambda(t)$CDM cosmology by assuming a parameterization of the vacuum energy density as $\\rho\\_{\\Lambda}(t)=\\rho\\_{\\Lambda 0} \\left[1 + \\alpha (1 - a)\\right]$, where $\\rho\\_{\\Lambda 0}$ is the present vacuum density and $\\alpha$ is a free parameter. We use 31 cosmic chronometer data points and 1048 Pantheon type Ia supernova samples to constrain the model parameters. Our statistical analysis employs Markov Chain Monte Carlo (MCMC) simulations. We have found that the universe is currently undergoing accelerated expansion, transitioning from a decelerating phase. The transition redshift $z\\_t=0.65^{+0.03}\\_{-0.19}$ obtained from the combined CC+SNe dataset is consistent with recent constraints. The total EoS indicates an accelerating phase, with density parameters for matter and vacuum energy exhibiting expected behaviors. The $Om(z)$ diagnostic shows distinct behaviors for different datasets, and the present value of the jerk parameter deviates slightly from the $\\Lambda$CDM model but remains consistent within uncertainties. These findings support the dynamic nature of dark energy and provide valuable constraints on the evolution of the universe.\n\n"}}