{"neutrino": {"2312.08357": "2023-12-13, **Leptogenesis in the minimal flipped $SU(5)$ unification**, Renato Fonseca et.al., [2312.08357v1](http://arxiv.org/abs/2312.08357v1)\n\n We study the prospects of thermal leptogenesis in the framework of the minimal flipped $SU(5)$ unified model in which the RH neutrino mass scale emerges as a two-loop effect. Despite its strong suppression with respect to the unification scale which tends to disfavor leptogenesis in the standard Davidson-Ibarra regime (and a notoriously large washout of the $N\\_1$-generated asymmetry owing to a top-like Yukawa entry in the Dirac neutrino mass matrix) the desired $\\eta\\_B\\sim 6\\times 10^{-10}$ can still be attained in several parts of the parameter space exhibiting interesting baryon and lepton number violation phenomenology. Remarkably enough, in all these regions the mass of the lightest LH neutrino is so low that it yields $m\\_\\beta \\lesssim 0.03$ eV for the effective neutrino mass measured in beta-decay, i.e., an order of magnitude below the design sensitivity limit of the KATRIN experiment. This makes the model potentially testable in the near future.\n\n", "2312.08178": "2023-12-13, **Geometrical Interpretation of Neutrino Oscillation with decay**, Rajrupa Banerjee et.al., [2312.08178v1](http://arxiv.org/abs/2312.08178v1)\n\n The geometrical representation of two-flavor neutrino oscillation represents the neutrino's flavor eigenstate as a magnetic moment-like vector that evolves around a magnetic field-like vector that depicts the Hamiltonian of the system. In the present work, we demonstrate the geometrical interpretation of neutrino in a vacuum in the presence of decay, which transforms this circular trajectory of neutrino into a helical track that effectively makes the neutrino system mimic a classical damped driven oscillator. We show that in the absence of the phase factor $\\xi$ in the decay Hamiltonian, the neutrino exactly behaves like the system of nuclear magnetic resonance(NMR); however, the inclusion of the phase part introduces a $CP$ violation, which makes the system deviate from NMR. Finally, we make a qualitative discussion on under-damped, critically-damped, and over-damped scenarios geometrically by three different diagrams. In the end, we make a comparative study of geometrical picturization in vacuum, matter, and decay, which extrapolates the understanding of the geometrical representation of neutrino oscillation in a more straightforward way.\n\n", "2312.08102": "2023-12-13, **The Milky Way shines in high-energy neutrinos**, Mauricio Bustamante et.al., [2312.08102v1](http://arxiv.org/abs/2312.08102v1)\n\n The most energetic astrophysical sources in the Milky Way, cosmic accelerators capable of producing high-energy cosmic rays, have resisted discovery for over a century. Up to now, astrophysicists sought these sources mainly by scouring the Galaxy for the gamma rays they are expected to emit. In 2023, the IceCube Neutrino Observatory discovered high-energy neutrinos from the Milky Way, inaugurating a telltale stream of evidence of cosmic-ray production and interaction in the Galaxy.\n\n", "2312.08093": "2023-12-13, **Scotogenic generation of realistic neutrino mixing with D5**, Soumita Pramanick et.al., [2312.08093v1](http://arxiv.org/abs/2312.08093v1)\n\n A mechanism of radiative generation of realistic neutrino mixing at one-loop level with $D5\\times Z\\_2$ is presented in this paper. The process is demonstrated in two set-ups using $D5\\times Z\\_2$ symmetry viz. Model 1 and Model 2. Two right-handed neutrinos are present in both the models. In both Model 1 and Model 2, when mixing between these two right-handed neutrinos are maximal, one can produce the form of the left-handed Majorana neutrino mass matrix corresponding to $\\theta\\_{13}=0$, $\\theta\\_{23}=\\pi/4$ and any value of $\\theta\\_{12}^0$ associated with Tribimaximal (TBM), Bimaximal (BM), Golden Ratio (GR) or other mixings. Small shift from maximal mixing between the two right-handed neutrino states can generate non-zero $\\theta\\_{13}$, deviation of $\\theta\\_{23}$ from $\\pi/4$ and corrections to the solar mixing $\\theta\\_{12}$ in one step for both Model 1 and Model 2. In both the models, two $Z\\_2$ odd inert $SU(2)\\_L$ doublet scalars are present. The lightest between these two scalars can be a viable dark matter candidate for both Model 1 and Model 2.\n\n", "2312.07988": "2023-12-13, **Neutrinos from pre-supernova in the framework of TQRPA method**, A. A. Dzhioev et.al., [2312.07988v1](http://arxiv.org/abs/2312.07988v1)\n\n We propose a new method for calculating spectra and luminosities for (anti)neutrinos produced in the pre-supernova environment by weak processes with hot nuclei. It is based on the thermal quasiparticle random phase approximation (TQRPA), that allows microscopic thermodynamically consistent calculations of the weak-interaction response of nuclei at finite temperatures. For realistic representative pre-supernova conditions from the stellar evolution code MESA, we compute (anti)neutrino luminosities and spectra arising from neutral- and charged-current weak reactions with hot $^{56}$Fe and compare them with the contribution of thermal processes. We find that the TQRPA approach produces not only a higher total luminosity of electron neutrinos (mainly born in the electron capture reaction), compared to the standard technique based on the large-scale shell model (LSSM) weak-interaction rates, but also a harder neutrino spectrum. Besides, applying the TQRPA and LSSM, we find that in the context of electron antineutrino generation, the neutral-current nuclear de-excitation (ND) process via neutrino-antineutrino pair emission is at least as important as the electron-positron pair annihilation process. We also show that flavor oscillations enhance the high-energy contribution of the ND process to the electron antineutrino flux. This could potentially be important for pre-supernova antineutrino registration by the Earth's detectors.\n\n"}, "dark matter": {"2312.08339": "2023-12-13, **Non-relativistic nuclear reduction for tensor couplings in dark matter direct detection and $μ\\to e$ conversion**, Ayala Glick-Magid et.al., [2312.08339v1](http://arxiv.org/abs/2312.08339v1)\n\n In recent years, the non-relativistic effective theory (NRET) has been widely used for direct detection of dark matter and $\\mu \\to e$ conversion. Nevertheless, existing literature has not fully considered tensor interactions, introducing a critical gap in our understanding. This study addresses this omission by integrating tensor amplitudes into the NRET framework, employing a novel approach for decomposing antisymmetric tensor-type interactions. This work establishes the connection between the tensor amplitudes and the non-relativistic Galilean-invariant operators. Specifically, it explores this relationship up to the leading order in momentum transfer, stemming from the exchange of spin-half particles in dark matter scenarios, and extends the analysis to the lepton-velocities orders for $\\mu \\to e$ conversion cases. To facilitate further research and experimental analyses, comprehensive tables containing the requisite tensor matrix elements at finite momentum transfer are furnished, encompassing all possible Lorentz-invariant terms. These tensor terms are crucial to the analysis of ongoing experiments of dark matter detection through scattering off nuclei, as well as charged-lepton flavor violation in the $\\mu \\to e$ conversion. Upon successful detection, they will contribute significantly to the comprehension of the nature of these new physics interactions.\n\n", "2312.08254": "2023-12-13, **Early Dark Energy and Dark Photon Dark Matter from Waterfall Symmetry Breaking**, Alireza Talebian et.al., [2312.08254v1](http://arxiv.org/abs/2312.08254v1)\n\n We investigate a cosmological model wherein a waterfall symmetry breaking occurs during the radiation-dominated era. The model comprises a complex waterfall field, an axion field, and the gauge field (dark photon) generated through a tachyonic instability due to the Chern-Simons interaction. Prior to symmetry breaking, the total energy density incorporates a vacuum energy from the waterfall field, establishing a novel scenario for Early Dark Energy (EDE). Subsequent to the symmetry breaking, the dark photon dynamically acquires mass via the Higgs mechanism, potentially contributing to the dark matter abundance. Hence, our model can simultaneously address the $H\\_0$ tension and the origin of dark matter.\n\n", "2312.08231": "2023-12-13, **Revisiting the stochastic QCD axion window: departure from equilibrium during inflation**, Vadim Briaud et.al., [2312.08231v1](http://arxiv.org/abs/2312.08231v1)\n\n If dark matter is made of QCD axions, its abundance is determined by the vacuum expectation value acquired by the axion field during inflation. The axion is usually assumed to follow the equilibrium distribution arising from quantum diffusion during inflation. This leads to the so-called stochastic window under which the QCD axion can make up all the dark matter. It is characterised by $10^{10.4}\\mathrm{GeV}\\leq f\\leq 10^{17.2}\\mathrm{GeV}$ and $H\\_{\\mathrm{end}}>10^{-2.2}\\mathrm{GeV}$, where $f$ is the axion decay constant and $H\\_{\\mathrm{end}}$ is the Hubble expansion rate at the end of inflation. However, in realistic inflationary potentials, we show that the axion never reaches the equilibrium distribution at the end of inflation. This is because the relaxation time of the axion is much larger than the typical time scale over which $H$ varies during inflation. As a consequence, the axion acquires a quasi-flat distribution as long as it remains light during inflation. This leads us to reassessing the stochastic axion window, and we find that $ 10^{10.3}\\mathrm{GeV}\\leq f\\leq 10^{14.1}\\mathrm{GeV}$ and $H\\_{\\mathrm{end}}>10^{-13.8}\\mathrm{GeV}$.\n\n", "2312.08087": "2023-12-13, **Precise Estimate of Charged Higgsino/Wino Decay Rate**, Masahiro Ibe et.al., [2312.08087v1](http://arxiv.org/abs/2312.08087v1)\n\n Higgsinos and Winos in the supersymmetric Standard Model are prime candidates for dark matter due to their weakly interacting nature. The mass differences between their charged components (charginos) and neutral components (neutralinos) become degenerate when other superparticles are heavy, resulting in long-lived charginos. In the case of the Winos, the mass difference is approximately 160 MeV across a wide range of the parameter space. Consequently, the chargino decays into the lightest neutralino, emitting a single charged pion. For Higgsinos, however, mass differences ranging from O(0.1) GeV to O(1) GeV are possible, leading to a variety of decay channels. In this paper, we extend our previous analysis of Wino decay to the chargino with a larger mass difference. We emphasize characterizing its decay signatures through leptonic and hadronic modes. By utilizing the latest experimental data, we perform a comprehensive study of the decay rate calculations incorporating these hadronic modes to determine the impact on the predicted chargino lifetime. Additionally, we conduct next-to-leading order (NLO) calculations for the leptonic decay modes. Our NLO results can be applied to the case of more general fermionic electroweak multiplets, e.g., quintuplet dark matter.\n\n", "2312.07957": "2023-12-13, **Scintillation characteristics of an undoped CsI crystal at low-temperature for dark matter search**, W. K. Kim et.al., [2312.07957v1](http://arxiv.org/abs/2312.07957v1)\n\n The scintillation characteristics of an undoped CsI crystal with dimensions of 5.8 mm $\\times$ 5.9 mm $\\times$ 7.0 mm, corresponding to a weight of 1.0 g, were studied by directly coupling two silicon photomultipliers (SiPMs) over a temperature range from room temperature (300 K) to a low temperature of 86 K. The scintillation decay time and light output were measured using x-ray (23 keV) and gamma-ray (88 keV) peaks from a $^{109}$Cd radioactive source. An increase in decay time was observed as the temperature decreased from room temperature to 86 K, ranging from 76 ns to 605 ns. Correspondingly, the light output increased as well, reaching 37.9 $\\pm$ 1.5 photoelectrons per keV electron-equivalent at 86 K, which is approximately 18 times higher than the light yield at room temperature. Leveraging the significantly enhanced scintillation light output of the undpoed CsI crystal at the low temperature, coupling it with SiPMs makes it a promising candidate for the future dark matter search detector, benefiting from the low threshold owing to the high light output. The odd proton numbers from both cesium and iodine provide an advantage for the WIMP-proton spin-dependent interaction. We evaluated the sensitivity of low-mass dark matter on WIMP-proton spin-dependent interaction with the Migdal process, assuming 200 kg of undoped CsI crystals for the dark matter search. We conclude that undoped CsI crystal detectors exhibit world-competitive sensitivities for low-mass dark matter detection, particularly for the WIMP-proton spin-dependent interaction.\n\n", "2312.07863": "2023-12-13, **The Right-Handed Slepton Bulk Regions for Dark Matter in the Generalized Minimal Supergravity (GmSUGRA)**, Imtiaz Khan et.al., [2312.07863v1](http://arxiv.org/abs/2312.07863v1)\n\n We study the light right-handed slepton bulk regions for dark matter from the Generalized Minimal Supergravity (GmSUGRA) in the Minimal Supersymmetric Standard Model (MSSM). In our comprehensive numerical studies, we show that $\\mathcal{R\\_{\\tilde{\\phi}}}\\gtrsim10\\%$ is a conservative criteria to formulate bulk region, where $\\mathcal{R\\_{\\tilde{\\phi}}}\\equiv({m\\_{\\tilde{\\phi}}-m\\_{\\tilde{\\chi}\\_1^0}})/{m\\_{\\tilde{\\chi}\\_1^0}}$. For right-handed stau as the Next to the Lightest Supersymmetric Partcile (NLSP), we find a large viable parameter space, consistent with the current LHC constraints, Planck2018 dark matter relic density bounds, and direct bounds on neutralino-nucleons scattering cross-section that naturally supports the right-handed stau bulk regions for dark matter. In particular, the upper bounds on the masses of the Lightest Supersymmetric Particle (LSP) neutralino and right-handed stau are about 120.4 GeV and 138 GeV, respectively. This bulk region may be beyond the current LHC reach and could be probed at LUX-ZEPLIN, a next-generation dark matter direct detection experiment, the Future Circular Collider (FCC-ee) at CERN, and the Circular Electron Positron Collider (CEPC). However, the scenario with the right-handed selectron as the NLSP is excluded by the LHC supersymmetry searches.\n\n", "2312.07836": "2023-12-13, **Stealth dark matter spectrum using LapH and Irreps**, Richard C. Brower et.al., [2312.07836v1](http://arxiv.org/abs/2312.07836v1)\n\n We present non-perturbative lattice calculations of the low-lying meson and baryon spectrum of the SU(4) gauge theory with fundamental fermion constituents. This theory is one instance of stealth dark matter, a class of strongly coupled theories, where the lowest mass stable baryon is the dark matter candidate. This work constitutes the first milestone in the program to study stealth dark matter self-interactions. Here, we focus on reducing excited state contamination in the single baryon channel by applying the Laplacian Heaviside method, as well as projecting our baryon operators onto the irreducible representations of the octahedral group. We compare our resulting spectrum to previous work involving Gaussian smeared non-projected operators and find good agreement with reduced statistical uncertainties. We also present the spectrum of the low-lying odd-parity baryons for the first time.\n\n"}, "supernova": {"2312.08319": "2023-12-13, **Making waves in massive star asteroseismology**, Dominic M. Bowman et.al., [2312.08319v1](http://arxiv.org/abs/2312.08319v1)\n\n Massive stars play a major role not only in stellar evolution but also galactic evolution theory. This is because of their dynamical interaction with binary companions, and because their strong winds and explosive deaths as supernovae provide chemical, radiative and kinematic feedback to their environments. Yet this feedback strongly depends on the physics of the supernova progenitor star. It is only in recent decades that asteroseismology - the study of stellar pulsations - has developed the necessary tools to a high level of sophistication to become a prime method at the forefront of astronomical research for constraining the physical processes at work within stellar interiors. For example, precise and accurate asteroseismic constraints on interior rotation, magnetic field strength and geometry, mixing and angular momentum transport processes of massive stars are becoming increasingly available across a wide range of masses. Moreover, ongoing large-scale time-series photometric surveys with space telescopes have revealed a large diversity in the variability of massive stars, including widespread coherent pulsations across a large range in mass and age, and the discovery of ubiquitous stochastic low-frequency (SLF) variability in their light curves. In this invited review, I discuss the progress made in understanding the physical processes at work within massive star interiors thanks to modern asteroseismic techniques, and conclude with a future outlook.\n\n", "2312.07933": "2023-12-13, **Enhanced Magnetic Field Amplification by Ion-Beam Weibel Instability in Weakly Magnetized Astrophysical Shocks**, Taiki Jikei et.al., [2312.07933v1](http://arxiv.org/abs/2312.07933v1)\n\n We examine the evolution of ion-beam Weibel instability at strong collisionless shocks in weakly magnetized media. We find that a finite background magnetic field substantially affects both linear and nonlinear phases of the instability, depending on whether the background electrons behave magnetized or not. Particle-in-cell simulations for magnetized electrons identify a dynamo-like mechanism of magnetic field amplification, which eventually leads to spontaneous magnetic reconnection. We conclude that this scenario is applicable to typical young supernova remnant shocks.\n\n", "2312.07919": "2023-12-13, **Double Neutron Star Mergers: Are Late-time Radio Signals Overestimated?**, Shao-Ze Li et.al., [2312.07919v1](http://arxiv.org/abs/2312.07919v1)\n\n The coalescence of binary neutron stars can yield the expulsion of a fast-moving, quasi-isotropic material, which may induce thermal radiation and give rise to kilonova emission. Moreover, the interaction between the ejected material and the surrounding environment generates an external shock, which can result in a long-lasting radio signal that persists for several decades following the merger. In contrast to supernova ejecta, kilonova ejecta exhibits a relatively lesser mass and higher velocity, and its expansion may ultimately result in the ejecta density becoming so low that the medium particle can freely pass through the ejecta. Thereby it would lead to a kind of incomplete sweeping on the interstellar medium. Employing a toy model, our investigation reveals that such incomplete sweeping may considerably diminish the late-time radio radiation power, irrespective of whether the binary neutron star merger results in the formation of a black hole or a neutron star. Our findings, thus, imply that the previously reported radio upper limits for certain short gamma-ray bursts may not necessarily place stringent constraints on the presence of a long-lived magnetar remnant in these short GRBs.\n\n"}}