{"neutrino": {"2411.11831": "2024-11-18, **Let there be neutrons! Hadronic photoproduction from a large flux of high-energy photons**, Matthew R. Mumpower et.al., [2411.11831v1](http://arxiv.org/abs/2411.11831v1)\n\n We propose that neutrons may be generated in high-energy, high-flux photon environments via photo-induced reactions on pre-existing baryons. These photo-hadronic interactions are expected to occur in astrophysical jets and surrounding material. Historically, these reactions have been attributed to the production of high-energy cosmic rays and neutrinos. We estimate the photoproduction off of protons in the context of gamma-ray bursts, where it is expected there will be sufficient baryonic material that may be encompassing or entrained in the jet. We show that typical stellar baryonic material, even material completely devoid of neutrons, can become inundated with neutrons in situ via hadronic photoproduction. Consequently, this mechanism provides a means for collapsars and other astrophysical sites containing substantial flux of high-energy photons to be favorable for neutron-capture nucleosynthesis.\n\n", "2411.11804": "2024-11-18, **Novel Application of Neutrinos to Evaluate U.S. Nuclear Weapons Performance**, J. R. Distel et.al., [2411.11804v1](http://arxiv.org/abs/2411.11804v1)\n\n There is a growing realization that neutrinos can be used as a diagnostic tool to better understand the inner workings of a nuclear weapon. Robust estimates demonstrate that an Inverse Beta Decay (IBD) neutrino scintillation detector built at the Nevada Test Site of 1000-ton active target mass at a standoff distance of 500 m would detect thousands of neutrino events per kTe of nuclear yield. This would provide less than 4% statistical error on measured neutrino rate and 5% error on neutrino energy. Extrapolating this to an error on the test device explosive yield requires knowledge from evaluated nuclear databases, non-equilibrium fission rates, and assumptions on internal neutron fluxes. Initial calculations demonstrate that prompt neutrino rates from a short pulse of Pu-239 fission is about a factor of two less than that from a steady state assumption. As well, there are significant energy spectral differences as a function of time after the pulse that needs to be considered. In the absence of nuclear weapons testing, many of the technical and theoretical challenges of a full nuclear test could be mitigated with a low cost smaller scale 20 ton fiducial mass IBD demonstration detector placed near a TRIGA pulsed reactor. The short duty cycle and repeatability of pulses would provide critical real environment testing and the measured neutrino rate as a function of time data would provide unique constraints on fission databases and equilibrium assumptions.\n\n", "2411.11749": "2024-11-18, **Bounds on new neutrino interactions from the first CE$ν$NS data at direct detection experiments**, Valentina De Romeri et.al., [2411.11749v1](http://arxiv.org/abs/2411.11749v1)\n\n Recently, two dark matter direct detection experiments have announced the first indications of nuclear recoils from solar $^8$B neutrinos via coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) with xenon nuclei. These results constitute a turning point, not only for dark matter searches that are now entering the \\textit{neutrino fog}, but they also bring out new opportunities to exploit dark matter facilities as neutrino detectors. We investigate the implications of recent data from the PandaX-4T and XENONnT experiments on both Standard Model physics and new neutrino interactions. We first extract information on the weak mixing angle at low momentum transfer. Then, following a phenomenological approach, we consider Lorentz-invariant interactions (scalar, vector, axial-vector, and tensor) between neutrinos, quarks and charged leptons. Furthermore, we study the $U(1)\\_\\mathrm{B-L}$ scenario as a concrete example of a new anomaly-free vector interaction. We find that despite the low statistics of these first experimental results, the inferred bounds are in some cases already competitive. For the scope of this work we also compute new bounds on some of the interactions using CE$\\nu$NS data from COHERENT and electron recoil data from XENONnT, LUX-ZEPLIN, PandaX-4T, and TEXONO. It seems clear that while direct detection experiments continue to take data, more precise measurements will be available, thus allowing to test new neutrino interactions at the same level or even improving over dedicated neutrino facilities.\n\n", "2411.11523": "2024-11-18, **New multinucleon knockout model in NuWro Monte Carlo generator**, Hemant Prasad et.al., [2411.11523v1](http://arxiv.org/abs/2411.11523v1)\n\n We present the implementation and results of a new model for the n-particle n-hole ($\\it{np-nh}$) contribution in the NuWro event generator, grounded in the theoretical framework established by the Valencia group in 2020. For the $\\it{2p2h}$ component, we introduce a novel nucleon sampling function with tunable parameters to approximate correlations in the momenta of outgoing nucleons. These parameters are calibrated by comparing our results to those of the Valencia model across a range of incoming neutrino energies. In addition, our model incorporates a distinct contribution from the $\\it{3p3h}$ mechanism. We discuss the differences between the new NuWro implementation, the original Valencia model, and the previous NuWro version, focusing on the distribution of outgoing nucleon momenta. Finally, we assess the impact of the hadronic model on experimental analyses involving hadronic observables.\n\n", "2411.11328": "2024-11-18, **Massive neutrinos, Anomalous magnetic moments and Dark matter**, Vandana Sahdev et.al., [2411.11328v1](http://arxiv.org/abs/2411.11328v1)\n\n Amongst the issues plaguing the Standard Model (SM) are questions pertaining to neutrino masses and mixings, the anomalous magnetic moment of the electron and muon and the problem of a suitable dark matter (DM) candidate. All the three issues can be addressed at once by extending the SM with two generations of vector-like fermions and an inert scalar doublet, all odd under a Z2 symmetry. The light neutrino masses and mixings are generated radiatively while maintaining consistency with bounds on lepton flavor violation. Loop diagrams with the very same fields also serve to explain the anomalous magnetic moments. Similarly, the correct dark matter relic abundance is reproduced without coming into conflict with direct detection constraints, or those from big bang nucleosynthesis or the cosmic microwave observations. Finally, prospective signatures at the LHC are discussed.\n\n"}, "dark matter": {"2411.11830": "2024-11-18, **Investigating the galaxy-halo connection of DESI Emission-Line Galaxies with SHAMe-SF**, Sara Ortega-Martinez et.al., [2411.11830v1](http://arxiv.org/abs/2411.11830v1)\n\n The Dark Energy Spectroscopic Instrument (DESI) survey is mapping the large-scale distribution of millions of Emission Line Galaxies (ELGs) over vast cosmic volumes to measure the growth history of the Universe. However, compared to Luminous Red Galaxies (LRGs), very little is known about the connection of ELGs with the underlying matter field. In this paper, we employ a novel theoretical model, SHAMe-SF, to infer the connection between ELGs and their host dark matter subhaloes. SHAMe-SF is a version of subhalo abundance matching that incorporates prescriptions for multiple processes, including star formation, tidal stripping, environmental correlations, and quenching. We analyse the public measurements of the projected and redshift-space ELGs correlation functions at $z=1.0$ and $z=1.3$ from DESI One Percent data release, which we fit over a broad range of scales $r \\in [0.1, 30]/h^{-1}$Mpc to within the statistical uncertainties of the data. We also validate the inference pipeline using two mock DESI ELG catalogues built from hydrodynamical (TNG300) and semi-analytical galaxy formation models (\\texttt{L-Galaxies}). SHAMe-SF is able to reproduce the clustering of DESI-ELGs and the mock DESI samples within statistical uncertainties. We infer that DESI ELGs typically reside in haloes of $\\sim 10^{11.8}h^{-1}$M$\\_{\\odot}$ when they are central, and $\\sim 10^{12.5}h^{-1}$M$\\_{\\odot}$ when they are a satellite, which occurs in $\\sim$30 \\% of the cases. In addition, compared to the distribution of dark matter within halos, satellite ELGs preferentially reside both in the outskirts and inside haloes, and have a net infall velocity towards the centre. Finally, our results show evidence of assembly bias and conformity.\n\n", "2411.11716": "2024-11-18, **Glueball Axion-Like Particles**, Pierluca Carenza et.al., [2411.11716v1](http://arxiv.org/abs/2411.11716v1)\n\n Dark Yang-Mills sectors that confine to form stable composite states, known as glueballs, have been traditionally proposed as a potential explanation for cosmological Dark Matter (DM). Earlier studies have established viability of the lightest scalar glueball as a possible DM candidate. In this work, we explore a whole class of effective composite sectors in the confined Yang-Mills regime featuring an additional pseudoscalar glueball state. We also investigate the role of effective interactions of the dark glueball sector with the visible sectors via higher-dimensional operators primarily focusing on dimension-8 couplings of glueballs to photons and gluons. We stress the remarkable similarities between the phenomenology of such glueball effective theories and Standard Model extensions featuring Axion-Like Particles (ALPs). Hence, one deals with a new class of composite Glueball ALPs (or GALPs) coupled to photons and/or nucleons in a wide mass range, from sub-eV to the Planck scale, yielding viable DM candidates that can be probed by astrophysical and cosmological observations.\n\n", "2411.11680": "2024-11-18, **Observational features of the rotating Bardeen black hole surrounded by perfect fluid dark matter**, Ke-Jian He et.al., [2411.11680v1](http://arxiv.org/abs/2411.11680v1)\n\n By employing ray-tracing techniques, we investigate the shadow images of rotating Bardeen black holes surrounded by perfect fluid dark matter. In this work, two models are considered for the background light source, namely the celestial light source model and the thin accretion disk model. Regarding the celestial light source, the investigation focuses on the impact of variations in relevant parameters and observed inclination on the contour and size of the shadow. For the thin accretion disk model, the optical appearance of a black hole is evidently contingent upon the radiative properties exhibited by the accretion disk, as well as factors such as observed inclination and relevant parameters governing spacetime. With an increasing observation inclination, the observed flux of direct and lensed images of the accretion disk gradually converge towards the lower region of the image, while an increase in the dark matter parameter $a$ significantly expands the region encompassing both direct and lensed images. Furthermore, the predominant effect is redshift at lower observation angles, whereas the blueshift effect only becomes apparent at higher observation angles. Simultaneously, the increase in the observation inclination will amplify the redshift effect, whereas an increase in the magnetic charge $\\mathcal{G}$, rotation parameter $a$ and the absolute value of dark matter parameter $\\alpha$ will attenuate the redshift effect observed in the image. These observations of a rotating Bardeen black hole surrounded by perfect fluid dark matter could provide a convenient way to distinguish it from other black hole models.\n\n", "2411.11534": "2024-11-18, **A Broad-line, Low-luminosity Active Galactic Nucleus at ${z=7.3}$ Anchoring a Large Galaxy Overdensity**, Jan-Torge Schindler et.al., [2411.11534v1](http://arxiv.org/abs/2411.11534v1)\n\n The James Webb Space Telescope has uncovered a puzzling population of UV-faint broad-line active galactic nuclei (AGN), nicknamed ``Little Red Dots'' (LRD) owing to their compact morphology and red rest-frame optical colours. Interpreted as dust attenuated AGN, their inferred intrinsic luminosities and supermassive black hole (SMBH) masses rival those of UV-luminous quasars, although they are $>100$ times more abundant. If LRDs and quasars are members of the same underlying population, they should inhabit comparable mass dark matter halos, traced by similar overdensities of galaxies. Otherwise, they represent distinct populations with different physical properties and formation histories. Characterizing LRD environments thus provides a critical test of their nature. Here, we report the discovery of a LRD at $z=7.3$, attenuated by moderate amounts of dust, $A\\_V = {3.26}\\,\\rm{mag}$, with an intrinsic bolometric luminosity of $10^{46.7}\\,\\rm{erg}\\,\\rm{s}^{-1}$ and a SMBH mass of $7\\times10^8\\,\\rm{M}\\_\\odot$. Most notably, this object is embedded in an overdensity of eight nearby galaxies, allowing us to calculate the first spectroscopic estimate of the clustering of galaxies around LRDs. We find a LRD-galaxy cross-correlation length of $r\\_0\\!=\\!9\\pm2\\,\\rm{h}^{-1}\\,\\rm{cMpc}$, comparable to that of $z\\!\\sim\\!6$ UV-luminous quasars. The resulting estimate of their minimum dark matter halo mass of $\\log\\_{10}(M\\_{\\rm{halo, min}}/\\rm{M}\\_{\\odot})= 12.3\\_{-0.8}^{+0.7}$ indicates that nearly all halos above this mass must host actively accreting SMBHs at $z\\approx7$, in strong contrast with the far smaller duty cycle of luminous quasars ($<1\\%$). Our results, taken at face value, motivate a picture in which LRDs are the obscured counterparts of UV-luminous quasars, which provides a natural explanation for the short UV-luminous lifetimes inferred from both quasar clustering and quasar proximity zones.\n\n", "2411.11446": "2024-11-18, **Strong Correlation between Galactic HI-to-stellar Mass Ratio And Halo Spin Explored by HI-rich Galaxies**, Shihong Liu et.al., [2411.11446v1](http://arxiv.org/abs/2411.11446v1)\n\n Using a semi-analytic approach, we estimate halo spins for a large sample of HI-rich galaxies from the Arecibo Legacy Fast Alfa Survey and examine the correlation between HI mass fractions and halo spins. Our analysis reveals a strong correlation between halo spin and the HI-to-stellar mass ratio in both low-mass and massive galaxy samples. This finding suggests a universal formation scenario: higher halo spin reduces angular momentum loss and gas condensation, leading to lower star formation rates and weaker feedback, which in turn helps retain gas within dark matter halos.\n\n", "2411.11443": "2024-11-18, **Halo Spin Depends on The Distance to Large-scale Filament**, Wenxiao Xue et.al., [2411.11443v1](http://arxiv.org/abs/2411.11443v1)\n\n We employ a semi-analytical methodology to estimate the dark matter halo spin of HI gas-rich galaxies in the Arecibo Legacy Fast Alfa Survey and investigate the relationship between halo spin and the proximity of galaxies to large-scale filaments. We exclude galaxies with low HI signal-to-noise ratios, those potentially influenced by velocity dispersions, and those affiliated with galaxy clusters/groups. Additionally, we apply a mass-weighting technique to ensure consistent mass distribution across galaxy samples at varying distances from filaments. Our analysis reveals, for the first time, a subtle yet statistically significant correlation between halo spin and filament distance in observational data, indicating higher spins closer to filaments. This suggests that the tidal forces exerted by filaments may impact the spin of dark matter halos.\n\n", "2411.11280": "2024-11-18, **AI-Powered Reconstruction of Dark Matter Velocity Fields from Redshift-Space Halo Distribution**, Xu Xiao et.al., [2411.11280v1](http://arxiv.org/abs/2411.11280v1)\n\n In the study of cosmology and galaxy evolution, the peculiar velocity and density field of dark matter (DM) play a crucial role in studying many issues. Here, we propose a UNet-based deep learning to reconstruct the real-space DM velocity field from the spatial distribution of a sparse sample of DM halos in redshift space. By comparing and testing various properties, we demonstrate that the reconstructed velocity field is in good agreement with the actual situation. At $k<0.3~h/{\\rm Mpc}$, the reconstruction of various velocity field components, including velocity magnitude and divergence, outperforms traditional linear perturbation theory. Additionally, the effects of redshift space distortions (RSD) are well corrected using the UNet model. Compared to the true real-space power spectra, the UNet reconstruction provides an unbiased estimate of the density, velocity, and momentum fields, remaining consistent within $2\\sigma$ level. We also demonstrate that the UNet model remains effective even with limited information about halo masses. Thus, our proposed UNet model has a wide range of applications in various aspects of cosmology, such as RSD, cosmic web analysis, the kinetic Sunyaev-Zel'dovich effect, BAO reconstruction, and so on.\n\n", "2411.11236": "2024-11-18, **Copositive criteria for a two-component dark matter model**, XinXin Qi et.al., [2411.11236v2](http://arxiv.org/abs/2411.11236v2)\n\n We consider a two-component scalar dark matter model in this work, where the scalars are stabilized by extra $Z\\_2 \\times Z'\\_2$ symmetry. To guarantee the stability of the vacuum, we consider the copositive criteria and different choices of the signs of the couplings will contribute to different viable parameter spaces. Based on the copositive criteria, we systematically analyze the possible conditions and pick up 17 different cases with fixing some parameters to be negative. We randomly scan the parameter space under dark matter relic density constraint and direct detection constraint and focus on the quartic couplings with $\\lambda\\_{13}$,$\\lambda\\_{23}$,$\\lambda\\_{14}$ and $\\lambda\\_{24}$. The shapes of the viable parameter space for $\\|\\lambda\\_{14}\\|-\\|\\lambda\\_{24}\\|$ are almost similar among these cases, while for $\\|\\lambda\\_{13}\\|$ and $\\|\\lambda\\_{23}\\|$, the larger value are excluded as long as $\\lambda\\_{13}\\leqslant 0$ and $\\lambda\\_{23}\\leqslant 0$ due to the large interference effect of the $2 \\to 2$ processes.\n\n"}, "supernova": {"2411.11837": "2024-11-18, **The JWST EXCELS survey: tracing the chemical enrichment pathways of high-redshift star-forming galaxies with O, Ar and Ne abundances**, T. M. Stanton et.al., [2411.11837v1](http://arxiv.org/abs/2411.11837v1)\n\n We present an analysis of nine star-forming galaxies with $\\langle z \\rangle = 3.95$ from the JWST EXCELS survey for which we obtain robust chemical abundance estimates for the $\\alpha$-elements O, Ne and Ar. The $\\alpha$-elements are primarily produced via core-collapse supernovae (CCSNe) which should result in $\\alpha$-element abundance ratios that do not vary significantly across cosmic time. However, Type Ia supernovae (SNe Ia) models predict an excess production of Ar relative to O and Ne. The Ar/O abundance ratio can therefore be used as a tracer of the relative enrichment of CCSNe and SNe Ia in galaxies. Our sample approximately doubles the number of sources with measurements of ${\\rm Ar/O}$ at $z > 2$, and we find that our sample exhibits sub-solar Ar/O ratios on average, with $\\rm{Ar/O} = 0.62 \\pm 0.10 \\, (\\rm{Ar/O})\\_{\\odot}$. In contrast, the average Ne/O abundance is fully consistent with the solar ratio, with $\\rm{Ne/O} = 1.07 \\pm 0.12 \\, (\\rm{Ne/O})\\_{\\odot}$. Our results support a scenario in which Ar has not had time to build up in the interstellar medium of young high-redshift galaxies, which are dominated by CCSNe enrichment. We show that these abundance estimates are in good agreement with recent Milky Way chemical evolution models, and with Ar/O trends observed for planetary nebulae in the Andromeda galaxy. These results highlight the potential for using multiple element abundance ratios to constrain the chemical enrichment pathways of early galaxies with JWST.\n\n", "2411.11685": "2024-11-18, **BAO vs. SN evidence for evolving dark energy**, Alessio Notari et.al., [2411.11685v1](http://arxiv.org/abs/2411.11685v1)\n\n We critically review the evidence for time-varying dark energy from recent Baryon Acoustic Oscillations (BAO) and Supernova (SN) observations. First, we show that such evidence is present at the 3$\\sigma$ level, even without the new BAO data from the dark energy Spectroscopic Instrument (DESI), by instead using BAO data from the dark energy Survey (DES), combined with the DES5Y supernovae and Planck CMB data. Next, we examine the role of the DES5Y supernova dataset, showing that the preference for time-varying dark energy is driven by the low redshift supernovae common to both the DES5Y and Pantheon+ compilations. We find that combining Pantheon+ and DES5Y supernovae by removing the common supernovae leads to two different results, depending on whether they are removed from the DES5Y or the Pantheon+ catalog, leading to stronger or weaker exclusion of $\\Lambda$CDM, at the (3.8$\\sigma$) and (2.5$\\sigma$) level, respectively. These common supernovae have smaller error bars in DES5Y compared to Pantheon+, and, as recently pointed out, there is an offset in magnitude in DES5Y between supernovae at ($z > 0.1$), where almost all the measurements taken during the full five years of DES are, and the low-redshift ones ($z < 0.1$), where all the historical set of nearby supernovae lies. We show that marginalizing over such an offset in DES5Y would lead to significantly weaker evidence for evolving dark energy.\n\n", "2411.11643": "2024-11-18, **Non-LTE radiative transfer simulations: Improved agreement of the double detonation with normal Type Ia supernovae**, Christine E. Collins et.al., [2411.11643v1](http://arxiv.org/abs/2411.11643v1)\n\n The double detonation is a widely discussed explosion mechanism for Type Ia supernovae, whereby a helium shell detonation ignites a secondary detonation in the carbon/oxygen core of a white dwarf. Even for modern models that invoke relatively small He shell masses, many previous studies have found that the products of the helium shell detonation lead to discrepancies with normal Type Ia supernovae, such as strong Ti II absorption features, extremely red light curves and too large a variation with viewing direction. It has been suggested that non local thermodynamic equilibrium (non-LTE) effects may help to reduce these discrepancies with observations. Here we carry out full non-LTE radiative transfer simulations for a recent double detonation model with a relatively small helium shell mass of 0.05 M$\\_\\odot$. We construct 1D models representative of directions in a 3D explosion model to give an indication of viewing angle dependence. The full non-LTE treatment leads to improved agreement between the models and observations. The light curves become less red, due to reduced absorption by the helium shell detonation products, since these species are more highly ionised. Additionally, the expected variation with observer direction is reduced. The full non-LTE treatment shows promising improvements, and reduces the discrepancies between the double detonation models and observations of normal Type Ia supernovae.\n\n", "2411.11517": "2024-11-18, **Spectroscopic Modeling of Luminous Transients Powered by H-Rich and He-Rich Circumstellar Interaction**, Gururaj A. Wagle et.al., [2411.11517v1](http://arxiv.org/abs/2411.11517v1)\n\n In this study, we perform detailed spectroscopic modeling to analyze the interaction of circumstellar material (CSM) with ejecta in both hydrogen-rich and hydrogen-poor superluminous supernovae (SLSNe), systematically varying properties such as CSM density, composition, and geometry to explore their effects on spectral lines and light curve evolution. Using advanced radiative transfer simulations with the new, open-source SuperLite code to generate synthetic spectra, we identify key spectroscopic indicators of CSM characteristics. Our findings demonstrate that spectral lines of hydrogen and helium exhibit significant variations due to differences in CSM mass and composition. In hydrogen-rich SLSN- II, we observe pronounced hydrogen emission lines that correlate strongly with dense, extended CSM, suggesting massive, eruptive mass-loss histories. Conversely, in hydrogen-poor SLSNe, we recover mostly featureless spectra at early times, with weak hydrogen lines appearing only in the very early phases of the explosion, highlighting the quick ionization of traces of hydrogen present in the CSM. We analyze the properties of the resulting emission lines, particularly $\\rm H\\_{\\alpha}$ and $\\rm H\\_{\\beta}$, for our models using sophisticated statistical methods. This analysis reveals how variations in the supernova progenitor and CSM properties can lead to distinct spectroscopic evolutions over time. These temporal changes provide crucial insights into the underlying physics driving the explosion and the subsequent interaction with the CSM. By linking these spectroscopic observations to the initial properties of the progenitor and its surrounding ma\n\n", "2411.11503": "2024-11-18, **Velocity evolution of broad-line Ic supernovae with and without gamma-ray bursts**, Gabriel Finneran et.al., [2411.11503v1](http://arxiv.org/abs/2411.11503v1)\n\n There are more than 60 broad-line Ic (Ic-BL) supernovae (SNe) which are associated with a long Gamma-ray Burst (GRB). A large population of `ordinary' Ic-BLs for which no GRB component is detected also exists. On average, the expansion velocities of GRB-associated Ic-BLs exceed those of ordinary Ic-BLs. This work presents the largest spectroscopic sample of Ic-BL SNe with and without GRBs to date. The goal of this work is to investigate how the expansion velocities evolve in cases where an ultra-relativistic jet has been launched (GRB-SN cases) and compare these to Ic-BL SNe without a GRB detection. We measured the expansion velocities of the Fe II, Si II and Ca II lines observed in the spectra of Ic-BL SNe using a spline fitting method. We fit the expansion velocity evolution with single and broken power-laws. The expansion velocities of the Fe II and Si II features reveal considerable overlap between the two populations. It is not clear that GRB-associated supernovae expand more rapidly. Broken power-law evolution appears to be more common for the Si II feature, which always follows a shallow-steep decay, while the broken power-law Fe II decays are predominantly steep-shallow. The power-law indices for both samples were compared for both Fe II and Si II, and suggest that GRB-SNe decline at a similar rate to non-GRB Ic-BL supernovae. Neither the velocities nor their evolution can be used to distinguish between Ic-BLs with and without GRBs. Expansion velocities consistent with broken power-law evolution may indicate the presence of two velocity components, which may be evidence for a jet in some of these explosions. However, it is not possible to rule in or out the presence of a jet in any Ic-BL supernova purely based on the velocities. These results suggest that GRB-SNe and Ic-BLs are drawn from the same underlying population of events.\n\n", "2411.11251": "2024-11-18, **The Black Hole$-$Stellar Mass Relation in the Dwarf-galaxy Regime with $Gaia$-Sausage/Enceladus and $ω$Centauri**, Guilherme Limberg et.al., [2411.11251v1](http://arxiv.org/abs/2411.11251v1)\n\n The discovery of fast moving stars in the Milky Way's most massive globular cluster, $\\omega$Centauri ($\\omega$Cen), has provided strong evidence for an intermediate-mass black hole (IMBH) inside of it. However, $\\omega$Cen is known to be the stripped nuclear star cluster (NSC) of an ancient, now-destroyed, dwarf galaxy. The best candidate to be the original host progenitor of $\\omega$Cen is the tidally disrupted dwarf $Gaia$-Sausage/Enceladus (GSE), a former Milky Way satellite as massive as the Large Magellanic Cloud. I compare $\\omega$Cen/GSE with other central BH hosts and place it within the broader context of BH-galaxy (co)evolution. The IMBH of $\\omega$Cen/GSE follows the scaling relation between central BH mass and host stellar mass (${\\rm M}\\_{\\rm BH}{-}{\\rm M}\\_\\star$) extrapolated from local massive galaxies (${\\rm M}\\_\\star \\gtrsim 10^{10}\\,{\\rm M}\\_\\odot$). Therefore, the IMBH of $\\omega$Cen/GSE suggests that this relation extends to the dwarf-galaxy regime. I verify that $\\omega$Cen (GSE), as well as other NSCs with candidate IMBHs and ultracompact dwarf galaxies, also follow the ${\\rm M}\\_{\\rm BH}{-}\\sigma\\_\\star$ relation with stellar velocity dispersion. Under the assumption of a direct collapse BH, $\\omega$Cen/GSE's IMBH would require a low initial mass ($\\lesssim$10,000 ${\\rm M}\\_{\\odot}$) and almost no accretion over $\\sim$3 Gyr, which could be the extreme opposite of high-$z$ galaxies with overmassive BHs such as GN-z11. If $\\omega$Cen/GSE's IMBH formed from a Population III supernova remnant, then it could indicate that both light and heavy seeding mechanisms of central BH formation are at play. Other stripped NSCs and dwarf galaxies could help further populate the ${\\rm M}\\_{\\rm BH}{-}{\\rm M}\\_{\\star}$ and ${\\rm M}\\_{\\rm BH}{-}\\sigma\\_\\star$ relations in the low-mass regime and constraint IMBH demographics and their formation channels.\n\n"}}