{"neutrino": {"2307.09462": "2023-07-18, **NUTRIG: Towards an Autonomous Radio Trigger for GRAND**, Pablo Correa et.al., [2307.09462v1](http://arxiv.org/abs/2307.09462v1)\n\n One of the major challenges for large-scale radio surface arrays, such as the Giant Radio Array for Neutrino Detection (GRAND), is the requirement of an autonomous online trigger for radio signals induced by extensive air showers. The NUTRIG project lays the foundations for the development of a pure, efficient, and scalable trigger in the context of GRAND. For this purpose, a GRAND prototype setup of four detection units has been deployed at Nan\\c{c}ay, France, which currently serves as the main testing facility for the deployment of this autonomous trigger. This work provides a detailed description of the GRAND@Nan\\c{c}ay setup, and a first analysis of background data gathered on site. Initial tests of signal recovery in laboratory conditions are also presented. Finally, near-future plans are outlined to scale NUTRIG to larger pathfinder arrays such as GRANDProto300.\n\n", "2307.09460": "2023-07-18, **Probing Light Dark Matter through Cosmic-Ray Cooling in Active Galactic Nuclei**, Gonzalo Herrera et.al., [2307.09460v1](http://arxiv.org/abs/2307.09460v1)\n\n Recent observations of high-energy neutrinos from active galactic nuclei (AGN), NGC 1068 and TXS 0506+056, suggest that cosmic rays (CRs) are accelerated in the vicinity of the central supermassive black hole and high-energy protons and electrons can cool efficiently via interactions with ambient photons and gas. The dark matter density may be significantly enhanced near the central black hole, and CRs could lose energies predominantly due to scatterings with the ambient dark matter particles. We propose CR cooling in AGN as a new probe of dark matter-proton and dark matter-electron scatterings. Under plausible astrophysical assumptions, our constraints on sub-GeV dark matter can be the strongest derived to date. Some of the parameter space favored by thermal light dark matter models might already be probed with current multimessenger observations of AGN.\n\n", "2307.09241": "2023-07-18, **Neutrino Cross Sections: Interface of shallow- and deep-inelastic scattering for collider neutrinos**, Yu Seon Jeong et.al., [2307.09241v1](http://arxiv.org/abs/2307.09241v1)\n\n Neutrino experiments in a Forward Physics Facility at the Large Hadron Collider can measure neutrino and antineutrino cross sections for energies up to a few TeV. For neutrino energies below 100 GeV, the inelastic cross section evaluations have contributions from weak structure functions at low momentum transfers and low hadronic final state invariant mass. To evaluate the size of these contributions to the neutrino cross section, we use a parametrization of the electron-proton structure function, adapted for neutrino scattering, augmented with a correction to account for the partial conservation of the axial vector current, and normalized to structure functions evaluated at next-to-leading order in QCD, with target mass corrections and heavy quark corrections. We compare our results with other approaches to account for this kinematic region in neutrino cross section for energies between 10--1000 GeV on isoscalar nucleon and iron targets.\n\n", "2307.09170": "2023-07-18, **Hunting for bumps in the diffuse high-energy neutrino flux**, Damiano F. G. Fiorillo et.al., [2307.09170v1](http://arxiv.org/abs/2307.09170v1)\n\n The origin of the TeV--PeV astrophysical neutrinos seen by the IceCube telescope is unknown. If they are made in proton-photon interactions in astrophysical sources, their spectrum may show bump-like features. We search for such features in the 7.5-years High-Energy Starting Events (HESE), and forecast the power of such searches using larger data samples expected from upcoming telescopes. Present-day data reveals no evidence of bump-like features, which allows us to constrain candidate populations of photohadronic neutrino sources. Near-future forecasts show promising potential for stringent constraints or decisive discovery of bump-like features. Our results provide new insight into the origins of high-energy astrophysical neutrinos, complementing those from point-source searches.\n\n", "2307.08961": "2023-07-18, **Effect of Neutrinos on Angular Momentum of Dark Matter Halo**, Yu Chen et.al., [2307.08961v1](http://arxiv.org/abs/2307.08961v1)\n\n Massive neutrinos are expected to affect the large-scale structure formation, including the major component of solid substances, dark matter halos. How halos are influenced by neutrinos is vital and interesting, and angular momentum (AM) as a significant feature provides a statistical perspective for this issue. Exploring halos from TianNu N-body cosmological simulation with the co-evolving neutrino particles, we obtain some concrete conclusions. First, by comparing the same halos with and without neutrinos, in contrast to the neutrino-free case, over 89.71\\% of halos have smaller halo moduli, over 71.06\\% have smaller particle-mass-reduced (PMR) AM moduli, and over 95.44\\% change their orientations of less than $0.65^\\circ$. Moreover, the relative variation of PMR modulus is more visible for low-mass halos. Second, to explore the PMR moduli of halos in dense or sparse areas, we divide the whole box into big cubes, and search for halos within a small spherical cell in a single cube. From the two-level divisions, we discover that in denser cubes, the variation of PMR moduli with massive neutrinos decreases more significantly. This distinction suggests that neutrinos exert heavier influence on halos' moduli in compact regions. With massive neutrinos, most halos (86.60\\%) have lower masses than without neutrinos.\n\n", "2307.08842": "2023-07-17, **A view of Coherent Elastic Neutrino-Nucleus Scattering**, M. Cadeddu et.al., [2307.08842v1](http://arxiv.org/abs/2307.08842v1)\n\n We review the physics of coherent elastic neutrino-nucleus scattering and the results and perspectives for the measurements of the radius of the neutron distribution of the nucleus, of the weak mixing angle, and of new neutrino interactions due to physics beyond the Standard Model.\n\n", "2307.08785": "2023-07-17, **Red Supergiant Candidates for Multimessenger Monitoring of the Next Galactic Supernova**, Sarah Healy et.al., [2307.08785v1](http://arxiv.org/abs/2307.08785v1)\n\n We compile a catalog of 598 highly probable and 79 likely red supergiants (RSGs) of the Milky Way, which represents the largest list of Galactic RSG candidates to date. We matched distances measured by Gaia DR3, 2MASS photometry, and a 3D Galactic dust map to obtain luminous bright late-type stars. Determining the stars' bolometric luminosities and effective temperatures, we compared to Geneva stellar evolution tracks to determine likely RSG candidates, and quantified contamination using a catalog of Galactic AGB in the same luminosity-temperature space. We add details for common or interesting characteristics of RSG, such as multi-star system membership, variability, and classification as a runaway. As potential future core-collapse supernova (SN) progenitors, we studied the ability of the catalog to inform the Supernova Early Warning System (SNEWS) coincidence network made to automate pointing, and show that for 3D position estimates made possible by neutrinos, the number of progenitor candidates can be significantly reduced, improving our ability to observe the progenitor pre-explosion and the early phases of the core-collapse supernova.\n\n", "2307.08744": "2023-07-17, **New constraints on the gamma-ray and high energy neutrino fluxes from the circumstellar interaction of SN 2023ixf**, Prantik Sarmah et.al., [2307.08744v1](http://arxiv.org/abs/2307.08744v1)\n\n The recent supernova, SN 2023ixf, one of the closest observed type II SNe has revealed the presence of a dense circumstellar material (CSM). Interaction of the SN ejecta with this dense CSM may create high energy protons of PeV energies through shock acceleration. These accelerated protons then colliding with the CSM (inelastic $pp$ collision) can produce secondaries such as high energy gamma-rays and neutrinos. However, no gamma-rays and neutrinos have been detected by Fermi-LAT and IceCube from this event. Indeed, Fermi-LAT has placed an upper limits on the gamma-ray flux above $100$~MeV to be $2.6 \\times 10^{-11}~\\rm erg~cm^{-2}~s^{-1}$. On the other hand IceCube's upper limit on muon neutrino flux is $7.3\\times 10^{-2} ~\\rm GeV~cm^{-2}$. Using these experimental constraints and shock-CSM properties derived from observations, we obtain new upper limits on the gamma-ray ($10^{-11}~\\rm erg~cm^{-2}~s^{-1}$) and neutrino ($10^{-3}~\\rm GeV~cm^{-2}$) fluxes from SN 2023ixf produced via the $pp$ interaction channel. While we found the gamma-ray flux to be consistent with Fermi-LAT's upper limit, the neutrino flux is found to be about $2$ order smaller than the IceCube's upper limit. We further analyse detection prospects of such secondary signals from future SN 2023 like events with upcoming detectors, CTA and IceCube-Gen2 and found to have great discovery potential, if any event occurs within $7$ Mpc.\n\n", "2307.08735": "2023-07-17, **Neutrino Signatures of One Hundred 2D Axisymmetric Core-Collapse Supernova Simulations**, David Vartanyan et.al., [2307.08735v1](http://arxiv.org/abs/2307.08735v1)\n\n We present in this paper a public data release of an unprecedentedly-large set of core-collapse supernova (CCSN) neutrino emission models, comprising one hundred detailed 2D-axisymmetric radiation-hydrodynamic simulations evolved out to as late as ~5 seconds post-bounce and spanning a extensive range of massive-star progenitors. The motivation for this paper is to provide a physically and numerically uniform benchmark dataset to the broader neutrino detection community to help it characterize and optimize subsurface facilities for what is likely to be a once-in-a-lifetime galactic supernova burst event. With this release we hope to 1) help the international experiment and modeling communities more efficiently optimize the retrieval of physical information about the next galactic core-collapse supernova, 2) facilitate the better understanding of core-collapse theory and modeling among interested experimentalists, and 3) help further integrate the broader supernova neutrino community.\n\n", "2307.08634": "2023-07-17, **Gauging the cosmic ray muon puzzle with the Forward Physics Facility**, Sergio J. Sciutto et.al., [2307.08634v1](http://arxiv.org/abs/2307.08634v1)\n\n We investigate the observed muon deficit in air shower simulations when compared to ultrahigh-energy cosmic ray (UHECR) data. Gleaned from the observed enhancement of strangeness production in ALICE data, the associated $\\pi \\leftrightarrow K$ swap is taken as a cornerstone to resolve the muon puzzle via its corresponding impact on the shower evolution. We develop a phenomenological model in terms of the $\\pi \\leftrightarrow K$ swapping probability $F\\_s$. We provide a parametrization of $F\\_s (E^{\\rm (proj)}, \\eta)$ that can accommodate the UHECR data, where $E^{\\rm (proj)}$ is the projectile energy and $\\eta$ the pseudorapidity. We also explore a future game plan for model improvement using the colossal amount of data to be collected by LHC neutrino detectors at the Forward Physics Facility (FPF). We calculate the corresponding sensitivity to $F\\_s$ and show that the FPF experiments will be able to probe the model phase space.\n\n", "2307.08608": "2023-07-17, **Pressure safety approach for PIP-II cryogenic distribution system and cryomodules**, William Soyars et.al., [2307.08608v1](http://arxiv.org/abs/2307.08608v1)\n\n The Proton Improvement Plan-II (PIP-II) is a superconducting linear accelerator being built at Fermilab that will provide 800 MeV proton beam for neutrino production. The linac consists of a total of twenty-three (23) cryomodules of five (5) different types. Cooling is required at 2K, 5K and 40K. The Cryogenic Distribution System (CDS) consists of a Distribution Valve Box, ~285 m of cryogenic transfer line, modular Bayonet Cans to interface with cryomodules, and a Turnaround Can. The cryogenic system must provide protection from over-pressure by sizing pressure relief devices for all volumes and process line circuits. The cryomodule cavity circuits have dual pressure ratings, 4.1 bara when cold and 2.05 bara when warm (T>80K). Worst case relieving cases will be identified. The methods for determining heat flux will be presented. For the relieving occurring in the linac tunnel, flow must vent to outside to avoid an oxygen deficiency hazard. Also, we will present vacuum vessel relief sizing to protect the cryogenic distribution system vacuum shells from over pressure during an internal line rupture. The project is funded by US DOE Offices of Science, High Energy Physics.\n\n", "2307.08427": "2023-07-17, **Neutrino decoupling and the transition to cold dark matter**, Roman Schnabel et.al., [2307.08427v1](http://arxiv.org/abs/2307.08427v1)\n\n About 40 years ago, the neutrino was ruled out as the dark matter particle based on several arguments. Here I use the well-established concept of quantum uncertainties of position and momentum to describe the decoupling of neutrinos from the primordial plasma, which took place about half a second after the Big Bang. In this way I show that the main arguments against the neutrino are either wrong or have loopholes, and conclude that the neutrino urgently needs to be reconsidered, not as a 'hot', but as the 'cold' dark matter particle.\n\n", "2307.08375": "2023-07-17, **Standard Model Higgs inflation supplemented by minimal dark matter**, Shinsuke Kawai et.al., [2307.08375v1](http://arxiv.org/abs/2307.08375v1)\n\n Renormalisation group analysis with the present measurements of the top quark mass $m\\_t = 172.69\\pm 0.30$ GeV indicates that the Standard Model (SM) Higgs potential becomes unstable at energy scales $\\sim 10^{10}$ GeV. This may be interpreted as hinting at new particles at high energy. The minimal extension of the SM that can avoid this instability while leaving the SM Higgs as the sole scalar particle of the theory is obtained by adding suitable fermions to the SM. These fermions are good dark matter candidates and the model is known as the minimal dark matter model. We revisit the inflationary scenario based on the minimal dark matter model, taking into account updated parameter constraints and recent understanding of reheating dynamics. We explore the model with different values of the right-handed neutrino mass and find that the cosmological prediction is insensitive to such details. We obtained a spectral index of the cosmic microwave background $n\\_s=9.672$ and a tensor-to-scalar ratio $r=0.0031$ as a robust prediction of this scenario.\n\n", "2307.08269": "2023-07-17, **Fast evaluation of heavy-quark contributions to DIS in APFEL++**, P. Risse et.al., [2307.08269v1](http://arxiv.org/abs/2307.08269v1)\n\n Mass-dependent quark contributions are of great importance to DIS processes. The simplified-ACOT-scheme includes these effects over a wide range of momentum transfers up to next-to-leading order in QCD. In recent years an improvement in the case of neutral current DIS has been achieved by using zero-mass contributions up to next-to-next-to-leading order (NNLO) with massive phase-space constraints. In this work, we extend this approach to the case of charged current DIS and provide an implementation in the open-source code APFEL++. The increased precision will be valuable for ongoing and future neutrino programs, the Electron-Ion-Collider and the studies of partonic substructure of hadrons and nuclei. A highly efficient implementation using gridding techniques extends the applicability of the code to the determination of parton distribution functions (PDFs).\n\n"}, "dark matter": {"2307.09451": "2023-07-18, **The effect of pressure-anisotropy-driven kinetic instabilities on magnetic field amplification in galaxy clusters**, Y. Rappaz et.al., [2307.09451v1](http://arxiv.org/abs/2307.09451v1)\n\n The intracluster medium (ICM) is the low-density diffuse magnetized plasma in galaxy clusters, which reaches virial temperatures of up to 10^8 K. Under these conditions, the plasma is weakly collisional and therefore has an anisotropic pressure tensor with respect to the local direction of the magnetic field. This triggers very fast, Larmor-scale, pressure-anisotropy-driven kinetic instabilities that alter magnetic field amplification. We study magnetic field amplification through a turbulent small-scale dynamo, including the effects of the kinetic instabilities, during the evolution of a typical massive galaxy cluster. A specific aim of this work is to establish a redshift limit from which a dynamo has to start to amplify the magnetic field up to equipartition with the turbulent velocity field at redshift z=0. We implemented 1D radial profiles for various plasma quantities for merger trees generated with the Modified GALFORM algorithm. We assume that turbulence is driven by successive mergers of dark matter halos and construct effective models for the Reynolds number Re\\_eff dependence on the magnetic field in three different magnetization regimes, including the effects of kinetic instabilities. The magnetic field growth rate is calculated for the different Re\\_eff models. The model results in a higher magnetic field growth rate at higher redshift. For all scenarios considered, to reach equipartition at z=0, the amplification of the magnetic field has to start at redshift z\\_start=1.5 and above. The time to reach equipartition can be significantly shorter, in cases with systematically smaller turbulent forcing scales, and for the highest Re\\_eff models. Merger trees are useful tools for studying the evolution of magnetic fields in weakly collisional plasmas, and could also be used to constrain the different stages of the dynamo that potentially could be observed by future radio telescopes.\n\n", "2307.09245": "2023-07-18, **Axion dark matter with explicit Peccei-Quinn symmetry breaking in the axiverse**, Hai-Jun Li et.al., [2307.09245v1](http://arxiv.org/abs/2307.09245v1)\n\n It is shown that the required high quality of the Peccei-Quinn (PQ) symmetry can be a natural outcome of the multiple QCD axion models. In the axiverse, a hypothetical mass mixing between the QCD axions and axion-like particles (ALPs) can occur, which leads to an interesting phenomenon called the level crossing. In this paper, we investigate this mass mixing between one QCD axion and one ALP with the explicit PQ symmetry breaking in the early Universe. The dynamics of the axions and their cosmological evolutions when the level crossing occurs in this scenario are studied in detail. Then we focus our attention on the axion dark matter (DM) abundance. With several typical parameter sets for level crossing, we find that in the presence of the explicit PQ symmetry breaking term in the mixing, the total axion DM abundance is dominated by ALP and significantly suppressed.\n\n", "2307.09197": "2023-07-18, **Sensitivity of Space-based Gravitational-Wave Interferometers to Ultralight Bosonic Fields and Dark Matter**, Jiang-Chuan Yu et.al., [2307.09197v1](http://arxiv.org/abs/2307.09197v1)\n\n Ultralight bosonic fields (ULBFs) are predicted by various theories beyond the standard model of particle physics and are viable candidates of cold dark matter. There have been increasing interests to search for the ULBFs in physical and astronomical experiments. In this paper, we investigate the sensitivity of several planned space-based gravitational-wave interferometers to ultralight scalar and vector fields. Using time-delay interferometry (TDI) to suppress the overwhelming laser frequency noise, we derive the averaged transfer functions of different TDI combinations to scalar and vector fields, and estimate the impacts of bosonic field's velocities. We obtain the sensitivity curves for LISA, Taiji and TianQin, and explore their projected constraints on the couplings between ULBFs and standard model particles, illustrating with the ULBFs as dark matter.\n\n", "2307.09130": "2023-07-18, **Fundamental sensitivity limit of lossy cavity-enhanced interferometers with external and internal squeezing**, Mikhail Korobko et.al., [2307.09130v1](http://arxiv.org/abs/2307.09130v1)\n\n Quantum optical sensors are ubiquitous in various fields of research, from biological or medical sensors to large-scale experiments searching for dark matter or gravitational waves. Gravitational-wave detectors have been very successful in implementing cavities and quantum squeezed light for enhancing sensitivity to signals from black hole or neutron star mergers. However, the sensitivity to weak forces is limited by available energy and optical decoherence in the system. Here, we derive the fundamental sensitivity limit of cavity and squeezed-light enhanced interferometers with optical loss.This limit is attained by the optimal use of an additional internal squeeze operation, which allows to mitigate readout loss. We demonstrate the application of internal squeezing to various scenarios and confirm that it indeed allows to reach the best sensitivity in cavity and squeezed-light enhanced linear force sensors. Our work establishes the groundwork for the future development of optimal sensors in real-world scenarios where, up until now, the application of squeezed light was curtailed by various sources of decoherence.\n\n", "2307.09015": "2023-07-18, **Is the correlation between the bulge-to-total stellar mass ratio and the number of dwarf galaxies in tension with $Λ$CDM?**, Oliver Müller et.al., [2307.09015v1](http://arxiv.org/abs/2307.09015v1)\n\n Previous results suggest that there exists a correlation between the size of the bulge of a galaxy and the number of its dwarf galaxy satellites. This was found to be inconsistent with the standard model of cosmology based on comparisons to semi-analytical dark matter-only simulations, where no such correlation was found. In this work, we extend these studies using the volume-complete ELVES dwarf galaxy catalog, which increases the number of systems compared to previous work by a factor of four. For each giant galaxy we compile the bulge-to-total baryonic mass (B/T) ratio and put it as a function of the number of dwarf galaxies surrounding them within 250 kpc (N$\\_{250}$). For the 29 galaxy systems in the ELVES catalog, we find a linear relation between B/T and N$\\_{250}$ which is consistent with previous data. However, for a given stellar mass of the host galaxy this relation is mainly driven by their morphology, where early-type galaxies have a larger B/T ratio and a larger N$\\_{250}$ than late type galaxies. By investigating spiral galaxies in Illustris-TNG100, we tested whether the inclusion of baryons in the simulations will change the results based on Millennium-II. Contrary to dark matter-only simulations, we do find a correlation between B/T and N$\\_{250}$, indicating that the standard model of cosmology does predict a correlation. The empirical relation between the number of satellites and the bulge to total stellar mass is therefore not necessarily in tension with $\\Lambda$CDM.\n\n", "2307.08865": "2023-07-17, **Structure of the equivalent Newtonian systems in MOND N-body simulations. Density profiles and the core-cusp problem**, Federico Re et.al., [2307.08865v1](http://arxiv.org/abs/2307.08865v1)\n\n We investigate the core-cusp problem of the $\\Lambda$ cold dark matter ($\\Lambda$CDM) scenario in the context of Modified Newtonian Dynamics (MOND) paradigm exploiting the concept of equivalent Newtonian system (ENS). By means of particle-mesh $N-$body simulations in MOND we explore processes of galaxy formation via cold dissipationless collapse or merging of smaller substructures. From the end states of our simulations we recover the associated ENS and study the properties of their dark matter halos. We compare the simulation results with simple analytical estimates with a family of $\\gamma-$models. We find that the dark matter density of ENSs of most spherical cold collapses ha a markedly cored structure, in particular for the lowest values of the initial virial ratios. End states of some simulations with clumpy initial conditions have more complex profiles and some of their ENSs exhibit a moderate cusp, with logarithmic density slope always shallower than 1. These results seem to point towards the fact that the absence in most observed galaxies of a central DM cusp, at variance with what one would expect from theoretical and numerical arguments in $\\Lambda$CDM, would be totally consistent in a MONDian description.\n\n", "2307.08769": "2023-07-17, **The impact of electric currents on Majorana dark matter at freeze out**, Lukas Karoly et.al., [2307.08769v1](http://arxiv.org/abs/2307.08769v1)\n\n Thermal relics with masses in the GeV to TeV range remain possible candidates for the Universe's dark matter (DM). These neutral particles are often assumed to have vanishing electric and magnetic dipole moments so that they do not interact with single real photons, but the anapole moment can still be nonzero, permitting interactions with single virtual photons. This anapole moment allows for p-wave annihilation of DM into standard model particles, and the DM interacts with external electric currents via the anapole moment. Moving beyond their static electromagnetic properties, these particles generically have non-zero polarizabilities which mediate interactions with two real photons; in particular, spin-dependent polarizibilities admit s-wave annihilation of the DM into two photons. When the Universe cools from a temperature on the order of the DM mass to freeze out, the DM is in thermal equilibrium with the background plasma of particles, but the comoving DM density decreases due to annihilation. If a collection of initially unpolarized DM particles were subjected to an electric current, then the DM medium would become partially polarized, according to the Boltzmann distribution, with a slight excess of anapole moments aligned with the current, relative to those anti-aligned. For this region of partially polarized DM particles, the s-wave annihilation mode becomes partially suppressed because it requires a state of vanishing angular momentum. As a consequence, the decreased DM annihilation rate in this region will result in an excess of DM density, relative to an unpolarized region, as DM drops out of thermal equilibrium. We explored this relative change of DM density for DM that is subjected to an electric current through freeze out.\n\n", "2307.08546": "2023-07-17, **The linear response theory approach to the sub-GeV dark matter in the Sun**, Zheng-Liang Liang et.al., [2307.08546v1](http://arxiv.org/abs/2307.08546v1)\n\n In recent years, the importance of the electronic in-medium effect in the sub-GeV dark matter (DM) direct detection has been recognized and a coherent formulation of the DM-electron scattering based the linear response theory has been well established in the literature. In this paper, we apply the formulation to the scattering between DM particles and solar medium, and it is found that the dynamic structure factor inherently incorporate the particle-particle scattering and in-medium effect. Using this tool and taking a benchmark model as an example, we demonstrate how the in-medium effect affect the scattering of DM particles in the Sun, in both the heavy and light mediator limit. Formulae derived in this work lay the foundation for accurately calculating the spectra of solar-accelerated DM particles, which is of particular importance for the detection of DM particles via plasmon in semiconductor targets.\n\n", "2307.08513": "2023-07-17, **The future of cosmology? A case for CMB spectral distortions**, Matteo Lucca et.al., [2307.08513v1](http://arxiv.org/abs/2307.08513v1)\n\n This thesis treats the topic of CMB Spectral Distortions (SDs), which represent any deviation from a pure black body shape of the CMB energy spectrum. As such, they can be used to probe the inflationary, expansion and thermal evolution of the universe both within $\\Lambda$CDM and beyond it. The currently missing observation of this rich probe of the universe makes of it an ideal target for future observational campaigns. In fact, while the $\\Lambda$CDM signal guarantees a discovery, the sensitivity to a wide variety of new physics opens the door to an enormous uncharted territory. In light of these considerations, the thesis opens by reviewing the topic of CMB SDs in a pedagogical and illustrative fashion, aimed at waking the interest of the broader community. This introductory premise sets the stage for the first main contribution of the thesis to the field of SDs: their implementation in the Boltzmann solver CLASS and the parameter inference code MontePython. The CLASS+MontePython pipeline is publicly available, fast, it includes all sources of SDs within $\\Lambda$CDM and many others beyond that, and allows to consistently account for any observational setup. By means of these numerical tools, the second main contribution of the thesis consists in showcasing the versatility and competitiveness of SDs for several cosmological models as well as for a number of different mission designs. Among others, the results cover features in the primordial power spectrum, primordial gravitational waves, non-standard dark matter properties, primordial black holes, primordial magnetic fields and Hubble tension. Finally, the manuscript is disseminated with (20) follow-up ideas that naturally extend the work carried out so far, highlighting how rich of unexplored possibilities the field of CMB SDs still is. The hope is that these suggestions will become a propeller for further interesting developments.\n\n", "2307.08495": "2023-07-17, **$k-$Dependent Dark Matter**, Parisa Arabameri et.al., [2307.08495v1](http://arxiv.org/abs/2307.08495v1)\n\n With the emersion of precise cosmology and the emergence of cosmic tensions, we are faced with the question of whether the simple model of cold dark matter needs to be extended and whether doing so can alleviate the tensions and improve our understanding of the properties of dark matter. In this study, we investigate one of the generalized models of dark matter so that the behavior of this dark matter changes according to the scale of $k$. In large scales (small $k$'s), the dark matter is cold, while it becomes warm for small scales (large $k$'s). This behavior is modeled phenomenologically for two different scenarios. We show that the $S\\_8$ tension can be alleviated, but the $H\\_0$ tension becomes milder while not too much.\n\n"}, "supernova": {"2307.09418": "2023-07-18, **Influence of the tetraneutron on the EoS under core-collapse supernovae and heavy-ion collisions conditions**, Helena Pais et.al., [2307.09418v1](http://arxiv.org/abs/2307.09418v1)\n\n Recently, a resonant state of four neutrons (tetraneutron) with an energy of $E\\_{4n}=2.37\\pm 0.38 \\rm{(stat)} \\pm 0.44 \\rm{(sys)}$ MeV and a width of $\\Gamma=1.75\\pm 0.22 \\rm{(stat)} \\pm 0.30 \\rm{(sys)}$ MeV was reported. In this work, we analyse the effect of including such an exotic state on the yields of other light clusters, that not only form in astrophysical sites, such as core-collapse supernovae and neutron star mergers, but also in heavy-ion collisions. To this aim, we use a relativistic mean-field formalism, where we consider in-medium effects in a two-fold way, via the couplings of the clusters to the mesons, and via a binding energy shift, to compute the low-density equation of state for nuclear matter at finite temperature and fixed proton fraction. We consider five light clusters, deuterons, tritons, heliums, $\\alpha$-particles, and $^6$He, immersed in a gas of protons and neutrons, and we calculate their abundances and chemical equilibrium constants with and without the tetraneutron. We also analyse how the associated energy of the tetraneutron would influence such results. We find that the low-temperature, neutron-rich systems, are the ones most affected by the presence of the tetraneutron, making neutron stars excellent environments for their formation. Moreover, its presence in strongly asymmetric matter may increase considerably the proton and the $\\alpha$-particle fractions. This may have an influence on the dissolution of the accretion disk of the merger of two neutron stars.\n\n", "2307.08967": "2023-07-18, **New estimation of the nuclear de-excitation line emission from the supernova remnant Cassiopeia A**, Bing Liu et.al., [2307.08967v1](http://arxiv.org/abs/2307.08967v1)\n\n MeV nuclear de-excitation lines serve as a unique tool to study low-energy cosmic rays (CRs), containing both spectral and elemental information of the interacting material. In this paper, we estimated the possible nuclear de-excitation lines from the young supernova remnant Cassiopeia A. Given different CR spectral shapes and interacting materials, we found the predicted fluxes of strong narrow line emissions from the remnant are highly model-dependent, ranging from about $1\\times10^{-10}\\,{\\rm \\,cm^{-2}\\,s^{-1}}$ to $1\\times10^{-6}\\, {\\rm \\,cm^{-2}\\,s^{-1}}$ for the 4.44 MeV narrow line and from about $4\\times10^{-11}\\,{\\rm \\,cm^{-2}\\,s^{-1}}$ to $2\\times10^{-7}{\\rm \\,cm^{-2}\\,s^{-1}}$ for the 6.13 MeV narrow line, respectively. Based on the new estimation, we also discussed the detection probability of these line emissions against the MeV diffuse Galactic background under different assumptions of instrument response functions.\n\n", "2307.08746": "2023-07-17, **Unravelling the structure of magnetised molecular clouds with SILCC-Zoom: sheets, filaments and fragmentation**, S. Ganguly et.al., [2307.08746v1](http://arxiv.org/abs/2307.08746v1)\n\n To what extent magnetic fields affect how molecular clouds (MCs) fragment and create dense structures is an open question. We present a numerical study of cloud fragmentation using the SILCC-Zoom simulations. These simulations follow the self-consistent formation of MCs in a few hundred parsec sized region of a stratified galactic disc; and include magnetic fields, self-gravity, supernova-driven turbulence, as well as a non-equilibrium chemical network. To discern the role of magnetic fields in the evolution of MCs, we study seven simulated clouds, five with magnetic fields, and two without, with a maximum resolution of 0.1 parsec. Using a dendrogram we identify hierarchical structures which form within the clouds. Overall, the magnetised clouds have more mass in a diffuse envelope with a number density between 1-100 cm$^{-3}$. We find that six out of seven clouds are sheet-like on the largest scales, as also found in recent observations, and with filamentary structures embedded within, consistent with the bubble-driven MC formation mechanism. Hydrodynamic simulations tend to produce more sheet-like structures also on smaller scales, while the presence of magnetic fields promotes filament formation. Analysing cloud energetics, we find that magnetic fields are dynamically important for less dense, mostly but not exclusively atomic structures (typically up to $\\sim 100 - 1000$~cm$^{-3}$), while the denser, potentially star-forming structures are energetically dominated by self-gravity and turbulence. In addition, we compute the magnetic surface term and demonstrate that it is generally confining, and some atomic structures are even magnetically held together. In general, magnetic fields delay the cloud evolution and fragmentation by $\\sim$ 1 Myr.\n\n", "2307.08660": "2023-07-17, **Helium as a signature of the double detonation in Type Ia supernovae**, Christine E. Collins et.al., [2307.08660v1](http://arxiv.org/abs/2307.08660v1)\n\n The double detonation is a widely discussed mechanism to explain Type Ia supernovae from explosions of sub-Chandrasekhar mass white dwarfs. In this scenario, a helium detonation is ignited in a surface helium shell on a carbon/oxygen white dwarf, which leads to a secondary carbon detonation. Explosion simulations predict high abundances of unburnt helium in the ejecta, however, radiative transfer simulations have not been able to fully address whether helium spectral features would form. This is because helium can not be sufficiently excited to form spectral features by thermal processes, but can be excited by collisions with non-thermal electrons, which most studies have neglected. We carry out a full non-local thermodynamic equilibrium (non-LTE) radiative transfer simulation for an instance of a double detonation explosion model, and include a non-thermal treatment of fast electrons. We find a clear He I {\\lambda} 10830 feature which is strongest in the first few days after explosion and becomes weaker with time. Initially this feature is blended with the Mg II {\\lambda} 10927 feature but over time separates to form a secondary feature to the blue wing of the Mg II {\\lambda} 10927 feature. We compare our simulation to observations of iPTF13ebh, which showed a similar feature to the blue wing of the Mg II {\\lambda} 10927 feature, previously identified as C I. Our simulation shows a good match to the evolution of this feature and we identify it as high velocity He I {\\lambda} 10830. This suggests that He I {\\lambda} 10830 could be a signature of the double detonation scenario.\n\n", "2307.08656": "2023-07-17, **XMM-Newton observations of the TeV-discovered supernova remnant HESS J1534-571**, N. T. Nguyen-Dang et.al., [2307.08656v1](http://arxiv.org/abs/2307.08656v1)\n\n We report the results obtained from XMM-Newton observations of the TeV-detected supernova remnant (SNR) HESS J1534-571. We focus on the nature of the cosmic-ray particle content in the SNR, which is revealed by its $\\gamma$-ray emission. No signatures of X-ray synchrotron emission were detected from the SNR. This is consistent with earlier results obtained with Suzaku from other regions of the object. A joint modeling of the XMM-Newton and Suzaku spectra yields an upper limit for the total X-ray flux from the SNR area of $\\sim$ 5.62$ \\times 10^{-13} \\ \\mathrm{erg\\ cm^{-2}\\ s^{-1}}$ (95% c.l.) in the energy band of 2-10 keV, for an assumed photon index of 2.0. On the other hand, we do find evidence in the XMM-Newton data for a line-like emission feature at 6.4 keV from localized regions, again confirming earlier Suzaku measurements. We discuss the findings in the context of the origin of the observed $\\gamma$-ray emission. Although neither hadronic nor leptonic scenarios can be fully ruled out, the observed line emission can be interpreted as the result of interactions between lower energy ($\\sim$ MeV) cosmic-ray protons with high gas density regions in and around HESS J1534-571, and thus potentially be associated with particles accelerated in the SNR.\n\n", "2307.08584": "2023-07-17, **Using spectral modeling to break light-curve degeneracies of type II supernovae interacting with circumstellar material**, Luc Dessart et.al., [2307.08584v1](http://arxiv.org/abs/2307.08584v1)\n\n A large fraction of red-supergiant stars seem to be enshrouded by circumstellar material (CSM) at the time of explosion. Relative to explosions in a vacuum, this CSM causes both a luminosity boost at early times as well as the presence of symmetric emission lines with a narrow core and electron-scattering wings typical of type IIn supernovae (SNe). For this study, we performed radiation-hydrodynamics and radiative transfer calculations for a variety of CSM configurations (i.e., compact, extended, and detached) and documented the resulting ejecta and radiation properties. We find that models with a dense, compact, and massive CSM of ~0.5Msun can match the early luminosity boost of type II-P SNe but fail to produce type IIn-like spectral signatures (aka ``flash features''). These only arise if the photon mean free path in the CSM is large enough (i.e, if the density is low enough) to allow for a radiative precursor through a long-lived (i.e., a day to a week), radially extended unshocked optically thick CSM. The greater radiative losses and kinetic-energy extraction in this case boost the luminosity even for modest CSM masses -- this boost is delayed for a detached CSM. The inadequate assumption of high CSM density, in which the shock travels quasi adiabatically, overestimates the CSM mass and associated mass-loss rate. Our simulations also indicate that type IIn-like spectral signatures last as long as there is optically-thick unshocked CSM. Constraining the CSM structure therefore requires a combination of light curves and spectra, rather than photometry alone. We emphasize that for a given total energy, the radiation excess fostered by the presence of CSM comes at the expense of kinetic energy, as evidenced by the disappearance of the fastest ejecta material and the accumulation of mass in a dense shell. Both effects can be constrained from spectra well after the interaction phase.\n\n", "2307.08285": "2023-07-17, **A Measurement of Hubble Constant Using Cosmographic Approach from Fast Radio Bursts and SNe Ia**, Jiaze Gao et.al., [2307.08285v1](http://arxiv.org/abs/2307.08285v1)\n\n The Hubble constant ${H}\\_0$ is a crucial parameter in cosmology. However, different cosmic observations have resulted in varying posterior results for ${H}\\_0$, leading to what is known as the ${H}\\_0$ tension. In order to address this issue, it is beneficial to use other dataset to constrain ${H}\\_0$. In this paper, via the cosmographic approach based on the Friedman-Lemaitre-Robertson-Walker (FLRW) metric to the dispersion measure of the intergalactic medium ${\\rm{DM}}\\_{\\rm{IGM}}(z)$ of Fast Radio Bursts (FRBs), we obtain the Taylor expansion of $\\langle{\\rm{DM}}\\_{\\rm{IGM}}(z)\\rangle$ in terms redshift $z$. The result for Hubble constant $H\\_0=65.5^{+6.4}\\_{-5.4}$ ${\\rm{km~s^{-1}~Mpc^{-1}}}$ $(68$$\\%$ ${\\rm{C.L.}}) $, cosmological deceleration parameter $q\\_0=-0.50\\pm 0.20 $ and the jerk parameter $j\\_0=-0.1^{+2.0}\\_{-2.5}$ using uncalibrated Supernova Ia (SNe Ia) Pantheon dataset combined with 18 localized FRBs are obtained. To demonstrate the impact of parameter degeneracies on our analysis methods, we compare the results using three different forms of $f\\_{\\rm{IGM}}(z)$ and two different prior distributions for $\\Omega\\_{\\rm{b,0}}$. Then we find that the uncertainty in $H\\_0$ is not significantly affected by the prior range of $f\\_{\\rm{IGM}}(z)$ and $\\Omega\\_{\\rm{b,0}}$, but the mean value is influenced by the priors for $f\\_{\\rm{IGM}}(z)$ and $\\Omega\\_{\\rm{b,0}}$ due to parameter degeneracies with $H\\_0$. Employing $f\\_{\\rm{IGM}}(z)$ that evolves with redshift, we obtain the constraints for $H\\_0=69.0^{+6.7}\\_{-5.7}$ ${\\rm{km~s^{-1}~Mpc^{-1}}}$. Furthermore, the mock analyses give a posterior estimation of $H\\_0$ with an accuracy of 4.6\\% and higher precision for $q\\_0$ and $j\\_0$ in the near future.\n\n"}}