{"neutrino": {"2504.02820": "2025-04-03, **Excitation of the Glashow resonance without neutrino beams**, I. Alikhanov et.al., [2504.02820v1](http://arxiv.org/abs/2504.02820v1)\n\n The $s$-channel process $\\bar\\nu\\_ee^-\\rightarrow W^-$(on-shell) is now referred to as the Glashow resonance and being searched for at kilometer-scale neutrino ice/water detectors like IceCube, Baikal-GVD or KM3NeT. After over a decade of observations, IceCube has recorded only a few relevant neutrino events such that further exploration yet remains necessary for unambiguous confirmation of the existence of this resonant interaction. Meanwhile, its experimental discovery would provide an additional important test of the Standard Model. One might therefore ask: are there reactions with the Glashow resonance that would not necessitate having initial (anti)neutrino beams? This article suggests a surprisingly positive answer to the question $-$ namely, that the process may proceed in electron-positron collisions at accelerator energies, occurring as $e^+e^-\\rightarrow W^-\\rho(770)^+$. Although the resonance appears somewhat disguised, the underlying physics is transparent, quite resembling the well known radiative return: emission of $\\rho^+$ from the initial state converts the incident $e^+$ into $\\bar\\nu\\_e$. Likewise, the CP conjugate channel, $\\nu\\_e e^+\\rightarrow W^+$, takes the form $e^+e^-\\rightarrow W^+\\rho(770)^-$. Similar reactions with muons are also possible. Within this viewpoint, future high-luminosity lepton colliders seem to be promising for excitation of the Glashow resonance in laboratory conditions.\n\n", "2504.02447": "2025-04-03, **Measuring the Low-Energy Weak Mixing Angle with Supernova Neutrinos**, Chun-Ming Yip et.al., [2504.02447v1](http://arxiv.org/abs/2504.02447v1)\n\n The weak mixing angle $\\theta\\_W$ is a fundamental parameter in the electroweak theory with a value running according to the energy scale, and its precision measurement in the low-energy regime is still ongoing. We propose a method to measure the low-energy $\\sin{^2\\theta\\_W}$ by taking advantage of Argo, a future ton-scale liquid argon dark matter detector, and the neutrino flux from a nearby core-collapse supernova (CCSN). We evaluate the expected precision of this measurement through the coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) channel. We show that Argo is potentially capable of achieving a few percent determination of $\\sin{^2\\theta\\_W}$, at the momentum transfer of $q \\sim 20$ MeV, in the observation of a CCSN within $\\sim 3$ kpc from the Earth. Such a measurement is valuable for both the precision test of the electroweak theory and searching for new physics beyond the standard model in the neutrino sector.\n\n", "2504.02365": "2025-04-03, **Quantization of massive fermions in vacuum and external fields**, Maxim Dvornikov et.al., [2504.02365v1](http://arxiv.org/abs/2504.02365v1)\n\n We study massive Majorana neutrinos in background matter. Representing these particles in terms of Weyl spinors, we carry out their quantization. The propagators of these fields are also constructed. Then, we apply the Hamilton dynamics based formalism to describe massive Majorana neutrinos in matter on the classical level. Finally, we study a classical Dirac particle in vacuum, described with $c$-number variables, within the Hamiton formalism. Such a Dirac field is also canonically quantized.\n\n"}, "dark matter": {"2504.02702": "2025-04-03, **Background-Enhanced Axion Force by Axion Dark Matter**, Yu Cheng et.al., [2504.02702v1](http://arxiv.org/abs/2504.02702v1)\n\n We investigate the influence of axion dark matter as a background on the spin-independent axion forces between nucleons. Notably, we find that the potential for axion forces scales from $1/r^3$ in a vacuum-only context to $1/r$ when the background effect is considered. Also, the magnitude of the axion force is substantially amplified in proportion to the number density of axion DM particles. These enhancements significantly improve the constraints on the axion decay constant by several orders of magnitude, across a broad range of axion masses, based on the fifth-force experiments such as the Casimir-less and torsion balance tests. This suggests that such experiments are more effective than previously understood in detecting axions.\n\n", "2504.02563": "2025-04-03, **The rise and fall of radio-luminous merger shocks from a large sample of galaxy cluster simulations**, Sebastián E. Nuza et.al., [2504.02563v1](http://arxiv.org/abs/2504.02563v1)\n\n The generation of merger shocks is a natural outcome of the hierarchical process of structure formation. As time elapses cosmic structures grow in mass and size via mergers and through the continuous accretion of material onto the potential wells of dark matter haloes. In particular, some dynamically-perturbed galaxy clusters exhibit spectacular non-thermal radio features known as radio relics that are believed to trace cluster merger shocks at different stages of evolution. These radio shocks are thought to be illuminated by the acceleration of cosmic ray electrons in the presence of intracluster magnetic fields. In this contribution, we analyse a large sample of hydrodynamical, cosmological re-simulations of merging galaxy clusters belonging to The Three Hundred Project to study the median evolution of radio relics as a function of cluster mass and redshift. This synthetic cluster merger sample enables us to compute in detail the luminosity output of radio shocks from their onset at core passage to demise.\n\n", "2504.02476": "2025-04-03, **Globular cluster distributions as a dynamical probe of dark matter**, Nativ Ben-Yeda et.al., [2504.02476v1](http://arxiv.org/abs/2504.02476v1)\n\n Globular clusters (GCs) act as massive probe particles traversing the dark matter halos of their host galaxies. Gravitational dynamical friction due to halo particles causes GC orbits to contract over time, providing a beyond-mean field test of the cold dark matter paradigm. We explore the information content of such systems, using N-body and semianalytic simulations and scanning over a range of initial conditions. We consider data from the ultradiffuse galaxies NGC5846-UDG1 and UDG-DF44, and from the Fornax dwarf spheroidal galaxy. The GC systems of UDG1 and Fornax indicate the presence of dark matter halos, independent of (but consistent with) stellar kinematics data. UDG-DF44 is too diffuse for dynamical friction to give strong constraints. Our analysis can be extended to many additional galaxies.\n\n", "2504.02393": "2025-04-03, **Revealing the microscopic mechanism of deuteron formation at the LHC**, ALICE Collaboration et.al., [2504.02393v1](http://arxiv.org/abs/2504.02393v1)\n\n The formation of light (anti)nuclei with mass number A of a few units (e.g., d, $^3$He, and $^4$He) in high-energy hadronic collisions presents a longstanding mystery in nuclear physics [1,2]. It is not clear how nuclei bound by a few MeV can emerge in environments characterized by temperatures above 100 MeV [3-5], about 100,000 times hotter than the center of the Sun. Despite extensive studies, this question remained unanswered. The ALICE Collaboration now addresses it with a novel approach using deuteron-pion momentum correlations in proton-proton (pp) collisions at the Large Hadron Collider (LHC). Our results provide model-independent evidence that about 80% of the observed (anti)deuterons are produced in nuclear fusion reactions [6] following the decay of short-lived resonances, such as the $\\Delta (1232)$. These findings resolve a crucial gap in our understanding of nucleosynthesis in hadronic collisions. Beyond answering the fundamental question on how nuclei are formed in hadronic collisions, the results can be employed in the modeling of the production of light and heavy nuclei in cosmic rays [7] and dark matter decays [8,9].\n\n", "2504.02303": "2025-04-03, **Diversifying halo structures in two-component self-interacting dark matter models via mass segregation**, Daneng Yang et.al., [2504.02303v1](http://arxiv.org/abs/2504.02303v1)\n\n Self-interacting dark matter (SIDM), through gravothermal evolution driven by elastic self-scatterings, offers a compelling explanation for the observed diversity of inner halo densities. In this work, we investigate SIDM dynamics in a two-component dark matter model with mass ratios of order unity, motivated by an asymmetric dark matter framework that naturally evades constraints from relic abundance and mediator decay, while enabling strong, velocity-dependent self-interactions. We show that cross-component scatterings significantly enhance mass segregation, driving the formation of dense, core collapsed-like halos. This effect couples naturally to SIDM-induced diversity, introducing a new mechanism for generating structural variations beyond those arising from gravothermal evolution alone. Our results reveal a novel mechanism for reconciling SIDM with small-scale observational tensions by enabling shifts in central densities while preserving the flexibility to generate diverse halo structures. We further highlight that halo structural diversity may serve as a diagnostic of dark sector composition, opening a new observational window into the particle nature of SIDM.\n\n"}, "supernova": {"2504.02798": "2025-04-03, **North+Lone Star Supernova Host Survey I: Local Host-Galaxy H$α$ Surface Brightness and the Hubble Residuals of Type Ia Supernovae**, Ann M. Isaacs et.al., [2504.02798v1](http://arxiv.org/abs/2504.02798v1)\n\n We present optical integral-field unit (IFU) spectroscopy acquired with the George and Cynthia Mitchell Spectrograph on the Harlan J. Smith telescope at McDonald Observatory of 94 galaxies (0.01 < z < 0.058) that have hosted Type Ia supernovae (SNe Ia). We selected host galaxies with star-forming morphology, consistent with the criteria used by Riess et al. (2022). We measured the H${\\alpha}$ surface brightness of each host galaxy within 1 kpc of the location of the supernova. Using distances from the Pantheon+ sample, we find a step in Hubble residuals compared to local H${\\alpha}$ surface brightness of -0.097 $\\pm$ 0.051 mag at 1.9${\\sigma}$ significance in a sample of 73 host galaxies, where SNe in environments with smaller H${\\alpha}$ surface brightness are, on average, less luminous after correction for light-curve shape and color. Almost all of the SNe in our sample were discovered by targeted surveys. Using an independent sample primarily from the untargeted Nearby Supernova Factory survey, Rigault et al. (2020) found a step of 0.045 $\\pm$ 0.029 mag where SNe in passive environments are instead brighter, which is in 2.4${\\sigma}$ tension with our measurement. Rigault et al. (2013) designated SNe Ia comparatively small HRs (< -0.1) and faint local H${\\alpha}$ surface brightness (SB) (<log10(H${\\alpha}$ SB/(erg$^{-1}$s$^{-1}$kpc$^2$))=38.32 as the M$\\_2$ population. SNe that would be classified as M$\\_2$ are less highly represented in our sample (7% versus 21%). When we include an additional twelve early-type galaxies, the number of M$\\_2$ SNe is almost doubled, although the tension with the HR step measured by Rigault et al. (2020) persists at 1.7${\\sigma}$.\n\n", "2504.02320": "2025-04-03, **$β$-decay properties of some astrophysically important Sc-isotopes**, Fakeha Farooq et.al., [2504.02320v1](http://arxiv.org/abs/2504.02320v1)\n\n In the late progressive stages of heavy stars, electron capture and $\\beta^\\pm$-decay are the governing processes. The weak rates are essential inputs for modeling the stages of high-mass stars before supernova explosions. As per results obtained from previous simulations, weak rates of Scandium isotopes contribute substantially in changing the lepton-to-baryon ratio ($Y\\_e$) of the nuclear matter in the core. In the present analysis, we report important $\\beta^-$-decay properties of crucial Sc isotopes in an astrophysical environment with mass numbers $49 \\leq A \\leq 54$. The investigation includes Gamow-Teller (GT) strength distributions, terrestrial half-lives, and stellar rates of electron capture (EC) and $\\beta^-$-decay reactions. The calculations are performed using the proton-neutron (pn) quasi-particle random phase approximation (QRPA) model over a wide temperature range ($10^7$-$3 \\times 10^{10}$ K) and density range ($10^1 - 10^{11}$ g/cm$^3$). Additionally, we compare our calculated results with available experimental and theoretical data. A good agreement is observed between our calculated half-lives and experimentally measured values. Our weak $\\beta^-$-decay and EC rates are compared with those from the Independent-Particle Model (IPM) and Large-Scale Shell Model (LSSM). At high stellar temperatures and densities, our calculated $\\beta^-$-decay rates are smaller than those from the other models.\n\n"}}