{"neutrino": {"2404.07081": "2024-04-10, **Neutrino at different epochs of the Friedmann Universe**, A. V. Ivanchik et.al., [2404.07081v1](http://arxiv.org/abs/2404.07081v1)\n\n Nowadays, at least two relics of the Big Bang have survived - the cosmological microwave background (CMB) and the cosmological neutrino background (C$\\nu$B). Being the second most abundant particle in the Universe, the neutrino has a significant impact on its evolution from the Big Bang to the present day. Neutrinos affect the following cosmological processes: the expansion rate of the Universe, its chemical and isotopic composition, the CMB anisotropy and the formation of the large-scale structure of the Universe. Another relic neutrino background is theoretically predicted, it consists of non-equilibrium antineutrinos of Primordial Nucleosynthesis arising as a result of the decays of neutrons and tritium nuclei. Such antineutrinos are an indicator of the baryon asymmetry of the Universe. In addition to experimentally detectable active neutrinos, the existence of sterile neutrinos is theoretically predicted to generate neutrino masses and explain their oscillations. Sterile neutrinos can also solve such cosmological problems as the baryonic asymmetry of the Universe and the nature of dark matter. The recent results of several independent experiments point to the possibility of the existence of a light sterile neutrino. However, the existence of such a neutrino is inconsistent with the predictions of the Standard Cosmological Model. The inclusion of a non-zero lepton asymmetry of the Universe and/or increasing the energy density of active neutrinos can eliminate these contradictions and reconcile the possible existence of sterile neutrinos with Primordial Nucleosynthesis, the CMB anisotropy, and also reduce the H$\\_0$-tension. In this brief review, we discuss the influence of the physical properties of active and sterile neutrinos on the evolution of the Universe from the Big Bang to the present day.\n\n", "2404.06867": "2024-04-10, **A correlation between hard X-rays and neutrinos in radio-loud and radio-quiet AGN**, Emma Kun et.al., [2404.06867v1](http://arxiv.org/abs/2404.06867v1)\n\n The production mechanism of astrophysical high-energy neutrinos is not yet understood. A common assumption is that beamed relativistic outflows (jets) driven by accreting black holes are needed to accelerate particles to such high energies to produce high-energy neutrinos. Indeed, the first astrophysical high-energy neutrino source candidate identified by IceCube at a significance level of $>3\\sigma$ was a blazar -- an AGN with an accreting supermassive black hole that drives a relativistic jet directed towards Earth. Recently, IceCube discovered strong evidence that Seyfert galaxies also emit neutrinos, which appears unrelated to jet activity. Here, we show that the neutrino--hard X-ray flux ratio of the blazar TXS 0506+056 is consistent with neutrino production in a $\\gamma$-obscured region near the central supermassive black hole, with the X-ray flux corresponding to reprocessed $\\gamma$-ray emission with flux comparable to that of neutrinos. Similar neutrino--hard X-ray flux ratios were found for three of IceCube's Seyfert galaxies, raising the possibility of a common neutrino production mechanism that may not involve a strong jet. We examine how future observations could test the jet origin of blazar neutrinos.\n\n", "2404.06577": "2024-04-09, **A common framework for fermion mass hierarchy, leptogenesis and dark matter**, Carolina Arbeláez et.al., [2404.06577v1](http://arxiv.org/abs/2404.06577v1)\n\n In this work, we explore an extension of the Standard Model designed to elucidate the fermion mass hierarchy, account for the dark matter relic abundance, and explain the observed matter-antimatter asymmetry in the universe. Beyond the Standard Model particle content, our model introduces additional scalars and fermions. Notably, the light active neutrinos and the first two generations of charged fermions acquire masses at the one-loop level. The model accommodates successful low-scale leptogenesis, permitting the mass of the decaying heavy right-handed neutrino to be as low as 10 TeV. We conduct a detailed analysis of the dark matter phenomenology and explore various interesting phenomenological implications. These include charged lepton flavor violation, muon and electron anomalous magnetic moments, constraints arising from electroweak precision observables, and implications for collider experiments.\n\n", "2404.06539": "2024-04-09, **First Search for High-Energy Neutrino Emission from Galaxy Mergers**, Subhadip Bouri et.al., [2404.06539v1](http://arxiv.org/abs/2404.06539v1)\n\n The exact sources of high-energy neutrinos detected by the IceCube neutrino observatory still remain a mystery. For the first time, this work explores the hypothesis that galaxy mergers may serve as sources for these high-energy neutrinos. Galaxy mergers can host very high-energy hadronic and photohadronic processes, which may produce very high-energy neutrinos. We perform an unbinned maximum-likelihood-ratio analysis utilizing the galaxy merger data from six catalogs and 10 years of public IceCube muon-track data to quantify any correlation between these mergers and neutrino events. First, we perform the single source search analysis, which reveals that none of the considered galaxy mergers exhibit a statistically significant correlation with high-energy neutrino events detected by IceCube. Furthermore, we conduct a stacking analysis with three different weighting schemes to understand if these galaxy mergers can contribute significantly to the diffuse flux of high-energy astrophysical neutrinos detected by IceCube. We find that upper limits (at $95\\%$ c.l.) of the all flavour high-energy neutrino flux, associated with galaxy mergers considered in this study, at $100$ TeV with spectral index $\\Gamma=-2$ are $2.57\\times 10^{-18}$, $8.51 \\times 10^{-19}$ and $2.36 \\times 10^{-18}$ $\\rm GeV^{-1}\\,cm^2\\,s^{-1}\\,sr^{-1}$ for the three weighting schemes. This work shows that these selected galaxy mergers do not contribute significantly to the IceCube detected high energy neutrino flux. We hope that in the near future with more data, the search for neutrinos from galaxy mergers can either discover their neutrino production or impose more stringent constraints on the production mechanism of high-energy neutrinos within galaxy mergers.\n\n", "2404.06530": "2024-04-09, **On the Role of Cosmological Gravitational Particle Production in Baryogenesis**, Marcos M. Flores et.al., [2404.06530v1](http://arxiv.org/abs/2404.06530v1)\n\n We investigate the generation of the baryon asymmetry within the framework of cosmological gra\\-vi\\-ta\\-tional particle production, employing the Bogoliubov approach. We examine two well-known baryogenesis scenarios, namely baryogenesis in Grand Unified Theories (GUT) and leptogenesis, while considering reheating temperatures sufficiently low for thermal processes to be negligible. Considering $\\alpha-$attractor T-models for the inflaton potential, we demonstrate that GUT baryogenesis from scalar decays can be successful across a large range of conformal couplings with gravity, without necessitating substantial levels of CP violation. In the case of leptogenesis, we find that the reheating temperature should be $T\\_{\\rm RH}\\lesssim 10^{6}~{\\rm GeV}$ for right-handed neutrino masses $M\\_1 \\lesssim 6 \\times 10^{12}~{\\rm GeV}$ to generate the observed asymmetry.\n\n", "2404.06468": "2024-04-09, **Constraining electron number density in the Sun via Earth-based neutrino flavor data**, Caroline Laber-Smith et.al., [2404.06468v1](http://arxiv.org/abs/2404.06468v1)\n\n Neutrino flavor transformation offers a window into the physics of various astrophysical environments, including our Sun and the more exotic environs of core-collapse supernovae and binary neutron-star mergers. Here, we apply an inference framework - specifically: statistical data assimilation (SDA) - to neutrino flavor evolution in the Sun. We take a model for solar neutrino flavor evolution, together with Earth-based neutrino measurements, to infer solar properties. Specifically, we ask what signature of the radially-varying solar electron number density $n\\_e(r)$ is contained within these Earth-based measurements. Currently, the best estimates of $n\\_e(r)$ come from the standard solar model. We seek to ascertain, through novel application of the SDA method, whether estimates of the same from neutrino data can serve as independent constraints.\n\n", "2404.06223": "2024-04-09, **Dark sterile neutrinos on a linear seesaw of neutrino masses**, Ernesto A. Matute et.al., [2404.06223v1](http://arxiv.org/abs/2404.06223v1)\n\n Sterile neutrinos as source of the mass and flavor mixing of active neutrinos as well as genesis of the dark matter (DM) and matter-antimatter asymmetry have gained special interest. Here we study the case of the Standard Model (SM) extended with three right-handed (RH) neutrinos and a dark sector with two extra sterile neutrinos, odd under a discrete $Z\\_2$ symmetry. The RH neutrinos are responsible for producing the baryon asymmetry via the high-scale unflavored leptogenesis. They are superheavy and their abundance at the electroweak broken stage is vanishingly small, so that they have no impact on the phenomenology at low energies. The two dark neutrinos generate the tiny mass of two active neutrinos through a mechanism similar to the minimal linear seesaw, and saturate the relic abundance as freeze-in DM via decay of the heavy SM bosons. The absence of the dark Majorana mass terms in the dark linear seesaw is explained by invoking a hidden symmetry, the so-called presymmetry, and the DM candidate appears in the form of a quasi-Dirac neutrino. The $Z\\_2$ symmetry is broken in the dark neutrino sector, but exact in the realm of RH neutrinos. The required coupling weakness for the freeze-in DM neutrino is related to a very small breach of unitarity in the active neutrino mixing matrix. We show how phenomenological constraints on the production and decay of the DM neutrino imply an upper bound around 1 MeV for its mass and unitarity up to $\\mathcal{O}(10^{-7})$ for the mixing matrix.\n\n", "2404.05927": "2024-04-09, **Remnant masses from 1D+ core-collapse supernovae simulations: bimodal neutron star mass distribution and black holes in the low-mass gap**, Luca Boccioli et.al., [2404.05927v1](http://arxiv.org/abs/2404.05927v1)\n\n The explosion of core-collapse supernovae (CCSNe) is an extremely challenging problem, and there are still large uncertainties regarding which stars lead to successful explosions that leave behind a neutron star, and which ones will form a black hole instead. In this paper, we simulate 341 progenitors at three different metallicities using spherically symmetric simulations that include neutrino-driven convection via a mixing-length theory. We use these simulations to improve previously derived explosion criteria based on the density and entropy profiles of the pre-supernova progenitor. We also provide numerical fits to calculate the final mass of neutron stars based on either compactness, the location of the Si/Si-O interface, or the Chandrasekhar mass. The neutron star birth mass distribution derived from our 1D+ simulations is bimodal, contrary to what the most popular 1D CCSN simulations have shown so far. We compare the theoretically derived neutron star mass distributions with the observed ones and discuss potential implications for population synthesis studies. We also analyze the black hole mass distribution predicted by our simulations. To be consistent with current models of matter ejection in failed SNe, a large fraction of the envelope must be expelled, leading to small black holes in the low-mass gap. One black hole in this mass region has recently been observed in the GW230529 event by the LIGO-Virgo-KAGRA collaboration. Our results naturally agree with this detection, which the most popular prescriptions for explodability and remnant masses are not able to reproduce. In general, we find that the explosion outcome and mass of the remnant strongly depend on the pre-collapse structure of the progenitor. However, their dependence on the initial mass of the star and the mass of the CO core is highly uncertain and non-linear.\n\n"}, "dark matter": {"2404.07196": "2024-04-10, **One-loop power spectrum in ultra slow-roll inflation and implications for primordial black hole dark matter**, Guillermo Ballesteros et.al., [2404.07196v1](http://arxiv.org/abs/2404.07196v1)\n\n We apply the in-in formalism to address the question of whether the size of the one-loop spectrum of curvature fluctuations in ultra-slow-roll inflation models designed for producing a large population of primordial black holes implies a breakdown of perturbation theory. We consider a simplified piece-wise description of inflation, in which the ultra-slow-roll phase is preceded and followed by slow-roll phases linked by transitional periods. We work in the $\\delta\\phi$-gauge, including all relevant cubic and quartic interactions and the necessary counterterms to renormalize the ultraviolet divergences, regularized by a cutoff. The ratio of the one-loop to the tree-level contributions to the spectrum of curvature perturbations is controlled by the duration of the ultra-slow-roll phase and of the transitions. Our results indicate that perturbation theory does not necessarily break in well-known models proposed to account for all the dark matter in the form of primordial black holes.\n\n", "2404.07187": "2024-04-10, **Constraining Bosonic Dark Matter-Baryon Interactions from Neutron Star Collapse**, Chih-Ting Lu et.al., [2404.07187v1](http://arxiv.org/abs/2404.07187v1)\n\n Dark matter (DM) may be captured around a neutron star (NS) through DM-nucleon interactions. We observe that the enhancement of such capturing is particularly significant when the DM velocity and/or momentum transfer depend on the DM-nucleon scattering cross-section. This could potentially lead to the formation of a black hole within the typical lifetime of the NS. As the black hole expands through the accretion of matter from the NS, it ultimately results in the collapse of the host. Utilizing the existing pulsar data J0437-4715 and J2124-3858, we derive the stringent constraints on the DM-nucleon scattering cross-section across a broad range of DM masses.\n\n", "2404.06982": "2024-04-10, **Search for a light muon-philic $Z'$ with the NA64-$e$ experiment at CERN**, Yu. M. Andreev et.al., [2404.06982v1](http://arxiv.org/abs/2404.06982v1)\n\n The inclusion of an additional U(1) gauge $L\\_{\\mu} - L\\_{\\tau}$ symmetry would release the tension between the measured and the predicted value of the anomalous muon magnetic moment: this paradigm assumes the existence of a new, light $Z'$ vector boson, with dominant coupling to ${\\mu}$ and ${\\tau}$ and interacting with electrons via a loop mechanism. The $L\\_{\\mu} - L\\_{\\tau}$ model can also explain the Dark Matter relic abundance, by assuming that the $Z'$ boson acts as a \"portal\" to a new Dark Sector of particles in Nature, not charged under known interactions. In this work we present the results of the $Z'$ search performed by the NA64-$e$ experiment at CERN SPS, that collected $ \\sim 9 \\times 10^{11}$ 100-GeV electrons impinging on an active thick target. Despite the suppressed $Z'$ production yield with an electron beam, the limits sets by NA64-$e$ are competitive with other experimental searches, and partially exclude the $g-2$ preferred model parameter values for $Z'$ masses lighter than 2 MeV. This result proves the complementarity of this search with NA64-${\\mu}$, the parallel effort of the NA64 collaboration with a muon beam.\n\n", "2404.06796": "2024-04-10, **Constraining Cosmological Physics with DESI BAO Observations**, Deng Wang et.al., [2404.06796v1](http://arxiv.org/abs/2404.06796v1)\n\n The DESI year one observations can help probe new physics on cosmological scales. In light of the latest DESI BAO measurements, we constrain four popular cosmological scenarios including inflation, modified gravity, annihilating dark matter and interacting dark energy. Using a data combination of BICEP/Keck array, cosmic microwave background and DESI, we obtain the $1\\sigma$ and $2\\sigma$ constraints on the tensor-to-scalar ratio $r\\_{0.05}= 0.0176^{+0.0070}\\_{-0.0130}$ and $r\\_{0.05}=0.018^{+0.020}\\_{-0.017}$. Using the combination of cosmic microwave background and DESI, we find a $2.4\\sigma$ evidence for gravitational theories beyond the general relativity, shrinks the dark matter annihilation cross-section by $12\\%$ relative to cosmic microwave background, and obtain a $1.6\\sigma$ hint of the positive interaction between dark matter and dark energy indicating that energy may be transferred from dark matter to dark energy in the dark sector of the universe. Future DESI observations could go a step further to explore the nature of inflation, dark matter and dark energy, and test the validity of general relativity on cosmological scales.\n\n", "2404.06774": "2024-04-10, **Scalar Field Dark Matter Around Charged Black Holes**, Yuri Ravanal et.al., [2404.06774v1](http://arxiv.org/abs/2404.06774v1)\n\n In this paper, we investigate the behavior of a massive scalar field dark matter scenarios in the large mass limit around a central Reissner-Nordstr\\\"{o}m black hole. This study is motivated by observations from the Event Horizon Telescope collaboration, which does not exclude the possibility of the existence of such black holes. Through these inquiries, we uncover that the electric charge may significantly impact the scalar field profile and the density profile in the vecinty of the black hole. For the maximum electric charge allowed by the constraints of the Event Horizon Telescope, the maximum accretion rate decreases by $\\thicksim$ 50 \\% compared to the Schwarszchild case for marginally bound orbits. The maximum accretion rate of the massive scalar field is approximately $\\dot M\\_{\\text{SFDM}} \\thicksim 10^{-8} M\\_{\\odot} \\;\\text{yr}^{-1}$, which is significantly lower than the typical baryonic accretion rate commonly found in the literature. This implies that the scalar cloud located at the center of galaxies may have survived untill present times.\n\n", "2404.06627": "2024-04-09, **A Beehive Haloscope for High-mass Axion Dark Matter**, Matthew O. Withers et.al., [2404.06627v1](http://arxiv.org/abs/2404.06627v1)\n\n We propose a new haloscope geometry that can arbitrarily increase the resonator volume for a given target axion mass. This geometry consists of closely packed, overlapping coaxial cavities operating as a single resonator. While the resonant frequency is still determined by the dimensions of the individual \"cells,\" the strong interactions between the cells encourage the entire \"beehive\" to oscillate in phase, a phenomenon expected of tightly coupled harmonic oscillators. This synchronization behavior allows the construction of a singly connected large-volume resonator at high frequency by simply increasing the number of the cells. Using direct numerical simulations, we verify the existence of a global eigenmode that has a high (40%) form factor in a 169-element beehive resonator. The resonant frequency of the eigenmode is tunable by moving the center rods laterally in unison. The form factor is very tolerant to dimensional deviations and misalignment, as a result of mode hybridization due to strong coupling. The beehive haloscope inherits many appealing properties from the conventional coaxial cavity: a high quality factor, compatibility with a solenoid magnet, ease of fabrication, tuning, and coupling. We argue that this geometry is an excellent candidate for high-mass axion searches covering the post-inflationary parameter space (>5 GHz).\n\n", "2404.06584": "2024-04-09, **Relativistic Khronon Theory in agreement with Modified Newtonian Dynamics and Large-Scale Cosmology**, Luc Blanchet et.al., [2404.06584v1](http://arxiv.org/abs/2404.06584v1)\n\n We propose an extension of General Relativity (GR) based on a space-time foliation by three-dimensional space-like hypersurfaces labeled by the Khronon scalar field $\\tau$. We show that this theory (i) leads to modified Newtonian dynamics (MOND) at galactic scales for stationary systems; (ii) recovers GR plus a cosmological constant in the strong field regime; (iii) is in agreement with the standard cosmological model and the observed cosmic microwave background anisotropies at linear cosmological scales, where the theory reduces to a subset of the generalized dark matter (GDM) model. We compute the second order action on a Minkowski background and show that it contains the usual tensor modes of GR and a scalar degree of freedom with dispersion relation $\\omega=0$. We find that the deconstrained Hamiltonian is bounded from below for wavenumbers larger than $\\sim 10^{-31}\\,\\text{eV}$ and unbounded for smaller wavenumbers.\n\n", "2404.06575": "2024-04-09, **Schwarzschild Black Hole Surrounded by Perfect Fluid Dark Matter in the presence of Quintessence Matter Field**, B. Hamil et.al., [2404.06575v1](http://arxiv.org/abs/2404.06575v1)\n\n In this manuscript, we examine the Schwarzschild black hole surrounded by perfect fluid dark matter in the presence of the quintessence matter field in the context of thermodynamics, shadows, and quasinormal modes. We find that the quintessence matter field sets an upper bound value on the horizon where dark matter settles a lower limit on the event horizon but also expands the upper bound value of the horizon. We discuss how this impact alters the black hole's thermodynamics, shadows, and quasinormal modes.\n\n", "2404.06537": "2024-04-09, **Exploring the nature of dark matter with the extreme galaxy AGC 114905**, Pavel E. Mancera Piña et.al., [2404.06537v1](http://arxiv.org/abs/2404.06537v1)\n\n AGC 114905 is a dwarf gas-rich ultra-diffuse galaxy seemingly in tension with the cold dark matter (CDM) model. Specifically, the galaxy appears to have an extremely low-density halo and a high baryon fraction, while CDM predicts dwarfs to have very dense and dominant dark haloes. The alleged tension relies on the galaxy's rotation curve decomposition, which depends heavily on its inclination. This inclination, estimated from the gas morphology, remains somewhat uncertain. We present unmatched ultra-deep optical imaging of AGC 114905 reaching surface brightness limits $\\mu\\_{\\rm r,lim} \\approx 32$ mag/arcsec$^2$ ($3\\sigma$; 10 arcsec $\\times$ 10 arcsec) obtained with the 10.4-m Gran Telescopio Canarias. With the new imaging, we characterise the galaxy's morphology, surface brightness, colours, and stellar mass profiles in great detail. The stellar disc has a similar extent as the gas, presents spiral arms-like features, and shows a well-defined edge. Stars and gas share similar morphology, and crucially, we find an inclination of $31\\pm2^\\circ$, in agreement with the previous determinations. We revisit the rotation curve decomposition of the galaxy, and we explore different mass models in the context of CDM, self-interacting dark matter (SIDM), fuzzy dark matter (FDM) or Modified Newtonian Dynamics (MOND). We find that the latter does not fit the circular speed of the galaxy, while CDM only does so with dark halo parameters rarely seen in cosmological simulations. Within the uncertainties, SIDM and FDM remain feasible candidates to explain the observed kinematics of AGC 114905.\n\n", "2404.06538": "2024-04-09, **Refracted Gravity Solutions from Small to Large Scales**, Valentina Cesare et.al., [2404.06538v1](http://arxiv.org/abs/2404.06538v1)\n\n If visible matter alone is present in the Universe, general relativity (GR) and its Newtonian weak field limit (WFL) cannot explain several pieces of evidence, from the largest to the smallest scales. The most investigated solution is the cosmological model $\\Lambda$ cold dark matter ($\\Lambda$CDM), where GR is valid and two dark components are introduced, dark energy (DE) and dark matter (DM), to explain the $\\sim$70\\% and $\\sim$25\\% of the mass-energy budget of the Universe, respectively. An alternative approach is provided by modified gravity theories, where a departure of the gravity law from $\\Lambda$CDM is assumed, and no dark components are included. This work presents refracted gravity (RG), a modified theory of gravity formulated in a classical way where the presence of DM is mimicked by a gravitational permittivity $\\epsilon(\\rho)$ monotonically increasing with the local mass density $\\rho$, which causes the field lines to be refracted in small density environments. Specifically, the flatter the system the stronger the refraction effect and thus, the larger the mass discrepancy if interpreted in Newtonian gravity. RG presented several encouraging results in modelling the dynamics of disk and elliptical galaxies and the temperature profiles of the hot X-ray emitting gas in galaxy clusters and a covariant extension of the theory seems to be promising.\n\n", "2404.06441": "2024-04-09, **A minimal solution to the axion isocurvature problem from a non-minimal coupling**, Maximilian Berbig et.al., [2404.06441v1](http://arxiv.org/abs/2404.06441v1)\n\n The main limitation for pre-inflationary breaking of Peccei-Quinn (PQ) symmetry is the upper bound on the Hubble rate during inflation from axion isocurvature fluctuations. This leads to a tension between high scale inflation and QCD axions with Grand Unified Theory (GUT) scale decay constants, which reduces the potential for a detection of tensor modes at next generation CMB experiments. We propose a mechanism that excplicitly breaks PQ symmetry via non-minimal coupling to gravity, that lifts the axion mass above the Hubble scale during inflation and has negligible impact on today's axion potential. The initially heavy axion gets trapped at an intermediate minimum during inflation given by the phase of the non-minimal coupling, before it moves to its true CP-conserving minimum after inflation. During this stage it undergoes coherent oscillations around an adiabatically decreasing minimum, which slightly dilutes the axion energy density, while still being able to explain the observed dark matter relic abundance. This scenario can be tested by the combination of next generation CMB surveys like CMB-S4 and LiteBIRD with haloscopes such as ABRACADABRA or CASPEr-Electric.\n\n", "2404.06419": "2024-04-09, **Signatures of Four Fermion Contact Couplings of a Dark Fermion and an Electron at Hadron Collider**, Kai Ma et.al., [2404.06419v1](http://arxiv.org/abs/2404.06419v1)\n\n Both the collider searches and direct detections are promising approaches to probe a fermionic dark matter. In this paper we study signatures of the four fermion contact operators involving a dark fermion, an electron and a quark pair. We show that the mono-electron production channel at hadron collider can provide strong constraints. Associated productions of a charged electron with a photon/jet with missing energy are also studied. Using the current LHC data at $\\sqrt{s} = 13$\\,TeV, the lower bound on the energy scale of the (axial-)vector operator can reach to $12$\\,TeV for a massless dark fermion. It can be further improved to about $24$\\,TeV at the HE-LHC with $\\sqrt{s} = 25$\\,TeV and a total luminosity $20\\,{\\rm ab}^{-1}$. For the direct detections, the signal operators can generate induced $\\beta^\\pm$ decays. For the induced $\\beta^-$ decay, we show that the constraints are weaker than the ones from the collider searches in almost all of the parameter space, and the accessible parameter space is already excluded by the current LHC data. In case of a relative heavy dark fermion (a few MeV), the induced $\\beta^+$ decay is more sensitive than the collider search. Despite the advantage of the collider search that a much wider range of the dark fermion mass can be investigated, it can also provide a complementarity to the detect detections.\n\n", "2404.06397": "2024-04-09, **New Contributions to $b \\to s γ$ in Minimal G2HDM**, Che Hao Liu et.al., [2404.06397v1](http://arxiv.org/abs/2404.06397v1)\n\n We study the flavor-changing bottom quark radiative decay $b \\to s \\gamma$ induced at one-loop level within the minimal gauged two-Higgs-doublet model (G2HDM). Among the three new contributions to this rare process in G2HDM, we find that only the charged Higgs $\\mathcal{H^\\pm}$ contribution can be constrained by the current global fit data in $B$-physics. Other two contributions from the complex vectorial dark matter $\\mathcal{W}$ and dark Higgs $\\mathcal{D}$ are not sensitive to the current data. Combining with theoretical constraints imposed on the scalar potential and electroweak precision data for the oblique parameters, we exclude mass regions $m\\_{\\mathcal{H}^\\pm} \\lesssim 250$ GeV and $m\\_{\\mathcal{D}} \\lesssim 100$ GeV at the 95\\% confidence level.\n\n", "2404.06396": "2024-04-09, **Reconciling $S_8$: Insights from Interacting Dark Sectors**, Rahul Shah et.al., [2404.06396v1](http://arxiv.org/abs/2404.06396v1)\n\n We do a careful investigation of the prospects of dark energy (DE) interacting with cold dark matter (CDM) in alleviating the $S\\_8$ clustering tension. To this end, we consider various well-known parametrizations of the DE equation of state (EoS), and consider perturbations in both the dark sectors, along with an interaction term. Moreover, we perform a separate study for the phantom and non-phantom regimes. Using CMB, BAO and SNIa datasets, the constraints on the model parameters for each case have been obtained and a generic reduction in the $H\\_0-\\sigma\\_{8,0}$ correlation has been observed, both for constant and dynamical DE EoS. This reduction, coupled with a significant negative correlation between the interaction term and $\\sigma\\_{8,0}$, contributes to easing the clustering tension by lowering $\\sigma\\_{8,0}$ to somewhere in between the early CMB and late-time clustering measurements for the phantom regime, for almost all the models under consideration. In addition, this is achieved without exacerbating the Hubble tension. In this regard, the CPL and JBP models perform the best in relaxing the $S\\_8$ tension to $<1\\sigma$. However, for the non-phantom regime the $\\sigma\\_{8,0}$ tension tends to have worsened, which reassures the merits of phantom dark energy from latest data. We further do an investigation of the role of RSD datasets and find an overall reduction in tension, with a value of $\\sigma\\_{8,0}$ relatively closer to the CMB value. We finally check if further extensions of this scenario, like the inclusion of the sound speed of dark energy and warm dark matter interacting with DE, can have some effects.\n\n", "2404.05999": "2024-04-09, **Explaining the cosmological dark matter coincidence in asymmetric dark QCD**, Alexander C. Ritter et.al., [2404.05999v1](http://arxiv.org/abs/2404.05999v1)\n\n To properly solve the coincidence problem ($\\Omega\\_\\mathrm{DM} \\simeq 5\\Omega\\_\\mathrm{VM}$) in a model of asymmetric dark matter, one cannot simply relate the number densities of visible and dark matter without also relating their particle masses. Following previous work, we consider a framework where the dark matter is a confined state of a dark QCD gauge group whose confinement scale is dynamically related to the QCD confinement scale by a mechanism utilising infrared fixed points of the two gauge couplings. In this work we present a new, `zero-coupling infrared fixed point' approach, which allows a larger proportion of models in this framework to generically relate the masses of the visible and dark matter particles. Due to the heavy mass scale required for the new field content, we introduce supersymmetry to the theory. We consider how these models may be incorporated in a full theory of asymmetric dark matter, presenting some example leptogenesis-like models. We also discuss the phenomenology of these models; in particular, there are gravitational wave signals which, while weak, may be measurable at future mHz and $\\mu$Hz detectors.\n\n"}, "supernova": {"2404.07182": "2024-04-10, **Studying the Supernova Absolute Magnitude Constancy with Baryonic Acoustic Oscillations**, Denitsa Staicova et.al., [2404.07182v1](http://arxiv.org/abs/2404.07182v1)\n\n In this proceeding we review and expand on our recent work investigating the constancy of the absolute magnitude $M\\_B$ of Type Ia supernovae. In it, we used baryonic acoustic oscillations (BAO) to calibrate the supernova data and to check whether the resulting $M\\_B$ is constant. We used non-parametric methods like Gaussian processes and artificial neural networks to reconstruct $M\\_B(z)$. Here we elaborate on the results by putting them in the context of other studies investigating possible non-constant $M\\_B$ and the impact of the distance-duality relation. We also present some numerical details on the calculations in the original paper and new non-parametric reconstructions, including a conservative model-independent fit, confirming its main results. Notably, we see that $M\\_B$ remains constant within $1\\sigma$, with a possible jump around $z = 0.01 - 0.15$. Furthermore, the observed distribution of $M\\_B(z)$ cannot be described by a single Gaussian, displaying multiple peaks and tails. The choice of the only remaining parameter -- the sound horizon $r\\_d$ leads to a tension in the $M\\_B-r\\_d$ plane. Fitting different non-constant $M\\_B(z)$ models does not significantly improve the fit and there is no preference for any of the models by the statistical measures we employ.\n\n", "2404.07149": "2024-04-10, **Tianyu: search for the second solar system and explore the dynamic universe**, Fabo Feng et.al., [2404.07149v1](http://arxiv.org/abs/2404.07149v1)\n\n Giant planets like Jupiter and Saturn, play important roles in the formation and habitability of Earth-like planets. The detection of solar system analogs that have multiple cold giant planets is essential for our understanding of planet habitability and planet formation. Although transit surveys such as Kepler and TESS have discovered thousands of exoplanets, these missions are not sensitive to long period planets due to their limited observation baseline. The Tianyu project, comprising two 1-meter telescopes (Tianyu-I and II), is designed to detect transiting cold giant planets in order to find solar system analogs. Featuring a large field of view and equipped with a high-speed CMOS camera, Tianyu-I will perform a high-precision photometric survey of about 100 million stars, measuring light curves at hour-long cadence. The candidates found by Tianyu-I will be confirmed by Tianyu-II and other surveys and follow-up facilities through multi-band photometry, spectroscopy, and high resolution imaging. Tianyu telescopes will be situated at an elevation about 4000 meters in Lenghu, China. With a photometric precision of 1% for stars with V < 18 mag, Tianyu is expected to find more than 300 transiting exoplanets, including about 12 cold giant planets, over five years. A five-year survey of Tianyu would discover 1-2 solar system analogs. Moreover, Tianyu is also designed for non-exoplanetary exploration, incorporating multiple survey modes covering timescales from sub-seconds to months, with a particular emphasis on events occurring within the sub-second to hour range. It excels in observing areas such as infant supernovae, rare variable stars and binaries, tidal disruption events, Be stars, cometary activities, and interstellar objects. These discoveries not only enhance our comprehension of the universe but also offer compelling opportunities for public engagement in scientific exploration.\n\n", "2404.07070": "2024-04-10, **Model independent cosmographic constraints from DESI 2024**, Orlando Luongo et.al., [2404.07070v1](http://arxiv.org/abs/2404.07070v1)\n\n In this study, we explore model independent constraints on the universe kinematics up to the snap and jerk hierarchical terms. To do so, we consider the latest Baryon Acoustic Oscillation (BAO) release provided by the DESI collaboration, tackling the $r\\_d$ parameter to span within the range $[144,152]$ Mpc, with fixed step, $\\delta r\\_d=2$ Mpc, aligning with Planck and DESI results. Thus, employing Monte Carlo Markov chain analyses, we place stringent constraints on the cosmographic series, incorporating three combinations of data catalogs: the first BAO with observational Hubble data, the second BAO with type Ia supernovae, and the last including all three data sets. Our results conclusively constrain the cosmographic series, say the deceleration $q\\_0$, the jerk $j\\_0$, and the snap $s\\_0$ parameters, at the $2$--$\\sigma$ level, showcasing a significant departure on $j\\_0$ even at $1$--$\\sigma$ confidence level, albeit being compatible with the $\\Lambda$CDM paradigm on $q\\_0$ and $s\\_0$, at $2$--$\\sigma$ level. Analogously, the $h\\_0$ tension appears alleviated in the second hierarchy, say including snap. Finally, a direct comparison with the $\\Lambda$CDM, $w$CDM models and the Chevallier-Polarski-Linder parametrization is reported, definitively favoring the wCDM scenario.\n\n", "2404.06540": "2024-04-09, **Searching for Triple Systems Unbound by Supernovae**, Karina Barboza et.al., [2404.06540v1](http://arxiv.org/abs/2404.06540v1)\n\n A large fraction of massive stars are found in higher order systems where the presence of a tertiary may significantly modify the system's evolution. In particular, it can lead to increased numbers of compact object binaries and accelerate their mergers with important implications for gravitational wave observations. Using Gaia, we constrain the number of Galactic supernovae that produce unbound triples. We do this by searching 8 supernova remnants for stars with consistent Gaia parallaxes and paths intersecting near the center of the supernova remnant at a time consistent with the age of the remnant. We find no candidates for unbound triple systems. Combined with prior work, less than 11.4\\% of supernovae leave behind unbound triples at a 90\\% confidence limit. The absence of such systems limits their role in the evolution of massive stars and the formation of merging compact objects.\n\n", "2404.06303": "2024-04-09, **Dynamical dark energy in light of cosmic distance measurements I: a demonstration using simulated datasets**, Gan Gu et.al., [2404.06303v2](http://arxiv.org/abs/2404.06303v2)\n\n We develop methods to extract key dark energy information from cosmic distance measurements including the BAO scales and supernovae luminosity distances. Demonstrated using simulated datasets of the complete DESI, LSST and Roman surveys designed for BAO and SNe distance measurements, we show that using our method, the dynamical behaviour of the energy, pressure, equation of state (with its time derivative) of dark energy and the cosmic deceleration function can all be accurately recovered from high-quality data, which allows for robust diagnostic tests for dark energy models.\n\n"}}