{"neutrino": {"2404.02792": "2024-04-03, **Numerical relativity simulations of black hole and relativistic jet formation**, Takami Kuroda et.al., [2404.02792v1](http://arxiv.org/abs/2404.02792v1)\n\n We investigate impacts of stellar rotation and magnetic fields on black hole (BH) formation and its subsequent explosive activities, by conducting axisymmetric radiation-magnetohydrodynamics simulations of gravitational collapse of a 70 $M\\_\\odot$ star with two-moment multi energy neutrino transport in numerical relativity. Due to its dense stellar structure, all models cannot avoid the eventual BH formation even though a strongly magnetized model experiences the so-called magnetorotational explosion prior to the BH formation. One intriguing phenomenon observed in the strongly magnetized model is the formation of a relativistic jet in the post-BH formation. The relativistic jet is the outcome of a combination of strong magnetic fields and low-density materials above the BH. The jet further enhances the explosion energy beyond $\\sim10^{52}$ erg, which is well exceeding the gravitational overburden ahead of the shock. Our self-consistent supernova models demonstrate that rotating magnetized massive stars at the high-mass end of supernova progenitors could be a potential candidate of hypernova and long gamma-ray burst progenitors.\n\n", "2404.02775": "2024-04-03, **A plethora of long-range neutrino interactions probed by DUNE and T2HK**, Sanjib Kumar Agarwalla et.al., [2404.02775v1](http://arxiv.org/abs/2404.02775v1)\n\n Upcoming neutrino experiments will soon search for new neutrino interactions more thoroughly than ever before, boosting the prospects of extending the Standard Model. In anticipation of this, we forecast the capability of two of the leading long-baseline neutrino oscillation experiments, DUNE and T2HK, to look for new flavor-dependent neutrino interactions with electrons, protons, and neutrons that could affect the transitions between different flavors. We interpret their sensitivity in the context of long-range neutrino interactions, mediated by a new neutral boson lighter than $10^{-10}$ eV, and sourced by the vast amount of nearby and distant matter in the Earth, Moon, Sun, Milky Way, and beyond. For the first time, we explore the sensitivity of DUNE and T2HK to a wide variety of $U(1)^\\prime$ symmetries, built from combinations of lepton and baryon numbers, each of which induces new interactions that affect oscillations differently. We find ample sensitivity: in all cases, DUNE and T2HK may constrain the existence of the new interaction even if it is supremely feeble, may discover it, and, in some cases, may identify the symmetry responsible for it.\n\n", "2404.02636": "2024-04-03, **Sibyll$^{\\bigstar}$**, Felix Riehn et.al., [2404.02636v1](http://arxiv.org/abs/2404.02636v1)\n\n In the last decade, an increasing number of datasets have revealed a consistent discrepancy between the number of muons measured in ultra-high-energy extensive air showers (EAS) and the numbers predicted by simulations. This gap persists despite incorporating Large Hadron Collider (LHC) data into the tuning of current hadronic interaction models, leading to the phenomenon often termed the ''muon puzzle''. To gain a deeper understanding of the potential origins of this muon puzzle, we have developed Sibyll$^{\\bigstar}$, a series of phenomenologically modified versions of Sibyll 2.3d. In these models, we have increased muon production by altering $\\rho^0$, baryon-antibaryon pair, or kaon production in hadronic multiparticle production processes. These variants remain within bounds from provided by accelerator measurements, including those from the LHC and fixed-target experiments, notably NA49 and NA61, showing a level of consistency comparable to Sibyll 2.3d. Our findings show that these modifications can increase the muon count in EAS by up to 35%, while minimally affecting the depth of shower maximum ($X\\_{\\rm max}$) and other shower variables. Additionally, we assess the impact of these modifications on various observables, including inclusive muon and neutrino fluxes and the multiplicities of muon bundles in deep underground and water/ice Cherenkov detectors. We aim for at least one of these model variants to offer a more accurate representation of EAS data at the highest energies, thereby enhancing the quality of Monte Carlo predictions used in training neural networks. This improvement is crucial for achieving more reliable data analyses and interpretations.\n\n", "2404.02337": "2024-04-02, **Muon g-2 and lepton flavor violation in supersymmetric GUTs**, Mario E. Gomez et.al., [2404.02337v1](http://arxiv.org/abs/2404.02337v1)\n\n We present a class of supersymmetric (SUSY) GUT models that can explain the apparent discrepancy between the SM predictions and experimental values of muon g-2 while providing testable signals for lepton flavor violation in charged lepton decays. Moreover, these models predict LSP neutralino abundance that is compatible with the Planck dark matter bounds. We find that scenarios in the framework of $SU(4)\\_c\\times SU(2)\\_L\\times SU(2)\\_R$ unification, with additional symmetries to explain fermion masses and neutrino oscillations, provide interesting benchmarks for the search of SUSY by correlating a possible manifestation of it in dark matter, rare lepton decays and LHC signals.\n\n", "2404.02207": "2024-04-02, **A Scotogenic Model as a Prototype for Leptogenesis with One Single Gauge Singlet**, Björn Garbrecht et.al., [2404.02207v1](http://arxiv.org/abs/2404.02207v1)\n\n We investigate the potential of a minimal Scotogenic model with two additional scalar doublets and a single heavy Majorana fermion to explain neutrino masses, dark matter, and the baryon asymmetry of the Universe. In this minimal setup, Leptogenesis is purely flavored, and a second Majorana neutrino is not necessary because the Yukawa couplings of the extra doublets yield the necessary $CP$-odd phases. The mechanism we employ can also be applied to a wide range of scenarios with at least one singlet and two gauge multiplets. Despite stringent limits from the dark matter abundance, direct detection experiments, and the baryon asymmetry of the Universe, we find a parametric region consistent with all bounds which could resolve the above shortcomings of the Standard Model of particle physics. Methodically, we improve on the calculation of correlations between the mixing scalar fields given their finite width. We also present an argument to justify the kinetic equilibrium approximation for out-of-equilibrium distribution functions often used in calculations of Baryogenesis and Leptogenesis.\n\n", "2404.02202": "2024-04-02, **Constraints on the Cosmic Neutrino Background from NGC 1068**, Jack Franklin et.al., [2404.02202v1](http://arxiv.org/abs/2404.02202v1)\n\n We use recent evidence of TeV neutrino events from NGC 1068, detected by the IceCube experiment, to constrain the overdensity of relic neutrinos locally and globally. Since these high-energy neutrinos have travelled long distances through a sea of relic neutrinos, they could have undergone scattering, altering their observed flux on Earth. Considering only Standard Model interactions, we constrain the relic overdensity to be $\\eta\\leq 3.85 \\times 10^8 (5.39 \\times 10^{11})$ at the 95$\\%$ confidence level for overdensities with a radius of 14 Mpc (10 kpc), assuming the sum of neutrino masses saturates the cosmological bound, $\\sum\\_i m\\_i = 0.13$ eV. We demonstrate that this limit improves with larger neutrino masses and how it depends on the scale of the overdensity region.\n\n", "2404.02131": "2024-04-02, **Detecting Gravitational Wave Memory in the Next Galactic Core-Collapse Supernova**, Colter J. Richardson et.al., [2404.02131v1](http://arxiv.org/abs/2404.02131v1)\n\n We present an approach to detecting (linear) gravitational wave memory in a Galactic core-collapse supernova using current interferometers. Gravitational wave memory is an important prediction of general relativity that has yet to be confirmed. Our approach uses a combination of Linear Prediction Filtering and Matched-Filtering. We present the results of our approach on data from core-collapse supernova simulations that span a range of progenitor mass and metallicity. We are able to detect gravitational wave memory out to 10 kpc. We also present the False Alarm Probabilities assuming an On-Source Window compatible with the presence of a neutrino detection.\n\n", "2404.02027": "2024-04-02, **High-energy neutrinos flavour composition as a probe of neutrino magnetic moments**, Artem Popov et.al., [2404.02027v1](http://arxiv.org/abs/2404.02027v1)\n\n Neutrino propagation in the Galactic magnetic field is considered. To describe neutrino flavour and spin oscillations on the galactic scale baselines an approach using wave packets is developed. Evolution equations for the neutrino wave packets in a uniform and non-uniform magnetic field are derived. Analytical expressions for neutrino flavour and spin oscillations probabilities accounting for damping due to wave packet separation are obtained for the case of uniform magnetic field. It is shown that for oscillations on magnetic frequencies $\\omega\\_i^B = \\mu\\_i B\\_\\perp$ the coherence lengths that characterizes the damping scale is proportional to the cube of neutrino average momentum $p\\_0^3$. Probabilities of flavour and spin oscillations are calculated numerically for neutrino interacting with the non-uniform Galactic magnetic field. Flavour compositions of high-energy neutrino flux coming from the Galactic centre are calculated accounting for neutrino interaction with the magnetic field. It is shown that for neutrino magnetic moments $\\sim 10^{-13} \\mu\\_B$ and larger these flavour compositions significantly differ from ones predicted by the vacuum neutrino oscillations scenario.\n\n", "2404.01840": "2024-04-02, **Particle Creation in a Linear Gravitational Wave Background**, Tanmoy Chakraborty et.al., [2404.01840v1](http://arxiv.org/abs/2404.01840v1)\n\n Inspired by Leonard Parker's pioneering 1968 work demonstrating matter quanta production in a dynamical spacetime background, we consider production of scalar quanta in a gravitational wave background. Choosing the spacetime to be a flat spacetime perturbed linearly by a spherical plane gravitational wave, we show that scalar particles may indeed be produced in a perturbative manner. Our formulation is valid for any linear gravitational wave background profile, and should generalize straightforwardly to production of massless elementary particles of diverse species (photons, neutrinos). In this aspect, irrespective of the astrophysical nature of the binary merger sourcing the gravitational wave signal, one expects the dynamical nature of the spacetime to produce all species of light particles. Thus, any binary coalescence is in effect a source of multimessenger astrophysics.\n\n", "2404.01777": "2024-04-02, **A thermionic electron gun to characterize silicon drift detectors with electrons**, Korbinian Urban et.al., [2404.01777v1](http://arxiv.org/abs/2404.01777v1)\n\n The TRISTAN detector is a new detector for electron spectroscopy at the Karlsruhe Tritium Neutrino (KATRIN) experiment. The semiconductor detector utilizes the silicon drift detector technology and will enable the precise measurement of the entire tritium beta decay electron spectrum. Thus, a significant fraction of the parameter space of potential neutrino mass eigenstates in the keV-mass regime can be probed. We developed a custom electron gun based on the effect of thermionic emission to characterize the TRISTAN detector modules with mono-energetic electrons before installation into the KATRIN beamline. The electron gun provides an electron beam with up to 25 keV kinetic energy and an electron rate in the order of 1E5 electrons per second. This manuscript gives an overview of the design and commissioning of the electron gun. In addition, we will shortly discuss a first measurement with the electron gun to characterize the electron response of the TRISTAN detector.\n\n", "2404.01763": "2024-04-02, **Diagnostics of 3D explosion asymmetries of stripped-envelope supernovae by nebular line profiles**, Bart van Baal et.al., [2404.01763v1](http://arxiv.org/abs/2404.01763v1)\n\n Understanding the explosion mechanism and hydrodynamic evolution of core-collapse supernovae is a long-standing quest in astronomy. The asymmetries caused by the explosion are encoded into the line profiles which appear in the nebular phase of the SN evolution -- with particularly clean imprints in He star explosions. Here, we carry out nine different supernova simulations of He-core progenitors, exploding them in 3D with parametrically varied neutrino luminosities using the $\\texttt{Prometheus-HotB}$ code, hydrodynamically evolving the models to the homologeous phase. We then compute nebular phase spectra with the 3D NLTE spectral synthesis code $\\texttt{ExTraSS}$ (EXplosive TRAnsient Spectral Simulator). We study how line widths and shifts depend on progenitor mass, explosion energy, and viewing angle. We compare the predicted line profile properties against a large set of Type Ib observations, and discuss the degree to which current neutrino-driven explosions can match observationally inferred asymmetries. With self-consistent 3D modelling -- circumventing the difficulties of representing $^{56}$Ni mixing and clumping accurately in 1D models -- we find that neither low-mass He cores exploding with high energies nor high-mass cores exploding with low energies contribute to the Type Ib SN population. Models which have line profile widths in agreement with this population give sufficiently large centroid shifts for calcium emission lines. Calcium is more strongly affected by explosion asymmetries connected to the neutron star kicks than oxygen and magnesium. Lastly, we turn to the NIR spectra from our models to investigate the potential of using this regime to look for the presence of He in the nebular phase.\n\n", "2404.01687": "2024-04-02, **Search for a sub-eV sterile neutrino using Daya Bay's full dataset**, F. P. An et.al., [2404.01687v1](http://arxiv.org/abs/2404.01687v1)\n\n This Letter presents results of a search for the mixing of a sub-eV sterile neutrino based on the full data sample of the Daya Bay Reactor Neutrino Experiment, collected during 3158 days of detector operation, which contains $5.55 \\times 10^{6}$ reactor \\anue candidates identified as inverse beta-decay interactions followed by neutron-capture on gadolinium. The result was obtained in the minimally extended 3+1 neutrino mixing model. The analysis benefits from a doubling of the statistics of our previous result and from improvements of several important systematic uncertainties. The results are consistent with the standard three-neutrino mixing model and no significant signal of a sub-eV sterile neutrino was found. Exclusion limits are set by both Feldman-Cousins and CLs methods. Light sterile neutrino mixing with $\\sin^2 2\\theta\\_{14} \\gtrsim 0.01$ can be excluded at 95\\% confidence level in the region of $0.01$ eV$^2 \\lesssim \\|\\Delta m^{2}\\_{41}\\| \\lesssim 0.1 $ eV$^2$. This result represents the world-leading constraints in the region of $2 \\times 10^{-4}$ eV$^2 \\lesssim \\|\\Delta m^{2}\\_{41}\\| \\lesssim 0.2 $ eV$^2$.\n\n"}, "dark matter": {"2404.02906": "2024-04-03, **Hitting the Thermal Target for Leptophilic Dark Matter**, Cari Cesarotti et.al., [2404.02906v1](http://arxiv.org/abs/2404.02906v1)\n\n We study future lepton collider prospects for testing predictive models of leptophilic dark matter candidates with a thermal origin. We calculate experimental milestones for testing the parameter space compatible with freeze-out and the associated collider signals at past, present, and future facilities. This analysis places new limits on such models by leveraging the utility of lepton colliders. At $e^+e^-$ machines, we make projections using precision $Z$-pole observables from $e^+e^-\\to l^+l^- + $ missing energy signatures at LEP and future projections for FCC-ee in these channels. Additionally, a muon collider could also probe new thermal relic parameter space in this scenario via $\\mu^+\\mu^- \\to X + $ missing energy where $X$ is any easy identifiable SM object. Collectively, these processes can probe much all of the parameter space for which DM direct annihilation to $l^+l^-$ yields the observed relic density in Higgs-like models with mass-proportional couplings to charged leptons.\n\n", "2404.02808": "2024-04-03, **Dancing above the abyss: Environmental effects and dark matter signatures in inspirals into massive black holes**, Niklas Becker et.al., [2404.02808v1](http://arxiv.org/abs/2404.02808v1)\n\n In this dissertation, we look at environmental effects in extreme and intermediate mass ratio inspirals into massive black holes. In these systems, stellar mass compact objects orbit massive black holes and lose orbital energy due to gravitational wave emission and other dissipative forces. We explore environmental interactions with dark matter spikes, stellar distributions, accretion disks, and combine and compare them. We discuss the existence and properties of dark matter spikes in the presence of these environmental effects. The signatures of the environmental effects, such as the phase space flow, dephasing, deshifting of the periapse, and alignment with accretion disks, are examined. These signatures are quantified in isolated spike systems, in dry, and in wet inspirals. We generally find dark matter effects to be subdominant to the other environmental effects, but their impact on the waveform is still observable and identifiable. Lastly, the rates of inspirals and the impact of spikes are estimated. All of these results are obtained with the help of a code imripy that is published alongside. If dark matter spikes exist, they should be observable with space-based gravitational wave observatories\n\n", "2404.02793": "2024-04-03, **xGASS: The scatter of the HI-halo mass relation of central galaxies**, Manasvee Saraf et.al., [2404.02793v1](http://arxiv.org/abs/2404.02793v1)\n\n Empirical studies of the relationship between baryonic matter in galaxies and the gravitational potential of their host halos are important to constrain our theoretical framework for galaxy formation and evolution. One such relation, between the atomic hydrogen (HI) mass of central galaxies ($M\\_{\\rm{HI,c}}$) and the total mass of their host halos ($M\\_{\\rm{halo}}$), has attracted significant interest in the last few years. In this work, we use the extended GALEX Arecibo SDSS Survey to examine the scatter of the HI-halo mass relation for a representative sample of central galaxies. Our findings reveal a flat median relation at $\\rm{log}\\_{10}$$(M\\_{\\rm{HI,c}}/\\rm{M}\\_{\\odot}) \\approx 9.40$, across $11.1 < \\rm{log}\\_{10}$$(M\\_{\\rm{halo}}/\\rm{M\\_{\\odot}}) < 14.1$. This flat relation stems from the statistical dominance of star-forming, disc galaxies at low $M\\_{\\rm{halo}}$ in combination with the increasing prevalence of passive, high stellar-concentration systems at higher $M\\_{\\rm{halo}}$. The scatter of this relation and the stellar specific angular momentum of centrals have a strong link (Spearman's rank correlation coefficient $\\geq 0.5$). Comparisons with simulations suggest that the kinematic state of host halos may be primarily driving this scatter. Our findings highlight that the HI-halo mass parameter space is too complex to be completely represented by simple median or average relations and we show that tensions with previous works are most likely due to selection biases. We recommend that future observational studies, and their comparisons with theoretical models, bin central galaxies also by their secondary properties to enable a statistically robust understanding of the processes regulating the cold gas content within central galaxies of dark-matter halos.\n\n", "2404.02646": "2024-04-03, **Ultralight scalar dark matter versus non-adiabatic perfect fluid dark matter in pulsar timing**, Qing-Hua Zhu et.al., [2404.02646v1](http://arxiv.org/abs/2404.02646v1)\n\n Recent evidence of direct detection of stochastic gravitational waves reported by pulsar timing array collaborations might open a new window for studying cosmology and astrophysical phenomena. In addition to signals from gravitational waves, there is motivation to explore residual signals from oscillating dark matter, which might partially comprise the galactic halo. We investigate fluctuations in pulsar timing originating from the coherent oscillation of scalar dark matter up to the subleading order of $\\mathcal{O}(k/m)$, as well as from acoustic oscillations of non-adiabatic perfect fluid dark matter. Both types of dark matter can generate oscillating Newtonian potential perturbations and curvature perturbations, thereby affecting pulsar timing. Our results show distinctive signatures in pulsar timing residuals and angular correlations for these dark matters. Specifically, pulsar timing residuals from non-adiabatic perfect fluid dark matter exhibit different directional dependence and are shown to be more sensitive to the distance to a pulsar. We also study the angular correlation patterns from these dark matters in the NANOGrav 15-year data set. The best fit might suggest that the composition of non-adiabatic perfect fluid dark matter in our galaxy is much greater than that of ultralight scalar dark matter.\n\n", "2404.02630": "2024-04-03, **Dynamical Casimir effect with screened scalar fields**, Ana Lucía Báez-Camargo et.al., [2404.02630v1](http://arxiv.org/abs/2404.02630v1)\n\n Understanding the nature of dark energy and dark matter is one of modern physics' greatest open problems. Scalar-tensor theories with screened scalar fields like the chameleon model are among the most popular proposed solutions. In this article, we present the first analysis of the impact of a chameleon field on the dynamical Casimir effect, whose main feature is the particle production associated with a resonant condition of boundary periodic motion in cavities. For this, we employ a recently developed method to compute the evolution of confined quantum scalar fields in a globally hyperbolic spacetime by means of time-dependent Bogoliubov transformations. As a result, we show that particle production is reduced due to the presence of the chameleon field. In addition, our results for the Bogoliubov coefficients and the mean number of created particles agree with known results in the absence of a chameleon field. Our results initiate the discussion of the evolution of quantum fields on screened scalar field backgrounds.\n\n", "2404.02607": "2024-04-03, **DoubleTES detectors to investigate the CRESST low energy background: results from above-ground prototypes**, G. Angloher et.al., [2404.02607v1](http://arxiv.org/abs/2404.02607v1)\n\n In recent times, the sensitivity of low-mass direct dark matter searches has been limited by unknown low energy backgrounds close to the energy threshold of the experiments known as the low energy excess (LEE). The CRESST experiment utilises advanced cryogenic detectors constructed with different types of crystals equipped with Transition Edge Sensors (TESs) to measure signals of nuclear recoils induced by the scattering of dark matter particles in the detector. In CRESST, this low energy background manifests itself as a steeply rising population of events below 200 eV. A novel detector design named doubleTES using two identical TESs on the target crystal was studied to investigate the hypothesis that the events are sensor-related. We present the first results from two such modules, demonstrating their ability to differentiate between events originating from the crystal's bulk and those occurring in the sensor or in its close proximity.\n\n", "2404.02492": "2024-04-03, **Enhanced Curvature Perturbation and Primordial Black Hole Formation in Two-stage Inflation with a break**, Xinpeng Wang et.al., [2404.02492v1](http://arxiv.org/abs/2404.02492v1)\n\n We investigate a model of $R^2$-gravity with a non-minimally coupled scalar field that gives rise to two-stage inflation with a break, that is, with an intermediate stage where inflation momentarily halts. We find that the power spectrum of the primordial curvature perturbation is significantly enhanced at the break scale, which can account for the primordial black hole (PBH) formation, without affecting the CMB constraint on large scales. The behavior of the curvature perturbation is carefully analyzed and we find a few notable new features in the spectrum. In particular, we find that the $k^3$ growth of the spectrum of toward the end of the first stage of inflation. We argue that this is a universal feature common to all two-stage models where the field dominating the second stage is heavy during the first stage. By appropriately tuning the model parameters, we find that our model can realize the scenario of PBHs as the cold dark matter of the Universe. We also find that we can choose the parameters so that the spectrum of the induced gravitational waves from the enhanced curvature perturbation fits the NANOGrav-15yr data of pulsar timing array observation.\n\n", "2404.02110": "2024-04-02, **Tightening the reins on non-minimal dark sector physics: Interacting Dark Energy with dynamical and non-dynamical equation of state**, William Giarè et.al., [2404.02110v1](http://arxiv.org/abs/2404.02110v1)\n\n We present a comprehensive reassessment of the state of Interacting Dark Energy (IDE) cosmology, namely models featuring a non-gravitational interaction between Dark Matter (DM) and Dark Energy (DE). To achieve high generality, we extend the dark sector physics by considering two different scenarios: a non-dynamical DE equation of state $w\\_0\\neq-1$, and a dynamical $w(a)=w\\_0+w\\_a(1-a)$. In both cases, we distinguish two different physical regimes resulting from a phantom or quintessence equation of state. To circumvent early-time superhorizon instabilities, the energy-momentum transfer should occur in opposing directions within the two regimes, resulting in distinct phenomenological outcomes. We study quintessence and phantom non-dynamical and dynamical models in light of two independent Cosmic Microwave Background (CMB) experiments - the Planck satellite and the Atacama Cosmology Telescope. We analyze CMB data both independently and in combination with Supernovae (SN) distance moduli measurements from the Pantheon-Plus catalog and Baryon Acoustic Oscillations (BAO) from the SDSS-IV eBOSS survey. Our results update and extend the state-of-the-art analyses, significantly narrowing the parameter space allowed for these models and limiting their overall ability to reconcile cosmological tensions. Although considering different combinations of data leaves some freedom to increase $H\\_0$ towards the value measured by the SH0ES collaboration, our most constraining dataset (CMB+BAO+SN) indicates that fully reconciling the tension solely within the framework of IDE remains challenging.\n\n", "2404.01846": "2024-04-02, **Testing Yukawa cosmology at the Milky Way and M31 galactic scales**, Rocco D'Agostino et.al., [2404.01846v1](http://arxiv.org/abs/2404.01846v1)\n\n We address the galaxy rotation curves through the Yukawa gravitational potential emerging as a correction of the Newtonian potential in extended theories of gravity. On the one hand, we consider the contribution of the galactic bulge, galactic disk, and the dark matter halo of the Navarro-Frenk-White profile, in the framework of the standard $\\Lambda$CDM model. On the other hand, we use modified Yukawa gravity to show that the rotational velocity of galaxies can be addressed successfully without the need for dark matter. In Yukawa gravity, we recover MOND and show that dark matter might be seen as an apparent effect due to the modification of the law of gravitation in terms of two parameters: the coupling constant $\\alpha $ and the characteristic length $\\lambda$. We thus test our theoretical scenario using the Milky Way and M31 rotation velocity curves. In particular, we place observational constraints on the free parameters of Yukawa cosmology through the Monte Carlo method and then compare our results with the predictions of the $\\Lambda$CDM paradigm by making use of Bayesian information criteria. Specifically, we find that $\\lambda$ is constrained to be of the order of kpc, while cosmological data suggest $\\lambda$ of the order of Gpc. To explain this discrepancy, we argue that there is a fundamental limitation in measuring $\\lambda$ due to the role of quantum mechanics on cosmological scales.\n\n", "2404.01780": "2024-04-02, **CSST Strong Lensing Preparation: a Framework for Detecting Strong Lenses in the Multi-color Imaging Survey by the China Survey Space Telescope (CSST)**, Xu Li et.al., [2404.01780v1](http://arxiv.org/abs/2404.01780v1)\n\n Strong gravitational lensing is a powerful tool for investigating dark matter and dark energy properties. With the advent of large-scale sky surveys, we can discover strong lensing systems on an unprecedented scale, which requires efficient tools to extract them from billions of astronomical objects. The existing mainstream lens-finding tools are based on machine learning algorithms and applied to cut-out-centered galaxies. However, according to the design and survey strategy of optical surveys by CSST, preparing cutouts with multiple bands requires considerable efforts. To overcome these challenges, we have developed a framework based on a hierarchical visual Transformer with a sliding window technique to search for strong lensing systems within entire images. Moreover, given that multi-color images of strong lensing systems can provide insights into their physical characteristics, our framework is specifically crafted to identify strong lensing systems in images with any number of channels. As evaluated using CSST mock data based on an Semi-Analytic Model named CosmoDC2, our framework achieves precision and recall rates of 0.98 and 0.90, respectively. To evaluate the effectiveness of our method in real observations, we have applied it to a subset of images from the DESI Legacy Imaging Surveys and media images from Euclid Early Release Observations. 61 new strong lensing system candidates are discovered by our method. However, we also identified false positives arising primarily from the simplified galaxy morphology assumptions within the simulation. This underscores the practical limitations of our approach while simultaneously highlighting potential avenues for future improvements.\n\n", "2404.01560": "2024-04-02, **Brightest Cluster Galaxies and the Intracluster Light**, Emanuele Contini et.al., [2404.01560v1](http://arxiv.org/abs/2404.01560v1)\n\n In this chapter, we delve into the formation and primary characteristics of two significant components within galaxy clusters: the brightest cluster galaxies and the intracluster light. Drawing upon recent and pertinent studies in the field, we explore the mechanisms driving their growth from high redshift to the present day. We also examine how these formation mechanisms are intertwined with the dynamical state of their host clusters, suggesting their potential utility as luminous tracers of dark matter.\n\n"}, "supernova": {"2404.02651": "2024-04-03, **Magnetic Field of Molecular Gas Measured with the Velocity Gradient Technique II: Curved Magnetic Field in kpc-Scale Bubble of NGC\\,628**, Mengke Zhao et.al., [2404.02651v1](http://arxiv.org/abs/2404.02651v1)\n\n We report the detection of the ordered alignment between the magnetic field and kpc-scale bubbles in the nearby spiral galaxy, NGC\\,628. Applying the Velocity Gradient Technique (VGT) on CO spectroscopic data from the ALMA-PHANGS, the magnetic field of NGC\\,628 is measured at the scale of 191\\,pc ($\\sim$ 4\\,$''$). The large-scale magnetic field is oriented parallel to the spiral arms and curves around the galactic bubble structures in the mid-infrared emission observed by the James Webb Space Telescope (JWST). Twenty-one bubble structures have been identified at the edges of spiral arms with scales over 300\\,pc, which includes two kpc-scale structures. These bubbles are caused by supernova remnants and prolonged star formation and are similar to the outflow chimneys found in neutral hydrogen in galactic disks. At the edge of the bubbles, the shocks traced by the OIII emission present a curved magnetic field that parallels the bubble's shell. The magnetic field follows the bubble expansion and binds the gas in the shell to trigger further star formation. By analyzing the larger sample of 1694 bubbles, we found a distinct radial-size distribution of bubbles in NGC\\,628 indicating the star formation history in the galaxy.\n\n", "2404.02566": "2024-04-03, **Detached Circumstellar Matter as an Explanation for Slowly-Rising Interacting Type Ibc Supernovae**, Yuki Takei et.al., [2404.02566v1](http://arxiv.org/abs/2404.02566v1)\n\n Some hydrogen-poor (Type Ibc) supernovae (SNe) are known to have massive circumstellar matter (CSM) that are well detached from the star. Using the open-source code CHIPS, we construct a grid of models of SN Ibc interacting with detached CSM. We find that interaction with detached CSM can produce a slowly rising phase in the light curve seen in some interacting SN Ibc, which is difficult to reproduce by interaction with CSM of a density profile motivated from wind or eruptions that are continuous down to the star. We also show that SNe having double peaks in their light curves with timescales of months (e.g., SN 2022xxf) can be explained by radioactive decay of $^{56}$Ni/$^{56}$Co, followed by interaction with detached CSM.\n\n", "2404.02139": "2024-04-02, **Lensed Type Ia Supernova \"Encore\" at z=2: The First Instance of Two Multiply-Imaged Supernovae in the Same Host Galaxy**, J. D. R. Pierel et.al., [2404.02139v2](http://arxiv.org/abs/2404.02139v2)\n\n A bright ($m\\_{\\rm F150W,AB}$=24 mag), $z=1.95$ supernova (SN) candidate was discovered in JWST/NIRCam imaging acquired on 2023 November 17. The SN is quintuply-imaged as a result of strong gravitational lensing by a foreground galaxy cluster, detected in three locations, and remarkably is the second lensed SN found in the same host galaxy. The previous lensed SN was called \"Requiem\", and therefore the new SN is named \"Encore\". This makes the MACS J0138.0$-$2155 cluster the first known system to produce more than one multiply-imaged SN. Moreover, both SN Requiem and SN Encore are Type Ia SNe (SNe Ia), making this the most distant case of a galaxy hosting two SNe Ia. Using parametric host fitting, we determine the probability of detecting two SNe Ia in this host galaxy over a $\\sim10$ year window to be $\\approx3\\%$. These observations have the potential to yield a Hubble Constant ($H\\_0$) measurement with $\\sim10\\%$ precision, only the third lensed SN capable of such a result, using the three visible images of the SN. Both SN Requiem and SN Encore have a fourth image that is expected to appear within a few years of $\\sim2030$, providing an unprecedented baseline for time-delay cosmography.\n\n", "2404.02110": "2024-04-02, **Tightening the reins on non-minimal dark sector physics: Interacting Dark Energy with dynamical and non-dynamical equation of state**, William Giarè et.al., [2404.02110v1](http://arxiv.org/abs/2404.02110v1)\n\n We present a comprehensive reassessment of the state of Interacting Dark Energy (IDE) cosmology, namely models featuring a non-gravitational interaction between Dark Matter (DM) and Dark Energy (DE). To achieve high generality, we extend the dark sector physics by considering two different scenarios: a non-dynamical DE equation of state $w\\_0\\neq-1$, and a dynamical $w(a)=w\\_0+w\\_a(1-a)$. In both cases, we distinguish two different physical regimes resulting from a phantom or quintessence equation of state. To circumvent early-time superhorizon instabilities, the energy-momentum transfer should occur in opposing directions within the two regimes, resulting in distinct phenomenological outcomes. We study quintessence and phantom non-dynamical and dynamical models in light of two independent Cosmic Microwave Background (CMB) experiments - the Planck satellite and the Atacama Cosmology Telescope. We analyze CMB data both independently and in combination with Supernovae (SN) distance moduli measurements from the Pantheon-Plus catalog and Baryon Acoustic Oscillations (BAO) from the SDSS-IV eBOSS survey. Our results update and extend the state-of-the-art analyses, significantly narrowing the parameter space allowed for these models and limiting their overall ability to reconcile cosmological tensions. Although considering different combinations of data leaves some freedom to increase $H\\_0$ towards the value measured by the SH0ES collaboration, our most constraining dataset (CMB+BAO+SN) indicates that fully reconciling the tension solely within the framework of IDE remains challenging.\n\n", "2404.01905": "2024-04-02, **On the surface helium abundance of B-type hot subdwarf stars from the WD+MS channel of Type Ia supernovae**, Rui-Jie Ji et.al., [2404.01905v1](http://arxiv.org/abs/2404.01905v1)\n\n The origin of intermediate helium (He)-rich hot subdwarfs are still unclear. Previous studies have suggested that some surviving Type Ia supernovae (SNe Ia) companions from the white dwarf~+~main-sequence (WD+MS) channel may contribute to the intermediate He-rich hot subdwarfs. However, previous studies ignored the impact of atomic diffusion on the post-explosion evolution of surviving companion stars of SNe Ia, leading to that they could not explain the observed surface He abundance of intermediate He-rich hot subdwarfs. In this work, by taking the atomic diffusion and stellar wind into account, we trace the surviving companions of SNe Ia from the WD+MS channel using the one-dimensional stellar evolution code \\textsc{MESA} until they evolve into hot subdwarfs. We find that the surface He-abundances of our surviving companion models during their core He-burning phases are in a range of $-1 \\lesssim {\\rm log}(N\\_{\\rm He}/N\\_{\\rm H}) \\lesssim 0$, which are consistent with those observed in intermediate He-rich hot subdwarfs. This seems to further support that surviving companions of SNe Ia in the WD+MS channel are possible to form some intermediate He-rich hot subdwarfs.\n\n", "2404.01776": "2024-04-02, **Diversity in hydrogen-rich envelope mass of type II supernovae (I): $V$-band light curve modeling**, Qiliang Fang et.al., [2404.01776v1](http://arxiv.org/abs/2404.01776v1)\n\n We conduct a systematic study on the light curves of type II supernovae (SNe II) to investigate how they are affected by the physical properties of the progenitor and the nature of the explosion. The calculations of pre-supernova evolution, the launch of the explosion, and the light curve are carried out by \\texttt{MESA} and \\texttt{STELLA}. Our study encompasses a wide range of zero-age-main-sequence (ZAMS) masses (10 - 20 $M\\_{\\rm \\odot}$), wind mass-loss rates (which control the range of hydrogen-rich envelope mass to be 3 - 12 $M\\_{\\rm \\odot}$), explosion energies (0.1 - 2.5 $\\times$ 10$^{51}$ erg), and $^{56}$Ni masses (0 - 0.15 $M\\_{\\rm \\odot}$). Our analyses reveal that when the explosion energy is fixed, the light curve is primarily determined by the properties of the hydrogen-rich envelope, despite the large variation in the ZAMS masses. The dependencies of the light-curve characteristics on the envelope mass, radius, and explosion energy are investigated, and we establish the scaling relations connecting these quantities. We further derive a formula that corrects for effects of the $^{56}$Ni heating based on observables. Using the derived equations, we develop a method that can constrain the envelope mass with uncertainty within 1 $M\\_{\\rm \\odot}$ based on photometry. This method is applied to a large sample of $\\sim$ 100 SNe II, which reveals a considerably broader range of the envelope masses estimated from observables as compared to those predicted by single star models evolving with standard stellar wind; this finding indicates that a large fraction of SNe II experience substantial mass-loss beyond the standard mass-loss prescription prior to their explosions, highlighting the uncertainties involved in the massive star evolution and pre-SN mass-loss mechanism.\n\n", "2404.01658": "2024-04-02, **Finite-temperature expansion of the dense-matter equation of state**, Debora Mroczek et.al., [2404.01658v1](http://arxiv.org/abs/2404.01658v1)\n\n In this work we provide a new, well-controlled expansion of the equation of state of dense matter from zero to finite temperatures ($T$), while covering a wide range of charge fractions ($Y\\_Q$), from pure neutron to isospin symmetric nuclear matter. Our expansion can be used to describe neutron star mergers and core-collapse supernova explosions using as a starting point neutron star observations, while maintaining agreement with laboratory data, in a model independent way. We suggest new thermodynamic quantities of interest that can be calculated from theoretical models or directly inferred by experimental data that can help constrain the finite $T$ equation of state. With our new method, we can quantify the uncertainty in our finite $T$ and $Y\\_Q$ expansions in a well-controlled manner without making assumptions about the underlying degrees of freedom. We can reproduce results from a microscopic equation of state up to $T=100$ MeV for baryon chemical potential $\\mu\\_B\\gtrsim 1100$ MeV ($\\sim1-2 \\ n\\_{\\rm sat}$) within $5\\%$ error, with even better results for larger $\\mu\\_B$ and/or lower $T$. We investigate the sources of numerical and theoretical uncertainty and discuss future directions of study.\n\n"}}