{"neutrino": {"2408.02877": "2024-08-06, **First Measurement of Solar $^8$B Neutrinos via Coherent Elastic Neutrino-Nucleus Scattering with XENONnT**, E. Aprile et.al., [2408.02877v1](http://arxiv.org/abs/2408.02877v1)\n\n We present the first measurement of nuclear recoils from solar $^8$B neutrinos via coherent elastic neutrino-nucleus scattering with the XENONnT dark matter experiment. The central detector of XENONnT is a low-background, two-phase time projection chamber with a 5.9\\,t sensitive liquid xenon target. A blind analysis with an exposure of 3.51\\,t$\\times$y resulted in 37 observed events above 0.5\\,keV, with ($26.4^{+1.4}\\_{-1.3}$) events expected from backgrounds. The background-only hypothesis is rejected with a statistical significance of 2.73\\,$\\sigma$. The measured $^8$B solar neutrino flux of $(4.7\\_{-2.3}^{+3.6})\\times 10^6\\,\\mathrm{cm}^{-2}\\mathrm{s}^{-1}$ is consistent with results from dedicated solar neutrino experiments. The measured neutrino flux-weighted CE$\\nu$NS cross-section on Xe of $(1.1^{+0.8}\\_{-0.5})\\times10^{-39}\\,\\mathrm{cm}^2$ is consistent with the Standard Model prediction. This is the first direct measurement of nuclear recoils from solar neutrinos with a dark matter detector.\n\n", "2408.02195": "2024-08-05, **On the global Gaussian bending measure and its applications in stationary spacetimes**, Z. Zhang et.al., [2408.02195v1](http://arxiv.org/abs/2408.02195v1)\n\n Alternative gravity theories have been put forward to address the limitations of general relativity, each exhibiting differences, particularly in their strong-field limits. Nonetheless, there remains a lack of effective means to distinguish or test these theories through local strong-field measurements. In this work, we define a global Gaussian bending measure over singular spacetime regions, establish a corresponding global theory, and demonstrate its applications in a general stationary spacetime. The global theory is based on differential geometry, rather than on specific gravity theories, allowing it to depict various physics within general relativity and beyond. For example, it is applicable to describe the gravitational bending of massless or massive messengers, such as photons, neutrinos, cosmic rays, and possibly massive gravitational waves predicted in certain theories of gravity. Besides, the global theory can be applied to any stationary spacetime regions outside a rotating black hole. As an instance of its direct applications, we investigate the highly-curved spacetime effects of the black hole in its immediate surrounding regions and design local strong-field experiments involving different shapes of singular lensing patches. New means can be therefore anticipated to be developed according to the global theory to differentiate between different gravity theories and test them in their strong-field regions.\n\n"}, "dark matter": {"2408.03276": "2024-08-06, **Minding the gap: testing natural anomaly-mediated SUSY breaking at high luminosity LHC**, Howard Baer et.al., [2408.03276v1](http://arxiv.org/abs/2408.03276v1)\n\n While the minimal anomaly-mediated SUSY breaking model (mAMSB) seems ruled out by constraints on Higgs mass, naturalness and wino dark matter, a slightly generalized version dubbed natural AMSB (nAMSB) remains both viable and compelling. Like mAMSB, nAMSB features winos as the lightest gauginos, but unlike mAMSB, nAMSB allows a small mu parameter so that higgsinos are the lightest of electroweakinos (EWinos). nAMSB spectra depend on the input value of gravitino mass m\\_{3/2}, where the lower range of m\\_{3/2} is excluded by LHC gluino pair searches while a higher m\\_{3/2} band is excluded by LHC limits on wino pair production followed by boosted hadronic wino decays. A remaining intermediate gap in m\\_{3/2} values remains allowed by present LHC searches, but appears to be completely explorable by high luminosity ugrades of LHC (HL-LHC). We explore a variety of compelling discovery channels that may allow one to close the intermediate gap in m\\_{3/2} values: 1. same-sign diboson +MET (SSdB) production arising from wino pair production, leading to same-sign dileptons plus MET, 2. trilepton production arising from wino pair production and 3. soft dilepton plus jet events from higgsino pair production, 4. top-squark pair production. From our signal-to-background analysis along a nAMSB model line, we expect HL-LHC to either discover or rule out the nAMSB model with 3000 fb^{-1} of integrated luminosity.\n\n", "2408.03128": "2024-08-06, **Evolution of Star Cluster Within Galaxy using Self-consistent Hybrid Hydro/N-body Simulation**, Yongseok Jo et.al., [2408.03128v1](http://arxiv.org/abs/2408.03128v1)\n\n We introduce a GPU-accelerated hybrid hydro/N-body code (Enzo-N) designed to address the challenges of concurrently simulating star clusters and their parent galaxies. This task has been exceedingly challenging, primarily due to the considerable computational time required, which stems from the substantial scale difference between galaxies (~ 0.1 Mpc) and star clusters (~ pc). Yet, this significant scale separation means that particles within star clusters perceive those outside the star cluster in a semi-stationary state. By leveraging this aspect, we integrate the direct N-body code (Nbody6++GPU) into the cosmological (magneto-)hydrodynamic code (Enzo) through the utilization of the semi-stationary background acceleration approximation. We solve the dynamics of particles within star clusters using the direct N-body solver with regularization for few-body interactions, while evolving particles outside -- dark matter, gas, and stars -- using the particle-mesh gravity solver and hydrodynamic methods. We demonstrate that Enzo-N successfully simulates the co-evolution of star clusters and their parent galaxies, capturing phenomena such as core collapse of the star cluster and tidal stripping due to galactic tides. This comprehensive framework opens up new possibilities for studying the evolution of star clusters within galaxies, offering insights that were previously inaccessible.\n\n", "2408.03036": "2024-08-06, **Modeling and measuring the anisotropic halo 3-point correlation function: a coordinated study**, Antonio Farina et.al., [2408.03036v1](http://arxiv.org/abs/2408.03036v1)\n\n Ongoing spectroscopic galaxy surveys like DESI (arXiv:1611.00037, arXiv:1611.00036) and Euclid (arXiv:2405.13491) will cover unprecedented volumes with a number of objects large enough to effectively probe clustering anisotropies through higher-order statistics. In this work, we present an original and efficient implementation of both a model for the multipole moments of the anisotropic 3-point correlation function (3PCF) and for their estimator. To assess the adequacy of our model, we have predicted the anisotropic 3PCF for a set of dark matter halos at redshift $z = 1$ and compared our prediction with the 3PCF measurement obtained by applying our estimator to a suite of 298 N-body + 3000 approximate mock halo catalogs at the same redshift. The use of the anisotropic component of the 3PCF effectively breaks the degeneracy between the growth rate $f$ and the linear bias $b\\_1$, allowing us to obtain unbiased estimates for both parameters from a Euclid-like survey. A joint, full anisotropic, 2 and 3-point correlation analysis would also allow us to measure the clustering amplitude $\\sigma\\_8$ along with $f$ and $b\\_1$ with a precision of approximately 17%, and to effectively constrain all galaxy biasing parameters of the model. However, these results largely exploit information from the isotropic part of the 3PCF signal. The addition of the anisotropic multipoles tightens parameter estimates by just 5% at most. We argue that this modest improvement likely reflects the use of a simplified cosmological model with relatively few free parameters. The 3PCF anisotropic multipoles will prove useful in reducing the impact of projection effects that affect high-dimensional cosmological analyses. To support this conjecture, we provide an example in which an additional source of anisotropy, the Alcock-Paczynski effect, is added to the system.\n\n", "2408.03004": "2024-08-06, **Reconciling Cosmological Tensions with Inelastic Dark Matter and Dark Radiation in a $\\boldsymbol{U(1)_D}$ Framework**, Wonsub Cho et.al., [2408.03004v1](http://arxiv.org/abs/2408.03004v1)\n\n We propose a novel and comprehensive particle physics framework that addresses multiple cosmological tensions observed in recent measurements of the Hubble parameter, $S\\_8$, and Lyman-$\\alpha$ forest data. Our model, termed `{\\bf SIDR+$\\boldsymbol{z\\_t}$}' (Self Interacting Dark Radiation with transition redshift), is based on an inelastic dark matter (IDM) scenario coupled with dark radiation, governed by a $U(1)\\_D$ gauge symmetry. This framework naturally incorporates cold dark matter (DM), SIDR, and the interactions between these components. The fluid-like behavior of the dark radiation component, effectively mitigates both the Hubble and $S\\_8$ tensions by suppressing free-streaming effects. Simultaneously, the interacting DM-DR system attenuates the matter power spectrum at small scales, potentially reconciling discrepancies in Lyman-$\\alpha$ (Ly-$\\alpha$) observations. The inelastic nature of DM provides a distinct temperature dependence for the DM-DR interaction rate determined by the mass-splitting between the inelastic dark fermions which is crucial for resolving the Ly-$\\alpha$ discrepancies. We present a cosmologically consistent analysis of the model by solving the relevant Boltzmann equations to obtain the energy density and number density evolution of different species of the model. The DR undergoes two ``steps\" of increased energy density when the heavier dark species freeze out and become non-relativistic, transferring their entropy to the dark radiation and enhancing $\\Delta N{\\rm eff}$. The analysis showcases the model's potential to uphold the Big Bang Nucleosynthesis (BBN) prediction of $\\Delta N\\_{\\rm eff}$ but dominantly producing additional contributions prior to recombination, while simultaneously achieving correct relic density of DM though an hybrid of freeze-in and non-thermal production.\n\n", "2408.02725": "2024-08-05, **Peculiar dark matter halos inferred from gravitational lensing as a manifestation of modified gravity**, Michal Bílek et.al., [2408.02725v1](http://arxiv.org/abs/2408.02725v1)\n\n If modified gravity holds, but the weak lensing analysis is done in the standard way, one finds that dark matter halos have peculiar shapes, not following the standard Navarro-Frenk-White profiles, and are fully predictable from the distribution of baryons. Here we study in detail the distribution of the apparent dark matter around point masses, which approximate galaxies and galaxy clusters, and their pairs for the QUMOND MOND gravity, taking an external gravitational acceleration $g\\_e$ into account. At large radii, the apparent halo of a point mass $M$ is shifted against the direction of the external field. When averaged over all lines-of-sight, the halo has a hollow center, and denoting the by $a\\_0$ the MOND acceleration constant, its density behaves like $\\rho(r)=\\sqrt{Ma\\_0/G}/(4\\pi r^2)$ between the galacticentric radii $\\sqrt{GM/a\\_0}$ and $\\sqrt{GMa\\_0}/g\\_e$, and like $\\rho\\propto r^{-7}G^2M^3a\\_0^3/g\\_e^5$ further away. Between a pair of point masses, there is a region of a negative apparent dark matter density, whose mass can exceed the baryonic mass of the system. The density of the combined dark matter halo is not a sum of the densities of the halos of the individual points. The density has a singularity near the zero-acceleration point, but remains finite in projection. We compute maps of the surface density and the lensing shear for several configurations of the problem, and derive formulas to scale them to further configurations. In general, for a large subset of MOND theories in their weak field regime, for any configuration of the baryonic mass $M$ with the characteristic size of $d$, the total lensing density scales as $\\rho({\\vec{x}})=\\sqrt{Ma\\_0/G}d^{-2}f\\left(\\vec{\\alpha},\\vec{x}/d,g\\_ed/\\sqrt{GMa\\_0}\\right)$, where the vector $\\vec{\\alpha}$ describes the geometry of the system. Distinguishing between QUMOND and cold dark matter seems possible with the existing instruments.\n\n", "2408.02728": "2024-08-05, **$U(1)$-charged Dark Matter in three-Higgs-doublet models**, A. Kunčinas et.al., [2408.02728v1](http://arxiv.org/abs/2408.02728v1)\n\n We explore three-Higgs-doublet models that may accommodate scalar Dark Matter where the stability is based on an unbroken $U(1)$-based symmetry, rather than the familiar $\\mathbb{Z}\\_2$ symmetry. Our aim is to classify all possible ways of embedding a $U(1)$ symmetry in a three-Higgs-doublet model. The different possibilities are presented and compared. All these models contain mass-degenerate pairs of Dark Matter candidates due to a $U(1)$ symmetry unbroken (conserved) by the vacuum. Most of these models preserve CP. In the CP-conserving case the pairs can be seen as one being even and the other being odd under CP or as having opposite charges under $U(1)$. Not all symmetries presented here were identified before in the literature, which points to the fact that there are still many open questions in three-Higgs-doublet models. We also perform a numerical exploration of the $U(1) \\otimes U(1)$-symmetric 3HDM, this is the most general phase-invariant (real) three-Higgs-doublet model. The model contains a multi-component Dark Matter sector, with two independent mass scales. After imposing relevant experimental constraints we find that there are possible solutions throughout a broad Dark Matter mass range, 45-2000 GeV, the latter being a scan cutoff.\n\n", "2408.02721": "2024-08-05, **Attenuation of Cosmic Ray Electron Boosted Dark Matter**, Tim Herbermann et.al., [2408.02721v1](http://arxiv.org/abs/2408.02721v1)\n\n We consider a model of boosted dark matter (DM), where a fraction of DM is upscattered to relativistic energies by cosmic ray electrons. Such interactions responsible for boosting the DM also attenuate its flux at the Earth. Considering a simple model of constant interaction cross-section, we make analytical estimates of the variation of the attenuation ceiling with the DM mass and confirm it numerically. We then extend our analysis to a $Z'$-mediated leptophilic DM model. We show that the attenuation ceiling remains nearly model-independent for DM and mediator particles heavier than the electron, challenging some previous discussions on this topic. Using the XENONnT direct detection experiment, we illustrate how constraints based on energy-dependent scattering can significantly differ from those based on an assumed constant cross-section. This highlights the importance of re-evaluating these constraints in the context of specific models.\n\n", "2408.02668": "2024-08-05, **Searching for dark matter with a 1000 km baseline interferometer**, Daniel Gavilan-Martin et.al., [2408.02668v1](http://arxiv.org/abs/2408.02668v1)\n\n Axion-like particles (ALPs) arise from well-motivated extensions to the Standard Model and could account for dark matter. ALP dark matter would manifest as a nearly monochromatic field oscillating at an (as of yet) unknown frequency. The frequency depends on the ALP mass, which could plausibly range from $10^{-22}$ eV/$c^2$ to $10$ eV/$c^2$. We report on a direct search for ALP dark matter through the ALP-nucleon interaction by interfering the signals of two atomic K-Rb-$^3$He comagnetometers, with one situated in Mainz, Germany, and the other in Krak\\'ow, Poland. We use the ALP dark matter's spatiotemporal coherence properties assuming the standard halo model of dark matter in the Milky Way to improve the sensitivity and exclude spurious candidates. The search extends over nine orders of magnitude in ALP mass. In this range, no significant evidence of an ALP signal is found. We thus place new upper limits on the ALP-neutron and ALP-proton couplings of $g\\_{aNN}<10^{-5}$ GeV$^{-1}$ and $g\\_{aPP}<5 \\times 10^{-4}$ GeV$^{-1}$ at a mass of $10^{-22}$ eV/$c^2$ and extending to a mass of $10^{-15}$ eV/$c^2$ where the upper limits reach below $g\\_{aNN}<10^{-9}$ GeV$^{-1}$ and $g\\_{aPP}<10^{-7}$ GeV$^{-1}$, respectively. For both neutron and proton couplings, this work is an improvement of up to four orders of magnitude compared to previous laboratory constraints.\n\n", "2408.02538": "2024-08-05, **$G_{3}$ -- interacting scalar tensor dark energy**, Masroor C. Pookkillath et.al., [2408.02538v1](http://arxiv.org/abs/2408.02538v1)\n\n We study the effect of adding an interaction in the $G\\_3$ term of Horndeski theory, where the propagation of gravitational waves are not modified. We derive the background and perturbation equations of motion from the action. We also derive the no-ghost and Laplacian instability conditions for tensor modes and scalar mode propagation. Then we study the evolution of the matter perturbation in the quasi-static approximation. We find that the gravitational couplings to the baryonic and cold dark matter over density are modified in this theory. We introduce a concrete model of the free function in the theory and study the background and linear perturbation dynamics. We then use the genetic algorithm to test the model. We compare the $H(z)$ function of the model and the $H(z)$ curve predicted by the genetic algorithm, using the $H(z)$ data. For the perturbation sector we compute the $f\\sigma\\_{8}$ observable for the model and compare it with the predicted function from the genetic algorithm from the $f\\sigma\\_{8}$ data.\n\n", "2408.02368": "2024-08-05, **First search for dark photon dark matter with a MADMAX prototype**, J. Egge et.al., [2408.02368v1](http://arxiv.org/abs/2408.02368v1)\n\n We report the first result from a dark photon dark matter search in the mass range from ${78.62}$ to $83.95~\\mathrm{\\mu eV}/c^2$ with a dielectric haloscope prototype for MADMAX (Magnetized Disc and Mirror Axion eXperiment). Putative dark photons would convert to observable photons within a stack consisting of three sapphire disks and a mirror. The emitted power of this system is received by an antenna and successively digitized using a low-noise receiver. No dark photon signal has been observed. Assuming unpolarized dark photon dark matter with a local density of $\\rho\\_{\\chi}=0.3~\\mathrm{GeV/cm^3}$ we exclude a dark photon to photon mixing parameter $\\chi > 3.0 \\times 10^{-12}$ over the full mass range and $\\chi > 1.2 \\times 10^{-13}$ at a mass of $80.57~\\mathrm{\\mu eV}/c^2$ with a 95\\% confidence level. This is the first physics result from a MADMAX prototype and exceeds previous constraints on $\\chi$ in this mass range by up to almost three orders of magnitude.\n\n"}, "supernova": {"2408.03321": "2024-08-06, **Chasing cosmic inflation: constraints for inflationary models and reheating insights**, Mario Ballardini et.al., [2408.03321v1](http://arxiv.org/abs/2408.03321v1)\n\n We investigate the impact of different choice of prior's range for the reheating epoch on cosmic inflation parameter inference in light of cosmic microwave background (CMB) anisotropy measurements from the Planck 2018 legacy release in combination with BICEP/Keck Array 2018 data and additional late-time cosmological observations such as uncalibrated Type Ia Supernovae from the Pantheon catalogue, baryon acoustic oscillations and redshift space distortions from SDSS/BOSS/eBOSS. Here, we explore in particular the implications for the combination of reheating and inflationary-model parameter space considering $R+R^2$ inflation and a broad class of $\\alpha$-attractor and D-brane models. These inflationary models completely cover the $n\\_s$-$r$ parameter space allowed by Planck and BICEP/Keck data and represent good targets for future CMB and large-scale structure experiments. We perform a Bayesian model comparison of inflationary models, taking into account the reheating uncertainties.\n\n", "2408.03229": "2024-08-06, **Quintessential early dark energy**, Sk. Sohail et.al., [2408.03229v1](http://arxiv.org/abs/2408.03229v1)\n\n In this paper, we introduce a unified model of early and late dark energy. We call it {\\it quintessential early dark energy} model in which early and late dark energy are explained by a single scalar field. In other words two different energy scales are related by a single scalar field potential. To achieve this we introduce the modified steep exponential potential. This potential has a hilltop nature during the early time which consists of a flat region followed by a steep region. This nature of the potential plays a crucial role in achieving early dark energy solution. During recent time, the potential can almost mimic the cosmological constant which can result into late time acceleration. We also constrain and compare the models for steep exponential, modified steep exponential, axionlike and power law potentials by using the available background cosmological data from CMB, BAO (including DESI DR1 2024), supernovae (Pantheon$+$, DESY5 and Union3) and Hubble parameter measurements. The maximum improvement we get in the present value of Hubble parameter compared to the standard $\\Lambda$CDM model is for the axionlike potential. For other potentials the constraints are similar to the $\\Lambda$CDM model.\n\n", "2408.03048": "2024-08-06, **Exploring the range of impacts of helium in the spectra of double detonation models for Type Ia supernovae**, F. P. Callan et.al., [2408.03048v1](http://arxiv.org/abs/2408.03048v1)\n\n In the double detonation scenario the ignition of a surface He detonation on a sub-Chandrasekhar mass white dwarf leads to a secondary core detonation. Double detonation models have shown promise for explaining Type Ia supernovae (SNe Ia) with a variety of luminosities. A key feature of such models is unburnt He in the ejecta, which can show significant variation in both its mass and velocity distribution. Many previous radiative transfer simulations for double detonation models have neglected treatment of non-thermal ionization and excitation, preventing them from robustly assessing whether He spectral features are expected to form. We present a non local thermodynamic equilibrium radiative transfer simulation, including treatment for non-thermal electrons, for a double detonation model with a modest mass of He (${\\sim}$0.04 M${\\odot}$) ejected at reasonably low velocities (${\\sim}$12000$\\,\\mathrm{km}\\,\\mathrm{s}^{-1}$). Despite our simulation predicting no clear optical He features, a strong and persistent He I 10830$\\,\\r{A}$ absorption feature forms that is significantly blended with the spectral contribution of Mg II 10927$\\,\\r{A}$. For some normal SNe Ia the Mg feature shows an extended blue wing, previously attributed to C I, however the simulated He feature shows its strongest absorption at wavelengths consistent with this wing. We therefore suggest this extended wing is instead a spectral signature of He. The He feature predicted by this particular model is too strong and persistent to be consistent with normal SNe Ia, however, this motivates further work to use this observable signature to test the parameter space for double detonation models.\n\n", "2408.03042": "2024-08-06, **A unified transition mechanism from shock to detonation waves**, Hao Yan et.al., [2408.03042v1](http://arxiv.org/abs/2408.03042v1)\n\n The transition of shock-to-detonation is of great significance for the investigation of supernova formation, disaster prevention and supersonic propulsion technology. In this paper, the influence Equation of shock-to-detonation transition is summarized for the oblique detonation problem from aerodynamic analysis. The Equation integrates the effects of parameters such as chemical reaction, shock intensity and wall conditions, which quantitatively explains the physical mechanism of shock-to-detonation transition in the form of mathematical expression. Comparison with numerical simulation results as well as their gradients verified the reliability of the influence Equation. Further, the influence Equation can also be used to predict the critical conditions for the transition from shock to detonation transition form. In addition to oblique detonation, the influence Equation is compatible with the deflagration-to-detonation problem for normal detonation, which shows a wide applicability.\n\n", "2408.03038": "2024-08-06, **A new code for low-resolution spectral identification of white dwarf binary candidates**, Genghao Liu et.al., [2408.03038v1](http://arxiv.org/abs/2408.03038v1)\n\n Close white dwarf binaries (CWDBs) are considered to be progenitors of several exotic astronomical phenomena (e.g., type Ia supernovae, cataclysmic variables). These violent events are broadly used in studies of general relativity and cosmology. However, obtaining precise stellar parameter measurements for both components of CWDBs is a challenging task given their low luminosities, swift time variation, and complex orbits. High-resolution spectra (R$> 20 000$) are preferred but expensive, resulting in a sample size that is insufficient for robust population study. To release the full potential of the less expensive low-resolution spectroscopic surveys, and thus greatly expand the CWDB sample size, it is necessary to develop a robust pipeline for spectra decomposition and analysis. We used an artificial neural network (ANN) to build spectrum generators for DA/DB white dwarfs and main-sequence stars. The best-fit stellar parameters were obtained by finding the least $\\chi^2$ solution to these feature lines and the continuum simultaneously. We demonstrate the reliability of our code with two well-studied CWDBs, WD 1534+503 and PG 1224+309. We also estimate the stellar parameters of 14 newly identified CWDB candidates, most of which are fitted with double component models for the first time. Our estimates agree with previous results for the common stars and follow the statistical distribution in the literature. The application of our code to a large volume of white dwarf binary candidates will offer important statistic samples to stellar evolution studies and future gravitational wave monitoring.\n\n", "2408.02781": "2024-08-05, **Early Enrichment Population Theory at High Redshift**, Anne E. Blackwell et.al., [2408.02781v1](http://arxiv.org/abs/2408.02781v1)\n\n An Early Enrichment Population (EEP) has been theorized to produce the observed metallicity in the intracluster medium (ICM) of galaxy clusters. This population likely existed at high redshifts (z$\\sim$10), relics of which we posit exist today as dwarf galaxies. Previous work argues that the initial mass function (IMF) of the EEP must be flatter than those found at lower redshifts, but with considerable uncertainties. In this work, we present a more quantitative model for the EEP and demonstrate how observational constraints can be applied to the IMF using supernova Type Ia (SNIa) rates, delay time distribution (DTD), and the luminosity function (LF) of galaxy clusters. We determine best-fit values for the slope and mass break of the IMF by comparing IMFs from literature with observed DTDs and the low-luminosity component ($M(R)< -12$) of the Coma LF. We derive two best-fit IMFs: (1) $\\alpha\\_{lo} = -0.13 \\pm 0.24$ for $0.07 < M/M\\_\\odot < 1.75$ and $\\alpha\\_{hi} = 0.53 \\pm 0.01$ for $1.75 < M/M\\_\\odot < 150$, and (2) $\\alpha\\_{lo} = 1.06 \\pm 0.11$ for $0.07 < M/M\\_\\odot < 6$ and $\\alpha\\_{hi} = 0.53 \\pm 0.01$ for $6 < M/M\\_\\odot < 150$. We also compare these with sl-5 from Loewenstein (2013) with $\\alpha=0.5$ for $0.07 < M/M\\_\\odot < 8$ and $\\alpha=0.3$ for $8 < M/M\\_\\odot < 150$. This EEP model, along with stars formed at later times, can produce the observed metallicity, is consistent with other observations, and predicts a significant rise in the SNIa rate at increasing redshift.\n\n", "2408.02775": "2024-08-05, **Constraining viscous-fluid models in $f(Q)$ gravity using cosmic measurements and large-scale structure data**, Shambel Sahlu et.al., [2408.02775v1](http://arxiv.org/abs/2408.02775v1)\n\n This paper investigates the impact of the effects of bulk viscosity on the accelerating expansion and large-scale structure formation of a universe in which the underlying gravitational interaction is described by $f(Q)$ gravity. Various toy models of the $f(Q)$ gravity theory, including power-law ($f\\_{1\\rm{CDM}}$), exponential ($f\\_{2\\rm{CDM}}$), and logarithmic ($f\\_{3\\rm{CDM}}$) are considered. To test the cosmological viability of these models, we use 57 Hubble parameter data points (OHD), 1048 supernovae distance modulus (SNIa), their combined analysis (OHD+SNIa), 14 growth rate ($f$-data), and 30 redshift-space distortions ($f\\sigma\\_8$) datasets. We compute the best-fit values $\\Omega\\_m, H\\_0$ and exponents $\\{n, p, \\gamma\\}$ including the bulk viscosity coefficient $\\zeta\\_0$, through a detailed statistical analysis. Moreover, we study linear cosmological perturbations and compute the density contrast \\(\\delta(z)\\), growth factor $D(z)$, growth rate $(f(z)$, and redshift-space distortion $f\\sigma\\_8(z)$. Based on the Akaike Information Criterion (AIC) and Bayesian / Schwartz Information Criterion (BIC), a statistical comparison of the $f(Q)$ gravity models with \\lcdm is made. From our statistical analysis of cosmic measurements, we found an underestimation of all models on the OHD data; therefore, statistical viability led us to weigh it in favour of SNIa data which resulted in the exponential ($f\\_{2\\rm{CDM}}$) model without bulk viscosity being the most plausible alternative model, while on average the $f\\_{1\\rm{CDM}}$ model performed statistically the weakest. We also found that adding bulk viscosity did not improve the fit of the models to all observational data.\n\n", "2408.02756": "2024-08-05, **CHARA Near-Infrared Imaging of the Yellow Hypergiant Star $ρ$~Cassiopeiae: Convection Cells and Circumstellar Envelope**, Narsireddy Anugu et.al., [2408.02756v1](http://arxiv.org/abs/2408.02756v1)\n\n Massive evolved stars such as red supergiants and hypergiants are potential progenitors of Type II supernovae, and they are known for ejecting substantial amounts of matter, up to half their initial mass, during their final evolutionary phases. The rate and mechanism of this mass loss play a crucial role in determining their ultimate fate and the likelihood of their progression to supernovae. However, the exact mechanisms driving this mass ejection have long been a subject of research. Recent observations, such as the Great Dimming of Betelgeuse, have suggested that the activity of large convective cells, combined with pulsation, could be a plausible explanation for such mass loss events. In this context, we conducted interferometric observations of the famous yellow hypergiant, $\\rho$~Cassiopeiae using the CHARA Array in H and K-band wavelengths. $\\rho$~Cas is well known for its recurrent eruptions, characterized by periods of visual dimming ($\\sim$~1.5-2 mag) followed by recovery. From our observations, we derived the diameter of the limb-darkened disk and found that this star has a radius of $1.04\\pm0.01$ milliarcseconds (mas), or $564 - 700~R\\_\\odot$. We performed image reconstructions with three different image reconstruction software packages, and they unveiled the presence of giant hot and cold spots on the stellar surface. We interpret these prominent hot spots as giant convection cells, suggesting a possible connection to mass ejections from the star's envelope. Furthermore, we detected spectral CO emission lines in the K-band ($\\lambda=2.31-2.38 ~\\mu$m), and the image reconstructions in these spectral lines revealed an extended circumstellar envelope with a radius of $1.45\\pm0.10$ mas.\n\n", "2408.02670": "2024-08-05, **A Targeted Search for Variable Gravitationally Lensed Quasars**, William Sheu et.al., [2408.02670v1](http://arxiv.org/abs/2408.02670v1)\n\n We present a pipeline to identify photometric variability within strong gravitationally lensing candidates, in the DESI Legacy Imaging Surveys. In our first paper (Sheu et al. 2023), we laid out our pipeline and presented seven new gravitationally lensed supernovae candidates in a retrospective search. In this companion paper, we apply a modified version of that pipeline to search for gravitationally lensed quasars. From a sample of 5807 strong lenses, we have identified 13 new gravitationally lensed quasar candidates (three of them quadruply-lensed). We note that our methodology differs from most lensed quasar search algorithms that solely rely on the morphology, location, and color of the candidate systems. By also taking into account the temporal photometric variability of the posited lensed images in our search via difference imaging, we have discovered new lensed quasar candidates. While variability searches using difference imaging algorithms have been done in the past, they are typically preformed over vast swathes of sky, whereas we specifically target strong gravitationally lensed candidates. We also have applied our pipeline to 655 known gravitationally lensed quasar candidates from past lensed quasar searches, of which we identify 13 that display significant variability (one of them quadruply-lensed). This pipeline demonstrates a promising search strategy to discover gravitationally lensed quasars in other existing and upcoming surveys.\n\n", "2408.02643": "2024-08-05, **Origin of LAMOST J1010+2358 Revisited**, S. K. Jeena et.al., [2408.02643v1](http://arxiv.org/abs/2408.02643v1)\n\n Signature from Pop III massive stars of $140$--$260\\,{\\rm M\\_\\odot}$ that end their lives as pair-instability supernovae (PISNe) are expected to be seen in very metal-poor (VMP) stars of ${\\rm [Fe/H]}\\leq -2$. Although thousands of VMP stars have been discovered, the identification of a VMP star with a PISN signature has been elusive. Recently, the VMP star LAMOST J1010+2358 was claimed to be the first star with a clear PISN signature. A subsequent study showed that ejecta from low-mass core-collapse supernovae (CCSNe) can also fit the abundance pattern equally well and additional elements such as C and Al are required to differentiate the two sources. Follow-up observations of LAMOST J1010+2358 by two independent groups were able to detect both C and Al. Additionally, key odd elements such as Na and Sc were also detected whose abundances were found to be higher than the upper limits found in the original detection. We perform a detailed analysis of the newly observed abundance patterns by exploring various possible formation channels for VMP stars. We find that purely low-mass CCSN ejecta as well as the combination of CCSN and Type 1a SN ejecta can provide an excellent fit to the newly observed abundance pattern. Our results confirm earlier analysis that the newly observed abundance pattern is peculiar but has no signatures of PISN.\n\n", "2408.02583": "2024-08-05, **Generating variable $\\hbar$ and $c$ via Fujii-Wetterich model in curved spacetimes**, Hoang Ky Nguyen et.al., [2408.02583v1](http://arxiv.org/abs/2408.02583v1)\n\n We revisit the Fujii-Wetterich model [Phys.Rev.D 26, 2580 (1982) and Nucl.Phys.B 302, 645 (1988)] which allows the Higgs doublet to couple with a \"cosmon\" scalar $\\chi$ of the background spacetime as $\\chi^2\\,\\Phi^2$. Upon the SSB of the $SU(2)$ gauge, the VEV of the Higgs doublet is proportional to the field $\\chi$. Fujii and Wetterich employed this linkage to make particle masses dependent on $\\chi$. We shall present an $\\textit alternative$ mechanism: at a given point $x^*$, the prevailing Higgs VEV will be used to $\\textit construct$ a quantum of action $\\hbar\\_*$ and a speed of light $c\\_*$ in association with $\\chi(x^*)$. Specifically, each open set vicinity of a given point $x^*$ on the manifold is equipped with a replica of the Glashow-Weinberg-Salam action operating with its own effective values of $\\hbar\\_*$ and $c\\_*$, whereas particle masses induced via Higgs SSB remain independent of $\\chi(x^*)$. Our mechanism unambiguously generates the dependencies $\\hbar\\_*\\propto\\chi^{-1/2}(x^*)$ and $c\\_*\\propto\\chi^{1/2}(x^*)$, causing these \"fundamental constants\" to vary along with the dynamical field $\\chi$ across the manifold. For late-time cosmology, a varying $c$ along the trajectory of light waves from distant supernovae towards Earth renders the classic Lema\\^itre redshift formula $1+z=a^{-1}$ inapplicable. Using the dependency $c\\_*\\propto\\chi^{1/2}(x^*)$, we derive the new (variable-$c$) Lema\\^itre redshift relation and apply it to analyze the Pantheon Catalog of SneIa $\\textit without$ invoking the dark energy hypothesis. Key consequences are: (1) Accounting for the Pantheon Catalog with a fit exceeding the quality of the $\\Lambda$CDM model; (2) Explaining the late-time cosmic acceleration based on variable $c$, eliminating the need for dark energy; (3) Revitalizing Blanchard-Douspis-Rowan-Robinson-Sarkar's CMB power spectrum analysis that bypassed dark energy [A&A 412, 35 (2003)].\n\n", "2408.02365": "2024-08-05, **Non-parametric late-time expansion history reconstruction and implications for the Hubble tension in light of DESI**, Jun-Qian Jiang et.al., [2408.02365v1](http://arxiv.org/abs/2408.02365v1)\n\n We non-parametrically reconstruct the late-time expansion history in light of the latest Baryon Acoustic Oscillation (BAO) measurements from DESI combined with various Type Ia Supernovae (SNeIa) catalogs, using interpolation through piece-wise natural cubic splines, and a reconstruction procedure based on Gaussian Processes (GPs). Applied to DESI BAO and PantheonPlus SNeIa data, both methods indicate that deviations from a reference $\\Lambda$CDM model in the $z \\lesssim 2$ unnormalized expansion rate $E(z)$ are constrained to be $\\lesssim 10\\%$, but also consistently identify two features in $E(z)$: a bump at $z \\sim 0.5$, and a depression at $z \\sim 0.9$, which cannot be simultaneously captured by a $w\\_0w\\_a$CDM fit. These features, which are stable against assumptions regarding spatial curvature, interpolation knots, and GP kernel, disappear if one adopts the older SDSS BAO measurements in place of DESI, and decrease in significance when replacing the PantheonPlus catalog with the Union3 and DESY5 ones. We infer $c/(r\\_dH\\_0)=29.90 \\pm 0.33$ (with $r\\_d$ the sound horizon at baryon drag), which slightly reduces the Hubble tension and makes room for a more important role of late-time new physics in this context, albeit still remaining a sub-dominant part of the solution. If substantiated in forthcoming data releases, our results tentatively point to oscillatory/non-monotonic features in the shape of the expansion rate at $z \\lesssim 2$, of potential interest for dark energy model-building.\n\n", "2408.02267": "2024-08-05, **Accurate Simultaneous Constraints on the Dust Mass, Temperature and Emissivity Index of a Galaxy at Redshift 7.31**, Hiddo Algera et.al., [2408.02267v1](http://arxiv.org/abs/2408.02267v1)\n\n We present new multi-frequency ALMA continuum observations of the massive [$\\log\\_{10}(M\\_\\star/M\\_\\odot) = 10.3\\_{-0.2}^{+0.1}$], UV-luminous [$M\\_\\mathrm{UV} = -21.7 \\pm 0.2$] $z=7.31$ galaxy REBELS-25 in Bands 3, 4, 5, and 9. Combining the new observations with previously-taken data in Bands 6 and 8, we cover the dust continuum emission of the galaxy in six distinct bands -- spanning rest-frame $50-350\\,\\mu$m -- enabling simultaneous constraints on its dust mass ($M\\_\\mathrm{dust}$), temperature ($T\\_\\mathrm{dust}$) and emissivity index ($\\beta\\_\\mathrm{IR}$) via modified blackbody fitting. Given a fiducial model of optically thin emission, we infer a cold dust temperature of $T\\_\\mathrm{dust} = 32\\_{-6}^{+9}\\,$K and a high dust mass of $\\log\\_{10}(M\\_\\mathrm{dust}/M\\_\\odot) = 8.2\\_{-0.4}^{+0.6}$, and moderately optically thick dust does not significantly alter these estimates. If we assume dust production is solely through supernovae (SNe), the inferred dust yield would be high, $y = 0.7\\_{-0.4}^{+2.3}\\,M\\_\\odot$ per SN. Consequently, we argue grain growth in the interstellar medium of REBELS-25 also contributes to its dust build-up. This is supported by the steep dust emissivity index $\\beta\\_\\mathrm{IR} = 2.5 \\pm 0.4$ we measure for REBELS-25, as well as by its high stellar mass, dense interstellar medium, and metal-rich nature. Our results suggest that constraining the dust emissivity indices of high-redshift galaxies is important not only to mitigate systematic uncertainties in their dust masses and obscured star formation rates, but also to assess if dust properties evolve across cosmic time. We present an efficient observing setup to do so with ALMA, combining observations of the peak and Rayleigh-Jeans tail of the dust emission.\n\n", "2408.02228": "2024-08-05, **Strong Chemical Tagging in FIRE: Intra and Inter-Cluster Chemical Homogeneity in Open Clusters in Milky Way-like Galaxy Simulations**, Binod Bhattarai et.al., [2408.02228v1](http://arxiv.org/abs/2408.02228v1)\n\n Open star clusters are the essential building blocks of the Galactic disk; \"strong chemical tagging\" - the premise that all star clusters can be reconstructed given chemistry information alone - is a driving force behind many current and upcoming large Galactic spectroscopic surveys. In this work, we characterize abundance patterns for 9 elements (C, N, O, Ne, Mg, Si, S, Ca, and Fe) in open clusters (OCs) in three galaxies (m12i, m12f, and m12m) from the Latte suite of FIRE-2 simulations to investigate if strong chemical tagging is possible in these simulations. We select young massive (>=10^(4.6) Msun) OCs formed in the last ~100 Myr and calculate the intra- and inter-cluster abundance scatter for these clusters. We compare these results with analogous calculations drawn from observations of OCs in the Milky Way. We find the intra-cluster scatter of the observations and simulations to be comparable. While the abundance scatter within each cluster is minimal (<0.020 dex), the mean abundance patterns of different clusters are not unique. We also calculate the chemical difference in intra- and inter-cluster star pairs and find it, in general, to be so small that it is difficult to distinguish between stars drawn from the same OC or from different OCs. Despite tracing three distinct nucleosynthetic families (core-collapse supernovae, white dwarf supernovae, and stellar winds), we conclude that these elemental abundances do not provide enough discriminating information to use strong chemical tagging for reliable OC membership.\n\n"}}