{"neutrino": {"2309.15797": "2023-09-27, **Dynamic fermion flavor mixing through transition dipole moments**, Johann Rafelski et.al., [2309.15797v1](http://arxiv.org/abs/2309.15797v1)\n\n We show that Majorana neutrino flavor mixing can be driven by transition dipole moments in the presence of external electromagnetic fields. We demonstrate the sensitivity of the rotation mixing matrix to strong fields obtaining dynamical mass eigenstates in the two-flavor model. The three-flavor case and extensions to the quark sector are introduced.\n\n", "2309.15469": "2023-09-27, **Joint searches by FACT, H.E.S.S., MAGIC and VERITAS for VHE gamma-ray emission associated with neutrinos detected by IceCube**, Fabian Schüssler et.al., [2309.15469v1](http://arxiv.org/abs/2309.15469v1)\n\n The sources of the astrophysical flux of high-energy neutrinos detected by IceCube are still largely unknown, but searches for temporal and spatial correlation between neutrinos and electromagnetic radiation are a promising approach in this endeavor. All major imaging atmospheric Cherenkov telescopes (IACTs) - FACT, H.E.S.S., MAGIC, and VERITAS - operate an active follow-up program of target-of-opportunity observations of neutrino alerts issued by IceCube. These programs use several complementary neutrino alert streams. A publicly distributed alert stream is formed by individual high-energy neutrino candidate events of potentially astrophysical origin, such as IceCube-170922A (which could be linked to the flaring blazar TXS\\,0506+056). A privately distributed alert stream is formed by clusters of neutrino events in time and space around either pre-selected gamma-ray sources or anywhere in the sky. Here, we present joint searches for multi-wavelength emission associated with a set of IceCube alerts, both private and public, received through mid-January 2021. We will give an overview of the programs of the participating IACTs. We will showcase the various follow-up and data analysis strategies employed in response to the different alert types and various possible counterpart scenarios. Finally, we will present results from a combined analysis of the VHE gamma-ray observations obtained across all involved instruments, as well as relevant multi-wavelength data.\n\n", "2309.15446": "2023-09-27, **Neutrino properties from the laboratory and the cosmos**, Pablo Martínez-Miravé et.al., [2309.15446v1](http://arxiv.org/abs/2309.15446v1)\n\n Neutrinos are amongst the most abundant particles in the universe. The fact that they are massive particles proves that the Standard Model is an incomplete theory and needs to be extended. This thesis focuses on the study of neutrino properties from the available data from laboratory experiments and cosmological observations. It also presents sensitivity studies for future neutrino experiments. The first part covers the status of the determination of the oscillation parameters in the three-neutrino framework, the mass ordering and the absolute mass scale. A second part is devoted to other neutrino properties predicted in neutrino mass models. The topics covered include the study of spin-flavour precession in solar neutrinos from non-zero neutrino magnetic moments, the prospects for neutrino non-standard interactions with quarks from the solar sector and the expected limits on CPT violation from a separate analysis of neutrino and antineutrino data. Regarding cosmology, the impact of non-standard interactions with electrons and a non-unitary three-neutrino mixing matrix in the process of neutrino decoupling are addressed. Finally, a third part explores possible connections between dark matter and neutrinos. The existence of dark matter has been proven indirectly via its gravitational effects. This thesis presents two studies that explore how neutrinos could probe the fraction of dark matter that could exist in the form of primordial black holes and the experimental signatures expected from a hypothetical coupling between neutrinos and an ultralight scalar dark matter candidate.\n\n", "2309.15362": "2023-09-27, **MicroBooNE Public Data Sets: a Collaborative Tool for LArTPC Software Development**, Giuseppe Cerati et.al., [2309.15362v1](http://arxiv.org/abs/2309.15362v1)\n\n Among liquid argon time projection chamber (LArTPC) experiments MicroBooNE is the one that continually took physics data for the longest time (2015-2021), and represents the state of the art for reconstruction and analysis with this detector. Recently published analyses include oscillation physics results, searches for anomalies and other BSM signatures, and cross section measurements. LArTPC detectors are being used in current experiments such as ICARUS and SBND, and being planned for future experiments such as DUNE. MicroBooNE has recently released to the public two of its data sets, with the goal of enabling collaborative software developments with other LArTPC experiments and with AI or computing experts. These data sets simulate neutrino interactions on top of off-beam data, which include cosmic ray background and noise. The data sets are released in two formats: the native art/ROOT format used internally by the collaboration and familiar to other LArTPC experts, and the HDF5 format which contains reduced and simplified content and is suitable for usage by the broader community. This contribution presents the open data sets, discusses their motivation, the technical implementation, and the extensive documentation -- all inspired by FAIR principles. Finally, opportunities for collaborations are discussed.\n\n", "2309.15052": "2023-09-26, **Singlet-doublet Dirac fermion dark matter from Peccei-Quinn symmetry**, Robinson Longas et.al., [2309.15052v1](http://arxiv.org/abs/2309.15052v1)\n\n Weakly Interacting Massive Particles (WIMPs) and axions are arguably the most compelling dark matter (DM) candidates in the literature. Here, we consider a model where the PQ symmetry solves the strong CP problem, generates radiatively Dirac neutrino masses, and gives origin to multicomponent dark sector. Specifically, scotogenic Dirac neutrino masses arise at one-loop level. The lightest fermionic mediator acts as the second DM candidate due to a residual $Z\\_2$ symmetry resulting from the PQ symmetry breaking. The WIMP DM component resembles the well-known singlet-doublet fermion DM. While the lower WIMP dark mass region is usually excluded, our model reopens that portion of the parameter space (for DM masses below $\\lesssim 100$ GeV). Therefore, we perform a phenomenological analysis that addresses the constraints from direct searches of DM, neutrino oscillation data, and charged lepton flavor violating (LFV) processes. The model can be tested in future facilities where DM annihilation into SM particles is searched for by neutrino telescopes.\n\n", "2309.14798": "2023-09-26, **Axion emission from supernovae: a cheatsheet**, Pierluca Carenza et.al., [2309.14798v1](http://arxiv.org/abs/2309.14798v1)\n\n Supernovae provide fascinating opportunities to study various particles and their interactions. Among these there are neutrinos, axions, and other light weakly interacting particles, which play a significant role in our understanding of fundamental physics. In this study, the focus lies on the recent advancements made in characterizing axion emission from nuclear matter within the context of supernovae. The main production mechanisms for axions coupled with nucleons, bremsstrahlung and pion-axion conversion, are extensively discussed. These findings shed light on the behavior of axions in dense and hot nuclear matter, encountered in these extreme astrophysical environments.\n\n", "2309.14794": "2023-09-26, **TELAMON: Effelsberg Monitoring of AGN Jets with Very-High-Energy Astroparticle Emissions -- II. Polarization properties**, J. Heßdörfer et.al., [2309.14794v1](http://arxiv.org/abs/2309.14794v1)\n\n We present recent results of the TELAMON program, which is using the Effelsberg 100-m telescope to monitor the radio spectra of active galactic nuclei (AGN) under scrutiny in astroparticle physics, namely TeV blazars and neutrino-associated AGN. Our sample includes all known Northern TeV-emitting blazars as well as blazars positionally coincident with IceCube neutrino alerts. Polarization can give additional insight into the source properties, as the polarized emission is often found to vary on different timescales and amplitudes than the total intensity emission. Here, we present an overview of the polarization properties of the TeV-emitting TELAMON sources at four frequencies in the 20 mm and 7 mm bands. While at 7 mm roughly $82\\,\\%$ of all observed sources are found to be significantly polarized, for 20 mm the percentage is $\\sim58\\,\\%$. We find that most of the sources exhibit mean fractional polarizations of $<5\\%$, matching the expectations of rather low polarization levels in these sources from previous studies at lower radio frequencies. Nevertheless, we demonstrate examples of how the polarized emission can provide additional information over the total intensity.\n\n", "2309.14769": "2023-09-26, **Unveiling Neutrino Mysteries with $Δ(27)$ Symmetry**, Manash Dey et.al., [2309.14769v1](http://arxiv.org/abs/2309.14769v1)\n\n In the realm of neutrino physics, we grapple with mysteries like the origin of neutrino masses, the absence of a clear mass hierarchy, and the values of Majorana phases. To address these puzzles, we extend the Standard Model using $\\Delta(27)$ symmetry within the Hybrid seesaw framework. We also introduce an additional $Z\\_{10}$ symmetry to constrain some undesirable terms in the Yukawa Lagrangian, resulting in a unique neutrino mass matrix texture with partial $\\mu-\\tau$ symmetry. In our study, we propose a novel lepton mixing matrix that, when connected to this texture, provides valuable phenomenological insights.\n\n", "2309.14702": "2023-09-26, **One-loop Matching of the Type-III Seesaw Model onto the Standard Model Effective Field Theory**, Xu Li et.al., [2309.14702v1](http://arxiv.org/abs/2309.14702v1)\n\n In previous works arXiv:2107.12133 and arXiv:2201.05082, we have performed the one-loop matching of both type-I and type-II seesaw models for neutrino masses onto the Standard Model Effective Field Theories (SMEFT). In the present paper, by matching the type-III seesaw model onto the SMEFT at the one-loop level, we complete this series of studies on the construction of low-energy effective field theories (EFTs) for the canonical seesaw models. After integrating out the heavy fermionic triplets in the type-III seesaw model via both functional and diagrammatic approaches, we find 33 dimension-six (dim-6) operators in the Warsaw basis and their Wilson coefficients, while the number of dim-6 operators is 31 (or 41) for the EFT of type-I (or type-II) seesaw model. Furthermore, we calculate the branching ratios of radiative decays of charged leptons in the EFT. Then, the relationship between the beta function of the quartic Higgs coupling $\\lambda$ in the full theory and that of $\\lambda^{}\\_{\\rm EFT}$ in the EFT is clarified. Finally, we briefly discuss the phenomenological implications of three types of seesaw EFTs and propose working observables that are sensitive to the four-fermion operators, which could be used to distinguish among different seesaw models in collider experiments.\n\n"}, "dark matter": {"2309.15808": "2023-09-27, **Enabling multi-messenger astronomy with continuous gravitational waves: early warning and sky localization of binary neutron stars in Einstein Telescope**, Andrew L. Miller et.al., [2309.15808v1](http://arxiv.org/abs/2309.15808v1)\n\n Next-generation gravitational-wave detectors will provide unprecedented sensitivity to inspiraling binary neutron stars and black holes, enabling detections at the peak of star formation and beyond. However, the signals from these systems will last much longer than those in current detectors, and overlap in both time and frequency, leading to increased computational cost to search for them with standard matched filtering analyses, and a higher probability that they are observed in the presence of non-Gaussian noise. We therefore present a method to search for gravitational waves from compact binary inspirals in next-generation detectors that is computationally efficient and robust against gaps in data collection and noise non-stationarities. Our method, based on the Hough Transform, finds tracks in the time/frequency plane of the detector that uniquely describe specific inspiraling systems. We find that we could detect $\\sim 5$ overlapping, intermediate-strength signals without a sensitivity loss. Additionally, we demonstrate that our method can enable multi-messenger astronomy: using only low frequencies ($2-20$ Hz), we could warn astronomers $\\sim 2.5$ hours before a GW170817-like merger at 40 Mpc and provide a sky localization of $\\sim 20$ deg$^2$ using only one interferometer. Additionally, assuming that primordial black holes (PBHs) exist, we derive projected constraints on the fraction of dark matter they could compose, $f\\_{\\rm PBH}\\sim 10^{-6}-10^{-4}$, for $\\sim 1-0.1M\\_\\odot$ equal-mass systems, respectively, using a rate suppression factor $f\\_{\\rm sup}=2.5\\times 10^{-3}$. Our method only incurs a strain sensitivity loss of a factor of a few at binary neutron star masses compared to the matched filter, which may be reduced depending on available computational power.\n\n", "2309.15439": "2023-09-27, **A new class of anisotropic rotating fluids and some throat-like sources for Kerr metric as examples**, Stefano Viaggiu et.al., [2309.15439v1](http://arxiv.org/abs/2309.15439v1)\n\n Motivated by the increasing interest in finding physically viable rotating sources, we present a new class of anisotropic rotating solutions. The energy-momentum tensor compatible with the metric is composed of anisotropic matter with a non-vanishing energy flow around the symmetry axis and vanishing viscosity. The new class of solutions can be used to find new possible sources for the Kerr metric, to obtain new regular black hole solutions and to study galaxies with a central rotating black hole and an halo of dark matter. As an example, we obtain a 5-parameter class of solutions representing a two-way traversable wormhole smoothly matched to the Kerr one and satisfying all energy conditions outside the wormhole for a wide range of parameters, in particular for compact objects. Finally, with a simple modification of the aforementioned solution, we obtain a source for Kerr metric with a throat geometry, non-representing a two-way traversable wormhole and satisfying all energy conditions.\n\n", "2309.15436": "2023-09-27, **Lattice QCD calculation of the invisible decay $J/ψ\\rightarrow γν\\barν$**, Yu Meng et.al., [2309.15436v1](http://arxiv.org/abs/2309.15436v1)\n\n In this work, we present the first lattice QCD study on the invisible decay $J/\\psi \\rightarrow \\gamma\\nu\\bar{\\nu}$. The calculation is accomplished using $N\\_f=2$ twisted mass fermion ensembles. The excited-state effects are observed and eliminated using a multi-state fit. The impact of finite-volume effects is also examined and confirmed to be well-controlled. After a continuous extrapolation under three lattice spacings, we obtain the branching fraction as $\\operatorname{Br}[J/\\psi \\rightarrow \\gamma\\nu\\bar{\\nu}]=1.00(9)(7)\\times 10^{-10}$, where the first error is the statistical error and the second is an estimate of the systematics. The exact theoretical prediction can be used to remove the only invisible contamination from the standard model background in searching for the possible dark matter by the channel $J/\\psi \\rightarrow \\gamma+\\textrm{invisible}$\n\n", "2309.15227": "2023-09-26, **Exploring Interacting Dark Energy with Chaos Quantum-Behaved Particle Swarm Optimization**, Zhixiang Yin et.al., [2309.15227v1](http://arxiv.org/abs/2309.15227v1)\n\n Models with an interaction between dark energy and dark matter have already been studied for about twenty years. However, in this paper, we provide for the first time a general analytical solution for models with an energy transfer given by $\\mathcal{E} = 3H(\\xi\\_1 \\rho\\_c + \\xi\\_2 \\rho\\_d)$. We also use a new set of age-redshift data for 114 old astrophysical objects (OAO) and constrain some special cases of this general energy transfer. We use a method inspired on artificial intelligence, known as Chaos Quantum-behaved Particle Swarm Optimization (CQPSO), to explore the parameter space and search the best fit values. We test this method under a simulated scenario and also compare with previous MCMC results and find good agreement with the expected results.\n\n", "2309.15119": "2023-09-26, **Probing light relics through cosmic dawn**, Nanoom Lee et.al., [2309.15119v1](http://arxiv.org/abs/2309.15119v1)\n\n We explore the prospects of upcoming 21-cm surveys of cosmic dawn ($12\\lesssim \\!z\\lesssim\\!30$) to provide cosmological information on top of upcoming cosmic microwave background (CMB) and large-scale structure surveys, such as CMB-S4, Simons Observatory (SO) and DESI. We focus on the effective number of relativistic species $N\\_{\\rm eff}$ which is a promising observable for probing beyond the Standard Model theories. We show including upcoming 21-cm surveys such as the Square Kilometre Array (SKA) can allow probing a wide range of models for light particles at $2\\sigma$ level achieving $2\\sigma(N\\_{\\rm eff})=0.034$ with CMB-S4, for example. Taking into account the degeneracy between $N\\_{\\rm eff}$ and primordial helium fraction $Y\\_p$, one can achieve improvements in sensitivities to cosmological parameters, in particular, by more than a factor of 2 for $N\\_{\\rm eff}$ and dark matter fractional energy density $\\omega\\_c$.\n\n", "2309.15106": "2023-09-26, **Improved constraints for axion-like particles from 3-photon events at $e^+e^-$ colliders**, Aleksandr Pustyntsev et.al., [2309.15106v1](http://arxiv.org/abs/2309.15106v1)\n\n Axions and axion-like particles (ALPs) are one of the most widely discussed extensions of the Standard Model when it comes to the strong CP problem and dark matter candidates. Current experiments are focused on the indirect searches of invisible pseudoscalars in a wide parameter range. In this paper we investigate limits on ALP mass, and its couplings to photons and leptons from 3-photon annihilation at $e^+e^-$ colliders. We provide detailed calculations and apply them to the particular kinematics of the Belle II experiment, covering the ALP mass range from few hundred MeV to around 10 GeV. Our results, which improve upon previous analyses by also including the ALP coupling to electrons, show that such future analyses will allow to significantly extend the ALP search range and impose much more stringent restrictions on their couplings.\n\n", "2309.15092": "2023-09-26, **Formation of the hydrogen line 21-cm in Dark Ages and Cosmic Dawn: dependences on cosmology and first light**, Bohdan Novosyadlyj et.al., [2309.15092v1](http://arxiv.org/abs/2309.15092v1)\n\n We analyze the formation of the redshifted hyperfine structure line 21-cm of hydrogen atom in the Dark Ages, Cosmic Dawn, and Reionization epochs. The evolution of the global differential brightness temperature in this line was computed to study its dependence on the values of cosmological parameters and physical conditions in the intergalactic medium. Variations of the depth of the Dark Ages absorption line at $z\\sim80$ with variations of the cosmological parameters $\\Omega\\_b$, $\\Omega\\_{cdm}$, $\\Omega\\_{\\Lambda}$, $\\Omega\\_K$ and $H\\_0$ are studied. The standard model with post-Planck parameters predicts a value of the differential brightness temperature in the center of the absorption line $\\sim$30-50 mK. The profile of this line can be quite another in the non-standard cosmological models, which include the annihilating or decaying dark matter, a primordial stochastic magnetic field, etc. It can be shallower or be an emission bump instead of an absorption trough. It is also shown that the position and depth of the Cosmic Dawn absorption line formed at 10<z<30, due to the Wouthuysen-Field effect, is mainly defined by the spectral energy distribution of the first sources of light. If reionization occurs at $z\\_{ri}=7\\pm1$, then the differential brightness temperature in the center of this line is $\\sim$80 mK. During the reionization, the emission with an amplitude of $\\sim$20 mK is possible. It is also shown that the temperature, density, and degree of ionization of the baryonic component are decisive in calculating the intensity of the 21-cm absorption/emission line from these epochs.\n\n", "2309.15021": "2023-09-26, **Quantum Cosmology and Black Hole Interiors in Nonsupersymmetric String Theory and Canonical Gravity**, Michael McGuigan et.al., [2309.15021v1](http://arxiv.org/abs/2309.15021v1)\n\n In this paper we study black hole interior solutions and cosmologies in different dimensions using tools from canonical gravity and nonsupersymmetric string quantum cosmology. We find that the quantum wave functions associated with these solutions can be related to each other by a specific choice of variables. In a more realistic four dimensional setting we combine canonical gravity and nonsupersymmetric string orbifold compactifications. We discuss the classical solutions and the corresponding wave functions involving inflation, the Higgs field, dark matter and hidden gauge sectors in these models. Finally we discuss string aspects of these models such as duality, massive modes, and nonperturbative approaches such as Matrix theory and holography near the singularity.\n\n", "2309.14982": "2023-09-26, **Experimental Limits on Solar Reflected Dark Matter with a New Approach on Accelerated Dark Matter-Electron Analysis in Semiconductors**, Z. Y. Zhang et.al., [2309.14982v1](http://arxiv.org/abs/2309.14982v1)\n\n Recently a Dark Matter-electron (DM-e) paradigm has drawn much attention. Models beyond the Standard Halo Model describing DM accelerated by high energy celestial bodies are under intense examination as well. In this letter, a Velocity Component Analysis method dedicated to swift analysis of Accelerated DM-electron interactions via semiconductor detectors is proposed and the first HPGe detector-based Accelerated DM-electron analysis is realized. Utilizing the method, the first germanium based constraint on sub-GeV Solar Reflected DM-electron interaction is presented with the 205.4 kg$\\cdot$day dataset from the CDEX-10 experiment. In the heavy mediator scenario, the result excels in the mass range from 5$-$15 keV/$c^2$, achieving a three orders of magnitude improvement comparing with previous semiconductor experiments, and is comparable to currently the best direct detection experiments. In the light mediator scenario, the strongest constraint for DM lighter than 0.1 MeV/$c^2$ is presented. The result proves the feasibility and demonstrates the vast potential of the Velocity Component Analysis technique in future Accelerated DM-electron analysis with semiconductor detectors.\n\n", "2309.14933": "2023-09-26, **Baryonium Dark Matter: Events with Circle Configurations in the Atmosphere and on the Surface of Earth**, O. I. Piskounova et.al., [2309.14933v1](http://arxiv.org/abs/2309.14933v1)\n\n This research supposes the parallel study of Baryonium Dark Matter (BDM) manifestations in astroparticle collision in the atmosphere as well as among the traces of the massive object that falls on the surface of Earth. Characteristics of BDM disintegration events are able to be analyzed with a similar technique as for hadroproproduction data on colliders. The HE event that was detected in the stratosphere in 1975 differs from the collision of nuclei. The signatures of such events are the following: 1) the circle distribution of heavy secondary hadrons with almost nothing inside the ring and 2) the presence of heavy secondary particles with a mass out of range of known hadrons. The circle signature can have the BDM particles that disintegrate for a few lower-mass BDMs in the atmosphere. The same signatures should be seen at super-heavy BDM collapses on the Earth. The traces of such events are seen as pits or shafts in the ground rock, which are organized in the circles. There are at least two pieces of evidence of such holes: cenotes on the Yucatan peninsula (Mexico) and pits in Durrington Walls (England). In addition, a single round hole in the ground can be seen in Moschovi in the Balkans, where it has been reused for the grave. The vertical pits in the rock with the depth from 5 to 50 meters had been laid out in the circles. These super heavy BDM collapses differ from the meteorite crash, because there are no craters. The existence of these places around the globe indicates the rare likelihood of meeting the supermassive BDM in proximity to Earth. The Tunguska meteorite could also be a BDM collapse. Finally, some suggestions are made about the production of BDM with the jets from giant active Supermassive Black Holes (SMBH) in the Universe.\n\n", "2309.14929": "2023-09-26, **Black hole charges in dark matter haloes and the seeds of cosmic magnetic fields**, Nelson D. Padilla et.al., [2309.14929v1](http://arxiv.org/abs/2309.14929v1)\n\n We present improved estimates of the electric charge that black holes could hold when these are embedded in the ionised plasma within dark matter haloes (or galaxies) in the Universe. We have implemented the spontaneous emission of charges of opposite sign to that of the black hole via athermal Hawking evaporation, including its dependence on black hole spin, and we have estimated the equilibrium charge that arises as this charge loss is balanced by the continuous accretion of charges from the surrounding plasma. The resulting charge can be several orders of magnitude lower than previously estimated upper limits, but it can surpass the pair production limit noted by Gibbons (1974) by a margin that increases with the amplitude of the black hole spin and the density of the plasma. We also implement a calculation for the net charge and magnetic moment of dark matter haloes when the dark matter is made of primordial black holes and also for astrophysical black holes that form part of the stellar halo of galaxies. We calculate the resulting magnetic fields of $z=15$ haloes for these different cases, and show that both primordial black holes and stellar ones could provide the magnetic field that can seed the observed ones in present-day galaxies.\n\n", "2309.14669": "2023-09-26, **Symmetric teleparallel cosmology with boundary corrections**, Andronikos Paliathanasis et.al., [2309.14669v1](http://arxiv.org/abs/2309.14669v1)\n\n We investigate the geometrodynamical effects of introducing the boundary term in symmetric teleparallel gravity. Specifically, we consider a homogeneous and isotropic universe in $f\\left( Q, B \\right) $, where $Q$ is the non-metricity scalar, and $B$ is the boundary term that relates the non-metricity and Ricci scalars. For the connection in the coincidence gauge, we find that the field equations are of fourth-order, and the fluid components introduced by the boundary are attributed to a scalar field. In the coincidence gauge, the cosmological field equations are equivalent to those of teleparallelism with a boundary term. Nevertheless, for the connection defined in the non-coincidence gauge, the geometrodynamical fluid consists of three scalar fields. We focus on the special case of $f\\left( Q, B \\right) = Q + F\\left( B \\right) $ theory, and we determine a new analytic cosmological solution that can explain the late-time acceleration of the universe and provide a geometric mechanism for the unification of dark energy with dark matter.\n\n"}, "supernova": {"2309.15781": "2023-09-27, **Exploring Modified Gravity: Constraints on the $μ$ and $Σ$ Parametrization with WMAP, ACT, and SPT**, Uendert Andrade et.al., [2309.15781v1](http://arxiv.org/abs/2309.15781v1)\n\n The cosmic acceleration problem remains one of the most significant challenges in cosmology. One of the proposed solutions to this problem is the modification of gravity on large scales. In this paper, we explore the well-known $\\mu$ and $\\Sigma$ parametrization scenarios, and confront them with observational data, including the cosmic microwave background (CMB) radiation from the Wilkinson Microwave Anisotropy Probe (WMAP), Atacama Cosmology Telescope (ACT), and South Pole Telescope (SPT), as well as large-scale structure data from the Sloan Digital Sky Survey (SDSS: BAO+RSD) and Pantheon Supernovae (SN) catalog. We employ a Bayesian framework to constrain the model parameters and discuss the implications of our results on the viability of modified gravity theories. Our analysis reveals the strengths and limitations of the $\\mu$ and $\\Sigma$ parametrization and provides valuable insights into the nature of gravity on cosmological scales. From the joint analysis ACT + WMAP + SDDS + SN, we find $\\mu -1 = 0.02 \\pm 0.19$ and $\\Sigma -1 = 0.021 \\pm 0.068$ at 68\\% CL. In light of the SPT + WMAP + SDDS + SN, we find $\\mu -1 = 0.07 \\pm 0.18$ and $\\Sigma -1 = -0.009^{+0.078}\\_{-0.11}$ at 68\\% CL. We also discuss and present several other results involving these datasets. In all the analysis carried out, we did not find any deviations from the theory of general relativity. Our results represent an observational update on the well-known $\\mu$-$\\Sigma$ parameterization in view of current CMB data, independent and competitive with the constraints obtained with the Planck data.\n\n", "2309.15711": "2023-09-27, **Beyond $Λ$CDM with $f(z)$CDM: criticalities and solutions of Padé Cosmography**, Alexandra T. Petreca et.al., [2309.15711v1](http://arxiv.org/abs/2309.15711v1)\n\n Recently, cosmography emerged as a valuable tool to effectively describe the vast amount of astrophysical observations without relying on a specific cosmological model. Its model-independent nature ensures a faithful representation of data, free from theoretical biases. Indeed, the commonly assumed fiducial model, the $\\Lambda$CDM, shows some shortcomings and tensions between data at late and early times that need to be further investigated. In this paper, we explore an extension of the standard cosmological model by adopting the $f(z)$CDM approach, where $f(z)$ represents the cosmographic series characterizing the evolution of recent universe driven by dark energy. To construct $f(z)$, we take into account the Pad\\'e series, since this rational polynomial approximation offers a better convergence at high redshifts than the standard Taylor series expansion. Several orders of such an approximant have been proposed in previous works, here we want to answer the questions: What is the impact of the cosmographic series choice on the parameter constraints? Which series is the best for the analysis? So, we analyse the most promising ones by identifying which order is preferred in terms of stability and goodness of fit. Theoretical predictions of the $f(z)$CDM model are obtained by the Boltzmann solver code and the posterior distributions of the cosmological and cosmographic parameters are constrained by a Monte Carlo Markov Chains analysis. We consider a joint data set of cosmic microwave background temperature measurements from the Planck collaboration, type Ia supernovae data from the latest Pantheon+ sample, baryonic acoustic oscillations and cosmic chronometers data. In conclusions, we state which series can be used when only late time data are used, while which orders has to be considered in order to achieve the necessary stability when large redshifts are considered.\n\n", "2309.15093": "2023-09-26, **Point-symmetry in SNR G1.9+0.3: A supernova that destroyed its planetary nebula progenitor**, Noam Soker et.al., [2309.15093v1](http://arxiv.org/abs/2309.15093v1)\n\n I analyze a new X-ray image of the youngest supernova remnant (SNR) in the Galaxy, which is the type Ia SNR G1.9+0.3, and reveal a very clear point-symmetrical structure. Since explosion models of type Ia supernovae (SNe Ia) do not form such morphologies, the point-symmetrical morphology must come from the circumstellar material (CSM) into which the ejecta expands. The large-scale point-symmetry that I identify and the known substantial deceleration of the ejecta of SNR G1.9+0.3 suggest a relatively massive CSM of >1Mo. I argue that the most likely explanation is the explosion of this SN Ia into a planetary nebula (PN). The scenario that predicts a large fraction of SN Ia inside PNe (SNIPs) is the core degenerate scenario. Other SN Ia scenarios might lead to only a very small fraction of SNIPs or not at all.\n\n", "2309.15046": "2023-09-26, **Rayleigh-Taylor Unstable Flames: the Coupled Effect of Multiple Perturbations**, Mingxuan Liu et.al., [2309.15046v1](http://arxiv.org/abs/2309.15046v1)\n\n The Rayleigh-Taylor (RT) instability is important in the fields of aerospace engineering, nuclear physics, and astrophysical research, particularly in studies of Type Ia supernovae. In some applications, the RT instability is complicated by a reaction at the unstable interface. In this paper, we show how this reaction changes the behavior of the RT instability. Using 2D direct numerical simulations (DNS) of Boussinesq premixed flames with a model reaction rate, we show how the flame responds to three types of perturbation: a large amplitude single mode primary perturbation, a smaller amplitude single mode secondary perturbation, and a numerically generated system perturbation with both single mode and multimode components. Early on, the evolution of the flame is dominated by the primary perturbation and, differently from single mode nonreacting RT, the flame propagates as a metastable traveling wave in the form of bubbles separated by cusp-like spikes. However, the lifetime of this traveling wave depends on the properties of the secondary and system perturbations and on the strength of gravity. Once the traveling wave is destabilized, the flame front bubbles rapidly grow to large scales. We identify five distinct flame growth solution types, with the symmetry and properties of each depending on the balance and interactions between the three types of perturbation. In particular, we show that the primary and secondary modes can couple to generate a tertiary mode which ultimately dominates the flow. Depending on the wavenumber of the tertiary mode, the flame may stall, develop coherent pulsations, or even become a metastable traveling wave again, behaviors not seen in nonreacting RT.\n\n", "2309.14901": "2023-09-26, **Recovering lost light: discovery of supernova remnants with integral field spectroscopy**, Héctor Martínez-Rodríguez et.al., [2309.14901v1](http://arxiv.org/abs/2309.14901v1)\n\n We present results from a systematic search for broad ($\\geq$ 400 \\kms) \\ha\\ emission in Integral Field Spectroscopy data cubes of $\\sim$1200 nearby galaxies obtained with PMAS and MUSE. We found 19 unique regions that pass our quality cuts, four of which match the locations of previously discovered SNe: one Type IIP, and three Type IIn, including the well-known SN 2005ip. We suggest that these objects are young Supernova Remnants, with bright and broad \\ha\\ emission powered by the interaction between the SN ejecta and dense circumstellar material. The stellar ages measured at the location of these SNR candidates are systematically lower by about 0.5 dex than those measured at the location of core collapse SNe, implying that their progenitors might be shorter lived and therefore more massive than a typical CC SN progenitor. The methods laid out in this work open a new window into the study of nearby SNe with Integral Field Spectroscopy.\n\n", "2309.14879": "2023-09-26, **Hyperonic Uncertainties in Neutron Stars, Mergers and Supernovae**, Hristijan Kochankovski et.al., [2309.14879v1](http://arxiv.org/abs/2309.14879v1)\n\n In this work we delve into the temperature-dependent Equation of State (EoS) of baryonic matter within the framework of the FSU2H$^*$ hadronic model, which comprehensively incorporates hyperons and is suitable for relativistic simulations of neutron star mergers and supernovae. To assess the impact of the uncertainties in the hyperonic sector on astrophysical observables, we introduce two additional models, namely FSU2H$^*$L and FSU2H$^*$U. These models cover the entire spectrum of variability of hyperonic potentials, as derived from experimental data. Our investigations reveal that these uncertainties extend their influence not only to the relative abundances of various particle species but also to the EoS itself and, consequently, have an impact on the global properties of both cold and hot neutron stars. Notably, their effects become more pronounced at large temperatures, owing to the increased presence of hyperons. These findings have direct implications for the outcomes of relativistic simulations of neutron star mergers and supernovae, emphasizing the need of accounting for hyperonic uncertainties to ensure the accuracy and reliability of such simulations in astrophysical contexts.\n\n", "2309.14725": "2023-09-26, **Citizen Science Time Domain Astronomy with Astro-COLIBRI**, Fabian Schüssler et.al., [2309.14725v1](http://arxiv.org/abs/2309.14725v1)\n\n Astro-COLIBRI is an innovative tool designed for professional astronomers to facilitate the study of transient astronomical events. Transient events - such as supernovae, gamma-ray bursts and stellar mergers - are fleeting cataclysmic phenomena that can offer profound insights into the most violent processes in the universe. Revealing their secrets requires rapid and precise observations: Astro-COLIBRI alerts its users of new transient discoveries from observatories all over the world in real-time. The platform also provides observers the details they need to make follow-up observations.   Some of the transient phenomena available through Astro-COLIBRI are accessible by amateur astronomers and citizen scientists. A subset of the features dedicated to this growing group of users are highlighted here. They include the possibility of receiving only alerts on very bright events, the possibility of defining custom observer locations, as well as the calculation of optimized observation plans for searches for optical counterparts to gravitational wave events.\n\n", "2309.14716": "2023-09-26, **Expansion and ongoing cosmic ray acceleration in HESS J1731-347**, Victor Doroshenko et.al., [2309.14716v1](http://arxiv.org/abs/2309.14716v1)\n\n Diffusive shock acceleration in supernova remnants (SNRs) is considered one of the prime mechanisms for Galactic Cosmic Ray (GCR) acceleration. It is still unclear, however, whether SNRs can contribute to GCR spectrum up to the ``knee'' (1\\,PeV) band as acceleration to such energies requires an efficient magnetic field amplification process around the shocks. The presence of such a process is challenging to test observationally. Here we report on the detection of fast variability of the X-ray synchrotron emission from the forward shock in the supernova remnant HESS J1731-347, which implies the presence of a strong ($\\sim$0.2\\,mG) field exceeding background values and thus of effective field amplification. We also report a direct measurement of the high forward shock expansion velocity of 4000-5500\\,km/s confirming that the SNR is expanding in a tenuous wind bubble blown by the SNR progenitor, is significantly younger (2.4-9\\,kyr) than previously assumed by some authors, and only recently started interaction with the dense material outside the bubble. We finally conclude that there is strong evidence for ongoing hadronic CR acceleration in this SNR.\n\n", "2309.14671": "2023-09-26, **Cannonball or Bowling Ball: A Proper Motion and Parallax for PSR J0002+6216**, S. Bruzewski et.al., [2309.14671v1](http://arxiv.org/abs/2309.14671v1)\n\n We report the results of careful astrometric measurements of the Cannonball pulsar J0002+6216 carried out over three years using the High Sensitivity Array (HSA). We significantly refine the proper motion to $\\mu=35.3\\pm0.6$ mas yr$^{-1}$ and place new constraints on the distance, with the overall effect of lowering the velocity and increasing the inferred age to $47.60\\pm0.80$ kyr. Although the pulsar is brought more in line with the standard natal kick distribution, this new velocity has implications for the morphology of the pulsar wind nebula that surrounds it, the density of the interstellar medium through which it travels, and the age of the supernova remnant (CTB 1) from which it originates.\n\n"}}