{"neutrino": {"2412.12972": "2024-12-17, **Search for dark matter from the center of the Earth with ten years of IceCube data**, The IceCube Collaboration et.al., [2412.12972v1](http://arxiv.org/abs/2412.12972v1)\n\n The nature of dark matter remains unresolved in fundamental physics. Weakly Interacting Massive Particles (WIMPs), which could explain the nature of dark matter, can be captured by celestial bodies like the Sun or Earth, leading to enhanced self-annihilation into Standard Model particles including neutrinos detectable by neutrino telescopes such as the IceCube Neutrino Observatory. This article presents a search for muon neutrinos from the center of the Earth performed with 10 years of IceCube data using a track-like event selection. We considered a number of WIMP annihilation channels ($\\chi\\chi\\rightarrow\\tau^+\\tau^-$/$W^+W^-$/$b\\bar{b}$) and masses ranging from 10 GeV to 10 TeV. No significant excess over background due to a dark matter signal was found while the most significant result corresponds to the annihilation channel $\\chi\\chi\\rightarrow b\\bar{b}$ for the mass $m\\_{\\chi}=250$~GeV with a post-trial significance of $1.06\\sigma$. Our results are competitive with previous such searches and direct detection experiments. Our upper limits on the spin-independent WIMP scattering are world-leading among neutrino telescopes for WIMP masses $m\\_{\\chi}>100$~GeV.\n\n"}, "dark matter": {"2412.13192": "2024-12-17, **How to Falsify String Theory at a Collider**, Matthew Baumgart et.al., [2412.13192v1](http://arxiv.org/abs/2412.13192v1)\n\n The string landscape accommodates a broad range of possible effective field theories. This poses a challenge for extracting verifiable predictions as well as falsifiable signatures of string theory. Motivated by these considerations, in this work we observe that all known stringy Standard Models support only low-dimensional representations of the gauge group. While it is in principle possible to produce contrived models with higher-dimensional representations, these generically appear in a tower of states with lighter ones in lower-dimensional representations, i.e., not in isolation. With this in mind, we consider the phenomenologically well-motivated scenario of a single Majorana particle in a real, $n$-dimensional representation of $SU(2)\\_L$ with $n \\geq 5$ $\\textit{and nothing else}$. This scenario is not realized in any known string construction, and we conjecture that this is true of string theory in general. Detection of this scenario would thus amount to falsifying the (known) string landscape. We recast existing LHC searches for new electroweak states to extract updated bounds on this class of scenarios. Improved limits from future colliders and dark matter detection experiments provide additional routes to potentially falsifying string theory.\n\n", "2412.13144": "2024-12-17, **Semi-Analytic Modeling of Dark Matter Subhalo Encounters with Thin Stellar Streams: Statistical Predictions for GD-1-like Streams in CDM**, Duncan K. Adams et.al., [2412.13144v1](http://arxiv.org/abs/2412.13144v1)\n\n Stellar streams from disrupted globular clusters are dynamically cold structures that are sensitive to perturbations from dark matter subhalos, allowing them in principle to trace the dark matter substructure in the Milky Way. We model, within the context of $\\Lambda$CDM, the likelihood of dark matter subhalos to produce a significant feature in a GD-1-like stream and analyze the properties of such subhalos. We generate a large number of realizations of the subhalo population within a Milky Way mass host halo, accounting for tidal stripping and dynamical friction, using the semi-analytic code SatGen. The subhalo distributions are combined with a GD-1-like stream model, and the impact of subhalos that pass close to the stream are modeled with Gala. We find that subhalos with masses in the range $5\\times 10^6 M\\_{\\odot} - 10^8 M\\_{\\odot}$ at the time of the stream-subhalo encounter, corresponding to masses of about $4 \\times 10^7 M\\_{\\odot} - 8 \\times 10^8 M\\_{\\odot}$ at the time of infall, are the likeliest to produce gaps in a GD-1-like stream. We find that gaps occur on average $\\sim$1.8 times per realization of the host system. These gaps have typical widths of $\\sim(7 - 27)$ deg and fractional underdensities of $\\sim (10 - 30)\\%$, with larger gaps being caused by more-massive subhalos. The stream-subhalo encounters responsible for these have impact parameters $(0.1 - 1.5)$ kpc and relative velocities $\\sim(170 - 410)$ km/s. For a larger host-halo mass, the number of subhalos increases, as do their typical velocities, inducing a corresponding increase in the number of significant stream-subhalo encounters.\n\n", "2412.13131": "2024-12-17, **Constraints on Strongly-Interacting Dark Matter from the James Webb Space Telescope**, Peizhi Du et.al., [2412.13131v1](http://arxiv.org/abs/2412.13131v1)\n\n Direct-detection searches for dark matter are insensitive to dark matter particles that have large interactions with ordinary matter, which are stopped in the atmosphere or the Earth's crust before reaching terrestrial detectors. We use ``dark'' calibration images taken with the HgCdTe detectors in the Near-Infrared Spectrograph (NIRSpec) on the James Webb Space Telescope (JWST) to derive novel constraints on sub-GeV dark matter candidates that scatter off electrons. We supplement the JWST analysis pipeline with additional masks to remove pixels with high-energy background events. For a 0.4% subcomponent of dark matter that interacts with an ultralight dark photon, we disfavor all previously allowed parameter space at high cross sections, and constrain some parameter regions for subcomponent fractions as low as $\\sim$0.01%.\n\n", "2412.13065": "2024-12-17, **COZMIC. III. Cosmological Zoom-in Simulations of SIDM with Suppressed Initial Conditions**, Ethan O. Nadler et.al., [2412.13065v1](http://arxiv.org/abs/2412.13065v1)\n\n We present eight cosmological dark matter (DM)--only zoom-in simulations of a Milky Way-like system that include suppression of the linear matter power spectrum $P(k)$, and/or velocity-dependent DM self-interactions, as the third installment of the COZMIC suite. We consider a model featuring a massive dark photon that mediates DM self-interactions and decays into massless dark fermions. The dark photon and dark fermions suppress linear matter perturbations, resulting in dark acoustic oscillations in $P(k)$, which ultimately affect dwarf galaxy scales. The model also features a velocity-dependent elastic self-interaction between DM particles (SIDM), with a cross section that can alleviate small-scale structure anomalies. For the first time, our simulations test the impact of $P(k)$ suppression on gravothermal evolution in an SIDM scenario that leads to core collapse in (sub)halos with present-day virial masses below $\\approx 10^9~M\\_{\\mathrm{\\odot}}$. In simulations with $P(k)$ suppression and self-interactions, the lack of low-mass (sub)halos and the delayed growth of structure reduce the fraction of core-collapsed systems relative to SIDM simulations without $P(k)$ suppression. In particular, $P(k)$ suppression that saturates current warm DM constraints almost entirely erases core collapse in isolated halos. Models with less extreme $P(k)$ suppression produce core collapse in $\\approx 20\\%$ of subhalos and $\\approx 5\\%$ of isolated halos above $10^8~M\\_{\\mathrm{\\odot}}$, and also increase the abundance of extremely low-concentration isolated low-mass halos relative to SIDM. These results reveal a complex interplay between early and late-universe DM physics, revealing new discovery scenarios in the context of upcoming small-scale structure measurements.\n\n", "2412.12975": "2024-12-17, **Comparative analysis of the NANOgrav Hellings-Downs as a window into new physics**, Rubén Arjona et.al., [2412.12975v1](http://arxiv.org/abs/2412.12975v1)\n\n Pulsar timing array (PTA) experiments have recently provided strong evidence for the signal of the stochastic gravitational wave background (SGWB) in the nHz-frequency band. These experiments have shown a statistical preference for the Hellings-Downs (HD) correlation between pulsars, which is widely regarded as a definitive signature of the SGWB. Using the NANOGrav 15-year dataset, we perform a comparative Bayesian analysis of four different models that go beyond the standard cosmological framework and influence the overlap reduction function. Specifically, we analyze ultralight vector dark matter (DM), spin-2 ultralight DM, massive gravity, and a folded non-Gaussian component to the SGWB. We find that the spin-2 ultralight DM and the massive gravity model are statistically equivalent to the HD prediction, and there is weak evidence in favor of the non-Gaussian component and the ultralight vector DM model. We also perform a non-parametric test using the Genetic Algorithms, which suggests a weak deviation from the HD curve. However, improved data quality is required before drawing definitive conclusions.\n\n", "2412.12818": "2024-12-17, **Non-magnetic glass-fiber cryostat for MADMAX prototype tests**, D. Kreikemeyer-Lorenzo et.al., [2412.12818v1](http://arxiv.org/abs/2412.12818v1)\n\n MADMAX, an axion dark matter search experiment, is currently in the prototype testing phase. Its working principle is based on the conversion of axions in a magnetic field into photons. This signal is then enhanced by a booster made of dielectric disks placed in front of a mirror. In order to test MADMAX prototypes at cryogenic temperatures in a magnetic field parallel to the disks, a new G-10 glass-fiber cryostat of 0.25 m$^3$ inner volume was designed, tested and used in a CERN magnet. The design allows to minimise cost as well as cooling down and warming up times. Using continuous circulation flow of gaseous helium, the MADMAX prototype was cooled down reproducibly to temperatures below 10 K for more than 24 hours. This procedure allowed, for the first time, to perform a calibration of the booster response and to run a dark matter axion search in a magnetic field at low temperatures. This novel type of cryostat, with a low manufacturing cost, fast and easy to operate, could be used for other purposes beyond MADMAX.\n\n", "2412.12709": "2024-12-17, **Accelerating lensed quasars discovery and modeling with physics-informed variational autoencoders**, Irham T. Andika et.al., [2412.12709v1](http://arxiv.org/abs/2412.12709v1)\n\n Strongly lensed quasars provide valuable insights into the rate of cosmic expansion, the distribution of dark matter in foreground deflectors, and the characteristics of quasar hosts. However, detecting them in astronomical images is difficult due to the prevalence of non-lensing objects. To address this challenge, we developed a generative deep learning model called VariLens, built upon a physics-informed variational autoencoder. This model seamlessly integrates three essential modules: image reconstruction, object classification, and lens modeling, offering a fast and comprehensive approach to strong lens analysis. VariLens is capable of rapidly determining both (1) the probability that an object is a lens system and (2) key parameters of a singular isothermal ellipsoid (SIE) mass model -- including the Einstein radius ($\\theta\\_\\mathrm{E}$), lens center, and ellipticity -- in just milliseconds using a single CPU. A direct comparison of VariLens estimates with traditional lens modeling for 20 known lensed quasars within the Subaru Hyper Suprime-Cam (HSC) footprint shows good agreement, with both results consistent within $2\\sigma$ for systems with $\\theta\\_\\mathrm{E}<3$ arcsecs. To identify new lensed quasar candidates, we begin with an initial sample of approximately 80 million sources, combining HSC data with multiwavelength information from various surveys. After applying a photometric preselection aimed at locating $z>1.5$ sources, the number of candidates is reduced to 710,966. Subsequently, VariLens highlights 13,831 sources, each showing a high likelihood of being a lens. A visual assessment of these objects results in 42 promising candidates that await spectroscopic confirmation. These results underscore the potential of automated deep learning pipelines to efficiently detect and model strong lenses in large datasets.\n\n", "2412.12573": "2024-12-17, **Probing Environmental Dependence of High-Redshift Galaxy Properties with the Marked Correlation Function**, Emy Mons et.al., [2412.12573v1](http://arxiv.org/abs/2412.12573v1)\n\n In hierarchical structure formation, correlations between galaxy properties and their environments reveal important clues about galaxy evolution, emphasizing the importance of measuring these relationships. We probe the environmental dependence of Lyman-break galaxy (LBG) properties in the redshift range of $3$ to $5$ using marked correlation function statistics with galaxy samples from the Hyper Suprime-Cam Subaru Strategic Program and the Canada--France--Hawaii Telescope U-band surveys. We find that the UV magnitude and color of magnitude-selected LBG samples are strongly correlated with their environment, making these properties effective tracers of it. In contrast, the star formation rate and stellar mass of LBGs exhibit a weak environmental dependence. For UV magnitudes and color, the correlation is stronger in brighter galaxy samples across all redshifts and extends to scales far beyond the size of typical dark matter halos. This suggests that within a given sample, LBGs with high UV magnitudes or colors are more likely to form pairs at these scales than predicted by the two-point angular correlation function. Moreover, the amplitude of the marked correlation function is generally higher for LBG samples compared to that of $z \\sim 0$ galaxies from previous studies.We also find that for LBG samples selected by the same absolute threshold magnitude or average halo mass, the correlation between UV magnitudes and the environment generally becomes more pronounced as the redshift decreases. On the other hand, for samples with the same effective large-scale bias at $z\\sim 4$ and $5$, the marked correlation functions are similar on large scales.\n\n"}, "supernova": {"2412.13166": "2024-12-17, **The Red Supergiant Progenitor of the Type II Supernova 2024abfl**, Jingxiao Luo et.al., [2412.13166v1](http://arxiv.org/abs/2412.13166v1)\n\n Linkage between core-collapse supernovae (SNe) and their progenitors is not fully understood and ongoing effort of searching and identifying the progenitors is needed. $\\mathrm{SN\\,2024abfl}$ is a recent Type II supernova exploded in the nearby star-bursting galaxy $\\mathrm{NGC\\,2146}$, which is also the host galaxy of $\\mathrm{SN\\,2018zd}$. From archival Hubble Space Telescope (HST) data, we have found a red source ($\\mathrm{m\\_{F814W} \\sim 25}$) near the location (angular distance $\\leq 0.2\"$) of $\\mathrm{SN\\,2024abfl}$ before its explosion. With F814W and F606W photometry, we found that the properties of this source matched a typical red supergiant (RSG) moderately reddened by interstellar dust at the distance of the host galaxy. We conclude that the $\\mathrm{SN\\,2024abfl}$ had an RSG progenitor with initial mass of $\\mathrm{10M\\_{\\odot}}$--$\\mathrm{16\\,M\\_{\\odot}}$.\n\n", "2412.13117": "2024-12-17, **Spectroscopy of AT 2016blu's recurring supernova impostor outbursts**, Mojgan Aghakhanloo et.al., [2412.13117v1](http://arxiv.org/abs/2412.13117v1)\n\n We present spectra of the supernova (SN) impostor AT 2016blu spanning over a decade. This transient exhibits quasiperiodic outbursts with a $\\sim$113 d period, likely triggered by periastron encounters in an eccentric binary system where the primary star is a luminous blue variable (LBV). The overall spectrum remains fairly consistent during quiescence and eruptions, with subtle changes in line-profile shapes and other details. Some narrow emission features indicate contamination from a nearby H II region in the host galaxy, NGC 4559. Broader H$\\alpha$ profiles exhibit Lorentzian shapes with full width at half-maximum intensity (FWHM) values that vary significantly, showing no correlation with photometric outbursts or the 113 d phase. At some epochs, H$\\alpha$ exhibits asymmetric profiles with a stronger redshifted wing, while broad and sometimes multicomponent P Cygni absorption features occasionally appear, but are again uncorrelated with brightness or phase. These P Cygni absorptions have high velocities compared to the FWHM of the H$\\alpha$ emission line, perhaps suggesting that the absorption component is not in the LBV's wind, but is instead associated with a companion. The lack of phase dependence in line-profile changes may point to interaction between a companion and a variable or inhomogeneous primary wind, in an orbit with only mild eccentricity. Recent photometric data indicate that AT 2016blu experienced its 20th outburst around May/June 2023, as predicted based on its period. This type of quasiperiodic LBV remains poorly understood, but its spectra and erratic light curve resemble some pre-SN outbursts like those of SN 2009ip.\n\n", "2412.13078": "2024-12-17, **Origin of $α$-Poor Very Metal-Poor Stars**, S. K. Jeena et.al., [2412.13078v1](http://arxiv.org/abs/2412.13078v1)\n\n Among very metal-poor (VMP) stars, $\\alpha$-poor VMP ($\\alpha$PVMP) stars that have sub-solar values of ${\\rm [X/Fe]}$ for Mg and other $\\alpha$ elements are rare and are thought to have been formed from gas polluted by Type 1a supernova (SN 1a). However, recent analyses indicate that pure core-collapse supernova (CCSN) ejecta can also be a likely source. We perform a detailed analysis of 17 $\\alpha$PVMP stars by considering six different scenarios relevant to the early Galaxy. We consider a single pair-instability supernova (PISN) and a single CCSN. Additionally, we consider the combination of ejecta from a CCSN with ejecta from another CCSN, a PISN, a near-Chandrasekhar mass (near-${\\rm M\\_{Ch}}$) SN 1a, and a sub-Chandrasekhar mass (sub-${\\rm M\\_{Ch}}$) SN 1a. A clear signature can only be established for sub-${\\rm M\\_{Ch}}$ SN 1a with a near-smoking-gun signature in SDSSJ0018-0939 and a reasonably clear signature in ET0381. The majority ($82\\%$) of $\\alpha$PVMP stars can be explained by pure CCSN ejecta and do not require any SN 1a contribution. However, the combination of CCSN and sub-${\\rm M\\_{Ch}}$ SN 1a ejecta can also explain most ($76\\%$) of $\\alpha$PVMP stars. In contrast, the combination of ejecta from CCSN with near-${\\rm M\\_{Ch}}$ SN 1a and PISN can fit $41\\%$ and $29\\%$ of the stars, respectively. The single PISN scenario is strongly ruled out for all stars. Our results indicate that $\\alpha$PVMP stars are equally compatible with pure CCSN ejecta and a combination of CCSN and SN 1a ejecta, with sub-${\\rm M\\_{Ch}}$ SN 1a being roughly twice as frequent as near-${\\rm M\\_{Ch}}$ SN 1a.\n\n", "2412.13062": "2024-12-17, **The PeV Frontier: Status of Gamma-ray astronomy after two decades with H.E.S.S., MAGIC, VERITAS and the new window recently opened by HAWC and LHAASO**, J. Devin et.al., [2412.13062v1](http://arxiv.org/abs/2412.13062v1)\n\n One of the main purposes in $\\gamma$-ray astronomy is linked to the origin of Galactic cosmic rays. Unlike cosmic rays, $\\gamma$ rays can be used to probe their production sites in the Galaxy and to find which type of astrophysical sources is able to accelerated particles up to PeV energies. Twenty years of observations with current Imaging Atmospheric Cherenkov Telescopes (H.E.S.S., MAGIC and VERITAS) provided an unprecedented view of the very-high-energy $\\gamma$-ray sky and a large variety of Galactic sources which are prominent TeV emitters, such as supernova remnants, pulsar wind nebulae, massive stellar clusters and binary systems, in addition to a large fraction of unidentified TeV sources. For a long time, supernova remnants were the most promising candidates for the main source of Galactic cosmic rays, but the new window of ultra-high-energy $\\gamma$ rays recently opened by HAWC and LHAASO gave unexpected results and demonstrated the need to re-evaluate some scenarios and to revise some of our definitions. The highest-energy $\\gamma$-ray sources are not associated with standard candidates for the main source of Galactic cosmic rays and challenged our usual paradigms, highlighting the vastness of what needs to be explored and understood in the next decades.\n\n", "2412.13045": "2024-12-17, **Newest measurements of Hubble constant from DESI 2024 BAO observations**, Wuzheng Guo et.al., [2412.13045v1](http://arxiv.org/abs/2412.13045v1)\n\n In this Letter, we use the latest results from the Dark Energy Spectroscopic Instrument (DESI) survey to measure the Hubble constant. Baryon acoustic oscillation (BAO) observations released by the DESI survey, allow us to determine $H\\_0$ from the first principles. Our method is purely data-driven and relies on unanchored luminosity distances reconstructed from SN Ia data and $H(z)$ reconstruction from cosmic chronometers. Thus it circumvents calibrations related to the value of the sound horizon size at the baryon drag epoch or intrinsic luminosity of SN Ia. We find $H\\_0=68.4^{+1.0}\\_{-0.8}~{\\rm km~s^{-1}~Mpc^{-1}}$ at 68% C.L., which provides the Hubble constant at an accuracy of 1.3% with minimal assumptions. Our assessments of this fundamental cosmological quantity using the BAO data spanning the redshift range $z=0.51-2.33$ agree very well with Planck's results and TRGB results within $1\\sigma$. This result is still in a $4.3\\sigma$ tension with the results of the Supernova H0 for the Equation of State (SH0ES).\n\n", "2412.13024": "2024-12-17, **Late-Time Optical and X-ray Emission Evolution of the Oxygen-Rich SN 1996cr**, Daniel Patnaude et.al., [2412.13024v1](http://arxiv.org/abs/2412.13024v1)\n\n When the ejecta of supernovae interact with the progenitor star's circumstellar environment, a strong shock is driven back into the ejecta, causing the material to become bright optically and in X-rays. Most notably, as the shock traverses the H-rich envelope, it begins to interact with metal rich material. Thus, continued monitoring of bright and nearby supernovae provides valuable clues about both the progenitor structure and its pre-supernova evolution. Here we present late-time, multi-epoch optical and Chandra} X-ray spectra of the core-collapse supernova SN 1996cr. Magellan IMACS optical spectra taken in July 2017 and August 2021 show a very different spectrum from that seen in 2006 with broad, double-peaked optical emission lines of oxygen, argon, and sulfur with expansion velocities of $\\pm 4500$ km s$^{-1}$. Red-shifted emission components are considerably fainter compared to the blue-shifted components, presumably due to internal extinction from dust in the supernova ejecta. Broad $\\pm 2400$ km s$^{-1}$ H$\\alpha$ is also seen which we infer is shocked progenitor pre-SN mass-loss, H-rich material. Chandra data indicate a slow but steady decline in overall X-ray luminosity, suggesting that the forward shock has broken through any circumstellar shell or torus which is inferred from prior deep Chandra ACIS-S/HETG observations. The X-ray properties are consistent with what is expected from a shock breaking out into a lower density environment. Though originally identified as a SN IIn, based upon late time optical emission line spectra, we argue that the SN 1996cr progenitor was partially or highly stripped, suggesting a SN IIb/Ib.\n\n", "2412.12905": "2024-12-17, **DESI and SNe: Dynamical Dark Energy, $Ω_m$ Tension or Systematics?**, Eoin Ó Colgáin et.al., [2412.12905v1](http://arxiv.org/abs/2412.12905v1)\n\n Dark Energy Spectroscopic Instrument (DESI) observations, when combined with Cosmic Microwave Background (CMB) and Type Ia supernovae (SNe), have led to statistically significant dynamical dark energy (DDE) claims. In this letter we reconstruct $\\Lambda$CDM parameter $\\Omega\\_m$ from the $w\\_0 w\\_a$CDM cosmologies advocated by the DESI collaboration. We identify i) a mild increasing $\\Omega\\_m$ trend at high redshifts and ii) a sharp departure from $\\Lambda$CDM at low redshift. The latter, which is statistically significant, is driven by SNe that are $1.9 \\sigma- 2.5 \\sigma$ discrepant with DESI full-shape galaxy clustering in overlapping redshift ranges. We identify a low redshift subsample of the Dark Energy Survey (DES) SNe sample that is discrepant with DESI at $3.4 \\sigma$ despite both observables probing the same effective redshift. This ``$\\Omega\\_m$ tension'' may point to unexplored systematics. SNe and BAO/full-shape modeling should not disagree on $\\Omega\\_m$ at the same effective redshift. If they do, DDE claims are premature.\n\n", "2412.12764": "2024-12-17, **The long-short GRB connection**, J. A. Rueda et.al., [2412.12764v1](http://arxiv.org/abs/2412.12764v1)\n\n Long and short gamma-ray bursts (GRBs) are thought to arise from different and unrelated astrophysical progenitors. The association of long GRBs with supernovae (SNe) and the difference in the distributions of galactocentric offsets of long and short GRBs within their host galaxies have often been considered strong evidence of their unrelated origins. Long GRBs have been thought to result from the collapse of single massive stars, while short GRBs come from mergers of compact object binaries. Our present study challenges this conventional view. We demonstrate that the observational properties, such as the association with SNe and the different galactic offsets, are naturally explained within the framework of the binary-driven hypernova model, suggesting an evolutionary connection between long and short GRBs.\n\n", "2412.12534": "2024-12-17, **Wolf-Rayet Colliding Wind Binaries**, Ryan M. T. White et.al., [2412.12534v1](http://arxiv.org/abs/2412.12534v1)\n\n Wolf-Rayet stars embody the final stable phase of the most massive stars immediately before their evolution is terminated in a supernova explosion. They are responsible for some of the most extreme and energetic phenomena in stellar physics, driving fast and dense stellar winds that are powered by extraordinarily high mass-loss rates arising from their near Eddington limit luminosity. When found in binary systems comprised of two hot wind-driving components, a colliding wind binary (CWB) is formed, manifesting dramatic observational signatures from the radio to X-rays. Among the wealth of rare and exotic phenomenology associated with CWBs, perhaps the most unexpected is the production of copious amounts of warm dust. A necessary condition seems to be one binary component being a carbon-rich WR star -- providing favorable chemistry for dust nucleation from the wind -- however a detailed understanding of the physics underlying this phenomenon has not been established.\n\n"}}