{"neutrino": {"2506.04099": "2025-06-04, **Heavy Neutral Lepton Decay Searches using Solar Neutrinos**, Patrick Huber et.al., [2506.04099v1](http://arxiv.org/abs/2506.04099v1)\n\n We study the sensitivity to the decay of a heavy neutral lepton into $e^+e^-$-pairs using the solar boron-8 neutrino flux as source. We provide a fully differential cross section for this process including the interference of neutral and charged current amplitudes. We revisit a previous bound from Borexino and make predicitions for the expected sensitivity in future large liquid noble gas detectors, like XLZD, Argo and DUNE, as well as high-resolution scintillator detectors based on the LiquidO technology. We find that more than two orders of magnitude improvement in mixing angle reach is possible relative to existing bounds.\n\n", "2506.04035": "2025-06-04, **Dark matter mixing within the seesaw type II mechanism in the left-right symmetric model**, M. Dubinin et.al., [2506.04035v1](http://arxiv.org/abs/2506.04035v1)\n\n The seesaw type II mechanism is considered within the framework of a left-right chiral model with a gauge group $SU(2)\\_L\\times SU(2)\\_R\\times U(1)$, the lepton sector of which includes three generations of heavy Majorana neutrinos. The dependence of the mixing parameters of the lightest sterile neutrino as a dark matter particle on the scales of left-right symmetry breaking in the case of direct and inverse hierarchies of active neutrino masses is analyzed.\n\n", "2506.03934": "2025-06-04, **SuSAM-v2: improved superscaling description of electron and CC neutrino quasielastic scattering using effective mass dynamics**, V. L. Martinez-Consentino et.al., [2506.03934v1](http://arxiv.org/abs/2506.03934v1)\n\n We present an improved version of the Superscaling Analysis with Relativistic Effective Mass, denoted as SuSAM-v2. In the original SuSAM model, a universal scaling function was fitted to a selected set of quasielastic electron scattering (e,e') cross section data, using a phenomenological ansatz inspired by the Relativistic Mean Field model of nuclear matter. In this work, we refine the procedure by first fitting a longitudinal scaling function directly to experimental longitudinal response data. Subsequently, a separate transverse scaling function is extracted from purely transverse data, after subtracting the longitudinal contribution already determined. We find that the resulting transverse scaling function must exhibit an explicit dependence on the momentum transfer q in order to reproduce all kinematics consistently. The resulting SuSAM-v2 model simultaneously describes inclusive quasielastic cross sections and both longitudinal and transverse response functions in electron scattering. The model is then applied to neutrino-nucleus scattering, showing an improved prediction compared to the previous SuSAM-v1 version, due to a more accurate treatment of the relative contributions of the longitudinal and transverse weak nuclear responses.\n\n", "2506.03716": "2025-06-04, **The precision measurement of the electron anti-neutrino spectrum in beta-decay of $\\rm{^{144}Pr}$ nuclei**, A. V. Derbin et.al., [2506.03716v1](http://arxiv.org/abs/2506.03716v1)\n\n The $\\rm{^{144}Ce - ^{144}Pr}$ electron antineutrino source is one of the most suitable radiochemical sources for experiments searching for the oscillations of active neutrinos to the light sterile state. In the current work the $\\beta$-spectra of $\\rm{^{144}Ce - ^{144}Pr}$ source have been measured by two types of $\\beta$-spectrometers based on silicon Si(Li) detectors in order to determine the energy spectrum of electron anti-neutrino emitted in the $\\beta$-decay of $\\rm{^{144}Pr}$ nuclei. The nuclear form factor of the ground state beta transition in $\\rm{^{144}Pr - ^{144}Nd}$ has been obtained with high precision: $C(W) = 1 + (-0.0279\\pm 0.0003)W + (-0.076\\pm 0.003)W^{-1}$. The reduced cross section for the inverse beta decay reaction on hydrogen for the $\\rm{{^{144}Pr}}$ electron anti-neutrino source has been defined as $\\rm{(4.7448 \\pm 0.0006\\_{stat} \\pm 0.012\\_{syst}) \\times 10^{-44}~cm^2 {decay}^{-1}}$ that provides sufficient sensitivity to search for a sterile neutrino with a mass of $m\\_4 \\sim 1$~eV and a mixing angle $Sin^2(2\\theta\\_{14}) \\sim 0.005$ using standard disappearance method.\n\n", "2506.03581": "2025-06-04, **Gravitational waves from core-collapse supernovae with no electromagnetic counterparts**, Jade Powell et.al., [2506.03581v1](http://arxiv.org/abs/2506.03581v1)\n\n Core-collapse supernovae (CCSNe) are regularly observed electromagnetically, prompting targetted searches for their gravitational-wave emission. However, there are scenarios where these powerful explosions may not have any observable electromagnetic signal, but would still have strong detectable emission in gravitational waves and neutrinos. A regular CCSN explosion may be obscured by matter in the Galaxy. A star may undergo a failed CCSN explosion, where the stalled shockwave is not revived, and would eventually form a black hole. Higher mass progenitor stars may revive the shock, but form a black hole too quickly for the shockwave to reach the surface of the star and produce an electromagnetic signal. Previous work has shown that we can determine if a black hole forms from the CCSN neutrino emission if there are long duration sinusoidal modulations in the neutrino signal caused by the standing accretion shock instability (SASI). The SASI also produces an observable signature in the gravitational-wave emission. In this paper, we investigate if we can distinguish between different scenarios for electromagnetically dark CCSNe using the gravitational-wave emission alone. We find, using a reconstruction of the SASI mode, abrupt end times of the gravitational-wave emission, and the rate of change of frequency of the dominant mode, that we are able to accurately distinguish between an obscured CCSN, a failed CCSN, and an explosion with fast black hole formation.\n\n"}, "dark matter": {"2506.04149": "2025-06-04, **Parity violation in photon quasinormal modes of black holes**, Sugumi Kanno et.al., [2506.04149v1](http://arxiv.org/abs/2506.04149v1)\n\n Given that black holes are ubiquitous in the universe and axion-like scalar fields are potential candidates for dark energy and/or dark matter, it is natural to consider cosmological black holes endowed with axion hair. We investigate the photon quasinormal modes of a Schwarzschild black hole with axion hair where the electromagnetic field is coupled to the axion field via a Chern-Simons interaction. We derive the master equations for the electromagnetic field as a set of coupled equations for parity-even and parity-odd modes and numerically compute quasinormal modes by using Leaver's continued fraction method. We find parity violation in the polarization of photons within the quasinormal mode spectrum. This parity violation in electromagnetic signals could serve as a new probe to explore the nature of the dark sector.\n\n", "2506.04101": "2025-06-04, **Investigating the HI distribution and kinematics of ESO444-G084 and [KKS2000]23: New insights from the MHONGOOSE survey**, Brenda Namumba et.al., [2506.04101v1](http://arxiv.org/abs/2506.04101v1)\n\n We present the HI distribution, kinematics, mass modeling, and disk stability of the dwarf irregular galaxies ESO444-G084 and [KKS2000]23 using high-resolution, high-sensitivity MHONGOOSE survey data from MeerKAT. ESO444-G084 shows centrally concentrated HI emission, while [KKS2000]23 exhibits irregular high-density clumps. Total HI fluxes measured down to 10^19 and 10^18 cm^-2 are nearly identical, indicating that the increased HI diameter at lower column densities results mainly from the larger beam, with no significant extra emission detected. We derive total HI masses of (1.1 +/- 0.1) x 10^8 and (6.1 +/- 0.3) x 10^8 solar masses for ESO444-G084 and [KKS2000]23, respectively. Using PyFAT and TiRiFiC, we extract 3D rotation curves that reveal disk-like kinematics in both galaxies. ESO444-G084 shows a warp beyond ~1.8 kpc and a fast-rising curve consistent with a centrally concentrated dark matter distribution, while [KKS2000]23's more gradual rise suggests a more extended halo. Mass modeling with an isothermal halo and stellar mass-to-light ratios of 0.20 for ESO444-G084 and 0.18 for [KKS2000]23 yields consistent results. We analyze disk stability using spatially resolved Toomre Q and gas-to-critical surface density ratios, linking these with H-alpha and FUV-based star formation. ESO444-G084 supports localized star formation despite global stability, while [KKS2000]23 appears gravitationally unstable yet lacks H-alpha, suggesting that turbulence, gas depletion, or past feedback suppresses star formation. No inflows or outflows are detected, indicating internal processes regulate star formation. This study highlights the interplay between HI morphology, kinematics, dark matter distribution, and disk stability, showing how internal processes shape dwarf galaxy evolution.\n\n", "2506.04100": "2025-06-04, **Deep Neural Networks Hunting Ultra-Light Dark Matter**, Pavel Kůs et.al., [2506.04100v1](http://arxiv.org/abs/2506.04100v1)\n\n Ultra-light dark matter (ULDM) is a compelling candidate for cosmological dark matter. If ULDM interacts with ordinary matter, it can induce measurable, characteristic signals in pulsar-timing data because it causes the orbits of pulsars in binary systems to osculate. In this work, we investigate the potential of machine learning (ML) techniques to detect such ULDM signals. To this end, we construct three types of neural networks: an autoencoder, a binary classifier, and a multiclass classifier. We apply these methods to four theoretically well-motivated ULDM models: a linearly coupled scalar field, a quadratically coupled scalar field, a vector field and a tensor field. We show that the sensitivity achieved using ML methods is comparable to that of a semi-analytical Bayesian approach, which to date has only been applied to the linear scalar case. The ML approach is readily applicable to all four ULDM models and, in the case of the multiclass classifier, can distinguish between them. Our results, derived from simulated data, lay the foundation for future applications to real pulsar-timing observations.\n\n", "2506.04074": "2025-06-04, **Probing the sensitivity of CTAO-N LSTs observations at large zenith angles to the multi-TeV gamma-ray emission from the inner 10 parsecs of the Galactic Center**, Shotaro Abe et.al., [2506.04074v1](http://arxiv.org/abs/2506.04074v1)\n\n Observations of the Galactic Center using Imaging Atmospheric Cherenkov Telescopes (IACTs), such as H.E.S.S., MAGIC, and VERITAS, have revealed a very-high-energy (VHE, $\\gtrsim 100$ GeV) gamma-ray source, HESS J1745$-$290, aligned with the dynamical center of the Milky Way. This source shows point-like emission ($\\lesssim 0.1^\\circ$) and a strong suppression in its energy-differential spectrum in the ten TeV energy regime, modeled well by a power-law with an exponential cutoff. The origin of this emission is debated, with candidate emission scenarios including dark matter annihilations, millisecond pulsars in the central stellar clusters, and hadronic interactions in the vicinity of Sagittarius A*. Deriving the sensitivity to these spectral models is key to discriminating the physical processes at work. We show that combining H.E.S.S., MAGIC, and VERITAS archival data can well described the observed emission by a power-law with an exponential energy cutoff within the present uncertainties. Given the near advent of the array of the Large-Sized Telescopes (LSTs) at CTAO-N, we timely simulate realistic upcoming observations of the central emission by the CTAO-N four-LST array, to derive the sensitivity to resolve the sharpness of the spectral energy cutoff. We find that 500 hours of four-LST observations taken at large zenith angles, possibly accumulated over several years, can significantly discriminate the dark-matter emission scenario from the leptonic and hadronic ones. Also, a preliminary 3$\\sigma$ hint for such discrimination could emerge within the first year. We demonstrate, for the first time, that CTAO-N is able to provide new insights on differentiating among the above-mentioned emission scenarios in the next several years.\n\n", "2506.03955": "2025-06-04, **Test of conformal gravity as an alternative to dark matter from the observations of elliptical galaxies**, Li-Xue Yue et.al., [2506.03955v1](http://arxiv.org/abs/2506.03955v1)\n\n As an alternative gravitational theory to General Relativity (GR), the Conformal Gravity (CG) has recently been successfully verified by observations of Type Ia supernovae (SN Ia) and the rotation curves of spiral galaxies. The observations of galaxies only pertain to the non-relativistic form of gravity. In this context, within the framework of the Newtonian theory of gravity (the non-relativistic form of GR), dark matter is postulated to account for the observations. On the other hand, the non-relativistic form of CG predicts an additional potential: besides the Newtonian potential, there is a so-called linear potential term, characterized by the parameter $\\gamma^*$, as an alternative to dark matter in Newtonian gravity. To test CG in its non-relativistic form, much work has been done by fitting the predictions to the observations of circular velocity (rotation curves) for spiral galaxies. In this paper, we test CG with the observations from elliptical galaxies. Instead of the circular velocities for spiral galaxies, we use the velocity dispersion for elliptical galaxies. By replacing the Newtonian potential with that predicted by non-relativistic form of CG in Hamiltonian, we directly extend the Jeans equation derived in Newtonian theory to that for CG. By comparing the results derived from the ellipticals with that from spirals, we find that the extra potential predicted by CG is not sufficient to account for the observations of ellipticals. Furthermore, we discover a strong correlation between $\\gamma^*$ and the stellar mass $M^*$ in dwarf spheroidal galaxies. This finding implies that the variation in $\\gamma^*$ violates a fundamental prediction of Conformal Gravity (CG), which posits that $\\gamma^*$ should be a universal constant.\n\n", "2506.03904": "2025-06-04, **Gravothermal expansion of dwarf spheroidal galaxies heated by dark subhaloes**, Jorge Peñarrubia et.al., [2506.03904v1](http://arxiv.org/abs/2506.03904v1)\n\n We use analytical and $N$-body methods to study the evolution of dwarf spheroidal galaxies (dSphs) embedded in dark matter (DM) haloes that host a sizeable subhalo population. Dark subhaloes generate a fluctuating gravitational field that injects energy into stellar orbits, driving a gradual expansion of dSphs. Despite the overall expansion, the stellar density profile preserves its initial shape, suggesting that the evolution proceeds in a self-similar manner. Meanwhile, the velocity dispersion profile, initially flat, evolves as the galaxy expands: the inner regions heat up, while the outer regions cool down. Kinematically, this resembles gravothermal collapse but with an inverted evolution, instead of collapsing the stellar system expands within a fluctuating halo potential. As the half-light radius $r\\_{\\rm half}$ approaches the halo peak velocity radius $r\\_{\\rm max}$, the expansion slows, and the velocity dispersion peaks at $\\sigma\\_{\\rm max} \\simeq 0.27 v\\_{\\rm max}$. The stellar heat capacity remains positive for deeply embedded stars but diverges near $r\\_{\\rm max}$, turning negative beyond this threshold, which indicates a phase transition in the dynamical response to energy injection. The relaxation time scales as $t\\_{\\rm rel} \\sim r\\_{\\rm half}^{3/2}$, showing that orbital diffusion slows as the galaxy expands. Ultra-faint dSphs, having the smallest sizes and shortest relaxation times, are particularly sensitive to the presence of dark subhaloes. Some of our dSph models expand beyond the detection of current photometric surveys, becoming `stealth' galaxies with half-light radii and velocity dispersions similar to ultra-diffuse galaxies (UDGs), but orders of magnitude lower luminosities, representing a distinct, yet currently undetected, population of DM-dominated satellites.\n\n", "2506.03810": "2025-06-04, **Molecular Dynamics Simulations on Nuclear Recoils in Silicon Crystals towards Single Electron-Hole Pair Ionization Yields**, Chang-Hao Fang et.al., [2506.03810v1](http://arxiv.org/abs/2506.03810v1)\n\n We have developed a novel methodology utilizing molecular dynamics simulations to evaluate the ionization yields of nuclear recoils in crystalline silicon. This approach enables analytical exploration of atomic-scale transport within the lattice without necessitating parameterization. The quenching factors across the nuclear recoil energy range from 20 eV to 10 keV have been thoroughly investigated. A remarkable agreement with experimental data is achieved, particularly for the minimal energy regime conducted to date, reaching the level of a single electron-hole pair. This work presents evidence of a crucial and fundamental distribution of the quenching factor, which can be associated to the collisional interactions underlying the transport phenomena. The region below 4 keV of the quenching factor, where discrepancies have been observed with the Lindhard's model, is found to be significantly attributed to the lattice binding effect and the specific crystal structure. In contrast, a gradual functional relationship is identified below approximately 100 eV, indicating that the quenching factor is influenced by the crystallographic orientation of the target material. From a distributional perspective, our analysis allows for the determination of the minimum exclusion mass for the dark matter nucleon elastic scattering channel at 0.29 $\\mathrm{GeV}/c^2$, thereby significantly enhancing sensitivity for the sub-$\\mathrm{GeV}/c^2$ mass region.\n\n", "2506.03678": "2025-06-04, **Searching for Dark Galaxies with HI detection from the Arecibo Legacy Fast ALFA (ALFALFA) survey**, Minseong Kwon et.al., [2506.03678v1](http://arxiv.org/abs/2506.03678v1)\n\n We present a catalog of 142 dark galaxy candidates in a region covered by the Arecibo Legacy Fast ALFA (ALFALFA) survey. We start with 344 ALFALFA HI sources without optical counterparts and remove those that do not seem to have dark galaxy origin. To do that, we first eliminate 83 sources that are known HI clouds probably formed from tidal interactions between galaxies and 13 sources that have optical counterparts. We then remove 56 sources located near other HI sources, which are likely to be HI clouds. We further exclude 10 sources that have nearby HI sources within the ALFALFA beam and 40 sources potentially associated with nearby galaxies. We perform visual inspection of optical images from DESI Legacy Imaging Survey with an $r$-band surface brightness limit of $\\sim 28.5 \\rm \\ mag\\ arcsec^{-2}$ as well as NUV images from GALEX to confirm the absence of stellar emission. We additionally inspect infrared images from WISE and AKARI for dust emission. As a result, we identify 142 dark galaxy candidates and analyze their physical properties by comparing with luminous galaxies. We find that the dark galaxy candidates generally have smaller dynamical masses, higher HI-to-dynamical mass ratios, and are located in less dense regions when compared to luminous galaxies, which is consistent with results from cosmological simulations. This sample provides an important testbed for studying the role of dark matter in galaxy formation and evolution.\n\n", "2506.03539": "2025-06-04, **Germanium Atomic Compton Scattering Measurements and ${ab}$ ${initio}$ Many-Body Calculations: Implications for Electronic recoil Dark Matter Detection**, Chang-Hao Fang et.al., [2506.03539v1](http://arxiv.org/abs/2506.03539v1)\n\n Diverse searches for direct dark matter (DM) in effective electromagnetic and leptophilic interactions resulting from new physics, as well as Weakly Interacting Massive Particles (WIMPs) with unconventional electronic recoils, are intensively pursued. Low-energy backgrounds from radioactive $\\gamma$ rays via Compton scattering and photon coherent scattering are unavoidable in terrestrial detectors. The interpretation of dark matter experimental data is dependent on a better knowledge of the background in the low-energy region. We provide a 2.3% measurement of atomic Compton scattering in the low momentum transfer range of 180 eV/c to 25 keV/c, using a 10-g germanium detector bombarded by a $^{137}\\mathrm{Cs}$ source with a 7.2 m-Curie radioactivity and the scatter photon collected by a cylindrical NaI[Tl] detector. The ability to detect Compton scattering's doubly differential cross section (DDCS) gives a special test for clearly identifying the kinematic restraints in atomic many-body systems, notably the Livermore model. Additionally, a low-energy-background comparison is made between coherent photon scattering and Compton scattering replacing the scattering function of ${GEANT4}$@software, which uses a completely relativistic impulse approximation (RIA) together with Multi-Configuration Dirac-Fock (MCDF) wavefunctions. For the purpose of investigating sub-GeV mass and electronic-recoil dark matter theories, signatures including low energy backgrounds via high energy $\\gamma$ rays in germanium targets are discussed.\n\n"}, "supernova": {"2506.04184": "2025-06-04, **Core-collapse supernova parameter estimation with the upcoming Vera C. Rubin Observatory**, Andrea Simongini et.al., [2506.04184v1](http://arxiv.org/abs/2506.04184v1)\n\n The Vera Rubin Observatory's Legacy Survey of Space and Time (LSST) is expected to revolutionize time-domain optical astronomy as we know it. With its unprecedented depth, the LSST will survey the southern hemisphere sky, generating nearly 32 trillion observations over its nominal 10-year operation. Among these, approximately 10 million will be supernovae (SNe). These observations will uniquely characterize the SN population, enabling studies of known and rare SN types, detailed parameterization of their light curves, deep searches for new SN progenitor populations, the discovery of strongly lensed SNe, and the compilation of a large, well-characterized sample of superluminous SNe. We analyzed a sample of 22663 simulations of LSST light curves for core collapse SNe (CCSNe), modeled using the radiative transfer code STELLA. We analyzed this dataset with the software CASTOR, which enables the reconstruction of synthetic light curves and spectra via a machine learning technique that allows one to retrieve the complete parameter map of a SN. For each parameter we compared the observed and the true values, determining how LSST light curves alone will contribute to characterize the progenitor and the explosion. Our results indicate that LSST alone will not suffice for a comprehensive and precise characterization of progenitor properties and explosion parameters. The limited spectral coverage of LSST light curves (in most cases) does not allow for the accurate estimation of bolometric luminosity, and consequently, of the explosion energy and nickel yield. Additionally, the redshift-absorption degeneracy is difficult to resolve without supplementary information. These findings suggest that for the most interesting SNe, complementary follow-up observations using spectrographs and optical facilities (particularly in the infrared bands) will be essential for accurate parameter determination.\n\n", "2506.04066": "2025-06-04, **Europium, we have a problem. Modelling r-process enrichment across Local Group galaxies**, Marco Palla et.al., [2506.04066v1](http://arxiv.org/abs/2506.04066v1)\n\n Context: Europium (Eu) serves as a crucial tracer to understand the origin of rapid neutron-capture process (r-process) elements. An extensive effort was made in the last decade to model the chemical evolution of this element in the Galaxy. However, less attention was reserved to Eu in different galaxies of the Local Group (LG). Aims: By employing detailed and well-tested chemical evolution models, we investigate Eu enrichment across LG dwarf spheroidal galaxies, allowing for a direct comparison between model predictions for dwarf galaxies and the Milky Way (MW). Methods: Building upon an r-process enrichment framework that successfully reproduces the observed Eu abundance patterns as well as the supernova and compact binary merger rates in the MW, we build chemical evolution models for the Sagittarius, Fornax, and Sculptor dwarf spheroidal galaxies and test the enrichment scenario against the abundance patterns observed in these galaxies. Results: Models reproducing the Galactic Eu patterns significantly underestimate the [Eu/Fe] ratios observed in LG dwarfs. To address this \"missing Eu\" problem, we estimate the Eu production rate needed to match the observations and explore potential contributions either from prompt or delayed sources, assessing their compatibility with the MW observables. Conclusions: The same r-process enrichment frameworks cannot reproduce simultaneously the Eu patterns both in the MW and in dwarf galaxies. However, a scenario where additional Eu is provided by an increased production from delayed sources at low metallicity can theoretically reconcile the trends observed in the MW and in LG dwarfs, because of the small discrepancies (0.1 dex) between model predictions and observations found in this case. Further targeting and modelling of neutron-capture elements in LG galaxies are however needed to fill the gaps in our current understanding of the problem.\n\n", "2506.03955": "2025-06-04, **Test of conformal gravity as an alternative to dark matter from the observations of elliptical galaxies**, Li-Xue Yue et.al., [2506.03955v1](http://arxiv.org/abs/2506.03955v1)\n\n As an alternative gravitational theory to General Relativity (GR), the Conformal Gravity (CG) has recently been successfully verified by observations of Type Ia supernovae (SN Ia) and the rotation curves of spiral galaxies. The observations of galaxies only pertain to the non-relativistic form of gravity. In this context, within the framework of the Newtonian theory of gravity (the non-relativistic form of GR), dark matter is postulated to account for the observations. On the other hand, the non-relativistic form of CG predicts an additional potential: besides the Newtonian potential, there is a so-called linear potential term, characterized by the parameter $\\gamma^*$, as an alternative to dark matter in Newtonian gravity. To test CG in its non-relativistic form, much work has been done by fitting the predictions to the observations of circular velocity (rotation curves) for spiral galaxies. In this paper, we test CG with the observations from elliptical galaxies. Instead of the circular velocities for spiral galaxies, we use the velocity dispersion for elliptical galaxies. By replacing the Newtonian potential with that predicted by non-relativistic form of CG in Hamiltonian, we directly extend the Jeans equation derived in Newtonian theory to that for CG. By comparing the results derived from the ellipticals with that from spirals, we find that the extra potential predicted by CG is not sufficient to account for the observations of ellipticals. Furthermore, we discover a strong correlation between $\\gamma^*$ and the stellar mass $M^*$ in dwarf spheroidal galaxies. This finding implies that the variation in $\\gamma^*$ violates a fundamental prediction of Conformal Gravity (CG), which posits that $\\gamma^*$ should be a universal constant.\n\n", "2506.03836": "2025-06-04, **An independent estimate of H(z) at z = 0.5 from the stellar ages of brightest cluster galaxies**, S. Ilani Loubser et.al., [2506.03836v1](http://arxiv.org/abs/2506.03836v1)\n\n Several cosmological observations (e.g., Cosmic Microwave Background (CMB), Supernovae Type Ia, and local distance ladder measurements such as Cepheids) have been used to measure the global expansion rate of the Universe, i.e., the Hubble constant, $H\\_{0}$. However, these precision measurements have revealed tensions between different probes that are proving difficult to solve. Independent, robust techniques must be exploited to validate results or mitigate systematic effects. We use the Cosmic Chronometer (CC) method, which leverages the differential age evolution of passive galaxies, to measure $H(z)$, without any assumption of the underlying cosmology. Unlike previous CC studies, we used only brightest cluster galaxies (BCGs), the oldest and most massive galaxies in the Universe, to construct a pure and homogeneous sample. In this work we used a sample of 53 BCGs in massive, Sunyaev-Zel'dovich selected galaxy clusters (0.3 $< z <$ 0.7) with Southern African Large Telescope (SALT) spectroscopic observations. We used optical spectra to measure D4000$\\_{\\rm n}$ of the BCGs to obtain a new direct measurement of $H(z) = 72.1 \\pm 33.9(\\rm stat) \\pm 7.3$(syst) km s$^{-1}$ Mpc$^{-1}$ at $z=0.5$. By using BCGs, we significantly reduced the systematic errors to 10% by minimising the stellar mass and metallicity dependence of the method. The dominant uncertainty, and limitation for our study, is statistical, and we need larger, homogeneous samples of the oldest, most massive galaxies. By using the $Planck$+BAO prior of $\\Omega\\_{m}$ and $\\Omega\\_{\\Lambda}$, the projected Hubble constant is $H\\_{0}$ = $54.6 \\pm 25.7(\\rm stat) \\pm 5.5$(syst) km s$^{-1}$ Mpc$^{-1}$, consistent with both CMB and Cepheid measurements.\n\n"}}