{"neutrino": {"2512.04061": "2025-12-03, **Multimessenger Constraints on Supermassive Dark Stars and Their Black Hole Remnants**, Marco Manno et.al., [2512.04061v1](http://arxiv.org/abs/2512.04061v1)\n\n Dark matter (DM) annihilation can power the first generation of stars as long lived dark stars (DSs) that grow to supermassive scales $M\\_{\\rm DS}\\gtrsim 10^{5} M\\_{\\odot}$ and eventually collapse into heavy black holes that could seed the supermassive black holes observed at high redshifts. We compute the diffuse electromagnetic emission from a cosmological population of such supermassive DSs and their black hole remnants, tracking the entire DS history and including thermal surface radiation, DM annihilation in adiabatically contracted halos as well as late-time emission from DM overdensity spikes around the resulting black holes. After accounting for photon attenuation, we find that DS related contributions can exceed the Fermi-LAT extragalactic $γ$-ray background for thermal relic annihilation cross-sections and DM masses below $\\sim 1$ TeV. Our results constitute the first population integrated diffuse multimessenger constraints on supermassive DSs as progenitors of early black holes and demonstrate that diffuse photon and neutrino backgrounds offer a powerful and complementary avenue for probing the role of DM in the formation of the earliest massive structures.\n\n", "2512.03809": "2025-12-03, **Discrete flavour and CP symmetries in light of JUNO and neutrino global fit**, Gui-Jun Ding et.al., [2512.03809v1](http://arxiv.org/abs/2512.03809v1)\n\n Working within the reference three-neutrino mixing framework, we confront the lepton mixing predictions derived using non-Abelian discrete flavour and CP symmetries with the firs JUNO data on the solar neutrino mixing parameters $\\sin^2θ\\_{12}$ and with the results of the latest global neutrino data analysis. We focus on symmetry breaking patterns for which the lepton PMNS mixing matrix depends only on one or two free real parameters. Performing a comprehensive statistical analyses in each of the considered cases, we report the best fit values, the $3σ$ C.L. allowed ranges and the $χ^2$-distributions of the lepton mixing observables - the three mixing angles and the three CP-violation phases. We find that the JUNO measurements can disfavour or rule out a number of the mixing patterns associated with specific types of breakings of the discrete flavour and CP symmetries. The synergy of JUNO, DUNE and T2HK data can provide an exhaustive test of the considered approach to lepton mixing based on non-Abelian discrete lepton flavour symmetries combined with the CP symmetry.\n\n", "2512.03702": "2025-12-03, **Trapped fireshell (halo) of photons and pairs around black-hole horizon: source for ultra-high-energy particles**, She-Sheng Xue et.al., [2512.03702v1](http://arxiv.org/abs/2512.03702v1)\n\n We study the Compton-rocket effect of multi-photon interacting with electrons in an opaque fireball (or fire spot) of photons and $e^-e^+$ pairs at temperature $T\\_γ\\gg m\\_e$. We find the charged-particle acceleration and the avalanche runaway process, leading to a non-trivial probability of ultra-high-energy (UHE) electrons and protons, which subsequently produce very-high-energy (VHE) photons and neutrinos. We show such peculiar dynamics using the Gamma-Ray Burst central engine fireball, whose inner part inflows and forms a gravitationally trapped fireshell (halo) around a black hole. The halo is a metastable, cooling via UHE particle emissions and blackbody radiation. We calculate the UHE particle luminosity varying in time, and discuss the peculiar features of such produced UHE particles, which lead to VHE particles, in connection with possible numerical simulations, observations and experiments.\n\n", "2512.03447": "2025-12-03, **Neutrino-dominated relativistic shocked accretion flow around rotating black hole: implications for short gamma-ray bursts**, Amit Kumar et.al., [2512.03447v1](http://arxiv.org/abs/2512.03447v1)\n\n We investigate the physical properties of the central engine powering gamma-ray bursts (GRBs), modelled as a stellar-mass black hole accreting via a neutrino-dominated accretion flow (NDAF). By solving the governing hydrodynamic equations, we obtain global transonic NDAF solutions featuring shock transitions and examine their role in powering GRB energetics. The NDAF solutions are explored over a broad range of black hole parameters, including its mass ($M\\_{\\rm BH}$) and spin ($a\\_{\\rm k}$), and accretion rate ($\\dot{M}$). We find that shocked NDAFs can naturally account for the observed diversity in GRB energy output. Incorporating results from numerical simulations of binary neutron star and black hole-neutron star mergers, we estimate the remnant black hole mass and spin parameters for the predicted range of post-merger disk mass ($M\\_{\\rm disk}$). Our analysis reveals that small-mass black holes with relatively low spin values can adequately reproduce the luminosities of short GRBs (SGRBs), whereas identical GRB luminosities can also be achieved for more massive black holes possessing higher spin values. Finally, we uncover a robust correlation between the black hole spin and disk mass such that $M\\_{\\rm disk}$ decreases with increasing $a\\_{\\rm k}$, remaining largely independent of the black hole mass ($M\\_{\\rm BH}$) powering GRBs.\n\n", "2512.03411": "2025-12-03, **Conformal Holographic Dark Energy**, Mario A. Rodríguez-Meza et.al., [2512.03411v1](http://arxiv.org/abs/2512.03411v1)\n\n Recent results from the DESI collaboration suggest a preference for an evolving dark energy (DE) component rather than a cosmological constant, motivating the exploration of alternative models for the background expansion. These data also reveal tension in the inferred matter density parameter -lower in DESI and higher in Planck- as well as a neutrino mass posterior that approaches the lower bounds permitted by oscillation experiments. In this work, we propose and test a conformal holographic DE (CHDE) model in which the DE density depends on a power law of the conformal time, characterized by an exponent (n). This formulation introduces a single additional parameter relative to LambdaCDM and reduces to it in the limit n = 0. We confront the CHDE model with BAO, CMB, and supernova datasets, following the same combinations used by DESI, and perform parameter inference under both flat and non-flat cosmologies. Our analyses show that LambdaCDM is not favored as the best-fit model when using CMB data alone or in joint analyses including BAO and SNla, and it is disfavored at the 4.4 sigma level for non-flat model and 4.5 sigma for the flat model. We obtain consistent values of n= -0.28 to -0.32 with uncertainties less than +-0.1 across multiple data combinations. Similar to LambdaCDM, the CHDE model predicts a lower matter density when employing DESI data instead of Planck data. This, in turn, influences the neutrino mass constraints, yielding values close to the minimal allowed range. Despite these dataset-dependent tensions, both the flat and curved CHDE models remain compatible with neutrino mass constraints from terrestrial experiments and yield posterior distributions that peaks at positive values. This behavior avoids the issue encountered in the LambdaCDM model, where the posterior peaks at negative mass values.\n\n", "2512.03302": "2025-12-02, **Lepton number violation from Higgs/$Z$ decays into a pair of right-handed neutrinos**, Arindam Das et.al., [2512.03302v1](http://arxiv.org/abs/2512.03302v1)\n\n We explore signatures of Lepton Number Violation (LNV) from decays of the discovered Higgs ($h$) and Z bosons into a pair of Right-Handed Neutrinos (RHNs). Due to the Majorana nature of RHNs, the final state can be the same-sign dilepton plus jets leading to 2 units of LNV. As a simple but plausible scenario, we investigate such a signal in models with a new $U(1)\\_X$ gauge symmetry which naturally introduces three RHNs for gauge anomaly cancellation, and is spontaneously broken down by a vacuum expectation value of an isospin singlet scalar field ($φ$). In this scenario, $h$ and the Z boson can decay into a pair of RHNs via the $h$-$φ$ mixing and the $Z$-$Z'$ mixing with $Z'$ being a new massive gauge boson, respectively. Estimating the LNV signal and corresponding backgrounds for the $\\ell^{\\pm} \\ell^{\\pm} 4j$ final states, we find bounds on the $h$-$φ$ mixing and the $Z$-$Z^\\prime$ mixing as a function of a mass of RHNs at Higgs factories, e.g., at High-Luminosity LHC with $\\sqrt{s}=$ 14 TeV, future $e^-e^+$ colliders at $\\sqrt{s}=$ 250 GeV, muon colliders at $\\sqrt{s}=$ 125 GeV as well as at Z factories, e.g., CEPC and FCC-ee at $\\sqrt{s}=$ 91.2 GeV. We also discuss limits on the scalar mixing at $e^-μ^+$ and $μ^+ μ^+$ collisions ($μ$TRISTAN) with $\\sqrt{s}=$346 GeV/775 GeV and 2 TeV, respectively.\n\n", "2512.02854": "2025-12-02, **From Dark Sectors to the Axion-Neutrino Connection**, H. B. Câmara et.al., [2512.02854v1](http://arxiv.org/abs/2512.02854v1)\n\n The Standard Model (SM) of particle physics provides a successful description of fundamental particles and their interactions but fails to explain phenomena such as neutrino oscillations, dark matter (DM), and the baryon asymmetry of the Universe. These clear signs of BSM physics motivate extensions introducing new particles and symmetries. Theoretical questions like the flavor puzzle and the strong CP problem further guide BSM frameworks. This thesis explores BSM scenarios based on two guiding principles: constructing unified frameworks that address multiple open problems in (astro)particle physics and cosmology, and emphasizing their experimental testability through detailed phenomenological analyses. This approach uncovers deep connections between seemingly disconnected sectors, offering a more complete view of fundamental physics. We investigate dark sector models for the origin of neutrino masses, proposing a novel setup: dark linear seesaw, which radiatively links neutrino mass generation to DM candidates and predicts charged lepton flavor violation. In these scenarios, dark sector particles can constitute WIMP DM, testable via direct detection experiments. We study spontaneous CP violation induced by a complex scalar singlet, acting as a common origin of low- and high-energy CP violating effects relevant for leptogenesis. We also analyze a Nelson-Barr model that solves the strong CP problem, generates a realistic CKM matrix radiatively, and yields scalar WIMP DM. Additionally, we present unified axion frameworks in which a colored sector radiatively generates neutrino masses. These models predict distinctive axion couplings to photons and fermions and accommodate axion DM in both pre- and post-inflationary cosmologies. Finally, we explore minimal flavored Peccei-Quinn symmetries that link the flavor puzzle, neutrino masses and DM within a predictive and testable framework.\n\n", "2512.02773": "2025-12-02, **Leptophilic Gauge Interactions in the SMEFT Era**, Seyit Okan Kara et.al., [2512.02773v1](http://arxiv.org/abs/2512.02773v1)\n\n We develop a \"precision-ready\", model-independent EFT framework that connects general leptophilic gauge interactions to their low-energy manifestations in SMEFT and LEFT. Starting from a broad U(1)'\\_ell extension in which leptons carry family-dependent charges (q\\_e, q\\_mu, q\\_tau) while quarks remain neutral, quantum consistency is ensured through a minimal set of vectorlike leptons, chiral under U(1)'\\_ell but vectorlike under the SM, together with singlet scalars responsible for symmetry breaking and the masses of both Z\\_ell and the heavy leptons. In the heavy-mediator limit, we integrate out Z\\_ell at tree level and derive compact, analytic SMEFT Wilson coefficients for four-lepton operators and Higgs-current structures, including hypercharge-U(1)'\\_ell kinetic mixing proportional to Tr(Y Q'). Renormalization-group evolution down to the electroweak scale and matching onto LEFT produce closed-form expressions directly applicable to e+e- -> l+l-, neutrino trident production, nu e scattering, parity-violating Moeller observables, and muon-decay parameters. A single parameter combination, Lambda\\_eff = M\\_Zell / (g\\_ell * sqrt(\\|q q'\\|)), governs all leading EFT signatures, offering a unified way to map UV charge assignments onto precision observables. We delineate the validity domain of this EFT and outline its use as a \"plug-and-play\" interface for global fits, collider recasts, and future-collider projections.\n\n", "2512.02733": "2025-12-02, **Heavy sterile neutrinos in $B$ decays and new QCD corrections to their semi-hadronic decay rates**, Tim Kretz et.al., [2512.02733v1](http://arxiv.org/abs/2512.02733v1)\n\n In modern experiments on flavour physics it is possible to search for the decays of $B$ or $D$ mesons or $τ$ leptons into final states with heavy neutrinos $N$ (a.k.a. heavy neutral leptons). I present a common study of theorists and experimentalists from Belle II on constraints on $B \\rightarrow D^{*} \\ell N$. Next I discuss the status of the theory predictions of the various $N$ decay rates. In scenarios in which $N$ interacts with SM particles only through sterile-active neutrino mixing, the dependence of the lifetime on the relevant mixing angles is important to determine whether $N$ decays in the detector or outside. To calculate the inclusive decay rate into semi-hadronic final states reliably one needs to include radiative QCD corrections. I present analytic results for the QCD-corrected decay rates and discuss their phenomenological impact.\n\n", "2512.02672": "2025-12-02, **Exploring Leptogenesis, WIMP Dark Matter, and Gravitational Waves in an extended Scalar Framework**, Subhaditya Bhattacharya et.al., [2512.02672v1](http://arxiv.org/abs/2512.02672v1)\n\n We explore extensions of type I seesaw framework with a scalar mediator ($Φ$) connecting to a complex scalar dark field ($S$), and right handed neutrinos ($N\\_i$), with an aim to correlate neutrino mass generation, leptogenesis, and dark matter. $\\mathcal{Z}\\_4\\times CP$ turns out to be a phenomenologically viable choice of the extended symmetry, which can accommodate a dimension five effective interaction $\\bar{l}\\_L^α\\tilde{H}ΦN\\_i$, involving the SM lepton isodoublet ${l}\\_L$, and Higgs $H$; prohibiting the canonical Yukawa term $\\bar{l}\\_L^α\\tilde{H} N\\_i$. The $\\mathcal{Z}\\_{4}$ symmetry is spontaneously broken via the vacuum expectation value (VEV) of the $Φ$ filed, which directly affects neutrino mass generation and leptogenesis; while the $CP$ symmetry stabilises one component of $S$, making it a viable dark matter candidate. The discrete symmetry breaking creates domain wall, which needs to be annihilated before the over-closure of the Universe. This paves the way for gravitational wave signal associated with the model set up, which probes the symmetry breaking scale, and indirectly connects to the other phenomena.\n\n", "2512.02656": "2025-12-02, **KM3NeT/ARCA stacking search for high-energy neutrinos from blazars**, Francesco Carenini et.al., [2512.02656v1](http://arxiv.org/abs/2512.02656v1)\n\n Blazars are promising targets for neutrino astronomy, as highlighted by IceCube's identification of TXS 0506+056 as a cosmic neutrino source candidate. High-frequency-peaked BL Lacs (HBLs) stand out due to their characteristic electromagnetic high-energy emission properties, which makes them as well promising candidates for the production of high-energy neutrinos. Such neutrinos could be detected by KM3NeT/ARCA, a next-generation deep-sea Cherenkov detector under construction in the Mediterranean Sea. This contribution presents the results of a binned likelihood stacking analysis investigating high-energy neutrino emissions from a subset of HBLs. A total of 232 sources have been selected from the 3HSP catalogue and targeted in the analysis of KM3NeT/ARCA data taken with several detector configurations, specifically in the period in which from 6 to 21 detection units were deployed. The analysis is based on neutrino emission models of blazars developed using the LeHa-Paris numerical code, which simulates the spectral energy distribution of jetted active galactic nuclei.\n\n", "2512.02317": "2025-12-02, **Rare Event Searches Using Cryogenic Detectors via Direct Detection Methods**, S. Das et.al., [2512.02317v1](http://arxiv.org/abs/2512.02317v1)\n\n Cryogenic detectors are at the forefront of rare-event search experiments, including direct detection of dark matter, coherent elastic neutrino-nucleus scattering, neutrinoless double-beta decay, and searches for fractionally charged particles. Their unique ability to achieve ultra-low energy thresholds, typically O(eV-100 eV), together with excellent energy resolution and effective background suppression, makes them sensitive to extremely faint signals from rare interactions. These rare particle interactions produce phonons, ionization, or scintillation, depending on the target medium, which are registered by specialized sensors and converted into measurable signals. This review summarizes the underlying detection principles, surveys major experiments and recent results, examines forthcoming initiatives, and outlines the evolving role of cryogenic detectors in advancing the frontiers of rare-event physics.\n\n"}, "dark matter": {"2512.04080": "2025-12-03, **The effect of baryons on the positions and velocities of satellite galaxies in the MTNG simulation**, Sergio Contreras et.al., [2512.04080v1](http://arxiv.org/abs/2512.04080v1)\n\n Mock galaxy catalogues are often constructed from dark-matter-only simulations based on the galaxy-halo connection. Although modern mocks can reproduce galaxy clustering to some extent, the absence of baryons affects the spatial and kinematic distributions of galaxies in ways that remain insufficiently quantified. We compare the positions and velocities of satellite galaxies in the MTNG hydrodynamic simulation with those in its dark-matter-only counterpart, assessing how baryonic effects influence galaxy clustering and contrasting them with the impact of galaxy selection, i.e. the dependence of clustering on sample definition. Using merger trees from both runs, we track satellite subhaloes until they become centrals, allowing us to match systems even when their z=0 positions differ. We then compute positional and velocity offsets as functions of halo mass and distance from the halo centre, and use these to construct a subhalo catalogue from the dark-matter-only simulation that reproduces the galaxy distribution in the hydrodynamic run. Satellites in the hydrodynamic simulation lie 3-4% closer to halo centres than in the dark-matter-only case, with an offset that is nearly constant with halo mass and increases toward smaller radii. Satellite velocities are also systematically higher in the dark-matter-only run. At scales of 0.1 Mpc/h, these spatial and kinematic differences produce 10-20% variations in clustering amplitude -corresponding to 1-3$σ$ assuming DESI-like errors- though the impact decreases at larger scales. These baryonic effects are relevant for cosmological and lensing analyses and should be accounted for when building high-fidelity mocks. However, they remain smaller than the differences introduced by galaxy selection, which thus represents the dominant source of uncertainty when constructing mocks based on observable quantities.\n\n", "2512.03919": "2025-12-03, **Primordial Gravitational Wave Birefringence in a de Sitter Background with Chern-Simons Coupling**, Abhishek Rout et.al., [2512.03919v1](http://arxiv.org/abs/2512.03919v1)\n\n In this work, we investigate tensor perturbations in a de Sitter background within the framework of Chern-Simons modified gravity. We introduce transverse-traceless perturbations and analyze how the Chern-Simons Cotton tensor induces parity-violating modifications to gravitational wave propagation, while the Pontryagin density vanishes at linear order. Using a mode decomposition of the scalar background field, we derive the sub- and super-horizon limits of the wave equations and uncover chiral corrections in the dispersion relations of tensor modes. The resulting birefringence exhibits both amplitude and velocity components, alternating with the phase of the scalar field. Particular solutions sourced by the scalar background show helicity-dependent amplification and a characteristic scaling of the radiated flux that reduces smoothly to the Minkowski limit. The accumulated phase difference between right- and left-handed modes grows quadratically inside the horizon and becomes frozen outside, leaving a permanent parity-violating imprint in the primordial tensor spectrum. Finally, by promoting the Chern-Simons field to a massive dark matter candidate, we demonstrate how its mass-dependent dynamics connect gravitational birefringence to axion-like dark matter phenomenology.\n\n", "2512.03567": "2025-12-03, **Probing the Electroweak Phase Transition in the Dark Sector**, Maimoona Razzaq et.al., [2512.03567v1](http://arxiv.org/abs/2512.03567v1)\n\n We study an extension of the Standard Model with a dark SU(2) gauge group, where a dark scalar doublet interacts with the Standard Model Higgs through a portal coupling, inducing mixing after symmetry breaking. A custodial symmetry ensures the stability of the dark gauge bosons, making them viable dark matter candidates. Scanning the parameter space of the model under collider and astrophysical constraints, we find regions that yield the observed relic density and strong first-order phase transitions. The resulting gravitational-wave signals fall within the reach of upcoming space-based detectors.\n\n", "2512.03561": "2025-12-03, **Feeding a Kerr black hole with quantized vortices**, Shilong Jin et.al., [2512.03561v1](http://arxiv.org/abs/2512.03561v1)\n\n By solving a nonlinear Klein-Gordon equation in Kerr geometry, we uncover new phenomena and key characteristics of quantized vortices in quantum fluids near a Kerr black hole. The formation of these vortices induces rotational or turbulent flows, which profoundly alter the fluid properties and revise those dark matter models describing axion condensates, ultralight boson clouds, and other scalar fields in the vicinity of spinning black holes. As macroscopic, quantum, and topological defects, these vortices can stably orbit the black hole over extended periods, establishing their viability as novel probes for investigating black hole physics. For instance, we calculate the angular velocities of orbiting vortices to quantitatively characterize the frame-dragging effect, a classic prediction of general relativity. Additionally, we observe that relatively large vortices are accreted onto the black hole, wrapping around it while undergoing splitting and reconnecting processes. In quantum fluids with high vortex densities, turbulent flows emerge, accompanied by the formation of a vortex boundary layer near the event horizon. Beyond the ergosphere, we find vortex emissions and energetic outbursts, which may provide crucial insights into analogous astrophysical events recently discovered by the XRISM satellite.\n\n", "2512.03357": "2025-12-03, **BEC vortices as an observational signature of ultra-light bosonic dark matter**, Rongzi Zhou et.al., [2512.03357v1](http://arxiv.org/abs/2512.03357v1)\n\n Ultra-light bosonic dark matter (ULDM) is an interesting and promising dark matter candidate. While the wave-like nature of ULDM has been widely studied in the literature, we explore another distinctive feature of ULDM as Bose-Einstein Condensate (BEC) in this paper: the emergence of vortices in a rotating BEC-ULDM halos. Using numerical solution of the GPP equation, we demonstrate that a lattice of vortices ,underdensity columns that carry angular momentum, naturally forms in a ULDM halo under conditions similar to those of the Milky Way. Furthermore, we study the gravitational lensing by these vortices as a possible observational signature of BEC-ULDM. If the vortices are large enough and the halo's rotational axis align with the line of sight, regularly separated brightness anomalies can be produced, providing strong evidence for BEC-ULDM.\n\n", "2512.03348": "2025-12-03, **Forecasts for lifetime and fraction of Decaying Dark Matter based on redshift distortions from Euclid and BOSS**, Javier Juárez-Jiménez et.al., [2512.03348v1](http://arxiv.org/abs/2512.03348v1)\n\n In this work we forecast constraints on models of decaying dark matter (DCDM) by using redshift-space-distortion (RSD) measurements implemented in a Fisher information matrix. In particular, we focus on the fraction of unstable dark matter, $α\\_{\\mathrm{dcdm}}$ respect to the ordinary CDM component, and the decay rate, $Γ\\_{\\mathrm{dcdm}}$ as the key parameters of the model. Fiducial values are derived from a MontePython MCMC analysis. The derivatives of the growth-related observable, $fσ\\_8(z)$ with respect to the parameters are numerically around the fiducial model. For the Fisher analysis, we employ mock data designed for upcoming surveys, particularly Euclid and BOSS, where RSD measurements yield constraints on $fσ\\_8.$ Our results show that when both stable and unstable components are allowed, constrains on the DCDM lifetime remain weak, with $τ\\_{\\mathrm{dcdm}}>1.18$ Gyr. In the limiting case of fully unstable dark matter ($α\\_{\\mathrm{dcdm}}=1$), the uncertainty improves to $τ\\_{\\mathrm{dcdm}}>235.89$ Gyr. Our findings highlight the potential of RSD probes in testing and complementing decaying dark matter scenarios.\n\n", "2512.03231": "2025-12-02, **The DESI DR1 Peculiar Velocity Survey: Growth Rate Measurements from the Galaxy Power Spectrum**, F. Qin et.al., [2512.03231v1](http://arxiv.org/abs/2512.03231v1)\n\n The large-scale structure of the Universe and its evolution encapsulate a wealth of cosmological information. A powerful means of unlocking this knowledge lies in measuring the auto-power spectrum and/or the cross-power spectrum of the galaxy density and momentum fields, followed by the estimation of cosmological parameters based on these spectrum measurements. In this study, we generalize the cross-power spectrum model to accommodate scenarios where the density and momentum fields are derived from distinct galaxy surveys. The growth rate of the large-scale structures of the Universe, commonly represented as $fσ\\_8$, is extracted by jointly fitting the monopole and quadrupole moments of the auto-density power spectrum, the monopole of the auto-momentum power spectrum, and the dipole of the cross-power spectrum. Our estimators, theoretical models and parameter-fitting framework have been tested using mocks, confirming their robustness and accuracy in retrieving the fiducial growth rate from simulation. These techniques are then applied to analyze the power spectrum of the DESI Bright Galaxy Survey and Peculiar Velocity Survey, and the fit result of the growth rate is $fσ\\_8=0.440^{+0.080}\\_{-0.096}$ at effective redshift $z\\_{\\rm eff}=0.07$. By synthesizing the fitting outcomes from correlation functions, maximum likelihood estimation and power spectrum, yields a consensus value of $fσ\\_8(z\\_{\\rm eff}=0.07) = 0.450 ^{+0.055}\\_{-0.055}$, and correspondingly we obtain $γ=0.580^{+0.110}\\_{-0.110}$, $Ω\\_\\mathrm{m}=0.301^{+0.011}\\_{-0.011}$ and $σ\\_8=0.834^{+0.032}\\_{-0.032}$. The measured $fσ\\_8$ and $γ$ are consistent with the prediction of the $Λ$ Cold Dark Matter Model and General Relativity.\n\n", "2512.03178": "2025-12-02, **TDCOSMO. XXIV. Measurement of the Hubble constant from the doubly lensed quasar HE1104-1805**, Eric Paic et.al., [2512.03178v1](http://arxiv.org/abs/2512.03178v1)\n\n Time-delay cosmography leverages strongly lensed quasars to measure the Universe's current expansion rate, H\\_0, independently from other methods. While the latest TDCOSMO results relied mainly on quadruply lensed quasars, doubly lensed systems are far more common and offer precise time delays, potentially enlarging the usable sample by a factor of five and enabling percent-level constraints on H\\_0. We present the first TDCOSMO analysis of a doubly imaged source, HE1104-1805, including the measurement of the four necessary ingredients. First, by combining 17 years of data from the SMARTS, Euler and WFI telescopes, we measure a time delay of 176.3\\pm 10.8 days. Second, using MUSE data, we extract stellar velocity dispersion measurements in three radial bins with up to 5% precision. Third, employing F160W HST imaging for lens modelling and marginalising over various modelling choices, we measure the Fermat potential difference between the images. Fourth, using wide-field imaging, we measure the convergence added by objects not included in the lens modelling. Hence, we measure the time delay distance and the angular diameter distance to the deflector, favouring a power-law mass model over a baryonic and dark matter composite model. The measurement was performed blindly and yielded H\\_0 = 64.2^{+5.8}\\_{-5.0} x $λ\\_{int} km s^{-1} Mpc^{-1}, where λ\\_{int} is the internal mass sheet degeneracy parameter. This is in agreement with the TDCOSMO-2025 milestone and its precision for λ\\_{int}=1 is comparable to that obtained with the best-observed quadruply lensed quasars (4-6%). This work is a stepping stone towards a precise measurement of H\\_0 using a large sample of doubly lensed quasars, supplementing the current sample. The next TDCOSMO milestone paper will include this system in its hierarchical analysis, constraining λ\\_{int} and H\\_0 jointly with multiple lenses.\n\n", "2512.03155": "2025-12-02, **From scalar clouds around evaporating black holes to boson star**, Daniel Neves et.al., [2512.03155v1](http://arxiv.org/abs/2512.03155v1)\n\n We study, for the first time, the evolution of a scalar cloud bound to an evaporating black hole. Our simulations of the associated Schrödinger-Poisson system for non-relativistic and spherically symmetric clouds reveal that a scalar cloud may (partially) survive as a self-gravitating boson star if the black hole evaporates adiabatically until its mass becomes less than one half of the cloud's mass. This yields a novel mechanism for boson star formation and shows that, as previously conjectured, bosonic dark matter production by light primordial black holes may result in micro-boson stars with very large occupation numbers, greatly enhancing their potential detectability even for very weakly interacting dark matter particles.\n\n", "2512.03153": "2025-12-02, **Heavy Long-lived Dark Vector Via a Gluonic Portal**, Xiaoyong Chu et.al., [2512.03153v1](http://arxiv.org/abs/2512.03153v1)\n\n We study a dark gauge boson $ Z' $ that exclusively couples to the QCD gluons through higher dimensional operators. These operators are generated from integrating out of heavy ultraviolet resonances carrying both QCD and dark gauge charges. With $ SU(3)\\_C $ gauge invariance, charge and parity symmetries preserved, we find that the leading effective operators are restricted to have the form of $ Z'GGG $ and $ Z'Z'GG $ at dimension-eight, which can naturally render the $Z^\\prime$ particle long-lived, and serve as a viable dark matter candidate. We investigate the phenomenology of these operators with both collider experiments and cosmological observation, without and with the assumption that this dark gauge boson plays the role of the dominant dark matter component. For an unstable $Z'$, we show that depending on its lifetime, it can be probed by various observables up to ultraviolet physics scale around $10^9$ GeV. For $Z'$ being dark matter, we find that $m\\_{Z^\\prime} \\gtrsim 1 $ TeV is consistent with the thermal freeze-out scenario. In contrast, in the freeze-in scenario, the extremely small couplings leave the relevant parameter space largely unconstrained by current experiments.\n\n", "2512.03150": "2025-12-02, **Joint JWST-DECam Lensing Reveals That the Bullet Cluster Is a Minor Merger**, Boseong Young Cho et.al., [2512.03150v1](http://arxiv.org/abs/2512.03150v1)\n\n We present the first robust virial masses of the Bullet Cluster's three individual components from a joint weak+strong lensing analysis combining JWST/NIRCam and DECam observations. Despite its status as the benchmark system for dark matter and merger studies, inferred mass ratios for the Bullet Cluster have spanned a wide range from $\\sim$2:1 to $\\gtrsim$10:1 over more than two decades. We revisit this tension through three key advances: (1) JWST's exceptional data quality enables us to resolve three distinct halos, (2) DECam's wide-field coverage beyond its virial radius eliminates the need for extrapolation, and (3) high-fidelity strong-lensing priors mitigate weak-lensing model bias. We obtain $M\\_{200c} = 15.11^{+2.48}\\_{-2.10} \\times 10^{14}M\\_{\\odot}$ for the main cluster and $1.49^{+0.32}\\_{-0.25} \\times 10^{14}M\\_{\\odot}$ for the subcluster, yielding a mass ratio of $10.14^{+3.22}\\_{-2.47}$, definitively classifying the Bullet Cluster as a minor merger. This result reconciles the long-standing tension in the mass ratio and provides updated initial parameters for future modeling of this iconic system.\n\n", "2512.03133": "2025-12-02, **A Thermal Relic Encyclopedia: Dark Matter Candidates Coupled to Quarks**, Dan Hooper et.al., [2512.03133v1](http://arxiv.org/abs/2512.03133v1)\n\n Thermal freeze-out is a compelling framework for naturally generating the dark matter abundance. We systematically study a broad range of dark matter and mediator particle combinations that can viably realize thermal freeze-out, focusing on models in which the mediator couples to Standard Model quarks. In each case, we calculate the relic density and consider existing constraints from accelerators, cosmology, direct detection, and indirect detection over the full range of dark matter and mediator masses. We present an encyclopedic catalog of matrix elements, cross sections, and decay rates which can be used as a reference for future studies of dark matter phenomenology.\n\n", "2512.03132": "2025-12-02, **The DREAMS Project: Disentangling the Impact of Halo-to-Halo Variance and Baryonic Feedback on Milky Way Dark Matter Density Profiles**, Alex M. Garcia et.al., [2512.03132v1](http://arxiv.org/abs/2512.03132v1)\n\n Astrophysical searches for dark matter in the Milky Way require a reliable model for its density distribution, which in turn depends on the influence of baryonic feedback on the Galaxy. In this work, we utilize a new suite of Milky Way-mass halos from the DREAMS Project, simulated with Cold Dark Matter (CDM),to quantify the influence of baryon feedback and intrinsic halo-to-halo variance on dark matter density profiles. Our suite of 1024 halos varies over supernova and black hole feedback parameters from the IllustrisTNG model, as well as variations in two cosmological parameters. We find that Milky Way-mass dark matter density profiles in the IllustrisTNG model are largely insensitive to astrophysics and cosmology variations, with the dominant source of scatter instead arising from halo-to-halo variance. However, most of the (comparatively minor) feedback-driven variations come from the changes to supernova prescriptions. By comparing to dark matter-only simulations, we find that the strongest supernova wind energies are so effective at preventing galaxy formation that the halos are nearly entirely collisionless dark matter. Finally, regardless of physics variation, all the DREAMS halos are roughly consistent with a halo contracting adiabatically from the presence of baryons, unlike models that have bursty stellar feedback. This work represents a step toward assessing the robustness of Milky Way dark matter profiles, with direct implications for dark matter searches where systematic uncertainty in the density profile remains a major challenge.\n\n", "2512.03006": "2025-12-02, **Modeling dark matter halos with self-interacting fermions**, Fabian Hernandez-Gutierrez et.al., [2512.03006v1](http://arxiv.org/abs/2512.03006v1)\n\n In this work we study the possibility of modeling the dark matter content in galaxies as a core-halo model consisting of self-gravitating, self-interacting fermions. For the core of the halo, the dark matter fermions are degenerate, while for the halo we have considered two possibilities: the fermions have thermalized as a perfect fluidor they will follow a standard cold dark matter Navarro-Frenk-White profile. The core density profile is obtained by solving the Tolman-Oppenheimer-Volkoff equations, and their properties are determined by the fermion mass, the central density and the interaction strength. The mass of the fermion and the strength of the fermion self-interaction is fixed by doing a $χ^2$ analysis to fit that fit the rotational curves of Low Surface Brightness galaxies. It was found that the fermion mass should be in the range $38.73~\\rm{eV}< m\\_{f} < 42.11~\\rm{eV}$ and the interparticle strength in the range $269.69 < y <348.48$ at $68$ C.L. in order to reproduce the rotational curves adequately, in the case when the halo is modeled as a thermalized ideal gas. Similar values are obtained if the halo is modeled following a Navarro-Frenk-White case, namely $41.54 ~\\rm{eV} < m\\_{f} <49.87 ~\\rm{eV}$ and $5606.06< y < 17484.84$. Once fixed the values of the mass of the fermion $m\\_f$ and the interaction strength $y$, we tested the core-halo model with data from the Milky Way and the SPARC database. We have found good agreement between the data and the core-halo models, varying only one free parameter: the central density. Thus a single fermion can fit hundreds of galaxies. Nevertheless, the dark matter halo surface density relation or the halo total mass and radius depend strongly on the model for the halo.\n\n", "2512.02954": "2025-12-02, **The suppression of the matter power spectrum: strong feedback from X-ray gas mass fractions, kSZ effect profiles, and galaxy-galaxy lensing**, Jared Siegel et.al., [2512.02954v1](http://arxiv.org/abs/2512.02954v1)\n\n Baryon feedback redistributes gas relative to the underlying dark matter distribution and suppresses the matter power spectrum on small scales, but the amplitude and scale dependence of this effect are uncertain. We constrain the impact of baryon feedback on the matter power spectrum by jointly analysing X-ray gas mass fractions from the eROSITA and HSC-XXL samples and SDSS/DESI+ACT kinetic Sunyaev-Zel'dovich (kSZ) effect profiles; the samples are characterised with galaxy-galaxy lensing and together span group and cluster masses at $0<z<1$. Using the baryonification framework, our joint eROSITA and kSZ model gives precise constraints on the suppression of the matter power spectrum: $10 \\pm 2\\%$ at $k=1~h~\\mathrm{Mpc}^{-1}$. The inferred gas profiles are more extended and the power suppression is stronger than predicted by the fiducial models of recent hydrodynamical simulation suites, including FLAMINGO and BAHAMAS. The HSC-XXL gas mass fractions, which the fiducial simulations were calibrated to reproduce, prefer more moderate power suppression than the kSZ and eROSITA data: $5 \\pm 4\\%$ at $k=1~h~\\mathrm{Mpc}^{-1}$. With a simulated LSST Year 1 weak lensing analysis, we demonstrate a framework for next-generation surveys: calibrating feedback models with multi-wavelength gas observables to recover the small-scale statistical power of cosmic shear.\n\n", "2512.02900": "2025-12-02, **Interacting Generalized Chaplygin-Jacobi gas: Thermodynamics approach**, Gilberto Aguilar-Pérez et.al., [2512.02900v1](http://arxiv.org/abs/2512.02900v1)\n\n This work investigates a cosmological model featuring an interaction between dark energy and dark matter, where the dark energy component is described by the Generalized Chaplygin-Jacobi gas (GCJG). In this study, we establish a system in which the GCJG and a pressureless dark matter fluid exchange energy via a linear interaction term, $Q \\propto ρ\\_x$, being $ρ\\_{x}$ the dark energy density. By solving the conservation equations, we derive analytical expressions for the evolution of the dark energy and dark matter densities. The thermodynamic properties of this interacting system are then thoroughly analyzed. The thermodynamic analysis reveals that both dark components maintain positive temperatures, ensuring stability. Notably, the dark energy component transitions to a phantom regime in the past, a feature of interest for recent cosmological observations, without violating thermodynamic principles. The total entropy production is shown to be in agreement with the second law of thermodynamics. Furthermore, an analysis of the specific heats suggests that while the dark matter sector remains thermodynamically stable, the dark energy sector undergoes a late-time phase transition, consistent with its entering into the phantom domain at effective level.\n\n", "2512.02885": "2025-12-02, **Exciton spin structure in lead halide perovskite semiconductors explored via the spin dynamics in magnetic field**, Vladimir L. Zhiliakov et.al., [2512.02885v1](http://arxiv.org/abs/2512.02885v1)\n\n We theoretically investigate the spin structure and spin dynamics of excitons in bulk lead halide perovskite semiconductors with cubic, tetragonal, and orthorhombic crystal symmetry. The exciton spin structure and its modification by an external magnetic field are modeled for different regimes defined by the relative magnitude of the electron-hole exchange interaction (splitting between dark and bright states) and the Zeeman spin splitting. The effects of crystal symmetry and magnetic field orientation with respect to the crystal axes are considered for lead halide perovskite crystals with band gaps in the range 1.4 - 3.5 eV, having different ratios of electron and hole g-factors. For cubic symmetry, in a longitudinal magnetic field, our theory predicts quantum beats between the bright exciton states under linearly polarized excitation and detection, while the dark exciton remains optically inactive. In a transverse magnetic field, all exciton spin states become optically active and can be excited by circularly polarized light. Reduction of the crystal symmetry leads to a zero-field offset of the exciton Larmor precession frequencies, modifying the Zeeman splitting energy dependence on magnetic field. This theoretical framework allows for the extraction of the strength of the exchange interaction and the crystal symmetry. Experimentally, we measure the exciton spin coherence via time-resolved photoluminescence at a temperature of 1.6 K in longitudinal and transverse magnetic fields in orthorhombic MAPbI3 crystals. Polarization beats at the frequency of the bright exciton are observed in both configurations. Comparison with theory indicates that the excitons are in the strong exchange interaction regime, and the reduction of symmetry does not lead to a significant splitting of the exciton spin levels.\n\n", "2512.02871": "2025-12-02, **Limiting Reduction and Modified Gravity**, Antonis Antoniou et.al., [2512.02871v1](http://arxiv.org/abs/2512.02871v1)\n\n Modified Newtonian Dynamics (MOND) is a framework of theories that adjust Newton's laws of gravity to explain effects such as galactic rotation anomalies, offering an alternative to dark matter. This essay examines the justification of MOND by assessing its inter-theoretical relationship to established theories across relevant scales, in particular its connection to Newtonian gravitation. We argue that MOND fails a key condition for a theory's justification--what we call 'reduction-wise justification'--since it does not adequately reduce to Newtonian gravity in a fully non-arbitrary way. More precisely, despite satisfying the standard formal criteria for successful limiting reduction, MOND does not properly reduce to Newtonian gravitation because of (i) the absence of a fundamental theoretical framework to justify the interpolating function introduced in MOND and (ii) the lack of a unified mathematical structure working across all scales, independent of Newtonian theory. Hence, the case study of MOND provides crucial results for the general debate on inter-theoretic reduction in science: MOND's failure as a case of reduction highlights important limitations in standard accounts of limiting reduction. We respond by proposing a more refined framework for limiting reduction that introduces two additional criteria to better distinguish successful from pathological reductions. More broadly, this case illustrates how analysing reduction-wise justification can serve as a powerful tool for evaluating the validity of novel theories that are not yet empirically established.\n\n", "2512.02703": "2025-12-02, **Lepton Flavor Physics in the flipped 3-3-1-1 Model: Non-Universality and Violation**, D. T. Huong et.al., [2512.02703v1](http://arxiv.org/abs/2512.02703v1)\n\n We investigate the flavor violation (FV) of Z decays to leptons at tree level and flavor conserving Z decays to leptons in the frame work of the flipped $ SU(3)\\_C\\otimes SU(3)\\_L \\otimes U(1)\\_X\\otimes U(1)\\_N$,(F3311) model. In addition, we analyze the processes $l\\_i\\rightarrow l\\_j γ$ and the leptonic three-body decay. Using the experimental bounds on these decays we set the constraint on $\\sin φ$ which represents the mixing between Z-Z' boson. The most stringent limits arises from $μ\\rightarrow e γ$ decay where $\\sin φ\\sim \\mathcal{ O}(10^{-3})$. The leptonic three-body decay set lower bound on the mass of the new neural gauge boson $m\\_{Z'} \\geq 3.2TeV$. Using the LUX-ZEPLIN (LZ) experiment data we set bounds to the mass of the dark matter candidates.   Subsequently, we investigate the lepton non-universality in B decays within the $F3311$ model by calculating the generic one-loop contribution to the process $u\\_i\\rightarrow d\\_j e\\_b \\barν\\_a$ in the unitary gauge as well as numerical evaluating the branching ratio $R\\_D, R\\_{D^{(*)}},R(X\\_c)$. We demonstrate that the $F3311$ model can address the $3.3 σ$ discrepancies between Standard Model and experimental data. To reaffirm our results, we also analyze the $d \\to u$ transitions and $s\\to u$ transitions. These two transitions also give consistent result with experiment data. Combine all experiment dat a we obtain the operating region for the mass of the model   specifically $m\\_E \\in [6.5, 9 ]TeV$, $m\\_Q \\in [6,11]TeV$ and the dark matter candidate $m\\_ξ\\in [1.5,2 ]TeV$.\n\n", "2512.02434": "2025-12-02, **The exotic black hole-neutron star binaries in our Galaxy**, Man Ho Chan et.al., [2512.02434v1](http://arxiv.org/abs/2512.02434v1)\n\n It has been suggested that there are $\\sim 10^5$ black hole-neutron star (BH-NS) binaries in our Galaxy. However, despite the effort of intensive radio search for decades, none of these binaries has been found to date. These binaries are regarded as a holy grail of astronomy because they can greatly improve our understanding about relativistic systems of compact objects and fundamental physics. In this article, we propose the existence of exotic BH-NS binaries which can open a new way in searching the missing BH-NS binaries in our Galaxy. By considering the possible dark matter density spikes formed around the primordial black holes in the BH-NS binaries, we show that extremely high temperature ($\\sim 10^6$ K) could be maintained on the surface of the neutron stars due to effective dark matter capture. This interesting feature can also help reveal the nature of dark matter and possibly further improve the upper limit of dark matter scattering cross section well below $10^{-47}$ cm$^2$.\n\n"}, "supernova": {"2512.04010": "2025-12-03, **Hydrogen-Rich to Stripped-Envelope:Observational Continuity and Biases in CCSNe**, Anjasha Gangopadhyay et.al., [2512.04010v1](http://arxiv.org/abs/2512.04010v1)\n\n Although historically classified into discrete subclasses, there is growing evidence that indicates that core-collapse supernovae (CCSNe) categories often overlap, reflecting continuous variations in progenitor structure, mass-loss history, and circumstellar environments rather than strictly distinct channels. In this review, we explore the proposed continua that link hydrogen-rich Type II SNe to stripped-envelope explosions (IIb-Ib-Ic), and that extend further into interaction-dominated and superluminous events. We discuss the physical processes-stellar winds, binary interaction, eruptive outbursts, and circumstellar interaction-that may produce graded outcomes across classes, while highlighting where observational evidence supports or challenges smooth transitions. We propose that CCSNe are better viewed as a multidimensional continuum of explosion outcomes, where traditional subclasses act as reference points rather than strict boundaries. Future progress will rely on large, homogeneous datasets and advanced modeling to disentangle true evolutionary sequences from apparent overlaps, ultimately connecting progenitor pathways to the observed diversity of explosions\n\n", "2512.03957": "2025-12-03, **Line Polarization of Si II $λ$6355 Å in Type Ia Supernovae: A New Statistical Approach to Probe the Explosion Physics and Diversity**, Aleksandar Cikota et.al., [2512.03957v1](http://arxiv.org/abs/2512.03957v1)\n\n Spectropolarimetry provides a unique probe of ejecta asphericities, offering direct insights into the underlying explosion physics of Type Ia supernovae (SNe Ia). We analyze the statistical properties of pre-maximum spectropolarimetric data for 24 SNe Ia observed with VLT/FORS, focusing on the Si II $λ$6355 Åline. Previous studies have revealed a correlation between the peak Si II polarization degree and the expansion velocity. Here, we combine these observations with multi-dimensional non-LTE radiative transfer simulations. We consider two asphericity classes: (i) lopsided abundance distributions produced by off-center delayed-detonation transitions in near-$M\\_{Ch}$ white dwarfs or, for example, WD collisions (Class I), and (ii) global, axisymmetric density asphericities such as those arising from explosions of rapidly rotating WDs or mergers (Class II). Our model grid spans normal to subluminous SNe Ia and successfully reproduces the observed Si II velocity-polarization trend, with higher velocities associated with stronger asphericities. Consistent with observations, transitional SNe Ia and the faint end of the normal SNe Ia population show the highest Si II polarization and are best explained by Class I scenarios. In contrast, subluminous SNe Ia are dominated by Class II asphericities, characterized by lower Si II polarization but significant continuum polarization. The observed distribution of Si II polarization depends on both the observer's viewing angle $θ$ and the intrinsic asphericity. Statistical analysis of these spectropolarimetric snapshots enables the separation of Class I and Class II contributions and highlights the intrinsic diversity among SNe Ia. Our results imply viewing-angle-dependent luminosities in our local sample, which may have implications when using high-redshift SNe Ia as evidence for the need of non-standard cosmology.\n\n", "2512.03716": "2025-12-03, **The broad-lined Type Ic supernova 2020lao reveals an energetic explosion with no central-engine signatures**, M. D. Stritzinger et.al., [2512.03716v1](http://arxiv.org/abs/2512.03716v1)\n\n We present early-time observations of the broad-lined Type Ic supernova SN 2020lao, including optical spectroscopy beginning about 48 hr after the inferred explosion and extending to about 100 days. The explosion epoch is constrained with power-law fits to the rising TESS and ZTF light curves, with the first ZTF detection only about 27 hr after explosion. The optical light curves show a rapid 8.8 day rise and a peak luminosity typical of SNe Ic-BL (Mr=-18.5 mag). Unlike some engine-driven events, SN 2020lao shows no early optical excess or afterglow. The lack of a shock-cooling signature in the TESS/ZTF data constrains the progenitor to a compact Wolf Rayet-like star with radius of only a few solar radii. The spectra resemble those of the X-ray flash SN 2006aj but with higher velocities. Arnett modeling of the bolometric light curve, combined with Fe II velocities, yields a nickel mass of about 0.2 solar masses, an ejecta mass of about 3.2 solar masses, and a kinetic energy of about 23x10^51 erg, corresponding to a high specific kinetic energy of about 7x10^51 erg per solar mass. Spectral-synthesis modeling broadly reproduces the photospheric spectra and suggests a somewhat lower but still large specific kinetic energy (about 5 x 10^51 erg per solar mass). Although SN 2020lao and SN 2006aj produced similar 56Ni masses, SN 2020lao exhibits specific kinetic energies larger by a factor of several. Published VLA and Swift/XRT non-detections show no radio or X-ray afterglow, placing strong limits on relativistic ejecta and dense circumstellar material. Given its high specific kinetic energy, the absence of early excess emission and the radio/X-ray non-detections imply that any jet was either far off-axis or choked; otherwise, SN 2020lao represents an extreme non-relativistic SN Ic-BL.\n\n", "2512.03695": "2025-12-03, **The ANDICAM-SOFI Near-infrared and Optical type Ia Supernova (ASNOS) sample: Description and data release**, Kim Phan et.al., [2512.03695v1](http://arxiv.org/abs/2512.03695v1)\n\n Type Ia supernovae (SNe Ia) provide the most robust means of measuring extragalactic distances. While most of the effort has focused on increasing the number of SNe Ia observed in the optical, near-infrared (NIR) observations remain scarce despite their advantages, that is, reduced dust extinction and a more intrinsic standard candle behavior, requiring little to no empirical corrections. Here, we present ASNOS (ANDICAM-SOFI Near-infrared and Optical type Ia Supernova), a dataset with sample size of 1,482 epochs in the $BVRIYJH$ filters from the ANDICAM instrument on the 1.3-meter SMARTS telescope at Cerro Tololo Inter-American Observatory, along with 125 $JHK$ epochs from the SOFI instrument on the 3.58-meter New Technology Telescope on the La Silla Observatory. Additionally, we incorporate optical forced photometry from the Zwicky Transient Facility and the Asteroid Terrestrial-impact Last Alert System. The sample comprises 41 SNe Ia in total, including 29 normal events, eight 1991T-like objects, and four peculiar subtypes, all located at redshifts $z < 0.085$. This paper provides a detailed overview of the ASNOS sample selection, data reduction, SN photometry, host-galaxy spectral energy distribution construction, both global and local, and SN light-curve fitting using three methods: SALT3-NIR, SNooPy, and BayeSN. A companion paper will present the cosmological analysis.\n\n", "2512.03531": "2025-12-03, **The helium common-envelope wind scenario for SN 2020eyj**, Xiang-Cun Meng et.al., [2512.03531v1](http://arxiv.org/abs/2512.03531v1)\n\n SN 2020eyj is the first type Ia supernova (SN Ia) showing the signature of a compact helium-rich circumstellar material (CSM). Such a large CSM is difficult to explain in a single-degenerate scenario where the donor star is a helium star. Here we show that, under certain conditions, it is possible that the transfer of helium leads to a common envelope (CE) engulfing the system, similar to the common-envelope wind model proposed by Meng \\& Podsiadlowski (2017). If in such a helium common-envelope wind (HeCEW) model the initial white dwarf (WD) mass is larger than 1.1 $M\\_{\\rm \\odot}$ and the helium star more massive than 1.8 $M\\_{\\rm \\odot}$, the mass of a helium CE can be larger than 0.3 $M\\_{\\rm \\odot}$ prior to supernova explosion. The CE mass heavily depends on the initial parameters of the binary system. A dynamical CE ejection event could occur shortly before the supernova, and then our model may naturally explain the properties of SN 2020eyj, specifically the massive He-rich CSM, its dim peak brightness, low ejecta velocity and low birth rate.\n\n", "2512.03331": "2025-12-03, **Radio Detection of a Local Little Red Dot**, L. F. Rodriguez et.al., [2512.03331v1](http://arxiv.org/abs/2512.03331v1)\n\n Context. One of the most important discoveries by the James Webb Space Telescope (JWST) is the unexpected existence in the Early Universe (z > 4) of very large quantities of \"Little Red Dots\" (LRDs), compact luminous red galaxies of intriguing physical properties. Aims. We wish to know if LRDs may host accreting Intermediate/Supermassive Black Holes (IMBHs/SMBHs) that may power LRDs, and compare them with the effect of clusters of massive stars. The spectrum of radio emission (synchrotron vs thermal) can be used to know which between these two types of energy sources is the dominant one. Methods. So far LRDs at high redshifts have not been detected at radio wavelengths and it is not known why. Assuming this could be due to their large distances and/or present limitations of observational capabilities, we analyze here archive Very Large Array radio observations of two analog candidates of LRDs in the Local Universe (LLRDs) at redshifts z = 0.1 - 0.2. Results. The LLRD source J1047+0739 at z = 0.1682 is detected at 6.0 GHz in 2018 with the VLA-A of NRAO as a compact source with radii less than 0.2 arc sec (< 600 pc at d = 700 Mpc). Its flux density was 117$\\pm$8 $μ$Jy and its spectral index was -0.85, which is typical of optically-thin synchrotron emission. It is also detected at 5.0 GHz in 2010 with the VLA-C, showing a flux density of 43$\\pm$3 $μ$Jy. Conclusions. The observed flux densities can be provided by a radio luminous supernova. The increase in flux density over eight years can be explained as the result of two independent supernovae or as the radio re-brightening of a single one. Radio time monitoring of this and other LLRDs could help clarify the mystery of the radio silence of its cosmological counterparts.\n\n", "2512.03329": "2025-12-03, **Push-broom Mapping of Galaxies and Supernova Remnants with the SPRITE CubeSat**, Elena Carlson et.al., [2512.03329v1](http://arxiv.org/abs/2512.03329v1)\n\n Supernovae (SNe) enrich and energize the surrounding interstellar medium (ISM) and are a key mechanism in the galaxy feedback cycle. The heating of the ISM by supernova shocks, and its subsequent cooling is critical to future star formation. The cooling of the diffuse shock-heated ISM is dominated by ultraviolet (UV) emission lines. These cooling regions and interfaces have complex spatial structure on sub-parsec scales. Mapping this cooling process is essential to understanding the feedback cycle of galaxies, a major goal of the 2020 Astrophysics Decadal Survey. The Supernova remnants and Proxies for ReIonization Testbed Experiment (SPRITE) CubeSat Mission will house the first long-slit orbital spectrograph with sub-arcminute angular resolution covering far ultraviolet wavelengths (FUV; 1000 - 1750 angstroms) and access to the Lyman UV (lambda < 1216 angstroms). SPRITE aims to provide new insights into the stellar feedback that drives galaxy evolution by mapping key FUV emission lines at the interaction lines between supernova remnants (SNRs) and the ambient interstellar medium (ISM). SPRITE will also measure the ionizing escape from approximately 50 low-redshift (0.16 < z < 0.4) star-forming galaxies. Current models predict SPRITE capable of detecting strong O VI, O IV], and C IV emission lines with angular resolution from 10 - 20 arcseconds. The SPRITE SNR survey will use push-broom mapping of its long-slit on extended sources to produce the first large sample of sub-arcminute 3D data cubes of extended sources in the FUV. In this paper, we present simulated SPRITE observations of Large Magellanic Cloud (LMC) SNRs to demonstrate the efficacy of the SPRITE instrument ahead of launch and instrument commissioning. These models serve as critical planning tools and incorporate the final pre-flight predicted performance of the instrument and the early extended source data reduction pipeline.\n\n", "2512.03264": "2025-12-02, **Comparison of Ne-22 core and shell distilled WD detonations in AREPO**, Uri Pierre Burmester et.al., [2512.03264v1](http://arxiv.org/abs/2512.03264v1)\n\n We present three-dimensional hydrodynamical simulations of detonations in $1.0 \\mathrm{M\\_{\\odot}}$ white dwarfs that have undergone $^{22} \\mathrm{Ne}$ distillation during crystallisation. These simulations, conducted with the moving-mesh code AREPO, aim to investigate the effects of chemical separation on the ejecta and spectra of such WDs undergoing thermonuclear explosions. The distillation process alters the internal chemical stratification of the star, concentrating neutron-rich material either in a central core or in an interior shell. We model both configurations as well as a homogeneous equivalent for each case with the same $^{22} \\mathrm{Ne}$ content distributed evenly at all radii. Despite similar $^{56} \\mathrm{Ni}$ yields between the core and shell models ($0.40$ and $0.45 \\mathrm{M\\_{\\odot}}$ respectively), the two models yield markedly different iron-group abundances. Both distilled models showed significantly enhanced production of $^{15} \\mathrm{N}$ via the decay of $^{15} \\mathrm{O}$. The $^{22} \\mathrm{Ne}$-core model produces enhanced amounts of stable neutron-rich iron-group isotopes such as $^{58} \\mathrm{Ni}$ and $^{54} \\mathrm{Fe}$. We highlight observational signatures associated with these differences, including potentially enhanced [$\\mathrm{Ni}\\_{\\rm II}$] lines in nebular spectra. Synthetic TARDIS spectra at early times show only moderate differences. Our results suggest that white dwarf distillation, a process linked to delayed cooling in the Gaia Q branch population, may leave detectable nucleosynthetic fingerprints in a subset of Type Ia supernovae. These findings open additional pathways to probe progenitor evolution and the role of crystallisation in shaping the diversity of thermonuclear transients.\n\n", "2512.03232": "2025-12-02, **The DESI DR1 Peculiar Velocity Survey: global zero-point and $H_0$ constraints**, A. Carr et.al., [2512.03232v1](http://arxiv.org/abs/2512.03232v1)\n\n The Dark Energy Spectroscopic Instrument (DESI) in its first Data Release (DR1) already provides more than 100,000 galaxies with relative distance measurements. The primary purpose of this paper is to perform the calibration of the zero-point for the DESI Fundamental Plane and Tully-Fisher relations, which allows us to measure the Hubble constant, $H\\_0$. This sample has a lower statistical uncertainty than any previously used to measure $H\\_0$, and we investigate the systematic uncertainties in absolute calibration that could limit the accuracy of that measurement. We improve upon the DESI Early Data Release Fundamental Plane $H\\_0$ measurement by a) using a group catalog to increase the number of calibrator galaxies and b) investigating alternative calibrators in the nearby universe. Our baseline measurement calibrates to the SH0ES/Pantheon+ type Ia supernovae, and finds $H\\_0=73.7\\pm 0.06\\;(\\text{stat.})\\pm 1.1\\;(\\text{syst.})$ km s$^{-1}$ Mpc$^{-1}$. Calibrating to surface brightness fluctuation (SBF) distances yields a similar $H\\_0$. We explore measurements using other calibrators, but these are currently less precise since the overlap with DESI peculiar velocity tracers is much smaller. In future data releases with an even larger peculiar velocity sample, we plan to calibrate directly to Cepheids and the tip of the red giant branch, which will enable the uncertainty to decrease towards a percent-level measurement of $H\\_0$. This will provide an alternative to supernovae as the Hubble flow sample for $H\\_0$ measurements.\n\n", "2512.03228": "2025-12-02, **The DESI DR1 Peculiar Velocity Survey: Mock Catalog**, J. Bautista et.al., [2512.03228v1](http://arxiv.org/abs/2512.03228v1)\n\n We describe the production of the official set of mock catalogs for the Dark Energy Spectroscopic Instrument Peculiar Velocity Survey (DESI-PV) Data Release 1 (DR1). Our mock catalogs reproduce the Bright Galaxy Survey number density and clustering at low redshift $(z<0.1)$ and the DESI PV samples of Fundamental plane and Tully-Fisher distances, from which we derive peculiar velocities. We carefully match mock and data properties and we mimic measurements of distance indicators and peculiar velocities, which follow the same statistical properties as real data. Mock samples of type-Ia supernovae also complement the other two distance indicators. Our 675 available mock realizations were used consistently by our three different methodologies described in our companion papers that measure the growth rate of structure $fσ\\_8$ with DESI PV DR1. Those mocks allow us to perform precise tests of clustering models and uncertainty estimation to an unprecedented level of accuracy, and compute correlations between methodologies. The consensus value for the DESI DR1 PV growth rate measurement is $fσ\\_8 = 0.450 \\pm 0.055$. This sample of mock catalogs represents the largest and most realistic set for cosmological measurements with peculiar velocities to date.\n\n", "2512.03140": "2025-12-02, **A Wind-Driven Origin for the Firework Morphology of the Supernova Remnant Pa 30**, Eric R. Coughlin et.al., [2512.03140v1](http://arxiv.org/abs/2512.03140v1)\n\n Pa 30 -- the likely remnant of the Galactic type Iax supernova of 1181 AD -- displays an unusual, firework-like morphology, consisting of radial filaments extending from a common center, where a white dwarf (WD) currently drives a very fast wind (speed $\\gtrsim 10^{4}$ km s$^{-1}$). We propose the filaments arose from the Rayleigh-Taylor-unstable nature of the interface between the circumstellar medium (CSM) and the shocked wind launched by the natal WD; the filaments then elongated intact due to the Kelvin-Helmholtz-stable nature of the large initial density contrast between the wind and CSM, supplemented by the slowly declining wind density profile (relative to homologously expanding ejecta). To support this interpretation, we present two-dimensional hydrodynamical simulations and derive the filament properties, including their speed, density, and temperature, all of which are consistent with observations. We suggest the filaments elongate until the wind and CSM densities become comparable at the contact discontinuity, which occurs within 1--10 years, and then truncate because the RTI halts. The subsequent KHI growth timescale across the current width of the filaments is longer than the age of Pa 30, so they remain intact. The filament-less central region in Pa 30 is therefore more likely a consequence of the finite timescale over which the RTI operates, rather than a wind termination shock. In general, firework-like filaments may form in other systems, provided there is a sufficiently large density contrast between the ejecta and its surroundings.\n\n", "2512.03132": "2025-12-02, **The DREAMS Project: Disentangling the Impact of Halo-to-Halo Variance and Baryonic Feedback on Milky Way Dark Matter Density Profiles**, Alex M. Garcia et.al., [2512.03132v1](http://arxiv.org/abs/2512.03132v1)\n\n Astrophysical searches for dark matter in the Milky Way require a reliable model for its density distribution, which in turn depends on the influence of baryonic feedback on the Galaxy. In this work, we utilize a new suite of Milky Way-mass halos from the DREAMS Project, simulated with Cold Dark Matter (CDM),to quantify the influence of baryon feedback and intrinsic halo-to-halo variance on dark matter density profiles. Our suite of 1024 halos varies over supernova and black hole feedback parameters from the IllustrisTNG model, as well as variations in two cosmological parameters. We find that Milky Way-mass dark matter density profiles in the IllustrisTNG model are largely insensitive to astrophysics and cosmology variations, with the dominant source of scatter instead arising from halo-to-halo variance. However, most of the (comparatively minor) feedback-driven variations come from the changes to supernova prescriptions. By comparing to dark matter-only simulations, we find that the strongest supernova wind energies are so effective at preventing galaxy formation that the halos are nearly entirely collisionless dark matter. Finally, regardless of physics variation, all the DREAMS halos are roughly consistent with a halo contracting adiabatically from the presence of baryons, unlike models that have bursty stellar feedback. This work represents a step toward assessing the robustness of Milky Way dark matter profiles, with direct implications for dark matter searches where systematic uncertainty in the density profile remains a major challenge.\n\n", "2512.02680": "2025-12-02, **Peculiar SN Ic 2022esa: An explosion of a massive Wolf-Rayet star in a binary as a precursor to a BH-BH binary?**, Keiichi Maeda et.al., [2512.02680v1](http://arxiv.org/abs/2512.02680v1)\n\n A class of supernovae (SNe) termed `SN Ic-CSM' are characterized by late-time emergence of narrow emission lines of elements formed in the oxygen core of a massive star. A popular scenario is the interaction of the SN ejecta and O-rich circumstellar medium (CSM), i.e., Circumstellar Interaction (CSI). Uncovering the progenitor system of SNe Ic-CSM plays a critical role in understanding the final evolution of a massive star to a bare C+O star. In this Letter, we present observations of SN 2022esa which we show is an SN Ic-CSM. Surprisingly, a stable periodicity of ~32 days is found in its light-curve evolution with a hint of a slowly increasing period over ~200 days. We argue that the main power source is likely the interaction of the SN ejecta and O-rich CSM, while the energy input by the post-SN eccentric binary interaction within the SN ejecta is another possibility. In either case, we propose a massive Wolf-Rayet (WR) star as the progenitor, in a WR-WR or WR-BH (black hole) binary that will eventually evolve to a BH-BH binary. Specifically, in the CSI scenario, the progenitor system is an eccentric binary system with an orbital period of about a year, leading to the observed periodicity through the modulation in the CSM density structure. We also show that some other objects, superluminous SN I 2018ibb (a pair-instability SN candidate) and peculiar SN Ic 2022jli (the first example showing stable periodic modulation), show observational similarities to SNe Ic-CSM and may be categorized as SN Ic-CSM variants. Complemented with a large diversity in their light-curve evolution, we propose that SNe Ic-CSM (potentially linked to SNe Ibn/Icn) are a mixture of multiple channels that cover a range of properties in the progenitor star, the binary companion, and the binary orbit.\n\n", "2512.02391": "2025-12-02, **\"SNe Ia twins\" in the Hubble flow, and the determination of H0**, Pilar Ruiz-Lapuente et.al., [2512.02391v2](http://arxiv.org/abs/2512.02391v2)\n\n We have applied our approach of using ''SNe Ia twins''in the Hubble flow to obtain distances to SNe Ia at z $>$ 0.015 and derive H$\\_{0}$.   Our results, taking a single step between the low z domain and the Hubble flow, validate the three rung classical method.   We find, however, that the full compilation of distances, both in Pantheon+ and in the Carnegie-Chicago Hubble Program (CCHP),   contain some inaccurate values in the colors due to an underestimate of reddening by dust. This produces odd individual values for H$\\_{0}$   from single SNe Ia.   On the average, those erroneous estimates do not affect the mean value of H$\\_{0}$, which is characterized by the bulk of well--modeled SNe Ia.   Our sample of carefully addressed SNe Ia in the Hubble flow contains a dozen supernovae, for which the distances are determined with high accuracy.   Three of these SNe Ia are of the Broad Line subtype and can be compared with SN 1989B in M66, a host galaxy with a unique convergence of the   Cepheid distance determination and the Tip of the Red Giant Branch stars (TRGB) determination by the CCHP group. They point to a weighted average of   H$\\_{0}$ $=$ 73.556 $\\pm$ 2.084 (stat) km s$^{-1}$ Mpc $^{-1}$.   There is as well a very good agreement on the distances to NGC 7250 and NGC 5643 between those derived with Cepheids by SH0ES and those derived with   the use of J-Asymptotic Giant Branch stars (JAGB stars) by the CCHP, which makes them very good anchors.   The sample of 12 SNe Ia gives a value of H$\\_{0}$ $=$ 72.833 $\\pm$ 1.306(stat) $\\pm$ 1.151 (sys) km s$^{-1}$ Mpc$^{-1}$, when anchored in Cepheids,   and of H$\\_{0}$ $=$ 72.388 $\\pm$ 1.272 (stat) $\\pm$ 1.015 (sys) km s$^{-1}$ Mpc$^{-1}$, when anchored in JAGBs by the CCHP. We take a mean of the two   values of H$\\_{0}$ and obtain H$\\_{0}$ $=$ 72.610 $\\pm$ 1.289(stat) $\\pm$ 1.085 (sys) km s$^{-1}$ Mpc$^{-1}$.\n\n"}}