{"neutrino": {"2411.13387": "2024-11-20, **Towards a Cosmic-Ray Energy Scale with the Auger Engineering Radio Array**, Max Büsken et.al., [2411.13387v1](http://arxiv.org/abs/2411.13387v1)\n\n Radio detection of cosmic-ray (CR) induced extensive air showers with digital antenna arrays is a matured technique by now. At the Pierre Auger Observatory, the Auger Engineering Radio Array (AERA) has been measuring air-shower signals in conjunction with the particle detectors of the surface detector (SD) for over ten years. For an absolute determination of the CR energy with the Auger baseline detectors, the shower size estimator from the SD is calibrated with the energy scale of the fluorescence detector (FD). However, AERA has an independent access to the energy scale through the reconstructed radio signals. The hybrid detectors at the Pierre Auger Observatory offer the unique opportunity to compare the two independent energy scales. In this contribution, we present our envisaged methodology for cross-checking the agreement between the energy scales of the FD and AERA using hybrid SD-AERA shower data and simulations. We show individual steps of our radio signal reconstruction and highlight the key ingredients for calibrated energy measurements.\n\n"}, "dark matter": {"2411.13484": "2024-11-20, **The Impact of Galaxy-halo Size Relations on Galaxy Clustering Signals**, Joshua B. Hill et.al., [2411.13484v1](http://arxiv.org/abs/2411.13484v1)\n\n Galaxies come in different sizes and morphologies, and these differences are thought to correlate with properties of their underlying dark matter halos. However, identifying the specific halo property that controls the galaxy size is a challenging task, especially because most halo properties are dependent on one another. In this work, we demonstrate this challenge by studying how the galaxy-halo size relations impact the galaxy clustering signals. We investigate the reason that a simple linear relation model, which prescribes that the galaxy size is linearly proportional to the dark matter halo's virial radius, can still produce clustering signals that match the observational data reasonably well. We find that this simple linear relation model for galaxy sizes, when combined with the subhalo abundance matching technique, introduces an implicit dependence on the halo formation history. As a result, the effect of halo assembly bias enters the resulting galaxy clustering, especially at lower stellar masses, producing a clustering signal that resembles the observed one. At higher stellar masses, the effect of halo assembly bias weakens and is partially canceled out by the effect of halo bias, and the clustering of large and small galaxies becomes more similar. Our study confirms that the information of halo formation history must play a role in determining galaxy sizes to match the observed clustering signals, but also highlights the challenge of identifying a particular halo property that controls galaxy sizes through constraints from galaxy clustering alone.\n\n", "2411.13379": "2024-11-20, **Exploring the effects of dark matter - dark energy interaction on cosmic evolution in viscous dark energy scenario**, Ashadul Halder et.al., [2411.13379v1](http://arxiv.org/abs/2411.13379v1)\n\n We explore the influence of interactions between dark matter (DM) and dark energy (DE) on the cosmic evolution of the Universe within a viscous dark energy (VDE) framework. Moving beyond traditional interacting dark energy (IDE) models, we propose a generalized IDE model adaptable to diverse IDE scenarios via IDE coupling parameters. In order to investigate deviations from $\\Lambda$CDM across cosmic epochs by highlighting how viscous and the interactions between DM and DE impact cosmic density and expansion rates, we consider a model agnostic form of VDE. Eventually we perform a Bayesian analysis using the Union 2.1 Supernova Ia dataset and Markov Chain Monte Carlo (MCMC) sampling to obtain optimal values of model parameters. This comprehensive analysis provides insights about the interplay between viscous and IDE in shaping the Universe's expansion history.\n\n", "2411.13329": "2024-11-20, **BIG-SPARC: The new SPARC database**, Konstantin Haubner et.al., [2411.13329v1](http://arxiv.org/abs/2411.13329v1)\n\n The Surface Photometry and Accurate Rotation Curves (SPARC) database has provided the community with mass models for 175 nearby galaxies, allowing different research teams to test different dark matter models, galaxy evolution models, and modified gravity theories. Extensive tests, however, are hampered by the somewhat heterogeneous nature of the HI rotation curves and the limited sample size of SPARC. To overcome these limitations, we are working on BIG-SPARC, a new database that consists of about 4000 galaxies with HI datacubes from public telescope archives (APERTIF, ASKAP, ATCA, GMRT, MeerKAT, VLA, and WSRT) and near infrared photometry from WISE. For these galaxies, we will provide homogeneously derived HI rotation curves, surface brightness profiles, and mass models. BIG-SPARC is expected to increase the size of its predecessor by a factor of more than 20. This is a necessary step to prepare for the additional order of magnitude increase in sample size expected from ongoing and future HI surveys with the Square Kilometre Array (SKA) and its pathfinders\n\n", "2411.13299": "2024-11-20, **Gravitational Waves from Metastable Cosmic Strings in Supersymmetric New Inflation Model**, Akifumi Chitose et.al., [2411.13299v1](http://arxiv.org/abs/2411.13299v1)\n\n Recent observations by pulsar timing arrays (PTAs) indicate a potential detection of a stochastic gravitational wave (GW) background. Metastable cosmic strings have been recognized as a possible source of the observed signals. In this paper, we propose an $R$-invariant supersymmetric new inflation model. It is characterized by a two-step symmetry breaking $\\mathrm{SU}(2) \\to \\mathrm{U}(1)\\_G \\to \\mathrm{nothing}$, incorporating metastable cosmic strings. The field responsible for the initial symmetry breaking acts as the inflaton, while the second symmetry breaking occurs post-inflation, ensuring the formation of the cosmic string network without monopole production. Our model predicts symmetry breaking scales consistent with the string tensions favored by PTA data, $G\\_\\mathrm{N} \\mu\\_\\mathrm{str} \\sim 10^{-5}$, where $G\\_\\mathrm{N}$ is the Newton constant. Notably, a low reheating temperature is required to suppress non-thermal gravitino production from the decay of inflaton sector fields. This also helps evading LIGO-Virgo-KAGRA constraints, while yielding a distinctive GW signature that future PTA and interferometer experiments can detect. Additionally, we examine the consistency of this scenario with non-thermal leptogenesis and supersymmetric dark matter.\n\n", "2411.13058": "2024-11-20, **Detectability of Lensed Gravitational Waves in Matched-Filtering Searches**, Juno C. L. Chan et.al., [2411.13058v1](http://arxiv.org/abs/2411.13058v1)\n\n Gravitational lensing by compact, small-scale intervening masses causes frequency-dependent distortions to gravitational-wave events. The optimal signal-to-noise ratio (SNR) is often used as a proxy for the detectability of exotic signals in gravitational-wave searches. In reality, the detectability of such signals in a matched-filtering search requires comprehensive consideration of match-filtered SNR, signal-consistency test value, and other factors. In this work, we investigate for the first time the detectability of lensed gravitational waves from compact binary coalescences with a match-filtering search pipeline, GstLAL. Contrary to expectations from the optimal-SNR approximation approach, we show that the strength of a signal (i.e., higher optimal SNR) does not necessarily result in higher detectability. We also demonstrate that lensed gravitational waves with wave optics effects can suffer significantly, from $~90\\%$ (unlensed) to $<1\\%$ (lensed) detection efficiency, due to downranking by the signal-consistency test values. These findings stress the need to extend current template banks to effectively search for lensed gravitational waves and to reassess current constraints on compact dark matter scenarios.\n\n", "2411.12947": "2024-11-20, **Kicking the Tires on Picolensing as a Probe of Primordial Black Hole Dark Matter**, Michael A. Fedderke et.al., [2411.12947v1](http://arxiv.org/abs/2411.12947v1)\n\n Gravitational-lensing parallax of gamma-ray bursts (GRBs) is an intriguing probe of primordial black hole (PBH) dark matter in the asteroid-mass window, $2\\times 10^{-16}M\\_{\\odot} \\lesssim M\\_{\\text{PBH}} \\lesssim 5 \\times 10^{-12}M\\_{\\odot}$. Recent work in the literature has shown exciting potential reach for this \"picolensing\" signal if a future space mission were to fly two x-/$\\gamma$-ray detectors in the Swift/BAT class, with inter-spacecraft separation baselines on the order of the Earth-Moon distance. We revisit these projections with a view to understanding their robustness to various uncertainties related to GRBs. Most importantly, we investigate the impact of uncertainties in observed GRB angular sizes on reach projections for a future mission. Overall, we confirm that picolensing shows great promise to explore the asteroid-mass window; however, we find that previous studies may have been too optimistic with regard to the baselines required. Detector baselines on the order of at least the Earth-L2 distance would make such a mission more robust to GRB size uncertainties; baselines on the order of an astronomical unit (AU) would additionally enable reach that equals or exceeds existing microlensing constraints up to $M\\_{\\text{PBH}}\\sim 10^{-5}M\\_{\\odot}$.\n\n"}, "supernova": {"2411.13379": "2024-11-20, **Exploring the effects of dark matter - dark energy interaction on cosmic evolution in viscous dark energy scenario**, Ashadul Halder et.al., [2411.13379v1](http://arxiv.org/abs/2411.13379v1)\n\n We explore the influence of interactions between dark matter (DM) and dark energy (DE) on the cosmic evolution of the Universe within a viscous dark energy (VDE) framework. Moving beyond traditional interacting dark energy (IDE) models, we propose a generalized IDE model adaptable to diverse IDE scenarios via IDE coupling parameters. In order to investigate deviations from $\\Lambda$CDM across cosmic epochs by highlighting how viscous and the interactions between DM and DE impact cosmic density and expansion rates, we consider a model agnostic form of VDE. Eventually we perform a Bayesian analysis using the Union 2.1 Supernova Ia dataset and Markov Chain Monte Carlo (MCMC) sampling to obtain optimal values of model parameters. This comprehensive analysis provides insights about the interplay between viscous and IDE in shaping the Universe's expansion history.\n\n", "2411.13242": "2024-11-20, **Light Curve Properties of Gamma-Ray Burst Associated Supernovae**, Amit Kumar et.al., [2411.13242v1](http://arxiv.org/abs/2411.13242v1)\n\n A rapidly spinning, millisecond magnetar is widely considered one of the most plausible power sources for gamma-ray burst-associated supernovae (GRB-SNe). Recent studies have demonstrated that the magnetar model can effectively explain the bolometric light curves of most GRB-SNe. In this work, we investigate the bolometric light curves of 13 GRB-SNe, focusing on key observational parameters such as peak luminosity, rise time, and decay time, estimated using Gaussian Process (GP) regression for light curve fitting. We also apply Principal Component Analysis to all the light curve parameters to reduce the dimensionality of the dataset and visualize the distribution of SNe in lower-dimensional space. Our findings indicate that while most GRB-SNe share common physical characteristics, a few outliers, notably SNe 2010ma and 2011kl, exhibit distinct features. These events suggest potential differences in progenitor properties or explosion mechanisms, offering deeper insight into the diversity of GRB-SNe and their central engines.\n\n"}}