{"neutrino": {"2509.24938": "2025-09-29, **Direct detection of electromagnetically interacting ultraheavy dark matter**, Jason Kumar et.al., [2509.24938v1](http://arxiv.org/abs/2509.24938v1)\n\n At a level too faint for astronomy, particle dark matter may interact with Standard Model states via the photon. We derive limits from direct detection experiments on photon-mediated nuclear interactions up to operator dimension-6, viz., via a millicharge, charge radius, electric and magnetic dipole moment, and anapole moment, up to dark matter masses $\\lesssim 10^{17}$ GeV, where detectors become flux-limited. We derive constraints for XENON1T, XENONnT, LZ, PANDAX-II, PANDAX-4T, DarkSide-50, DEAP-3600, PICO-60, and CDMS-II, and estimate future sensitivities for the multi-deca-tonne scale experiments DarkSide-20k, DARWIN/XLZD, PANDAX-xT, and Argo. Special attention is paid to millicharged dark matter, for which we constrain new parameter space by deriving the ceiling on sensitivity to its electric charge, arising from the nuclear-vs-electron recoil discriminants used in liquid argon and bubble chamber detectors. This result goes beyond ceilings previously identified in liquid xenon and semiconductor detectors from electron recoil vetoes. In particular, the ceiling from PICO-60 closes a large window between direct detection and neutrino experiment limits for dark matter masses below $10^{12}$ GeV.\n\n", "2509.24680": "2025-09-29, **Lepton number violating signals of a parity symmetric model at $μ$TRISTAN**, Keisuke Harigaya et.al., [2509.24680v1](http://arxiv.org/abs/2509.24680v1)\n\n The parity solution to the strong CP problem necessarily extends the Standard Model to include the SU$(2)\\_{\\rm R}$ gauge sector and imposes restrictions on the structure of the Yukawa interactions. In this framework, one can consider an appealing structure of the neutrino sector in which the smallness of the neutrino masses is naturally explained, while lepton number symmetry is substantially violated at the TeV scale. Observation of distinctive lepton number violating signals at collider experiments can therefore be expected, since the rates are not suppressed by the small neutrino masses. We study the constraints from neutrinoless double beta decay and discuss the prospects for discovering new TeV-scale particles, such as the $W'$ boson of SU$(2)\\_{\\rm R}$, via lepton number violating processes at a $\\mu^+ \\mu^+$ collider, $\\mu^+ \\mu^+ \\to W^+ W'^+$. A $\\mu^+ \\mu^+$ collider with a center-of-mass energy of 10 TeV can probe the $W'$ boson mass up to about 10 TeV through on-shell production, and the reach can extend to 16 TeV by studying processes involving off-shell $W'$ boson.\n\n", "2509.24516": "2025-09-29, **Uncertainty in the time of arrival of ultra high energetic neutrinos**, Fedele Lizzi et.al., [2509.24516v1](http://arxiv.org/abs/2509.24516v1)\n\n In the light of the recent observation by the KM3NeT collaboration of an ultrahigh energetic neutrino, we analyse it in its rest frame, where shortly after creation of the neutrino a muon arrives and interacts. Since the neutrino is at rest we use (in this first analysis) a non relativistic Gaussian wave function, and consider its spread. Due to the finite size of the packet, the time of the interaction of the muon will have an uncertainty. This uncertainty is small in the neutrino rest frame, but boosted to our frame, increases 18 orders of magnitude, making it extremely large. This effectively prevents the possibility of the observation of bursts, or the correlation with other events. A similar analysis for less energetic neutrinos show that the uncertainty is smaller than the duration of the observed bursts.\n\n", "2509.24011": "2025-09-28, **Resonance Contributions to Charged-Current (Anti)Neutrino-Nucleon Elastic Scattering at GeV Energies**, Oleksandr Tomalak et.al., [2509.24011v1](http://arxiv.org/abs/2509.24011v1)\n\n We present the first evaluation of resonance contributions to the charged-current (anti)neutrino-nucleon elastic scattering at GeV energies, focusing on the dominant $\\Delta(1232)$ resonance. We approximate the vector part of the $N \\to \\Delta$ transition by the leading magnetic dipole term. Our results for the cross-section corrections at fixed neutrino energy indicate the permille-level contribution of resonance intermediate states to the elastic and radiative scattering cross sections. This calculation exhibits the expected infrared behavior of the invariant amplitudes and unpolarized cross sections. Our findings provide important insights into inelastic excitations in the charged-current (anti)neutrino-nucleon elastic scattering at GeV energies.\n\n", "2509.23925": "2025-09-28, **Probing Scalar-Mediated Sterile Neutrinos with Gravitational Wave and Colliders Signals**, Qi Bi et.al., [2509.23925v1](http://arxiv.org/abs/2509.23925v1)\n\n We propose a UV-complete extension of the Standard Model in which a gauge-singlet scalar $S$ acquires a vacuum expectation value, generates a Majorana mass for a sterile neutrino $N$, and mixes with the Higgs field. This framework addresses neutrino masses via a seesaw mechanism and, for sufficiently large scalar mixing, can also drive a strong first-order electroweak phase transition, producing gravitational-wave (GW) signals potentially detectable by GW observatories. The Higgs-$S$ mixing also enhances sterile-neutrino pair production at colliders through $s$-channel exchange of the Higgs and $S$. Owing to the small active-sterile mixing angle, $N$ is generically long-lived, yielding characteristic displaced-vertex signatures. The combination of GW observations and displaced-vertex searches at colliders provides complementary cross-checks of the model parameter space.\n\n", "2509.23910": "2025-09-28, **New ab initio constrained extended Skyrme equations of state for simulations of neutron stars, supernovae and binary mergers: II. Thermal response in the suprasaturation density domain**, Adriana R. Raduta et.al., [2509.23910v1](http://arxiv.org/abs/2509.23910v1)\n\n Numerical simulations of core-collapse supernovae, mergers of binary neutron stars and formation of stellar black holes, which employed standard Skyrme interactions, established clear correlations between the evolution of these processes, characteristics of the hot compact objects, as well as neutrino and gravitational wave signals, and the value of effective nucleon mass at the saturation density. Unfortunately, the density dependence of the effective mass of nucleons in these models does not align with the predictions of ab initio models with three body forces. In this work, we investigate the thermal response for a set of extended Skyrme interactions that feature widely different density dependencies of the effective mass of the nucleons. Thermal contributions to the energy density and pressure are studied along with a few thermal coefficients over wide domains of density, temperature and isospin asymmetry, relevant for the physics of hot compact objects. For some of the effective interactions, the thermal pressure is negative at high densities. This results in a situation where hot compact stars can support less mass before collapsing into a black hole compared to their cold counterparts. Moreover, the higher the temperature, the lower the maximum mass that the hot star can support.\n\n", "2509.23748": "2025-09-28, **Finite-temperature stability from doublet inflation field with right-handed neutrinos**, Shilpa Jangid et.al., [2509.23748v1](http://arxiv.org/abs/2509.23748v1)\n\n We study the augmentation of the Standard Model (SM) with another $SU(2)$ Higgs doublet and right-handed neutrinos. The second Higgs doublet ($\\Phi\\_2$) is defined to be odd under the $Z\\_2$ symmetry, and hence, the lightest stable neutral particle from the additional doublet becomes the cold dark matter candidate. The right-handed neutrino field coupled to the Higgs field provides non-zero mass for the neutrinos. The inert doublet field coupled non-minimally to gravity as $\\zeta\\_2 \\Phi\\_2^\\dagger \\Phi\\_2 R$ also acts as an inflaton field. The inflationary bounds restrict the interaction couplings as $\\lambda\\_2/\\zeta\\_2^2 \\approx 4\\times 10^{-10}$. After inflation ends, the scalar bosonic degrees of freedom from the inert doublet can contribute to the electroweak phase transition. The strongly first-order phase transition bound, i.e., $\\frac{\\phi\\_{+}(T\\_c)}{T\\_c} \\geq 1.0$ restricts the bare mass parameter of the additional doublet to $m\\_{22}=400.0$ GeV, demanding GUT scale perturbative unitarity for $Y\\_N=0.01$. The increase in $Y\\_N$ reduces the strength of phase transition, and it is no longer satisfied even for vanishing bare mass parameter. The Planck scale perturbative unitarity allows for the first-order phase transition, $\\frac{\\phi\\_{+}(T\\_c)}{T\\_c} \\geq 0.6$, until $m\\_{22}=70.0$ GeV for $Y\\_N=0.01$, and none of the mass values satisfies the first-order phase transition for $Y\\_N=0.4$. The thermal corrections also affect the probability of tunneling from the false vacuum to the true vacuum, and hence, the finite temperature stability of the electroweak vacuum has been studied, including the finite-temperature effects.\n\n"}, "dark matter": {"2509.25088": "2025-09-29, **From Dark Radiation to Dark Energy: Unified Cosmological Evolution in K-essence Models**, Eladio Moreno et.al., [2509.25088v1](http://arxiv.org/abs/2509.25088v1)\n\n We study a class of Unified Dark Matter (UDM) models based on generalized K-essence, where a single scalar field with non-canonical kinetic terms accounts for dark radiation, dark matter, and dark energy. Starting from the purely kinetic Lagrangian proposed by Scherrer (2004), we extend the analysis to quadratic and exponential scalar potentials and explore their phenomenology. All models are implemented in a modified version of \\texttt{Hi\\\\_CLASS} and confronted with data from \\textit{Planck} 2018, DESI DR1, and Big Bang Nucleosynthesis. The scenarios reproduce the full sequence of cosmic epochs: an early radiation-like phase, a matter-dominated era, and late-time accelerated expansion. The new models predict slightly higher values of the Hubble constant compared to $\\Lambda$CDM, thereby partially alleviating the respective tensions from $\\sim 4.4 \\sigma$ to $\\sim 3.4 \\sigma$. The quadratic potential requires an ultralight mass that makes it effectively indistinguishable from the Scherrer solution. Overall, generalized K-essence provides a minimal and observationally viable realization of UDM, offering a unified description of the dark sector with distinctive signatures in both early- and late-time cosmology.\n\n", "2509.24963": "2025-09-29, **Vector dark matter production during inflation in the gradient-expansion formalism**, A. V. Lysenko et.al., [2509.24963v1](http://arxiv.org/abs/2509.24963v1)\n\n A massive vector field is a highly promising candidate for dark matter in the universe. A salient property of dark matter is its negligible or null coupling to ordinary matter, with the exception of gravitational interaction. This poses a significant challenge in producing the requisite amount of dark particles through processes within the Standard Model. In this study, we examine the production of a vector field during inflation due to its direct interaction with the inflaton field through kinetic and axion-like couplings as well as the field-dependent mass. The gradient-expansion formalism, previously proposed for massless Abelian gauge fields, is extended to include the longitudinal polarization of a massive vector field. We derive a coupled system of equations of motion for a set of bilinear functions of the vector field. This enables us to address the nonlinear dynamics of inflationary vector field production, including backreaction on background evolution. To illustrate this point, we apply our general formalism to a low-mass vector field whose kinetic and mass terms are coupled to the inflaton via the Ratra-type exponential function. The present study investigates the production of its transverse and longitudinal polarization components in a benchmark inflationary model with a quadratic inflaton potential. It has been demonstrated that pure mass coupling is able to enhance only the longitudinal components. By turning on also the kinetic coupling, one can get different scenarios. As the coupling function decreases, the primary contribution to the energy density is derived from the transverse polarizations of the vector field. Conversely, for an increasing coupling function, the longitudinal component becomes increasingly significant and rapidly propels the system into the strong backreaction regime.\n\n", "2509.24833": "2025-09-29, **Black Hole Solution in Anti-de Sitter Space with a New Cloud of Strings Surrounded by Dark Matter Halo**, Faizuddin Ahmed et.al., [2509.24833v1](http://arxiv.org/abs/2509.24833v1)\n\n This paper presents a comprehensive theoretical study of a Schwarzschild-like Anti-de Sitter (AdS) black hole (BH) influenced by a new cloud of strings (NCS) and a dark matter halo (DMH) characterized by a Dehnen-type density profile. We analyze the geodesic motion of both massless and massive test particles, highlighting how the NCS and DMH parameters affect the effective potentials, photon spheres, circular orbits, BH shadow, and the innermost stable circular orbit (ISCO) of test particles. Additionally, we investigate the thermodynamic behavior of the BH in an extended phase space by deriving key quantities, such as the Hawking temperature, the equation of state (EoS), Gibbs free energy, internal energy, and the specific heat capacity. Our results show that the presence of NCS and DMH induces significant modifications in both the dynamical and thermodynamical behavior of the BH, including shifts in the Hawking-Page transition and divergences in heat capacity, thereby reshaping the phase structure of the BH.\n\n", "2509.24562": "2025-09-29, **Cosmological Scenarios in $f(Q,C)$ gravity with a dynamical degree of freedom**, Hamid Shabani et.al., [2509.24562v1](http://arxiv.org/abs/2509.24562v1)\n\n The $f(Q,C)$ theory, which extends symmetric teleparallel gravity by including the boundary term $C$ in addition to the non-metricity scalar $Q$, provides a unifying framework that encompasses both $f(Q)$ and $f(\\mathring{R})$ gravities. In this work, we develop a comprehensive dynamical system analysis of $f(Q,C)$ cosmology formulated within the non-coincident affine connection branches. Unlike the coincident case, these branches introduce a dynamical degree of freedom that significantly enriches the cosmological phase space. We show that even for simple power-law forms of the Lagrangian, the theory accommodates a broad spectrum of cosmic scenarios, including successive pressureless matter eras, stiff-matter phases between early inflation and dark matter domination, and late-time acceleration. Our analysis demonstrates that the Universe can naturally evolve from an initial de Sitter phase to a matter-dominated epoch and subsequently to a final de Sitter attractor, consistent with the observed thermal history. These results highlight the role of the dynamical connection in shaping cosmic evolution and underline the potential of $f(Q,C)$ gravity as a viable alternative framework for addressing outstanding issues in modern cosmology.\n\n", "2509.24553": "2025-09-29, **Focusing the Axion Wind with Ferrite Flux Concentrators**, Christina Gao et.al., [2509.24553v1](http://arxiv.org/abs/2509.24553v1)\n\n Axion dark matter may couple to fermion spins through an effective oscillating magnetic field, the ``axion wind\". Existing approaches for detecting axion wind via axion-electron coupling $g\\_{ae}$ face sensitivity limitations due to the extremely weak pseudomagnetic field generated, typically a few times $10^{-18}$ tesla for $g\\_{ae} \\sim 10^{-10}$. We propose to use ferrimagnetic flux concentrators to amplify the pseudomagnetic field into a genuine magnetic field, which can then be measured using general precision magnetometry techniques. This greatly expands the experimental possibilities beyond conventional methods that rely on detecting small transverse magnetic fields from spin precession induced by axion wind. Here we utilize the libration mode of a levitated ferromagnet, which can achieve sub-femtotesla sensitivity, enabling detection of axion-electron coupling strengths $g\\_{ae} \\lesssim 10^{-11}$ in the frequency range $1-500$ Hz.\n\n", "2509.24523": "2025-09-29, **Dark matter and fundamental physics with the Cherenkov Telescope Array Observatory**, Francesco Schiavone et.al., [2509.24523v1](http://arxiv.org/abs/2509.24523v1)\n\n The Cherenkov Telescope Array Observatory (CTAO) will be the next-generation major ground-based gamma-ray observatory. It will be made up of two large arrays of imaging atmospheric Cherenkov telescopes (IACTs), with one site in the Northern hemisphere (La Palma, Canary Islands) and one in the Southern (Paranal, Chile). CTAO aims to offer great improvement in energetic and angular resolution with respect to current IACT systems, spanning a photon energy range from 20 GeV to 300 TeV, as well as a significantly larger effective area and full-sky coverage. Besides a percentage of observational time available for external proposals, making it the first open gamma-ray observatory, the core observational program of CTAO is organized in several Key Science Projects. A significant amount of time will be devoted to dark matter (e.g. WIMPs, axion-like particles) and fundamental physics studies from a variety of targets, including the Milky Way's Galactic centre, dwarf spheroidal galaxies, the Large Magellanic Cloud, and extragalactic objects such as blazars. In this contribution, an overview of CTAO's main features is provided, with a focus on its capabilities to investigate these yet unanswered questions of modern physics.\n\n", "2509.24278": "2025-09-29, **Observational Evidence for Spin Alignment Between Galaxy Groups and Their Central Galaxies**, Peng Wang et.al., [2509.24278v1](http://arxiv.org/abs/2509.24278v1)\n\n We present a systematic observational study of the spin alignment between galaxy groups and their central galaxies using a large spectroscopic sample from the Sloan Digital Sky Survey. Unlike previous studies based on morphology or major axis alignment, we use spin as a direct, dynamically motivated probe. To match the limitations of observational data, the group spin, central-galaxy spin, and alignment angle are defined and measured in projection on the sky plane. By applying two novel spin estimators for galaxy groups, we find strong statistical evidence for a preferential alignment, with a mean projected angle of $34.17^\\circ \\pm 0.29^\\circ$, significantly deviating from random expectation at $37.77\\sigma$. This alignment signal persists across a wide range of group and galaxy properties, but its strength is modulated by mass, morphology, and color. Specifically, we find that more massive groups and more massive central galaxies exhibit stronger alignment. Furthermore, elliptical central galaxies show stronger alignment than spirals, and bluer central galaxies are more strongly aligned than redder ones. Our results suggest a close dynamical link between the spin of central galaxies and their host groups, modulated by their physical properties and star formation history. These results provide new insights into the dynamical connection between central galaxies and their host dark matter halos.\n\n", "2509.24270": "2025-09-29, **Collisional Baryon-Dominated Dwarf Galaxies: A New Probe of Bursty Feedback and Dark Matter Physics**, Yi-Ying Wang et.al., [2509.24270v1](http://arxiv.org/abs/2509.24270v1)\n\n High-velocity collisions between gas-rich ultra-diffuse galaxies present a promising formation channel for baryon-dominated dwarf galaxies (BDDGs). Using hydrodynamical simulations, we show that the progenitors' baryonic binding energy, $\\|E\\_{\\rm bind}\\|$, critically controls the outcome. Repeated potential fluctuations, e.g., from bursty feedback, inject energy and reduce $\\|E\\_{\\rm bind}\\|$ by $\\approx 15\\%$, yielding fewer but substantially more massive BDDGs. By contrast, elastic self-interacting dark matter produces comparable cores without lowering $\\|E\\_{\\rm bind}\\|$, resulting in negligible effect. This provides a novel way to distinguish between two leading galactic core formation channels, i.e., the baryon feedback and elastic dark matter self-interaction. Among 15 paired simulation runs, 13 show higher BDDG masses in the weakened-binding case, and about two thirds exhibit $>100\\%$ mass enhancements. The simulations also predict systematically lower gas fractions due to sustained post-collision star formation, yielding a clean observational signature. Upcoming wide-field imaging (CSST, LSST), HI surveys (FAST), and kinematic follow-up will be crucial to test this scenario.\n\n", "2509.24103": "2025-09-28, **GravSphere2: A higher-order Jeans method for mass-modeling spherical stellar systems**, Andrés Bañares-Hernández et.al., [2509.24103v1](http://arxiv.org/abs/2509.24103v1)\n\n Mass-modeling methods are used to infer the gravitational field of stellar systems, from globular clusters to giant elliptical galaxies. While many methods exist, most require assumptions about the form of the underlying distribution function or data binning that leads to loss of information. With only line-of-sight (LOS) data, many methods suffer from the well-known mass-anisotropy degeneracy. To overcome these limitations, we develop a new, publicly available mass-modeling method, GravSphere2. This combines individual stellar velocities from LOS and proper motion (PM) measurements to solve the Jeans equations up to fourth order, without any data binning. Using flexible functional forms for the anisotropy profiles at second and fourth order, we show how including additional constraints from a new observable - fourth-order PMs - fully closes the system of equations, breaking the mass-anisotropy degeneracy at all orders. We test our method on mock data for dwarf galaxies, showing how GravSphere2 improves on previous methods. GravSphere2 recovers the mass density, stellar velocity anisotropy, and logarithmic slope of the mass density profile within its quoted 95% confidence intervals across almost all mocks over a wide radial range (0.1 < R/Rhalf < 10). We find GravSphere2 outperforms simple mass estimators, suggesting that it is worth using even when only a few LOS velocities are available. With 1,000 tracers without PMs, GravSphere2 recovers the logarithmic density slope at Rhalf with 12% (25%) statistical errors for cuspy (cored) mock data, enabling a distinction between the two. Including PMs, this improves to 8% (12%). With just 100 tracers and no PMs, we recover slopes with ~ 30% (20%) errors. GravSphere2 will be a valuable new tool to hunt for black holes and dark matter in spherical stellar systems, from globular clusters and dwarf galaxies to giant ellipticals and galaxy clusters.\n\n", "2509.23581": "2025-09-28, **The inner rotation curve of the Milky Way**, Y. Sofue et.al., [2509.23581v1](http://arxiv.org/abs/2509.23581v1)\n\n We derived the inner rotation curve (RC) of the Milky Way by applying the terminal velocity method (TVM) to the longitude-velocity diagrams (LVD) made from the large-scale survey data of the Galactic plane in the HI (HI4PI whole sky survey) and CO lines (CfA-Chile 1.2-m Galactic plane survey, Nobeyama 45-m Galactic plane and Galactic Center surveys, and Mopra 22-m southern Galactic plane survey). The derived RC agrees well with the RCs derived from the astrometric measurements of the maser sources by very long baseline interferometer (VLBI) observations and the GAIA result. We combined them to construct a unified RC from $R=0$ to $\\sim 25$ kpc and decomposed the curve into bulge, disc and dark halo components with high precision. The dark matter density near the Sun is estimated to be $0.107 \\pm 0.003$ GeV cm$^{-3}$. We present the RC as ascii tables for the solar constants of $(R\\_0,V\\_0)=(8.178 {\\rm kpc}, 235.1 {\\rm km/s})$, We also obtained a detailed comparison of the eastern ($l\\ge 0^\\circ$) and western ($< 0^\\circ$) RCs in the HI and CO lines, which allowed the creation of an E/W asymmetry curve of the velocity difference. The E/W asymmetry is fitted by a sinusoidal function of the radius with the amplitude increasing toward the Galactic Center. We consider the possibility of the origin due to a weak bar inside $\\sim 4$ kpc.\n\n", "2509.23549": "2025-09-28, **Impact of Cosmic Filaments on Galaxy Morphological Evolution and Predictions of Early Cosmic Web Structure for Roman**, Farhanul Hasan et.al., [2509.23549v1](http://arxiv.org/abs/2509.23549v1)\n\n We leverage the IllustrisTNG cosmological simulations to test how the large-scale cosmic web shapes galaxy morphology and to forecast the early cosmic web structure that the Nancy Grace Roman Space Telescope will reveal. In the hydrodynamic TNG50 and $N$-body TNG50-Dark runs, we reconstruct the cosmic web at redshifts $z=0$, 0.5, 1, 2, 3, and 4 with the Monte Carlo Physarum Machine density estimator and the DisPerSE structure identification framework. We confirm that dark matter halos start out predominantly prolate (elongated) and their shapes are aligned with their nearest filaments; prolate galaxies retain strong shape-alignment with their outer halos to later times. The fraction of prolate galaxies and halos increases toward lower stellar mass, higher redshift, and lower-density filaments. Oblate and spheroidal galaxies show weaker trends with filament density, but spheroidal halos preferentially reside in higher-density filaments. We also find that higher-density filaments favor extended rotationally-supported disks, whereas lower-density filaments more often host smaller dispersion-supported systems. Then, generating mock galaxy samples from TNG100 and TNG50, we predict the early cosmic web accessible to Roman. We find that the spectroscopic emission-line depth planned for the High-Latitude Wide-Area Survey (HLWAS) yields a highly incomplete galaxy sample that does not accurately trace the $z=1$ cosmic web. A survey $\\geq2.5\\times$ deeper over a few square degrees would enable a proper reconstruction and reveal qualitatively correct filament-galaxy morphology relationships. Nevertheless, the planned HLWAS Deep field should still identify most galaxy overdensities; targeted deeper spectroscopy of these regions would efficiently and adequately map the early filamentary structure.\n\n"}, "supernova": {"2509.24555": "2025-09-29, **M3DIS - A grid of 3D radiation-hydrodynamics stellar atmosphere models for stellar surveys. II. Carbon-enhanced metal-poor stars**, Philipp Eitner et.al., [2509.24555v1](http://arxiv.org/abs/2509.24555v1)\n\n Understanding the origin and evolution of carbon-enhanced metal-poor (CEMP) stars is key to tracing the Galaxy's early chemical enrichment. We investigate how realistic 3D radiation-hydrodynamics (RHD) model atmospheres affect carbon abundances in CEMP stars and implications for their classification and Galactic chemical evolution (GCE). We focus on biases from traditional 1D hydrostatic models. We use the M3DIS code to compute 3D RHD model atmospheres for main-sequence and sub-giant stars over a wide range of metallicities and carbon enhancements. Synthetic spectra of the CH G-band are calculated with 3D radiative transfer and compared to spectra from classical 1D MARCS models. We derive abundance corrections and apply them to a large SAGA database sample to quantify effects on the carbon abundance distribution and CEMP classification. Our new 3D CEMP models predict cooler upper atmospheric layers than in 1D models, resulting in stronger CH absorption and lower inferred carbon abundances by up to -0.9 dex at the lowest metallicities. Carbon enhancement in the atmosphere itself increases molecular opacities and leads to radiative re-heating, partly offsetting adiabatic cooling in 3D models and reducing 3D-1D abundance corrections. Applying these corrections lowers the CEMP fraction by up to 20% below [Fe/H]=-3 and alters the relative contribution of CEMP sub-classes. The fraction of CEMP-no stars increases while the number of CEMP-r/s stars decreases, due to the downward revision of absolute carbon abundances. These changes bring the Galactic carbon distribution into better agreement with GCE models assuming a 20% contribution from faint supernovae. Realistic model atmospheres are essential to reliably reconstruct the Galaxy's early chemical enrichment history.\n\n", "2509.24327": "2025-09-29, **Inferring Cosmological Parameters with Evidential Physics-Informed Neural Networks**, Hai Siong Tan et.al., [2509.24327v1](http://arxiv.org/abs/2509.24327v1)\n\n We examine the use of a novel variant of Physics-Informed Neural Networks to predict cosmological parameters from recent supernovae and baryon acoustic oscillations (BAO) datasets. Our machine learning framework generates uncertainty estimates for target variables and the inferred unknown parameters of the underlying PDE descriptions. Built upon a hybrid of the principles of Evidential Deep Learning, Physics-Informed Neural Networks, Bayesian Neural Networks and Gaussian Processes, our model enables learning of the posterior distribution of the unknown PDE parameters through standard gradient-descent based training. We apply our model to an up-to-date BAO dataset (Bousis et al. 2024) calibrated with the CMB-inferred sound horizon, and the Pantheon$+$ Sne Ia distances (Scolnic et al. 2018), examining the relative effectiveness and mutual consistency among the standard $\\Lambda$CDM, $w$CDM and $\\Lambda\\_s$CDM models. Unlike previous results arising from the standard approach of minimizing an appropriate $\\chi^2$ function, the posterior distributions for parameters in various models trained purely on Pantheon$+$ data were found to be largely contained within the $2\\sigma$ contours of their counterparts trained on BAO data. Their posterior medians for $h\\_0$ were within about $2\\sigma$ of one another, indicating that our machine learning-guided approach provides a different measure of the Hubble tension.\n\n", "2509.23547": "2025-09-28, **Particle Acceleration along Magnetic Fields as the Origin of Ear-like Structures in Supernova Remnants**, Huan Yu et.al., [2509.23547v1](http://arxiv.org/abs/2509.23547v1)\n\n The origin of ear-like structures with two opposite lobes extending from the shell of supernova remnants (SNRs) remains a subject of active debate, with proposed mechanisms ranging from jet-driven explosions to interactions with bipolar circumstellar media. We present a novel investigation using Particle-in-Cell (PIC) simulations to examine the dynamics of a spherical ejecta in magnetized media, revealing a different formation mechanism for these structures. Our results demonstrate that particle acceleration is significantly enhanced along the magnetic-field direction, producing substantial modifications to shock morphology. These effects naturally generate elongated protrusions bearing a remarkable similarity to the observed SNR ear structures. This magnetic alignment scenario represents a distinct mechanism from the existing jet-based and circumstellar interaction models. Our findings suggest that magnetic field orientation may serve as a crucial diagnostic for distinguishing between different ear formation mechanisms in SNRs.\n\n"}}