{"neutrino": {"2310.15136": "2023-10-23, **$B \\to K ν\\barν$, MiniBooNE and muon $g-2$ anomalies from a dark sector**, Alakabha Datta et.al., [2310.15136v1](http://arxiv.org/abs/2310.15136v1)\n\n Belle II has reported the first evidence for $B^+ \\to K^+\\nu\\bar\\nu$ with a branching ratio $2.8 \\sigma$ higher than the standard model expectation. We explain this, and the MiniBooNE and muon anomalous magnetic moment anomalies in a model with a dark scalar that couples to a slightly heavier sterile Dirac neutrino and that communicates with the visible sector via a Higgs portal. We make predictions for rare kaon and other $B$ meson decays.\n\n", "2310.14494": "2023-10-23, **A 1-D Special Relativistic Shock Tube where Stellar Fluid undergoes Neutrino Heating**, Gregory Mohammed et.al., [2310.14494v1](http://arxiv.org/abs/2310.14494v1)\n\n To investigate the physical nature of neutrino-heating on the result of a 1-dimensional core-collapse supernova. Colgate were the first to suggest that neutrinos may play a crucial role in core collapse supernova by taking up gravitational binding energy from the core and depositing it in the rest of the star. The fluid is contained in a shock tube in a region extending from the neutrino-sphere of a star out 1000 km, and irradiated with a neutrino flux emanating from the surface of the neutrino-sphere into the shock tube. Interaction due to electron-neutrino scattering off of fluid nucleons is used to account for neutrino heating of the fluid. The numerical method used is the Godunov method implementing an exact Riemann solver Rezzolla when needed. The simulated core-collapse produces an energy output of up to $10^{36}$J on a timescale of 3.33 s. It was found that the Godunov method performs very well using Sod data, with standard deviations of between $0.22-0.04$%. Thus, there is high confidence that the exact Riemann solver is working correctly and that the Godunov method is also reproducing the exact solutions to the Sod data with high confidence. A runtime of 3.33 s was used. The objective was to determine what would happen to the shock system over longer timescales, but the simulations showed an explosion in a much shorter time frame. It was found that the shock not only continues to move outward, but is also driven by large energy and pressure behind the shock. The density profiles show that fluid mass is pushed outward, but the fluid velocity actually reversed on timescales close to 3.33 s. In this paper, net mass movement occurs at 500-600 km and on a longer timescale of 3.33 s mass has moved out to 700 km. This supports the \\emph{delayed post bounce shock mechanism}.\n\n", "2310.14255": "2023-10-22, **High-energy Neutrinos from Merging Stellar-mass Black Holes in Active Galactic Nuclei Accretion Disk**, Jin-Ping Zhu et.al., [2310.14255v1](http://arxiv.org/abs/2310.14255v1)\n\n A population of binary stellar-mass black hole (BBH) mergers are believed to occur embedded in the accretion disk of active galactic nuclei (AGNs). In this {\\em Letter}, we demonstrate that the jets from these BBH mergers can propagate collimatedly within the disk atmosphere along with a forward shock and a reverse shock forming at the jet head. Efficient proton acceleration by these shocks is usually expected before the breakout, leading to the production of TeV$-$PeV neutrinos through interactions between these protons and electron-radiating photons via photon-meson production. AGN BBH mergers occurring in the outer regions of the disk are more likely to produce more powerful neutrino bursts. Taking the host AGN properties of the potential GW190521 electromagnetic (EM) counterpart as an example, one expects $\\gtrsim1$ neutrino events detectable by IceCube if the jet is on-axis and the radial location of the merger is $R\\gtrsim10^5R\\_{\\rm{g}}$, where $R\\_{\\rm{g}}$ is the gravitational radius of the supermassive BH. Neutrino bursts from AGN BBH mergers could be detected by IceCube following the observation of gravitational waves (GWs), serving as precursor signals before the detection of EM breakout signals. AGN BBH mergers are potential target sources for future joint GW, neutrino, and EM multi-messenger observations.\n\n"}, "dark matter": {"2310.14606": "2023-10-23, **Anisotropies in Scalar-Induced Gravitational-Wave Background from Inflaton-Curvaton Mixed Scenario with Sound Speed Resonance**, Yan-Heng Yu et.al., [2310.14606v1](http://arxiv.org/abs/2310.14606v1)\n\n We propose a new model to generate large anisotropies in the scalar-induced gravitational wave (SIGW) background via sound speed resonance in the inflaton-curvaton mixed scenario. Cosmological curvature perturbations are not only exponentially amplified at a resonant frequency, but also preserve significant non-Gaussianity of local type described by $f\\_{\\mathrm{nl}}$. Besides a significant enhancement of energy-density fraction spectrum, large anisotropies in SIGWs can be generated, because of super-horizon modulations of the energy density due to existence of primordial non-Gaussianity. A reduced angular power spectrum $\\tilde{C}\\_{\\ell}$ could reach an amplitude of $[\\ell(\\ell+1)\\tilde{C}\\_{\\ell}]^{1/2} \\sim 10^{-2}$, leading to potential measurements via planned gravitational-wave detectors such as DECIGO. The large anisotropies in SIGWs would serve as a powerful probe of the early universe, shedding new light on the inflationary dynamics, primordial non-Gaussianity, and primordial black hole dark matter.\n\n", "2310.14234": "2023-10-22, **Strong Gravitational Lensing by Sgr A* and M87* Black Holes embedded in Dark Matter Halo exhibiting string cloud and quintessential field**, Niyaz Uddin Molla et.al., [2310.14234v1](http://arxiv.org/abs/2310.14234v1)\n\n We investigate the strong gravitational lensing phenomena caused by a black hole with a dark matter halo. In this study, we examine strong gravitational lensing with two significant dark matter models: the universal rotation curve model and the cold dark matter model. To do this, we first numerically estimate the strong lensing coefficients and strong deflection angles for both the universal rotation curve and cold dark matter models. It is observed that the deflection angle, denoted as $\\alpha\\_D$, increases with the parameter $\\alpha$ while holding the value of $\\gamma \\cdot 2M$ constant. Additionally, it increases with the parameter $\\gamma \\cdot 2M$ while keeping the value of $\\alpha$ constant. The strong deflection angle, $\\alpha\\_D$, for the black hole with a dark matter halo, with parameters $\\alpha=0$ and $\\gamma \\cdot 2M$, greatly enhances the gravitational bending effect and surpasses the corresponding case of the standard Schwarzschild black hole ($A=0, B=0, \\alpha=0, \\gamma \\cdot 2M=0$). Furthermore, we investigate the astrophysical consequences through strong gravitational lensing observations, using examples of various supermassive black holes such as $M87^{*}$ and $SgrA^{*}$ located at the centers of several galaxies. It is observed that black holes with dark matter halos can be quantitatively distinguished and characterized from the standard Schwarzschild black hole ($A=0, B=0, \\alpha=0, \\gamma \\cdot 2M=0$). The findings in our analysis suggest that observational tests for black holes influenced by dark matter halos are indeed feasible and viable.\n\n"}, "supernova": {"2310.14841": "2023-10-23, **Exploring the circumstellar environment of Tycho's supernova remnant--I. The hydrodynamic evolution of the shock**, Ryosuke Kobashi et.al., [2310.14841v1](http://arxiv.org/abs/2310.14841v1)\n\n Among Type Ia supernova remnants (SNRs), Tycho's SNR has been considered as a typical object from the viewpoints of its spectroscopic, morphological and environmental properties. A recent reanalysis of Chandra data shows that its forward shock is experiencing a substantial deceleration since around 2007, which suggests recent shock interactions with a dense medium as a consequence of the cavity-wall environment inside a molecular cloud. Such a non-uniform environment can be linked back to the nature and activities of its progenitor. In this study, we perform hydrodynamic simulations to characterize Tycho's cavity-wall environment using the latest multi-epoch proper motion measurements of the forward shock. A range of parameters for the environment is explored in the hydrodynamic models to fit with the observation data for each azimuthal region. Our results show that a wind-like cavity with $\\rho(r)\\propto r^{-2}$ reconciles with the latest data better than a uniform medium with a constant density. In addition, our best-fit model favors an anisotropic wind with an azimuthally varying wind parameter. The overall result indicates a mass-loss rate which is unusually high for the conventional single-degenerate explosion scenario.\n\n", "2310.14431": "2023-10-22, **Gamma-ray detection of newly discovered Ancora SNR: G288.8-6.3**, C. Burger-Scheidlin et.al., [2310.14431v1](http://arxiv.org/abs/2310.14431v1)\n\n The supernova remnant (SNR) G288.8-6.3 was recently discovered as a faint radio shell at large Galactic latitude using observations with ASKAP in the EMU survey. Here, we make the first detailed investigation of the $\\gamma$-ray emission from the G288.8-6.3 region, aiming to characterise the high-energy emission in the GeV regime from the newly discovered SNR, dubbed Ancora. 15 years of Fermi-Large Area Telescope (LAT) data were analysed at energies between 400 MeV and 1 TeV and the excess seen in the region was modelled using different spatial and spectral models. We detect spatially extended $\\gamma$-ray emission coinciding with the radio SNR, with detection significance up to 8.8 $\\sigma$. A radial disk spatial model in combination with a power-law spectral model with an energy flux of $(4.80 \\pm 0.91) \\times 10^{-6}$ $\\text{MeV}$ $\\text{cm}^{-2}$ $\\text{s}^{-1}$, with the spectrum extending up to around 5 GeV was found to be the preferred model. Morphologically, hotspots seen above 1 GeV are well-correlated with the bright western part of the radio shell. The emission is more likely to be of leptonic origin given the estimated gas density in the region and the estimated distance and age of the SNR, but a hadronic scenario cannot be ruled out. Ancora is the eighth SNR detected at high Galactic latitude with Fermi-LAT. This new population of remnants has the potential to constrain the physics of particle diffusion and escape from SNRs into the Galaxy.\n\n", "2310.14407": "2023-10-22, **The progenitor of SN 2023ixf from hydrodynamical modelling**, M. C. Bersten et.al., [2310.14407v1](http://arxiv.org/abs/2310.14407v1)\n\n Context: Supernova (SN) 2023ixf is among the most nearby Type II SNe in the last decades. As such, there is a wealth of observational data of both the event itself and of the associated object identified in pre-explosion images. This allows to perform a variety of studies that aim at determining the SN properties and the nature of the putative progenitor star. Modelling of the light curve is a powerful method to derive physical properties independently of direct progenitor analyses. Aims: To investigate the physical nature of SN 2023ixf based on hydrodynamical modelling of its bolometric light curve and expansion velocities during the complete photospheric phase. Methods: A grid of one dimensional explosions was calculated for evolved stars of different masses. We derived properties of SN 2023ixf and its progenitor by comparing our models with the observations. Results: The observations are well reproduced by the explosion of a star with zero age main sequence mass of f $M\\_\\mathrm{ZAMS} = 12 M\\_\\odot$ , an explosion energy of $1.2 \\times 10^{51}$ erg, and a nickel production of 0.05M . This indicates that SN 2023ixf was a normal event. Our modelling suggests a limit of $M\\_\\mathrm{ZAMS} < 15 M\\_\\odot$ and therefore favours the low mass range among the results from pre-explosion observations.\n\n", "2310.14397": "2023-10-22, **Characterizing the Ordinary Broad-lined Type Ic SN 2023pel from the Energetic GRB 230812B**, Gokul P. Srinivasaragavan et.al., [2310.14397v1](http://arxiv.org/abs/2310.14397v1)\n\n We report observations of the optical counterpart of the long gamma-ray burst (LGRB) GRB 230812B, and its associated supernova (SN) SN 2023pel. The proximity ($z = 0.36$) and high energy ($E\\_{\\gamma, \\rm{iso}} \\sim 10^{53}$ erg) make it an important event to study as a probe of the connection between massive star core-collapse and relativistic jet formation. With a phenomenological power-law model for the optical afterglow, we find a late-time flattening consistent with the presence of an associated SN. SN 2023pel has an absolute peak $r$-band magnitude of $M\\_r = -19.46 \\pm 0.18$ mag (about as bright as SN 1998bw) and evolves on quicker timescales. Using a radioactive heating model, we derive a nickel mass powering the SN of $M\\_{\\rm{Ni}} = 0.38 \\pm 0.01$ $\\rm{M\\_\\odot}$, and a peak bolometric luminosity of $L\\_{\\rm{bol}} \\sim 1.3 \\times 10^{43}$ $\\rm{erg}$ $\\rm{s^{-1}}$. We confirm SN 2023pel's classification as a broad-lined Type Ic SN with a spectrum taken 15.5 days after its peak in $r$ band, and derive a photospheric expansion velocity of $v\\_{\\rm{ph}} = 11,300 \\pm 1,600$ $\\rm{km}$ $\\rm{s^{-1}}$ at that phase. Extrapolating this velocity to the time of maximum light, we derive the ejecta mass $M\\_{\\rm{ej}} = 1.0 \\pm 0.6$ $\\rm{M\\_\\odot}$ and kinetic energy $E\\_{\\rm{KE}} = 1.3^{+3.3}\\_{-1.2} \\times10^{51}$ $\\rm{erg}$. We find that GRB 230812B/SN 2023pel has SN properties that are mostly consistent with the overall GRB-SN population. The lack of correlations found in the GRB-SN population between SN brightness and $E\\_{\\gamma, \\rm{iso}}$ for their associated GRBs, across a broad range of 7 orders of magnitude, provides further evidence that the central engine powering the relativistic ejecta is not coupled to the SN powering mechanism in GRB-SN systems.\n\n", "2310.14373": "2023-10-22, **The Corona Australis star formation complex is accelerating away from the Galactic plane**, L. Posch et.al., [2310.14373v1](http://arxiv.org/abs/2310.14373v1)\n\n We study the kinematics of the recently discovered Corona Australis (CrA) chain of clusters by examining the 3D space motion of its young stars using Gaia DR3 and APOGEE-2 data. While we observe linear expansion between the clusters in the Cartesian XY directions, the expansion along Z exhibits a curved pattern. To our knowledge, this is the first time such a nonlinear velocity-position relation has been observed for stellar clusters. We propose a scenario to explain our findings, in which the observed gradient is caused by stellar feedback, accelerating the gas away from the Galactic plane. A traceback analysis confirms that the CrA star formation complex was located near the central clusters of the Scorpius Centaurus (Sco-Cen) OB association 10-15 Myr ago. It contains massive stars and thus offers a natural source of feedback. Based on the velocity of the youngest unbound CrA cluster, we estimate that a median number of about two supernovae would have been sufficient to inject the present-day kinetic energy of the CrA molecular cloud. This number agrees with that of recent studies. The head-tail morphology of the CrA molecular cloud further supports the proposed feedback scenario, in which a feedback force pushed the primordial cloud from the Galactic north, leading to the current separation of 100 pc from the center of Sco-Cen. The formation of spatially and temporally well-defined star formation patterns, such as the CrA chain of clusters, is likely a common process in massive star-forming regions.\n\n", "2310.14310": "2023-10-22, **Multi-band analyses of the bright GRB~230812B and the associated SN2023pel**, T. Hussenot-Desenonges et.al., [2310.14310v1](http://arxiv.org/abs/2310.14310v1)\n\n GRB~230812B is a bright and relatively nearby ($z =0.36$) long gamma-ray burst that has generated significant interest in the community and therefore has been subsequently observed over the entire electromagnetic spectrum. We report over 80 observations in X-ray, ultraviolet, optical, infrared, and sub-millimeter bands from the GRANDMA (Global Rapid Advanced Network for Multi-messenger Addicts) network of observatories and from observational partners. Adding complementary data from the literature, we then derive essential physical parameters associated with the ejecta and external properties (i.e. the geometry and environment) and compare with other analyses of this event (e.g. Srinivasaragavan et al. 2023). We spectroscopically confirm the presence of an associated supernova, SN2023pel, and we derive a photospheric expansion velocity of v $\\sim$ 17$\\times10^3$ km $s^{-1}$. We analyze the photometric data first using empirical fits of the flux and then with full Bayesian Inference. We again strongly establish the presence of a supernova in the data, with an absolute peak r-band magnitude $M\\_r = - 19.41 \\pm 0.10$. We find a flux-stretching factor or relative brightness $k\\_{\\rm SN}=1.04 \\pm 0.09$ and a time-stretching factor $s\\_{\\rm SN}=0.68 \\pm 0.05$, both compared to SN1998bw. Therefore, GRB 230812B appears to have a clear long GRB-supernova association, as expected in the standard collapsar model. However, as sometimes found in the afterglow modelling of such long GRBs, our best fit model favours a very low density environment ($\\log\\_{10}({n\\_{\\rm ISM}/{\\rm cm}^{-3}}) = -2.16^{+1.21}\\_{-1.30}$). We also find small values for the jet's core angle $\\theta\\_{\\rm core}={1.70^{+1.00}\\_{-0.71}} \\ \\rm{deg}$ and viewing angle. GRB 230812B/SN2023pel is one of the best characterized afterglows with a distinctive supernova bump.\n\n"}}