{"neutrino": {"2311.13529": "2023-11-22, **Euclid preparation TBD. Modelling spectroscopic clustering on mildly nonlinear scales in beyond-$Λ$CDM models**, Euclid Collaboration et.al., [2311.13529v1](http://arxiv.org/abs/2311.13529v1)\n\n We investigate the approximations needed to efficiently predict the large-scale clustering of matter and dark matter halos in beyond-$\\Lambda$CDM scenarios. We examine the normal branch of the Dvali-Gabadadze-Porrati model, the Hu-Sawicki $f(R)$ model, a slowly evolving dark energy, an interacting dark energy model and massive neutrinos. For each, we test approximations for the perturbative kernel calculations, including the omission of screening terms and the use of perturbative kernels based on the Einstein-de Sitter universe; we explore different infrared-resummation schemes, tracer bias models and a linear treatment of massive neutrinos; we employ two models for redshift space distortions, the Taruya-Nishimishi-Saito prescription and the Effective Field Theory of Large-Scale Structure. This work further provides a preliminary validation of the codes being considered by Euclid for the spectroscopic clustering probe in beyond-$\\Lambda$CDM scenarios. We calculate and compare the $\\chi^2$ statistic to assess the different modelling choices. This is done by fitting the spectroscopic clustering predictions to measurements from numerical simulations and perturbation theory-based mock data. We compare the behaviour of this statistic in the beyond-$\\Lambda$CDM cases, as a function of the maximum scale included in the fit, to the baseline $\\Lambda$CDM case. We find that the Einstein-de Sitter approximation without screening is surprisingly accurate for all cases when comparing to the halo clustering monopole and quadrupole obtained from simulations. Our results suggest that the inclusion of multiple redshift bins, higher-order multipoles, higher-order clustering statistics (such as the bispectrum) and photometric probes such as weak lensing, will be essential to extract information on massive neutrinos, modified gravity and dark energy.\n\n", "2311.13520": "2023-11-22, **Imprint of massive neutrinos on Persistent Homology of large-scale structure**, M. H. Jalali Kanafi et.al., [2311.13520v1](http://arxiv.org/abs/2311.13520v1)\n\n Exploiting the Persistent Homology technique and an associated complementary representation which enables us to construct a synergistic pipeline for different topological features quantified by Betti curves in reducing the degeneracy between cosmological parameters, we investigate the footprint of summed massive neutrinos ($M\\_{\\nu}$) in different density fields simulated by the publicly available Quijote suite. Evolution of topological features in the context of super-level filtration on three-dimensional density fields, reveals remarkable indicators for constraining the $M\\_{\\nu}$ and $\\sigma\\_8$. The abundance of 2-holes is more sensitive to the presence of $M\\_{\\nu}$, also the persistence of topological features plays a crucial role in cosmological inference and reducing the degeneracy associated with $M\\_{\\nu}$ simulation rather than their birth thresholds when either the total matter density ($m$) field or those part including only cold dark matter+baryons ($cb$) is utilized. Incorporating the Betti-1 and Betti-2 for $cb$ part of $M^+\\_{\\nu}$ simulation marginalized over the thresholds implies $5\\%$ variation compared to the massless neutrinos simulation. The constraint on $M\\_{\\nu}$ from $\\beta\\_k$ and its joint analysis with birth threshold and persistency of topological features for total mass density field smoothed by $R=5$ Mpc h$^{-1}$ at zero redshift reach to $0.0172$ eV and $0.0152$ eV, at $1\\sigma$ confidence interval, respectively.\n\n", "2311.13276": "2023-11-22, **Impact of primordial black holes on heavy neutral leptons searches in the framework of resonant leptogenesis**, Roberta Calabrese et.al., [2311.13276v1](http://arxiv.org/abs/2311.13276v1)\n\n We investigate the effects on sub-TeV resonant leptogenesis of Primordial Black Holes with masses from $10^6$ to $\\sim 10^9$ g. The latter might dominate the energy content of the Universe altering its evolution and, eventually, diluting the final baryon asymmetry. We find that, depending on the mass and abundance of Primordial Black Holes, the parameter space of sub-TeV resonant leptogenesis shrinks towards higher Right-Handed Neutrino masses and smaller active-sterile mixing. Remarkably, this translates into important implications for the experimental searches of heavy neutral leptons. Conversely, we demonstrate that a possible future detection of sub-TeV heavy neutral leptons would disfavour regions of the parameter space of Primordial Black Holes currently allowed.\n\n"}, "dark matter": {"2311.13578": "2023-11-22, **Hadronic Mono-$W'$ Probes of Dark Matter at Colliders**, Ryan Holder et.al., [2311.13578v1](http://arxiv.org/abs/2311.13578v1)\n\n Particle collisions at the energy frontier can probe the nature of invisible dark matter via production in association with recoiling visible objects. We propose a new potential production mode, in which dark matter is produced by the decay of a heavy dark Higgs boson radiated from a heavy $W'$ boson. In such a model, motivated by left-right symmetric theories, dark matter would not be pair produced in association with other recoiling objects due to its lack of direct coupling to quarks or gluons. We study the hadronic decay mode via $W'\\rightarrow tb$ and estimate the LHC exclusion sensitivity at 95\\% confidence level to be $10^2-10^5$ fb for $W'$ boson masses between 250 and 1750 GeV.\n\n", "2311.13352": "2023-11-22, **Fuzzy Dark Matter Dynamics and the Quasiparticle Hypothesis**, Boris Zupancic et.al., [2311.13352v1](http://arxiv.org/abs/2311.13352v1)\n\n Dark matter may be composed of ultra-light bosons whose de Broglie wavelength in galaxies is of order 1 kpc. The standard model for this fuzzy dark matter (FDM) is a complex scalar field that obeys the Schr\\\"odinger-Poisson equations. The wavelike nature of FDM leads to fluctuations in the gravitational field that can pump energy into the stellar components of a galaxy. Heuristic arguments and theoretical analyses suggest that these fluctuations can be modelled by replacing FDM with a system of quasiparticles (QPs). We test this hypothesis by comparing self-consistent simulations of a Schr\\\"odinger field with those using a system of QPs in one spatial dimension. Simulations of pure FDM systems allow us to derive a phenomenological relation between the number of QPs that is required to model FDM with a given de Broglie wavelength. We also simulate systems of FDM and stars and find that the FDM pumps energy into the stars whether it is described by QPs or a Schr\\\"odinger field with the FDM adiabatically contracting and the stellar system adiabatically expanding. However, we find that QPs overestimate dynamical heating.\n\n"}, "supernova": {"2311.13388": "2023-11-22, **The photospheres of the hottest fastest stars in the Galaxy**, Klaus Werner et.al., [2311.13388v1](http://arxiv.org/abs/2311.13388v1)\n\n We perform nonlocal thermodynamic equilibrium (NLTE) model atmosphere analyses of the three hottest hypervelocity stars (space velocities between $\\approx$ 1500-2800 km s$^{-1}$) known to date, which were recently discovered spectroscopically and identified as runaways from Type Ia supernovae. The hottest of the three (J0546$+$0836, effective temperature $T\\_\\mathrm{eff}$ = 95,000 $\\pm$ 15,000 K, surface gravity log g = $5.5 \\pm 0.5$) has an oxygen-dominated atmosphere with a significant amount of carbon (C = $0.10 \\pm 0.05$, O = $0.90 \\pm 0.05$, mass fractions). Its mixed absorption+emission line spectrum exhibits photospheric absorption lines from O V and O VI as well as O III and O IV emission lines that are formed in a radiation-driven wind with a mass-loss rate of the order of $10^{-8}$ $M\\_\\odot$ yr$^{-1}$. Spectroscopically, J0546$+$0836 is a [WC]-PG1159 transition-type pre-white dwarf. The second object (J0927$-$6335) is a PG1159-type white dwarf with a pure absorption-line spectrum dominated by C III/C IV and O III/O IV. We find $T\\_\\mathrm{eff}$ = 60,000 $\\pm$ 5000 K, log g = $7.0 \\pm 0.5$, and a carbon- and oxygen-dominated atmosphere with C = $0.47 \\pm 0.25$, O = $0.48 \\pm 0.25$, and possibly a minute amount of helium (He = $0.05 \\pm 0.05$). Comparison with post-AGB evolutionary tracks suggests a mass of $M\\approx0.5$ $M\\_\\odot$ for both objects, if such tracks can safely be applied to these stars. We find the third object (J1332$-$3541) to be a relatively massive ($M=0.89 M\\_\\odot$) hydrogen-rich (DAO) white dwarf with $T\\_\\mathrm{eff}$ = 65,657 $\\pm$ 2390 K, log g = $8.38 \\pm 0.08$, and abundances H = $0.65 \\pm 0.04$ and He = $0.35 \\pm 0.04$. We discuss our results in the context of the \"dynamically driven double-degenerate double-detonation\" (D$^6$) scenario proposed for the origin of these stars.\n\n", "2311.13185": "2023-11-22, **Forecast of joint analysis of cosmic shear and supernovae magnification from CSST and LSST**, Ye Cao et.al., [2311.13185v1](http://arxiv.org/abs/2311.13185v1)\n\n Cosmic shear and cosmic magnification reflect the same gravitational lensing field. Each of these two probes are affected by different systematics. We study the auto- and cross-correlations of the cosmic shear from the China Space Survey Telescope (CSST) and cosmic magnification of supernovae from Large Synoptic Survey Telescope (LSST). We want to answer, to what extent, by adding the magnification data we can remove the systematic bias in cosmic shear measurement. We generate the mock shear/magnification maps based on the correlation between of different tomographic bins. After obtaining the corrected power spectra, we adopt the Markov Chain Monte Carlo (MCMC) technique to fit the theoretical models, and investigate the constraints on the cosmological and nuisance parameters. We find that the with only cosmic shear data, there are $1\\sigma$ bias in $\\sigma\\_8$ and intrinsic alignment model parameters. By adding the magnification data, we are able to remove these biases perfectly.\n\n"}}