{"neutrino": {"2307.06413": "2023-07-12, **Measurement of triple-differential inclusive muon-neutrino charged-current cross section on argon with the MicroBooNE detector**, P. Abratenko et.al., [2307.06413v1](http://arxiv.org/abs/2307.06413v1)\n\n We report the first measurement of the differential cross section $d^{2}\\sigma (E\\_{\\nu})/ d\\cos(\\theta\\_{\\mu}) dP\\_{\\mu}$ for inclusive muon-neutrino charged-current scattering on argon. This measurement utilizes data from 6.4$\\times10^{20}$ protons on target of exposure collected using the MicroBooNE liquid argon time projection chamber located along the Fermilab Booster Neutrino Beam with a mean neutrino energy of approximately 0.8~GeV. The mapping from reconstructed kinematics to truth quantities, particularly from reconstructed to true neutrino energy, is validated by comparing the distribution of reconstructed hadronic energy in data to that of the model prediction in different muon scattering angle bins after conditional constraint from the muon momentum distribution in data. The success of this validation gives confidence that the missing energy in the MicroBooNE detector is well-modeled in simulation, enabling the unfolding to a triple-differential measurement over muon momentum, muon scattering angle, and neutrino energy. The unfolded measurement covers an extensive phase space, providing a wealth of information useful for future liquid argon time projection chamber experiments measuring neutrino oscillations. Comparisons against a number of commonly used model predictions are included and their performance in different parts of the available phase-space is discussed.\n\n", "2307.06353": "2023-07-12, **High-energy electromagnetic, neutrino, and cosmic-ray emission by stellar-mass black holes in disks of active galactic nuclei**, Hiromichi Tagawa et.al., [2307.06353v1](http://arxiv.org/abs/2307.06353v1)\n\n Some Seyfert galaxies are detected in high-energy gamma rays, but the mechanism and site of gamma-ray emission are unknown. Also, the origins of the cosmic high-energy neutrino and MeV gamma-ray backgrounds have been veiled in mystery since their discoveries. We propose emission from stellar-mass BHs (sBHs) embedded in disks of active galactic nuclei (AGN) as their possible sources. These sBHs are predicted to launch jets due to the Blandford-Znajek mechanism, which can produce intense electromagnetic, neutrino, and cosmic-ray emissions. We investigate whether these emissions can be the sources of cosmic high-energy particles. We find that emission from internal shocks in the jets can explain gamma rays from nearby radio-quiet Seyfert galaxies including NGC1068, if the Lorentz factor of the jets ($\\Gamma\\_{\\rm j}$) is high. On the other hand, for moderate $\\Gamma\\_{\\rm j}$, the emission can significantly contribute to the background gamma-ray and neutrino intensities in the $\\sim {\\rm MeV}$ and $\\lesssim {\\rm PeV}$ bands, respectively. Furthermore, for moderate $\\Gamma\\_{\\rm j}$ with efficient amplification of the magnetic field and cosmic-ray acceleration, the neutrino emission from NGC1068 and the ultrahigh-energy cosmic rays can be explained. These results suggest that the neutrino flux from NGC1068 as well as the background intensities of ${\\rm MeV}$ gamma rays, neutrinos, and the ultrahigh-energy cosmic rays can be explained by a unified model. Future MeV gamma-ray satellites will test our scenario for neutrino emission.\n\n", "2307.06208": "2023-07-12, **Decoherence effects on lepton number violation from heavy neutrino-antineutrino oscillations**, Stefan Antusch et.al., [2307.06208v1](http://arxiv.org/abs/2307.06208v1)\n\n We study decoherence effects and phase corrections in heavy neutrino-antineutrino oscillations (NNOs), based on quantum field theory with external wave packets. Decoherence damps the oscillation pattern, making it harder to resolve experimentally. Additionally, it enhances lepton number violation (LNV) for processes in symmetry-protected low-scale seesaw models by reducing the destructive interference between mass eigenstates. We discuss a novel time-independent shift in the phase and derive formulae for calculating decoherence effects and the phase shift in the relevant regimes, which are the no dispersion regime and transverse dispersion regime. We find that the phase shift can be neglected in the parameter region under consideration since it is small apart from parameter regions with large damping. In the oscillation formulae, decoherence can be included by an effective damping parameter. We discuss this parameter and present averaged results, which apply to simulations of NNOs in the dilepton-dijet channel at the HL-LHC. We show that including decoherence effects can dramatically change the theoretical prediction for the ratio of LNV over LNC events.\n\n", "2307.06192": "2023-07-12, **Failed supernova simulations beyond black hole formation**, Takami Kuroda et.al., [2307.06192v1](http://arxiv.org/abs/2307.06192v1)\n\n We present an axisymmetric failed supernova simulation beyond black hole formation, for the first time with numerical relativity and two-moment multi energy neutrino transport. To ensure stable numerical evolution, we use an excision method for neutrino radiation-hydrodynamics within the inner part of black hole domain. We demonstrate that our excision method is capable to stably evolve the radiation-hydrodynamics in dynamical black hole spacetime. As a remarkable signature of the final moment of PNS, we find the emergence of high energy neutrinos. Those high energy neutrinos are associated with the proto-neutron star shock surface being swallowed by the central black hole and could be a possible observable of failed supernovae.\n\n", "2307.05969": "2023-07-12, **QCD effective charges from low-energy neutrino structure functions**, Tanjona Rabemananjara et.al., [2307.05969v1](http://arxiv.org/abs/2307.05969v1)\n\n We present a new perspective on the study of the behavior of the strong coupling $\\alpha\\_s(Q^2)$ -- the fundamental coupling underlying the interactions between quarks and gluons as described by the Quantum Chromodynamics (QCD) -- in the low-energy infrared (IR) regime. We rely on the NNSF$\\nu$ determination of neutrino-nucleus structure functions valid for all values of $Q^2$ from the photoproduction to the high-energy region to define an effective charge following the the Gross-Llewellyn Smith (GLS) sum rule. As a validation, our predictions for the low-energy QCD effective charge are compared to experimental measurements provided by JLab.\n\n"}, "dark matter": {"2307.06823": "2023-07-13, **Multi-TeV dark matter density in the inner Milky Way halo: spectral and dynamical constraints**, Jaume Zuriaga-Puig et.al., [2307.06823v1](http://arxiv.org/abs/2307.06823v1)\n\n We develop a comprehensive study of the gamma-ray flux observed by H.E.S.S. in 5 regions of the Galactic Center (GC). Motivated by previous works on a possible Dark Matter (DM) explanation for the TeV cut-off observed in the innermost $\\sim 16$ pc of the Galaxy, we aim to constrain the DM density profile up to a radius $\\sim 450$ pc from the GC. In this region, cosmological simulations and Galactic dynamics studies fail to produce a strong prediction of the DM profile. With our proof-of-concept analysis, we set upper limits on the density distribution of thermal multi-TeV WIMPs, compatible with the observed gamma-ray flux. The results agree with the hypothesis of a DM density enhancement in the GC with respect to the benchmark NFW profile ($\\gamma=1$) and allow us to exclude profiles with a slope $\\gamma \\gtrsim 1.3$. We also investigate the possibility that such an enhancement could be related to the existence of a DM spike associated with the supermassive black hole Sgr A*. We find out that the existence of an adiabatic DM spike smoothed by the scattering off of WIMPs by the bulge stars may be consistent with the observed gamma-ray flux if the spike forms on an underlying generalized NFW profile with $\\gamma \\lesssim 0.8$, corresponding to a spike slope $\\gamma\\_{sp-star}= 1.5$ and radius $R\\_\\text{sp-stars} \\sim 25$-$30$ pc. Instead, in the extreme case of the instantaneous growth of the black hole, the profile could have up to $\\gamma \\sim 1.2$, a corresponding $\\gamma\\_{sp-inst}=1.4$ and $R\\_\\text{sp-inst}\\sim 15$-$25$ pc. Moreover, the results of our analysis of the total DM mass enclosed within the S2 orbit are less stringent than the spectral analysis. Our work aims to guide future studies of the GC region, with both current and next-generation telescopes, like the next Cherenkov Telescope Array, that will be able to scan the GC with improved flux sensitivity and angular resolution.\n\n", "2307.06804": "2023-07-13, **CLASH-VLT: The inner slope of the MACS J1206.2-0847 mass density profile**, A. Biviano et.al., [2307.06804v1](http://arxiv.org/abs/2307.06804v1)\n\n The inner slope gammaDM of the dark matter (DM) density profile of cosmological halos carries information about the properties of DM and/or baryonic processes affecting the halo gravitational potential. Cold DM cosmological simulations predict steep inner slopes, gammaDM>~1. We test this prediction on the MACS J1206.2-0847 cluster at redshift z=0.44, whose DM density profile was claimed to be cored at the center. We determine the cluster DM density profile from 2 kpc from the cluster center to the virial radius (~2 Mpc), using the velocity distribution of ~500 cluster galaxies and the velocity dispersion profile of the Brightest Cluster Galaxy (BCG), obtained from VIMOS@VLT and MUSE@VLT data. We solve the Jeans equation of dynamical equilibrium using an upgraded version of the MAMPOSSt method. The total mass profile is modeled as a sum of a generalized-NFW profile that describes the DM component, allowing for a free inner slope of the density profile, a Jaffe profile that describes the BCG stellar mass component, and a non-parametric baryonic profile that describes the sum of the remaining galaxy stellar mass and of the hot intra-cluster gas mass. Our total mass profile is in remarkable agreement with independent determinations based on X-ray observations and strong lensing. We find gammaDM=0.7 -0.1 +0.2 (68% confidence levels), consistent with predictions from recent LambdaCDM cosmological numerical simulations.\n\n", "2307.06798": "2023-07-13, **Current status and desired accuracy of the isotopic production cross-sections relevant to astrophysics of cosmic rays II. Fluorine to Silicon (and updated LiBeB)**, Yoann Génolini et.al., [2307.06798v1](http://arxiv.org/abs/2307.06798v1)\n\n High-precision cosmic-ray data from ongoing and recent past experiments (Voyager, ACE-CRIS, PAMELA, ATIC, CREAM, NUCLEON, AMS-02, CALET, DAMPE) are being released in the tens of MeV/n to multi-TeV/n energy range. Astrophysical and dark matter interpretations of these data are limited by the precision of nuclear production cross-sections. In Paper I, PRC 98, 034611 (2018), we set up a procedure to rank nuclear reactions whose desired measurements will enable us to fully exploit currently available data on CR Li to N ($Z=3-7$) species. Here we extend these rankings to O up to Si nuclei ($Z=8-14$), also updating our results on the LiBeB species. We also highlight how comprehensive new high precision nuclear data, that could e.g. be obtained at the SPS at CERN, would be a game-changer for the determination of key astrophysical quantities (diffusion coefficient, halo size of the Galaxy) and indirect searches for dark matter signatures.\n\n", "2307.06765": "2023-07-13, **Sensing directional forces in levitated optomechanics**, J. M. H. Gosling et.al., [2307.06765v1](http://arxiv.org/abs/2307.06765v1)\n\n Optomechanical devices are being harnessed as sensors of ultraweak forces for applications ranging from inertial sensing to the search for the elusive dark matter; For the latter, the focus is on detection of either higher energy single recoils or ultralight, narrowband sources; a directional signal is expected. However, the possibility of searching for a directional broadband signal need not be excluded; with this and other applications in mind, we apply a stochastic signal with a well defined direction, $\\Psi$, to a trapped and cooled levitated nanosphere. We find that cross-correlation power spectra offer a calibration-free distinctive signature of the presence of a directional force, and its orientation quadrant, unlike normal power spectral densities (PSDs). With calibration we are able to accurately measure the angle $\\Psi$, akin to a force compass in a plane.\n\n", "2307.06757": "2023-07-13, **PBHs and GWs from $\\mathbb{T}^2$-inflation and NANOGrav 15-year data**, Seyed Ali Hosseini Mansoori et.al., [2307.06757v1](http://arxiv.org/abs/2307.06757v1)\n\n In this paper, we propose a novel mechanism in $\\mathbb{T}^2$-inflation to enhance the power spectrum large enough to seed primordial black holes (PBHs) formation. To accomplish this, we consider the coupling function between the inflaton field and $\\mathbb{T}^2= T\\_{\\mu \\nu}T^{\\mu \\nu}$ term. PBHs formed within this scenario can contribute partially or entirely to dark matter (DM) abundance. Furthermore, the amplification in the scalar power spectrum will concurrently produce significant scalar-induced gravitational waves (SIGWs) as a second-order effect. In addition, the energy spectrum associated with SIGWs can be compatible with the recent NANOGrav 15-year stochastic gravitational wave detection and fall into the sensitivity range of other forthcoming GW observatories.\n\n", "2307.06690": "2023-07-13, **Anti-de Sitterian \"massive\" elementary systems and their Minkowskian and Newtonian limits**, Mohammad Enayati et.al., [2307.06690v1](http://arxiv.org/abs/2307.06690v1)\n\n We elaborate the definition and properties of ''massive\" elementary systems in the (1+3)-dimensional Anti-de Sitter (AdS$\\_4$) spacetime, on both classical and quantum levels. We fully exploit the symmetry group Sp$(4,\\mathbb R)$, that is, the two-fold covering of SO$\\_0(2,3)$ (Sp$(4,\\mathbb R) \\sim$ SO$\\_0(2,3)\\times \\mathbb Z\\_2$), recognized as the relativity/kinematical group of motions in AdS$\\_4$ spacetime. In particular, we discuss that the group coset Sp$(4,\\mathbb R)$/S(U(1)x SU(2)), as one of the Cartan classical domains, can be interpreted as a phase space for the set of free motions of a test massive particle on AdS$\\_4$ spacetime; technically, in order to facilitate the computations, the whole process is carried out in terms of complex quaternions. The (projective) unitary irreducible representations (UIRs) of the Sp$(4,\\mathbb R)$ group, describing the quantum version of such motions, are found in the discrete series of the Sp$(4,\\mathbb R)$ UIRs. We also describe the null-curvature (Poincar\\'{e}) and non-relativistic (Newton-Hooke) contraction limits of such systems, on both classical and quantum levels. On this basis, we unveil the dual nature of ''massive\" elementary systems living in AdS$\\_4$ spacetime, as each being a combination of a Minkowskian-like massive elementary system with an isotropic harmonic oscillator arising from the AdS$\\_4$ curvature and viewed as a Newton-Hooke elementary system. This matter-vibration duality will take its whole importance in the quantum regime (in the context of the validity of the equipartition theorem) in view of its possible r\\^{o}le in the explanation of the current existence of dark matter.\n\n", "2307.06660": "2023-07-13, **Design of a mobile neutron spectrometer for the Laboratori Nazionali del Gran Sasso (LNGS)**, Melih Solmaz et.al., [2307.06660v1](http://arxiv.org/abs/2307.06660v1)\n\n Environmental neutrons are a source of background for rare event searches (e.g., dark matter direct detection and neutrinoless double beta decay experiments) taking place in deep underground laboratories. The overwhelming majority of these neutrons are produced in the cavern walls by means of intrinsic radioactivity of the rock and concrete. Their flux and spectrum depend on time and location. Precise knowledge of this background is necessary to devise sufficient shielding and veto mechanisms, improving the sensitivity of the neutron-susceptible underground experiments. In this report, we present the design and the expected performance of a mobile neutron detector for the LNGS underground laboratory. The detector is based on capture-gated spectroscopy technique and comprises essentially a stack of plastic scintillator bars wrapped by gadolinium foils. The extensive simulation studies demonstrate that the detector will be capable of measuring ambient neutrons at low flux levels ($\\sim$$10^{-6}\\,\\mathrm{n/cm^2/s}$) at LNGS, where the ambient gamma flux is by about 5 orders of magnitude larger.\n\n", "2307.06586": "2023-07-13, **Dark baryon from pure Yang-Mills theory and its GW signature from cosmic strings**, Masaki Yamada et.al., [2307.06586v1](http://arxiv.org/abs/2307.06586v1)\n\n We point out that SO($2N$) pure Yang-Mills theory provides a candidate for dark matter (DM) without the explicit need to impose any additional symmetry. The DM candidate is a particular type of glueball, which we refer to as a baryonic glueball, that is naturally stable for a moderately large $N$. In this case, the intercommutation probability of cosmic strings (or macroscopic color flux tubes) is quite low, which offers characteristic gravitational wave signals to test our model. In particular, our model can simultaneously account for both abundance of DM and the recently reported gravitational wave signals detected in pulsar timing array experiments, including NANOGrav.\n\n", "2307.06376": "2023-07-12, **Probing a Dark Sector with Collider Physics, Direct Detection, and Gravitational Waves**, Giorgio Arcadi et.al., [2307.06376v1](http://arxiv.org/abs/2307.06376v1)\n\n We assess the complementarity between colliders, direct detection searches, and gravitational wave interferometry in probing a scenario of dark matter in the early universe. The model under consideration contains a B-L gauge symmetry and a vector-like fermion which acts as the dark matter candidate. The fermion induces significant a large dark matter-nucleon scattering rate, and the Z' field produces clear dilepton events at colliders. Thus, direct detection experiments and colliders severely constrain the parameter space in which the correct relic density is found in agreement with the data. Nevertheless, little is known about the new scalar responsible for breaking the B-L symmetry. If this breaking occurs via a first-order phase transition at a TeV scale, it could lead to gravitational waves in the mHz frequency range detectable by LISA, DECIGO, and BBO instruments. The spectrum is highly sensitive to properties of the scalar sector and gauge coupling. We show that a possible GW detection, together with information from colliders and direct detection experiments, can simultaneously pinpoint the scalar self-coupling, and narrow down the dark matter mass where a thermal relic is viable.\n\n", "2307.06369": "2023-07-12, **Fusing photons into nothing, a new search for invisible ALPs and Dark Matter at Belle II**, Francesca Acanfora et.al., [2307.06369v1](http://arxiv.org/abs/2307.06369v1)\n\n We consider an axion-like particle coupled to the Standard Model photons and decaying invisibly at Belle II. We propose a new search in the $e^+e^-+\\text{invisible}$ channel that we compare against the standard $\\gamma+\\text{invisible}$ channel. We find that the $e^+e^-+\\text{invisible}$ channel has the potential to ameliorate the reach for the whole ALP mass range. This search leverages dedicated kinematic variables which significantly suppress the Standard Model background. We explore the implications of our expected reach for Dark Matter freeze-out through ALP-mediated annihilations.\n\n", "2307.06320": "2023-07-12, **Bayesian analysis of Unified Dark Matter models with fast transition: can they alleviate the $H_{0}$ tension?**, Emmanuel Frion et.al., [2307.06320v1](http://arxiv.org/abs/2307.06320v1)\n\n We consider cosmological models in which Dark Matter (DM) and Dark Energy (DE) are described by a single component, dubbed Unified Dark Matter (UDM) models, in which the DE-like part can have an equation state $<-1$ at late times without violating the null energy condition. In this paper, we investigate whether this feature can relieve the Hubble tension. We perform a Bayesian analysis of the model using SNIa data from Pantheon, the CMB distance prior from Planck, and the prior on the absolute magnitude $M$ of SNIa from SH0ES. The data suggests a smooth transition taking place at redshifts $z\\_{\\rm t} \\simeq 2.85$, which provides a value $H\\_0=69.64\\pm 0.88$ for the Hubble constant, slightly alleviating the tension by $\\sim 1.5 \\sigma$. We also discuss the importance of using the prior on $M$ for constraining this model.\n\n", "2307.06063": "2023-07-12, **Bending instabilities of m=1 mode in disc galaxies: interplay between dark matter halo and vertical pressure**, Sagar S. Goyary et.al., [2307.06063v1](http://arxiv.org/abs/2307.06063v1)\n\n A self-gravitating, differentially rotating galactic disc under vertical hydrostatic equilibrium is supported by the vertical pressure gradient force against the gravitational collapse. Such discs are known to support various bending modes e.g., warps, corrugation, or scalloping (typically, higher order bending modes) of which m=1 bending modes (warps) are the most prevalent ones in galactic discs. Here, we present a detailed theoretical analysis of the bending instability in realistic models of disc galaxies in which an exponential stellar disc is under vertical equilibrium and residing in a cold rigid dark matter halo. A quadratic eigenvalue equation describing the bending modes is formulated and solved for the complete eigen spectrum for a set of model disc galaxies by varying their physical properties such as disc scale-height, and dark matter halo mass. It is shown that the vertical pressure gradient force can excite unstable bending modes in such a disc as well as large scale discrete modes. Further, it is shown that the unstable eigen-modes in a thinner disc grow faster than those in a thicker disc. The bending instabilities are found to be suppressed in discs dominated by massive dark matter halo. We estimate the growth timescales and corresponding wavelength of the m=1 unstable bending modes in Milky Way like galaxies and discuss its implication.\n\n", "2307.06032": "2023-07-12, **From Vlasov-Poisson to Schrödinger-Poisson: dark matter simulation with a quantum variational time evolution algorithm**, Luca Cappelli et.al., [2307.06032v1](http://arxiv.org/abs/2307.06032v1)\n\n Cosmological simulations describing the evolution of density perturbations of a self-gravitating collisionless Dark Matter (DM) fluid in an expanding background, provide a powerful tool to follow the formation of cosmic structures over wide dynamic ranges. The most widely adopted approach, based on the N-body discretization of the collisionless Vlasov-Poisson (VP) equations, is hampered by an unfavourable scaling when simulating the wide range of scales needed to cover at the same time the formation of single galaxies and of the largest cosmic structures. On the other hand, the dynamics described by the VP equations is limited by the rapid increase of the number of resolution elements (grid points and/or particles) which is required to simulate an ever growing range of scales. Recent studies showed an interesting mapping of the 6-dimensional+1 (6D+1) VP problem into a more amenable 3D+1 non-linear Schr\\\"odinger-Poisson (SP) problem for simulating the evolution of DM perturbations. This opens up the possibility of improving the scaling of time propagation simulations using quantum computing. In this paper, we develop a rigorous formulation of a variational-time evolution quantum algorithm for the simulation of the SP equations to follow DM perturbations, presenting a thorough analysis of the scaling of the algorithm as a function of spatial dimensions and resolution. Finally we investigate the transition of the SP dynamics towards the classical limit, which could become an efficient alternative to the solution of the VP equation.\n\n", "2307.05880": "2023-07-12, **Constraints on Self-Interacting dark matter from relaxed galaxy groups**, Gopika K. et.al., [2307.05880v1](http://arxiv.org/abs/2307.05880v1)\n\n Self-interacting dark matter (SIDM) has been proposed as an alternative to the standard collisionless cold dark matter to explain the diversity of galactic rotation curves and core-cusp problems seen at small scales. Here, we estimate the constraints on SIDM for a sample of 11 relaxed galaxy groups with X-ray observations from Chandra and XMM-Newton. We fit the dark matter density distribution to the Einasto profile and use the estimated Einasto $\\alpha$ parameter to constrain the SIDM cross-section, based on the empirical relation between the two, which was obtained in Eckert et al (2022). We obtain a non-zero central estimate for the cross-section per unit mass ($\\sigma/m$) for seven groups, with the most precise estimate obtained for NGC 5044, given by $\\sigma/m=0.165 \\pm 0.025~\\rm{cm^2/g}$, for dark matter velocity dispersion of about 300 km/sec. For the remaining four groups, we obtain 95% c.l. upper limits on $\\sigma/m < 0.16-6.61~\\rm{cm^2/g}$ with dark matter velocity dispersions between 200-500 km/sec, with the most stringent limit for our sample obtained for the group MKW 4, given by $\\sigma/m< 0.16~\\rm{cm^2/g}$ for dark matter velocity dispersion of about 350 km/sec.\n\n"}, "supernova": {"2307.06911": "2023-07-13, **Forecasting constraints on the baryon mass fraction in the IGM from fast radio bursts and type Ia supernovae**, Thais Lemos et.al., [2307.06911v1](http://arxiv.org/abs/2307.06911v1)\n\n Fast Radio Bursts (FRBs) are transient events with a high energy and short duration in the radio frequency. By identifying the origin of the pulse, it is possible to measure the redshift of the host galaxy, which can be used to constrain cosmological and astrophysical parameters and test aspects of fundamental physics when combined with the observed dispersion measure ($DM$). However, some factors limit the application of FRBs in cosmology: (i) the current poor modelling of the fluctuations in the $DM$ due to spatial variation in the cosmic electrons density; (ii) the fact that the fraction of baryon mass in the intergalactic medium ($f\\_{IGM}$) is degenerated with some cosmological parameters; (iii) the limited current knowledge about host galaxy contribution ($DM\\_{host}$). In this work, we investigate the impact of different redshift distribution models of FRBs to constrain the baryon fraction in the IGM and host galaxy contribution. We use a cosmological model-independent method developed in previous work \\cite{Lemos2023} to perform the analysis and combine simulated FRB data from Monte Carlo simulation and supernovae data. Since the physical mechanism responsible for the burst is still unknown, we assume four distribution models for the FRBs, namely gamma-ray bursts (GRB), star formation rate (SFR), uniform and equidistant (ED). Also, we consider samples with $N = 15$, 30, 100 and 500 points and three different values of the fluctuations of electron density in the $DM$, $\\delta = 0, 10, 100$ pc/cm$^{3}$. Our analysis shows that the GRB, SFR and Uniform distribution models present consistent results within $2\\sigma$ for the free parameters $f\\_{IGM}$ and $DM\\_{host,0}$ and highlights the crucial role of $DM$ fluctuations in obtaining more precise measurements.\n\n", "2307.06692": "2023-07-13, **Ejecta, Rings, and Dust in SN 1987A with JWST MIRI/MRS**, O. C. Jones et.al., [2307.06692v1](http://arxiv.org/abs/2307.06692v1)\n\n Supernova (SN) 1987A is the nearest supernova in $\\sim$400 years. Using the {\\em JWST} MIRI Medium Resolution Spectrograph, we spatially resolved the ejecta, equatorial ring (ER) and outer rings in the mid-infrared 12,927 days after the explosion. The spectra are rich in line and dust continuum emission, both in the ejecta and the ring. Broad emission lines (280-380~km~s$^{-1}$ FWHM) seen from all singly-ionized species originate from the expanding ER, with properties consistent with dense post-shock cooling gas. Narrower emission lines (100-170~km~s$^{-1}$ FWHM) are seen from species originating from a more extended lower-density component whose high ionization may have been produced by shocks progressing through the ER, or by the UV radiation pulse associated with the original supernova event. The asymmetric east-west dust emission in the ER has continued to fade, with constant temperature, signifying a reduction in dust mass. Small grains in the ER are preferentially destroyed, with larger grains from the progenitor surviving the transition from SN into SNR. The ER is fit with a single set of optical constants, eliminating the need for a secondary featureless hot dust component. We find several broad ejecta emission lines from [Ne~{\\sc ii}], [Ar~{\\sc ii}], [Fe~{\\sc ii}], and [Ni~{\\sc ii}]. With the exception of [Fe~{\\sc ii}]~25.99$\\mu$m, these all originate from the ejecta close to the ring and are likely being excited by X-rays from the interaction. The [Fe~{\\sc ii}]~5.34$\\mu$m to 25.99$\\mu$m line ratio indicates a temperature of only a few hundred K in the inner core, consistent with being powered by ${}^{44}$Ti decay.\n\n", "2307.06430": "2023-07-12, **Evidence for mass-dependent peculiar velocities in compact object binaries: Towards better constraints on natal kicks**, Yue Zhao et.al., [2307.06430v1](http://arxiv.org/abs/2307.06430v1)\n\n We compile a catalogue of low-mass and high-mass X-ray binaries, some recently reported binaries that likely host a neutron star (NS) or a black hole (BH), and binary pulsars (a pulsar and a non-degenerated companion) that have measured systemic radial velocities ($\\gamma$). Using Gaia and radio proper motions together with $\\gamma$, we integrate their Galactic orbits and infer their post-supernova (post-SN) 3D peculiar velocities ($v\\_\\mathrm{pec}^{z=0}$ at Galactic plane crossing); these velocities bear imprint of natal kicks that compact objects received at birth. With the sample totalling 85 objects, we model the overall distribution of $v\\_\\mathrm{pec}^{z=0}$ and find a two-component Maxwellian distribution with a low- ($\\sigma\\_v \\approx 21\\,\\mathrm{km~s^{-1}}$) and a high-velocity ($\\sigma\\_v \\approx 107\\,\\mathrm{km~s^{-1}}$) component. A further comparison between distributions of binary subgroups suggests that binaries hosting high-mass donors/luminous companions mostly have $v\\_\\mathrm{pec}^{z=0}\\lesssim 100\\,\\mathrm{km~s^{-1}}$, while binaries with low-mass companions exhibit a broader distribution that extends up to $\\sim 400\\,\\mathrm{km~s^{-1}}$. We also find significant anti-correlations of $v\\_\\mathrm{pec}^{z=0}$ with binary total mass ($M\\_\\mathrm{tot}$) and orbital period ($P\\_\\mathrm{orb}$), at over 99% confidence. Specifically, our fit suggests $v\\_\\mathrm{pec}^{z=0}\\propto M\\_\\mathrm{tot}^{-0.5}$ and $v\\_\\mathrm{pec}^{z=0}\\propto P\\_\\mathrm{orb}^{-0.2}$. Discussions are presented on possible interpretation of the correlations in the context of kinematics and possible biases. The sample should enable a range of follow-up studies on compact object binary kinematics and evolution.\n\n", "2307.06405": "2023-07-12, **Non-Stationary Astrophysical Stochastic Gravitational-Wave Background: A New Probe to the High Redshift Population of Binary Black Holes**, Mohit Raj Sah et.al., [2307.06405v1](http://arxiv.org/abs/2307.06405v1)\n\n The astrophysical Stochastic Gravitational Wave Background (SGWB) originates from the mergers of compact binary objects in the observable Universe that are otherwise undetected as individual events, along with other sources such as supernovae, magnetars etc. The individual GW signal is time-varying over a time scale that depends on the chirp mass of the coalescing binaries. Another timescale that plays a role is the timescale at which the sources repeat, which depends on the merger rate. The combined effect of these two leads to a breakdown of the time-translation symmetry of the observed SGWB and leads to a correlation between different frequency modes in the signal covariance matrix of the SGWB. Using an ensemble of SGWB sky map due to binary black hole (BBH) coalescence, calculated using simulations of different astrophysical and primordial black hole mass distribution and merger rates, we show how the structure of the signal covariance matrix varies. This structure in the signal covariance matrix brings additional information about the sources on top of the power spectrum of the SGWB. We show that there is up to a factor of 2.5 improvement in the Figure of Merit (FoM) by using this additional information in comparison to only power spectrum estimation for the LIGO-Virgo-KAGRA (LVK) network of detectors with the design sensitivity noise with two years of observation time. The inclusion of the off-diagonal correlation in the covariance of the SGWB in the data analysis pipelines will be beneficial in the quest for the SGWB signal in LVK frequency bands as well as in lower frequencies (nano-Hz, mili-Hz, deci-Hz) and in getting an insight into the origin of the SGWB signal.\n\n", "2307.06368": "2023-07-12, **Metallicity beats sSFR: The connection between superluminous supernova host galaxy environments and the importance of metallicity for their production**, Cressida Cleland et.al., [2307.06368v1](http://arxiv.org/abs/2307.06368v1)\n\n We analyse 33 Type I superluminous supernovae (SLSNe) taken from ZTF's Bright Transient Survey to investigate the local environments of their host galaxies. We use a spectroscopic sample of galaxies from the SDSS to determine the large-scale environmental density of the host galaxy. Noting that SLSNe are generally found in galaxies with low stellar masses, high star formation rates, and low metallicities, we find that SLSN hosts are also rarely found within high-density environments. Only $3\\substack{+9 \\\\-1}$ per cent of SLSN hosts were found in regions with 2 or more bright galaxies within 2 Mpc. For comparison, we generate a sample of 662 SDSS galaxies matched to the photometric properties of the SLSN hosts. This sample is also rarely found within high-density environments, suggesting that galaxies with properties required for SLSN production favour more isolated environments. Furthermore, we select galaxies within the Illustris-TNG simulation to match SLSN host galaxy properties in colour and stellar mass. We find that the fraction of simulated galaxies in high-density environments quantitatively matches the observed SLSN hosts only if we restrict to simulated galaxies with metallicity $12+\\log($O/H$) \\leq 8.12$. In contrast, limiting to only the highest sSFR galaxies in the sample leads to an overabundance of SLSN hosts in high-density environments. Thus, our measurement of the environmental density of SLSN host galaxies appears to break the degeneracy between low-metallicity or high-sSFR as the driver for SLSN hosts and provides evidence that the most constraining factor on SLSN production is low-metallicity.\n\n", "2307.06308": "2023-07-12, **The Spatial and Emission Properties of the Large [O III] Emission Nebula Near M31**, Robert A. Fesen et.al., [2307.06308v1](http://arxiv.org/abs/2307.06308v1)\n\n Drechsler et al. (2023) reported the unexpected discovery of a 1.5 degree long [O III] emission nebula 1.2 degrees southeast of the M31 nucleus. Here we present additional images of this large emission structure, called SDSO, along with radial velocity and flux measurements from low-dispersion spectra. Independent sets of [O III] images show SDSO to be composed of broad streaks of diffuse emission aligned NE-SW. Deep H$\\alpha$ images reveal no strong coincident emission suggesting a high [O III]/H$\\alpha$ ratio. We also find no other [O III] emission nebulosity as bright as SDSO within several degrees of M31 and no filamentary H$\\alpha$ emission connected to SDSO. Optical spectra taken along the arc's northern limb reveal [O III] $\\lambda\\lambda$4959,5007 emissions matching the location and extent seen in our [O III] images. The heliocentric velocity of this [O III] nebulosity is $-9.8 \\pm 6.8$ km s$^{-1}$ with a peak surface brightness of $(4\\pm2) \\times 10^{-18}$ erg s$^{-1}$ cm$^{-2}$ arcsec$^{-2}$ ($\\sim$0.55 Rayleigh). We discuss SDSO as a possible unrecognized supernova remnant, a large and unusually nearby planetary nebula, a stellar bow shock nebula, or an interaction of M31's outer halo gas with high-velocity circumgalactic gas. We conclude that galactic origins for SDSO are unlikely and favor instead an extragalactic M31 halo--circumgalactic cloud interaction scenario, despite the nebula's low radial velocity. We then describe new observations that may help resolve the true nature and origin of this large nebulosity so close to M31 in the sky.\n\n", "2307.05907": "2023-07-12, **An Alternative Formation Scenario for Uranium-rich Giants: Engulfing a Earth-like Planet**, Dian Xie et.al., [2307.05907v1](http://arxiv.org/abs/2307.05907v1)\n\n The actinides, such as the uranium (U) element, are typically synthesized through the rapid neutron-capture process (r-process), which can occur in core-collapse supernovae or double neutron star mergers. There exist nine r-process giant stars exhibiting conspicuousUabundances, commonly referred to as U-rich giants. However, the origins of these U-rich giants remain ambiguous. We propose an alternative formation scenario for these U-rich giants whereby a red giant (RG) engulfs an Earth-like planet. To approximate the process of a RG engulfing an Earth-like planet, we employ an accretion model wherein the RG assimilates materials from said planet. Our findings demonstrate that this engulfment event can considerably enhance the presence of heavy elements originating from Earth-like planets on the surfaces of very metal-poor stars (Z = 0.00001), while its impact on solar-metallicity stars is comparatively modest. Importantly, the structural and evolutionary properties of both very metalpoor and solar-metallicity stars remain largely unaffected. Notably, our engulfment model effectively accounts for the observed U abundances in known U-rich giants. Furthermore, the evolutionary trajectories of U abundances on the surfaces of RGs subsequent to the engulfment of Earth-like planets encompass all known U-rich giants. Therefore, it is plausible that U-rich giants are formed when a RG engulfs an Earth-like planet.\n\n"}}