{"neutrino": {"2310.12915": "2023-10-19, **The standard HVM**, Gauhar Abbas et.al., [2310.12915v1](http://arxiv.org/abs/2310.12915v1)\n\n We discuss the standard hierarchical VEVs model, which predicts the leptonic mixing angles in terms of the Cabibbo angle, and masses of strange and charm quarks as $\\sin \\theta\\_{12}^\\ell \\geq 1 - 2 \\sin \\theta\\_{12}$, $\\sin \\theta\\_{23}^\\ell \\geq 1 - \\sin \\theta\\_{12}$, and $\\sin \\theta\\_{13}^\\ell \\geq \\sin \\theta\\_{12} - \\frac{m\\_s}{m\\_c}$ for the normal mass ordering. This results in very precise predictions of the leptonic mixing angles given by $\\sin \\theta\\_{12}^\\ell = 0.55 \\pm 0.00134 $, $\\sin \\theta\\_{23}^\\ell = 0.775 \\pm 0.00067 $, and $\\sin \\theta\\_{13}^\\ell = 0.1413 - 0.1509 $. Furthermore, we predict neutrinos to be the Dirac kind. The flavour bounds on the model are discussed, and the impact of the standard hierarchical VEVs model on the flavonic dark matter is highlighted by showing its natural emergence.\n\n", "2310.12840": "2023-10-19, **Highlights from the IceCube Neutrino Observatory**, Naoko Kurahashi et.al., [2310.12840v1](http://arxiv.org/abs/2310.12840v1)\n\n As IceCube surpasses a decade of operation in the full detector configuration, results that drive forward the fields of neutrino astronomy, cosmic ray physics, multi-messenger astronomy, particle physics, and beyond continue to emerge at an accelerated pace. IceCube data is dominated by background events, and thus teasing out the signal is the common challenge to most analyses. Statistical accumulation of data, along with better understanding of the background fluxes, the detector, and continued development of our analysis tools have produced many profound results that were presented at ICRC2023. Highlights covered here include the first neutrino observation of the Galactic Plane, the first observation of a steady emission neutrino point source NGC1068, new characterizations of the cosmic ray flux and its secondary particles, and a possible new era in measuring the energy spectrum of the diffuse astrophysical flux. IceCube is poised to make more discoveries and drive fields forward in the near future with many novel analyses coming online.\n\n", "2310.12661": "2023-10-19, **Consistency of Lorentz-invariance violation neutrino scenarios in time delay analyses**, J. M. Carmona et.al., [2310.12661v1](http://arxiv.org/abs/2310.12661v1)\n\n Modifications inspired by quantum gravity in the kinematics of special relativity can manifest in various ways, including anomalies in the time of flight of massless particles and the emergence of decay channels for otherwise stable particles. Typically, these effects are studied independently; however, it may be necessary to combine both to perform a consistent analysis. In this work, we study the interplay between time-of-flight anomalies and neutrino instability in the context of a flavor-independent high-energy Lorentz-invariance violation (LIV) in the neutrino sector. Ensuring compatibility between both types of effects imposes strong constraints on the existence of early neutrinos with energies exceeding a maximum value determined by the scale of new physics. Such constraints depend on the specific LIV scenario and should be integrated into searches for high-energy neutrinos from gamma-ray bursts exhibiting LIV time shifts.\n\n", "2310.12642": "2023-10-19, **Semi-inclusive two-nucleon emission in (anti) neutrino CC scattering within the relativistic mean field framework**, V. L. Martinez-Consentino et.al., [2310.12642v1](http://arxiv.org/abs/2310.12642v1)\n\n This paper delves into the distribution of semi-inclusive events involving the emission of two nucleons in (anti) neutrino charged-current scattering. The analysis is conducted within the framework of relativistic mean field theory applied to nuclear matter. To quantify the likelihood of such semi-inclusive events occurring, we employ a relativistic model of meson-exchange currents that aligns with the 2p2h inclusive cross-section. The outcomes are presented in terms of one-fold and two-fold integrated semi-inclusive cross sections. To highlight disparities among the various emission channels, including proton-proton, neutron-proton, and neutron-neutron, we compare them against a purely phase-space isotropic distribution within the center of mass of the two nucleons. These comparisons reveal significant differences in the event distributions, shedding light on the distinctive characteristics of each channel.\n\n", "2310.12634": "2023-10-19, **Improved treatment of the $T_2$ molecular final-states uncertainties for the KATRIN neutrino-mass measurement**, S. Schneidewind et.al., [2310.12634v1](http://arxiv.org/abs/2310.12634v1)\n\n The KArlsruhe TRItium Neutrino experiment (KATRIN) aims to determine the effective mass of the electron antineutrino via a high-precision measurement of the tritium beta-decay spectrum in its end-point region. The target neutrino-mass sensitivity of 0.2 eV / c^2 at 90% C.L. can only be achieved in the case of high statistics and a good control of the systematic uncertainties. One key systematic effect originates from the calculation of the molecular final states of T\\_2 beta decay. In the first neutrino-mass analyses of KATRIN the contribution of the uncertainty of the molecular final-states distribution (FSD) was estimated via a conservative phenomenological approach to be 0.02 eV^2 / c^4. In this paper a new procedure is presented for estimating the FSD-related uncertainties by considering the details of the final-states calculation, i.e. the uncertainties of constants, parameters, and functions used in the calculation as well as its convergence itself as a function of the basis-set size used in expanding the molecular wave functions. The calculated uncertainties are directly propagated into the experimental observable, the squared neutrino mass m\\_nu^2. With the new procedure the FSD-related uncertainty is constrained to 0.0013 eV^2 / c^4, for the experimental conditions of the first KATRIN measurement campaign.\n\n", "2310.12628": "2023-10-19, **The top quark rare decays with flavor violation**, Ming-Yue Liu et.al., [2310.12628v1](http://arxiv.org/abs/2310.12628v1)\n\n In the present study, we investigate the decays of the top quark $t\\rightarrow c\\gamma$, $t\\rightarrow cg$, $t\\rightarrow cZ$ and $t\\rightarrow ch$. They are extremely rare processes in the Standard Model (SM). As the $U(1)\\_X$ extension of the minimal supersymmetric standard model, the $U(1)\\_X$SSM features new superfields such as the right-handed neutrinos and three Higgs singlet states. We analyze the effects of different sensitivity parameters on the results and make reasonable theorecial predictions useful for future experimental developments. Considering the constraint of the updated experimental data, the numerical results show that the branching ratios of all four processes $t\\rightarrow c\\gamma,~cg,~cZ,~ch$ can reach the same order of magnitude as their experimental upper limits. Among them, $\\tan\\beta$ has the most obvious effect on each process and is the main parameter. $g\\_X$, $g\\_{YX}$, $\\mu$, $M\\_2$, $\\lambda\\_H$, $M\\_{U23}^2$ and $M\\_{Q23}^2$ are important parameters for the processes, and have effects on the numerical results.\n\n", "2310.12591": "2023-10-19, **Electroweak phase transition with radiative symmetry breaking in Type-II seesaw with inert doublet**, Shilpa Jangid et.al., [2310.12591v1](http://arxiv.org/abs/2310.12591v1)\n\n We consider the Type-II seesaw model extended with another Higgs doublet, which is odd under the $Z\\_2$ symmetry. We look for the possibility of triggering the electroweak symmetry breaking via radiative effects. The Higgs mass parameter changes sign from being positive at higher energy scales to negative at lower energy scales in the presence of the TeV scalar triplet. The Planck scale perturbativity is demanded and the electroweak phase transition is studied using two-loop $\\beta$-functions. The maximum allowed values for the interaction quartic coupling of the second doublet field and the triplet field with the Higgs field are $\\lambda\\_3=0.15$ and $\\lambda\\_{\\Phi\\_{1\\Delta}}=0.50$, respectively. Considering these EW values, the first-order phase transition, i.e., $\\phi\\_{+}(T\\_c)/T\\_c\\sim 0.6$ is satisfied only for vanishing doublet and triplet bare mass parameters, $m\\_{\\Phi\\_2}=0.0$ GeV and $m\\_{\\Delta}=0.0$ GeV. The small non-zero induced vacuum expectation value for the scalar triplet also generates the neutrino mass, and the lightest stable neutral particle from the inert doublet satisfies the dark matter constraints for the chosen parameter space. The impact of the thermal corrections on the stability of the electroweak vacuum is also studied, and the current experimental values of the Higgs mass and the top mass lie in the stable region both at the zero temperature and the finite temperature.\n\n", "2310.12392": "2023-10-19, **Long-lived neutral fermions at the DUNE near detector**, Julian Y. Günther et.al., [2310.12392v1](http://arxiv.org/abs/2310.12392v1)\n\n At the Deep Underground Neutrino Experiment (DUNE), a proton beam hits a fixed target leading to large production rates of mesons. These mesons can decay and potentially provide a source of long-lived neutral fermions. Examples of such long-lived fermions are heavy neutral leptons which can mix with the standard-model active neutrinos, and the bino-like lightest neutralino in R-parity-violating supersymmetry. We show that the Standard Model Effective Field Theory extended with right-handed singlet neutrinos can simultaneously describe heavy neutral leptons and bino-like neutralinos in a unified manner. We use the effective-field-theory framework to determine the sensitivity reach of the DUNE near detector in probing various scenarios of long-lived neutral fermions.\n\n"}, "dark matter": {"2310.12501": "2023-10-19, **Inelastic Scattering of Dark Matter with Heavy Cosmic Rays**, Keyu Lu et.al., [2310.12501v1](http://arxiv.org/abs/2310.12501v1)\n\n We investigate the impact of inelastic collisions between dark matter (DM) and heavy cosmic ray (CR) nuclei on CR propagation. We approximate the fragmentation cross-sections for DM-CR collisions using collider-measured proton-nuclei scattering cross-sections, allowing us to assess how these collisions affect the spectra of CR Boron and Carbon. We derive new CR spectra from DM-CR collisions by incorporating these DM-CR cross-sections into the source terms and solving the diffusion equation for the complete network of reactions involved in generating secondary species. Utilizing the latest data from AMS-02 and DAMPE on the Boron-to-Carbon ratio, we estimate a 95\\% upper limit for the effective inelastic cross-section of DM-proton as a function of DM mass. Our findings reveal that at $m\\_\\chi \\simeq 2 \\,\\rm{MeV}$, the effective inelastic cross-section between DM and protons must be less than $\\mathcal{O}(10^{-32})~{\\rm cm}^2$.\n\n", "2310.12496": "2023-10-19, **A novel nuclear recoil calibration for liquid noble gas detectors**, Fengbo Gu et.al., [2310.12496v1](http://arxiv.org/abs/2310.12496v1)\n\n A lot of Dark Matter (DM) models predict single-scattering Nuclear Recoil (NR) events as potential signals. Characterization of a detector's NR response is crucial for underground DM direct detection projects. The traditional calibrating methods characterize a detector with $\\sim$ keV - MeV neutrons emitted from an accelerator, a neutron generator, or a radioactive source. These methods could be improved in several aspects: (a) the neutrons's energy could be more mono-energetic, (b) the to-be-calibrated NR energy should line up with the ROI (Research Of Interest) of the experiment, (c) the calibrating beam's flux should be appropriate. Accordingly, in the paper, we introduce a novel calibration method in which the beam of the target material (instead of neutrons) will be implemented to impinge the detector. For instance, calibrating a liquid helium detector with a helium beam. Since the helium beam can (i) be tuned precisely to have $\\sim < $1\\% energy jitter (so as the recoil energy's uncertainty), (ii) have an energy interval from $\\sim$ 100 eV to tens of keV (depending on the configuration), and (iii) have a tunable flux down to 10$^{10}$/s. Since these unique advantages can also be applied to other noble gases; therefore, we believe the method can be implemented to calibrate other liquid noble gas detectors' NR response.\n\n", "2310.12420": "2023-10-19, **Revisit a realistic intersecting D6-brane with modified soft SUSY terms**, Imtiaz Khan et.al., [2310.12420v1](http://arxiv.org/abs/2310.12420v1)\n\n Because there are a few typos in the supersymmetry breaking sfermion masses and trilinear soft term, regarding the current Large Hadron Collider (LHC) and dark matter searches, we revisit a three-family Pati-Salam model based on intersecting D6-branes in Type IIA string theory on a $\\mathbf{T^6/(\\Z\\_2\\times \\Z\\_2)}$ orientifold with a realistic phenomenology. We study the viable parameter space and discuss the spectrum consistent with the current LHC Supersymmetry searches along with the dark matter relic density bounds from the Planck 2018 data. For the gluinos and first two generations of sfermions, we observe that the gluino mass is in the range [2, 14] TeV, the squarks mass range is [2, 13] TeV and the sleptons mass is in the range [1, 5] TeV. We achieve the cold dark matter relic density consistent with 5$\\sigma$ Planck 2018 bounds via A-funnel and coannihilation channels such as stop-neutralino, stau-neutralino, and chargino-neutralino. Except for a few chargino-neutralino coannihilation solutions, these solutions also satisfy current nucleon-neutralino spin-independent and spin-dependent scattering cross-sections and may be probed by future dark matter searches.\n\n"}, "supernova": {"2310.12463": "2023-10-19, **Piecewise frequency model for searches for long-transient gravitational waves from young neutron stars**, Benjamin Grace et.al., [2310.12463v1](http://arxiv.org/abs/2310.12463v1)\n\n Previous searches for a gravitational-wave signal from a possible neutron star remnant of the binary neutron star merger event GW170817 have focused on short ($<500$ s) and long duration (2.5 hr -- 8 day) signals. To date, no such post-merger signal has been detected. We introduce a new piecewise model which has the flexibility to accurately follow gravitational-wave signals which are rapidly evolving in frequency, such as those which may be emitted from young neutron stars born from binary neutron star mergers or supernovae. We investigate the sensitivity and computational cost of this piecewise model when used in a fully coherent 1800-second $\\mathcal{F}$-statistic search on simulated data containing possible signals from the GW170817 remnant. The sensitivity of the search using the piecewise model is determined using simulated data, with noise consistent with the LIGO second observing run. Across a 100--2000 Hz frequency band, the model achieves a peak sensitivity of $h\\_{\\text{rss}}^{50\\%} = 4.4 \\times 10^{-23} \\text{Hz}^{-1/2}$ at 200 Hz, competitive with other methods. The computational cost of conducting the search, over a bank of $1.1 \\times 10^{12}$ templates, is estimated at 10 days running on 100 CPU's.\n\n"}}