{"neutrino": {"2507.21868": "2025-07-29, **Two-neutrino $ββ$ decay to excited states at next-to-leading order**, Daniel Castillo et.al., [2507.21868v1](http://arxiv.org/abs/2507.21868v1)\n\n We study two-neutrino double-beta decay ($2\\nu\\beta\\beta$) into first-excited $0^+\\_2$ states of nuclei used in $\\beta\\beta$ decay experiments, including $^{76}$Ge, $^{82}$Se, $^{130}$Te, and $^{136}$Xe. We calculate the corresponding nuclear matrix elements (NMEs) within the nuclear shell model, using various Hamiltonians that describe well the spectroscopy of the initial and final nuclei. We evaluate the next-to-leading order (NLO) long-range NMEs recently introduced within chiral effective field theory, keeping three terms in the expansion of the energy denominator. In most cases, NLO contributions to the half-life are below 5%, but they can increase to 25% due to cancellations in the leading-order Gamow-Teller NME. A detailed analysis in terms of nuclear deformation, including triaxiality, indicates that larger deformation differences between the initial and final states generally lead to smaller NMEs, but the seniority structure of the states also plays a relevant role. The lower range of our predicted half-lives, with uncertainties dominated by the nuclear Hamiltonian used, are slightly longer than the current experimental limit in $^{76}$Ge and the very recent half-life indication in $^{82}$Se.\n\n", "2507.21867": "2025-07-29, **Gamma rays as leptonic portals to energetic neutrinos: a new Monte Carlo approach**, Gaetano Di Marco et.al., [2507.21867v1](http://arxiv.org/abs/2507.21867v1)\n\n High center-of-mass electromagnetic~(EM) interactions could produce decaying heavy leptons and hadrons, leading to neutrino generation. These processes might occur in the most extreme astrophysical scenarios, potentially altering the expected gamma-ray and neutrino fluxes in both the hadronic and the leptonic pictures. For instance, neutrinos could arise from high-redshift EM cascades, triggered by gamma rays beyond $10^{18} \\; \\text{eV}$ scattering background photons, from radio to ultraviolet energy bands. Such energetic gamma rays are predicted in cosmogenic models and in scenarios involving non-standard physics. On astrophysical scales, leptonic production of neutrinos could take place in active galactic nuclei cores, where several-TeV gamma rays interact with the X-ray photons from the hot corona. We explore these scenarios within the CRPropa Monte Carlo code framework, developing dedicated tools to account for leptonic production and decay of heavy leptons and hadrons. In particular, the latter are performed by interfacing with the PYTHIA event generator. With these novel tools, we characterise the spectrum and flavour composition of neutrinos emerging from cosmological EM cascades and from leptonic processes in the core of active galactic nuclei. Finally, we investigate the leptonic production of neutrinos in the context of the IceCube detection of NGC~1068.\n\n", "2507.21845": "2025-07-29, **Neutrino non-radiative decay in matter: constraints and prospects**, Pilar Iváñez-Ballesteros et.al., [2507.21845v1](http://arxiv.org/abs/2507.21845v1)\n\n Neutrinos, being massive, can decay. A heavier neutrino could decay into a lighter one and a massless scalar or pseudoscalar boson, such as the Majoron. Two-body non-radiative decay could occur in dense matter, such as in the inner dense regions of a core-collapse supernova. We first derive novel bounds on neutrino-Majoron couplings using the spectral distortions induced by neutrino non-radiative two-body decay in matter, and two-dimensional likelihood analyses of the 24 $\\bar{\\nu}\\_e$ events from SN1987A. We then explore the prospects of neutrino-Majoron couplings from a future galactic core-collapse supernova, leaving either a neutron star or a black-hole. To this aim, we use information from detailed one-dimensional supernova simulations. We consider the supernova neutrino signal associated with inverse-beta decay in the upcoming JUNO and Hyper-Kamiokande detectors, with neutrino-argon scattering in DUNE, or with coherent neutrino-nucleus scattering in the DARWIN experiment. In a full 3$\\nu$ framework, based on the spectral distortions induced by neutrino decay in matter, we perform two-dimensional likelihood analyses and provide prospects for the limits on neutrino-Majoron couplings. Our results show that the observation of a future supernova will significantly improve on the current bounds, in particular from SN1987A and neutrinoless double-beta decay. Finally, we explore the impact of neutrino decay in matter on the diffuse supernova neutrino background formed by past supernova explosions. We show for the first time that the effects on black-hole contributions are important and modify the DSNB number of events by several tens of percent in Hyper-Kamiokande.\n\n", "2507.21691": "2025-07-29, **One-loop Renormalization of the Type-I Seesaw Model in the Modified Minimal-subtraction Scheme**, Jihong Huang et.al., [2507.21691v1](http://arxiv.org/abs/2507.21691v1)\n\n Extending the Standard Model (SM) with three right-handed neutrinos, the type-I seesaw model serves as the simplest and most natural scenario to successfully explain both tiny neutrino masses and the baryon number asymmetry in the Universe. In this paper, we perform a complete one-loop renormalization of the type-I seesaw model in the modified minimal-subtraction ($\\overline{\\rm MS}$) scheme. The one-loop self-energy corrections of charged leptons and Majorana neutrinos are calculated in the $R\\_\\xi^{}$ gauge, and the explicit expressions of all the counterterms for wave functions, fermion masses and the leptonic flavor mixing matrix are given. Furthermore, adopting the Euler-like parametrization of the $6\\times 6$ unitary leptonic flavor mixing matrix, we derive one-loop renormalization-group equations for all the physical parameters in the $\\overline{\\rm MS}$ scheme, including neutrino masses, mixing angles and CP-violating phases. The modification of the one-loop renormalization of the original SM parameters due to the presence of heavy Majorana neutrinos is investigated as well. In this way, we provide a self-consistent theoretical framework to thoroughly test the type-I seesaw model at the one-loop level with future precision data.\n\n", "2507.21534": "2025-07-29, **Interpreting the KM3-230213A PeV Neutrino Event via Vector Dark Matter Decay and Its Multi-Messenger Signatures**, Yu-Hang Su et.al., [2507.21534v1](http://arxiv.org/abs/2507.21534v1)\n\n The KM3NeT Collaboration recently reported the detection of an ultra-high-energy neutrino event KM3-230213A with a reconstructed energy of $220^{+110}\\_{-60}$ PeV, the most energetic astrophysical neutrino ever detected. The absence of convincing electromagnetic counterparts motivates exploration of exotic origins beyond standard astrophysical processes. We present a vector dark matter model based on a new $U(1)\\_X$ gauge symmetry to interpret this event through superheavy dark matter decay. Our analysis demonstrates that dark matter lifetimes in the range $7.3 \\times 10^{28}$ to $2.9 \\times 10^{30}$ s can successfully account for the KM3-230213A event while satisfying stringent constraints from gamma-ray observations. Moreover, the spontaneous breaking of $U(1)\\_X$ in our model naturally predicts cosmic string formation, generating a stochastic gravitational wave background with string tension $4.5 \\times 10^{-11} \\lesssim G\\mu \\lesssim 1.2 \\times 10^{-10}$, consistent with recent pulsar timing array observations. This multi-messenger consistency across neutrinos, gamma-rays, and gravitational waves validates our vector dark matter interpretation of the KM3-230213A event while providing testable predictions for upcoming multi-wavelength experiments.\n\n", "2507.21228": "2025-07-28, **Finding BSM Needles in Electromagnetic Haystacks at DUNE**, Vedran Brdar et.al., [2507.21228v1](http://arxiv.org/abs/2507.21228v1)\n\n In this work, motivated by several beyond the Standard Model signal topologies, we perform detailed background mitigation analyses for the DUNE near detector. Specifically, we investigate $e^+ e^-$, $e^- \\gamma$, $\\gamma$, and $\\gamma\\gamma$ final states that may arise from long-lived particles, including light mediators, dark matter, heavy neutral leptons, and axion-like particles (ALPs), decaying or scattering inside the liquid argon detector. To this end, we employ both photophilic and leptophilic ALPs as phenomenological benchmarks. The aforementioned final states leave a hard electromagnetic signature with no hadronic activity above the detector energy thresholds. Nevertheless, such signatures are not immune to backgrounds from neutrino scattering in the detector, which are in the focus of our study. In order to model realistic experimental analyses, we take into account particle misidentification rates, cross-contamination effects, and detector responses. We calculate confidence limit projections for DUNE, thereby presenting realistic capabilities for constraining or discovering new physics manifested through electromagnetic showers.\n\n", "2507.21223": "2025-07-28, **Scotogenic mechanism from an extended $\\boldsymbol{SU(2)_1 \\times SU(2)_2 \\times U(1)_Y}$ electroweak symmetry**, Julio Leite et.al., [2507.21223v1](http://arxiv.org/abs/2507.21223v1)\n\n We propose an extension of the electroweak sector of the Standard Model in which the gauge group $SU(2)\\_L$ is promoted to $SU(2)\\_1 \\times SU(2)\\_2$. This framework naturally includes a viable dark matter candidate and generates neutrino masses radiatively \\`a la Scotogenic. Our scenario can be viewed as an ultraviolet extension of the Scotogenic mechanism, addressing some of its shortcomings. The resulting phenomenology may be probed through a range of experimental signatures, from precision electroweak measurements to searches for lepton flavor violation.\n\n", "2507.21215": "2025-07-28, **Reheating after the Supercooled Phase Transitions with Radiative Symmetry Breaking**, Francesco Rescigno et.al., [2507.21215v1](http://arxiv.org/abs/2507.21215v1)\n\n Theories with radiative symmetry breaking (RSB) lead to first-order phase transitions and the production of gravitational waves as well as primordial black holes if the supercooling period lasted long enough. Here we explain how to efficiently reheat the universe after such period in the above-mentioned class of theories. Two cases are possible, depending on whether the RSB scale is much larger than the electroweak (EW) symmetry breaking scale or not. When it is, the dominant reheating mechanism can be the decays of the field responsible for RSB in the Standard Model (SM) sector. We point out that in a similar way dark matter (DM) can be produced and we analyze in some detail the case of a sterile-neutrino, finding that the full DM abundance is reproduced when this particle is at the $10^2$ MeV scale in a well-motivated SM completion. When the RSB scale is not much larger than the EW symmetry breaking scale, we find that efficient reheating always occurs when the energy density of the false vacuum is first entirely transferred to a dark photon and then to SM fermions via dark-photon decays.\n\n", "2507.20754": "2025-07-28, **Charged current neutrino and antineutrino induced associated particle production from nucleons**, A. Fatima et.al., [2507.20754v1](http://arxiv.org/abs/2507.20754v1)\n\n In this work, we study the charged-current (anti)neutrino-induced associated particle($K\\Lambda$) production($\\Delta S=0$) from free nucleons in the energy region of a few GeV, relevant to the (anti)neutrino oscillation experiments with accelerator and atmospheric neutrinos. We employ a model based on effective Lagrangians to evaluate the contributions from the nonresonant and the resonant diagrams. The nonresonant background terms are calculated using a microscopic model derived from the SU(3) chiral Lagrangians. For the resonant contributions, we consider the low-lying spin-$\\frac{1}{2}$ resonances, such as $S\\_{11}(1650)$, $P\\_{11}(1710)$, $P\\_{11}(1880)$, and $S\\_{11}(1895)$, and spin-$\\frac{3}{2}$ resonances, such as $P\\_{13}(1720)$ and $P\\_{13}(1900)$, which have finite branching ratios to the $K\\Lambda$ channel. These resonant contributions are modelled using an effective phenomenological Lagrangian approach, with strong couplings determined from the experimental branching ratios and the decay widths to the $K\\Lambda$ channel. To fix the parameters of the vector current interaction, the model is first used to reproduce satisfactorily the MAMI experimental data on the real photon induced scattering off the nucleon resulting an eta meson in the final state and with the CLAS data for the $K\\Lambda$ production in the final state. The PCAC hypothesis and the generalized Goldberger-Treiman relation are used to fix the parameters of the axial vector interaction. The model is then applied to study the weak production of $K\\Lambda$ induced by the neutrinos and antineutrinos, and predicts the numerical values for the $Q^2$-distribution, the kaon kinetic energy distribution, and the total scattering cross sections with and without a cut on the CM energy W. The results presented in this work are relevant for the present and future accelerator and atmospheric neutrino experiments.\n\n", "2507.20659": "2025-07-28, **Maximal parameter space of sterile neutrino dark matter with lepton asymmetries**, Kensuke Akita et.al., [2507.20659v1](http://arxiv.org/abs/2507.20659v1)\n\n Large lepton flavor asymmetries with zero total lepton asymmetry could be generated in the Early Universe. They are loosely constrained by current observations, being washed out at MeV temperatures by neutrino oscillations. We show that such lepton flavor asymmetries open up a new parameter space for sterile neutrino dark matter, consistent with all observational bounds. To this end, we construct the semi-classical Boltzmann equation for sterile neutrinos applicable in the case of arbitrarily large lepton asymmetries, and confirm its validity by quantum kinetic equations. This way, we derive the maximal parameter space for sterile neutrino dark matter with lepton asymmetries. The allowed range of sterile neutrinos' squared couplings extends by up to two orders of magnitude across a 5-70 keV mass range, and may be testable by X-ray, structure formation, and upcoming CMB observations.\n\n", "2507.20539": "2025-07-28, **Understanding neutrino pion production with the GiBUU model**, Qiyu Yan et.al., [2507.20539v1](http://arxiv.org/abs/2507.20539v1)\n\n Pion production is a major source of systematic uncertainty in neutrino oscillation measurements. We report a systematic investigation of neutrino-induced pion production using MINERvA and MicroBooNE data within the GiBUU theoretical framework. The analysis begins by establishing baseline model parameters using inclusive and pionless data from MINERvA, MicroBooNE, and T2K experiments. We then examine the role of in-medium effects, including resonance broadening and nucleon-nucleon final-state interactions. While agreement with individual datasets can be achieved through specific model configurations, we demonstrate the difficulty of a unified description across all experiments: MINERvA measurements prefer minimum in-medium modifications, whereas MicroBooNE data require the maximum in-medium enhancement, revealing the complexity and richness of the underlying nuclear dynamics.\n\n"}, "dark matter": {"2507.21986": "2025-07-29, **Dwarf galaxies in non-local gravity**, Ivan De Martino et.al., [2507.21986v1](http://arxiv.org/abs/2507.21986v1)\n\n The nature of dark matter remains one of the most pressing open questions in modern cosmology. Despite extensive experimental efforts, no direct or indirect detection of dark matter particles has been confirmed. This has motivated alternative approaches, including modifications to the underlying theory of gravity. In this work, we investigate the implications of a specific non-local gravity (NLG) theory, which modifies General Relativity by introducing non-local effects that manifest as an effective dark matter component. We analyze the velocity dispersion profiles of eight classical dwarf spheroidal (dSph) galaxies - Carina, Draco, Fornax, Leo I, Leo II, Sculptor, Sextans, and Ursa Minor - to test the predictions of NLG. Using the Jeans equation, we model the kinematics of these galaxies and perform a Bayesian Markov Chain Monte Carlo analysis to constrain the parameters of the NLG kernel chosen for our analysis. Our results indicate that NLG might successfully reproduce the observed kinematics of dSph galaxies without requiring particle dark matter, providing constraints on the scale-dependent modifications to gravity that are compatible with previous studies in the literature. However, a parameter inconsistency remains in the cases of Fornax and Sextans galaxies that requires further attention.\n\n", "2507.21910": "2025-07-29, **BSM: Extended Scalar Sectors**, Tania Robens et.al., [2507.21910v1](http://arxiv.org/abs/2507.21910v1)\n\n In particle physics the world is described by a function, the Lagrangian. Each of its sectors characterizes the interactions between the particles of the Standard Model (SM). The addition of hypothetical new particles is done by including new terms in the Lagrangian. The scalar or Higgs sector of the SM is built with only one scalar complex field and it is extended by including new spin zero fields. This can help to solve questions that cannot be answered by the SM alone, like introducing dark matter candidates or new sources of CP-violation required to explain the matter-antimatter asymmetry of the universe. The corresponding theories have to be probed experimentally. For the high energy region, the standard tools are collider experiments such as the Large Hadron Collider, or other possible future facilities. Dark matter experiments scrutinize the connection between the visible and the dark world.\n\n", "2507.21612": "2025-07-29, **First use of large area SiPM matrices coupled with NaI(Tl) scintillating crystal for low energy dark matter search**, Edoardo Martinenghi et.al., [2507.21612v1](http://arxiv.org/abs/2507.21612v1)\n\n The long-standing claim of dark matter detection by the DAMA experiment remains a crucial open question in astroparticle physics. A key step towards its independent verification is the development of NaI(Tl)-based detectors with improved sensitivity at low energies. The majority of NaI(Tl)-based experiments rely on conventional photomultiplier tubes (PMTs) as single photon detectors, which present technological limitations in terms of light collection, intrinsic radioactivity and a high noise contribution at keV energies. ASTAROTH is an R&D project developing a NaI(Tl)-based detector where the scintillation light is read out by silicon photomultipliers (SiPM) matrices. SiPMs exhibit high photon detection efficiency, negligible radioactivity, and, most importantly, a dark noise nearly two orders of magnitude lower than PMTs, when operated at cryogenic temperature. To this end, ASTAROTH features a custom-designed cryostat based on a bath of cryogenic fluid, able to safely operate the detector and the read-out electronics down to about 80K. We report the first experimental characterization of 360 g NaI(Tl) detector read out by a large area (5 cm x 5 cm) SiPM matrix. The photoelectron yield obtained with a preliminary configuration is 7.2 photoelectrons/keV, which is rather promising, also in light of several planned developments. The signal-to-noise ratio and the energy threshold attainable with SiPMs is expected to improve the sensitivity for dark matter searches beyond the reach of current-generation PMT-based detectors. This result is the first proof of the viability of this technology and sets a milestone toward the design of future large-scale experiments.\n\n", "2507.21414": "2025-07-29, **Quasinormal modes of regular black holes surrounded by skewed dark matter distributions**, Chen Lan et.al., [2507.21414v1](http://arxiv.org/abs/2507.21414v1)\n\n Regular black holes, nonsingular solutions to gravitational collapse with quantum corrections, offer a compelling alternative to classical black holes with curvature singularities. In this work, we investigate how the presence of skewed dark matter distributions outside the innermost stable circular orbit of regular black holes modifies the gravitational wave signals emitted by such objects. Rather than introducing corrections directly into an effective potential, we model the influence of dark matter through metric corrections, allowing a full control over the spatial distribution and abundance of dark matter. We demonstrate that a skewed normal profile generically introduces shallow potential wells or secondary barriers in the effective potential of perturbation equations, depending sensitively on the type of perturbations: scalar, spinor, or tensor. These modifications lead to distinctive quasinormal mode features, including long-lived modes, echo effects, and in some cases, altered stability behaviors. Notably, the axial and polar sectors of tensor field perturbations respond asymmetrically to identical dark matter profiles, revealing a deeper structural distinction in their perturbation dynamics. These results provide a theoretical framework for probing regular black holes in the dark matter environment through gravitational wave observations.\n\n", "2507.21359": "2025-07-28, **Dark Matter Constraints in Myrzakulov $F(R,T)$ Gravity: A Vielbein Approach in Weitzenböck Spacetime with Observational Data**, Davood Momeni et.al., [2507.21359v1](http://arxiv.org/abs/2507.21359v1)\n\n We explore dark matter phenomenology in Myrzakulov $F(R,T)$ gravity, formulated via the vielbein approach in Weitzenb\\\"{o}ck spacetime. In this torsion-based extension of gravity, dark matter emerges as a geometric effect rather than a particle species, with curvature and torsion contributing dynamically to the field equations. Using recent data -- including SPARC galaxy rotation curves, Planck CMB observations, and weak lensing from DES and KiDS -- we constrain the model through MCMC analysis. Our results show that, under specific parameter choices, the theory replicates key cosmological features without introducing additional dark sector matter. This framework offers a testable alternative to $\\Lambda$CDM, providing new insight into structure formation, gravitational lensing, and cosmic acceleration -- all rooted in the geometry of spacetime.\n\n", "2507.21332": "2025-07-28, **Inferring the Merger History of Primordial Black Holes from Gravitational-Wave data and the Stochastic Signatures**, Sourav Roy Chowdhury et.al., [2507.21332v1](http://arxiv.org/abs/2507.21332v1)\n\n Primordial black holes (PBHs) are well-motivated candidates for cold dark matter and may also account for a fraction of the binary black hole mergers observed by the LIGO-Virgo-KAGRA Collaboration. In this study, we investigate the gravitational-wave signatures of PBHs, with a particular focus on evaluating their integrated contribution to the stochastic gravitational-wave background arising from binary mergers over a broad range of redshifts. We perform a Bayesian analysis of gravitational-wave events following all Gravitational-Wave Transient Catalog data, assuming a log-normal PBH mass function. We compute the merger rate distribution of PBH binaries by accounting for gravitational torques from the surrounding PBH. To constrain this rate, we employ the latest limits from the third observing run of LIGO/Virgo. Owing to their primordial origin, PBHs exhibit enhanced merger activity at high redshifts, prior to the onset of stellar formation. Our analysis yields a relatively weak inference on the redshift evolution index of the PBH merger rate, with $\\alpha = 2.19^{+0.16}\\_{-0.16}$ at 68\\% confidence level. The local merger rate of PBH binaries is found with posterior estimates lying in the range $23.5-30.3~\\mathrm{Gpc}^{-3}\\,\\mathrm{yr}^{-1}$, reflecting a high degree of statistical precision in the inferred distribution. Additionally, we emphasize the potential of stochastic gravitational-wave background observations to probe the cumulative history of PBH mergers across cosmic time.\n\n", "2507.21218": "2025-07-28, **Radion Portal Freeze-Out Dark-Matter**, R. Sekhar Chivukula et.al., [2507.21218v1](http://arxiv.org/abs/2507.21218v1)\n\n We show that, in a consistent model of a stabilized extra-dimensional theory, the radion can serve as a natural portal between ordinary matter and WIMP dark matter. With an effective coupling scale of the Kaluza-Klein theory of 20-100 TeV, the radion portal can produce the observed relic abundance through resonant annihilation for dark matter masses up to a TeV. Existing and planned direct dark matter detection experiments cannot constrain this model. However, indirect detection limits exclude dark matter masses between 5 and 80 GeV, where the radion mediator primarily decays into b-quarks.\n\n", "2507.21212": "2025-07-28, **Tracing Red Giant Members of the Globular Cluster Palomar 5 with APOGEE and Gaia**, Allyson A. Sheffield et.al., [2507.21212v1](http://arxiv.org/abs/2507.21212v1)\n\n The globular cluster Palomar 5 (Pal 5) is in the process of being tidally shredded as it orbits the Milky Way. Its core is currently at a heliocentric distance of ~21 kpc, near apogalacticon (~18 kpc), and it reaches ~5-7 kpc at perigalacticon. Pal 5's leading and trailing arms stretch over 20 degrees on the sky, making them sensitive probes of the Milky Way's mass distribution. In this work, we search for red giant members of Pal 5 using spectroscopic data from APOGEE DR17 and photometric and astrometric data from Gaia DR3. Based on position and proper motion, we identify eight members of Pal 5: six in the core and two in the stream. The clustering algorithm HDBSCAN finds these same eight. We then use chemical tagging with APOGEE abundances to search for additional members across five APOGEE fields overlapping Pal 5. While several dozen candidates are identified, most deviate (some significantly) from known kinematic and color-magnitude trends, suggesting that they are less likely to be true members. We estimate the expected number of giants in the APOGEE pointings based on the area and stellar mass of the streams. Given APOGEE's limiting magnitude, we find that few, if any, new giants are expected, especially if the stream is more diffuse at these locations. Our results support the presence of density variations in Pal 5's tidal streams, consistent with earlier studies attributing such features to baryonic perturbers in the Milky Way, dark matter subhaloes, or interactions with passing globular clusters.\n\n", "2507.21041": "2025-07-28, **Primordial Black Hole Triggered Type Ia Supernovae I: Impact on Explosion Dynamics and Light Curves**, Shing-Chi Leung et.al., [2507.21041v1](http://arxiv.org/abs/2507.21041v1)\n\n Primordial black holes (PBHs) in the asteroid-mass window are compelling dark matter candidates, made plausible by the existence of black holes and by the variety of mechanisms of their production in the early universe. If a PBH falls into a white dwarf (WD), the strong tidal forces can generate enough heat to trigger a thermonuclear runaway explosion, depending on the WD mass and the PBH orbital parameters. In this work, we investigate the WD explosion triggered by the passage of PBH. We perform 2D simulations of the WD undergoing thermonuclear explosion in this scenario, with the predicted ignition site as the parameter assuming the deflagration-detonation transition model. We study the explosion dynamics and predict the associated light curves and nucleosynthesis. We find that the model sequence predicts the light curves which align with the Phillip's relation ($B\\_{\\max}$ vs. $\\Delta M\\_{15}$). Our models hint at a unifying approach in triggering Type Ia supernovae without involving two distinctive evolutionary tracks.\n\n", "2507.20830": "2025-07-28, **Probing the axion-electron coupling at cavity experiments**, Deog Ki Hong et.al., [2507.20830v1](http://arxiv.org/abs/2507.20830v1)\n\n Axion dark matter induces electromagnetic radiation in conductors through nearly perpetual oscillations of electrons, driven by axion-electron interactions through the so-called chiral magnetic effect. It therefore provides a complementary probe of the axion-electron coupling $g\\_{ae}$ beyond the conventional axion-photon coupling $g\\_{a \\gamma}$ in cavities. We show that existing axion cavity experiments can constrain the coupling to $g\\_{ae}\\lesssim 10^{-5}$ over the scanned axion mass ranges, $1\\,\\mu\\, {\\rm eV}\\lesssim m\\_a\\lesssim 20\\,\\mu\\,{\\rm eV}$. Although we find that the radiation due to $g\\_{ae}$ at the copper cavity surface of electric conductivity $\\sigma$ is suppressed by $m\\_a^2/\\sigma^2\\sim 10^{-20}$, compared to the radiation inside the cavity by the axion-photon conversion due to $g\\_{a\\gamma}$, a sensitivity of about $10^{-9}$ could be achieved for $g\\_{ae}$ over a wider range of $m\\_a$, including values higher than those previously probed, if copper walls are replaced with carbon-based conductors.\n\n", "2507.20823": "2025-07-28, **Rotating Proto-Neutron Stars Admixed with Mirror Dark Matter: A two fluid approach**, Adamu Issifu et.al., [2507.20823v1](http://arxiv.org/abs/2507.20823v1)\n\n This work investigates the impact of mirror dark matter (DM) on the global properties of rotating neutron stars (NSs) across evolutionary stages, from hot, lepton-rich proto-neutron stars (PNSs) to cold, catalyzed NSs along the Kelvin--Helmholtz timescale. The baryonic matter (BM) is modeled using a relativistic mean-field (RMF) approach with density-dependent couplings, while the dark sector mirrors the visible sector with analogous thermodynamic conditions. Using a two-fluid formalism with purely gravitational DM-BM interaction, we find that rotation enlarges the star, whereas DM admixture increases compactness and enhances gravitational stability. However, increased compactness due to DM lowers the threshold for rotational instabilities, making DM-admixed stars more susceptible. Rotation decreases temperature profiles by redistributing thermal energy over a larger volume and reducing central density, while DM raises temperatures by deepening the gravitational potential and increasing thermal energy. Stars become more prone to collapse and rotational instabilities as frequency ($\\nu$) rises and the polar-to-equatorial radius ratio ($r\\_p/r\\_e$) decreases, especially near the Keplerian limit ($\\nu\\_K$). DM-admixed stars also show higher surface gravitational redshifts due to their compactness. Our results qualitatively agree with universal relations primarily derived for rotating cold stars. These findings highlight competing effects of rotation and DM on NS thermal evolution, structure, and observables, potentially offering indirect probes of DM within NSs.\n\n", "2507.20822": "2025-07-28, **Deep Extragalactic VIsible Legacy Survey (DEVILS): Satellite Quenching at Intermediate Redshift**, L. J. M. Davies et.al., [2507.20822v1](http://arxiv.org/abs/2507.20822v1)\n\n Determining the processes by which galaxies transition from a star-forming to a quiescent state (quenching) is paramount to our understanding of galaxy evolution. One of the key mechanisms by which this takes place is via a galaxy's interactions with a local, over-dense environment (satellite or environmental quenching). In the very local Universe, we see these processes in action, and can also observe their effects via the distribution of satellite galaxy properties. However, extending similar analyses outside of the local Universe is problematic, largely due to the difficulties in robustly defining environments with small and/or incomplete spectroscopic samples. We use new environmental metrics from the high-completeness Deep Extragalactic VIsible Legacy Survey (DEVILS) to explore the properties of satellite galaxies at intermediate redshift (0.3$<$z$<$0.5) and compare directly to the Galaxy And Mass Assembly Survey (GAMA) at 0$<$z$<$0.2. Importantly, both the galaxy properties and environmental metrics in DEVILS and GAMA are derived in an identical manner, reducing any methodology biases. We find: i) that satellite galaxies in DEVILS and GAMA show suppressed star-formation in comparison to isolated systems at the same stellar mass, by $\\sim$0.5dex in log$\\_{10}$(SFR/M$\\_{\\odot}$yr$^{-1}$), ii) that this suppression is strongest in higher mass dark matter halos (up to $\\sim$1dex in log$\\_{10}$(SFR/M$\\_{\\odot}$yr$^{-1}$) in the most massive halos) and iii) that at fixed stellar and halo mass, this suppression increases with time - with satellite passive fractions increasing by $\\sim$10-15\\% over the last $\\sim$5Gyr. This is consistent with previous observations and numerical simulations.\n\n", "2507.20606": "2025-07-28, **Beyond Extreme Burstiness: Evolving Star Formation Efficiency as the Key to Early Galaxy Abundance**, Abhijnan Kar et.al., [2507.20606v1](http://arxiv.org/abs/2507.20606v1)\n\n JWST observations have revealed an overabundance of bright galaxies at $z \\geq 9$, creating apparent tensions with theoretical predictions within standard $\\Lambda$CDM cosmology. We address this challenge using a semi-empirical approach that connects dark matter halos to observed UV luminosity through physically motivated double power-law star formation efficiency (SFE) model as a function of halo mass, redshift and perform joint Bayesian analysis of luminosity functions spanning $z = 4 - 16$ using combined HST and JWST data. Through systematic model comparison using information criteria (AIC, BIC, DIC), we identify the optimal framework requiring redshift evolution only in the low-mass slope parameter $\\alpha(z)$ while maintaining other SFE parameters constant. Our best-fitting model achieves excellent agreement with observations using modest, constant UV scatter $\\sigma\\_{\\rm UV} = 0.32$ dex, significantly lower than the $\\gtrsim 1.3$ dex values suggested by previous studies for $z > 13$. This reduced scatter requirement is compensated by strongly evolving star formation efficiency, with $\\alpha$ increasing toward higher redshifts, indicating enhanced star formation in low-mass halos during cosmic dawn. The model also successfully reproduces another important observational diagnostic such as effective galaxy bias across the full redshift range. Furthermore, model predictions are consistent up to a redshift of $z\\sim 20$. Our results demonstrate that JWST's early galaxy observations can be reconciled with standard cosmology through the interplay of modest stochasticity and evolving star formation physics, without invoking extreme burstiness or exotic mechanisms.\n\n", "2507.20484": "2025-07-28, **Dark photon dark matter from flattened axion potentials**, Hong-Yi Zhang et.al., [2507.20484v1](http://arxiv.org/abs/2507.20484v1)\n\n Dark photons can be resonantly produced in the early universe via their coupling to an oscillating axion field. However, this mechanism typically requires large axion-dark photon couplings or some degree of fine-tuning. In this work, we present a new scenario in which efficient dark photon production arises from axion potentials that are shallower than quadratic at large field values. For moderately large initial misalignment angles, the oscillation of the axion field can trigger either efficient dark photon production or strong axion self-resonance via parametric resonance. When self-resonance dominates and disrupts the field's homogeneity, we show that oscillons -- localized, oscillating axion field configurations -- naturally form and can sustain continued dark photon production, provided the coupling is $\\gtrsim \\mathcal O(1)$. For dark photon mass up to three orders of magnitude below the axion mass, the produced dark photons can account for a significant fraction of the present-day dark matter. We support this scenario with numerical lattice simulations of a benchmark model. Our results further motivate experimental searches for ultralight dark photon dark matter. The simulation code is publicly available at https://github.com/hongyi18/AxionDarkPhotonSimulator.\n\n", "2507.20462": "2025-07-28, **Superhorizon fluctuations and the cosmic dipole problem**, Ge Chen et.al., [2507.20462v1](http://arxiv.org/abs/2507.20462v1)\n\n Recent observations have identified a significant 4.9$\\sigma$ tension between the cosmic dipole inferred from galaxy number counts and that derived from the Cosmic Microwave Background (CMB), suggesting a potential deviation from the cosmological principle. This work investigates whether superhorizon isocurvature perturbations in cold dark matter (CDM) can account for this discrepancy. We demonstrate that, unlike adiabatic modes which cancel at leading order, superhorizon isocurvature modes can generate an intrinsic CMB dipole without significantly affecting galaxy number counts, thereby explaining the observed mismatch. We explore both single-mode and continuous-spectrum cases, focusing on two concrete models: a nearly scale-invariant power-law spectrum with a UV cutoff and axion-induced isocurvature perturbations. For the axion scenario, we show that if the radial mode evolves during inflation, the resulting perturbations can match the required amplitude while evading current CMB constraints. Our analysis constrains the self-coupling of associated potential for the axion to the range $10^{-9} < \\lambda < 4 \\times 10^{-9}$. These findings offer a viable solution to the dipole tension and may serve as indirect evidence for axion dark matter.\n\n"}, "supernova": {"2507.22033": "2025-07-29, **On the formation of strange quark stars from supernova in compact binaries**, L. M. Becerra et.al., [2507.22033v1](http://arxiv.org/abs/2507.22033v1)\n\n Strange quark stars (SQSs), namely compact stars entirely composed of deconfined quark matter, are characterized by similar masses and compactness to neutron stars (NSs) and have been theoretically proposed to exist in the Universe since the 1970s. However, multiwavelength observations of compact stars in the last 50 years have not yet led to an unambiguous SQS identification. This article explores whether SQSs could form in the supernova (SN) explosion of an evolved star (e.g., carbon-oxygen, or Wolf-Rayet) occurring in a binary with the companion being a neutron star (NS). The collapse of the iron core of the evolved star generates a newborn NS and the SN explosion. Part of the ejected matter accretes onto the NS companion as well as onto the newborn NS via matter fallback. The accretion occurs at hypercritical (highly super-Eddington) rates, transferring mass and angular momentum to the stars. We present numerical simulations of this scenario and demonstrate that the density increase in the NS interiors during the accretion process may induce quark matter deconfinement, suggesting the possibility of SQS formation. We discuss the astrophysical conditions under which such a transformation may occur and possible consequences.\n\n", "2507.21821": "2025-07-29, **Tidal heating in detached double white dwarf binaries**, Lucy O. McNeill et.al., [2507.21821v1](http://arxiv.org/abs/2507.21821v1)\n\n Short--period ($P<$1 hr orbits) detached double white dwarf binary (DWDB) components identified with transient surveys (e.g. SDSS, ZTF) have hot surface temperatures ($>$10,000 K) and observed radii a factor two larger than completely degenerate white dwarfs. We formulate tidal heating in helium composition extremely low mass white dwarf (ELM WD) components of detached DWDBs which reach mass transfer within a Hubble time. We combine a mass radius relation which varies with surface temperature and the tidal friction model of Hut 1981, where the additional orbital energy loss from tidal friction is accounted for by increases in the primary surface temperature, and hence increasing radius. Applying this heating model to the current sample of binaries with ZTF, we predict temperature increases from the present day of up to $\\sim$40\\% before the onset of mass transfer. We find that helium white dwarfs are generically hot and large at the onset of mass transfer, even for the oldest DWDBs whose components can cool to be degenerate by the present day. In the population of Galactic DWDBs, we find that the onset of mass transfer should occur at orbital periods as long as 1000s (17 minutes), or binary gravitational wave frequency of 2 mHz. This is over three times longer than periods expected for degenerate WD (5 minutes). Since mass transferring DWDBs are progenitors for a variety of transients and stellar populations e.g. RCrB stars, AM CVn binaries, type .Ia supernova, the finite temperature of donor white dwarfs should be taken into account.\n\n", "2507.21607": "2025-07-29, **Does DESI DR2 challenge $Λ$CDM paradigm ?**, Himanshu Chaudhary et.al., [2507.21607v1](http://arxiv.org/abs/2507.21607v1)\n\n Although the debate about the systematic errors of DESI DR1 is still open, recent DESI DR2 is consistent with DESI DR1 and further strengthens the results of DESI DR1. In this analysis, we present a $\\sim 2.38 \\sigma$ discrepancy between Planck $\\Lambda$ CDM cosmology and the DESI DR2 Luminous Red Galaxy (LRG1) data at $z\\_{\\text{eff}} = 0.51$, which predicts an unexpectedly large value for $\\Omega\\_m$, $\\Omega\\_m = 0.471^{+0.119}\\_{-0.065}$. We find that the $w\\_0 w\\_a$CDM model, using DESI DR2 data, suggests $w\\_0 > 1$, indicating a deviation from the standard $\\Lambda$CDM paradigm, where is strictly $w\\_0 = -1$. Additionally, the DESI DR2 data reveals that the value of $\\Omega\\_m$ fluctuates at the 2.97 $\\sigma$ level as redshift bin increases, particularly within the $\\Lambda$CDM paradigm. The DESI DR2 LRG1 data at $z\\_{\\text{eff}} = 0.51$ seem to contradict the results from Type Ia supernovae in the same redshift range. However, it is expected that this discrepancy will become less significant with future DESI data releases, and the trend for $\\Omega\\_m$ is expected to continue to increase as higher redshifts are considered. The statistical significance of this trend was approximately $1.8 \\sigma$ when only the DESI DR1 data was considered, but, in the light of DESI DR2 data, the significance has decreased to about $0.52 \\sigma$. Despite this reduction, the trend showing an increase in $\\Omega\\_m$ with higher redshifts remains, though with less statistical confidence. This highlights the importance of understanding why the DESI LRG1 data at $z\\_{\\text{eff}} = 0.51$ appear to be an outlier in the determination of $\\Omega\\_m$.\n\n", "2507.21307": "2025-07-28, **Rotational Dynamics in Pulsational Pair-Instability Supernovae: Implications for Mass-Loss and Transient Events**, Trang N. Huynh et.al., [2507.21307v1](http://arxiv.org/abs/2507.21307v1)\n\n Pulsational pair-instability supernovae (PPISNe) are transient events occurring in progenitor stars with helium cores of approximately 32-65 solar masses, where rapid electron-positron pair production induces pressure loss, collapse, and pulsations driving episodic mass loss. The number, strength, and duration of these pulses can lead to shell collisions that produce shock-powered transients, potentially explaining some of the most luminous events, such as superluminous supernovae, and other rare transients. Rapid progenitor rotation lowers the PPISN mass threshold and influences the dynamics, energetics, and chemical composition of PPISN-driven pulses. In this study, we computed 1D evolutionary models of massive, rotating PPISN progenitor stars with zero-age main-sequence masses of 85-140 solar masses and solar metallicity and 10% solar metallicity. Our analysis reveals strong correlations between PPISN ejected mass and total energy as well as between ejected mass and peak ejected shell velocity. Additionally, moderate correlations indicate that higher initial PPISN progenitor mass leads to greater mass ejection and energy release, while negative correlations show that rapid rotation appears to reduce mass ejection and kinetic energy of the shells. Subsequent pulses lead to hydrogen-poor, carbon- and oxygen-enriched ejected shells, indicating the effect of rotationally-induced chemical mixing in PPISN-driven episodic mass loss with implications for their transients. We model the light curve and synthetic spectra that arise from the collision of two H-poor shells for one of our models using the radiation transport code SuperLite. We find that shock-heated H-poor PPISN shell collisions from rapidly rotating progenitors can lead to moderately luminous H-poor transients that share some similarities with observed SLSN-I events.\n\n", "2507.21304": "2025-07-28, **SN2022jli modeled with a $^{56}$Ni double-layer and a magnetar**, Mariana Orellana et.al., [2507.21304v1](http://arxiv.org/abs/2507.21304v1)\n\n We study the bolometric evolution of the exceptional Type Ic Supernova (SN) 2022jli, aiming to understand the underlying mechanisms responsible for its distinctive double-peaked light curve morphology, extended timescales, and the rapid, steep decline in luminosity observed at around 270 days after the SN discovery. We present a quantitative assessment of two leading models through hydrodynamic radiative simulations: two shells enriched with nickel and a combination of nickel and magnetar power. We explore the parameter space of a model in which the SN is powered by radioactive decay assuming a bimodal nickel distribution. While this setup can reproduce the early light curve properties, it faces problems to explain the prominent second peak. We therefore consider a hybrid scenario with a rapidly rotating magnetar as additional energy source. We find that the observed light curve morphology can be well reproduced by a model combining a magnetar engine and a double-layer $^{56}$Ni distribution. The best-fitting case consist of a magnetar with a spin period of $P\\simeq 22$ ms and a bipolar magnetic field strength of $B\\simeq 5\\times 10^{14}$ G and a radioactive content with total nickel mass of 0.15 M$\\_\\odot$, distributed across two distinct shells within a pre-SN structure of 11 M$\\_\\odot$. To reproduce the abrupt drop in luminosity at $\\sim 270$ d, the energy deposition from the magnetar must be rapidly and effectively switched off.\n\n", "2507.21041": "2025-07-28, **Primordial Black Hole Triggered Type Ia Supernovae I: Impact on Explosion Dynamics and Light Curves**, Shing-Chi Leung et.al., [2507.21041v1](http://arxiv.org/abs/2507.21041v1)\n\n Primordial black holes (PBHs) in the asteroid-mass window are compelling dark matter candidates, made plausible by the existence of black holes and by the variety of mechanisms of their production in the early universe. If a PBH falls into a white dwarf (WD), the strong tidal forces can generate enough heat to trigger a thermonuclear runaway explosion, depending on the WD mass and the PBH orbital parameters. In this work, we investigate the WD explosion triggered by the passage of PBH. We perform 2D simulations of the WD undergoing thermonuclear explosion in this scenario, with the predicted ignition site as the parameter assuming the deflagration-detonation transition model. We study the explosion dynamics and predict the associated light curves and nucleosynthesis. We find that the model sequence predicts the light curves which align with the Phillip's relation ($B\\_{\\max}$ vs. $\\Delta M\\_{15}$). Our models hint at a unifying approach in triggering Type Ia supernovae without involving two distinctive evolutionary tracks.\n\n", "2507.21032": "2025-07-28, **Revisiting the Perseus Cluster I: Resolving the Si/S/Ar/Ca ratios by Stellar Convection**, Shing-Chi Leung et.al., [2507.21032v1](http://arxiv.org/abs/2507.21032v1)\n\n Chemical abundance measurements from stars in the Milky Way to the intragalactic medium in the Perseus Cluster have challenged the spherical explosion models. Models in the literature cannot closely match the observed element ratios, where Si, S are overproduced and Ar, Ca are underproduced. In this article, we explore the impact of the model parameters during the evolution of massive stars on the final explosive nucleosynthesis. We investigate the effects of a parametrized model of the convective process, including the mixing length parameter and the semi-convection parameter, on the production of Si-group elements. We search for the value pair that can reduce the discrepancy in the models. We conclude that a mixing length parameter of 2.2 and semi-convection parameter of 0.03 are required to fit these criteria. Using this updated value pair, we compute a sequence of massive star models from $M\\_{\\rm ZAMS} = $ 15 -- 40 $M\\_{\\odot}$. The high resolution data from future observations such as XRISM will provide further details on less constrained processes in stellar evolution and supernova explosion. Future comparison with supernova models of various progenitor metallicity will further shed light on the supernova population and their relative rates on cosmological scales.\n\n", "2507.20828": "2025-07-28, **X-ray Emission from Type Ia Supernova Remnants Interacting With Isotropic Progenitor Outflows**, Travis Court et.al., [2507.20828v1](http://arxiv.org/abs/2507.20828v1)\n\n The parameter space for mass loss in Type Ia supernova progenitors is large, with different progenitor scenarios favoring different mass loss regimes. Here we focus on the impact that uniform and isotropic outflows have on the circumstellar environment of Type Ia supernova progenitors. We vary mass loss rate, wind velocity, and outflow duration, and evolve supernova remnant (SNR) models in this grid of circumstellar structures in order to compare the bulk properties of these models (ages, radii, and \\feka\\ centroids and luminosities) to observations. We find that roughly 50\\% of young Type Ia SNRs in the Milky Way and the Large Magellanic Cloud had progenitors that did not substantially modify their surroundings on $\\sim$pc scales. This group includes SN Ia with a range of luminosities, and at least some likely products of double detonation explosions in sub-Chandrasekhar white dwarfs. The other half of our sample can be divided in two distinct classes. A small subset of SNRs ($\\sim$15\\%) have large radii and low \\feka\\ centroids and are likely expanding into large cavities excavated by fast ($\\sim$1000 km/s), sustained progenitor outflows. The majority of the SNRs that are expanding into a modified medium ($\\sim35\\%$) show evidence for dense material, likely associated with slow ($\\sim$10 km/s) progenitor outflows, possibly a byproduct of accretion processes in near-Chandrasekhar white dwarfs spawned by younger stellar populations.\n\n", "2507.20457": "2025-07-28, **Hydrodynamical modeling of SN 2025kg associated with the Fast X-ray Transient EP250108a**, L. M. Roman Aguilar et.al., [2507.20457v1](http://arxiv.org/abs/2507.20457v1)\n\n Supernovae (SNe) associated with X-Ray Flashes (XRFs) are extremely rare. Therefore, the discovery of each new object in this class offers a unique opportunity to improve our understanding about their origins and potential connection with other high-energy phenomena. SN 2025kg is one of the most recent events discovered in this category, and exhibits a double-peaked light curve, with an initial cooling phase followed by the main peak. Here, we investigate the possible mechanisms powering its bolometric light curve and expansion velocities, using numerical calculations to simulate the explosion. We found that low ejecta masses (Mej ~ 2 Msun) and moderate explosion energies (E ~ 2e51 erg) are required to reproduce the data. Our models also show that a large amount of nickel (M\\_Ni = 0.85 Msun) is needed to achieve the high luminosity of SN 2025kg, which makes this scenario difficult to sustain. As an alternative, we explore a model in which a millisecond magnetar serves as the primary energy source. A magnetar with a spin period of 3 ms, approximately, and a magnetic field of 28e14 G gives an adequate match to the data. To account for the early cooling phase, we assume the presence of a dense circumstellar material surrounding the progenitor, with a mass of 0.27 Msun and an extension of 500 Rsun. A comparison and modeling of a select group of SNe--SN 2006aj, SN 2020bvc and SN 2023pel--is also presented. A remarkable similarity emerges between SN 2025kg and SN 2023pel. As SN 2023pel was recently proposed to be powered by a magnetar, this further supports the magnetar scenario for SN 2025kg.\n\n"}}