{"neutrino": {"2510.17636": "2025-10-20, **Extracting SASI signatures from Gravitational Waves of Core-Collapse Supernovae using the Hilbert-Huang Transform**, Alessandro Veutro et.al., [2510.17636v1](http://arxiv.org/abs/2510.17636v1)\n\n Core collapse supernovae are among the most energetic astrophysical events in the Universe. Despite huge efforts on understanding the main ingredients triggering such explosions, we still lack of compelling evidences for the precise mechanism driving those phenomena. They are expected to produce gravitational waves due to asymmetric mass motions in the collapsing core, and emit in the meanwhile neutrinos as a result of the interactions in their high-density environment. The combination of these two cosmic messengers can provide a unique probe to study the inner engine of these processes and unveil the explosion mechanism. Among the possible detectable signature, standing accretion shock instabilities (SASI) are particularly relevant in this context as they establish a direct connection between gravitational wave emission and the outcoming neutrino flux. In this work, Hilbert-Huang transform is applied to a selected sample of 3D numerical simulations, with the aim of identifying SASI contribution and extract its instantaneous frequency. The performance of the method is evaluated in the context of Einstein Telescope.\n\n", "2510.17583": "2025-10-20, **Leptonic first-row correlation and non-unitarity waiting for direct JUNO and Daya Bay precision tests**, Zhi-zhong Xing et.al., [2510.17583v1](http://arxiv.org/abs/2510.17583v1)\n\n We conjecture that there exists a remarkable correlation among the three elements in the first row of the $3\\times 3$ lepton flavor mixing matrix $U$: $\\|U^{}\\_{e1}\\|^2 = 2 \\left(\\|U^{}\\_{e2}\\|^2 + \\|U^{}\\_{e3}\\|^2\\right)$, which holds even though $U$ is non-unitary in the canonical seesaw mechanism. This ``first-row correlation\" is fully consistent with $\\sin^2\\theta^{}\\_{12} = \\left(1 - 2\\tan^2\\theta^{}\\_{13}\\right)/3$ for the two active neutrino mixing angles derived from the TM1 flavor mixing pattern, and it will be {\\it directly} tested by the upcoming JUNO precision data combined with the Daya Bay precision measurement.\n\n", "2510.17523": "2025-10-20, **Highlights from the IceCube Neutrino Observatory**, Alexander Kappes et.al., [2510.17523v1](http://arxiv.org/abs/2510.17523v1)\n\n The IceCube neutrino observatory has been successfully operating in its full configuration for almost 15 years and is characterized by a remarkably high stability and uptime. During this time, it has made many groundbreaking observations, such as the first detection of a high-energy diffuse cosmic neutrino flux or, more recently, the identification of the AGN NGC1068 as a steady source of high-energy neutrino emission and the observation of neutrinos from the Milky Way. In this talk, new developments in these areas will be discussed and further highlights presented. The second part then looks at the ongoing developments at the South Pole with IceCube Upgrade and IceCube-Gen2 and discusses their potential for advancing neutrino and astroparticle physics.\n\n", "2510.17473": "2025-10-20, **The Dark Matters at ICRC 2025**, Milena Crnogorčević et.al., [2510.17473v1](http://arxiv.org/abs/2510.17473v1)\n\n The dark matter track at ICRC~2025 showed a field in transition. Direct detection has entered the \\emph{neutrino-floor era}, with XENONnT and PandaX-4T now limited by Solar neutrinos. Indirect searches have become truly \\emph{multimessenger}, combining $\\gamma$-rays, neutrinos, cosmic rays, and radio data under unified likelihoods and shared systematics. Non-WIMP candidates -- axions, sub-GeV particles, primordial black holes, macroscopic relics -- are becoming central. Across all fronts, progress depends as much on new detectors as on the coherence of shared data, methods, and analysis frameworks. Here, I distill the main experimental and conceptual shifts behind these trends, noting how assumptions have evolved since ICRC~2023 and where the next decisive advances are likely to come.\n\n", "2510.17423": "2025-10-20, **Energy calibration of bulk events in the BULLKID detector**, M. Folcarelli et.al., [2510.17423v1](http://arxiv.org/abs/2510.17423v1)\n\n BULLKID is a cryogenic, solid-state detector designed for direct searches of particle Dark Matter candidates, with mass $\\lesssim 1$ GeV/c$^2$, and coherent neutrino-nucleus scattering. It is based on an array of dice carved in 5 mm thick silicon crystal, sensed by phonon-mediated Kinetic Inductance Detectors. In previous works, the array was calibrated with bursts of optical photons, which are absorbed in the first hundreds nanometers of the dice and give rise to surface events. In this work, we present the reconstruction of bulk events through the 59.5 keV $\\gamma$-ray generated by an $^{241}$Am source, which emulates more closely the interaction of Dark Matter and neutrinos. The peak resolution is $5\\%~(\\sigma)$ and its position is shifted by less than $10\\%$ with respect to the optical calibration. We observe that the resolution is further improved by a factor $2$ combining the signal from neighboring dice. These results confirm the performance of the detector in view of the physics goals of the BULLKID-DM experiment for dark matter search.\n\n", "2510.17370": "2025-10-20, **High Quality QCD Axion in the Standard Model**, Jie Sheng et.al., [2510.17370v1](http://arxiv.org/abs/2510.17370v1)\n\n Although the axion is the most compelling solution to the strong CP problem, the ad hoc introduced global Peccei-Quinn symmetry suffers from a severe fine-tuning problem known as the quality problem. In this Letter, we show that the discrete gauge symmetry $\\mathbb Z\\_4 \\times \\mathbb Z\\_3$ motivated from the internal structure of the Standard Model can naturally predict a high-quality axion, leading to a distinct and testable parameter space. Remarkably, this minimal framework simultaneously accounts for neutrino masses, baryon asymmetry, and dark matter.\n\n", "2510.17292": "2025-10-20, **A radiative seesaw model in a non-invertible selection rule with the assistance of a non-holomorphic modular $A_4$ symmetry**, Shilpa Jangid et.al., [2510.17292v1](http://arxiv.org/abs/2510.17292v1)\n\n We propose a two-loop neutrino mass model where fermionic and bosonic dark matter (DM) candidates are simultaneously connected to the neutrinos. But the fermionic DM candidate is favored compared to the bosonic one due to generating the fermionic DM mass at one-loop level. In order to obtain our desired Lagrangian and Higgs potential, we introduce a $Z\\_3$ gauging TY non-invertible fusion rule with the assistance of a non-holomorphic modular $A\\_4$ symmetry. The fusion rule forbids the mass of DM candidate at tree level but its mass is generated at one-loop level where the DM mass term dynamically violates the fusion rule. After that, the neutrino mass matrix is induced at one-loop level where a remnant $Z\\_2$ symmetry is still remained. The symmetry assures the stability of our DM candidate. The non-holomorphic modular $A\\_4$ symmetry plays a role in forbidding the interactions between the SM particles and heavier fermions $X\\_R$ and an isospin singlet inert scalar boson $S\\_0$ that run in the DM mass loop, in addition to reduction our free parameters that leads to our predictions for lepton sector. We perform $\\chi^2$ numerical analysis for the lepton masses, mixing angles, and phases, and we show several predictions for NH and IH. Then, we demonstrate our lepton flavor violations, muon anomalous magnetic dipole moment, and the relic density of the DM candidate fixing the best fit point of the lepton sector.\n\n", "2510.17156": "2025-10-20, **Radiative lepton model in a non-invertible fusion rule**, Takaaki Nomura et.al., [2510.17156v1](http://arxiv.org/abs/2510.17156v1)\n\n We propose a radiatively induced lepton mass model introducing a $Z\\_2$ gauging $Z\\_5$ fusion rule. In our framework, the charged-lepton mass matrix is generated at one loop level via dynamical breaking of the fusion rule. On the other hand, the neutrino mass matrix is induced at one-loop level without breaking the fusion rule. As a direct consequence of the loop induced charged lepton masses, we can also consider lepton flavor violations, electron and muon $g-2$, and charged-lepton electric dipole moments that come into our valid phenomenological discussion. Then, we perform numerical analysis and show some interesting tendency on Dirac CP phase, two Majorana phases, charged-lepton electric dipole moments and the neutrinoless double beta decay, all of which depends on their arguments where we fix the absolute values of our free parameters in order to satisfy experimental data of the lepton masses and mixing angles.\n\n", "2510.17082": "2025-10-20, **Measurement of radon concentration in the output water of the 100~t/h ultrapure water system at the Jiangmen Underground Neutrino Observatory**, C. B. Z. Luo et.al., [2510.17082v1](http://arxiv.org/abs/2510.17082v1)\n\n The Jiangmen Underground Neutrino Observatory (JUNO), a 20 kton multi-purpose low background liquid scintillator detector, was proposed primarily to determine the neutrino mass ordering. To mitigate radioactivity from surrounding rock and enable cosmic muon tagging, its central detector is immersed in a Water Cherenkov Detector (WCD) containing 40~ktons of ultrapure water instrumented with 2400 20-inch micro-channel plate photomultiplier tubes. Stringent radiopurity requirements mandate a radon concentration below 10 ~mBq/m$^3$ in the WCD. To achieve this, we developed a two-stage (ground and underground) ultrapure water system with 100~t/h production capacity, integrating a five-stage degassing membrane for radon removal. A novel microbubble technique was implemented to optimize the degassing membranes' radon removal efficiency. The synergistic combination of the microbubble technology and the multistage degassing membranes achieved a radon removal efficiency exceeding 99.9\\%, reducing the system's output to 0.61 $\\pm$ 0.50~mBq/m$^3$ in recirculation mode, surpassing design specifications and establishing world-leading performance standards. This paper details the ultrapure system architecture, quantifies the radon contributions of each device, and presents a comprehensive study on microbubble-augmented membrane degassing for low radon ultra-pure water production in a 100~t/h water system.\n\n", "2510.17027": "2025-10-19, **Searching for generalized neutrino interactions in direct detection experiments with EνES**, Jesús Miguel Celestino-Ramírez et.al., [2510.17027v1](http://arxiv.org/abs/2510.17027v1)\n\n We investigate the sensitivity of present and future direct detection experiments to generalized neutrino interactions (GNI) through elastic neutrino electron scattering. Using data from LUX-ZEPLIN, PandaX-4T, and XENONnT, we derive constraints on vector, axial-vector, scalar, and tensor effective couplings, and compare them with existing limits. Our results show that current xenon-based detectors already provide competitive bounds, with XENONnT offering the most stringent constraints due to its larger exposure and reduced backgrounds. Among the GNI couplings, the scalar contributions remain more weakly constrained, while tensor interactions yield the strongest limits. We also present projected sensitivities for the DARWIN experiment, showing potential improvements. These results demonstrate the capability of direct detection experiments, originally designed for dark matter searches, to provide complementary and competitive constraints on generalized neutrino interactions.\n\n", "2510.16711": "2025-10-19, **Neutrino Oscillation Prospects with a Dual-Baseline Beam from BNL to SNOLAB and SURF**, Nishat Fiza et.al., [2510.16711v1](http://arxiv.org/abs/2510.16711v1)\n\n The Electron-Ion Collider (EIC) is a next-generation accelerator primarily designed to study the internal structure of nucleons through high-precision electron-hadron collisions. In this work, we explore the feasibility of employing a 1 MW fraction of the EIC proton beam to generate a high-intensity GeV-scale neutrino beam for long-baseline oscillation studies. We have simulated proton-target interactions and optimize the resulting neutrino fluxes for water-based liquid scintillator (WbLS) detectors located at distinct baselines of 900 km and at 2900 km. Oscillation analyses performed with GLoBES show that extended baselines allow access to multiple oscillation maxima, significantly enhancing sensitivity to leptonic CP violation. The study also examines the interplay between matter effects and the intrinsic CP violating phase in shaping observable asymmetries. These results suggest that the EIC proton beam could provide a novel and complementary source for precision neutrino physics, extending the scientific reach of the EIC program.\n\n"}, "dark matter": {"2510.17765": "2025-10-20, **Phantom scalar field with arbitrary potential: accelerating scaling attractors**, Sudip Halder et.al., [2510.17765v1](http://arxiv.org/abs/2510.17765v1)\n\n In this article, we investigate the dynamics of a phantom scalar field with an arbitrary potential, focusing on accelerating scaling solutions of cosmological relevance. We consider both uncoupled and coupled cosmological scenarios. In the latter case, the coupling between phantom dark energy and dark matter is motivated by the warm inflationary paradigm, with the dissipation coefficient assumed to be either constant or variable. The evolution equations of our coupled and uncoupled cosmological models are written in the form of autonomous systems, whose stability is studied using methods of qualitative analysis of dynamical systems. For this analysis, the only requirement imposed on the phantom scalar-field potential is that a specific dynamical variable, defined in terms of the potential and its derivative, must be invertible. We show that the uncoupled phantom cosmological model cannot accommodate any accelerated scaling solution, while such solutions do exist in the coupled scenario, for both constant and variable dissipation coefficients. Although there is a limitation to these scaling solutions $-$ specifically, the current stage of accelerated expansion is not preceded by a long enough matter-dominated era $-$ our results show that the existence of a direct coupling between phantom dark energy and dark matter yields great potential for addressing the cosmic coincidence problem.\n\n", "2510.17704": "2025-10-20, **Einstein gravity extended by a scale covariant scalar field with Bekenstein term and dynamical mass generation**, Erhard Scholz et.al., [2510.17704v1](http://arxiv.org/abs/2510.17704v1)\n\n Under carefully chosen assumptions a single general relativistic scalar field is able to induce MOND-like dynamics in the weak field approximation of the Einstein frame (gauge) and to modify the light cone structure accordingly. This is shown by a Lagrangian model formulated in the framework of integrable Weyl geometry. It contains a Bekenstein-type (``aquadratic'') term and a second order term generating additional mass energy for the scalar field. Both are switched on only if the gradient of the scalar field is spacelike and below a MOND-typical threshold, like in the superfluid model of Berezhiani/Khoury. The mass term induces non-negligible energy and pressures of the scalar field and leads to gravitational light deflection compatible with MOND-ian free fall trajectories. In the weak field (Newton-Milgrom) approximation the Bekenstein term implies a deep MOND equation for the scalar field. In this model the external field effect of the MOND approach has to be reconsidered. This has important consequences for hierarchical systems like clusters, which may suffice for explaining their dynamics without additional dark matter.\n\n", "2510.17682": "2025-10-20, **Real-Time Readout System Design for the BULLKID-DM Experiment: Enhancing Dark Matter Search Capabilities**, T. Muscheid et.al., [2510.17682v1](http://arxiv.org/abs/2510.17682v1)\n\n The BULLKID-DM experiment aims to detect WIMP-like potential Dark Matter particles with masses below 1 GeV/c^2. Sensing these particles is challenging, as it requires nuclear recoil detectors characterized by high exposure and an energy threshold in the order of 100 eV, thus exceeding the capabilities of conventional semiconductor detectors. BULLKID-DM intends to tackle this challenge by using cryogenic Kinetic Inductance Detectors (MKIDs) with exceptional energy thresholds to sense a target with a total mass of 800 g across 16 wafers, divided into over 2000 individually instrumented silicon dice. The MKIDs on each wafer are coupled to a single transmission line and read using a frequency division multiplexing approach by the room-temperature data acquisition.   In this contribution, we describe and assess the design of the room-temperature readout electronics system, including the selected hardware components and the FPGA firmware which contains the real-time signal processing stages for tone generation, frequency demultiplexing, and event triggering. We evaluate the system on the ZCU216 board, a commercial evaluation card built around a Radio-Frequency System-on-Chip (RFSoC) with integrated high-speed DACs and ADCs, and connected it to a custom-designed analog front-end for signal conditioning.\n\n", "2510.17592": "2025-10-20, **Euclid preparation: The flat-sky approximation for the clustering of Euclid's photometric galaxies**, Euclid Collaboration et.al., [2510.17592v1](http://arxiv.org/abs/2510.17592v1)\n\n We compare the performance of the flat-sky approximation and Limber approximation for the clustering analysis of the photometric galaxy catalogue of Euclid. We study a 6 bin configuration representing the first data release (DR1) and a 13 bin configuration representative of the third and final data release (DR3). We find that the Limber approximation is sufficiently accurate for the analysis of the wide bins of DR1. Contrarily, the 13 bins of DR3 cannot be modelled accurately with the Limber approximation. Instead, the flat-sky approximation is accurate to below $5\\%$ in recovering the angular power spectra of galaxy number counts in both cases and can be used to simplify the computation of the full power spectrum in harmonic space for the data analysis of DR3.\n\n", "2510.17387": "2025-10-20, **One-loop QED and Weak Corrections to $γγ\\to H^\\pm H^\\mp$ in the Inert Doublet Model**, Hamza Abouabid et.al., [2510.17387v1](http://arxiv.org/abs/2510.17387v1)\n\n We present a complete one-loop analysis of charged scalar boson pair production in photon-photon collisions, $\\gamma\\gamma \\to H^\\pm H^\\mp$, within the framework of the Inert Doublet Model (IDM). The calculation is carried out in the on-shell renormalization scheme and incorporates both weak corrections and QED effects, including soft and hard photon radiation. Virtual loop contributions and real emission processes are computed using the Feynman diagrammatic method, ensuring the cancellation of ultraviolet and infrared divergences. To properly account for the Coulomb singularity that arises in the QED sector near threshold, we introduce the resummed cross section based on the Sommerfeld factor. The IDM parameter space is explored under theoretical consistency conditions, collider limits, and dark matter constraints, and three representative scenarios are studied in detail. We find that the magnitude of the quantum corrections is strongly controlled by the absolute value of the trilinear scalar coupling $\\lambda\\_{h^0 H^+ H^-}$, which correlates with the charged scalar mass. When all constraints are applied, the weak corrections are typically in the range of $-12\\%$ to $-7\\%$ at $\\sqrt{s}=250$~GeV, and between $-15\\%$ and $6\\%$ at $\\sqrt{s}=500$~GeV. At higher energies, such as $\\sqrt{s}=1$~TeV, the corrections can become very large, ranging from about $-20\\%$ up to $+60\\%$. Our findings highlight the significant role of higher-order effects in photon-photon collisions and establish $\\gamma\\gamma \\to H^\\pm H^\\mp$ as a promising process to investigate the charged scalar sector of the IDM at future high-energy photon colliders. Several benchmark points are proposed to facilitate future experimental searches.\n\n", "2510.17079": "2025-10-20, **Heating and scattering of stellar distributions by ultralight dark matter**, Andrew Eberhardt et.al., [2510.17079v1](http://arxiv.org/abs/2510.17079v1)\n\n Due to wave interference, an ultralight light dark matter halo has stochastic, granular substructures which can scatter stars, leading to the heating of stellar distributions. Studies of this phenomenon have placed lower bounds on the ultralight dark matter mass. In this paper we investigate a number of relevant systematic effects, including: (1) the heating by the central soliton, (2) the self-gravity of the stars, (3) the suppression of heating in a tidally stripped halo, and (4) the tidal field suppression of heating when the stellar cluster is much smaller than the de Broglie wavelength. The first three effects are quantified by studying the dynamics of stellar particles in Schrodinger-Poisson simulations of ultralight dark matter halos, while the last effect is studied using analytic approximations.\n\n", "2510.17026": "2025-10-19, **The window on heavy charged dark matter was never open**, Daniele Perri et.al., [2510.17026v1](http://arxiv.org/abs/2510.17026v1)\n\n There is a claim in the literature that charged dark matter particles in the mass range $100 (q\\_{\\rm X}/e)^2~\\mathrm{TeV} \\leq m\\_{\\rm X} \\leq 10^8 (q\\_{\\rm X}/e)~\\mathrm{TeV}$ are allowed, based on arguing that heavy charged particles cannot reach the Earth from outside the magnetized region of the Milky Way (Chuzhoy-Kolb, 2009). We point out that this claim fails for physical models for the Galactic magnetic field. We explicitly confirm our argument by simulating with the software CRPropa the trajectories of heavy charged dark matter in models of the Galactic magnetic field.\n\n", "2510.16746": "2025-10-19, **A Way of Axion Detection with Mass $10^{-4} \\text{-}10^{-3}$eV Using Cylindrical Sample with Low Electric Conductivity**, Aiichi Iwazaki et.al., [2510.16746v1](http://arxiv.org/abs/2510.16746v1)\n\n A dark matter axion with mass $m\\_a$ induces an oscillating electric field in a cylindrical sample placed under a magnetic field $B$ parallel to the cylinder axis. When the cylinder is made of a highly electrically conductive material, the induced oscillating current primarily dissipates the axion energy at the surface. In contrast, if the cylinder is composed of a material with low conductivity, e.g. $\\sigma = 10^{-3}\\text{eV}$, the axion energy is dissipated mainly inside the bulk of the cylinder. Within the QCD axion model, the dissipated power $P$ is estimated as $P \\simeq 2.8\\times 10^{-28}\\text{W} g\\_{\\gamma}^2 \\left(L/100\\text{cm}\\right)\\left(R/2\\text{cm}\\right)^2 \\left(m\\_a/10^{-4}\\text{eV}\\right) \\left(B/10\\text{T}\\right)^2\\left(10/\\epsilon\\right) \\left(\\rho\\_a/0.3\\text{GeVcm}^{-3}\\right)$, with $\\sigma= 10^{-3}$eV, radius $R$, length $L$, electric permittivity $\\epsilon = 10$ of the cylinder and axion energy density $\\rho\\_a$, where $g\\_{\\gamma}(\\text{KSVZ}) = -0.96$ and $g\\_{\\gamma}(\\text{DFSZ}) = 0.37$. Using an LC circuit appropriately tuned to a quality factor $Q = 10^6$, the signal-to-noise ratio at low temperature $100$mK and observation time $60$sec. is so large $\\sim 10$ that the detection of dark matter axions is feasible in the mass range $m\\_a =10^{-4}\\text{-}10^{-3}\\text{eV}$.\n\n"}, "supernova": {"2510.17676": "2025-10-20, **A modeling perspective on the diversity of red-supergiant stars exploding within circumstellar material**, Luc Dessart et.al., [2510.17676v1](http://arxiv.org/abs/2510.17676v1)\n\n With the ever faster cadence of untargeted surveys of the sky, the supernova (SN) community will capture in the coming years a growing number of shock breakouts in red-supergiant (RSG) stars. Expecting a high frequency of breakouts within circumstellar material (CSM), we have produced an extended, regular and cubic grid of models covering from low- to high-energy explosions, compact to extended CSM, moderate- to high-density CSM. Here, we document the main results from the radiation-hydrodynamics and nonlocal thermodynamic equilibrium radiative-transfer calculations over the first 15d of evolution, including the bolometric and multi-band light curves and the salient features from spectra. As before, CSM interaction is found to boost the UV brightness and shorten the optical rise time if compact. Higher ionization (e.g., as seen with OVI3820A) is obtained for more compact CSM, and is maximum for explosions in a vacuum. CSM interaction also diversifies the spectral evolution as seen in line profile morphology, with electron-scattering broadening dominating during the IIn phase. In the absence of CSM, Doppler broadening dominates immediately after shock breakout and leads to strongly blueshifted emission in lines such as HeII4686A or CIV5805A. This treasury of models will be used to analyze as well as predict future observations of RSG shock breakouts in CSM.\n\n", "2510.17125": "2025-10-20, **From Stars to Waves: Non-deterministic Inference of Microlensed Gravitational Waves**, Zhaoqi Su et.al., [2510.17125v1](http://arxiv.org/abs/2510.17125v1)\n\n Strongly lensed gravitational waves may pass through the stellar field of a lensing galaxy with additional modulations (on both phase and amplitude) due to gravitational microlensing effect of stars/remnants near the line of sight. These microlensed waveforms depend on the mass and location of thousands or more most relevant stars, so that their deterministic reconstruction from the data is computationally prohibitive. We classify the detection and parameter estimation of such events as non-deterministic inference problem and propose a solution with the implementation of normalizing flows. As a first step, we show that $8\\%$ of microlensed events can be detected with significance $\\ge 3 \\sigma$ in the third generation era, with the chosen microlensing parameters correlated with the density of the underlying stellar field. This approach opens the door to probing microlensing effects and the properties of the underlying stellar fields. A similar construction may also be applied to other non-deterministic inference problems, such as detecting post-merger gravitational waves from binary neutron star coalescence and signals from core-collapse supernovae.\n\n", "2510.17104": "2025-10-20, **Optimizing Kilonova Searches: A Case Study of the Type IIb SN 2025ulz in the Localization Volume of the Low-Significance Gravitational Wave Event S250818k**, Noah Franz et.al., [2510.17104v1](http://arxiv.org/abs/2510.17104v1)\n\n Kilonovae, the ultraviolet/optical/infrared counterparts to binary neutron star mergers, are an exceptionally rare class of transients. Optical follow-up campaigns are plagued by impostors whose early evolution masquerades as the rapid radioactive decay of heavy elements. In this work, we present an analysis of the multi-wavelength dataset of supernova (SN) 2025ulz, a proposed kilonova candidate following the low-significance detection of gravitational waves originating from the potential binary neutron star merger S250818k. Despite an early rapid decline in brightness, our multi-wavelength observations of SN 2025ulz reveal that it is a type IIb supernova. As part of this analysis, we demonstrate the capabilities of a novel quantitative scoring algorithm to determine the likelihood that a transient candidate is a kilonova, based primarily on its 3D location and light curve evolution. We also apply our scoring algorithm to other transient candidates in the localization volume of S250818k and find that, at all times after the discovery of SN 2025ulz, there are $\\geq 4$ candidates with a score more promising than SN 2025ulz. During future kilonova searches, this type of scoring algorithm will be useful to rule out contaminating transients in real time, optimizing the use of valuable telescope resources.\n\n", "2510.17053": "2025-10-19, **Investigating the Effects of Point Source Injection Strategies on KMTNet Real/Bogus Classification**, Dongjin Lee et.al., [2510.17053v1](http://arxiv.org/abs/2510.17053v1)\n\n Recently, machine learning-based real/bogus (RB) classifiers have demonstrated effectiveness in filtering out artifacts and identifying genuine transients in real-time astronomical surveys. However, the rarity of transient events and the extensive human labeling required for a large number of samples pose significant challenges in constructing training datasets for RB classification. Given these challenges, point source injection techniques, which inject simulated point sources into optical images, provide a promising solution. This paper presents the first detailed comparison of different point source injection strategies and their effects on classification performance within a simulation-to-reality framework. To this end, we first construct various training datasets based on Random Injection (RI), Near Galaxy Injection (NGI), and a combined approach by using the Korea Microlensing Telescope Network datasets. Subsequently, we train convolutional neural networks on simulated cutout samples and evaluate them on real, imbalanced datasets from gravitational wave follow-up observations for GW190814 and S230518h. Extensive experimental results show that RI excels at asteroid detection and bogus filtering but underperforms on transients occurring near galaxies (e.g., supernovae). In contrast, NGI is effective for detecting transients near galaxies but tends to misclassify variable stars as transients, resulting in a high false positive rate. The combined approach effectively handles these trade-offs, thereby balancing between detection rate and false positive rate. Our results emphasize the importance of point source injection strategy in developing robust RB classifiers for transient (or multi-messenger) follow-up campaigns.\n\n"}}