{"neutrino": {"2306.07671": "2023-06-13, **Interplay between non-interfering neutrino exchange mechanisms and nuclear matrix elements in $0νββ$ decay**, Eligio Lisi et.al., [2306.07671v1](http://arxiv.org/abs/2306.07671v1)\n\n We revisit the phenomenology of neutrinoless double beta ($0\\nu\\beta\\beta$) decay mediated by non-interfering exchange of light and heavy Majorana neutrinos, in the context of current and prospective ton-scale experimental searches, as well as of recent calculations of nuclear matrix elements (NME) in different nuclear models. We derive joint upper bounds on the light and heavy contributions to $0\\nu\\beta\\beta$ decay, for different sets of NME, through separate and combined data coming from the following experiments (and isotopes): KamLAND-Zen and EXO (Xe), GERDA, and MAJORANA (Ge) and CUORE (Te). We further consider three proposed projects that could provide, within current bounds, possible $0\\nu\\beta\\beta$ decay signals at $>\\!3\\sigma$ level with an exposure of 10 ton years: nEXO (Xe), LEGEND (Ge) and CUPID (Mo). Separate and combined (Xe, Ge, Mo) signals are studied for different representative cases and NME sets, and the conditions leading to (non)degenerate light and heavy neutrino mechanisms are discussed. In particular, the role of heavy-to-light NME ratios in different isotopes is highlighted through appropriate graphical representations. By using different sets of ``true'' and ``test'' NME as a proxy for nuclear uncertainties, it is shown that the relative contributions of light and heavy neutrino exchange to $0\\nu\\beta\\beta$ signals may be significantly biased in some cases. Implications for theoretical models connecting light and heavy Majorana neutrino masses are also briefly illustrated. These results provide further motivations to improve NME calculations, so as to better exploit the physics potential of future multi-isotope $0\\nu\\beta\\beta$ searches at the ton scale.\n\n", "2306.07659": "2023-06-13, **R-process beta-decay neutrino flux from binary neutron star merger and collapsar**, Yu An et.al., [2306.07659v1](http://arxiv.org/abs/2306.07659v1)\n\n This study investigates the antineutrinos production by $\\beta$-decay of $r$-process nuclei in two astrophysical sites that are capable of producing gamma-ray bursts (GRBs): binary neutron star mergers (BNSMs) and collapsars, which are promising sites for heavy element nucleosynthesis. We employ a simplified method to compute the $\\beta$-decay $\\bar\\nu\\_e$ energy spectrum and consider two representative thermodynamic trajectories for $r$-process simulations, each with four sets of $Y\\_e$ distribution. The time evolution of the $\\bar\\nu\\_e$ spectrum is derived for both the dynamical ejecta and the disk wind for BNSMs and collapsar outflow, based on approximated mass outflow rates. Our results show that the $\\bar\\nu\\_e$ has an average energy of approximately 3 to 9~MeV, with a high energy tail of up to 20 MeV. The $\\bar\\nu\\_e$ flux evolution is primarily determined by the outflow duration, and can thus remain large for $\\mathcal{O}(10)$~s and $\\mathcal{O}(100)$~s for BNSMs and collapsars, respectively. For a single merger or collapsar at 40~Mpc, the $\\bar\\nu\\_e$ flux is $\\mathcal{O}(10-100)$~cm$^{-2}$~s$^{-1}$, indicating a possible detection horizon up to $0.1-1$~Mpc for Hyper-kamiokande. We also estimate their contributions to the diffuse $\\bar\\nu\\_e$ background. Our results suggest that although the flux from BNSMs is roughly 4--5 orders of magnitude lower than that from the regular core-collapse supernovae, those from collapsars can possibly contribute a non-negligible fraction to the total diffuse $\\bar\\nu\\_e$ flux at energy $\\lesssim 1$~MeV, with a large uncertainty depending on the unknown rate of collapsars capable of hosting the $r$-process.\n\n", "2306.07517": "2023-06-13, **Post-inflationary Contamination of Local Primordial Non-Gaussianity in Galaxy Power Spectra**, Charuhas Shiveshwarkar et.al., [2306.07517v1](http://arxiv.org/abs/2306.07517v1)\n\n The scale-dependent bias of galaxy density contrasts is an important signal to be extracted in constraining local primordial non-Gaussianity ($f\\_{\\rm NL}^{\\text{local}}$) from observations of large-scale structure. Constraints so obtained rely on the assumption that horizon-scale features in the galaxy power spectrum are exclusively due to primordial physical mechanisms. Yet, post-inflationary effects can induce modulations to the galaxy number density that appear as horizon-scale, scale-dependent bias. We investigate the effect of two such sources of scale-dependent bias - the free-streaming of light relics and fluctuations in the background of ionising radiation - on precision measurements of local primordial non-Gaussianity $f\\_{\\rm NL}^{\\text{local}}$ from galaxy power spectrum measurements. Using the SPHEREx survey as a test case survey reaching $\\sigma(f\\_{\\rm NL}^{\\rm local}) \\lesssim 1$, we show that ignoring the scale-dependent bias induced by free-streaming particles can negatively bias the inferred value of $f\\_{\\rm NL}^{\\rm local}$ by $\\sim 0.1-0.3\\sigma$. Ignoring the effect of ionising radiation fluctuations can negatively bias the inferred value of $f\\_{\\rm NL}^{\\rm local}$ by $ \\sim 1\\sigma$. The range of biases depends on the source populations and the ranges of scales used in the analysis, as well as the value of the neutrino mass and the modelling of the impact of ionising radiation. If these sources of scale-dependent bias are included in the analysis, forecasts for $f\\_{\\rm NL}^{\\rm local}$ are unbiased but degraded.\n\n"}, "dark matter": {"2306.07865": "2023-06-13, **Pseudo-Goldstone dark matter in a radiative inverse seesaw scenario**, Kristjan Kannike et.al., [2306.07865v1](http://arxiv.org/abs/2306.07865v1)\n\n We consider a scale-invariant inverse seesaw model with dynamical breaking of gauge symmetry and lepton number. In some regions of the parameter space, the Majoron - the pseudo-Goldstone of lepton number breaking - is a viable dark matter candidate. The bound on the Majoron decay rate implies a very large dilaton VEV, which also results in a suppression of other DM couplings. Because of that, the observed dark matter relic abundance can only be matched via the freeze-in mechanism. Another scalar field among the ones included in the model can play the role of the inflaton, predicting a tensor-to-scalar ratio $r \\lesssim 0.007$ for metric inflation and $r \\lesssim 0.16$ for Palatini gravity.\n\n", "2306.07756": "2023-06-13, **Impact of Dynamical Friction on the Tidal Formation of NGC 1052-DF2**, Ryosuke Katayama et.al., [2306.07756v1](http://arxiv.org/abs/2306.07756v1)\n\n If a normal dwarf satellite galaxy repeatedly suffers from strong tidal forces while orbiting a massive halo, it can turn into a dark matter-deficient galaxy (DMDG). It has been shown that NGC 1052-DF2 can form due to this tidal scenario by N-body simulation; however, the dynamical friction has been ignored in the literature. We perform a self-consistent full N-body simulation to investigate the effect of dynamical friction on the formation scenario and compare it with the one without dynamical friction. We find that dynamical friction causes a dramatic decay of the satellite's orbit. This makes the orbital period shorter, and the mass of the satellite decreases more rapidly. As a result, the satellite galaxy suffering from dynamical friction becomes a DMDG in $\\approx 7-8$ Gyr, which is $\\approx 2-3$ Gyr earlier than that in the simulation without dynamical friction. Although the distribution of the globular clusters (GCs) in our simulation does not fully agree with that of DF2, the current observations still have large uncertainties. Our result implies that DF2 can be formed by a more circular orbit within a Hubble time, and that DMDGs can be formed by this tidal scenario more often than previously thought.\n\n", "2306.07753": "2023-06-13, **Forbidden dark matter annihilation into leptons with full collision terms**, Amin Aboubrahim et.al., [2306.07753v1](http://arxiv.org/abs/2306.07753v1)\n\n The standard approach of calculating the relic density of thermally produced dark matter based on the assumption of kinetic equilibrium is known to fail for forbidden dark matter models since only the high momentum tail of the dark matter phase space distribution function contributes significantly to dark matter annihilations. Furthermore, it is known that the computationally less expensive Fokker-Planck approximation for the collision term describing elastic scattering processes between non-relativistic dark matter particles and the Standard Model thermal bath breaks down if both scattering partners are close in mass. This, however, is the defining feature of the forbidden dark matter paradigm. In this paper, we therefore include the full elastic collision term in the full momentum-dependent Boltzmann equation as well as in a set of fluid equations that couple the evolution of the number density and dark matter temperature for a simplified model featuring forbidden dark matter annihilations into muon or tau leptons through a scalar mediator. On the technical side, we perform all angular integrals in the full collision term analytically and take into account the effect of dark matter self-interactions on the relic density. The overall phenomenological outcome is that the updated relic density calculation results in a significant reduction of the experimentally allowed parameter space compared to the traditional approach, which solves only for the abundance. In addition, almost the entire currently viable parameter space can be probed with CMB-S4, next-generation beam-dump experiments or at a future high-luminosity electron-position collider, except for the resonant region where the mediator corresponds to approximately twice the muon or tau mass.\n\n"}, "supernova": {"2306.07728": "2023-06-13, **Multi-Epoch Machine Learning 2: Identifying physical drivers of galaxy properties in simulations**, Robert McGibbon et.al., [2306.07728v1](http://arxiv.org/abs/2306.07728v1)\n\n Using a novel machine learning method, we investigate the buildup of galaxy properties in different simulations, and in various environments within a single simulation. The aim of this work is to show the power of this approach at identifying the physical drivers of galaxy properties within simulations. We compare how the stellar mass is dependent on the value of other galaxy and halo properties at different points in time by examining the feature importance values of a machine learning model. By training the model on IllustrisTNG we show that stars are produced at earlier times in higher density regions of the universe than they are in low density regions. We also apply the technique to the Illustris, EAGLE, and CAMELS simulations. We find that stellar mass is built up in a similar way in EAGLE and IllustrisTNG, but significantly differently in the original Illustris, suggesting that subgrid model physics is more important than the choice of hydrodynamics method. These differences are driven by the efficiency of supernova feedback. Applying principal component analysis to the CAMELS simulations allows us to identify a component associated with the importance of a halo's gravitational potential and another component representing the time at which galaxies form. We discover that the speed of galactic winds is a more critical subgrid parameter than the total energy per unit star formation. Finally we find that the Simba black hole feedback model has a larger effect on galaxy formation than the IllustrisTNG black hole feedback model.\n\n", "2306.07590": "2023-06-13, **Sciences for The 2.5-meter Wide Field Survey Telescope (WFST)**, WFST Collaboration et.al., [2306.07590v1](http://arxiv.org/abs/2306.07590v1)\n\n The Wide Field Survey Telescope (WFST) is a dedicated photometric survey facility under construction jointly by the University of Science and Technology of China and Purple Mountain Observatory. It is equipped with a primary mirror of 2.5m in diameter, an active optical system, and a mosaic CCD camera of 0.73 Gpix on the main focus plane to achieve high-quality imaging over a field of view of 6.5 square degrees. The installation of WFST in the Lenghu observing site is planned to happen in the summer of 2023, and the operation is scheduled to commence within three months afterward. WFST will scan the northern sky in four optical bands (u, g, r, and i) at cadences from hourly/daily to semi-weekly in the deep high-cadence survey (DHS) and the wide field survey (WFS) programs, respectively. WFS reaches a depth of 22.27, 23.32, 22.84, and 22.31 in AB magnitudes in a nominal 30-second exposure in the four bands during a photometric night, respectively, enabling us to search tremendous amount of transients in the low-z universe and systematically investigate the variability of Galactic and extragalactic objects. Intranight 90s exposures as deep as 23 and 24 mag in u and g bands via DHS provide a unique opportunity to facilitate explorations of energetic transients in demand for high sensitivity, including the electromagnetic counterparts of gravitational-wave events detected by the second/third-generation GW detectors, supernovae within a few hours of their explosions, tidal disruption events and luminous fast optical transients even beyond a redshift of 1. Meanwhile, the final 6-year co-added images, anticipated to reach g about 25.5 mag in WFS or even deeper by 1.5 mag in DHS, will be of significant value to general Galactic and extragalactic sciences. The highly uniform legacy surveys of WFST will also serve as an indispensable complement to those of LSST which monitors the southern sky.\n\n"}}