{"neutrino": {"2507.18482": "2025-07-24, **Three-flavor neutrino oscillations using the Phase Space Approach**, Mariane Mangin-Brinet et.al., [2507.18482v1](http://arxiv.org/abs/2507.18482v1)\n\n The Phase-Space Approximation (PSA) approach, originally applied in [Phys. Rev. D 106, 123006 (2022)] to describe neutrino oscillations from a stellar object in the two-flavor limit, is extended here to describe the more realistic case where neutrinos can oscillate between three different flavors. The approach is successfully validated against the exact solutions up to eight neutrinos. In all cases where the exact solution is feasible, the PSA provides excellent reproduction of the neutrino oscillation dynamics. By replacing the full problem with a set of simple mean-field equations, the PSA offers a versatile, predictive, and easily parallelizable approach for tackling three-flavor problems. This enables the simulation of large-scale neutrino oscillations, as illustrated here with simulations involving up to 300 neutrinos. Additionally, the method provides insight into the system's equilibration properties.\n\n", "2507.18304": "2025-07-24, **Quark and lepton mixing in the asymptotically safe Standard Model**, Astrid Eichhorn et.al., [2507.18304v1](http://arxiv.org/abs/2507.18304v1)\n\n The quark mixing (CKM) matrix is near-diagonal, whereas the lepton mixing (PMNS) matrix is not. We learn that both observations can generically be explained within an ultraviolet completion of the Standard Model with gravity. We find that certain relations between CKM matrix elements should hold approximately because of asymptotically safe regimes, including $\\|V\\_{ud}\\|^2+\\|V\\_{us}\\|^2 \\approx 1$ and $\\|V\\_{cd}\\|^2+\\|V\\_{cs}\\|^2\\approx 1$. Theoretically, the accuracies of these relations determine the length of the asymptotically safe regimes. Experimental data confirms these relations with an accuracy of $10^{-5}$ and $10^{-3}$, respectively. This difference in accuracies is also expected, because the ultraviolet completion consists in a fixed-point cascade during which one relation is established already much deeper in the ultraviolet. This results in $\\|V\\_{ub}\\|^2 < \\|V\\_{cb}\\|^2$ and translates into measurable properties of $B$-mesons.   Similar results would hold for the PMNS matrix, if neutrino Yukawa couplings were large. The ultraviolet complete theory therefore must -- and in fact can -- avoid such an outcome. It contains a mechanism that dynamically limits the size of neutrino Yukawa couplings. Below an upper bound on the sum of Dirac neutrino masses, this allows the PMNS matrix to avoid a near-diagonal structure like the CKM matrix. Thus, large neutrino mixing is intimately tied to small Dirac neutrino masses, $\\sum m\\_{\\nu} \\lesssim {\\mathcal{O}} (1)\\, \\rm eV$ and a mass gap in the Standard Model fermion masses.\n\n"}, "dark matter": {"2507.18508": "2025-07-24, **Resonant enhancement of axion dark matter decay**, Bilal Ahmad et.al., [2507.18508v1](http://arxiv.org/abs/2507.18508v1)\n\n The axion is particularly well motivated candidate for the dark matter comprising most of the mass of our visible Universe, leading to worldwide experimental and observational efforts towards its discovery. As is well known, resonant cavities are a primary tool in this search, where they are used to enhance the conversion rate of axions into photons in a background electromagnetic field. What is perhaps less well appreciated is that resonant cavities can also enhance the rate at which axions decay to two photons, a manifestation of the Purcell effect. We explore this possibility and show that it offers a novel method to search the axion parameter space in a way that is competitive and complimentary to other approaches, with the capability to probe the most-favoured region for QCD axion dark matter. Furthermore, we establish that this method can be implemented via pre-existing axion heterodyne detection schemes, enabling such experiments to perform these searches with minimal modification.\n\n", "2507.18389": "2025-07-24, **Topological dark energy from spacetime foam: A challenge for $Λ$CDM**, Fotios K. Anagnostopoulos et.al., [2507.18389v1](http://arxiv.org/abs/2507.18389v1)\n\n Using only the standard considerations of spacetime foam and the Euclidean Quantum Gravity techniques known long ago, we result to a model of Topological Dark Energy (TDE) that outperforms the standard $\\Lambda$CDM paradigm with regard to data fitting efficiency. Specifically, it is known that at the foam level, topologically non-trivial solutions such as instantons appear. In the particular case of Einstein-Gauss-Bonnet gravity, we obtain an effective dynamical dark energy term proportional to the instanton density, and the latter can be easily calculated through standard techniques. Hence, we can immediately extract the differential equation that determines the evolution of the topologically induced effective dark energy density. Significantly, this TDE scenario allows for changing sign of dark energy during the cosmic evolution and also exhibits Dark Energy interaction with Dark Matter. We confront the TDE scenario, in both flat and non-flat cases, with Pantheon+/SH0ES Supernovae Type Ia (SNIa), Baryonic Accoustic Oscillations (BAO), and Cosmic Chronometers (CC) datasets. By applying standard model selection methods (AIC and DevIC information criteria), we find a moderate but statistically significant preference over $\\Lambda$CDM scenario. Finally, we show that the TDE scenario passes constraints from Big Bang Nucleosynthesis (BBN) and thus does not spoil the thermal history of the Universe.\n\n", "2507.18322": "2025-07-24, **New models of nonsingular black hole dark matter from limiting curvature**, Selin Aşmanoğlu et.al., [2507.18322v1](http://arxiv.org/abs/2507.18322v1)\n\n We consider phenomenological models for nonsingular black hole that satisfy the limiting curvature condition (i.e., that have curvatures that are always sub-Planckian in size) while having a more general dependence on the black hole mass than the most studied examples. These models allow black holes to exist while having regulators that are larger than the horizon scale; it has been shown previously that this can lead to observable consequences in an astrophysical setting, for allowed choices for the regulator scale. Noting that substantial horizon-scale modifications of the metric will affect black hole thermodynamics and Hawking radiation, we study these metrics in the context of primordial black hole dark matter. Considering examples with de\\,Sitter and Minkowski cores, respectively, we study the effect of the regulator in these metrics on the allowed black hole mass ranges (or ``bands\"), the black hole temperature, specific heat and lifetime, and the bounds on the primordial black hole fraction of the total dark matter density from the observed extragalactic gamma ray background.\n\n", "2507.18292": "2025-07-24, **The Tremaine-Weinberg method at high redshift**, Mahmood Roshan et.al., [2507.18292v1](http://arxiv.org/abs/2507.18292v1)\n\n This paper examines the reliability of the Tremaine-Weinberg (TW) method in measuring the pattern speed of barred galaxies at high redshifts. Measuring pattern speeds at high redshift may help to shed light on the time evolution of interactions between galactic bars and dark matter halos. The TW method has been extensively employed for nearby galaxies, and its accuracy in determining bar pattern speeds has been validated through numerical simulations. For nearby galaxies, the method yields acceptable results when the inclination angle of the galaxy and the position angle of the bar fall within appropriate ranges. However, the application of the TW method to high-redshift galaxies remains unexplored in both observations and simulations. In this study, we generate mock observations of barred galaxies from the TNG50 cosmological simulation. These simulated observations are tailored to mimic the Integral Field Unit (IFU) spectroscopy data that the Near-Infrared Spectrograph (NIRSpec) on the James Webb Space Telescope (JWST) would capture at a redshift of $z\\simeq 1.2$. By applying the TW method to these mock observations and comparing the results with the known pattern speeds, we demonstrate that the TW method performs adequately for barred galaxies with bars sufficiently long to be detected by JWST at high redshifts. This work opens a new avenue for applying the TW method to investigate the properties of high-redshift barred galaxies.\n\n", "2507.18274": "2025-07-24, **Phantom crossing or dark interaction?**, Sêcloka L. Guedezounme et.al., [2507.18274v1](http://arxiv.org/abs/2507.18274v1)\n\n Recent results from DESI BAO measurements, together with Planck CMB and Pantheon+ data, suggest that there may be a `phantom' phase ($w\\_{\\rm de}<-1$) in the expansion of the Universe. This inference follows when the $w\\_0, w\\_a$ parametrization for the dark energy equation of state $w\\_{\\rm de}$ is used to fit the data. Since phantom dark energy in general relativity is unphysical, we investigate the possibility that the phantom behaviour is not intrinsic, but effective -- due to a non-gravitational interaction between dark matter and non-phantom dark energy. To this end, we assume a physically motivated thawing quintessence-like form of the intrinsic dark energy equation of state $w\\_{\\rm de}$. Then we use a $w\\_0, w\\_a$ model for the \\emph{effective} equation of state of dark energy. We find that the data favours a phantom crossing for the effective dark energy, but only at low significance. The intrinsic equation of state of dark energy is non-phantom, without imposing any non-phantom priors. A nonzero interaction is favoured at more than $3\\sigma$ at $z\\sim0.3$. The energy flows from dark matter to dark energy at early times and reverses at later times.\n\n", "2507.18164": "2025-07-24, **Evaluation of PID Performance at CEPC and Optimization with Combined dN/dx and Time-of-Flight Data**, Dian Yu et.al., [2507.18164v1](http://arxiv.org/abs/2507.18164v1)\n\n This work presents a comprehensive study of charged-hadron particle identification (PID) at the Circular Electron-Positron Collider (CEPC), based on full simulation of hadronic $Z$-pole events. A unified PID strategy is developed by combining energy loss measurements (dN/dx) from the time projection chamber (TPC) and time-of-flight (ToF) information from both the inner (ITK) and outer (OTK) silicon trackers. The PID discriminant is constructed using residuals between measured and expected observables under multiple particle hypotheses, with identification regions optimized to maximize kaon efficiency and purity across bins of momentum and polar angle. Results show that the TPC alone, while highly efficient (99.3%), suffers from severe pion-induced contamination, yielding only 14.3% purity. Incorporating ToF from OTK improves the purity to 25.7%. A full combination of ITK, TPC, and OTK significantly enhances performance, achieving 96.8% efficiency and 87.4% purity (product: 84.6%). Furthermore, a momentum-dependent strategy that dynamically selects the optimal detector combination achieves the best overall performance, with 99.4% efficiency and 92.4% purity, corresponding to a 91.8% kaon identification quality. These results demonstrate that the CEPC baseline detector fulfills the requirements for precision flavor tagging and provide clear guidance for future optimization of timing detector configurations.\n\n", "2507.18054": "2025-07-24, **Variational autoencoder for generating realistic $N$-body simulations for dark matter halos**, Jazhiel Chacón-Lavanderos et.al., [2507.18054v1](http://arxiv.org/abs/2507.18054v1)\n\n In this paper, we explore the use of a variational autoencoder (VAE), a deep generative model, to compress and generate images of dark matter density fields from $\\Lambda$CDM like cosmological simulations. The VAE learns a compact, low-dimensional representation of the large-scale structure, enabling both accurate reconstruction and generation of statistically realistic samples. We evaluated the generated images by comparing their power spectra to those of real simulations and the theoretical $\\Lambda$CDM prediction, finding strong agreement with the state-of-the-art simulations. In addition, the VAE provides a fast and scalable method for generating synthetic cosmological data, making it a valuable tool for data augmentation. These capabilities can accelerate the development and training of more advanced machine learning models for cosmological analysis, particularly in scenarios where large-scale simulations are computationally expensive. Our results highlight the potential for generative artificial intelligence as a practical bridge between physical modeling and modern deep learning in cosmology.\n\n"}, "supernova": {"2507.18544": "2025-07-24, **EP250108a/SN2025kg: A Magnetar-powered Gamma-Ray Burst Supernova Originating from a Close Helium-star Binary via Isolated Binary Evolution**, Jin-Ping Zhu et.al., [2507.18544v1](http://arxiv.org/abs/2507.18544v1)\n\n SN\\,2025kg, linked to EP250108a, is among the brightest broad-lined Type Ic supernova (SN Ic-BL) known, showing unique helium absorptions, a late-time broad H$\\alpha$, and an early bump. In this {\\em{Letter}}, we propose a jet-cocoon origin to explain EP250108a as off-axis cooling emission from a mildly relativistic inner cocoon viewed at $\\sim45^\\circ$ and the early bump of SN\\,2025kg as the outer cocoon cooling emission, both constraining an energy of $\\sim(1-2)\\times10^{52}{\\rm{erg}}$ and a progenitor radius of $\\sim5\\,R\\_\\odot$. To explain SN\\,2025kg's exceptionally luminous peak, potential energy injection into the $\\sim2.5\\,M\\_\\odot$ ejecta from a magnetar with initial period $\\sim1.7\\,{\\rm{ms}}$ and magnetic field $\\sim2\\times10^{15}{\\rm{G}}$ may be required, implying a rapidly rotating $\\sim4\\,M\\_\\odot$ progenitor. Thus, the progenitor may be a low-mass helium star with an extended helium envelope, supported by helium absorption lines and an inferred weak pre-SN wind. Hydrogen-rich material may reside in the inner ejecta layers, as suggested by the late-time broad H$\\alpha$, possibly originating from main-sequence companion material evaporated by the magnetar wind. Since the observed near-solar metallicity challenges the popular quasi-chemically homogeneous evolution channel, the rapidly rotating helium-star progenitor of EP250108a/SN\\,2025kg might attain angular momentum by being tidally spun up by a main-sequence companion in a close binary formed through isolated binary evolution.\n\n", "2507.18389": "2025-07-24, **Topological dark energy from spacetime foam: A challenge for $Λ$CDM**, Fotios K. Anagnostopoulos et.al., [2507.18389v1](http://arxiv.org/abs/2507.18389v1)\n\n Using only the standard considerations of spacetime foam and the Euclidean Quantum Gravity techniques known long ago, we result to a model of Topological Dark Energy (TDE) that outperforms the standard $\\Lambda$CDM paradigm with regard to data fitting efficiency. Specifically, it is known that at the foam level, topologically non-trivial solutions such as instantons appear. In the particular case of Einstein-Gauss-Bonnet gravity, we obtain an effective dynamical dark energy term proportional to the instanton density, and the latter can be easily calculated through standard techniques. Hence, we can immediately extract the differential equation that determines the evolution of the topologically induced effective dark energy density. Significantly, this TDE scenario allows for changing sign of dark energy during the cosmic evolution and also exhibits Dark Energy interaction with Dark Matter. We confront the TDE scenario, in both flat and non-flat cases, with Pantheon+/SH0ES Supernovae Type Ia (SNIa), Baryonic Accoustic Oscillations (BAO), and Cosmic Chronometers (CC) datasets. By applying standard model selection methods (AIC and DevIC information criteria), we find a moderate but statistically significant preference over $\\Lambda$CDM scenario. Finally, we show that the TDE scenario passes constraints from Big Bang Nucleosynthesis (BBN) and thus does not spoil the thermal history of the Universe.\n\n"}}