{"neutrino": {"2307.03191": "2023-07-06, **Where shadows lie: reconstruction of anisotropies in the neutrino sky**, Willem Elbers et.al., [2307.03191v1](http://arxiv.org/abs/2307.03191v1)\n\n The Cosmic Neutrino Background (CNB) encodes a wealth of information, but has not yet been observed directly. To determine the prospects of detection and to study its information content, we reconstruct the phase-space distribution of local relic neutrinos from the three-dimensional distribution of matter within 200 Mpc/h of the Milky Way. Our analysis relies on constrained realization simulations and forward modelling of the 2M++ galaxy catalogue. We find that the angular distribution of neutrinos is anti-correlated with the projected matter density, due to the capture and deflection of neutrinos by massive structures along the line of sight. Of relevance to tritium capture experiments, we find that the gravitational clustering effect of the large-scale structure on the local number density of neutrinos is more important than that of the Milky Way for neutrino masses less than 0.1 eV. Nevertheless, we predict that the density of relic neutrinos is close to the cosmic average, with a suppression or enhancement over the mean of (-0.3%, +7%, +27%) for masses of (0.01, 0.05, 0.1) eV. This implies no more than a marginal increase in the event rate for tritium capture experiments like PTOLEMY. We also predict that the CNB and CMB rest frames coincide for 0.01 eV neutrinos, but that neutrino velocities are significantly perturbed for masses larger than 0.05 eV. Regardless of mass, we find that the angle between the neutrino dipole and the ecliptic plane is small, implying a near-maximal annual modulation in the bulk velocity. Along with this paper, we publicly release our simulation data, comprising more than 100 simulations for six different neutrino masses.\n\n", "2307.03184": "2023-07-06, **The split majoron model confronts the NANOGrav signal**, Pasquale Di Bari et.al., [2307.03184v1](http://arxiv.org/abs/2307.03184v1)\n\n In the light of the evidence of a gravitational wave background from the NANOGrav 15yr data set, we reconsider the split majoron model as a new physics extension of the standard model able to generate a needed contribution to solve the current tension between the data and the standard interpretation in terms of inspiraling supermassive black hole massive binaries. In the split majoron model the seesaw right-handed neutrinos acquire Majorana masses from spontaneous symmetry breaking of global $U(1)\\_{B-L}$ in a strong first order phase transition of a complex scalar field occurring above the electroweak scale. The final vacuum expectation value couples to a second complex scalar field undergoing a low scale phase transition occurring after neutrino decoupling. Such a coupling enhances the strength of this second low scale first order phase transition and can generate a sizeable primordial gravitational wave background contributing to the NANOGrav 15yr signal. Moreover, the free streaming length of light neutrinos can be suppressed by their interactions with the resulting Majoron background and this can mildly ameliorate existing cosmological tensions, thus providing a completely independent motivation for the model.\n\n", "2307.03161": "2023-07-06, **Neutrinos, Dark Matter and Higgs Vacua in Parity Solutions of the strong CP problem**, Michele Redi et.al., [2307.03161v1](http://arxiv.org/abs/2307.03161v1)\n\n The strong CP problem can be solved if the laws of nature are invariant under a space-time parity exchanging the Standard Model with its mirror copy. We review and extend different realizations of this idea with the aim of discussing Dark Matter, neutrino physics, leptogenesis and collider physics within the same context. In the minimal realization of Ref. [1] the mirror world contains a massless dark photon, which leads to a rather interesting cosmology. Mirror electrons reproduce the dark matter abundance for masses between 500-1000 GeV with traces of strongly interacting dark matter. This scenario also predicts deviations from cold dark matter, sizable $\\Delta N\\_{\\rm eff}$ and colored states in the TeV range that will be tested in a variety of upcoming experiments. We also explore scenarios where the mirror photon is massive and the mirror particles are charged under ordinary electro-magnetism with very different phenomenology. We also show that, for the measured values of the SM parameters, the Higgs effective potential can give rise to a second minimum at large field value as required to break spontaneously the parity symmetry.\n\n", "2307.03143": "2023-07-06, **Supernova Limits on Muonic Dark Forces**, Claudio Andrea Manzari et.al., [2307.03143v1](http://arxiv.org/abs/2307.03143v1)\n\n Proto-neutron stars formed during core-collapse supernovae are hot and dense environments that contain a sizable population of muons. If these interact with new long-lived particles with masses up to roughly 100 MeV, the latter can be produced and escape from the stellar plasma, causing an excessive energy loss constrained by observations of SN 1987A. In this article we calculate the emission of light dark fermions that are coupled to leptons via a new massive vector boson, and determine the resulting constraints on the general parameter space. We apply these limits to the gauged $L\\_\\mu-L\\_\\tau$ model with dark fermions, and show that the SN 1987A constraints exclude a significant portion of the parameter space targeted by future experiments. We also extend our analysis to generic effective four-fermion operators that couple dark fermions to muons, electrons, or neutrinos. We find that SN 1987A cooling probes a new-physics scale up to $\\sim7$ TeV, which is an order of magnitude larger than current bounds from laboratory experiments.\n\n", "2307.03102": "2023-07-06, **Measurement of ambient radon daughter decay rates and energy spectra in liquid argon using the MicroBooNE detector**, MicroBooNE collaboration et.al., [2307.03102v1](http://arxiv.org/abs/2307.03102v1)\n\n We report measurements of radon daughters in liquid argon within the MicroBooNE time projection chamber (LArTPC). The presence of radon in MicroBooNE's 85 metric tons of active liquid argon bulk is probed with newly developed charge-based low-energy reconstruction tools and analysis techniques to detect correlated $^{214}$Bi-$^{214}$Po radioactive decays. Special datasets taken during periods of active radon doping enable new demonstrations of the calorimetric capabilities of single-phase neutrino LArTPCs for $\\beta$ and $\\alpha$ particles with electron-equivalent energies ranging from 0.1 to 3.0 MeV. By applying $^{214}$Bi-$^{214}$Po detection algorithms to beam-external physics data recorded over a 46-day period, no statistically significant presence of radon is detected, corresponding to a limit of $<0.38$ mBq/kg at the 95\\% confidence level. The obtained radon radiopurity limit -- the first ever reported for a noble element detector incorporating liquid-phase purification -- is well below the target value of the future DUNE neutrino detector.\n\n", "2307.03091": "2023-07-06, **NANOGrav meets Hot New Early Dark Energy and the origin of neutrino mass**, Juan S. Cruz et.al., [2307.03091v1](http://arxiv.org/abs/2307.03091v1)\n\n It has recently been speculated that the NANOGrav observations point towards a first-order phase transition in the dark sector at the GeV scale [1]. Here we show that such a high energy sibling of the New Early Dark Energy (NEDE) phase transition might already have been predicted in the Hot New Early Dark Energy model (Hot NEDE) [2, 3]. There, it was argued that the NEDE phase transition is a signature of neutrino mass generation through the inverse seesaw mechanism. Specifically, it serves a double purpose by resolving the Hubble tension through an energy injection and generating the Majorana mass entry in the inverse seesaw mixing matrix. In addition, the usual NEDE phase transition is accompanied by a UV counterpart, which generates the heavy Dirac mass entry in the inverse seesaw mass matrix of a right-handed neutrino. Here, we investigate if the UV phase transition of the Hot NEDE model can occur at the GeV scale in view of the recent NANOGrav observations.\n\n", "2307.02907": "2023-07-06, **Constraining the cosmic-ray mass composition by measuring the shower length with SKA**, S. Buitink et.al., [2307.02907v1](http://arxiv.org/abs/2307.02907v1)\n\n The current generation of air shower radio arrays has demonstrated that the atmospheric depth of the shower maximum Xmax can be reconstructed with high accuracy. These experiments are now contributing to mass composition studies in the energy range where a transition from galactic to extragalactic cosmic-ray sources is expected. However, we are still far away from an unambiguous interpretation of the data. Here we propose to use radio measurements to derive a new type of constraint on the mass composition, by reconstructing the shower length L. The low-frequency part of the Square Kilometer Array will have an extremely high antenna density of roughly 60.000 antennas within one square kilometer, and is the perfect site for high-resolution studies of air showers. In this contribution, we discuss the impact of being able to reconstruct L, and the unique contribution that SKA can make to cosmic-ray science.\n\n", "2307.02905": "2023-07-06, **Decomposing the Origin of TeV-PeV Emission from the Galactic Plane: Implications of Multi-messenger Observations**, Ke Fang et.al., [2307.02905v1](http://arxiv.org/abs/2307.02905v1)\n\n High-energy neutrino and $\\gamma$-ray emission has been observed from the Galactic plane, which may come from individual sources and/or diffuse cosmic rays. We evaluate the contribution of these two components through the multi-messenger connection between neutrinos and $\\gamma$ rays in hadronic interactions. We derive maximum fluxes of neutrino emission from the Galactic plane using $\\gamma$-ray catalogs, including 4FGL, HGPS, 3HWC, and 1LHAASO, and measurements of the Galactic diffuse emission by Tibet AS$\\gamma$ and LHAASO. We find that depending on model templates, the diffuse emission is brighter than the sum of resolved sources when excluding promising leptonic sources such as pulsars, pulsar wind nebulae, and TeV halos. Our result indicates that the Galactic neutrino emission observed by the IceCube Collaboration may be dominated by the Galactic diffuse emission or unresolved $\\gamma$-ray sources. Future observations of neutrino telescopes and air-shower $\\gamma$-ray experiments in the Southern hemisphere are needed to accurately disentangle the source and diffuse emission of the Milky Way.\n\n", "2307.02785": "2023-07-06, **Effects of Hoyle state de-excitation on $νp$-process nucleosynthesis and Galactic chemical evolution**, Hirokazu Sasaki et.al., [2307.02785v1](http://arxiv.org/abs/2307.02785v1)\n\n The partcle-induced hadronic de-excitation of the Hoyle state in $^{12}$C induced by inelastic scattering in a hot and dense plasma can enhance the triple-alpha reaction rate. This prevents the production of heavy nuclei within the neutrino-driven winds of core-collapse supernovae and raises a question as to the contribution of proton-rich neutrino-driven winds as the origin of $p$-nuclei in the solar system abundances. Here we study $\\nu p$-process nucleosynthesis in proton-rich neutrino-driven winds relevant to the production of $^{92,94}\\mathrm{Mo}$ and $^{96,98}\\mathrm{Ru}$ by considering such particle-induced de-excitation. We show that the enhancement of the triple-alpha reaction rate induced by neutron inelastic scattering hardly affects the $\\nu p$-process, while the proton scattering contributes to the nucleosynthesis in proton-rich neutrino-driven winds at low temperature. The associated enhanced triple-alpha reaction rate decreases the production of $^{92,94}\\mathrm{Mo}$ and $^{96,98}\\mathrm{Ru}$ in a wind model of ordinary core-collapse supernovae. On the other hand, the abundances of these $p$-nuclei increase in an energetic hypernova wind model. Hence, we calculate the galactic chemical evolution of $^{92,94}\\mathrm{Mo}$ and $^{96,98}\\mathrm{Ru}$ by taking account of both contributions from core-collapse supernovae and hypernovae. We show that the hypernova $\\nu p$-process can enhance the calculated solar isotopic fractions of $^{92,94}\\mathrm{Mo}$ and $^{96,98}\\mathrm{Ru}$ and make a significant impact on the GCE of $p$-nuclei regardless of the particle-induced Hoyle state de-excitation.\n\n"}, "dark matter": {"2307.03121": "2023-07-06, **Constraining Post-Inflationary Axions with Pulsar Timing Arrays**, Géraldine Servant et.al., [2307.03121v1](http://arxiv.org/abs/2307.03121v1)\n\n Models that produce Axion-Like-Particles (ALP) after cosmological inflation due to spontaneous $U(1)$ symmetry breaking also produce cosmic string networks. Those axionic strings lose energy through gravitational wave emission during the whole cosmological history, generating a stochastic background of gravitational waves that spans many decades in frequency. We can therefore constrain the axion decay constant and axion mass from limits on the gravitational wave spectrum and compatibility with dark matter abundance as well as dark radiation. We derive such limits from analyzing the most recent NANOGrav data from Pulsar Timing Arrays (PTA). The limits are compatible with the slightly stronger $N\\_{\\rm eff}$ bounds on dark radiation for ALP masses $m\\_a \\lesssim 10^{-10}$ eV. On the other hand, for heavy ALPs with $m\\_a\\gtrsim 0.1$ GeV and $N\\_{\\rm DW}\\neq 1$, new regions of parameter space can be probed by PTA data due to the dominant Domain-Wall contribution to the gravitational wave background.\n\n", "2307.03049": "2023-07-06, **Can baryon asymmetry be explained by a large initial value before inflation?**, Kai Murai et.al., [2307.03049v1](http://arxiv.org/abs/2307.03049v1)\n\n We show that the baryon asymmetry of the Universe cannot be explained by a large initial value before inflation because it inevitably predicts correlated baryon isocurvature perturbations that are already excluded by cosmic microwave background observations. Similar arguments can generally be applied to some models of dark matter.\n\n", "2307.03041": "2023-07-06, **Superfluid dark matter flow around cosmic strings**, Heliudson Bernardo et.al., [2307.03041v1](http://arxiv.org/abs/2307.03041v1)\n\n We consider a cosmic string moving through a gas of superfluid dark matter (SFDM) particles and analyze how it affects the dark matter distribution. We look at two different cases: first, a cosmic string passing through an already condensed region, and second, through a region that is not yet condensed. In the former, the string induces a weak shock in the superfluid, and the Bose-Einstein condensate (BEC) survives. In the latter, a wake of larger density is formed behind the string, and we study under which conditions a BEC can be formed in the virialized region of the wake. By requiring the thermalization of the DM particles and the overlap of their de Broglie wavelengths inside the wake, we obtain an upper bound on the mass of the dark matter particles on the order of 10 eV, which is compatible with typical SFDM models.\n\n", "2307.02908": "2023-07-06, **Modelling a Hot Horizon in Global 21 cm Experimental Foregrounds**, Joe H. N. Pattison et.al., [2307.02908v1](http://arxiv.org/abs/2307.02908v1)\n\n The 21 cm signal from cosmic hydrogen is one of the most propitious probes of the early Universe. The detection of this signal would reveal key information about the first stars, the nature of dark matter, and early structure formation. We explore the impact of an emissive and reflective, or `hot', horizon on the recovery of this signal for global 21 cm experiments. It is demonstrated that using physically motivated foreground models to recover the sky-averaged 21 cm signal one must accurately describe the horizon around the radiometer. We show that not accounting for the horizon will lead to a signal recovery with residuals an order of magnitude larger than the injected signal, with a log Bayesian evidence of almost 1600 lower than when one does account for the horizon. It is shown that signal recovery is sensitive to incorrect values of soil temperature and reflection coefficient in describing the horizon, with even a 10% error in reflectance causing twofold increases in the RMSE of a given fit. We also show these parameters may be fitted using Bayesian inference to mitigate for these issues without overfitting and mischaracterising a non-detection. We further demonstrate that signal recovery is sensitive to errors in measurements of the horizon projection onto the sky, but fitting for soil temperature and reflection coefficients with priors that extend beyond physical expectation can resolve these problems. We show that using an expanded prior range can reliably recover the signal even when the height of the horizon is mismeasured by up to 20%, decreasing the RMSE from the model that does not perform this fitting by a factor of 9.\n\n"}, "supernova": {"2307.03165": "2023-07-06, **From Discovery to the First Month of the Type II Supernova 2023ixf: High and Variable Mass Loss in the Final Year Before Explosion**, Daichi Hiramatsu et.al., [2307.03165v1](http://arxiv.org/abs/2307.03165v1)\n\n We present the discovery of Type II supernova (SN) 2023ixf in M101, among the closest core-collapse SNe in the last several decades, and follow-up photometric and spectroscopic observations in the first month of its evolution. The light curve is characterized by a rapid rise ($\\approx5$ days) to a luminous peak ($M\\_V\\approx-18$ mag) and plateau ($M\\_V\\approx-17.6$ mag) extending to $30$ days with a smooth decline rate of $\\approx0.03$ mag day$^{-1}$. During the rising phase, $U-V$ color shows blueward evolution, followed by redward evolution in the plateau phase. Prominent flash features of hydrogen, helium, carbon, and nitrogen dominate the spectra up to $\\approx5$ days after first light, with a transition to a higher ionization state in the first $\\approx2$ days. Both the $U-V$ color and flash ionization states suggest a rise in the temperature, indicative of a delayed shock-breakout inside dense circumstellar material (CSM). From the timescales of CSM interaction, we estimate its compact radial extent of $\\sim(3-7)\\times10^{14}$ cm. We then construct numerical light-curve models based on both continuous and eruptive mass-loss scenarios shortly before explosion. For the continuous mass-loss scenario, we infer a range of mass-loss history with $0.1-1.0$ $M\\_\\odot {\\rm yr}^{-1}$ in the final $2-1$ years before explosion, with a potentially decreasing mass loss of $0.01-0.1$ $M\\_\\odot {\\rm yr}^{-1}$ in $\\sim0.7-0.4$ years towards the explosion. For the eruptive mass-loss scenario, we favor eruptions releasing $0.3-1$ $M\\_\\odot$ of the envelope at about a year before explosion, which result in CSM with mass and extent similar to the continuous scenario. We discuss the implications of the available multi-wavelength constraints obtained thus far on the progenitor candidate and SN 2023ixf to our variable CSM models.\n\n", "2307.02987": "2023-07-06, **Cosmological effects of the Galileon term in Scalar-Tensor Theories**, A. G. Ferrari et.al., [2307.02987v1](http://arxiv.org/abs/2307.02987v1)\n\n We study the cosmological effects of a Galileon term in scalar-tensor theories of gravity. The subset of scalar-tensor theories considered are characterized by a non-minimal coupling $F(\\sigma) R$, a kinetic term with arbitrary sign $Z (\\partial \\sigma)^2$ with $Z = \\pm 1$, a potential $V(\\sigma)$, and a Galileon term $G\\_3(\\sigma, (\\partial \\sigma)^2) \\square \\sigma$. In addition to the modified dynamics, the Galileon term provides a screening mechanism to potentially reconcile the models with General Relativity predictions inside a Vainshtein radius. Thanks to the Galileon term, the stability conditions, namely ghost and Laplacian instabilities, in the branch with a negative kinetic term ($Z = -1$) are fulfilled for a large volume of the parameter space. Solving numerically the background evolution and linear perturbations, we derive the constraints on the cosmological parameters in presence of a Galileon term for different combination of the cosmic microwave background (CMB) data from Planck, baryon acoustic oscillations (BAO) measurements from BOSS, and supernovae from the Pantheon compilation. We find that the Galileon term alters the dynamics of all the studied cases. For a standard kinetic term ($Z = 1$), we find that Planck data and a compilation of BAO data constrain the Galileon term to small values that allow screening very inefficiently. For a negative kinetic term ($Z = -1$), a Galileon term and a non-zero potential lead to an efficient screening in a physically viable regime of the theory, with a value for the Hubble constant today which alleviates the tension between its CMB and local determinations. For a vanishing potential, the case with $Z=-1$ and the Galileon term driving the late acceleration of the Universe is ruled out by Planck data.\n\n"}}