{"neutrino": {"2312.07508": "2023-12-12, **An isotropic full-sky sample of optically selected blazars**, Maria Kudenko et.al., [2312.07508v1](http://arxiv.org/abs/2312.07508v1)\n\n $\\it{Context.}$ Various high-energy phenomena in the Universe are associated with blazars, powerful active galaxies with jets pointing to the observer. Novel results relating blazars to high-energy neutrinos, cosmic rays, and even possible manifestations of new particle physics, are often based on statistical analyses of blazar samples, and uniform sky coverage is important for many of these studies.   $\\it{Aims.}$ Here, we construct a uniform full-sky catalog of blazars selected by their optical emission.   $\\it{Methods.}$ We define criteria of isotropy, making a special effort to cover the Galactic plane region, and compile an isotropic sample of blazars with GAIA optical magnitudes $G<18^{\\rm m}$, corrected for the Galactic absorption. The sources are taken from full-sky samples selected by parsec-scale radio emission or by high-energy gamma-ray flux, both being known to efficiently select blazar-like objects.   $\\it{Results.}$ We present a catalog of 651 optically bright blazars, uniformly distributed in the sky, together with their radio, optical, X-ray and gamma-ray fluxes, and an isotropic sample of 336 confirmed BL Lac type objects.   $\\it{Conclusions.}$ This catalog may be used in future statistical studies of energetic neutrinos, cosmic rays and gamma rays.\n\n", "2312.07188": "2023-12-12, **Cosmological Constraints on Neutrino Mass within Consistent Cosmological Models**, Ye-Huang Pang et.al., [2312.07188v1](http://arxiv.org/abs/2312.07188v1)\n\n Recently, the emergence of cosmological tension has raised doubts about the consistency of the $\\Lambda$CDM model. In order to constrain the neutrino mass within a consistent cosmological framework, we investigate three massive neutrinos with normal hierarchy (NH) and inverted hierarchy (IH) in both the axion-like EDE (Axi-EDE) model and the AdS-EDE model. We use the joint datasets including cosmic microwave background (CMB) power spectrum from Planck 2018, Pantheon of type Ia supernova, baryon acoustic oscillation (BAO) and $H\\_0$ data from SH0ES. For the $\\nu$Axi-EDE model, we obtain $\\sum m\\_{\\nu,\\mathrm{NH}} < 0.152$ eV and $\\sum m\\_{\\nu,\\mathrm{IH}} < 0.178$ eV, while for the $\\nu$AdS-EDE model, we find $\\sum m\\_{\\nu,\\mathrm{NH}} < 0.135$ eV and $\\sum m\\_{\\nu,\\mathrm{IH}} < 0.167$ eV. Our results exhibit a preference for the normal hierarchy in both the $\\nu$Axi-EDE model and the $\\nu$AdS-EDE model.\n\n", "2312.07150": "2023-12-12, **Neutrino Mass Matrices with Generalized CP Symmetries and Texture Zeros**, Sanjeev Kumar et.al., [2312.07150v1](http://arxiv.org/abs/2312.07150v1)\n\n We investigate the properties of neutrino mass matrices that incorporate texture zeros and generalized CP symmetries associated with tribimaximal mixing. By combining these approaches, we derive predictive neutrino mass matrices and explore their implications for mass hierarchies, mixing angles, and CP-violating phases. We find that the three angles defining the generalized CP symmetries have narrow allowed ranges. We also obtain distinct correlations between the three mixing angles and the CP-violating phases that distinguish the various texture patterns from one another. Moreover, we compute the effective neutrino mass for neutrinoless double beta decay and the sum of neutrino masses. Our results highlight the predictability and testability of neutrino mass matrices with generalized CP symmetry.\n\n", "2312.07015": "2023-12-12, **QED corrections to the thermal neutrino interaction rate**, G. Jackson et.al., [2312.07015v1](http://arxiv.org/abs/2312.07015v1)\n\n Motivated by precision computations of neutrino decoupling at MeV temperatures, we show how QED corrections to the thermal neutrino interaction rate can be related to the electron-positron spectral function as well as an effective $\\bar{\\nu}\\nu\\gamma$ vertex. The spectral function is needed both in a timelike and in a spacelike domain, and for both of its physical polarization states (transverse and longitudinal with respect to spatial momentum). Incorporating an NLO evaluation of this spectral function, an estimate of the $\\bar{\\nu}\\nu\\gamma$ vertex, and HTL resummation of scatterings mediated by soft Bose-enhanced $t$-channel photons, we compute the interaction rate as a function of the neutrino momentum and flavour. Effects on the $ -(0...2)\\%$ level are found, noticeably smaller than a previous estimate of a related quantity.\n\n"}, "dark matter": {"2312.07534": "2023-12-12, **Cosmological Field Emulation and Parameter Inference with Diffusion Models**, Nayantara Mudur et.al., [2312.07534v1](http://arxiv.org/abs/2312.07534v1)\n\n Cosmological simulations play a crucial role in elucidating the effect of physical parameters on the statistics of fields and on constraining parameters given information on density fields. We leverage diffusion generative models to address two tasks of importance to cosmology -- as an emulator for cold dark matter density fields conditional on input cosmological parameters $\\Omega\\_m$ and $\\sigma\\_8$, and as a parameter inference model that can return constraints on the cosmological parameters of an input field. We show that the model is able to generate fields with power spectra that are consistent with those of the simulated target distribution, and capture the subtle effect of each parameter on modulations in the power spectrum. We additionally explore their utility as parameter inference models and find that we can obtain tight constraints on cosmological parameters.\n\n", "2312.07461": "2023-12-12, **Baryon-induced collapse of dark matter cores into supermassive black holes**, C. R. Arguelles et.al., [2312.07461v1](http://arxiv.org/abs/2312.07461v1)\n\n Non-linear structure formation for fermionic dark matter particles leads to dark matter density profiles with a degenerate compact core surrounded by a diluted halo. For a given fermion mass, the core has a critical mass that collapses into a supermassive black hole (SMBH). Galactic dynamics constraints suggest a $\\sim 100$ keV/$c^2$ fermion, which leads to $\\sim 10^7 M\\_\\odot$ critical core mass. Here, we show that baryonic (ordinary) matter accretion drives an initially stable dark matter core to SMBH formation and determine the accreted mass threshold that induces it. Baryonic gas density $\\rho\\_b$ and velocity $v\\_b$ inferred from cosmological hydro-simulations and observations produce sub-Eddington accretion rates triggering the baryon-induced collapse in less than a Gyr. This process produces active galactic nuclei in galaxy mergers and the high-redshift Universe. For TXS 2116-077, merging with a nearby galaxy, the observed $3\\times 10^7 M\\_\\odot$ SMBH, for $Q\\_b = \\rho\\_b/v\\_b^3 = 0.125 M\\_\\odot/(100 \\text{km/s pc})^3$, forms in $\\approx 0.6$ Gyr, consistent with the $0.5$-$2$ Gyr merger timescale and younger jet. For the farthest central SMBH detected by the \\textit{Chandra} X-ray satellite in the $z=10.3$ UHZ1 galaxy observed by the James Webb Space Telescope (\\textit{JWST}), the mechanism leads to a $4\\times 10^7 M\\_\\odot$ SMBH in $87$-$187$ Myr, starting the accretion at $z=12$-$15$. The baryon-induced collapse can also explain the $\\approx 10^7$-$10^8 M\\_\\odot$ SMBHs revealed by the JWST at $z\\approx 4$-$6$. After its formation, the SMBH can grow to a few $10^9 M\\_\\odot$ in timescales shorter than a Gyr via sub-Eddington baryonic mass accretion.\n\n", "2312.07237": "2023-12-12, **Conformal invariance, cosmological particle production and imitation of dark matter**, Victor Berezin et.al., [2312.07237v1](http://arxiv.org/abs/2312.07237v1)\n\n Using a model for an ideal fluid with a variable number of particles, a phenomenological description of the processes of particle production in strong external fields is investigated. The conformal invariance of the creation law is shown, which imposes rather rigorous restrictions on the possible types of sources. It appears that the combinations with the particle number density can imitate dark matter within this model.\n\n", "2312.07219": "2023-12-12, **LMC Stars and Where to Find Them: Inferring Birth Radii for External Galaxies**, Yuxi et.al., [2312.07219v1](http://arxiv.org/abs/2312.07219v1)\n\n It is well known that stars move away from their birth location over time via radial migration. This dynamical process makes computing the correct chemical evolution, e.g., metallicity gradients, of galaxies very difficult. This dynamical process makes inferring the chemical evolution of observed galaxies from their measured abundance gradients very difficult. One way to account for radial migration is to infer stellar birth radii for individual stars. Many attempts to do so have been performed over the last years, but are limited to the Milky Way as computing the birth position of stars requires precise measurements of stellar metallicity and age for individual stars that cover large Galactic radii. Fortunately, recent and future surveys will provide numerous opportunities for inferring birth radii for external galaxies such as the Large Magellanic Cloud (LMC). In this paper, we investigate the possibility of doing so using the NIHAO cosmological zoom-in simulations. We find that it is theoretically possible to infer birth radii with a ~ 25% median uncertainty for individual stars in galaxies with i) orderliness of the orbits, $\\langle v\\_\\phi \\rangle/\\sigma\\_{v} >$ 2, ii) a dark matter halo mass greater or equal to approximately the LMC mass (~ 2 x 10$^{11} M\\_\\odot$), and iii) after the average azimuthal velocity of the stellar disk reaches ~70% of its maximum. From our analysis, we conclude that it is possible and useful to infer birth radii for the LMC and other external galaxies that satisfy the above criteria.\n\n", "2312.07217": "2023-12-12, **Constraining ultralight bosons in dwarf spheroidal galaxies with a radially varying anisotropy**, Ivan De Martino et.al., [2312.07217v1](http://arxiv.org/abs/2312.07217v1)\n\n Axions, and axion-like particles, have come back into fashion in the last decades as a possible solution to the galactic-scale crisis suffered by the cold dark matter model. In the framework of the wave Dark Matter model, we have carried out a Jeans Analysis on eight dwarf spheroidal galaxies that are orbiting around the Milky Way, and we have constrained the boson mass. Differently to a previous analysis, we adopted an anisotropy parameter that varies with the distance from the centre of the galaxy to assess whether this assumption would help to resolve, or at least alleviate, the well-known tension with the value of the boson mass favoured by the cosmological analysis. Our results indicate that, differently to what happens in ultra-faint dwarf galaxies, such a tension cannot be lifted introducing a variable anisotropy parameter, leaving as a possible solution the existence of additional axion or axion-like particles with higher masses as naturally predicted in the Axiverse.\n\n", "2312.07173": "2023-12-12, **Dynamical analysis of coupled curvature-matter scenario in viable $f(R)$ dark energy models at de-sitter phase**, Anirban Chatterjee et.al., [2312.07173v1](http://arxiv.org/abs/2312.07173v1)\n\n We explore the interaction between dark matter and curvature-driven dark energy within viable $f(R)$ gravity models, employing the phase-space analysis approach of linear stability theory. By incorporating an interacting term, denoted as $\\mathcal{Q}=\\alpha H \\tilde{\\rho}\\_{\\rm m}\\left(\\frac{\\kappa^2 }{3H^2}\\rho\\_{\\rm curv} + 1 \\right)$, into the continuity equations of both sectors, we examine dynamics of two $f(R)$ gravity models that adhere to local gravity constraints and fulfill cosmological viability criteria. In de-sitter phase, our investigation reveals modifications of critical points compared to the conventional form, attributed to the introduced interaction. Through a comprehensive phase-space analysis, we illustrate the trajectories near critical points and outline the constraints on the phase space based on cosmological and cosmographic parameters.\n\n", "2312.07074": "2023-12-12, **Probing the black holes in a dark matter halo of M87 using gravitational wave echoes**, Dong Liu et.al., [2312.07074v1](http://arxiv.org/abs/2312.07074v1)\n\n Variations at the event horizon structure of a black hole will emit the signals of the gravitational wave echoes associated with the ringdown phase of the binary black hole merger. In this work, combining the mass model of M87 and the Einasto profile for a dark matter halo, we construct one solution of the black holes in a dark matter halo through the relativistic analysis, which includes black hole for the case $a \\leq 2M$ and the travesable wormhole for the case $a>2M$. Then, we test this solution in the axial gravitational perturbation and calculated their gravitational ringings of this black hole, that is the quasinormal mode (QNM). Where, when the geometric parameter $a>2M$, a series of gravitational wave echoes appear after the QNM, and the distinctive feature of the gravitational wave echoes is the double barrier feature. Besides, we also study the impacts of the shape parameters of the Einasto profile both on the QNM and gravitational wave echoes of this black hole, and extract their frequencies using the WKB method and Prony method. In particular, from the perspective that the QNM frequencies between different black hole parameters are distinguishable, we give an upper limit for the shape parameters of the Einasto profile, which is approximately $\\alpha<0.20$. These signals of the gravitational wave echoes based on this black hole in a dark matter halo may be detected in the near future, and these characteristics in the time evolution of the gravitational wave echoes can serve as local measurements of dark matter.\n\n", "2312.07017": "2023-12-12, **Constraints on Brans-Dicke gravity from Black Hole-Neutron Star Gravitational Wave Events**, Jing Tan et.al., [2312.07017v1](http://arxiv.org/abs/2312.07017v1)\n\n The Brans-Dicke (BD) theory is one of the simplest scalar-tensor theories, which has potential relations with dark matter, dark energy, inflation, and primordial nucleosynthesis. The strongest constraint on the BD coupling constant is provided by the Shapiro time delay measurement in the solar system by Cassini. Constraints from gravitational wave (GW) events are subject to asymmetric binaries (binaries with different ``sensitivity'' such as neutron star-black hole (NSBH), white dwarf-neutron star, or white dwarf-black hole binary). The third Gravitational-Wave Transient Catalog (GWTC) reports an NSBH merger event, GW200115, making it possible to constrain BD by GW. With the aid of this source and Bayesian Markov-chain Monte Carlo (MCMC) analyses, we derive the 90\\% credible lower bound on the modified parameter of BD as $\\omega\\_{\\rm BD}>4.75$ by using dominant (2, 2) mode correction. Extending to scalar-tensor theory, we have the constraint $\\varphi\\_{-2}>-7.94\\times10^{-4}$, which is consistent with the bound $7.3\\times10^{-4}$ from the LIGO Laboratory. Usually, asymmetric binary systems have a significant mass ratio; in such cases, higher harmonic modes cannot be neglected. Our work considers higher harmonic corrections from BD and provides a tighter constraint of $\\omega\\_{\\rm BD}>5.06$. We also consider the suspected event GW190426\\\\_152155 as an NSBH event. We find $\\omega\\_{\\rm BD}>1.25$ when employing the dominant (2, 2) mode only and $\\omega\\_{\\rm BD}>1.47$ when including the higher harmonic modes. Additionally, we take into account a BD-like theory, known as screened modified gravity (SMG), and provide the coupling constant constraints from both with and without high mode corrections, by using data from both GW200115 and GW190426\\\\_152155.\n\n"}, "supernova": {"2312.07275": "2023-12-12, **The SARAO MeerKAT 1.3 GHz Galactic Plane Survey**, S. Goedhart et.al., [2312.07275v1](http://arxiv.org/abs/2312.07275v1)\n\n We present the SARAO MeerKAT Galactic Plane Survey (SMGPS), a 1.3 GHz continuum survey of almost half of the Galactic Plane (251\\deg $\\le l \\le$ 358\\deg and 2\\deg $\\le l \\le$ 61\\deg at $\\|b\\| \\le 1.5\\deg $). SMGPS is the largest, most sensitive and highest angular resolution 1 GHz survey of the Plane yet carried out, with an angular resolution of 8\" and a broadband RMS sensitivity of $\\sim$10--20 $\\mu$ Jy/beam. Here we describe the first publicly available data release from SMGPS which comprises data cubes of frequency-resolved images over 908--1656 MHz, power law fits to the images, and broadband zeroth moment integrated intensity images. A thorough assessment of the data quality and guidance for future usage of the data products are given. Finally, we discuss the tremendous potential of SMGPS by showcasing highlights of the Galactic and extragalactic science that it permits. These highlights include the discovery of a new population of non-thermal radio filaments; identification of new candidate supernova remnants, pulsar wind nebulae and planetary nebulae; improved radio/mid-IR classification of rare Luminous Blue Variables and discovery of associated extended radio nebulae; new radio stars identified by Bayesian cross-matching techniques; the realisation that many of the largest radio-quiet WISE HII region candidates are not true HII regions; and a large sample of previously undiscovered background HI galaxies in the Zone of Avoidance.\n\n", "2312.06992": "2023-12-12, **Between the cosmic-ray `knee' and the `ankle': Contribution from star clusters**, Sourav Bhadra et.al., [2312.06992v1](http://arxiv.org/abs/2312.06992v1)\n\n We show that massive young star clusters may be possible candidates that can accelerate Galactic cosmic rays (CRs) in the range of $10^7\\hbox{--}10^9$ GeV (between the `knee' and `ankle'). Various plausible scenarios such as acceleration at the wind termination shock (WTS), supernova shocks inside these young star clusters, etc. have been proposed,since it is difficult to accelerate particles up to the $10^7\\hbox{--}10^9$ GeV range in the standard paradigm of CR acceleration in supernova remnants. We consider a model for the production of different nuclei in CRs from massive stellar winds using the observed distribution of young star clusters in the Galactic plane. We present a detailed calculation of CR transport in the Galaxy, taking into account the effect of diffusion, interaction losses during propagation, and particle re-acceleration by old supernova remnants to determine the all-particle CR spectrum. Using the maximum energy estimate from the Hillas criterion, we argue that a young massive star cluster can accelerate protons up to a few tens of PeV. Upon comparison with the observed data, our model requires a CR source spectrum with an exponential cutoff of $5\\times 10^7 Z$ GeV ($50\\,Z$~PeV) from these clusters together with a cosmic-ray injection fraction of $\\sim 5\\%$ of the wind kinetic energy. We discuss the possibility of achieving these requirements in star clusters, and the associated uncertainties, in the context of considering star clusters as the natural accelerator of the `second component' of Galactic cosmic rays.\n\n", "2312.06961": "2023-12-12, **Fast as Potoroo: Radio Continuum Detection of a Bow-Shock Pulsar Wind Nebula Powered by Pulsar J1638-4713**, Sanja Lazarević et.al., [2312.06961v1](http://arxiv.org/abs/2312.06961v1)\n\n We report the discovery of a bow-shock pulsar wind nebula (PWN), named Potoroo, and the detection of a young pulsar J1638-4713 that powers the nebula. We present a radio continuum study of the PWN based on 20-cm observations obtained from the Australian Square Kilometre Array Pathfinder (ASKAP) and MeerKAT. PSR J1638-4713 was identified using Parkes radio telescope observations at frequencies above 3 GHz. The pulsar has the second-highest dispersion measure of all known radio pulsars (1553 pc/cm^3), a spin period of 65.74 ms and a spin-down luminosity of 6.1x10^36 erg/s. The PWN has a cometary morphology and one of the greatest projected lengths among all the observed pulsar radio tails, measuring over 21 pc for an assumed distance of 10 kpc. The remarkably long tail and atypically steep radio spectral index are attributed to the interplay of a supernova reverse shock and the PWN. The originating supernova remnant is not known so far. We estimated the pulsar kick velocity to be in the range of 1000-2000 km/s for ages between 23 and 10 kyr. The X-ray counterpart found in Chandra data, CXOU J163802.6-471358, shows the same tail morphology as the radio source but is shorter by a factor of 10. The peak of the X-ray emission is offset from the peak of the radio total intensity (Stokes I) emission by approximately 4.7\", but coincides well with circularly polarised (Stokes V) emission. No infrared counterpart was found.\n\n"}}