{"neutrino": {"2503.09426": "2025-03-12, **Investigating the correlation between ZTF TDEs and IceCube high-energy neutrinos**, Ming-Xuan Lu et.al., [2503.09426v1](http://arxiv.org/abs/2503.09426v1)\n\n The main contributors of the IceCube diffuse neutrino flux remain unclear. Tidal disruption events (TDEs) have been proposed as potential emitters of the high-energy neutrinos detected by IceCube. Therefore, investigating the correlation between the TDE population and IceCube neutrinos could help us better understand whether the TDE population could be potential high-energy neutrino emitters. In this paper, we perform a systematic search for TDEs that are associated with neutrinos in a sample including 143 IceCube neutrino alert events and 61 TDEs classified by the Zwicky Transient Facility (ZTF) - Bright Transient Survey (BTS). Furthermore, considering that the TDEs/TDE candidates reported as potential IceCube neutrino emitters are all accompanied by infrared (IR) observations, we further select the TDEs with IR observations from these 61 TDEs as a subsample to examine the correlation with neutrinos. Based on the Wide-field Infrared Survey Explorer (WISE) mission database, seven TDEs are identified as having IR observations. Due to good spatial localization is crucial for association analysis, we employ two methods to handle alert events with large error radii in our sample. Then we employ three Monte Carlo simulation methods to investigate the correlation between TDE sample/subsample and IceCube neutrinos. Finally, after considering spatial and temporal criteria, seven TDEs with IR flares show the most significant correlation at a 2.43{\\sigma} confidence level. If we tentatively further take the time delay factor into account in the weighting scheme, the correlation enhances to 2.54{\\sigma} confidence level.\n\n", "2503.09401": "2025-03-12, **Graph-based Full Event Interpretation: a graph neural network for event reconstruction in Belle II**, Merna Abumusabh et.al., [2503.09401v1](http://arxiv.org/abs/2503.09401v1)\n\n In this work we present the Graph-based Full Event Interpretation (GraFEI), a machine learning model based on graph neural networks to inclusively reconstruct events in the Belle~II experiment. Belle~II is well suited to perform measurements of $B$ meson decays involving invisible particles (e.g. neutrinos) in the final state. The kinematical properties of such particles can be deduced from the energy-momentum imbalance obtained after reconstructing the companion $B$ meson produced in the event. This task is performed by reconstructing it either from all the particles in an event but the signal tracks, or using the Full Event Interpretation, an algorithm based on Boosted Decision Trees and limited to specific, hard-coded decay processes. A recent example involving the use of the aforementioned techniques is the search for the $B^+ \\to K^+ \\nu \\bar \\nu$ decay, that provided an evidence for this process at about 3 standard deviations. The GraFEI model is trained to predict the structure of the decay chain by exploiting the information from the detected final state particles only, without making use of any prior assumptions about the underlying event. By retaining only signal-like decay topologies, the model considerably reduces the amount of background while keeping a relatively high signal efficiency. The performances of the model when applied to the search for $B^+ \\to K^+ \\nu \\bar \\nu$ are presented.\n\n", "2503.09280": "2025-03-12, **eV-scale sterile neutrino: A window open to non-unitarity?**, Hisakazu Minakata et.al., [2503.09280v1](http://arxiv.org/abs/2503.09280v1)\n\n An excess observed in the accelerator neutrino experiments in the $\\nu\\_{\\mu} \\rightarrow \\nu\\_{e}$ channel at high confidence level (CL) has been interpreted as due to eV-scale sterile neutrino(s). But, it has been suffered from the problem of ``appearance - disappearance tension'' at the similarly high CL because the measurements of the $\\nu\\_{\\mu} \\rightarrow \\nu\\_{\\mu}$ channel do not observe the expected event number depletion corresponding to the sterile contribution in the appearance channel. We suggest non-unitarity as a simple and natural way of resolving the tension, which leads us to construct the non-unitary $(3+1)$ model. With reasonable estimation of the parameters governing non-unitarity, we perform an illustrative analysis to know if the tension is resolved in this model. At the best fit of the appearance signature we have found the unique solution with $\\sin^2 2\\theta\\_{14} \\approx 0.3$, which is consistent with the (reactors + Ga) data combined fit. Unexpectedly, our tension-easing mechanism bridges between the two high CL signatures, the BEST and LSND-MiniBooNE anomalies.\n\n", "2503.09108": "2025-03-12, **ASKAP and VLASS search for a radio-continuum counterpart of ultra-high-energy neutrino event KM3-230213A**, M. D. Filipović et.al., [2503.09108v1](http://arxiv.org/abs/2503.09108v1)\n\n We present the results of an Australian Square Kilometre Array Pathfinder (ASKAP) 944 MHz and Very Large Array Sky Survey (VLASS) 3~GHz search for a radio-continuum counterpart of the recent ultra-high-energy (UHE) neutrino event, KM3-230213A. Using (ASKAP), we catalog 1052 radio sources within the 1.5$^\\circ$ radius search area (68% certainty region) around the particle's calculated origin, 10 of which we classify as blazar candidates based on their radio spectra. The most prominent radio source in the search area is the nearby spiral galaxy UGCA 127 (nicknamed Phaedra, From Greek: $\\phi\\alpha i\\delta\\rho\\alpha$, a Cretan princess of Greek Mythology, derived from Phaidros, Greek: ${\\phi}{\\alpha}{\\iota}{\\delta}{\\rho}o{\\varsigma}$, meaning 'bright'.). Its non-thermal radio spectrum classifies it as a non-blazar active galactic nucleus (AGN). We also present an extended radio source, WISEA J061715.89-075455.4 (nicknamed Hebe, From Greek: $H{\\beta}{\\eta}$, the Greek goddess of youth.), located only ~7' from the geometric center of the search area, with a very unusual highly polarized compact component. Finally, we present a strong radio source, EMU J062248-072246 (nicknamed Narcissus, From Greek $N{\\alpha}{\\rho}{\\kappa}{\\iota}{\\sigma}{\\sigma}o{\\zeta}$ was a self-absorbed hunter from Thespiae in Boeotia.), which has a maximum self-absorption spectral slope of +2.5 at low frequencies, and exhibits ~25% flux density variability over the ~5-year VLASS 3~GHz survey.\n\n", "2503.09031": "2025-03-12, **PMT calibration for the JSNS2-II far detector with an embedded LED system**, Jisu Park et.al., [2503.09031v1](http://arxiv.org/abs/2503.09031v1)\n\n The JSNS2-II (the second phase of JSNS2, J-PARC Sterile Neutrino Search at J-PARC Spallation Neutron Source) is an experiment aimed at searching for sterile neutrinos. This experiment has entered its second phase, employing two liquid scintillator detectors located at near and far positions from the neutrino source. Recently, the far detector of the experiment has been completed and is currently in the calibration phase. This paper presents a detailed description of the calibration process utilizing the LED system. The LED system of the far detector uses two Ultra-Violet (UV) LEDs, which are effective in calibrating all of PMTs at once. The UV light is converted into the visible light wavelengths inside liquid scintillator via the wavelength shifters, providing pseudo-isotropic light. The properties of all functioning Photo-Multiplier-Tubes (PMTs) to detect the neutrino events in the far detector, such as gain, its dependence of supplied High Voltage (HV), and Peak-to-Valley (PV) were calibrated. To achieve a good energy resolution for physics events, up to 10% of the relative gain adjustment is required for all functioning PMTs. This will be achieved using the measured HV curves and the LED calibration. The Peak-to-Valley (PV) ratio values are the similar to those from the production company, which distinguish the single photo-electron signal from the pedestal. Additionally, the precision of PMT signal timing is measured to be 2.1 ns, meeting the event reconstruction requirement of 10 ns.\n\n", "2503.09005": "2025-03-12, **Progenitor Dependence of Neutrino-driven Supernova Explosions with the Aid of Heavy Axion-like Particles**, Tsurugi Takata et.al., [2503.09005v1](http://arxiv.org/abs/2503.09005v1)\n\n We perform spherically symmetric simulations of core-collapse supernovae with the aid of heavy axion-like particles (ALPs) which interact with photons and redistribute energy within supernova matter. We explore a wide ALP parameter space that includes MeV-scale ALP mass $m\\_{\\,a}$ and the ALP-photon coupling constant $g\\_{\\,a \\gamma} \\sim 10^{\\,-10} \\, \\rm{GeV}^{\\,-1}$ , employing three progenitor models with zero-age main-sequence mass of $11.2\\,M\\_\\odot$, $20.0\\,M\\_\\odot$, and $25.0\\,M\\_\\odot$. We find a general trend that, given $m\\_{\\,a}\\lesssim 300\\,$MeV, heavier ALPs are favorable for the shock wave to be successfully revived, aiding the onset of the neutrino-driven explosion. However, if ALPs are heavier than $\\sim 400\\,$MeV, the explosion is failed or weaker than that for the models with smaller $m\\_{\\,a}$, because of an insufficient temperature inside the supernova core to produce heavy ALPs. The maximum temperature in the core depends on the initial progenitor structure. Our simulations indicate that the high-temperature environment in the collapsing core of massive progenitors leads to a significant impact of ALPs on the explodability.\n\n"}, "dark matter": {"2503.09104": "2025-03-12, **Dark matter distributions around Schwarzschild-like black holes in bumblebee and Kalb-Ramond models**, Minghong Yu et.al., [2503.09104v1](http://arxiv.org/abs/2503.09104v1)\n\n A central black hole can attract a dark matter cluster and generate a spike in the density profile, as demonstrated by detailed analysis of Schwarzschild and Kerr black holes in the past. Do different black holes attract dark matter differently? To get a fair answer to this question, we customize a relativistic framework to grow general static spherical black holes in dark matter halos and investigate how deviations from the Schwarzschild geometry modify the dark matter spike for the first time. The framework is applied to a class of Schwarzschild-like black hole solutions in Lorentz-violated gravity models -- one in the bumblebee model and two in the Kalb-Ramond model. For these black holes, the answer is no if initially the dark matter has a constant distribution, but the answer is yes if it has a Hernquist profile initially.\n\n", "2503.09082": "2025-03-12, **Search of High-Frequency Variations of Fundamental Constants Using Spin-based Quantum Sensors**, Xi Kong et.al., [2503.09082v1](http://arxiv.org/abs/2503.09082v1)\n\n This study presents a novel method using spin quantum sensors to explore temporal variations of fundamental constants, significantly expanding the frequency range and providing constraints on scalar dark matter.\n\n"}, "supernova": {"2503.09599": "2025-03-12, **Hints of Primordial Magnetic Fields at Recombination and Implications for the Hubble Tension**, Karsten Jedamzik et.al., [2503.09599v1](http://arxiv.org/abs/2503.09599v1)\n\n Primordial Magnetic Fields (PMFs), long studied as potential relics of the early Universe, accelerate the recombination process and have been proposed as a possible way to relieve the Hubble tension. However, previous studies relied on simplified toy models. In this study, for the first time, we use the recent high-precision evaluations of recombination with PMFs, incorporating full magnetohydrodynamic (MHD) simulations and detailed Lyman-alpha radiative transfer, to test PMF-enhanced recombination ($b\\Lambda$CDM) against observational data from the cosmic microwave background (CMB), baryon acoustic oscillations (BAO), and Type Ia supernovae (SN). Focusing on non-helical PMFs with a Batchelor spectrum, we find a preference for present-day total field strengths of approximately 5-10 pico-Gauss. Depending on the dataset combination, this preference ranges from mild ($\\sim 1.8\\sigma$ with Planck + DESI) to moderate ($\\sim 3\\sigma$ with Planck + DESI + SH0ES-calibrated SN) significance. The $b\\Lambda$CDM has Planck + DESI $\\chi^2$ values equal or better than those of the $\\Lambda$CDM model while predicting a higher Hubble constant. The favored field strengths align closely with those required for cluster magnetic fields to originate entirely from primordial sources, without the need for additional dynamo amplification or stellar magnetic field contamination. Future high-resolution CMB temperature and polarization measurements will be crucial for confirming or further constraining the presence of PMFs at recombination.\n\n"}}