{"neutrino": {"2507.13103": "2025-07-17, **Reassessing the gallium anomaly using exact electron wave functions**, M. Cadeddu et.al., [2507.13103v1](http://arxiv.org/abs/2507.13103v1)\n\n The gallium anomaly, a persistent discrepancy exceeding $4\\sigma$ in the $^{71}$Ga neutrino capture rates from $^{51}$Cr and $^{37}$Ar calibration sources by the GALLEX, SAGE, and recently BEST experiments, has challenged particle physics and nuclear theory for over three decades. We present a new calculation for the neutrino capture cross-section, abandoning the conventional leading-order approximation for electronic wave functions by numerically solving the Dirac-Coulomb equation for both bound and continuum electron states. Finally, we re-evaluate the gallium anomaly, updating its global significance and presenting the most up-to-date status of its interpretation in terms of sterile neutrinos.\n\n"}, "dark matter": {"2507.13297": "2025-07-17, **The Making of a Community Dark Matter Dataset with the National Science Data Fabric**, Amy Roberts et.al., [2507.13297v1](http://arxiv.org/abs/2507.13297v1)\n\n Dark matter is believed to constitute approximately 85 percent of the universes matter, yet its fundamental nature remains elusive. Direct detection experiments, though globally deployed, generate data that is often locked within custom formats and non-reproducible software stacks, limiting interdisciplinary analysis and innovation. This paper presents a collaboration between the National Science Data Fabric (NSDF) and dark matter researchers to improve accessibility, usability, and scientific value of a calibration dataset collected with Cryogenic Dark Matter Search (CDMS) detectors at the University of Minnesota. We describe how NSDF services were used to convert data from a proprietary format into an open, multi-resolution IDX structure; develop a web-based dashboard for easily viewing signals; and release a Python-compatible CLI to support scalable workflows and machine learning applications. These contributions enable broader use of high-value dark matter datasets, lower the barrier to entry for new collaborators, and support reproducible, cross-disciplinary research.\n\n", "2507.13227": "2025-07-17, **Effect of Dark matter and $σ$-cut potential on radial and non-radial oscillation modes in neutron stars**, Prashant Thakur et.al., [2507.13227v1](http://arxiv.org/abs/2507.13227v1)\n\n We study the mesonic nonlinear (NL) interaction equation of state (EoS) employing the relativistic mean-field model and investigate the effect of $\\sigma$-cut potential (NL-$\\sigma$ cut) and dark matter (NL DM) on the non-radial and radial oscillation modes of neutron stars. For NL-$\\sigma$ cut, we include the $\\sigma$-cut potential $U\\_{cut} (\\sigma)$ to study its effect. For the dark matter, we use the neutron decay anomaly model. For each model, we investigate two extreme EoSs, stiff and soft, that cover the entire allowed parameter range from the given model, consistent with the current astrophysical constraints. The EoS and the stellar properties, such as mass and radius, are calculated, and the effect of $\\sigma$-cut and DM is discussed. Both non-radial and radial oscillation modes are computed in the general relativistic framework. We study the non-radial $f$ and $p\\_1$ mode frequency, damping time, and some qusi-universal relations connecting the frequencies of the $f$-mode to the average density and compactness. The analysis showed that the $f$ and $p\\_1$ mode frequencies at both 1.4~$M\\_{\\odot}$ and the maximum mass configuration are higher in the NL DM model compared to the NL and NL-$\\sigma$ models. The consistent alignment between our prior parameterizations and current calculations strongly supports the existence of quasi-universal relations that hold true irrespective of the particular matter components involved. For the radial oscillations, we compute 10 lowest-order modes ($f$, $p$), study the radial perturbations as well as the large frequency separation with NL-$\\sigma$ cut and NL DM EoS, showing that the microphysics involved in the NS EoS is imprinted on the frequency separation between different nodes.\n\n", "2507.13177": "2025-07-17, **Probing the nature of gravity in the low-acceleration limit: wide binaries of extreme separations with perspective effects**, Youngsub Yoon et.al., [2507.13177v1](http://arxiv.org/abs/2507.13177v1)\n\n Recent statistical analyses of wide binaries have revealed a boost in gravitational acceleration with respect to the prediction by Newtonian gravity at low internal accelerations $\\lesssim 10^{-9}$ m\\,s$^{-2}$. This phenomenon is important because it does not permit the dark matter interpretation, unlike galaxy rotation curves. We extend previous analyses by increasing the maximum sky-projected separation from 30 to 50 kilo astronomical units (kau). We show that the so-called ``perspective effects'' are not negligible at this extended separation and, thus, incorporate it in our analysis. With wide binaries selected with very stringent criteria, we find that the gravitational acceleration boost factor, $\\gamma\\_g \\equiv g\\_{\\rm obs}/g\\_{\\mathrm N}$, is $1.61^{+0.37}\\_{-0.29}$ (from $\\delta\\_{\\rm obs-newt}\\equiv (\\log\\_{10}\\gamma\\_g)/\\sqrt{2}=0.147\\pm0.062$) at Newtonian accelerations $g\\_{\\mathrm N} = 10^{-11.0}$ m\\,s$^{-2}$, corresponding to separations of tens of kau for solar-mass binaries. At Newtonian accelerations $g\\_{\\mathrm N} = 10^{-10.3}$ m\\,s$^{-2}$, we find $\\gamma\\_g=1.26^{+0.12}\\_{-0.10}$ ($\\delta\\_{\\rm obs-newt}=0.072\\pm0.027$). For all binaries with $g\\_{\\rm N}\\lesssim10^{-10}$ m\\,$s^{-2}$ from our sample, we find $\\gamma\\_g=1.32^{+0.12}\\_{-0.11}$ ($\\delta\\_{\\rm obs-newt}=0.085\\pm0.027$). These results are consistent with the generic prediction of MOND-type modified gravity, although the current data are not sufficient to pin down the low-acceleration limiting behavior. Finally, we emphasize that the observed deviation from Newtonian gravity cannot be explained by the perspective effects or any separation-dependent eccentricity variation which we take into account.\n\n", "2507.13147": "2025-07-17, **Probing the Schwarzschild black hole immersed in a dark matter halo through astrophysical tests**, Tursunali Xamidov et.al., [2507.13147v1](http://arxiv.org/abs/2507.13147v1)\n\n We investigate a recently derived Schwarzschild-like black hole (BH) immersed in a Dehnen-type $(\\alpha,\\beta,\\gamma)=(1,4,5/2)$ dark matter (DM) halo. We obtain constraints on the two model parameters, i.e., the halo core radius $r\\_s$ and the DM density parameter $\\rho\\_s$ in both the weak and the strong field regimes. In the weak field, we model test particle geodesics and match the predicted perihelion shift to Mercury (Solar System) and the orbit of the S2 star data, obtaining upper limits on $r\\_s$ and $\\rho\\_s$. In the strong field, we analyse twin high frequency quasiperiodic oscillations (QPOs) from four microquasars (e.g., GRO J1655-40, GRS 1915+105, XTE J1859+226, and XTE J1550-564). Because QPO frequencies depend only on the local spacetime curvature, they can serve as a probe of halo-induced deviations from general relativity. Our MCMC analysis produces posterior distributions for model parameters, revealing close agreement between the theoretical QPO frequencies and the observations for GRS 1915+105 and GRO J1655-40. The same analysis also yielded best-fit values and upper bounds for each parameter. Our combined geodesic and QPO analysis demonstrates that timelike orbits and epicyclic oscillations can act as sensitive probes of DM halos around BHs, offering a pathway to distinguish Dehnen-type profiles from alternative DM distributions in future analysis and observations.\n\n", "2507.13039": "2025-07-17, **Revealing tensions in neutron star observations with pressure anisotropy**, Peter T. H. Pang et.al., [2507.13039v1](http://arxiv.org/abs/2507.13039v1)\n\n Pressure isotropy, i.e., radial pressure equal to tangential pressure, is often assumed when studying neutron stars. However, multiple physical mechanisms, including pion/kaon condensation, magnetic fields, superfluidity, dark matter clustering, and violations of general relativity, can lead to a pressure anisotropy. This work presents a comprehensive measurement of pressure anisotropy in neutron stars. Our analysis incorporates both an extensive set of nuclear experimental constraints and multi-messenger astrophysical observations, including gravitational wave detections and electromagnetic observations. The Bayesian framework employed marginalizes over equation of state uncertainties and allows the anisotropy to vary between individual neutron stars. We find the Bayes factor for anisotropy against isotropy is $e^{0.46}=10^{0.20}=1.58\\gtrsim 3:2$. Additionally, the posterior indicates a population-wide preference for negative pressure anisotropy, with GW170817 serving as the primary contributor. The individual variability suggests density-scale-independent anisotropy, potentially attributable to magnetic fields, dark matter clustering, or deviations from general relativity rather than phase transitions. While the evidence for pressure anisotropy remains inconclusive, these results demonstrate that pressure anisotropy can be utilized as a valuable diagnostic tool for identifying missing physics in neutron star modeling or revealing tension among observations in the era of multi-messenger astronomy.\n\n", "2507.12993": "2025-07-17, **Supersonic Turbulence in Primordial Halos: A Comparison With and Without The Stream Velocity**, Avi Chen et.al., [2507.12993v1](http://arxiv.org/abs/2507.12993v1)\n\n Turbulence plays a critical role in regulating star formation in molecular clouds and is also observed in simulations of primordial halos that host Population III (Pop III) stars. The relative velocity between baryons and dark matter at the time of recombination is thought to be a source of turbulence in the early universe. In this paper, we study how this stream velocity affects the turbulence inside primordial halos using high-resolution cosmological simulations across the redshift range of $z = 30$ to $z = 20$. We find that at a fixed redshift, the stream velocity enhances turbulence in low-mass halos ($M \\lesssim 10^6 \\ \\mathrm{M\\_\\odot}$) and suppresses it for high-mass halos ($M \\gtrsim 10^6 \\ \\mathrm{M\\_\\odot}$). The enhancement in low-mass halos likely arises from residual kinetic energy introduced by the stream velocity, while the suppression in high-mass halos likely arises from a reduction in inflowing accretion-driven turbulence. This mass-dependent modulation of turbulence suggests that the initial conditions inside primordial halos are altered in the presence of the stream velocity, potentially influencing their fragmentation and the resulting star formation.\n\n", "2507.12970": "2025-07-17, **Deflection of light by dark matter supporting traversable wormholes in the framework of Kalb-Ramond gravity**, Susmita Sarkar et.al., [2507.12970v1](http://arxiv.org/abs/2507.12970v1)\n\n This study explores the possible formation of asymptotically flat traversable wormholes within dark matter halos under the framework of Kalb-Ramond gravity. The wormhole solutions are derived based on the King and Navarro-Frenk-White dark matter density profiles associated with anisotropic matter sources. For a particular set of parameters, the proposed shape functions are found to be positively increasing and satisfy all the essential geometric conditions along with the flare-out condition, thereby supporting asymptotically flat traversable wormholes. To study the underlying matter content responsible for the wormhole structures, we analyze the null energy condition at the wormhole throat and provide graphical representations of various energy conditions, highlighting both the regions where they are satisfied and where they are violated. The stability of the reported wormhole solutions is confirmed through the generalized Tolman-Oppenheimer-Volkoff equation. In addition, we explore several physical features of the wormhole configurations, including the embedding surface, complexity factor, active gravitational mass, and total gravitational energy. Moreover, we investigate the deflection of light by these wormholes, finding that the deflection angle approaches zero at large distances, where the wormhole's gravity is negligible, and diverges near the throat, where the gravitational influence is extremely strong.\n\n", "2507.12860": "2025-07-17, **Dark matter detection using optically trapped Rydberg atom tweezer arrays**, So Chigusa et.al., [2507.12860v1](http://arxiv.org/abs/2507.12860v1)\n\n A new scheme for detecting wave-like dark matter (DM) using Rydberg atoms is proposed. Recent advances in trapping and manipulating Rydberg atoms make it possible to use Rydberg atoms trapped in optical tweezer arrays for DM detection. We present a simple and innovative experimental procedure that searches for excitations of trapped Rydberg atoms due to DM-induced electric field. A scan over DM mass is enabled with the use of the Zeeman and diamagnetic shifts of energy levels under an applied external magnetic field. Taking dark photon DM as an example, we demonstrate that our proposed experiment can have high sensitivity enough to probe previously unexplored regions of the parameter space of dark photon coupling strengths and masses.\n\n", "2507.12702": "2025-07-17, **Bar-driven Streaming Motions Mimic a Massive Bulge in the Inner Milky Way**, Junichi Baba et.al., [2507.12702v1](http://arxiv.org/abs/2507.12702v1)\n\n The circular speed curve of the Milky Way provides a key constraint on its mass distribution, reflecting the axisymmetric component of the gravitational potential. This is especially critical in the inner Galaxy ($R \\lesssim 4$ kpc), where non-axisymmetric structures such as the stellar bar and nuclear stellar disk strongly influence dynamics. However, significant discrepancies remain between circular speed curves inferred from stellar dynamical modeling and those derived from the terminal-velocity method applied to gas kinematics. To investigate this, we perform three-dimensional hydrodynamic simulations including cooling, heating, star formation, and feedback, under a realistic gravitational potential derived from stellar dynamical models calibrated to observational data. This potential includes the Galactic bar, stellar disks, dark matter halo, nuclear stellar disk, and nuclear star cluster. We generate synthetic longitude-velocity ($l$-$v$) diagrams and apply the terminal-velocity method to derive circular speeds. The simulated gas reproduces the observed terminal-velocity envelope, including a steep inner rise. We find this feature arises from bar-driven non-circular motions, which cause the terminal-velocity method to overestimate circular speeds by up to a factor of 2 at $R \\sim 0.4$ kpc, and enclosed mass by up to a factor of 4. These results suggest that inner gas-based rotation curves can significantly overestimate central mass concentrations. The steep inner rise in gas-derived circular speeds does not require a massive classical bulge but can be explained by bar-induced streaming motions. Rather than proposing a new mechanism, our study provides a clear, Milky Way-specific demonstration of this effect, emphasizing the importance of dynamical modeling that explicitly includes non-circular motions for accurate mass inference in the inner Milky Way.\n\n"}, "supernova": {"2507.13278": "2025-07-17, **The pulsar wind nebula around B1853+01 in X-rays**, Xiying Zhang et.al., [2507.13278v1](http://arxiv.org/abs/2507.13278v1)\n\n We report on the results of a comprehensive analysis of X-ray observations carried out with \\textit{Chandra}, \\textit{XMM-Newton} and \\textit{NuSTAR} of the pulsar wind nebula (PWN) associated with PSR B1853+01, located inside the W44 supernova remnant (SNR). Previous X-ray observations unveiled the presence of a fast-moving pulsar, PSR B1853+01, located at the southern edge of the W44 thermal X-ray emission region, as well as an elongated tail structure trailing the pulsar. Our analysis reveals, in addition, the presence of an ``outflow'' feature ahead of the pulsar extending for about 1 \\arcmin ($\\sim$ 1.0 pc at the distance of 3.2 kpc). At larger scales, the entire PWN seems to be surrounded by a faint, diffuse X-ray emission structure. The southern part of this structure displays the same unusual morphology as the ``outflow'' feature ahead of the pulsar, and extends along $\\sim 6$ \\arcmin ($\\sim$ 5 pc) in the direction of the pulsar proper motion. In this report, a spatially-resolved spectral analysis for the different extended regions around PSR B1853+01 is carried out. For an updated value of the column density of $0.65\\_{+0.46}^{-0.42} \\times 10^{22} ~\\textrm{cm}^{-2}$, a power-law fit to the ``outflow'' region yields a spectral index $\\Gamma \\approx 1.24\\_{+0.23}^{-0.24}$, which is significantly harder than that of the pulsar ($\\Gamma \\approx 1.87\\_{+0.48}^{-0.43}$) and the pulsar tail ($\\Gamma \\approx 2.01\\_{+0.39}^{-0.38}$). We argue that both the ``outflow'' structure and the surrounding halo-like X-ray emission might be produced by high-energy particles escaping the PWN around PSR B1853+01, a scenario recently suggested also for other Bow-shock PWNe with jet-like structures and/or TeV halos.\n\n", "2507.13210": "2025-07-17, **Multi-wavelength study of the high Galactic latitude supernova remnant candidate \\snr\\ associated with the Calvera pulsar**, Emanuele Greco et.al., [2507.13210v1](http://arxiv.org/abs/2507.13210v1)\n\n The candidate supernova remnant (SNR) G118.4+37.0 (Calvera's SNR), discovered as a faint radio ring at high Galactic latitude and coincident with extended Fermi/LAT gamma-ray emission, is likely associated to the X-ray pulsar 1RXS J141256.0+792204 (Calvera). Previous XMM-Newton data hinted at soft diffuse X-ray emission inside the ring but lacked sufficient exposure for detailed characterisation. We obtained new XMM-Newton observations, and produced count-rate images, equivalent width and median photon energy maps to identify optimal regions for spectral analysis. We complemented these observations with a reanalysis of Fermi/LAT gamma-ray data and new Telescopio Nazionale Galileo observations aimed to search for Halpha emission. The X-ray diffuse emission is well described by a model of shock-heated plasma with temperature kT \\sim 0.15 keV, mildly under-solar N and o abundances and densities ne=0.1-0.7 cm-3. According to our estimates, Calvera's SNR is 10-20 kya old and lies at a distance of 4-5 kpc. A distinti \"Clump\" region shows hared emission equally well described by a thermal (kT\\sim 1.7 keV) or a non thermal model (Gamma \\sim 2.7). The brightest X-ray area is close to the gamma-ray peak and to an isolated Alpha filament. G118.4+37.0 is a middle-aged remnant which expands in a tenuous medium and encountered a denser phase, likely the relic of the wind activity of the massive progenitor star. The estimated SNR distance is consistent within the uncertainties with that estimated for Calvera, confirming that this peculiar pulsar was born in the explosion of a massive star high above the Galactic disk. Our measured ambient density, together with the patchy morphology of the gamma-ray emission and the detection of Halpha filaments indicates that a hadronic origin is compatible with the gamma-ray flux, though a mixed leptonic-hadronic cannot be excluded\n\n", "2507.13014": "2025-07-17, **ALMA discovery of Punctum -- a highly polarized mm source in nuclear starburst galaxy NGC 4945**, E. Shablovinskaia et.al., [2507.13014v1](http://arxiv.org/abs/2507.13014v1)\n\n We report the discovery of a highly polarized millimeter (mm) continuum source in the central region of NGC 4945, identified through ALMA Band 3 observations. This starburst Seyfert 2 galaxy contains numerous compact mm sources, yet only one - located approximately 3.4\" (~60 pc) from the galactic center and unresolved with ~0.1\" resolution - exhibits an unusually high polarization degree of 50% $\\pm$ 14%, likely originating from non-thermal synchrotron radiation. The source is faint, yet clearly detected in two separate epochs of observation taken 14 days apart, with flux of 0.104 $\\pm$ 0.018 and 0.125 $\\pm$ 0.016 mJy, as well as in earlier ALMA observations, showing no variability at any timescale. The spectral index remains stable within large uncertainties, -1.8 $\\pm$ 2.5 and -1.3 $\\pm$ 2.5. The source, which we further refer to as Punctum due to its compactness, revealed no clear counterparts in existing X-ray or radio observations. Assuming association with the central region of NGC 4945, we estimate upper limits for its luminosity of ~1 $\\times$ 10$^{37}$ erg s$^{-1}$ in the 3-6 keV X-ray band (from archival Chandra data) and ~5 $\\times$ 10$^{35}$ erg s$^{-1}$ at 23 GHz (from archival ATCA data). A comparison of the radio, mm (including polarization), and X-ray properties with known astrophysical sources emitting synchrotron radiation, such as accreting neutron stars, supernova remnants, and non-thermal galactic filaments, revealed no clear match in any of these scenarios. The exact nature of this highly polarized source remains undetermined.\n\n", "2507.12817": "2025-07-17, **Finding strangelets in cosmic rays from HESS J1731-347, a possible strange quark star using the Cherenkov Telescope Array Observatory**, C. R. Das et.al., [2507.12817v1](http://arxiv.org/abs/2507.12817v1)\n\n The hypothesis that supernova remnants are key sources of Galactic cosmic rays gains support from evidence that HESS J1731-347 one of the few Galactic objects capable of accelerating hadronic cosmic rays to TeV energies may harbor an exotic strange quark star rather than a conventional neutron star. This conclusion stems from its unusually low mass and compact radius, which challenge standard neutron star models. If confirmed, such a quark star could generate cosmic rays through the transition from the two-flavor color-superconducting (2SC) phase to the color-flavor-locked (CFL) phase, potentially releasing strangelets, hypothetical strange quark matter particles. Detecting these strangelets in cosmic rays would provide groundbreaking evidence for quark matter. The future Cherenkov Telescope Array (CTA), with its unmatched sensitivity and spectral resolution in the very-high-energy (VHE) gamma-ray regime, is uniquely positioned to search for their annihilation or decay signatures. We analyze theoretical predictions for these gamma-ray signals and evaluate CTA's potential to detect or constrain them. Additionally, we present an in-depth assessment of CTA observations of HESS J1731-347, focusing on spectral features that could confirm strangelet production. A positive detection would not only validate the existence of strange quark stars but also establish a direct link between quark matter and cosmic-ray acceleration, reshaping our understanding of compact objects and high-energy astrophysics.\n\n", "2507.12754": "2025-07-17, **Breaking the Mass-sheet Degeneracy in Time-delay Cosmology with Lensed and Unlensed Type Ia Supernovae**, Xiaolei Li et.al., [2507.12754v1](http://arxiv.org/abs/2507.12754v1)\n\n This study introduces an innovative framework aimed at overcoming the ongoing issue of mass-sheet degeneracy (MSD) in time-delay cosmography by incorporating observations of both gravitationally lensed and unlensed Type Ia supernovae (SNe Ia). By simultaneously using lensing magnification measurements $\\mu^{\\rm{obs}}$ and cosmic distance ratios ($D\\_s/D\\_{ds}$), we develop a Bayesian framework capable of breaking the MSD. Specifically, we reconstruct the distance-redshift and magnitude-redshift relations from unlensed Type Ia supernovae using Gaussian process to avoid dependence on specific cosmological models. Our framework shows substantial efficacy in resolving the MSD by imposing constraints on the MSD parameter $\\lambda$. Furthermore, we extend this framework to analyze multiple gravitational lensing systems. The results show strong agreement with the fiducial MSD parameters used in the data simulation, confirming our method's effectiveness in mitigating the MSD. Ultimately, this technique enables the derivation of corrected time-delay distance measurements under the MSD, improving the precision of cosmological parameters inferred from strong lensing systems.\n\n"}}