{"neutrino": {"2403.13671": "2024-03-20, **Opportunities at the Sanford Underground Research Facility**, Jaret Heise et.al., [2403.13671v1](http://arxiv.org/abs/2403.13671v1)\n\n The Sanford Underground Research Facility (SURF) has been operating for more than 15 years as an international facility dedicated to advancing compelling multidisciplinary underground scientific research in rare-process physics, as well as offering research opportunities in other disciplines. SURF laboratory facilities include a Surface Campus as well as campuses at the 4850-foot level (1490 m, 4300 m.w.e.) that host a range of significant physics experiments, including the LUX-ZEPLIN (LZ) dark matter experiment and the MAJORANA DEMONSTRATOR neutrinoless double-beta decay experiment. The CASPAR nuclear astrophysics accelerator completed the first phase of operation and is planning for the second phase beginning in 2024. SURF is also home to the Long-Baseline Neutrino Facility (LBNF) that will host the international Deep Underground Neutrino Experiment (DUNE). SURF offers world-class service, including an ultralow background environment, low-background assay capabilities, and electroformed copper is produced at the facility. SURF is preparing to increase underground laboratory space. Plans are advancing for construction of new large caverns (nominally 100m L x 20m W x 24m H) on the 4850L (1485 m, 4100 m.w.e.) on the timeframe of next generation experiments (~2030). SURF plans to leverage existing advisory and community committees as well as engage the underground science community to inform plans for future laboratory space.\n\n", "2403.13613": "2024-03-20, **The electric dipole moment in a model for neutrino mass, dark matter and baryon asymmetry of the Universe**, Kazuki Enomoto et.al., [2403.13613v1](http://arxiv.org/abs/2403.13613v1)\n\n The electric dipole moment is examined in a three-loop neutrino mass model with dark matter originally proposed in Aoki et al. [Phys. Rev. Lett. 102, 051805 (2009)]. The model contains a $CP$-violating phase in the Higgs potential which plays an important role in electroweak baryogenesis and is thus expected to explain the baryon asymmetry of the Universe simultaneously. However, such a $CP$-violating phase is severely constrained by the measurements of the electron electric dipole moment (eEDM), and a suppression mechanism for the eEDM is necessary to explain the observed baryon asymmetry while avoiding the constraint. In this paper, we examine neutrino mass, lepton-flavor-violating processes, dark matter, and the eEDM in the model. We show that the eEDM can be suppressed by destructive interference between the $CP$-violating phases in the Higgs sector and the dark sector with large $CP$-violating phases. We propose some benchmark scenarios including $O(1)$ $CP$-violating phases where tiny neutrino mass and dark matter can be explained while avoiding all current experimental and theoretical constraints. These $CP$-violating phases are expected to be large enough to generate the observed baryon asymmetry in the electroweak baryogenesis scenario.\n\n", "2403.13494": "2024-03-20, **Novel imprint of a dark photon from the 3-3-1-1 model**, Doan Minh Luong et.al., [2403.13494v1](http://arxiv.org/abs/2403.13494v1)\n\n We investigate a dark photon that arises from the UV model based upon $SU(3)\\_C\\otimes SU(3)\\_L\\otimes U(1)\\_X \\otimes U(1)\\_G$ (3-3-1-1) gauge symmetry, where the last three factors enlarge the electroweak symmetry encompassing electric charge $Q=T\\_3 - 1/ \\sqrt{3}T\\_8 +X$ and dark charge $D = -2/\\sqrt{3} T\\_8 +G$. It is well-established that this model addresses the questions of family number, neutrino mass, and dark matter. It is shown in this work that if the 3-3-1-1 breaking scale is much bigger than the dark charge breaking scale, the relevant dark gauge boson $Z'$ is uniquely imprinted at TeV, avoiding dangerous FCNC processes, obeying precision electroweak measurements, as well as contributing to collider phenomena, even if no kinetic mixing is presented. The dark matter observables are perhaps governed by the dark charge breaking Higgs field instead of the dark photon.\n\n", "2403.13231": "2024-03-20, **Design, construction, and operation of a 1-ton Water-based Liquid scintillator detector at Brookhaven National Laboratory**, X. Xiang et.al., [2403.13231v1](http://arxiv.org/abs/2403.13231v1)\n\n Water-based liquid scintillators (WbLS) are attractive neutrino detector materials because they allow us to tune the ratio of the Cherenkov and scintillation signals. Using WbLS large-scale neutrino experiments can benefit from both directional reconstruction and enhanced low-energy efficiency. Furthermore, broadening the science capability of such materials by metal doping may be better suited for water based liquid scintillators. We recently constructed and commissioned a 1-ton WbLS detector with good photosensor coverage and a capable data acquisition system. We intend to use this flexible detector system as a testbed for WbLS R&D. In this paper we give an overview of the 1-ton system and provide some early analysis results.\n\n", "2403.12967": "2024-03-19, **The FLAMINGO project: the coupling between baryonic feedback and cosmology in light of the $S_8$ tension**, Willem Elbers et.al., [2403.12967v1](http://arxiv.org/abs/2403.12967v1)\n\n Large-scale structure surveys have reported measurements of the density of matter, $\\Omega\\_\\mathrm{m}$, and the amplitude of clustering, $\\sigma\\_8$, that are in tension with the values inferred from observations of the cosmic microwave background. While this may be a sign of new physics that slows the growth of structure at late times, strong astrophysical feedback processes could also be responsible. In this work, we argue that astrophysical processes are not independent of cosmology and that their coupling naturally leads to stronger baryonic feedback in cosmological models with suppressed structure formation or when combined with a mechanism that removes dark matter from halos. We illustrate this with two well-motivated extensions of the Standard Model known to suppress structure formation: massive neutrinos and decaying dark matter. Our results, based on the FLAMINGO suite of hydrodynamical simulations, show that the combined effect of baryonic and non-baryonic suppression mechanisms is greater than the sum of its parts, particularly for decaying dark matter. We also show that the dependence of baryonic feedback on cosmology can be modelled as a function of the ratio $f\\_\\mathrm{b}/c^2\\_\\mathrm{v}\\sim f\\_\\mathrm{b}/(\\Omega\\_\\mathrm{m}\\sigma\\_8)^{1/4}$ of the universal baryon fraction, $f\\_\\mathrm{b}$, to a velocity-based definition of halo concentration, $c^2\\_\\mathrm{v}$, giving an accurate fitting formula for the baryonic suppression of the matter power spectrum. Although the combination of baryonic and non-baryonic suppression mechanisms can resolve the tension, the models with neutrinos and decaying dark matter are challenged by constraints on the expansion history.\n\n", "2403.12645": "2024-03-19, **Calibration of the RED-100 detector at the Kalinin nuclear power plant**, D. Yu. Akimov et.al., [2403.12645v1](http://arxiv.org/abs/2403.12645v1)\n\n RED-100 is a two-phase Xe detector designed and built for the study of coherent elastic neutrino-nucleus scattering CEvNS of reactor antineutrinos. A comprehensive calibration was performed in order to obtain important parameters of the detector during its exposition at the Kalinin Nuclear Power Plant (Tver, Russia). This paper describes the analysis of calibration data, position and energy reconstruction procedures, and evaluation of the efficiency of electron extraction from the liquid xenon to the gas phase.\n\n", "2403.12520": "2024-03-19, **First Measurement of the $ν_e$ and $ν_μ$ Interaction Cross Sections at the LHC with FASER's Emulsion Detector**, Roshan Mammen Abraham et.al., [2403.12520v1](http://arxiv.org/abs/2403.12520v1)\n\n This paper presents the first results of the study of high-energy electron and muon neutrino charged-current interactions in the FASER$\\nu$ emulsion/tungsten detector of the FASER experiment at the LHC. A subset of the FASER$\\nu$ volume, which corresponds to a target mass of 128.6~kg, was exposed to neutrinos from the LHC $pp$ collisions with a centre-of-mass energy of 13.6~TeV and an integrated luminosity of 9.5 fb$^{-1}$. Applying stringent selections requiring electrons with reconstructed energy above 200~GeV, four electron neutrino interaction candidate events are observed with an expected background of $0.025^{+0.015}\\_{-0.010}$, leading to a statistical significance of 5.2$\\sigma$. This is the first direct observation of electron neutrino interactions at a particle collider. Eight muon neutrino interaction candidate events are also detected, with an expected background of $0.22^{+0.09}\\_{-0.07}$, leading to a statistical significance of 5.7$\\sigma$. The signal events include neutrinos with energies in the TeV range, the highest-energy electron and muon neutrinos ever detected from an artificial source. The energy-independent part of the interaction cross section per nucleon is measured over an energy range of 560--1740 GeV (520--1760 GeV) for $\\nu\\_e$ ($\\nu\\_{\\mu}$) to be $(1.2\\_{-0.7}^{+0.8}) \\times 10^{-38}~\\mathrm{cm}^{2}\\,\\mathrm{GeV}^{-1}$ ($(0.5\\pm0.2) \\times 10^{-38}~\\mathrm{cm}^{2}\\,\\mathrm{GeV}^{-1}$), consistent with Standard Model predictions. These are the first measurements of neutrino interaction cross sections in those energy ranges.\n\n", "2403.12485": "2024-03-19, **Scalar dark matter explanation of the excess in the Belle II $B^+\\to K^+ + \\mbox{invisible}$ measurement**, Xiao-Gang He et.al., [2403.12485v1](http://arxiv.org/abs/2403.12485v1)\n\n Recently Belle II reported the first measurement of $B^+\\to K^++\\mbox{invisible (inv)}$, which is $2.7\\sigma$ above the standard model (SM) prediction. If confirmed, this calls for new physics beyond SM. In the SM, the invisible particles are neutrino-anti-neutrino pairs. There are more possibilities when going beyond the SM. In this work, we focus on decays to dark matter (DM) and show that the $B\\to K +\\mathrm{inv}$ excess from Belle II and DM relic density can be simultaneously explained in a simple extension of the SM. The model introduces a real scalar singlet $\\phi$ acting as a DM candidate, and two heavy vector-like quarks $Q,D$ with the same quantum numbers as the SM left-handed quark doublet and right-handed down-type quark singlet, respectively. All these new particles are odd under a $\\mathbb{Z}\\_2$ symmetry while the SM particles are even. The model can successfully explain the Belle II anomaly and DM relic density for TeV-scale heavy quarks with hierarchical Yukawa couplings involving $b$ and $s$ quarks. At the same time, it can easily satisfy other flavour physics and DM detection constraints.\n\n", "2403.12461": "2024-03-19, **Revisiting the Dirac Nature of Neutrinos**, Manash Dey et.al., [2403.12461v1](http://arxiv.org/abs/2403.12461v1)\n\n Amid the uncertainty regarding the fundamental nature of neutrinos, we adhere to the Dirac one, and construct a model in the light of $\\Delta(27)$ symmetry. The model is enriched by an additional $Z\\_{10}$ symmetry, to eliminate the possibility of the Majorana mass terms. The neutrino mass matrix exhibits four texture zeroes, and the associated mixing scheme aligns with the experimental data, notably controlled by a single parameter. In addition, the model emphasizes on the \\emph{standard parametrization} of the lepton mixing matrix, which is crucial in the light of model building and neutrino physics experiments\n\n", "2403.12414": "2024-03-19, **Development of low-radon ultra-pure water for the Jiangmen Underground Neutrino Observatory**, T. Y. Guan et.al., [2403.12414v1](http://arxiv.org/abs/2403.12414v1)\n\n The Jiangmen Underground Neutrino Observatory(JUNO) is a state-of-the-art liquid scintillator-based neutrino physics experiment under construction in South China. To reduce the background from external radioactivities, a water Cherenkov detector composed of 35~kton ultra-pure water and 2,400 20-inch photomultiplier tubes is developed. Even after specialized treatment, ultra-pure water still contains trace levels of radioactive elements that can contribute to the detector background. Among which $^{222}$Rn is particularly significant. To address this, an online radon removal system based on the JUNO prototype has been developed. By integrating micro-bubble generators to enhance degasser's radon removal efficiency, the radon concentration in water can be reduced to 1~mBq/m$^{3}$ level, meeting the stringent requirements of JUNO. Additionally, a highly sensitive online radon concentration measurement system capable of detecting concentrations $\\sim$1~mBq/m$^3$ has been developed to monitor the radon concentration in water. In this paper, the details regarding both systems will be presented.\n\n"}, "dark matter": {"2403.13555": "2024-03-20, **Superconducting Microwave Detector Technology for Ultra-Light Dark Matter Haloscopes and other Fundamental Physics Experiments: Device Physics (Part II)**, David J. Goldie et.al., [2403.13555v1](http://arxiv.org/abs/2403.13555v1)\n\n We consider and compare candidate superconducting detector technologies that might be applied to the readout of cavity-axion haloscopes and similar fundamental physics experiments. We conclude that a transition edge sensor (TES) configured with ballistic-phonon thermal isolation operated with a superconducting transition temperature of order 30 mK would provide quantum-limited detection performance at frequencies above 5 GHz. This would permit the realisation of integrated homodyne detectors based on TESs that we believe would make a unique contribution to a variety of fundamental physics experiments, particularly those based on reading out microwave cavities in the quantum ground state.\n\n", "2403.13554": "2024-03-20, **Superconducting Microwave Detector Technology for Ultra-Light Dark Matter Haloscopes and other Fundamental Physics Experiments: Background Theory (Part I)**, Christopher N. Thomas et.al., [2403.13554v1](http://arxiv.org/abs/2403.13554v1)\n\n We consider how superconducting microwave detector technology might be applied to the readout of cavity-axion haloscopes and similar fundamental physics experiments. Expressions for the sensitivity of two detection schemes are derived: 1) a dispersive spectrometer, and 2) a direct-conversion/homodyne receiver using detectors as mixing elements. In both cases the semi-classical/Poisson-mixture approach is used to account for quantum effects. Preliminary sensitivity calculations are performed to guide future development work. These suggest the homodyne scheme offers a near-term solution for realising near-quantum-noise limited receivers with improved usability compared with parametric amplifiers. Similarly, they show that the dispersive spectrometer offers a potential way to beat the quantum noise limit, but that significant technological development work is needed to do so.\n\n", "2403.13529": "2024-03-20, **Scalar Dark Matter and Stability of Higgs Vacuum within a Minimal SO(10) GUT Model**, Nilavjyoti Hazarika et.al., [2403.13529v1](http://arxiv.org/abs/2403.13529v1)\n\n In this work, we delve to investigate a feasible range of dark matter (DM) masses within a non-supersymmetric $SO(10)$ Grand Unified Theory (GUT) scalar dark matter model, in freeze-out scenario. This model includes a singlet scalar denoted as S and an inert doublet represented by $\\phi$. Being part of SO(10), the quantum numbers of DM particles are assigned and hence we know their nature. These fields are odd under a discrete $Z\\_2$ matter parity $(-1)^{3(B-L)}$. The dark matter with mass 300 $\\leq M\\_{DM} \\leq$ 1000 GeV emerges as a mixture of the $Z\\_2$-odd scalar singlet $S$ and the neutral element of the doublet $\\phi$, both residing within a \\textbf{16}-dim scalar representation of $SO(10)$. In this work we consider a real scalar \\textbf{S} belonging to \\textbf{16} of SO(10) as DM. We also investigate the one-loop vacuum stability through the solution of Renormalization Group Equations (RGEs) for the model's parameters. Subsequently, we scrutinize the model's predictions within the confines of contemporary theoretical and experimental restrictions. In addition to achieving vacuum stability in the SO(10) framework, the DM mass is found to lie in the previously unaddressed (theoretically) intermediate mass region of 300$\\leqslant$ MDM $\\leqslant$ 1000 GeV which also adheres to many current phenomenological constraints, like recent direct experimental bounds from XENON1T, indirect detection bounds from Fermi-LAT experiment, Higgs invisible decay and Electroweak Precision Test. The stability of the electroweak vacuum is seen to be present up to the Planck scale. These model predictions possess the potential for future validation through dark matter search experiments, as they are testable in future DM search experiments, along with the added feature that the model is a part of an elegant grand unified theory.\n\n", "2403.13448": "2024-03-20, **Improved modelling for dark photon detection with dish antennas**, Jordan Gué et.al., [2403.13448v1](http://arxiv.org/abs/2403.13448v1)\n\n A vector dark matter candidate, also known as dark photon, would induce an oscillating electric field through kinetic mixing. One detection strategy uses a spherical reflector to focus the induced emission at its center of curvature. On one hand, we investigate the effects of diffraction in this type of experiment from an analytical standpoint, making use of the Kirchhoff integral theorem in the low-curvature dish limit. On the other hand, we estimate the impact of mode-matching, in the case of detection by a pyramidal horn antenna. We show that the expected signal intensity can be significantly reduced compared to usual estimates. Our method is applied to the re-interpretation of the SHUKET experiment data, the results of which are shown to be degraded by a factor of $\\sim$~50 due to both diffraction and mode-matching. The analytical method allows optimizing some experimental parameters to gain sensitivity in future runs. Our results can be applied to any dish antenna experiment using a low curvature reflector.\n\n", "2403.13390": "2024-03-20, **Search for Dark Matter Axions with Tunable TM_020 mode**, Sungjae Bae et.al., [2403.13390v1](http://arxiv.org/abs/2403.13390v1)\n\n Axions are hypothesized particles believed to potentially resolve two major puzzles in modern physics: the strong CP problem and the nature of dark matter. Cavity-based axion haloscopes represent the most sensitive tools for probing their theoretically favored couplings to photons in the microelectronvolt range. However, as the search mass (or frequency) increases, the detection efficiency decreases, largely due to a decrease in cavity volume. Despite the potential of higher-order resonant modes to preserve experimental volume, their practical application in searches has been limited by the challenge of maintaining a high form factor over a reasonably wide search bandwidth. We introduce an innovative tuning method that uses the unique properties of auxetic materials, designed to effectively tune higher modes. This approach was applied to the TM\\_020 mode for a dark matter axion search exploring a mass range from 21.38 to 21.79 ueV, resulting in the establishment of new exclusion limits for axion-photon coupling greater than approximately 10^-13 GeV^-1. These findings signify a breakthrough, demonstrating that our tuning mechanism facilitates the practical utilization of higher-order modes for cavity haloscope searches.\n\n", "2403.13109": "2024-03-19, **Shapes of dark matter haloes with discrete globular cluster dynamics: The example of NGC 5128 (Centaurus A)**, Tadeja Veršič et.al., [2403.13109v1](http://arxiv.org/abs/2403.13109v1)\n\n Within the $\\Lambda$CDM cosmology, dark matter haloes are expected to deviate from spherical symmetry. Constraining the halo shapes at large galactocentric distances is challenging due to the low density of luminous tracers. The well-studied early-type galaxy NGC 5128 (Centaurus A - CenA), has a large number of radial velocities for globular clusters (GCs) and planetary nebulae (PNe) of its extended stellar halo. In this work, we aim to determine the deviation from spherical symmetry of the dark matter halo of CenA at 5 $R\\_{\\rm e}$ using its GCs as kinematic tracers. We used the largest photometric catalogue of GC candidates to accurately characterise the spatial distribution of the relaxed population and investigated the presence of non-relaxed structures in the kinematic catalogue of GCs using the relaxed point-symmetric velocity field as determined by the host's PNe population. We used anisotropic Jeans modelling under axisymmetric assumptions together with the Gaussian likelihood and GCs as discrete tracers. The gravitational potential is generated by flattened stellar and dark matter distributions. We leveraged different orbital properties of the blue and red GCs to model them separately. We find that discrete kinematics of the GCs are consistent with being drawn from an underlying relaxed velocity field determined from PNe. The best-fit parameters of the gravitational potential recovered from the blue and red GCs separately agree well and the joint results are: $M\\_{200} = 1.86^{1.61}\\_{-0.69}\\times 10^{12}$ M$\\_\\odot$, $M\\_\\star/L\\_{\\rm B} = 2.98^{+0.96}\\_{-0.78}$ and the flattening $q\\_{\\rm DM} = 1.45^{+0.78}\\_{-0.53}$. Both GC populations show mild rotation, with red having a slightly stronger rotational signature and radially biased orbits, and blue GCs preferring negative velocity anisotropy. An oblate or a spherical dark matter halo of CenA is strongly disfavoured by our modelling.\n\n", "2403.13072": "2024-03-19, **Cosmic microwave background constraints on extended dark matter objects**, Djuna Croon et.al., [2403.13072v1](http://arxiv.org/abs/2403.13072v1)\n\n Primordially formed extended dark objects would accrete baryonic matter and impact the ionisation history of the Universe. Insisting on consistency with the anisotropies of the cosmic microwave background, we derive constraints on the dark matter fraction for various classes of objects, of different sizes. We introduce a novel scaling technique to speed up numerical calculations and release our calculation framework in the form of a Mathematica notebook. Conservatively, we focus on spherical accretion and collisional ionisation. We find strong constraints limiting the dark matter fraction to subpercent level for objects of up to $10^4$ AU in size.\n\n", "2403.13061": "2024-03-19, **Unveiling the origins of galactic bars: insights from barred and unbarred galaxies**, Paula D. López et.al., [2403.13061v1](http://arxiv.org/abs/2403.13061v1)\n\n A significant fraction of local galaxies exhibit stellar bars, non-axisymmetric structures composed of stars, gas, and dust. Identifying key differences between the properties of barred and unbarred galaxies can uncover clues about the conditions for triggering bar formation. We explore the early stages of bar formation in a small sample of disc barred galaxies extracted from the TNG50 cosmological simulation, and compare their properties to those of unbarred galaxies. According to our results, the most important difference between barred and unbarred galaxies is that the former have systematically higher fractions of stellar to dark matter mass in their inner regions, from very early stages and prior to the formation of the bars. They harbour high initial gas content, fostering increased star formation rates and leading to a central mass concentration that grows faster over time compared to unbarred galaxies. Examining the evolution of the halo spin within 10 ckpc reveals that barred galaxies have higher angular momentum transfer from the disc to the halo. Curiously, both barred and unbarred galaxies share similar initial low values of the halo spin, consistent with those proposed in the literature for bar formation. Furthermore, we evaluate existing stability criteria to capture the complexity of the process, and investigate the effects of mergers, flybys, and environment as possible drivers of bar formation. We find no clear link between mergers and disc instabilities resulting in the formation of bars, even though some of the simulated barred galaxies might have been influenced by these events.\n\n", "2403.13052": "2024-03-19, **Rotating Fermion-Boson Stars**, Jorge Castelo Mourelle et.al., [2403.13052v1](http://arxiv.org/abs/2403.13052v1)\n\n Rotating fermion-boson stars are hypothetical celestial objects that consist of both fermionic and bosonic matter interacting exclusively through gravity. Bosonic fields are believed to arise in certain models of particle physics describing dark matter and could accumulate within neutron stars, modifying some of their properties and gravitational wave emission. Fermion-boson stars have been extensively studied in the static non-rotating case, exploring their combined stability and their gravitational radiation in binary mergers. However, stationary rotating configurations were yet to be found and investigated. The presence of a bosonic component could impact the development of the bar-mode instability in differentially rotating neutron stars. Therefore, the study of rotating fermion-boson stars has important implications for astrophysics, as they could provide a new avenue for the detection of gravitational waves. In addition, these objects may shed light on the behavior of matter under extreme conditions, such as those found in the cores of neutron stars, and explain any tension in the determination of the dense-matter equation of state from multi-messenger observations. In this work we study a new consistent method of constructing uniformly rotating fermion-boson stars and we analyse some of their main properties. These objects might offer alternative explanations for current observations populating the lower black-hole mass gap, as the $2.6 M\\_\\odot$ compact object involved in GW190814.\n\n", "2403.12840": "2024-03-19, **Optical properties of Euler-Heisenberg black hole in the Cold Dark Matter Halo**, Lei You et.al., [2403.12840v1](http://arxiv.org/abs/2403.12840v1)\n\n The optical properties of Euler-Heisenberg (EH) black hole (BH) surrounded by Cold Dark Matter (CDM) halo are investigated. By changing BH's parameters, we found that the radius of horizon r\\_{h} and radius of photon sphere r\\_{ph} will transparently increase as CDM halo parameters R and \\rho increase. To show the influence of CDM halo on the BH's optical characteristics, we took two sets of R and \\rho with prominent differences and plot the first four orders of images for thin accretion disk with different angle of inclination \\theta of observer. The images with light intensity distributions using Novikov-Thorne (N-T) model are also derived, as well as the effective potential, photon orbits. Especially, analysis of intersection behaviors between photon trajectories with different impact parameters and circular time-like orbits in accretion disk will help better understand the image of thin accretion disk. Our results showed that CDM halo will make BH become more larger and dimmer distinctly.\n\n", "2403.13028": "2024-03-19, **Dynamical systems analysis of a cosmological model with interacting Umami Chaplygin fluid in adiabatic particle creation mechanism: Some bouncing features**, Goutam Mandal et.al., [2403.13028v1](http://arxiv.org/abs/2403.13028v1)\n\n The present work aims to investigate an interacting Umami Chaplygin gas in the background dynamics of a spatially flat Friedmann-Lemaitre-Robertson-Walker (FLRW) universe when adiabatic particle creation is allowed. Here, the universe is taken to be an open thermodynamical model where the particle is created irreversibly and consequently, the creation pressure comes into the energy-momentum tensor of the material content. The rate at which the particle created is assumed to have a linear relation with the Hubble parameter and the created particle is dark matter (pressureless). The Umami Chaplygin gas is considered dark energy, pressureless dust is taken as dark matter and a phenomenological interaction term is taken for mathematical simplicity. Dynamical analysis is performed to obtain an overall evolution of the model we consider. The autonomous system is obtained by considering dimensionless variables in terms of cosmological variables. The local stability of the critical points and the classical stability of the model are also performed at each critical point. This study explores some cosmologically viable scenarios when we constrain the model parameters. Some critical points exhibit the accelerated de Sitter expansion of the universe at both the early phase as well as the late phase of evolution which is characterized by completely Umami Chaplygin fluid equation of state. Scaling solutions are also described by some other critical points showing late-time accelerated attractors in phase space satisfying present observational data, and solving the coincidence problem. A unified cosmic evolution is also achieved within this model describing the evolution of the universe starting from inflation to late time acceleration connecting through a matter-dominated intermediate phase. Finally, the non-singular bouncing behavior of the universe is also investigated for this model numerically.\n\n"}, "supernova": {"2403.13723": "2024-03-20, **Examining a hadronic $γ$-ray scenario for the radiative shell & molecular clouds of the old GeV supernova remnant G298.6$-$0.0**, Paul K. H. Yeung et.al., [2403.13723v1](http://arxiv.org/abs/2403.13723v1)\n\n Based on the 13.7~yr Fermi-LAT data, Yeung et al. (2023) claimed detection of two $\\gamma$-ray sources (Src-NE and Src-NW) associated with the supernova remnant (SNR) G298.6$-$0.0, and interpreted it as an old GeV SNR interacting with molecular clouds (MCs). In this follow-up study, we refine the flux measurements below 2~GeV with Fermi-LAT event types of better angular reconstruction. Then, we report our cosmic-ray phenomenology in a hadronic scenario, considering both the shell and MC regions of SNR G298.6$-$0.0. We confirm that both the $\\gamma$-ray spectra of Src-NE and Src-NW exhibit spectral breaks at $1.50\\_{-0.50}^{+0.60}$~GeV and $0.68\\_{-0.11}^{+0.32}$~GeV, respectively. Src-NW has a harder broadband photon index than Src-NE, suggesting an appreciable difference between the physical separations of their respective emission sites from SNR G298.6$-$0.0. The cosmic-ray spectrum responsible for Src-NE starts with a minimum energy $E\\_\\mathrm{CR,min}=1.38\\_{-0.16}^{+0.47}$~GeV, and has a proton index $\\Gamma\\_\\mathrm{CR}=2.57\\_{-0.21}^{+0.18}$ below the exponential cutoff energy $E\\_\\mathrm{CR,max}=240\\_{-150}^{+240}$~GeV. Accordingly, we argue that Src-NE is dominated by the SNR shell, while only a minor portion of lower-energy emission is contributed by the MCs interacting with the SNR. The cosmic-ray population for Src-NW starts at a higher energy such that the $E\\_\\mathrm{CR,min}$ ratio of Src-NW to Src-NE is $\\gtrsim$2. The high $E\\_\\mathrm{CR,min}$, as well as the high cosmic-ray energy density required ($\\sim$26~eV~cm$^{-3}$), supports the interpretation that Src-NW is predominantly the $\\gamma$-ray emission from the farther MCs being bombarded by protons that had earlier escaped from SNR G298.6$-$0.0. By comparing the high-energy features of G298.6$-$0.0 with those of analogical SNRs, especially SNR W28 and SNR W44, we further constrain the age of SNR G298.6$-$0.0 to be 10--30~kyr.\n\n", "2403.13641": "2024-03-20, **Sculpting the Morphology of Supernova Remnant Pa 30 via Efficient Ejecta Cooling**, Paul C. Duffell et.al., [2403.13641v1](http://arxiv.org/abs/2403.13641v1)\n\n We demonstrate in a proof-of-concept numerical hydrodynamics calculation that the narrow radial filamentary structures seen in Pa 30 could be generated through highly efficient cooling (e.g. via line emission) in the ejecta. Efficient cooling in the ejecta causes a drop of pressure support in Rayleigh-Taylor fingers, leading them to be compressed, and suppressing the growth of Kelvin-Helmholtz instability. Following this result, we make three predictions that could determine whether this is the mechanism responsible for shaping Pa 30: First, we predict very strong emission lines, strong enough to cool a significant fraction of the shock energy in an expansion time. Secondly, we predict that the forward shock should be highly corrugated on small scales, with the shock front closely following the structure of the filaments. Third, we predict that these filaments should be nearly ballistic, with velocities around 90% of the free-expansion velocity ($v \\approx 0.9 ~r/t$). These predictions should be falsifiable in follow-up observations of this remnant.\n\n", "2403.13305": "2024-03-20, **Shock and Cosmic Ray Chemistry Associated with the Supernova Remnant W28**, Tian-Yu Tu et.al., [2403.13305v1](http://arxiv.org/abs/2403.13305v1)\n\n Supernova remnants (SNRs) exert strong influence on the physics and chemistry of the nearby molecular clouds (MCs) through shock waves and the cosmic rays (CRs) they accelerate. To investigate the SNR-cloud interaction in the prototype interacting SNR W28 (G6.4$-$0.1), we present new observations of $\\rm HCO^+$, HCN and HNC $J=1\\text{--}0$ lines, supplemented by archival data of CO isotopes, $\\rm N\\_2H^+$ and $\\rm H^{13}CO^+$. We compare the spatial distribution and spectral line profiles of different molecular species. Using local thermodynatic equilibrium (LTE) assumption, we obtain an abundance ratio $N({\\rm HCO^+})/N({\\rm CO})\\sim10^{-4}$ in the northeastern shocked cloud, which is higher by an order of magnitude than the values in unshocked clouds. This can be accounted for by the chemistry jointly induced by shock and CRs, with the physical parameters previously obtained from observations: preshock density $n\\_{\\rm H}\\sim 2\\times 10^{5}\\rm \\ cm^{-3}$, CR ionization rate $\\zeta=2.5\\times 10^{-15} \\rm \\ s^{-1}$ and shock velocity $V\\_{\\rm s}=15\\text{--}20\\rm \\ km\\ s^{-1}$. Towards a point outside the northeastern boundary of W28 with known high CR ionization rate, we estimate the abundance ratio $ N({\\rm HCO^+})/N({\\rm N\\_2H^+}) \\approx 0.6\\text{--}3.3$, which can be reproduced by a chemical simulation if a high density $n\\_{\\rm H}\\sim 2\\times 10^5 \\ \\rm cm^{-3}$ is adopted.\n\n", "2403.13057": "2024-03-19, **Tracing back the birth environments of Type Ia supernova progenitor stars: A pilot study based on 44 early-type host galaxies**, Young-Lo Kim et.al., [2403.13057v1](http://arxiv.org/abs/2403.13057v1)\n\n The environmental dependence of Type Ia supernova (SN Ia) luminosities is well-established, and efforts are being made to find its origin. Previous studies typically use the currently-observed status of the host galaxy. However, given the delay time between the birth of the progenitor star and the SN Ia explosion, the currently-observed status may differ from the birth environments of the SN Ia progenitor star. In this paper, employing the chemical evolution and accurately determined stellar population properties of 44 early-type host galaxies, we, for the first time, estimate the SN Ia progenitor star birth environment, specifically $[Fe/H]\\_{Birth}$ and $[\\alpha/Fe]\\_{Birth}$. We show that $[\\alpha/Fe]\\_{Birth}$ has a $30.4^{+10.6}\\_{-10.1}\\%$ wider range than $[\\alpha/Fe]\\_{Current}$, while the range of $[Fe/H]\\_{Birth}$ is not statistically different ($17.9^{+26.0}\\_{-27.1}\\%$) to that of $[Fe/H]\\_{Current}$. The birth and current environments of [Fe/H] and [$\\alpha$/Fe] are sample from different populations (p-values of the KS test < 0.01). We find that light-curve fit parameters are insensitive to $[Fe/H]\\_{Birth}$ ($<0.9\\sigma$ for the non-zero slope), while a linear trend is observed with HRs at the 2.4$\\sigma$ significance level. With $[\\alpha/Fe]\\_{Birth}$, no linear trends ($<1.1\\sigma$) are observed. Interestingly, we find that $[\\alpha/Fe]\\_{Birth}$ clearly splits the SN Ia sample into two groups: SN Ia exploded in $[\\alpha/Fe]\\_{Birth}$-rich or $[\\alpha/Fe]\\_{Birth}$-poor environments. SNe Ia exploded in different $[\\alpha/Fe]\\_{Birth}$ groups have different weighted-means of light-curve shape parameters: $0.81\\pm0.33$ ($2.5\\sigma$). They are thought to be drawn from different populations (p-value = 0.01). Regarding SN Ia colour and HRs, there is no difference in the weighted-means ($<1.0\\sigma$) and distributions (p-value > 0.27) of each $[\\alpha/Fe]\\_{Birth}$ group.\n\n", "2403.12942": "2024-03-19, **The physics of Core-Collapse Supernovae: explosion mechanism and explosive nucleosynthesis**, Luca Boccioli et.al., [2403.12942v1](http://arxiv.org/abs/2403.12942v1)\n\n Recent developments in multi-dimensional simulations of core-collapse supernovae have considerably improved our understanding of this complex phenomenon. In addition to that, one-dimensional (1D) studies have been employed to study the explosion mechanism and its causal connection to the pre-collapse structure of the star, as well as to explore the vast parameter space of supernovae. Nonetheless, many uncertainties still affect the late stages of the evolution of massive stars, their collapse, and the subsequent shock propagation. In this review, we will briefly summarize the state-of-the-art of both 1D and 3D simulations and how they can be employed to study the evolution of massive stars, supernova explosions, and shock propagation, focusing on the uncertainties that affect each of these phases. Finally, we will illustrate the typical nucleosynthesis products that emerge from the explosion.\n\n", "2403.12932": "2024-03-19, **Revisiting the abundance pattern and charge-exchange emission in the M82 centre**, K. Fukushima et.al., [2403.12932v1](http://arxiv.org/abs/2403.12932v1)\n\n The interstellar medium (ISM) in starburst galaxies contains plenty of chemical elements synthesised by core-collapse supernova explosions. By measuring the abundances of these metals, we can study the chemical enrichment within galaxies and the transportation of metals into circumgalactic environments through powerful outflows. We perform the spectral analysis of the X-ray emissions from the M82 core using the Reflection Grating Spectrometer (RGS) onboard XMM-Newton to accurately estimate the metal abundances in the ISM. We analyse over 300 ks of RGS data observed with fourteen position angles, covering an 80 arcsec cross-dispersion width. We employ multi-temperature thermal plasma components in collisional ionisation equilibrium (CIE) to reproduce the observed spectra, each exhibiting different spatial broadenings. The O vii band CCD image shows a broader distribution compared to those for O viii and Fe-L bands. The O viii line profiles have a prominent double-peaked structure, corresponding to the northward and southward outflows. The O vii triplet feature exhibits marginal peaks, and a single CIE component, convolved with the O vii band image, approximately reproduces the spectral shape. Combining a CIE model with a charge-exchange emission model also successfully reproduces the O vii line profiles. However, the ratio of these two components varies significantly with the observed position angles, which is physically implausible. Spectral fitting of the broadband spectra suggests a multi-temperature phase in the ISM, approximated by three components at 0.1, 0.4, and 0.7 keV. Notably, the 0.1 keV component exhibits a broader distribution than the 0.4 and 0.7 keV plasmas. The derived abundance pattern shows super-solar N/O, solar Ne/O and Mg/O, and half-solar Fe/O ratios. These results indicate the chemical enrichments by core-collapse supernovae in starburst galaxies.\n\n"}}