{"neutrino": {"2508.12987": "2025-08-18, **Transfer Learning for Neutrino Scattering: Domain Adaptation with GANs**, Jose L. Bonilla et.al., [2508.12987v1](http://arxiv.org/abs/2508.12987v1)\n\n We utilize transfer learning to extrapolate the physics knowledge encoded in a Generative Adversarial Network (GAN) model trained on synthetic charged-current (CC) neutrino-carbon inclusive scattering data. This base model is adapted to generate CC inclusive scattering events (lepton kinematics only) for neutrino-argon and antineutrino-carbon interactions. Furthermore, we assess the effectiveness of transfer learning in re-optimizing a custom model when new data comes from a different neutrino-nucleus interaction model. Our results demonstrate that transfer learning significantly outperforms training generative models from scratch. To study this, we consider two training data sets: one with 10,000 and another with 100,000 events. The models obtained via transfer learning perform well even with smaller training data. The proposed method provides a promising approach for constructing neutrino scattering event generators in scenarios where experimental data is sparse.\n\n"}, "dark matter": {"2508.13062": "2025-08-18, **Search for Light Inelastic Dark Matter with Low-Energy Ionization Signatures in PandaX-4T**, Yu-Chen Wang et.al., [2508.13062v1](http://arxiv.org/abs/2508.13062v1)\n\n Direct detection of light dark matter (DM) is generally difficult due to its small recoil energy. The inelastic scattering of DM can produce unique signatures in the DM direct detection experiments. Using the low-energy unpaired ionization data from PandaX-4T, we newly analyze the probe of the exothermic inelastic dark matter (ineDM). We demonstrate that PandaX-4T can probe the ineDM mass-splitting down to 0.05 keV and probe the ineDM mass to the sub-GeV range. For the ineDM with a dark photon mediator, we use the PandaX-4T data to impose stringent bounds on the mixing parameter between the dark photon and photon.\n\n", "2508.12556": "2025-08-18, **Group Therapy for Halos: Advancing Halo Mass Estimation for Galaxy Groups**, Welsey Van Kempen et.al., [2508.12556v1](http://arxiv.org/abs/2508.12556v1)\n\n Accurate estimation of dark matter halo masses for galaxy groups is central to studies of galaxy evolution and for leveraging group catalogues as cosmological probes. We present a calibration and evaluation of two complementary halo mass estimators: a dynamical estimator based on the virial theorem, and an empirical relation between the sum of the stellar masses of the three most massive group galaxies and the halo mass (SHMR). Using state-of-the-art semi-analytic models (SHARK, SAGE, and GAEA) to generate mock light-cone catalogues, we quantify the accuracy, uncertainty, and model dependence of each method. The calibrated virial theorem achieves negligible systematic bias (mean $\\Delta$ = -0.01 dex) and low scatter (mean $\\sigma$ = 0.20 dex) with no sensitivity to baryonic physics. The calibrated SHMR yields the highest precision (mean $\\Delta$ = 0.02 dex, mean $\\sigma$ = 0.14 dex) but shows greater model dependence due to sensitivity to baryonic physics across the models. We demonstrate applications to observational catalogues, including the empirical halo mass function and mapping quenched fractions in the stellar mass-halo mass plane. We provide guidance: the virial theorem is recommended for GAMA-like surveys (i < 19.2) at z < 0.1 where minimal model dependence is required, while the SHMR is optimal for high-precision halo mass estimates across diverse catalogues with limits of z < 0.3. These calibrated estimators will aid upcoming wide-area spectroscopic surveys in probing the connection between galaxies and their host dark matter halos.\n\n"}, "supernova": {"2508.13039": "2025-08-18, **EP250207b is not a collapsar fast X-ray transient. Is it due to a compact object merger?**, P. G. Jonker et.al., [2508.13039v1](http://arxiv.org/abs/2508.13039v1)\n\n Fast X-ray Transients (FXTs) are short-lived extra-galactic X-ray sources. Recent progress through multi-wavelength follow-up of Einstein Probe discovered FXTs has shown that several are related to collapsars, which can also produce gamma-ray bursts (GRBs). In this paper we investigate the nature of the FXT EP250207b. The VLT/MUSE spectra of a nearby (15.9 kpc in projection) lenticular galaxy reveal no signs of recent star formation. If this galaxy is indeed the host, EP250207b lies at a redshift of z=0.082, implying a peak observed absolute magnitude for the optical counterpart of M\\_r=-14.5. At the time when supernovae (SNe) would peak, it is substantially fainter than all SN types. These results are inconsistent with a collapsar origin for EP250207b. The properties favour a binary compact object merger driven origin. The X-ray, optical and radio observations are compared with predictions of several types of extra-galactic transients, including afterglow and kilonova models. The data can be fit with a slightly off-axis viewing angle afterglow. However, the late-time (~30 day) optical/NIR counterpart is too bright for the afterglow and also for conventional kilonova models. This could be remedied if that late emission is due to a globular cluster or the core of a (tidally disrupted) dwarf galaxy. If confirmed, this would be the first case where the multi-wavelength properties of an FXT are found to be consistent with a compact object merger origin, increasing the parallels between FXTs and GRBs. We finally discuss if the source could originate in a higher redshift host galaxy.\n\n", "2508.12933": "2025-08-18, **Stochasticity in Stellar Yields Reflected in Theoretical Dust Masses Estimates Across all Type II Supernova Progenitors**, Archana Purushothaman et.al., [2508.12933v1](http://arxiv.org/abs/2508.12933v1)\n\n Core-collapse supernovae (CCSNe) are among the primary sources of dust in galaxies. In this study, we derive theoretical upper limits on dust masses as a function of supernova (SN) progenitors with initial masses between 9 and 120 Msun, based on previously established models of dust formation chemistry in CCSNe. We find that O-rich dust, particularly silicates, dominates the dust budget, with masses ranging from 0.02 to 0.9 Msun, and that the total mass of O-rich dust increases with progenitor mass. C-rich amorphous carbon dust is significant for lower-mass progenitors (up to 15 Msun), but its mass never exceeds 0.05 Msun. For progenitors up to 30 Msun, we provide best-fit functions describing the masses of O-rich dust, C-rich dust, and CO molecules. A large stochastic variation is found in the predicted masses of silicate dust, which correlates with the randomness of shell-merger events in the pre-explosion phases of massive stars. Furthermore, we show that the dust mass for a given progenitor can vary by a factor of 2-5, reflecting differences in pre-explosion abundance profiles predicted by the stellar evolution codes KEPLER and MESA. We emphasize that the final dust yield in CCSNe is primarily determined by stochastic stellar yields and uncertainties in pre-explosion nucleosynthesis, while explosion properties mainly influence the timescales of dust formation.\n\n", "2508.12721": "2025-08-18, **Runaway stars and the Galactic supernova remnant landscape: non-thermal emission and observational evidence**, Rowan Batzofin et.al., [2508.12721v1](http://arxiv.org/abs/2508.12721v1)\n\n Context. A significant fraction (~30%) of massive stars in our Galaxy are moving supersonically through the interstellar medium, which strongly governs their location at the time they end their lives, e.g. die as a supernova and give birth to a supernova remnant (SNR). These dead stellar environments accelerate particles, emitting by non-thermal mechanisms up to the TeV range, and they are considered as a major contributor to the very-high-energy band of the local cosmic-ray spectrum.   Aims. This study investigates the effect of the runaway motion of supernova progenitors on the spatial distribution of SNRs in the Milky Way and how this influences the deduced properties of the population.   Methods. We construct Galactic populations of SNRs by Monte Carlo simulation, taking into account the bulk motion and the evolution history of their progenitor stars once ejected from their parent clusters. The gamma-ray domain emission of each population is then calculated, to be compared with the High Energy Stereoscopic System (H.E.S.S.) Galactic Plane Survey.   Results. We find that including the runaway motion of supernova progenitors strongly modifies the detectability of the simulated emission of their remnants in the very-high-energy band. Particularly, our best fit model using a Reid Milky Way model for core-collapse supernova progenitors requires 33% of massive runaway stars, which is close to the known fraction of runaway high-mass stars, to be in accordance with the H.E.S.S. Galactic Plane Survey data.   Conclusions. Our results show that the runaway nature of supernova progenitors must be taken into account in the study of the Galactic population of SNRs within the H.E.S.S. Galactic Plane Survey and the forthcoming Galactic Plane Survey of the Cherenkov Telescope Array Observatory, as it is a governing factor of the detectability of non-thermal emission of their subsequent SNRs.\n\n", "2508.12677": "2025-08-18, **The Demographics of Binary Companions to Stripped-Envelope Supernovae: Confronting Observations with Population Synthesis**, E. Zapartas et.al., [2508.12677v1](http://arxiv.org/abs/2508.12677v1)\n\n Stripped-envelope supernovae (SESNe) mark the deaths of massive stars without hydrogen-rich envelopes. Most SESNe likely originate from binary systems where a companion stripped the progenitor of its envelope. Years of HST imaging of nearby SESNe sites have produced a statistically meaningful sample of constraints on surviving binary companions. We assemble the current sample of six companion detections and six non-detections from the literature, re-analyzing whenever needed. We then conduct the first statistical comparison with binary population-synthesis predictions, primarily based on new calculations performed with the POSYDON framework. Across a metallicity range, our models predict that 80-90% of Type Ib/c and 60-85% of IIb SNe explode with a rapidly rotating, main-sequence companion. The observed luminosity distribution favors fairly inefficient mass accretion and failed explosions of the most massive stripped stars. The companion detection fraction broadly matches predictions, given the imaging depth, but appears elevated for Type IIb SNe. In all but one non-detection, a faint, undetected companion is the most likely scenario. The red, apparently evolved companions in a few Type Ib/c SNe may result from strong interaction with the ejecta, expected in $\\sim$12% of them. Companion demographics offer a powerful, independent probe of SESN progenitor systems, with the current sample disfavoring efficient accretion and supporting Wolf-Rayet non-explodability. Larger companion samples and follow-up studies will further clarify binary pathways to SESNe, serving as benchmarks for transient surveys.\n\n", "2508.12529": "2025-08-17, **Mass Loss and Subsequent Thermal Evolution of Surviving Helium White Dwarfs Shocked by Thermonuclear Supernovae**, Tin Long Sunny Wong et.al., [2508.12529v1](http://arxiv.org/abs/2508.12529v1)\n\n Following a type Ia supernova (SN Ia) in a double white dwarf (WD) binary, a surviving WD companion leaves at its orbital velocity $\\approx 1$,000 - 3,000 km/s. The Gaia mission has discovered seven such hypervelocity WDs with inflated radii indicative of shock heating by SN ejecta. We study the interaction between SN ejecta and Roche lobe-filling 0.08 - 0.45 $M\\_{\\odot}$ helium WD companions using three-dimensional hydrodynamical simulations with Athena++. Given the importance of the later thermal evolution, we include an accurate equation-of-state for the degenerate helium WD donor. We show that a lower-mass, larger-radius WD companion is more strongly impacted by SN ejecta and undergoes substantial mass loss. We find a tight relation between the fractional mass loss and the ratio between the ejecta ram pressure and donor volume-averaged pressure, which can be used for predicting mass loss in other systems. In the most extreme case, the companion becomes a very inflated $\\approx0.02\\,M\\_{\\odot}$ object. We find helium mass loss $\\approx 0.005 - 0.06\\,M\\_{\\odot}$ with velocities $\\approx $ 1,000$-$4,000 km/s, which may lead to emission lines in the nebular phase. The surviving helium WD receives a kick velocity, but its final velocity is essentially determined by its orbital velocity $\\lesssim$ 1,600 km/s. We model the post-explosion evolution of the shock-heated companions using MESA, and find reasonable agreement with the hypervelocity stars D6-2, J0546+0836, J1332-3541 & SDSS J1637+3631. A surviving $\\gtrsim 0.3\\,M\\_{\\odot}$ helium WD can be ruled out in SN1972E & SN2011fe, and any surviving helium WD is likely ruled out in SN remnants 0509-67.5 & SN1006.\n\n", "2508.12486": "2025-08-17, **Type IIb Supernova Progenitors in 3D: Variability and Episodic Mass Loss revealed by Radiation-Hydrodynamics Simulations**, Jared A. Goldberg et.al., [2508.12486v1](http://arxiv.org/abs/2508.12486v1)\n\n We present the first 3D Radiation-Hydrodynamics simulations of partially-stripped ($M\\_\\mathrm{core}\\sim10M\\_\\odot$, $M\\_\\mathrm{env}\\sim0.1-1M\\_\\odot$) Yellow Supergiant ($L\\sim10^5$, $T\\_\\mathrm{eff}\\approx5000-8000$K) envelopes, constructed with Athena++. These envelope models represent the progenitors of Type IIb supernovae (SNe-IIb), which have lost a substantial fraction of their H-rich envelope before undergoing core-collapse. The luminosity-to-mass ratio is high in these extended envelopes, and convection is strongly driven by Hydrogen and Helium opacity peaks. This surface convection, coupled with changes in the opacity, sustains large-amplitude low-azimuthal-order radial pulsations, creating order-of-magnitude variability in the stellar luminosity on a timescale of tens of days. If persistent prior to a SN-IIb, these variations could herald the upcoming explosion. Supersonic fluid motions across the outer layers of the star lead to both successful and failed mass ejection events, which shape the circumstellar environment and drive episodic mass loss ($\\sim10^{-6}-10^{-5}M\\_\\odot/$yr, in outbursts). The resulting 3D gas distribution in the outer atmosphere, responsible for early-time supernova shock-breakout and shock-cooling emission, shows orders-of-magnitude fluctuations in both space and time at any given radial location. This intrinsically complex halo of bound and unbound material complicates predictions for early SN-IIb lightcurves relative to spherically-symmetric models. However, it does provide a natural, self-consistent explanation for the presence and diversity of dense circumstellar material observed or inferred around pulsating evolved stars.\n\n", "2508.12337": "2025-08-17, **Detection of young massive white dwarfs in core-collapsed globular cluster NGC 362**, R. K. S. Yadav et.al., [2508.12337v1](http://arxiv.org/abs/2508.12337v1)\n\n Core-collapsed globular clusters are ideal targets to explore the presence of stellar collision products. Here, we have studied seventeen FUV bright white dwarf members in the globular cluster NGC 362 using data obtained from the Ultra Violet Imaging Telescope (UVIT) mounted on AstroSat and from HST. Multi-wavelength spectral energy distributions (SEDs) are analyzed using UV and optical data sets to characterize and determine the parameters of white dwarfs. Fourteen of the white dwarfs fit single-component SEDs well, while three showed a good fit with a two-component SED model,indicating a binary system comprising a white dwarf and a low-mass main-sequence star. The effective temperature, radius, luminosity, and mass of white dwarfs range between 22000 - 70000 K, 0.008 - 0.028 Rsun, 0.09 - 3.0 Lsun, and 0.30 - 1.13 Msun, respectively. The effective temperature, radius, luminosity, and mass of the companions (low-mass main-sequence stars) are 3500 - 3750 K, 0.150 - 0.234 Rsun,0.003 - 0.01 Lsun, and 0.14 - 0.24 Msun, respectively. The three binary systems (WD-MS), along with the massive WDs may have formed through dynamical processes that occurred during the core collapse of the cluster. This is the first evidence of a massive WD formation in a core-collapsed cluster, which is the missing link in the formation of a fast radio burst (FRB) progenitor in a globular cluster. This study provides evidence that NGC 362 hosts stellar systems that may evolve into exotic stars such as Type Ia supernovae, and/or FRBs in the future. *This is paper VI of the Globular Cluster UVIT Legacy Survey.\n\n"}}