{"neutrino": {"2407.15824": "2024-07-22, **Unveiling the Multifaceted GRB 200613A: Prompt Emission Dynamics, Afterglow Evolution, and the Host Galaxy's Properties**, Shao-Yu Fu et.al., [2407.15824v1](http://arxiv.org/abs/2407.15824v1)\n\n We present our optical observations and multi-wavelength analysis of the GRB\\,200613A detected by \\texttt{Fermi} satellite. Time-resolved spectral analysis of the prompt $\\gamma$-ray emission was conducted utilizing the Bayesian block method to determine statistically optimal time bins. Based on the Bayesian Information Criterion (BIC), the data generally favor the Band+Blackbody (short as BB) model. We speculate that the main Band component comes from the Blandford-Znajek mechanism, while the additional BB component comes from the neutrino annihilation process. The BB component becomes significant for a low-spin, high-accretion rate black hole central engine, as evidenced by our model comparison with the data. The afterglow light curve exhibits typical power-law decay, and its behavior can be explained by the collision between the ejecta and constant interstellar medium (ISM). Model fitting yields the following parameters: $E\\_{K,iso} = (2.04^{+11.8}\\_{-1.50})\\times 10^{53}$ erg, $\\Gamma\\_0=354^{+578}\\_{-217}$, $p=2.09^{+0.02}\\_{-0.03}$, $n\\_{18}=(2.04^{+9.71}\\_{-1.87})\\times 10^{2}$ cm$^{-3}$, $\\theta\\_j=24.0^{+6.50}\\_{-5.54}$ degree, $\\epsilon\\_e=1.66^{+4.09}\\_{-1.39})\\times 10^{-1}$ and $\\epsilon\\_B=(7.76^{+48.5}\\_{-5.9})\\times 10^{-6}$. In addition, we employed the public Python package \\texttt{Prospector} perform a spectral energy distribution (SED) modeling of the host galaxy. The results suggest that the host galaxy is a massive galaxy ($\\log(M\\_\\ast / M\\_\\odot)=11.75^{+0.10}\\_{-0.09}$) with moderate star formation rate ($\\mbox{SFR}=22.58^{+13.63}\\_{-7.22} M\\_{\\odot}$/yr). This SFR is consistent with the SFR of $\\sim 34.2 M\\_{\\odot}$ yr$^{-1}$ derived from the [OII] emission line in the observed spectrum.\n\n", "2407.15640": "2024-07-22, **Impacts of dark energy on weighing neutrinos after DESI BAO**, Guo-Hong Du et.al., [2407.15640v1](http://arxiv.org/abs/2407.15640v1)\n\n Recently, DESI has released baryon acoustic oscillation (BAO) data, and DES has also published its five-year supernova (SN) data. These observations, combined with cosmic microwave background (CMB) data, support a dynamically evolving dark energy at a high confidence level. When using cosmological observations to weigh neutrinos, the results of weighing neutrinos will be significantly affected by the measurement of dark energy due to the degeneracy between neutrino mass and the dark-energy equation of state. Therefore, we need to understand how the dynamical evolution of dark energy in the current situation will affect the measurement of neutrino mass. In this work, we utilize these latest observations and other additional distance measurements to discuss the mutual influence between neutrinos and dark energy, then calculate the Bayes factor to compare models. We consider three neutrino mass hierarchies including degenerate hierarchy (DH), normal hierarchy (NH), and inverted hierarchy (IH), as well as three dark energy models including $\\Lambda \\rm CDM$, $w\\rm CDM$, and $w\\_0w\\_a \\rm CDM$ models. Cosmological data combined with the prior of particle physics experiments can provide strong to decisive evidence favoring the $w\\_0w\\_a {\\rm CDM}+\\sum m\\_\\nu$ model with NH. In the $w\\_0w\\_a \\rm CDM$ model, using the CMB+DESI+DESY5 data, we obtain constraints on the total neutrino mass, $\\sum m\\_\\nu<0.171\\ \\rm eV,\\ 0.204\\ \\rm eV,\\ 0.220\\ \\rm eV$, for DH, NH, and IH, respectively. Furthermore, taking into account the neutrino hierarchy or incorporating additional distance measurements results in a more pronounced deviation from the $\\Lambda$CDM model for dark energy. The latter, particularly, exhibits a deviation at a confidence level that surpasses $4\\sigma$.\n\n", "2407.15577": "2024-07-22, **Model-independent analysis of new physics effects in $B\\rightarrow K^*_2(1430)μ^+ μ^-$ decay**, Juhi Vardani et.al., [2407.15577v1](http://arxiv.org/abs/2407.15577v1)\n\n Recently, the LHCb Collaboration provided updated measurements for the lepton flavour ratios $R\\_K$ and $R\\_{K^*}$. The currently observed values align with the predictions of the standard model. In light of these recent updates, our investigation delves into the repercussions of new physics characterized by universal couplings to electrons and muons. We specifically focus on their impact on various observables within the $B\\to K\\_2^*(1430)(\\to K\\pi)\\mu^+ \\mu^-$ decay. These observables include the differential branching ratio, forward-backward asymmetry ($A\\_{FB}$), longitudinal polarization asymmetry ($F\\_L$), and a set of optimized observables ($P\\_i$). Our findings indicate that the branching ratio of $B\\to K\\_2^*(\\to K\\pi)\\mu^+ \\mu^-$ decay can be suppressed up to $25\\%$ for various new physics solutions. Furthermore, all permissible new physics scenarios demonstrate finite enhancement in the muon forward-backward asymmetry $(A\\_{FB})$ as well as an increase in the value of the optimized angular observable $P\\_2$. Moreover, in the presence of new physics zero crossing points for $A\\_{FB}$ and $P\\_2$ shift towards higher $q^2$. The current data have a mild deviation from SM predictions in $P\\_5'$ observable in the low-$q^2$ bin. We also explored massive $Z'$ models, which can generate universal 1D new physics scenarios, characterized by $C\\_9^{NP}<0$, $C\\_9^{NP}=-C\\_{10}^{NP}$, and $C\\_9^{NP}=-C\\_9'$. Using additional constraints coming from $B\\_s-\\overline{B\\_s}$ mixing and neutrino trident process, we find that the conclusions of the model-independent analysis remain valid.\n\n", "2407.15082": "2024-07-21, **Primordial Black Holes and Scalar-induced Gravitational Waves in Sneutrino Hybrid Inflation**, Adeela Afzal et.al., [2407.15082v1](http://arxiv.org/abs/2407.15082v1)\n\n We investigate the possibility that primordial black holes (PBHs) can be formed from large curvature perturbations generated during the waterfall phase transition in a supersymmetric scenario where sneutrino is the inflaton in a hybrid inflationary framework. We obtain a spectral index ($n\\_s \\simeq 0.966$), and a tensor-to-scalar ratio ($r\\simeq 0.0056-10^{-11}$), consistent with the current Planck data satisfying PBH as dark matter (DM) and detectable Gravitational Wave (GW) signal. Our findings show that the mass of PBH and the peak in the GW spectrum is correlated with the right-handed (s)neutrino mass. We identify parameter space where PBHs can be the entire DM candidate of the universe (with mass $10^{-13}\\, M\\_\\odot$) or a fraction of it. This could be tested via second-order GW signals in future observatories, for instance, with amplitude $\\Omega\\_{\\rm GW}h^2$ $\\sim 10^{-9}$ and peak frequency $f\\sim 0.1$ Hz in LISA and $\\Omega\\_{\\rm GW}h^2 \\sim 10^{-11}$ and peak frequency of $\\sim 10$ Hz in ET. %. for sneutrino mass $m\\_{\\phi} \\sim 2\\times 10^{12}$ GeV, $\\beta \\sim 5.4\\times 10^{15}$ GeV. We study two models of sneutrino inflation: Model$-1$ involves canonical sneutrino kinetic term which predicts the sub-Planckian mass parameter $M$, while the coupling between a gauge singlet and the waterfall field, $\\beta$, needs to be quite large whereas, for the model$-2$ involving $\\alpha-$attractor canonical sneutrino kinetic term, $\\beta$ can take a natural value. Estimating explicitly, we show that both models have mild fine-tuning. We also derive an analytical expression for the power spectrum in terms of the microphysics parameters of the model like (s)neutrino mass, etc. that fits well with the numerical results. The typical reheat temperature for both the models is around $10^{7}-10^{8}$~GeV suitable for non-thermal leptogenesis.\n\n"}, "dark matter": {"2407.15813": "2024-07-22, **Gyroscopic stability for nanoparticles in Stern-Gerlach Interferometry and spin contrast**, Tian Zhou et.al., [2407.15813v1](http://arxiv.org/abs/2407.15813v1)\n\n Creating macroscopic spatial quantum superposition with a nanoparticle has a multitude of applications, ranging from testing the foundations of quantum mechanics, matter-wave interferometer for detecting gravitational waves and probing the electromagnetic vacuum, dark matter detection and quantum sensors to testing the quantum nature of gravity in a lab. In this paper, we investigate the role of rotation in a matter-wave interferometer, where we show that imparting angular momentum along the direction of a defect, such as one present in the nitrogen-vacancy centre of a nanodiamond can cause an enhancement in spin contrast for a wide-ranging value of the angular momentum, e.g. $10^{3}-10^{6}$~Hz for a mass of order $10^{-14}-10^{-17}$ Kg nanodiamond. Furthermore, the imparted angular momentum can enhance the spatial superposition by almost a factor of two and possibly average out any potential permanent dipoles in the nanodiamond.\n\n", "2407.15804": "2024-07-22, **Coupled phantom cosmological model motivated by the warm inflationary paradigm**, Sudip Halder et.al., [2407.15804v1](http://arxiv.org/abs/2407.15804v1)\n\n In this article, we investigate a coupled phantom dark-energy cosmological model in which the coupling term between a phantom scalar field with an exponential potential and a pressureless dark-matter fluid is motivated by the warm inflationary paradigm. Using methods of qualitative analysis of dynamical systems, complemented by numerical solutions of the evolution equations, we study the late-time behavior of our model. We show that contrary to the uncoupled scenario, the coupled phantom model admits accelerated scaling solutions. However, they do not correspond to a final state of the universe's evolution and, therefore, cannot be used to solve the cosmological coincidence problem. Furthermore, we show that, for certain coupling parameter values, the total equation-of-state parameter's asymptotic behavior is significantly changed when compared to the uncoupled scenario, allowing for solutions less phantom even for steeper potentials of the phantom scalar field.\n\n", "2407.15529": "2024-07-22, **Environmental effects on Low Surface Brightness Galaxies in the IllustrisTNG simulation**, Luis Enrique Pérez-Montaño et.al., [2407.15529v1](http://arxiv.org/abs/2407.15529v1)\n\n Employing the TNG100 run of the IllustrisTNG project, we characterize the environment of Low Surface Brightness Galaxies (LSBGs) across varying scales, from their associated dark matter halos to their distribution within the broader cosmic structure. We find no significant differences in the halo concentration index $c\\_{200}$ between LSBGs and their High Surface Brightness (HSBGs) counterparts, with LSBGs residing in halos with higher spin parameter $\\lambda$ and slightly more spherical shapes than HSBGs. LSBGs show a stronger alignment between the dark and stellar angular momentum vectors than their high surface brightness counterparts. The relative abundance of LSBGs within groups and clusters displays a central deficit, hinting at potential destruction upon reaching these core regions. Studying the density field, we find a preference for rotation-dominated LSBGs to reside in low-density environments, while dispersion-dominated LSBGs thrive in high-density regions where galaxy interactions govern their evolution, an observation corroborated by our analysis of the two-point correlation function $\\xi (r)$. Our examination of the cosmic web reveals no significant differences in the distance to the closest large-scale structure, barring a few exceptions. This suggests a limited impact of large-scale spatial distribution on mechanisms driving LSBG evolution. All together, we conclude that the halo vicinity and local environment at the scale of galaxy clusters, where mechanisms such as galaxy mergers and tidal stripping, as well as stellar and gas accretion take place, is the most likely environment that favour the emergence of LSBGs with different morphologies, mostly driven by the presence or absence of important local interaction phenomena.\n\n", "2407.15445": "2024-07-22, **Primordial black holes in SB SUSY Gauss-Bonnet inflation**, A. Ashrafzadeh et.al., [2407.15445v1](http://arxiv.org/abs/2407.15445v1)\n\n Here, we explore the formation of primordial black holes (PBHs) within a scalar field inflationary model coupled to the Gauss-Bonnet (GB) term, incorporating low-scale spontaneously broken supersymmetric (SB SUSY) potential. The coupling function amplifies the curvature perturbations, consequently leading to the formation of PBHs and the production of detectable secondary gravitational waves (GWs). Through the adjustment of model parameters, the inflaton can be decelerated during the ultra-slow-roll (USR) phase, thereby augmenting curvature perturbations. Swampland criteria are also investigated. Our computations forecast the formation of PBHs with masses on the order of ${\\cal O}(10)M\\_{\\odot}$, aligning with observational data from LIGO-Virgo and PBHs with masses ${\\cal O}(10^{-6})M\\_{\\odot}$, offering potential explanation for ultrashort-timescale microlensing events recorded in OGLE data. Additionally, our proposed mechanism can generate PBHs with masses around ${\\cal O}(10^{-13})M\\_{\\odot}$, constituting roughly 99$\\%$ of the dark matter. The density parameter of produced GWs ($\\Omega\\_{\\rm GW\\_0}$) intersects with the sensitivity curves of GW detectors. Two cases of our model fall within the nano-Hz regime. One of these satisfies the $\\Omega\\_{\\rm{GW}}(f) \\sim f^{5-\\gamma}$ fit, with the derived $\\gamma = 3.51$ matching the NANOGrav 15-year data.\n\n", "2407.15379": "2024-07-22, **Axion Physics from String Theory: Cosmological Signatures in Dark Matter and Inflation**, Vaidik A Sharma et.al., [2407.15379v1](http://arxiv.org/abs/2407.15379v1)\n\n The quest to understand the nature of dark matter and dark energy motivates a deep exploration into axion physics, particularly within the framework of string theory. Axions, originally proposed to solve the strong CP problem, emerge as compelling candidates for both dark matter and dark energy components of the universe. String theory, offering a unified perspective on fundamental forces, predicts a rich spectrum of axion-like particles (ALPs) arising from its compactification schemes. This paper provides a comprehensive review of axion physics within string theory, detailing their theoretical foundations, emergence from compactification processes, and roles in cosmological models. Key aspects covered include the Peccei-Quinn mechanism, the structure of ALPs, their moduli stabilization, and implications for observational signatures in dark matter, dark energy, and cosmological inflation scenarios. Insights from ongoing experimental efforts and future directions in axion cosmology are also discussed\n\n", "2407.15347": "2024-07-22, **Energy extraction through Comisso-Asenjo process from a Kerr-Newman black hole in perfect fluid dark matter**, Shanshan Rodriguez et.al., [2407.15347v1](http://arxiv.org/abs/2407.15347v1)\n\n In this work, we provide a thorough analysis of energy extraction via magnetic reconnection, a novel mechanism recently proposed by Comisso and Asenjo, for a Kerr-Newman black hole immersed in a perfect fluid dark matter (PFDM) background. Our studies focus on the impact of black hole spin $a$, electric charge $Q$ and PFDM parameter $\\lambda$ on the horizons, ecoregions and circular geodesics at the equatorial plane of this black hole, and how they further influence the reconnection efficiency and energy extraction rate. Our results show that the size of ergoregion does not vary monotonically with increasing dark matter parameters $\\lambda$, but it can significantly increase at faster spins ($a>0.8$) as the dark matter parameter $\\lambda$ decreases, given the electric charge stays within $Q\\in [0.2,0.5]$. We identify the optimal conditions for the combination of $a$, $Q$ and $\\lambda$ that enable efficient energy extraction even when the black hole is not rapidly spinning. The Kerr-Newman black hole in PFDM allows for achieving high energy extraction rates comparable to those of most previously studied rotating black holes, which typically require near-extremal spin to reach similar efficiency levels.\n\n", "2407.15116": "2024-07-21, **Z_5 two-component dark matter in the Type-II seesaw mechanism**, XinXin Qi et.al., [2407.15116v1](http://arxiv.org/abs/2407.15116v1)\n\n We consider the Z5 two-component dark matter model within the framework of the Type-II seesaw mechanism. Due to the new annihilation processes related to triplets, the light component cannot necessarily be dominant in the dark matter relic density, which is different from the Z5 two-component dark matter model in the SM. The model is considered to explain the excess of electron-positron flux measured by the AMS-02 Collaborations in this work, which is encouraged by the decay of the triplets arising from dark matter annihilations in the Galactic halo. We discuss the cases of the light and heavy components determining dark matter density within a viable parameter space satisfying relic density and direct detection constraints, and by fitting the antiproton spectrum observed in the PAMELA and AMS experiments, we find that the parameter space is flexible and the electron-positron flux excess can be obtained in both cases with the mass of two dark matter particles being larger than that of the triplets'.\n\n"}, "supernova": {"2407.15832": "2024-07-22, **Non-minimally coupled gravity as a physically viable fit to DESI 2024 BAO**, Gen Ye et.al., [2407.15832v1](http://arxiv.org/abs/2407.15832v1)\n\n The recent measurements of baryon acoustic oscillations (BAO) from the DESI collaboration have presented an indication for dynamical dark energy, when adopting the $(w\\_0,w\\_a)$ parametrization of the equation of state. The associated posterior constraints imply a crossing of the phantom divide. The latter, however, has profound theoretical implications because not all models can do so without developing incurable instabilities. Simple quintessence models of dark energy, for instance, would be ruled out if such a crossing is confirmed. We perform a non-parametric reconstruction of the equation of state, and confirm that crossing of the phantom divide is required by the DESI BAO data. We then explore the theory space of Horndeski gravity employing a reconstruction method based on the effective field theory of dark energy, and show that for most of the models it is still difficult to safely cross the divide. We identify non-minimal coupling to gravity as the key modification which sustains a stable phantom crossing in the general Horndeski theory space and fits DESI observations. Guided by these insights, we propose the \\textit{Thawing Gravity} model which has the same number of parameters as $w\\_0w\\_a$CDM and naturally realizes non-minimal coupling when dark energy becomes non-negligible. \\textit{Thawing Gravity} improves the fit over $\\Lambda$CDM for DESI BAO, CMB as well as type Ia Supernovae.\n\n", "2407.15768": "2024-07-22, **Early-Time Observations of SN 2023wrk: A Luminous Type Ia Supernova with Significant Unburned Carbon in the Outer Ejecta**, Jialian Liu et.al., [2407.15768v1](http://arxiv.org/abs/2407.15768v1)\n\n We present extensive photometric and spectroscopic observations of the nearby Type Ia supernova (SN) 2023wrk at a distance of about 40 Mpc. The earliest detection of this SN can be traced back to a few hours after the explosion. Within the first few days the light curve shows a bump feature, while the B - V color is blue and remains nearly constant. The overall spectral evolution is similar to that of an SN 1991T/SN 1999aa-like SN Ia, while the C II $\\lambda6580$ absorption line appears to be unusually strong in the first spectrum taken at $t \\approx -$15.4 days after the maximum light. This carbon feature disappears quickly in subsequent evolution but it reappears at around the time of peak brightness. The complex evolution of the carbon line and the possible detection of Ni III absorption around 4700 {\\AA} and 5300 {\\AA} in the earliest spectra indicate macroscopic mixing of fuel and ash. The strong carbon lines is likely related to collision of SN ejecta with unbound carbon, consistent with the predictions of pulsational delayed-detonation or carbon-rich circumstellar-matter interaction models. Among those carbon-rich SNe Ia with strong C II $\\lambda6580$ absorption at very early times, the line-strength ratio of C II to Si II and the B-V color evolution are found to exhibit large diversity, which may be attributed to different properties of unbound carbon and outward-mixing $^{56}$Ni.\n\n", "2407.15767": "2024-07-22, **Reinterpretation of the Fermi acceleration of cosmic rays in terms of the ballistic surfing acceleration in supernova shocks**, Krzysztof Stasiewicz et.al., [2407.15767v1](http://arxiv.org/abs/2407.15767v1)\n\n The applicability of first-order Fermi acceleration in explaining the cosmic ray spectrum has been reexamined using recent results on shock acceleration mechanisms from the Multiscale Magnetospheric mission in Earth's bow shock. It is demonstrated that the Fermi mechanism is a crude approximation of the ballistic surfing acceleration (BSA) mechanism. While both mechanisms yield similar expressions for the energy gain of a particle after encountering a shock once, leading to similar power-law distributions of the cosmic ray energy spectrum, the Fermi mechanism is found to be inconsistent with fundamental equations of electrodynamics.   It is shown that the spectral index of cosmic rays is determined by the average magnetic field compression rather than the density compression, as in the Fermi model. It is shown that the knee observed in the spectrum at an energy of 5x10^{15} eV could correspond to ions with a gyroradius comparable to the size of shocks in supernova remnants. The BSA mechanism can accurately reproduce the observed spectral index s = -2.5 below the knee energy, as well as a steeper spectrum, s = -3, above the knee. The acceleration time up to the knee, as implied by BSA, is on the order of 300 years.   First-order Fermi acceleration does not represent a physically valid mechanism and should be replaced by ballistic surfing acceleration in applications or models related to quasi-perpendicular shocks in space. It is noted that BSA, which operates outside of shocks, was previously misattributed to shock drift acceleration (SDA), which operates within shocks.\n\n", "2407.15639": "2024-07-22, **Best of both worlds: Fusing hyperspectral data from two generations of spectro-imagers for X-ray astrophysics**, Julia Lascar et.al., [2407.15639v1](http://arxiv.org/abs/2407.15639v1)\n\n With the launch of the X-Ray Imaging and Spectroscopy Mission (XRISM) and the advent of microcalorimeter detectors, X-ray astrophysics is entering in a new era of spatially resolved high resolution spectroscopy. But while this new generation of X-ray telescopes have much finer spectral resolutions than their predecessors (e.g. XMM-Newton, Chandra), they also have coarser spatial resolutions, leading to problematic cross-pixel contamination. This issue is currently a critical limitation for the study of extended sources such as galaxy clusters of supernova remnants. To increase the scientific output of XRISM's hyperspectral data, we propose to fuse it with XMM-Newton data, and seek to obtain a cube with the best spatial and spectral resolution of both generations. This is the aim of hyperspectral fusion. In this article, we have implemented an algorithm that jointly deconvolves the spatial response of XRISM and the spectral response of XMM-Newton. To do so, we construct a forward model adapted for instrumental systematic degradations and Poisson noise, then tackle hyperspectral fusion as a regularized inverse problem. We test three methods of regularization: low rank approximation with Sobolev regularization; low rank approximation with 2D wavelet sparsity ; and 2D-1D wavelet sparsity. We test our method on toy models constructed from hydrodynamic simulations of supernova remnants. We find that our method reconstructs the ground truth well even when the toy model is complex. For the regularization term, we find that while the low rank approximation worked well as a spectral denoiser in models with less spectral variability, it introduced a bias in models with more spectral variability, in which case the 2D-1D wavelet sparsity regularization worked best. After demonstrating a proof of concept in this article, we aim to apply this method to real X-ray astrophysical data in the near future.\n\n", "2407.15565": "2024-07-22, **Observational constraints on FLRW, Bianchi type I and V brane models**, R. Jalalzadeh et.al., [2407.15565v1](http://arxiv.org/abs/2407.15565v1)\n\n This study explores the compatibility of Covariant Extrinsic Gravity (CEG) with current cosmological observations. We employ the chi-square statistic and Markov Chain Monte Carlo (MCMC) methods to fit the FLRW and Bianchi type-I and V brane models to the latest datasets, including Hubble, Pantheon+ Supernova samples, Big Bang Nucleosynthesis (BBN), Baryon Acoustic Oscillations (BAO), and the structure growth rate, $f\\sigma\\_8(z)$. Parameters for FLRW universe consist $\\left(\\Omega^{\\text{(b)}}\\_0, \\Omega^{\\text{(cd)}}\\_0, \\Omega^{\\text{(k)}}\\_0, H\\_0, \\gamma, \\sigma\\_8\\right)$, while for the Bianchi model are $\\left(\\Omega^{\\text{(b)}}\\_0, \\Omega^{\\text{(cd)}}\\_0, \\Omega^{{(\\beta)}}\\_0, H\\_0, \\gamma, \\Omega^{(\\theta)}\\_0, \\sigma\\_8\\right)$. We determine the best values for cosmological parameters. For the FLRW model, these values depend on the sign of $\\gamma$: $\\gamma > 0$ yields $\\gamma =0.00008^{+0.00015}\\_{-0.00011}$, and $\\Omega^{\\text{(k)}}\\_0=0.014^{+0.024}\\_{-0.022}$ and $\\gamma < 0$ leads to $\\gamma =-0.0226^{+0.0054}\\_{-0.0062}$, and $\\Omega^{\\text{(k)}}\\_0=0.023^{+0.039}\\_{-0.041}$. In both cases $\\Omega^{\\text{(k)}}\\_0>0$ represents a closed universe. Similarly, for the Bianchi type-V brane model, the parameter values vary with the sign of $\\gamma$, resulting in $\\gamma = 0.00084^{+0.00019}\\_{-0.00021}$, $\\Omega^{(\\beta)}\\_0 =0.0258^{+0.0052}\\_{-0.0063} $, and $\\Omega^{\\theta}\\_0(\\times 10^{-5} ) = 4.19^{+0.67}\\_{-0.75}$ (as with the density parameter of stiff matter) for $\\gamma > 0$, and $\\gamma = -0.00107^{+0.00019}\\_{-0.00020}$, $\\Omega^{(\\beta)}\\_0 = 0.0259^{+0.0050}\\_{-0.0062} $, and $\\Omega^{\\theta}\\_0(\\times 10^{-5} ) = 4.17^{+0.91}\\_{-0.98}$ for $\\gamma < 0$. In both cases $\\Omega^{(\\beta)}\\_0>0$, which represents the Bianchi type-V, because in the Bianchi type-I, $\\beta=0$. Utilizing these obtained best values, we analyze the behavior of key cosmological parameters.\n\n", "2407.15544": "2024-07-22, **Shell mergers in the late stages of massive star evolution: new insight from 3D hydrodynamic simulations**, Federico Rizzuti et.al., [2407.15544v1](http://arxiv.org/abs/2407.15544v1)\n\n One-dimensional (1D) stellar evolution models are widely used across various astrophysical fields, however they are still dominated by important uncertainties that deeply affect their predictive power. Among those, the merging of independent convective regions is a poorly understood phenomenon predicted by some 1D models but whose occurrence and impact in real stars remain very uncertain. Being an intrinsically multi-D phenomenon, it is challenging to predict the exact behaviour of shell mergers with 1D models. In this work, we conduct a detailed investigation of a multiple shell merging event in a 20 M$\\_\\odot$ star using 3D hydrodynamic simulations. Making use of the active tracers for composition and the nuclear network included in the 3D model, we study the merging not only from a dynamical standpoint but also considering its nucleosynthesis and energy generation. Our simulations confirm the occurrence of the merging also in 3D, but reveal significant differences from the 1D case. Specifically, we identify entrainment and the erosion of stable regions as the main mechanisms that drive the merging, we predict much faster convective velocities compared to the mixing-length-theory velocities, and observe multiple burning phases within the same merged shell, with important effects for the chemical composition of the star, which presents a strongly asymmetric (dipolar) distribution. We expect that these differences will have important effects on the final structure of massive stars and thus their final collapse dynamics and possible supernova explosion, subsequently affecting the resulting nucleosynthesis and remnant.\n\n"}}