{"neutrino": {"2404.12316": "2024-04-18, **Neutrinoless double beta decay in the minimal type-I seesaw model: mass-dependent nuclear matrix element, current limits and future sensitivities**, Dong-Liang Fang et.al., [2404.12316v1](http://arxiv.org/abs/2404.12316v1)\n\n In this work we discuss the neutrino mass dependent nuclear matrix element (NME) of the neutrinoless double beta decay process and derive the limit on the parameter space of the minimal Type-I seesaw model from the current available experimental data as well as the future sensitivities from the next-generation experiments. Both the explicit many-body calculations and naive extrapolations of the mass dependent NME are employed in the current work. The uncertainties of the theoretical nuclear structure models are taken into account. By combining the latest experimental data from $^{76}$Ge-based experiments, GERDA and MAJORANA, the $^{130}$Te-based experiment, CUORE and the $^{136}$Xe-based experiments, KamLAND-Zen and EXO-200, the bounds on the parameter space of the minimal Type-I seesaw model are obtained and compared with the limits from other experimental probes. Sensitivities for future experiments utilizing $^{76}$Ge-based (LEGEND-1000), $^{82}$Se-based (SuperNEMO), $^{130}$Te based (SNO+II) and $^{136}$Xe-based (nEXO), with a ten-year exposure, are also derived.\n\n"}, "dark matter": {"2404.12233": "2024-04-18, **Constraining Higgs sectors of BSM models -- the case of 95 GeV \"Higgs\"**, Jan Kalinowski et.al., [2404.12233v1](http://arxiv.org/abs/2404.12233v1)\n\n In view of lack of the direct experimental evidence for a Beyond the Standard Model (BSM) physics, accommodating a SM-like Higgs boson is on the most important constraints that a BSM model must fulfill. Already for some time the FlexibleSUSY spectrum generator generator allowed for a reliable prediction of masses and decay patterns of the BSM Higgs boson in a large class of user defined supersymmetric and non-supersymmetric models. However, no easy way to compare those predictions with experimental data existed. To that end we present here an interface between FlexibleSUSY and HiggsTools, a computer program assessing in a statistically meaningful way consistency of a BSM Higgs sector with experiments.   Motivated by the recent ATLAS and CMS observation of the di-photon excess at a mass of $\\sim$95 GeV we demonstrate the capabilities of our framework by investigating whether the observed low mass excesses around 95 GeV seen in the data can be explained as the lightest scalar of the Minimal R-symmetric Supersymmetric Standard Model, without spoiling the SM-like properties of the second-to-lightest state. We also briefly comment on the light dark matter candidate which is a necessarily ingredient of such a setup.\n\n", "2404.12199": "2024-04-18, **Axion Dark Matter from Heavy Quarks**, Mohammad Aghaie et.al., [2404.12199v1](http://arxiv.org/abs/2404.12199v1)\n\n We propose simple scenarios where the observed dark matter abundance arises from decays and scatterings of heavy quarks through freeze-in of an axion-like particle with mass in the $10 {\\rm \\, keV} - 1 {\\rm \\, MeV}$ range. These models can be tested by future X-ray telescopes, and in some cases will be almost entirely probed by searches for two-body decays $K \\to \\pi + {\\rm invis.}$ at NA62. As a byproduct, we discuss the cancellation of IR divergencies in flavor-violating scattering processes relevant for thermal axion production, and derive the general contribution to axion-photon couplings from all three light quarks.\n\n", "2404.12094": "2024-04-18, **Strange quark matter as dark matter: 40 years later, a reappraisal**, Francesco Di Clemente et.al., [2404.12094v1](http://arxiv.org/abs/2404.12094v1)\n\n Forty years ago, Witten suggested that dark matter could be composed of macroscopic clusters of strange quark matter. This idea was very popular for several years, but it dropped out of fashion once lattice QCD calculations indicated that the confinement/deconfinement transition, at small baryonic chemical potential, is not first order, which seemed to be a crucial requirement in order to produce large clusters of quarks. Here we revisit both the conditions under which strangelets can be produced in the Early Universe and the many phenomenological implications of their existence. Most of the paper discusses the limits on their mass distribution and a possible and simple scheme for their production. Finally, we discuss the most promising techniques to detect this type of objects.\n\n", "2404.12084": "2024-04-18, **Big Bang equivalence of $f(R)$ gravity with no cosmological lithium problem**, Abhijit Talukdar et.al., [2404.12084v1](http://arxiv.org/abs/2404.12084v1)\n\n $f(R)$ gravity is one of the serious alternatives of general relativity having large range of astronomical consequences. In this work, we study Big Bang Nucleosynthesis (BBN) in $f(R)$ gravity theory. We consider modification to gravity due to the existence of primordial black holes in the radiation era which introduce additional degrees of freedom known as scalarons. We calculate the light element abundances by using the BBN code PArthENoPE. It is found that for a range of scalaron mass $(2.2-3.5) \\times 10^4$ eV, the abundance of lithium is lowered by $3-4$ times the value predicted by general relativistic BBN which is a level desired to address the cosmological lithium problem. For the above scalaron mass range helium abundance is within observed bound. However, deuterium abundance is found to be increased by $3-6$ times the observed primordial abundance which calls for high efficiency of stellar formation and evolution processes for destruction of the same. A novel relation between scalaron mass and black hole mass has been used to estimate that the above scalaron mass range corresponds to primordial black holes of sub-planetary mass ($\\sim 10^{19}$ g) serving as one of the potential non-baryonic dark matter candidates. We infer Big Bang equivalence of power law $f(R)$ gravity with primordial black holes.\n\n", "2404.12019": "2024-04-18, **The relic density and temperature evolution of light dark sector**, Xin-Chen Duan et.al., [2404.12019v1](http://arxiv.org/abs/2404.12019v1)\n\n We have developed a set of four fully coupled Boltzmann equations to precisely determine the relic density and temperature of dark matter by including three distinct sectors: dark matter, light scalar, and standard model sectors. The intricacies of heat transfer between DM and the SM sector through a light scalar particle are explored, inspired by stringent experimental constraints on the scalar-Higgs mixing angle and the DM-scalar coupling. Three distinct sectors emerge prior to DM freeze-out, requiring fully coupled Boltzmann equations to accurately compute relic density. Investigation of forbidden, resonance, and secluded DM scenarios demonstrates significant deviations between established methods and the novel approach with fully coupled Boltzmann equations. Despite increased computational demands, this emphasizes the need for improved precision in relic density calculations, underlining the importance of incorporating these equations in comprehensive analyses.\n\n"}, "supernova": {"2404.12002": "2024-04-18, **Comparing the three-dimensional morphological asymmetries in the ejecta of Kepler and Tycho in X-rays**, Adrien Picquenot et.al., [2404.12002v1](http://arxiv.org/abs/2404.12002v1)\n\n Recent simulations have shown that asymmetries in the ejecta distribution of supernova remnants (SNRs) may be a reflection of asymmetries left over from the initial supernova explosion. Thus, SNR studies provide a vital means for testing and constraining model predictions in relation to the distribution of heavy elements, which are key to improving our understanding of the explosion mechanisms in Type Ia supernovae.   The use of a novel blind source separation method applied to the megasecond X-ray observations of the historic Kepler and Tycho supernova remnants has revealed maps of the ejecta distribution. These maps are endowed with an unprecedented level of detail and clear separations from the continuum emission. Our method also provides a three-dimensional (3D) view of the ejecta by individually disentangling red- and blueshifted spectral components associated with images of the Si, S, Ar, Ca, and Fe emission. This approach provides insights into the morphology of the ejecta distribution in those two remnants.   Those mappings have allowed us to thoroughly investigate the asymmetries in the intermediate-mass elements and Fe distribution in two Type Ia supernova remnants. We also compared the results with the core-collapse Cassiopeia A remnant, which we had studied previously. The images obtained confirm, as expected for Type Ia SNRs, that the Fe distribution is mostly closer to the core than that of intermediate-mass elements. They also highlight peculiar features in the ejecta distribution, such as the Fe-rich southeastern knot in Tycho.\n\n", "2404.11892": "2024-04-18, **Dark supernova remnant buried in the Galactic-Centre \"Brick\" G0.253+0.016 revealed by an expanding CO-line bubble**, Yoshiaki Sofue et.al., [2404.11892v1](http://arxiv.org/abs/2404.11892v1)\n\n We performed a $^{12}$CO- and $^{13}$CO($J=1-0$)-line study of the \"Brick\" (G0.253+0.016) in the Galactic Centre (GC) by analyzing the archival data obtained with the Nobeyama 45-m telescope. We present kinematics and molecular gas distributions in the longitude-velocity diagrams, and suggest that the Brick is located along the GC Arm I in the central molecular zone (CMZ) in front of the GC, which yields a distance of 8 kpc and GC radius 0.2 kpc. The major and minor-axis diameters of the Brick are $D\\_x\\times D\\_y=8.4 \\ {\\rm pc} \\times 4.1 \\ {\\rm pc}$, and the scale radius is $r\\_{\\rm bri}=\\sqrt{D\\_x D\\_y}=2.96$ pc. The molecular mass inferred from the CO-line integrated intensity is $M\\_{\\rm brixco} \\sim 5.1\\times 10^4 M\\_\\odot$ for a conversion factor $X\\_{\\rm gc}=1.0\\times 10^{20}$ H$\\_2$ cm$^{-2}$ [K km s$^{-1}$]$^{-1}$, while the Virial mass for the velocity dispersion of $\\sigma\\_v=10.0 $ km s $^{-1}$ is calculated to be $M\\_{\\rm brivir}\\sim 6.8 \\times 10^4 \\ M\\_\\odot$, which yields a new conversion factor of $X\\_{\\rm bri} =1.3\\times 10^{20}$ H$\\_2$ cm$^{-2}$ [K km s$^{-1}$]$^{-1}$. No thermal radio emission indicative of HII region and star formation is found in radio-continuum archive. The Brick's center has a cavity surrounded by a spherical molecular bubble of radius $r\\_{\\rm bub}=1.85$ pc and mass $\\sim 1.7\\times 10^4 M\\_\\odot$ expanding at $v\\_{\\rm exp}=10$ km s$^{-1}$ with kinetic energy of $E\\_0\\sim 1.7\\times 10^{49}$ erg. If the bubble is approximated by an adiabatic spherical shock wave, its age is $t\\sim 2/5 r\\_{\\rm bub}/v\\_{\\rm exp}\\sim 7.2\\times 10^4$ y. We suggest that the bubble will be a dark supernova remnant buried in the dense molecular cloud. The Brick, therefore, experienced massive-star formation followed by a supernova explosion more than $\\sim 10^5$ y ago.\n\n"}}