{"neutrino": {"2303.12055": "2023-03-21, **Cyclotron Radiation Emission Spectroscopy of Electrons from Tritium Beta Decay and $^{83\\rm m}$Kr Internal Conversion**, Project 8 Collaboration et.al., [2303.12055v1](http://arxiv.org/abs/2303.12055v1)\n\n Project 8 has developed a novel technique, Cyclotron Radiation Emission Spectroscopy (CRES), for direct neutrino mass measurements. A CRES-based experiment on the beta spectrum of tritium has been carried out in a small-volume apparatus. We provide a detailed account of the experiment, focusing on systematic effects and analysis techniques. In a Bayesian (frequentist) analysis, we measure the tritium endpoint as $18553^{+18}\\_{-19}$ ($18548^{+19}\\_{-19}$) eV and set upper limits of 155 (152) eV (90% C.L.) on the neutrino mass. No background events are observed beyond the endpoint in 82 days of running. We also demonstrate an energy resolution of $1.66\\pm0.19$ eV in a resolution-optimized magnetic trap configuration by measuring $^{83\\rm m}$Kr 17.8-keV internal-conversion electrons. These measurements establish CRES as a low-background, high-resolution technique with the potential to advance neutrino mass sensitivity.\n\n", "2303.11820": "2023-03-21, **Asymmetric dark matter with a spontaneously broken $U(1)'$: self-interaction and gravitational waves**, Zien Chen et.al., [2303.11820v1](http://arxiv.org/abs/2303.11820v1)\n\n Motivated by the collisionless cold dark matter small scale structure problem, we propose an asymmetric dark matter model where dark matter particle interact with each other via a massive dark gauge boson. This model easily avoid the strong limits from cosmic microwave background (CMB) observation, and have a large parameter space to be consistent with small scale structure data. We focus on a special scenario where portals between dark sector and visible sector are too weak to be detected by traditional methods. We find that this scenario can increase the effective number of neutrinos ($N\\_{\\text{eff}}$).In addition, the spontaneous $U(1)'$ symmetry breaking process, which makes dark gauge boson massive, can generate stochastic gravitational waves with peak frequency around $10^{-6} - 10^{-7} \\text{ Hz}$.\n\n", "2303.11352": "2023-03-20, **Hunting for Neutral Leptons with Ultra-High-Energy Cosmic Rays**, Robert Heighton et.al., [2303.11352v1](http://arxiv.org/abs/2303.11352v1)\n\n Next-generation large-volume detectors, such as GRAND, POEMMA, Trinity, TAROGE-M, and PUEO, have been designed to search for ultra-high-energy cosmic rays (UHECRs) with unprecedented sensitivity. We propose to use these detectors to search for new physics beyond the Standard Model (BSM). By considering the simple case of a right-handed neutrino that mixes exclusively with the active $\\tau$ neutrino, we demonstrate that the existence of new physics can increase the probability for UHECRs to propagate through the Earth and produce extensive air showers that will be measurable soon. We compare the fluxes of such showers that would arise from various diffuse and transient sources of high-energy neutrinos, both in the Standard Model and in the presence of a right-handed neutrino. We show that detecting events with emergence angles $\\gtrsim 10$ deg is promising to probe the existence of BSM physics, and we study the sensitivity of GRAND and POEMMA to do so. In particular, we show that the hypothesis of a right-handed neutrino with a mass of $\\mathcal O(1-16)$ GeV may be probed in the future for mixing angles as small as $\\|U\\_{\\tau N}\\|^2 \\gtrsim 10^{-7}$, thus competing with existing and projected experimental limits.\n\n", "2303.11290": "2023-03-20, **An importance sampling method for Feldman-Cousins confidence intervals**, Lukas Berns et.al., [2303.11290v1](http://arxiv.org/abs/2303.11290v1)\n\n In various high-energy physics contexts, such as neutrino-oscillation experiments, several assumptions underlying the typical asymptotic confidence interval construction are violated, such that one has to resort to computationally expensive methods like the Feldman-Cousins method for obtaining confidence intervals with proper statistical coverage. By construction, the computation of intervals at high confidence levels requires fitting millions or billions of pseudo-experiments, while wasting most of the computational cost on overly precise intervals at low confidence levels. In this work, a simple importance sampling method is introduced which reuses pseudo-experiments produced for all tested parameter values in a single mixture distribution. This results in a significant error reduction on the estimated critical values, especially at high confidence levels, and simultaneously yields a correct interpolation of these critical values between the parameter values at which the pseudo-experiments were produced. The theoretically calculated performance is demonstrated numerically using a simple example from the analysis of neutrino oscillations. The relationship to similar techniques applied in statistical mechanics and $p$-value computations is discussed.\n\n", "2303.11149": "2023-03-20, **Leptogenesis and Neutrinoless Double Beta Decay in the Scotogenic Hybrid Textures of Neutrino Mass Matrix**, Ankush et.al., [2303.11149v2](http://arxiv.org/abs/2303.11149v2)\n\n In our recent work we identify the hybrid textures of neutrino mass matrix which simultaneously account for dark matter (DM) and neutrinoless double beta decay ($0\\nu\\beta\\beta$). We also obtained the bounds on dark matter mass and effective Majorana mass $\\|M\\_{ee}\\|$. In this work we look for those hybrid textures which altogether accounts for DM, $0\\nu\\beta\\beta$ and leptogenesis. We have found correlation of baryon asymmetry of universe $Y$ with dark matter mass $M\\_1$ and effective Majorana mass $\\|M\\_{ee}\\|$. We use experimental bounds on relic density of dark matter ($\\Omega h^2$) and baryon asymmetry of universe to identify the hybrid textures. We found that out of five hybrid textures which simultaneously satisfies the physics observations of the DM and $0\\nu\\beta\\beta$ only three hybrid textures altogether satisfy the DM, $0\\nu\\beta\\beta$ and leptogenesis. It is interesting to note that these three hybrid textures gives lower bound to the effective Majorana mass $\\|M\\_{ee}\\|$ which can be probed in current and future experiments like SuperNEMO, KamLAND-Zen, NEXT, and nEXO (5 year) have sensitivity reaches of 0.05 eV, 0.045 eV, 0.03 eV, and 0.015 eV, respectively.\n\n", "2303.10943": "2023-03-20, **On massive neutral lepton scattering on nucleus**, V. A. Bednyakov et.al., [2303.10943v1](http://arxiv.org/abs/2303.10943v1)\n\n The paper presents a theoretical approach to the description of the relativistic scattering of a massive (neutral) lepton on a nucleus, in which the latter retains its integrity. The measurable cross section of this process includes the elastic (or coherent) contribution, when the nucleus remains in its original quantum state and the inelastic (incoherent) contribution, when the nucleus goes into another (excited) quantum state. Transition from the elastic scattering regime to the inelastic scattering regime is regulated automatically by the dependence of the form factors on the momentum transferred to the nucleus. At small momentum transfers elastic scattering dominates. AS the transferred momentum increases, the contribution of the inelastic scattering increases, and the latter becomes dominant at sufficiently large transferred momenta. The scattering of massive (anti)neutrinos interacting with nucleons through the $V\\mp A$ currents of the Standard Model is considered in detail. Because of the nonzero masses, an additional channel arises for elastic and inelastic scattering of these (anti)neutrinos on nuclei due to the possibility of changing the helicity of these (anti)neutrinos. The expressions obtained for the cross sections are applicable to any precision data analysis involving neutrinos and antineutrinos, especially when non-zero neutrino masses can be taken into account. These expressions can also be used in the analysis of experiments on direct detection of (neutral) massive weakly interacting relativistic dark matter particles since, unlike the generally accepted case, they simultaneously take into account both elastic and inelastic interactions of the particles. The presence of an \"inelastic signal\" with its characteristic signature may be the only registrable evidence of interaction of the dark matter particle with the nucleus.\n\n", "2303.10922": "2023-03-20, **Modular $A_4$ symmetry in 3+1 active-sterile neutrino masses and mixings**, Mayengbam Kishan Singh et.al., [2303.10922v1](http://arxiv.org/abs/2303.10922v1)\n\n Motivated by the significance of modular symmetry in describing neutrino masses and flavor structure, we apply the $A\\_4$ modular symmetry in 3+1 scheme of active-sterile neutrino mixings. Neutrino oscillation observables in 3$\\sigma$ range are successfully reproduced through the vev of the modulus $\\tau$ in normal hierarchy(NH) as well as inverted hierarchy(IH). We have also studied other phenomenologies regarding effective masses $m\\_{\\beta}$ and $m\\_{\\beta\\beta}$ in neutrinoless double beta decay. Mixings between active and sterile neutrinos are analysed in detail and the mixing elements $\\vert V\\_{i4}\\vert $ are found to satisfy the experimental bounds. The best-fit values of the neutrino mixing angles and mass squared differences ratio are determined using minimum $\\chi^2$ analysis. This model predicts best-fit values of the neutrino oscillation observables as $\\sin^2\\theta\\_{23}=0.572$, $ \\sin^2\\theta\\_{12}=0.313$, $\\sin^2\\theta\\_{13}=0.022$ and $r = 0.172$ for NH whereas $\\sin^2\\theta\\_{23}=0.602,$ $\\sin^2\\theta\\_{12}=0.288,$ $ \\sin^2\\theta\\_{13}=0.022$ and $r = 0.172$ for IH. Our analysis is also consistent with the latest Planck cosmological upper bound on the sum of neutrino masses $\\sum m\\_i <0.12$ eV.\n\n", "2303.10892": "2023-03-20, **Comprehensive study of LIV in atmospheric and long-baseline experiments**, Deepak Raikwal et.al., [2303.10892v1](http://arxiv.org/abs/2303.10892v1)\n\n In this paper, we have presented a comprehensive study of Lorentz Invariance Violation (LIV) in the context of atmospheric neutrino experiment ICAL and long-baseline experiments T2HK and DUNE. Our study consists of the full parameter space of the LIV parameters (isotropic), i.e., six CPT violating LIV parameters ($a\\_{\\alpha \\beta}$) and six CPT conserving LIV parameters ($c\\_{\\alpha \\beta}$). In this study, our objective is to calculate the upper bound on all the LIV parameters with respect to the individual experiments and their combination. Our results show that DUNE gives the best sensitivity for the parameters $a\\_{ee}$, $a\\_{e\\mu}$, $a\\_{e\\tau}$ and $a\\_{\\mu\\tau}$ in its 7 years of running whereas ICAL gives the best sensitivity on $a\\_{\\mu\\mu}$, $a\\_{\\mu\\tau}$, $c\\_{ee}$, $c\\_{\\mu \\mu}$, $c\\_{\\tau\\tau}$ and $c\\_{\\mu\\tau}$ in its 10 years of running. For $a\\_{\\tau\\tau}$, the sensitivity of DUNE and ICAL is similar. The combination of T2HK, DUNE and ICAL, gives the best sensitivity for $a\\_{e\\mu}$ and $a\\_{ee}$ with respect to all the existing bounds in the literature. For the CPT even diagonal parameters (isotropic) $c\\_{ee}$ and $c\\_{\\mu\\mu}$, our work provides the first ever bounds.\n\n"}, "dark matter": {"2303.11861": "2023-03-21, **Dark Matter Minihalos from Primordial Magnetic Fields**, Pranjal Ralegankar et.al., [2303.11861v1](http://arxiv.org/abs/2303.11861v1)\n\n Primordial magnetic fields (PMF) can enhance baryon perturbations on scales below the photon mean free path. However, a magnetically driven baryon fluid becomes turbulent near recombination, thereby damping out baryon perturbations below the turbulence scale. In this letter, we show that the growth of baryon perturbations is imprinted in the dark matter perturbations, which are unaffected by turbulence and eventually collapse to form $10^{-11}-10^3\\ M\\_{\\odot}$ dark matter minihalos. In the process, we analytically derive the evolution of the PMF power spectrum in the viscous drag regime. If the magnetic fields purportedly detected in the blazar observations are PMFs generated after inflation and have a Batchelor spectrum, then such PMFs should also produce minihalos.\n\n", "2303.11824": "2023-03-21, **On the simulation of gravitational lensing**, Hans Georg Schaatun et.al., [2303.11824v1](http://arxiv.org/abs/2303.11824v1)\n\n Gravitational lensing refers to the deflection of light by the gravity of celestial bodies, often predominantly composed of dark matter. Seen through a gravitational lens, the images of distant galaxies appear distorted. In this paper we discuss simulation of the image distortion by gravitational lensing. The objective is to enhance our understanding of how gravitational lensing works through a simple tool to visualise hypotheses. The simulator can also generate synthetic data for the purpose of machine learning, which will hopefully allow us to invert the distortion function, something which is not analytically possible at present.\n\n", "2303.11792": "2023-03-21, **Searching for Time-Dependent Axion Dark Matter Signals in Pulsars**, R. A. Battye et.al., [2303.11792v1](http://arxiv.org/abs/2303.11792v1)\n\n Axion dark matter can be converted into photons in the magnetospheres of neutron stars leading to a spectral line centred on the Compton wavelength of the axion. Due to the rotation of the star and the plasma effects in the magnetosphere the signal is predicted to be periodic with significant time variation - a unique smoking gun for axion dark matter. As a proof of principle and to develop the methodology, we carry out the first time domain search of the signal using data from PSR J2144$-$3933 taken as part of the MeerTIME project on MeerKAT telescope. We search for specific signal templates using a matched filter technique and discuss when a time-domain analysis (as is typically the case in pulsar observations) gives greater sensitivity to the axion-coupling to photons in comparison to a simple time-averaged total flux study. We do not find any candidate signals and, hence, impose an upper limit on the axion-to-photon coupling of $g\\_{a\\gamma\\gamma}<4\\times 10^{-11}\\,{\\rm GeV}^{-1}$ over the mass range $m\\_{\\rm a}=3.9-4.7\\,\\mu{\\rm eV}$ using this data. This limit relies on PSR J2144$-$3933 not being an extremely aligned rotator, as strongly supported by simple arguments based on the observed pulse profile width. We discuss the possibilities of improving this limit using future observations with MeerKAT and also SKA1-mid and the possibility of using other objects. Finally, to evade modelling uncertainties in axion radio signals, we also carry out a generic ``any periodic-signal search\" in the data, finding no evidence for an axion signal.\n\n", "2303.11677": "2023-03-21, **Exact solution of Kerr-like traversable wormhole in dark matter halo**, Zhaoyi Xu et.al., [2303.11677v1](http://arxiv.org/abs/2303.11677v1)\n\n Dark matter halos are common in galaxies and globular clusters, making it possible to use dark matter density profiles to construct transverse wormholes. In reference [1], an approximate solution of the traversable wormhole satisfying the isotropic pressure condition is constructed by using the dark matter density profile. However, approximate solutions limit the discussion of traversable wormholes to a large extent. In this work, we construct the exact solution of the traversable wormhole in the case of rotation in the dark matter halo. We have written analytical expressions for the Kerr-like traversable wormhole metric for the dark matter density profile in galaxies corresponding to different dark matter models, respectively. These rotating traversable wormholes are jointly determined by the dark matter characteristic density and the scale radius. At the same time, we have also analyzed the energy conditions satisfied by these rotationally traversable wormholes.\n\n", "2303.11645": "2023-03-21, **On the possibility of mixed axion/neutralino dark matter in specific SUSY DFSZ axion models**, Zhong-Jun Yang et.al., [2303.11645v1](http://arxiv.org/abs/2303.11645v1)\n\n We introduce four supersymmetric (SUSY) axion models in which the strong CP problem and the $\\mu$ problem are solved with the help of the Peccei-Quinn mechanism and the Kim-Nilles mechanism, respectively. The axion physics enriches the SUSY model by introducing axion as a dark matter candidate and, therefore, the lightest supersymmetric particle (LSP) could just be a part of the total dark matter. For this reason, axion relieves the tensions between SUSY models and numerous experimental measurements, such as the dark matter direct detection experiments and the precise measurements of anomalous magnetic moment of the muon $a\\_\\mu$. In the present paper, we consider the constraints from the latest $a\\_\\mu$ data and the XENON-1T bound on the relic density of higgsino-like LSP, and discuss the possibility that axion is the rest of dark matter. We study the production mechanism for axion, and it turns out that the conventional misalignment mechanism can give the correct dark matter relic density observed by the Planck satellite.\n\n", "2303.11441": "2023-03-20, **The bar rotation rate as a diagnostic of dark matter content in the centre of disc galaxies**, C. Buttitta et.al., [2303.11441v1](http://arxiv.org/abs/2303.11441v1)\n\n We investigate the link between the bar rotation rate and dark matter content in barred galaxies by concentrating on the cases of the lenticular galaxies NGC4264 and NGC4277. These two gas-poor galaxies have similar morphologies, sizes, and luminosities. But, NGC4264 hosts a fast bar, which extends to nearly the corotation, while the bar embedded in NGC4277 is slow and falls short of corotation. We derive the fraction of dark matter $f\\_{\\rm DM, bar}$ within the bar region from Jeans axisymmetric dynamical models by matching the stellar kinematics obtained with the MUSE integral-field spectrograph and using SDSS images to recover the stellar mass distribution. We build mass-follows-light models as well as mass models with a spherical halo of dark matter, which is not tied to the stars. We find that the inner regions of NGC4277 host a larger fraction of dark matter ($f\\_{\\rm DM, bar} = 0.53 \\pm 0.02$) with respect to NGC4264 ($f\\_{\\rm DM, bar} = 0.33 \\pm 0.04$) in agreement with the predictions of theoretical works and the findings of numerical simulations, which have found that fast bars live in baryon-dominated discs, whereas slow bars experienced a strong drag from the dynamical friction due to a dense DM halo. This is the first time that the bar rotation rate is coupled to $f\\_{\\rm DM, bar}$ derived from dynamical modelling.\n\n", "2303.11368": "2023-03-20, **A Bayesian Approach To The Halo-Galaxy-SMBH Connection Through Cosmic Time**, Christopher Boettner et.al., [2303.11368v1](http://arxiv.org/abs/2303.11368v1)\n\n We study the co-evolution of dark matter halos, galaxies and supermassive black holes using an empirical galaxy evolution model from $z=0$ -- $10$. We demonstrate that by connecting dark matter structure evolution with simple empirical prescriptions for baryonic processes, we are able to faithfully reproduce key observations in the relation between galaxies and their supermassive black holes. By assuming a physically-motivated, direct relationship between the galaxy and supermassive black hole properties to the mass of their host halo, we construct expressions for the galaxy stellar mass function, galaxy UV luminosity function, active black hole mass function and quasar bolometric luminosity function. We calibrate the baryonic prescriptions using a fully Bayesian approach in order to reproduce observed population statistics. The obtained parametrizations are then used to study the relation between galaxy and black hole properties, as well as their evolution with redshift. The galaxy stellar mass -- UV luminosity relation, black hole mass -- stellar mass relation, black hole mass -- AGN luminosity relation, and redshift evolution of these quantities obtained from the model are qualitatively consistent with observations. Based on these results, we present upper limits on the expected number of sources for $z=5$ up to $z=15$ for scheduled JWST and \\textit{Euclid} surveys, thus showcasing that empirical models can offer qualitative as well as quantitative prediction in a fast, easy and flexible manner that complements more computationally expensive approaches.\n\n", "2303.11363": "2023-03-20, **The Strong Force meets the Dark Sector: a robust estimate of QCD uncertainties for anti-matter dark matter searches**, Adil Jueid et.al., [2303.11363v1](http://arxiv.org/abs/2303.11363v1)\n\n In dark-matter annihilation channels to hadronic final states, stable particles -- such as positrons, photons, antiprotons, and antineutrinos -- are produced via complex sequences of phenomena including QED/QCD radiation, hadronisation, and hadron decays. These processes are normally modelled by Monte Carlo event generators whose limited accuracy imply intrinsic QCD uncertainties on the predictions for indirect-detection experiments like Fermi-LAT, Pamela, IceCube or AMS-02. In this article, we perform a complete analysis of QCD uncertainties in antimatter spectra from dark-matter annihilation, based on parametric variations of the Pythia 8 event generator. After performing several retunings of light-quark fragmentation functions, we define a set of variations that span a conservative estimate of the QCD uncertainties. We estimate the effects on antimatter spectra for various annihilation channels and final-state particle species, and discuss their impact on fitted values for the dark-matter mass and thermally-averaged annihilation cross section. We find dramatic impacts which can go up to $\\mathcal{O}(40)$ GeV for uncertainties on the dark-matter mass and up to $\\mathcal{O}(10\\%)$ for the annihilation cross section. We provide the spectra in tabulated form including QCD uncertainties and code snippets to perform fast dark-matter fits, in this https://github.com/ajueid/qcd-dm.github.io.git repository.\n\n", "2303.11360": "2023-03-20, **The massive relic galaxy NGC 1277 is dark matter deficient. From dynamical models of integral-field stellar kinematics out to five effective radii**, Sébastien Comerón et.al., [2303.11360v1](http://arxiv.org/abs/2303.11360v1)\n\n According to the $\\Lambda$CDM cosmology, present-day massive galaxies should contain a sizable fraction of dark matter within their stellar body. Models indicate that in massive early-type galaxies (ETGs) with $M\\_\\star\\approx1.5\\times10^{11}\\,{\\rm M}\\_\\odot$ dark matter should account for $\\sim60\\%$ of the dynamical mass within five effective radii ($5\\,R\\_{\\rm e}$). Most massive ETGs have been shaped through a two-phase process: the rapid growth of a compact core was followed by the accretion of an extended envelope through mergers. The exceedingly rare galaxies that have avoided the second phase, the so-called relic galaxies, are thought to be the frozen remains of the massive ETG population at $z\\gtrsim2$. The best relic galaxy candidate discovered to date is NGC 1277, in the Perseus cluster. We used deep integral field GCMS data to revisit NGC 1277 out to an unprecedented radius of 6 kpc (corresponding to $5\\,R\\_{\\rm e}$). By using Jeans anisotropic models we find a negligible dark matter fraction within $5\\,R\\_{\\rm e}$ ($f\\_{\\rm DM}(5\\,R\\_{\\rm e})<0.07$; two-sigma confidence level), which is in strong tension with the $\\Lambda$CDM expectation. Since the lack of an extended envelope would reduce dynamical friction and prevent the accretion of an envelope, we propose that NGC 1277 lost its dark matter very early or that it was dark matter deficient ab initio. We discuss our discovery in the framework of recent proposals suggesting that some relic galaxies may result from dark matter stripping within galaxy clusters. Alternatively, NGC 1277 might have been born in a high-velocity collision of gas-rich proto-galactic fragments, where dark matter left behind a disc of dissipative baryons. We speculate that the relative velocities of $\\sim2000\\,{\\rm km\\,s^{-1}}$ required for the latter process to happen were possible in the progenitors of the present-day rich galaxy clusters.\n\n", "2303.11353": "2023-03-20, **Bimetric-Affine Quadratic Gravity**, Ioannis D. Gialamas et.al., [2303.11353v1](http://arxiv.org/abs/2303.11353v1)\n\n Bimetric gravity, is a theory of gravity that posits the existence of two interacting and dynamical metric tensors. The spectrum of bimetric gravity consists of a massless and a massive spin-2 particle. The form of the interactions between the two metrics $g\\_{\\mu\\nu}$ and $f\\_{\\mu\\nu}$ is constrained by requiring absence of the so called Boulware-Deser ghost. In this work we extend the original bimetric theory to its bimetric-affine counterpart, in which the associated two connections, $\\Gamma\\_{ \\mu\\,\\,\\,\\nu}^{\\,\\,\\,\\rho}(g)$ and $\\widetilde{\\Gamma}\\_{ \\mu\\,\\,\\,\\nu}^{\\,\\,\\,\\rho}(f)$, are treated as independent variables. We examine in detail the case of an additional quadratic in the Ricci scalar curvature term $\\mathcal{R}^2(g)$ and we find that this theory is free of ghosts for a wide range of the interaction parameters, not excluding the possibility of a Dark Matter interpretation of the massive spin-2 particle.\n\n", "2303.11354": "2023-03-20, **Limits on Dark Matter Annihilation from the Shape of Radio Emission in M31**, Mitchell J. Weikert et.al., [2303.11354v1](http://arxiv.org/abs/2303.11354v1)\n\n Well-motivated scenarios of thermally-produced dark matter often result in a population of electrons and positrons within galaxies produced through dark matter annihilation -- often in association with high-energy gamma rays. As they diffuse through galactic magnetic fields, these $e^\\pm$ produce synchrotron radio emission. The intensity and morphology of this signal depends on the properties of the interstellar medium through which the $e^\\pm$ propagate. Using observations of the Andromeda Galaxy (M31) to construct a model of the gas, magnetic fields, and starlight, we set constraints on dark matter annihilation to $b\\bar{b}$ using the morphology of 3.6 cm radio emission. As the emission signal at the center of M31 is very sensitive to the diffusion coefficient and dark matter profile, we base our limits on the differential flux in the region between $0.9-6.9$ kpc from the center. We exclude annihilation cross sections $\\gtrsim 3 \\times 10^{-25}$ cm$^3$/s in the mass range $10-500$ GeV, with a maximum sensitivity of $7\\times 10^{-26}$ cm$^3$/s at $20-40$ GeV. Though these limits are weaker than those found in previous studies of M31, they are robust to variations of the diffusion coefficient.\n\n", "2303.11344": "2023-03-20, **Absorption of Vector Dark Matter Beyond Kinetic Mixing**, Gordan Krnjaic et.al., [2303.11344v1](http://arxiv.org/abs/2303.11344v1)\n\n Massive vector particles are minimal dark matter candidates that motivate a wide range of laboratory searches, primarily exploiting a postulated kinetic mixing with the photon. However, depending on the high energy field content, the dominant vector dark matter (VDM) coupling to visible particles may arise at higher operator dimension, motivating efforts to predict direct detection rates for more general interactions. Here we present the first calculation of VDM absorption through its coupling to electron electric (EDM) or magnetic (MDM) dipole moments, which can be realized in minimal extensions to the Standard Model and yield the observed abundance through a variety of mechanisms across the eV\\,-\\,MeV mass range. We compute the absorption rate of the MDM and EDM models for a general target, and then derive direct detection constraints from targets currently in use: Si and Ge crystals and Xe and Ar atoms. We find that current experiments are already sensitive to VDM parameter space corresponding to a cosmological freeze-in scenario, and future experiments will be able to completely exclude MDM and EDM freeze-in models with reheat temperatures below the electroweak scale. Additionally, we find that while constraints on the MDM interaction can be related to constraints on axion-like particles, the same is not true for the EDM model, so the latter absorption rate must be computed from first principles. To achieve this, we update the publicly available program EXCEED-DM to perform these new calculations.\n\n", "2303.11094": "2023-03-20, **Does gravitational confinement sustain flat galactic rotation curves without dark matter?**, W. E. V. Barker et.al., [2303.11094v1](http://arxiv.org/abs/2303.11094v1)\n\n The short answer is $\\textit{probably no}$. Specifically, this paper considers a recent body of work which suggests that general relativity requires neither the support of dark matter halos, nor unconventional baryonic profiles, nor any infrared modification, to be consistent after all with the anomalously rapid orbits observed in many galactic discs. In particular, the gravitoelectric flux is alleged to collapse nonlinearly into regions of enhanced force, in an analogue of the colour-confining chromoelectric flux tube model which has yet to be captured by conventional post-Newtonian methods. However, we show that the scalar gravity model underpinning this proposal is wholly inconsistent with the nonlinear Einstein equations, which themselves appear to prohibit the linear confinement-type potentials which could indicate a disordered gravitational phase. Our findings challenge the fidelity of the previous Euclidean lattice analyses. We confirm by direct calculation using a number of perturbation schemes and gauges that the next-to-leading order gravitoelectric correction to the rotation curve of a reasonable baryonic profile would be imperceptible. The `gravitoelectric flux collapse' programme was also supported by using intragalactic lensing near a specific galactic baryon profile as a field strength heuristic. We recalculate this lensing effect, and conclude that it has been overstated by three orders of magnitude. As a by-product, our analysis suggests fresh approaches to (i) the fluid ball conjecture and (ii) gravitational energy localisation, both to be pursued in future work. In summary, whilst it may be interesting to consider the possibility of confinement-type effects in gravity, we may at least conclude here that confinement-type effects $\\textit{cannot play any significant part}$ in explaining flat or rising galactic rotation curves without dark matter halos.\n\n", "2303.11058": "2023-03-20, **Revisiting Puffy Dark Matter with Novel Insights: Partial Wave Analysis**, Wenyu Wang et.al., [2303.11058v1](http://arxiv.org/abs/2303.11058v1)\n\n We present a comprehensive study on the self-interaction cross-section of puffy dark matter (DM) particles, which have a significant intrinsic size compared to their Compton wavelength. For such puffy DM self-interaction cross-section in the resonant and classical regimes, our study demonstrates the significance of the Yukawa potential and the necessity of partial wave analysis: (i) Due to the finite-size effect of puffy DM particles, the new Yukawa potential of puffy DM is found to enlarge the Born-effective regime for the self-interaction cross-section, compared with the point-like DM; (ii) Our partial wave analysis shows that depending on the value of the ratio between $R\\_{\\chi}$ (radius of a puffy DM particle) and $1/m\\_{\\phi}$ (force range), the three regimes (Born-effective, resonant and classical) for puffy DM self-interaction cross-section can be very different from the point-like DM; (iii) We find that to solve the small-scale anomalies via self-interacting puffy DM, the Born-effective and the resonant regimes exist for dwarf galaxies, while for the cluster and Milky Way galaxy the non-Born regime is necessary.\n\n", "2303.11955": "2023-03-20, **Interacting cosmic strings and Dark matter-For the case of missing stars**, Natarajan Shriethar et.al., [2303.11955v1](http://arxiv.org/abs/2303.11955v1)\n\n This work discusses a few theories including the interaction of dark matter, cosmic strings, and locally coupled dark energy. The paper also examines mathematical models used to describe the pressure and density within a star, including the polytropic relationship and the Lane-Emden equation. Simulation results from the IllustrisTNG datasets are also presented, providing insights into the interacting dark matter solutions. With the derived solutions this paper, it explores the possible causes for the sudden disappearance of the star PHL293B-LBV\n\n", "2303.10887": "2023-03-20, **Physical evolution of dark matter halo around the depletion boundary**, Hongyu Gao et.al., [2303.10887v1](http://arxiv.org/abs/2303.10887v1)\n\n We investigate the build-up of the halo profile out to large scale in a cosmological simulation, focusing on the roles played by the recently proposed depletion radii. We explicitly show that halo growth is accompanied by the depletion of the environment, with the inner depletion radius demarcating the two. This evolution process is also observed via the formation of a trough in the bias profile, with the two depletion radii identifying key scales in the evolution. The ratio between the inner depletion radius and the virial radius is approximately a constant factor of 2 across redshifts and halo masses. The ratio between their enclosed densities is also close to a constant of 0.18. These simple scaling relations reflect the largely universal scaled mass profile on these scales, which only evolves weakly with redshift. The overall picture of the boundary evolution can be broadly divided into three stages according to the maturity of the depletion process, with cluster halos lagging behind low mass ones in the evolution. We also show that the traditional slow and fast accretion dichotomy of halo growth can be identified as accelerated and decelerated depletion phases respectively.\n\n"}, "supernova": {"2303.11395": "2023-03-20, **Axion-sourced fireballs from supernovae**, Melissa Diamond et.al., [2303.11395v1](http://arxiv.org/abs/2303.11395v1)\n\n New feebly interacting particles would emerge from a supernova core with 100-MeV-range energies and produce $\\gamma$-rays by subsequent decays. These would contribute to the diffuse cosmic $\\gamma$-ray background or would have shown up in the Solar Maximum Mission (SMM) satellite from SN~1987A. However, we show for the example of axion-like particles (ALPs) that, even at distances beyond the progenitor star, the decay photons may not escape, and can instead form a fireball, a plasma shell with $T\\lesssim 1$ MeV. Thus, existing arguments do not exclude ALPs with few 10 MeV masses and a two-photon coupling of a few $10^{-10}~{\\rm GeV}^{-1}$. However, the energy would have showed up in sub-MeV photons, which were not seen from SN 1987A in the Pioneer Venus Orbiter (PVO), closing again this new window. A careful re-assessment is required for other particles that were constrained in similar ways.\n\n", "2303.11393": "2023-03-20, **Short-lived radioisotope enrichment in star-forming regions from stellar winds and supernovae**, Richard J. Parker et.al., [2303.11393v1](http://arxiv.org/abs/2303.11393v1)\n\n The abundance of the short-lived radioisotopes 26-Al and 60-Fe in the early Solar system is usually explained by the Sun either forming from pre-enriched material, or the Sun's protosolar disc being polluted by a nearby supernova explosion from a massive star. Both hypotheses suffer from significant drawbacks: the former does not account for the dynamical evolution of star-forming regions, while in the latter the time for massive stars to explode as supernovae can be similar to, or even longer than, the lifetime of protoplanetary discs. In this paper, we extend the disc enrichment scenario to include the contribution of 26-Al from the winds of massive stars before they explode as supernovae. We use N-body simulations and a post-processing analysis to calculate the amount of enrichment in each disc, and we vary the stellar density of the star-forming regions. We find that stellar winds contribute to disc enrichment to such an extent that the Solar system's 26-Al/60-Fe ratio is reproduced in up to 50 per cent of discs in dense (rho = 1000Msun pc^-3) star-forming regions. When winds are a significant contributor to the SLR enrichment, we find that Solar system levels of enrichment can occur much earlier (before 2.5 Myr) than when enrichment occurs from supernovae, which start to explode at later ages (>4 Myr). We find that Solar system levels of enrichment all but disappear in low-density star-forming regions (rho < 10Msun pc^-3), implying that the Solar system must have formed in a dense, populous star-forming region if 26-Al and 60-Fe were delivered directly to the protosolar disc from massive-star winds and supernovae.\n\n", "2303.11115": "2023-03-20, **Radio and infrared study of the supernova remnant candidate HESS J1912+101**, Laura Duvidovich et.al., [2303.11115v1](http://arxiv.org/abs/2303.11115v1)\n\n Aims: We provide new insights into the gamma-ray emission from HESS J1912+101, a TeV supernova remnant candidate probably associated with the radio pulsar PSR J1913+1011. Methods: We obtained new observations at 1.5 GHz using the VLA in the D configuration, with the purpose of detecting the radio shell of the putative remnant. In addition, we observed a single pointing at 6.0 GHz toward PSR J1913+1011 to look for a radio pulsar wind nebula. We also studied the properties of the surrounding interstellar medium using data of the 13CO, HI, and infrared emissions, obtained from public surveys. Results: We did not find evidence of a radio shell down to the sensitivity of the new image at 1.5 GHz. We detect faint diffuse emission around PSR J1913+1011 at 6.0 GHz, which could represent a radio pulsar wind nebula powered by the pulsar. We find dense ambient gas at 60 km/s, which shows a good spatial correspondence with the TeV emission only in the western and eastern directions. There is also dense gas near the center of HESS J1912+101, where the TeV emission is weak. Using infrared data, we identify an active star-forming region in the western part of the shell. Conclusions: Based on the poor spatial match between the ambient gas and the TeV emission (which shows a good correlation in the western and eastern directions and an anticorrelation in the other directions), we conclude that the hadronic mechanism alone does not give a satisfactory explanation of the gamma rays from HESS J1912+101. Additional contributions may come from leptonic processes in the shell of the supernova remnant, together with contributions from PSR J1913$+$1011 and its pulsar wind nebula and/or from the star-forming region. A confident determination of the distance to the putative remnant is necessary to determine whether these sources are associated or just appear superimposed in the line of sight.\n\n", "2303.10884": "2023-03-20, **Anisotropic Universe in $f(Q,T)$ gravity, a novel study**, Tee-How Loo et.al., [2303.10884v1](http://arxiv.org/abs/2303.10884v1)\n\n $f(Q,T)$ theory of gravity is very recently proposed to incorporate within the action Lagrangian, the trace $T$ of the energy-momentum tensor along with the non-metricity scalar $Q$. The cosmological application of this theory in a spatially flat isotropic and homogeneous Universe is well-studied. However, our Universe is not isotropic since the Planck era and therefore to study a complete evolution of the Universe we must investigate the $f(Q,T)$ theory in a model with a small anisotropy. This motivated us to presume a locally rotationally symmetric (LRS) Bianchi-I spacetime and derive the motion equations. We analyse the model candidate $f(Q,T)=\\alpha Q^{n+1}+\\beta T$, and to constrain the parameter $n$, we employ the statistical Markov chain Monte Carlo (MCMC) method with the Bayesian approach using two independent observational datasets, namely, the Hubble datasets, and Type Ia supernovae (SNe Ia) datasets.\n\n"}}