{"neutrino": {"2409.08280": "2024-09-12, **Revisiting primordial neutrino asymmetries, spectral distortions and cosmological constraints with full neutrino transport**, Yuan-Zhen Li et.al., [2409.08280v1](http://arxiv.org/abs/2409.08280v1)\n\n The primordial neutrino asymmetry leave profound imprints on the evolution history of the universe, which can be constrained by cosmological observations, including Big Bang Nucleosynthesis (BBN), Cosmic Microwave Background (CMB), and Large-Scale Structure (LSS). We present comprehensive analysis on implications and constraints of the primordial neutrino asymmetry $\\xi\\_\\nu$, based on a precise treatment of neutrino decoupling by solving the complete (anti)neutrino quantum kinetic equations in the Closed-Time-Path formalism. The effective number of neutrinos $ N\\_{\\rm eff}$ and (anti)neutrino spectral distortions are calculated, and we find that the non-instantaneous decoupling correction is given by $\\delta N\\_{\\rm eff} = 0.0440 + 0.0102 \\, \\xi\\_\\nu^2$. Then we perform the state-of-the-art calculation for the abundance of light elements including (anti)neutrino spectral distortions, which indicate a positive asymmetry $0.032 \\leq \\xi\\_\\nu \\leq 0.052$ from EMPRESS data. The implications of the neutrino asymmetry for the CMB and LSS are studied in detail, and we find that the Baryon Acoustic Oscillations (BAO) are also significantly affected by $\\xi\\_\\nu$ in addition to the sum of neutrino masses. A combined analysis with EMPRESS BBN, Planck CMB and BOSS BAO data yields a tighter constraint $\\xi\\_\\nu = 0.024 \\pm 0.013$, which provides constraints on UV models capable of producing large asymmetries.\n\n", "2409.08178": "2024-09-12, **Insights from Binary Pulsars and Laboratories into Baryon Number Violation: Implications for GeV Dark Matter**, Rouzbeh Allahverdi et.al., [2409.08178v1](http://arxiv.org/abs/2409.08178v1)\n\n Rare processes in laboratory and within astrophysical environments can be highly sensitive probes of baryon-number violating interactions at the TeV scale. We demonstrate the power of neutron stars to constrain baryon number violation by considering a minimal extension of the standard model involving a TeV-mass scalar mediator and a GeV scale Majorana fermion $\\psi$. We find that a $\\Delta B = 2$ mass-loss process in binary pulsar systems via $n \\to \\gamma \\psi$ and the subsequent scattering $\\psi n \\to \\pi^- K^+$ places stringent constraints on the model parameter space. These limits will become much stronger, due to the possibility of $\\Lambda \\rightarrow \\gamma \\psi$ decays at the tree level, if the neutron star equation of state is hyperonic. We compare these constraints with ongoing and future collider experiments, $n-\\bar{n}$ oscillations, and dinucleon decay searches at future large-scale neutrino experiments, finding that the binary pulsars bounds on couplings are significantly tighter for specific flavor combinations.\n\n", "2409.07768": "2024-09-12, **Enhancing Direct Detection of Higgsino Dark Matter**, Peter W. Graham et.al., [2409.07768v1](http://arxiv.org/abs/2409.07768v1)\n\n While much supersymmetric WIMP parameter space has been ruled out, one remaining important candidate is Higgsino dark matter. The Higgsino can naturally realize the ``inelastic dark matter\" scenario, where the scattering off a nucleus occurs between two nearly-degenerate states, making it invisible to WIMP direct detection experiments if the splitting is too large to be excited. It was realized that a ``luminous dark matter\" detection process, where the Higgsino upscatters in the Earth and subsequently decays into a photon in a large neutrino detector, offers the best sensitivity to such a scenario. We consider the possibility of adding a large volume of a heavy element, such as Pb or U, around the detector. We also consider the presence of U and Th in the Earth itself, and the effect of an enhanced high-velocity tail of the dark matter distribution due to the presence of the Large Magellanic Cloud. These effects can significantly improve the sensitivity of detectors such as JUNO, SNO+, and Borexino, potentially making it possible in the future to cover much of the remaining parameter space for this classic SUSY WIMP dark matter.\n\n", "2409.07634": "2024-09-11, **ARA-Next: a new DAQ and trigger architecture for the Askaryan Radio Array**, Pawan Giri et.al., [2409.07634v1](http://arxiv.org/abs/2409.07634v1)\n\n The Askaryan Radio Array (ARA) experiment aims to detect ultra-high-energy cosmic neutrinos (>10 PeV) using radio detection techniques. To enhance ARA's capabilities, a new RFSoC-based DAQ, ARA-Next, is in the early stages of development. This advanced system will facilitate the creation of sophisticated triggers, including a novel multi-trigger approach, similar to those used in collider experiments. Our approach involves crafting and implementing innovative triggers for ARA's new DAQ, such as identifying double pulses from potential in-ice neutrino interactions, utilizing templates for atmospheric cosmic ray signals, optimizing triggers for astrophysical neutrino sources, correlating special events between ARA and IceCube, and discerning anthropogenic events using directional information. These trigger designs aim to lower thresholds and enhance ARA's detector sensitivity. Overall, this upgrade will not only enhance ARA's capabilities but also contribute to the technological advancements necessary for future experiments of this nature.\n\n", "2409.07511": "2024-09-11, **Initial performance of the Radar Echo Telescope for Cosmic Rays, RET-CR**, P. Allison et.al., [2409.07511v1](http://arxiv.org/abs/2409.07511v1)\n\n The Radar Echo Telescope for Cosmic Rays (RET-CR), a pathfinder instrument for the radar echo method of ultrahigh energy (UHE) neutrino detection, was initially deployed near Summit Station, Greenland, in May 2023. After a 4 week commissioning period, 9 days of data were taken before the instrument went offline. In this article, we describe the instrument as it was deployed, and the initial performance of the detector. We show that the technical aspects of running a radar based particle cascade detector in the ice have been demonstrated. Analysis of the 2023 data informed improvements that were incorporated into the May-August 2024 deployment, which has just concluded at time of writing. Results from the 2024 run will be presented in forthcoming publications.\n\n", "2409.07430": "2024-09-11, **Measuring the weak mixing angle at SBND**, Gustavo F. S. Alves et.al., [2409.07430v1](http://arxiv.org/abs/2409.07430v1)\n\n The weak mixing angle provides a sensitive test of the Standard Model. We study SBND's sensitivity to the weak mixing angle using neutrino-electron scattering events. We perform a detailed simulation, paying particular attention to background rejection and estimating the detector response. We find that SBND can provide a reasonable constraint on the weak mixing angle, achieving 8% precision for $10^{21}$ protons on target, assuming an overall flux normalization uncertainty of 10%. This result is superior to those of current neutrino experiments and is relatively competitive with other low-energy measurements.\n\n", "2409.07378": "2024-09-11, **How new physics affects primordial neutrinos decoupling: Direct Simulation Monte Carlo approach**, Maksym Ovchynnikov et.al., [2409.07378v1](http://arxiv.org/abs/2409.07378v1)\n\n Cosmological observations from Big Bang Nucleosynthesis and the Cosmic Microwave Background (CMB) offer crucial insights into the Early Universe, enabling us to trace its evolution back to lifetimes as short as 0.01 seconds. Upcoming CMB spectrum measurements, such as those underway at the Simons Observatory, will achieve unprecedented precision, allowing for more accurate extraction of information about the properties of the primordial plasma and, in particular, primordial neutrinos. This provides an opportunity to test whether these properties align with the predictions of the standard cosmological model or indicate the presence of new physics that influenced the evolution of the MeV-temperature plasma. A key component in understanding how new physics may have affected primordial neutrinos is solving the neutrino Boltzmann equation. In this paper, we present a novel approach to solving this equation that offers model independence, transparency, and computational efficiency - features that current state-of-the-art methods lack. We demonstrate a proof-of-concept implementation and apply it to several toy scenarios, showcasing key aspects of the primordial plasma's evolution in the presence of new physics.\n\n", "2409.07184": "2024-09-11, **Muon anomalous magnetic moment and Right handed sterile neutrino**, Iman Motie et.al., [2409.07184v1](http://arxiv.org/abs/2409.07184v1)\n\n The muon's magnetic moment is a fundamental quantity in particle physics and the deviation of its value from quantum electrodynamics (QED), motivates research beyond the standard models (SM). In this study, we utilize the effective coupling of right-handed sterile neutrinos with SM gauge bosons to calculate the muon anomalous magnetic moment ($\\boldsymbol{\\mu}$AMM) at one-loop level. The contribution of the sterile neutrino interactions on the $\\boldsymbol{\\mu}$AMM is calculated by considering the standard and non-standard neutrino interactions. Our results show that the standard sterile neutrino interactions give a negligible contribution to $\\Delta a\\_{\\boldsymbol{\\mu}}$ while the non-standard neutrino interactions can play a significant role in explaining the muon $(g-2)$ anomaly. In the context of the non-standard neutrino interaction, our calculation shows that a Dirac mass scale $M\\_D$ around $100\\,\\text{GeV}$ could explain the muon anomaly if the right handed sterile neutrino's coupling with SM particles is about $\\mathcal{G}\\_R\\approx 10^{-3}$. We have also plotted the allowed region of the model parameters that satisfy the experimental data on $\\Delta a\\_{{\\boldsymbol{\\mu}}}^{SN}$ and discuss the percentage of the ${\\boldsymbol{\\mu}}$ anomaly compensation in terms of the coupling constant $\\mathcal{G}\\_R$.\n\n", "2409.07157": "2024-09-11, **Finite Energy Resolution, Correlations Between Bins and Non-Nested Hypotheses**, Emilio Ciuffoli et.al., [2409.07157v1](http://arxiv.org/abs/2409.07157v1)\n\n We show that whenever independent events are binned, there is no correlation between bins. In particular, neither the uncertainty in the energy resolution nor a systematic error in the energy response of a detector will lead to a correlation between bins. This is in contrast with a result that recently appeared in the literature, where it was claimed that the finite energy resolution could induce correlation between bins, changing the distribution of $\\Delta\\chi^2$ when attempting to determine the neutrino mass ordering using reactor neutrinos. We will compute the expression for the variance of $\\Delta\\chi^2$ in the case of non-nested hypotheses if correlations between bins are present, showing that they could indeed affect the distribution. We will also show, however, that the detector response cannot introduce statistical correlations between bins unless these are already present in the original spectrum. Both of these results are valid in general: the absence of correlation is true for any detector response and the distribution of $\\Delta\\chi^2$ in the presence of (intrinsic) correlations, while obtained having the mass ordering in mind, it is true for any non-nested hypotheses.\n\n", "2409.07120": "2024-09-11, **Experimental Summary of the Moriond 2024 conference -- Electroweak Interaction & Unified Theories**, Barbara Clerbaux et.al., [2409.07120v1](http://arxiv.org/abs/2409.07120v1)\n\n The proceeding gives a summary of the experimental results presented at the Moriond 2024 conference (electroweak interactions and unified theory session), focussing on the latest measurements. A variety of topics were covered in the various sessions of the conference including H boson properties, measurements in the electroweak and top quark sectors, flavour and neutrino physics, searches for dark matter and physics beyond the standard model, as well as astroparticle and precision physics.\n\n"}, "dark matter": {"2409.08129": "2024-09-12, **Can millicharge be probed at future Super Tau Charm Facility via mono-$π^0$ searches?**, Yu Zhang et.al., [2409.08129v1](http://arxiv.org/abs/2409.08129v1)\n\n We propose a new channel to search for millicharged particles at the future Super Tau Charm Facility (STCF) via mono-$\\pi^0$ signature. For the first time, we compute the mono-$\\pi^0$ signal events at the future STCF due to millicharged particle production, as well as due to standard model irreducible/reducible backgrounds. By utilizing the assumed 20 ab$^{-1}$ luminosity for each running energy with $\\sqrt{s}= 2$ GeV, 4 GeV and 7 GeV, we derive the corresponding upper limits on millicharge, respectively. Via mono-$\\pi^0$ searches at the future STCF with $\\sqrt{s}=2$ GeV, the upper limits on millicharge can be improved than ArgoNeuT when the mass of millicharged particle is less than about 500 MeV, but are not very competitive compared to a latest derivation from a past BEBC experiment and a new SENSEI experiment. Regardless, the mono-$\\pi^0$ searches could be an important complement to investigate the invisible particles, such as dark matter.\n\n", "2409.07976": "2024-09-12, **Constraints on the Primordial Black Hole Abundance through Scalar-Induced Gravitational Waves from Advanced LIGO and Virgo's First Three Observing Runs**, Yang Jiang et.al., [2409.07976v1](http://arxiv.org/abs/2409.07976v1)\n\n As a promising dark matter candidate, primordial black holes (PBHs) lighter than $\\sim10^{-18}M\\_{\\odot}$ are supposed to have evaporated by today through Hawking radiation. This scenario is challenged by the memory burden effect, which suggests that the evaporation of black holes may slow down significantly after they have emitted about half of their initial mass. We explore the astrophysical implications of the memory burden effect on the PBH abundance by today and the possibility for PBHs lighter than $\\sim10^{-18}M\\_{\\odot}$ to persist as dark matter. Our analysis utilizes current LIGO-Virgo-KAGRA data to constrain the primordial power spectrum and infers the PBH abundance. We find a null detection of scalar-induced gravitational waves that accompanied the formation of the PBHs. Then we place an upper limit on the primordial power spectrum and the PBH abundance to be $f\\_{\\mathrm{pbh}}\\simeq0.3$ for PBHs with masses $\\sim10^{-24}M\\_{\\odot}$. Furthermore, we expect that next-generation gravitational wave detectors, such as the Einstein Telescope and the Cosmic Explorer, will provide even more stringent constraints. Our results indicate that future detectors can reach sensitivities that could rule out PBH as dark matter within $\\sim[10^{-29}M\\_{\\odot},10^{-19}M\\_{\\odot}]$ in the null detection of scalar-induced gravitational waves.\n\n", "2409.07856": "2024-09-12, **Merger of massive galaxy cluster CL0238.3+2005 at z~0.4: just after pericenter passage?**, N. Lyskova et.al., [2409.07856v1](http://arxiv.org/abs/2409.07856v1)\n\n Massive clusters of galaxies are very rare in the observable Universe. Even rarer are mergers of such clusters observed close to pericenter passage. Here, we report on one such case: a massive (~ $10^{15}\\,M\\_\\odot$) and hot (kT ~ 10 keV) cluster CL0238.3+2005 at $z\\approx 0.42$. For this cluster, we combine X-ray data from SRG/eROSITA and Chandra, optical images from DESI, and spectroscopy from BTA and RTT-150 telescopes. The X-ray and optical morphologies suggest an ongoing merger with the projected separation of subhalos of $\\sim 200$ kpc. The line-of-sight velocity of galaxies tentatively associated with the two merging halos differs by 2000-3000 km/s. We conclude that, most plausibly, the merger axis is neither close to the line of sight nor to the sky plane. We compare CL0238 with two well-known clusters MACS0416 and Bullet, and conclude that CL0238 corresponds to an intermediate phase between the pre-merging MACS0416 cluster and the post-merger Bullet cluster. Namely, this cluster has recently (only $\\lesssim 0.1$ Gyr ago) experienced an almost head-on merger. We argue that this \"just after\" system is a very rare case and an excellent target for lensing, Sunyaev-Zeldovich effect, and X-ray studies that can constrain properties ranging from dynamics of mergers to self-interacting dark matter, and plasma effects in intracluster medium that are associated with shock waves, e.g., electron-ion equilibration efficiency and relativistic particle acceleration.\n\n", "2409.07851": "2024-09-12, **Multi-component dark matter and Galactic 511 keV $γ$-ray emission**, Sarif Khan et.al., [2409.07851v1](http://arxiv.org/abs/2409.07851v1)\n\n We study multi-component dark matter scenarios and the Galactic 511 keV $\\gamma$-ray emission line signal in the framework of a local, dark $U(1)\\_D$ extension of the Standard Model. A light vector dark matter particle associated with the dark $U(1)\\_D$ may decay and annihilate to electron-positron pairs. The produced positrons may in turn form positroniums that subsequently annihilate to two photons, accounting for the observed line signal of the Galactic 511 keV $\\gamma$-ray emission. Three scenarios are investigated. First, we consider the minimal $U(1)\\_D$ extension where a dark gauge boson and a dark Higgs boson are newly introduced to the particle content. As a second scenario, we consider WIMP-type dark matter with the introduction of an extra dark fermion which, in addition to the dark gauge boson, may contribute to the dark matter relic abundance. It is thus a multi-component dark matter scenario with a UV-complete dark $U(1)\\_D$ symmetry. In particular, the vector dark matter may account for a small fraction of the total dark matter relic abundance. Finally, we consider the scenario where the dark matter particles are of the FIMP-type. In this case, both the light vector and fermion dark matter particles may be produced via the freeze-in and super-WIMP mechanisms. Considering theoretical and observational constraints, we explore the allowed parameter space where the Galactic 511 keV $\\gamma$-ray line signal and the dark matter relic can both be explained. We also discuss possible observational signatures.\n\n", "2409.07688": "2024-09-12, **Charged Higgs Boson Phenomenology in the Dark Z mediated Fermionic Dark Matter Model**, Kyu Jung Bae et.al., [2409.07688v1](http://arxiv.org/abs/2409.07688v1)\n\n We study the phenomenology of the charged Higgs boson, $H^\\pm$,appearing in the fermionic dark matter model mediated by the dark $Z$ boson. This model is in favor of the light dark $Z$ boson, $Z'$, and the light additional neutral Higgs boson, $h$. We find that $H^\\pm \\to W^\\pm h$ and the $H^\\pm \\to W^\\pm Z'$ are dominant decay channels. Thus the promising final states are trilepton signals, $e \\mu \\mu$ or $\\mu \\mu \\mu$ following $Z' \\to \\mu^+ \\mu^-$ decays and leptonic decays of the $W^\\pm$ boson. The charged Higgs boson will be produced from the top quark decays $t \\to b H^\\pm$ following $t \\bar{t}$ production, if $H^\\pm$ is light. Whereas $H^\\pm$ is heavier than the top quark, the dominant production processes are associated productions with either $Z'$ or $h$, $pp \\to W^\\star \\to H^\\pm h$ and $pp \\to W^\\star \\to H^\\pm Z'$. We explore the discovery potential of the charged Higgs boson at the LHC. We also discuss the implications of dark matter in relation with the charged Higgs phenomenology.\n\n", "2409.07553": "2024-09-11, **The assembly of the most rotationally supported disc galaxies in the TNG100 simulations**, Silvio Rodriguez et.al., [2409.07553v1](http://arxiv.org/abs/2409.07553v1)\n\n Disc dominated galaxies can be difficult to accommodate in a hierarchical formation scenario like $\\Lambda$CDM, where mergers are an important growth mechanism. However, observational evidence indicates that these galaxies are common. We seek to characterise the conditions that lead to the formation of disc dominated galaxies within $\\Lambda$CDM. We use dynamical decomposition in all galaxies with stellar mass $M\\_*=[10^{10} \\rm - 10^{11}]\\; \\rm M\\_\\odot$ within the simulation Illustris TNG100. We select a sample of 43 mostly-disc galaxies having less than $\\sim 10\\%$ of their mass into a bulge component. For comparison, we also study two additional stellar-mass matched samples: 43 intermediate galaxies having $\\sim 30\\%$ of their mass in the bulge and 43 with purely spheroidal-like morphology. We find that the selection based on stellar dynamics is able to reproduce the expected stellar population trends of different morphologies, with higher star-formation rates and younger stars in disc-dominated galaxies. Halo spin seems to play no role in the morphology of the galaxies. At fixed $M\\_*$, our mostly-disc and intermediate samples form in dark matter haloes that are $2$-$10$ times less massive than the spheroidal sample, highlighting a higher efficiency in disc galaxies to retain and condensate their baryons. On average, mergers are less prevalent in the build up of discs than in spheroidal galaxies, but there is a large scatter, including the existence of mostly-disc galaxies with $15\\%$-$30\\%$ of their stars from accreted origin. Discs start forming early on, settling their low vertical velocity dispersion as early as $9$-$10$ Gyr ago, although the dominance of the disc over the spheroid gets established more recently ($3$-$4$ Gyr ago). The most rotationally supported discs form in haloes with the lowest mass in the sample and best aligned distribution of angular momentum in the gas.\n\n", "2409.07528": "2024-09-11, **Euclid preparation. Deep learning true galaxy morphologies for weak lensing shear bias calibration**, Euclid Collaboration et.al., [2409.07528v1](http://arxiv.org/abs/2409.07528v1)\n\n To date, galaxy image simulations for weak lensing surveys usually approximate the light profiles of all galaxies as a single or double S\\'ersic profile, neglecting the influence of galaxy substructures and morphologies deviating from such a simplified parametric characterization. While this approximation may be sufficient for previous data sets, the stringent cosmic shear calibration requirements and the high quality of the data in the upcoming Euclid survey demand a consideration of the effects that realistic galaxy substructures have on shear measurement biases. Here we present a novel deep learning-based method to create such simulated galaxies directly from HST data. We first build and validate a convolutional neural network based on the wavelet scattering transform to learn noise-free representations independent of the point-spread function of HST galaxy images that can be injected into simulations of images from Euclid's optical instrument VIS without introducing noise correlations during PSF convolution or shearing. Then, we demonstrate the generation of new galaxy images by sampling from the model randomly and conditionally. Next, we quantify the cosmic shear bias from complex galaxy shapes in Euclid-like simulations by comparing the shear measurement biases between a sample of model objects and their best-fit double-S\\'ersic counterparts. Using the KSB shape measurement algorithm, we find a multiplicative bias difference between these branches with realistic morphologies and parametric profiles on the order of $6.9\\times 10^{-3}$ for a realistic magnitude-S\\'ersic index distribution. Moreover, we find clear detection bias differences between full image scenes simulated with parametric and realistic galaxies, leading to a bias difference of $4.0\\times 10^{-3}$ independent of the shape measurement method. This makes it relevant for stage IV weak lensing surveys such as Euclid.\n\n", "2409.07515": "2024-09-11, **Anomalous Ionization in the Central Molecular Zone by sub-GeV Dark Matter**, Pedro De la Torre Luque et.al., [2409.07515v1](http://arxiv.org/abs/2409.07515v1)\n\n We demonstrate that the anomalous ionization rate observed in the Central Molecular Zone can be attributed to MeV dark matter annihilations into $e^+e^-$ pairs for galactic dark matter profiles with slopes $\\gamma>1$. The low annihilation cross-sections required avoid cosmological constraints and imply no detectable inverse Compton, bremsstrahlung or synchrotron emissions in radio, X and gamma rays. The possible connection to the source of the unexplained 511 keV line emission in the Galactic Center suggests that both observations could be correlated and have a common origin.\n\n", "2409.07328": "2024-09-11, **Effects of Dark Matter on the Spontaneous Scalarization in Neutron Stars**, Fahimeh Rahimi et.al., [2409.07328v1](http://arxiv.org/abs/2409.07328v1)\n\n Dark matter, an important portion of compact objects, can influence different phenomena in neutron stars. The spontaneous scalarization in the scalar-tensor gravity has been proposed for neutron stars. Here, we investigate the spontaneous scalarization in dark matter admixed neutron stars. Applying the dark matter equations of state, we calculate the structure of scalarized neutron stars containing dark matter. The dark matter equations of state are based on observational data from the rotational curves of galaxies and the fermionic self-interacting dark matter. Our results verify that the spontaneous scalarization is affected by the dark matter pressure in neutron stars. Depending on the central density of scalarized dark matter admixed neutron stars, the dark matter pressure alters the central scalar field. The increase of dark matter pressure in low-density scalarized stars amplifies the central scalar field. However, the pressure of dark matter in high-density scalarized stars suppresses the central scalar field. Our calculations confirm that the stars in the merger event GW170817 and in the low-mass X-ray binary 4U 1820-30 can be scalarized dark matter admixed neutron stars.\n\n", "2409.07290": "2024-09-11, **PSZ2 G282.28+49.94, a recently discovered analogue of the famous Bullet Cluster**, I. Bartalucci et.al., [2409.07290v1](http://arxiv.org/abs/2409.07290v1)\n\n We present a detailed study of the gas and galaxy properties of the cluster PSZ2 G282.28+49.94 detected in the Planck all-sky survey. The intracluster medium (ICM) of this object at z=0.56 exhibits a cometary-like shape. Combining Chandra and TNG observations, we characterised the spatially resolved thermodynamical properties of the gas and the spatial and velocity distribution of 73 galaxy members. The cluster structure is quite complex with an elongated core region containing the two brightest cluster galaxies and one dense group to the south-east. Since there is no velocity difference between the core and the south-east group, we suggest the presence of a merger along the plane of the sky. This structure is related to complex X-ray and radio features, and thus the merger has likely been caught during the post-merger phase. Comparing the distribution of the ICM and of member galaxies, we find a large offset of $\\sim 350$ kpc between the position of the X-ray peak and the centre of a concentration of galaxies, preceding it in the likely direction of motion. This configuration is similar to the famous Bullet Cluster, leading us to dub PSZ2 G282.28+49.94 the \"Planck bullet\", and represents an ideal situation to provide astrophysical constraints to the self-interaction cross-section ($\\sigma/m$) of dark matter particles. These results illustrate the power of a multi-wavelength approach to probe the merging scenario of such complex and distant systems.\n\n"}, "supernova": {"2409.07905": "2024-09-12, **Supernova remnants in clumpy medium: A model of hydrodynamic and radio synchrotron evolution**, Petar Kostić et.al., [2409.07905v1](http://arxiv.org/abs/2409.07905v1)\n\n We present an analytical model of $\\Sigma-D$ relation for supernova remnants (SNRs) evolving in a clumpy medium. The model and its approximations were developed using the hydrodynamic simulations of SNRs in environments of low-density bubbles and clumpy media with different densities and volume-filling factors. For calculation of SNR luminosities we developed the synchrotron emission model, implying the test-particle approximation. The goal of this work is to explain the flattened part of $\\Sigma-D$ relation for Galactic SNRs at $D\\approx14-50$ pc. Our model shows that the shock collision with the clumpy medium initially enhances the brightness of individual SNRs, which is followed by a steeper fall of their $\\Sigma-D$ curve. We used the analytical model to generate large SNR samples on $\\Sigma-D$ plane, within a span of different densities and distances to clumpy medium, keeping the observed distribution of diameters. After comparison with the Galactic sample, we conclude that the observed $\\Sigma-D$ flattening and scatter originates in sporadic emission jumps of individual SNRs while colliding with the dense clumps. Statistically, the significant impact of the clumps starts at diameters of $\\approx14$ pc, up to $\\sim70$ pc, with the average density jump at clumpy medium of $\\sim2-20$ times, roughly depending on the low density of circumstellar region. However, additional analysis considering the selection effects is needed, as well as the improvement of the model, considering radiation losses and thermal conduction.\n\n", "2409.07729": "2024-09-12, **An Integral-Based Technique (IBT) to Accelerate the Monte-Carlo Radiative Transfer Computation for Supernovae**, Xingzhuo Chen et.al., [2409.07729v1](http://arxiv.org/abs/2409.07729v1)\n\n We present an integral-based technique (IBT) algorithm to accelerate supernova (SN) radiative transfer calculations. The algorithm utilizes ``integral packets'', which are calculated by the path integral of the Monte-Carlo energy packets, to synthesize the observed spectropolarimetric signal at a given viewing direction in a 3-D time-dependent radiative transfer program. Compared to the event-based technique (EBT) proposed by (Bulla et al. 2015), our algorithm significantly reduces the computation time and increases the Monte-Carlo signal-to-noise ratio. Using a 1-D spherical symmetric type Ia supernova (SN Ia) ejecta model DDC10 and its derived 3-D model, the IBT algorithm has successfully passed the verification of: (1) spherical symmetry; (2) mirror symmetry; (3) cross comparison on a 3-D SN model with direct-counting technique (DCT) and EBT. Notably, with our algorithm implemented in the 3-D Monte-Carlo radiative transfer code SEDONA, the computation time is faster than EBT by a factor of $10-30$, and the signal-to-noise (S/N) ratio is better by a factor of $5-10$, with the same number of Monte-Carlo quanta.\n\n", "2409.07539": "2024-09-11, **A detailed dive into fitting strategies for GRB afterglows with contamination: A case study with kilonovae**, Wendy Fu Wallace et.al., [2409.07539v1](http://arxiv.org/abs/2409.07539v1)\n\n Observations of gamma-ray burst afterglows have begun to readily reveal contamination from a kilonova or a supernova. This contamination presents significant challenges towards traditional methods of inferring the properties of these phenomena from observations. Given current knowledge of kilonova and afterglow modelling, observations (as expected) with near-infrared bands and at early observing times provide the greatest diagnostic power for both observing the presence of a kilonova and inferences on its properties in gamma-ray burst afterglows. However, contemporaneous observations in radio and X-ray are critical for reducing the afterglow parameter space and for more efficient parameter estimation. We compare different methods for fitting joint kilonova and afterglow observations under different scenarios. We find that ignoring the contribution of one source (even in scenarios where the source is sub-dominant) can lead to significantly biased estimated parameters but could still produce great light curve fits that do not raise suspicion. This bias is also present for analyses that fit data where one source is \"subtracted\". In most scenarios, the bias is smaller than the systematic uncertainty inherent to kilonova models but significant for afterglow parameters, particularly in the absence of high-quality radio and X-ray observations. Instead, we show that the most reliable method for inference in any scenario where contamination can not be confidently dismissed is to jointly fit for both an afterglow and kilonova/supernova, and showcase a Bayesian framework to make this joint analysis computationally feasible.\n\n", "2409.07124": "2024-09-11, **Galactic Distribution of Supernovae and OB Associations**, M. Kachelriess et.al., [2409.07124v1](http://arxiv.org/abs/2409.07124v1)\n\n We update and extend a previous model by Higdon and Lingenfelter for the longitudinal profile of the N\\,II intensity in the Galactic plane. The model is based on four logarithmic spiral arms, to which features like the Local Arm and local sources are added. Connecting then the N\\,II to the H\\,II emission, we use this model to determine the average spatial distribution of OBassociations in the Milky Way. Combined with a stellar mass and cluster distribution function, the model predicts the average spatial and temporal distribution of core-collapse supernovae in the Milky Way. In addition to this average population, we account for supernovae from observed OB associations, providing thereby a more accurate description of the nearby Galaxy. The complete model is made publicly available in the python code SNOB.\n\n", "2409.07038": "2024-09-11, **Investigations on the equation of state of neutron star matter with density-dependent relativistic mean-field model**, Kaixuan Huang et.al., [2409.07038v1](http://arxiv.org/abs/2409.07038v1)\n\n The compact object with a mass of $2.50-2.67~M\\_\\odot$ observed by LIGO Scientific and Virgo collaborations in GW190814, as well as the recent report of a light compact object with a mass and radius of $M=0.77^{+0.20}\\_{-0.17}M\\_{\\odot}$ and $R=10.4^{+0.86}\\_{-0.78}$ km within the supernova remnant HESS J1731-347, have posed a great challenge to the investigations into the supranuclear matter. In the inner core region of the neutron star, the strangeness degrees of freedom, such as the hyperons, can be present, which is also named as a hyperonic star. In this work, the neutron star consisting of nucleons and leptons, and the hyperonic star including the hyperons will be studied in the framework of the density-dependent relativistic mean-field (DDRMF) model. Some popular DDRMF parameterizations will be adopted to investigate the properties of nuclear matter and the mass, radius, tidal deformability, and other properties of neutron star and hyperonic stars. We find that the maximum masses of neutron star calculated by DD-MEX, DD-MEX1, DD-MEX2, DD-MEXY and DD-LZ1 sets can be around $2.5-2.6~M\\_\\odot$ with quite stiff equations of state (EOSs) generated by their strong repulsive contributions from vector potentials at high densities. Moreover, by investigating the influence of the crust EOS and core EOS on the neutron stars, we find that the observational data from HESS J1731-347 suggest the requirement of a crust EOS with a higher $L$ parameter and a core EOS with a lower $L$ parameter, and the $M-R$ relations from the constructed EOSs can also be consistent with the observables of PSR J0740+6620, PSR J0030+0451 from NICER and the GW170817 event. With the inclusion of hyperons, the hyperonic star matter becomes softer compared to the neutron star matter. But the massive hyperonic star can also be obtained with DDRMF parameter sets if the vector coupling constants are strong.\n\n"}}