{"neutrino": {"2512.13587": "2025-12-15, **Neutrino texture-zeros after JUNO's first results: Implications for long baseline neutrino experiments**, Debasish Borah et.al., [2512.13587v1](http://arxiv.org/abs/2512.13587v1)\n\n The recent results from the JUNO reactor neutrino experiment have significantly improved our knowledge of the solar mixing angle $θ\\_{12}$ and the solar mass splitting $Δm^2\\_{21}$. We study the impact of these improved estimates on the validity of texture-zeros in the light neutrino mass matrix by assuming neutrinos to be of Majorana nature. Considering a diagonal charged lepton basis, we revisit the previously allowed one-zero and two-zero textures and check their validity by using updated neutrino data from JUNO. While JUNO data rule out one previously allowed two-zero texture, they also make predictions for other neutrino parameters more precise. We finally study the prospects of probing the currently allowed texture-zeros and their predicted correlations among neutrino parameters at future long baseline neutrino experiments like the DUNE. The inclusion of JUNO and reactor experiments strengthens DUNE's ability to constrain the allowed parameter space of both one-zero and two-zero textures.\n\n", "2512.13578": "2025-12-15, **Leptonic and Hadronic Models of High-energy Nebula Around V4641 Sgr**, Maksim Kleimenov et.al., [2512.13578v1](http://arxiv.org/abs/2512.13578v1)\n\n A prominent, 200-pc-scale high-energy nebula surrounding the microquasar V4641~Sgr is the brightest known gamma-ray source in the Southern sky at $E > 100\\,\\mathrm{TeV}$. In this paper, we develop self-consistent leptonic, hadronic, and leptohadronic models that reproduce both the observed spectrum and morphology of the source. Purely leptonic models are energetically more favorable yet they require rather specific morphological assumptions. The gamma-ray morphology of the source can be better explained within a hadronic scenario based on the identification of cold gas structures spatially correlated with the observed gamma-ray emission. However, a purely hadronic model for the source emission requires a substantial energy reservoir in protons and fails to reproduce the extended X-ray emission recently detected by XRISM. We show that emission including a combination of leptonic and hadronic components can reproduce both the spectral and morphological properties of the source. We provide predictions for the X-ray and neutrino spectra of~the~nebula that can discriminate the hadronic and leptonic contributions to the overall source signal.\n\n", "2512.13158": "2025-12-15, **Testable Inverse Seesaw Motivated from a High Quality QCD Axion**, Yannis Georis et.al., [2512.13158v1](http://arxiv.org/abs/2512.13158v1)\n\n The QCD axion remains one of the most compelling solutions to the strong CP problem. Meanwhile, the type-I seesaw mechanism offers an elegant explanation for the lightness of the observed neutrino masses; however, its extremely heavy Majorana states place it far beyond experimental reach. Low-scale alternatives such as the inverse seesaw improve testability but typically lack a strong theoretical motivation. In this paper we bridge this gap by showing that gauging the discrete symmetry $\\mathbb Z\\_4 \\times \\mathbb Z\\_3$-motivated by the internal structure of the Standard Model-naturally yields a QCD axion with a high-quality Peccei-Quinn symmetry solving the strong CP problem, while simultaneously enforcing the field content and hierarchy required for a natural inverse seesaw. The resulting model is highly predictive and has the potential to be fully tested by future experiments. Beyond addressing the strong CP problem and the origin of neutrino masses, our scenario also contains a viable dark-matter candidate and offers potential mechanisms for generating the baryon asymmetry of the Universe.\n\n", "2512.12637": "2025-12-14, **Peccei-Quinn Genesis**, Eung Jin Chun et.al., [2512.12637v1](http://arxiv.org/abs/2512.12637v1)\n\n We propose a cogenesis mechanism that unifies the origin of QCD axion dark matter and the baryon asymmetry of the Universe in the framework of Peccei-Quinn pole inflation. The model integrates the Peccei-Quinn symmetry with the seesaw mechanism for neutrino masses. This allows for spontaneous leptogenesis, which generates the required $B-L$ asymmetry around the seesaw scale. The necessary initial axion kinetic misalignment is naturally sourced by a PQ field driving pole inflation. Analysis within the KSVZ axion model demonstrates that achieving simultaneous correct DM abundance and baryon asymmetry limits the axion decay constant to be smaller than about $10^9$ GeV. This framework offers a unified solution to four fundamental problems: the strong CP problem, neutrino mass, matter-antimatter asymmetry, and inflation.\n\n", "2512.12627": "2025-12-14, **The post-inflationary cosmology of the VISH$ν$ axion-majoron model**, Alexei H. Sopov et.al., [2512.12627v1](http://arxiv.org/abs/2512.12627v1)\n\n It was previously shown how several explanatory deficiencies of the Standard Model (including the origin of dark matter, matter-antimatter asymmetry, small active neutrino mass, strong CP-conservation and the seeds for large-scale structure formation) may be economically resolved when an experimentally-accessible QCD axion also plays the role of the majoron, and the scalar partner of the axion is dynamical during inflation. In this paper, we complete this general study of the cosmological history for a unit domain-wall number option of the DFSZ-type, dubbed VISH$ν$, by performing a detailed lattice-informed analysis of the reheating era. In doing so, we make inflationary and leptogenesis predictions more precise through estimates of the reheating temperature and the expansion history. The viable reheating scenarios, which at the same time satisfy strict conditions for naturalness (radiative stability), are also shown to respect dark radiation bounds. We also characterise the high-frequency spectrum of gravitational waves, and mention other phenomenological implications that distinguish VISH$ν$ from alternative proposals.\n\n"}, "dark matter": {"2512.13648": "2025-12-15, **The impact of non-Gaussianity when searching for Primordial Black Holes with LISA**, Antonio Junior Iovino et.al., [2512.13648v1](http://arxiv.org/abs/2512.13648v1)\n\n LISA can observe cosmological millihertz (mHz) gravitational wave (GW) backgrounds that may offer a decisive test for asteroid-mass primordial black hole (PBH) dark matter (DM). In standard scenarios, failing to detect a scalar-induced gravitational wave (SIGW) background would exclude the last viable window for PBH DM formed through critical collapse. We show that this conclusion becomes much weaker in the presence of astrophysical foregrounds and strongly non-Gaussian primordial density perturbations, by studying how these phenomena affect the link between SIGWs and PBHs, and reevaluate LISA's sensitivity to asteroid-mass PBHs. In addition, we analyse the interplay between PBHs and SIGWs to gain further insights into the nature of primordial non-Gaussianity. We find that uncertainties in $f\\_{\\rm NL}$ can induce substantial uncertainties in the PBH abundance, which ultimately limits LISA's capacity to fully probe the asteroid-mass PBH DM window.\n\n", "2512.13633": "2025-12-15, **A post-inflationary kinetic axion**, Enrico Morgante et.al., [2512.13633v1](http://arxiv.org/abs/2512.13633v1)\n\n We present a novel realization of axion kinetic misalignment, triggered by a Hubble-induced phase transition during a post-inflationary stiff (kination) era. A negative Ricci scalar flips the sign of a non-minimally coupled mass term for a non-minimally coupled complex field $Φ$, driving its radial mode to large amplitudes via a tachyonic instability. At large $\\|Φ\\|$, higher-dimensional $U(1)$-breaking operators become relevant and impart a kick in the angular direction, generating a conserved $U(1)$ charge that sustains rotation as the symmetry is approximately restored. Because phases randomize across causally disconnected regions, multiple domains with distinct charges form. The subsequent axion potential converts the domain charges into an axion abundance, yielding dark matter even when the net global charge vanishes. We analyze the dynamics through a linear, domain-averaged treatment and identify two thermal histories: (i) Ricci reheating via saxion decays to Higgs bosons; (ii) external reheating with efficient damping of saxion energy by Higgs/fermion scatterings. The mechanism populates regions underabundant in standard misalignment, which are accessible to next generation axion searches.\n\n", "2512.13574": "2025-12-15, **Fermionic versus Bosonic Dark Matter in Neutron Stars: A Bayesian Study with Multi-Density Constraints**, Payaswinee Arvikar et.al., [2512.13574v1](http://arxiv.org/abs/2512.13574v1)\n\n We perform a comparative Bayesian analysis of fermionic and bosonic dark matter admixed neutron stars (DMANS) by incorporating a comprehensive set of theoretical, experimental, and astrophysical constraints. The hadronic matter equation of state (EoS) is modeled using a relativistic mean-field approach, constrained by chiral effective field theory ($χ$EFT) calculations at low densities, finite nuclei and heavy-ion collision data at intermediate densities, and neutron star (NS) observations at high densities. For the dark sector, we consider fermionic dark matter (FDM) interacting via a dark vector meson, and two bosonic dark matter models (BDM1 and BDM2) characterized by self-interacting scalar fields. Bayesian inference is employed to constrain the model parameters, including the dark matter mass, coupling strength, and dark matter fraction within NSs. Our analysis finds that all models yield consistent nuclear matter parameters, allowing a small dark matter fraction under 10%. The presence of dark matter slightly softens the EoS, leading to a modest reduction in NS mass, radius, and tidal deformability, though all models remain compatible with NICER and GW170817 observations. The log-evidence and likelihood analyses reveal no statistical preference among the FDM and BDM models, indicating that current astrophysical data cannot decisively distinguish between fermionic and bosonic dark matter scenarios. This study provides a unified statistical framework to constrain dark matter properties using NS observables.\n\n", "2512.13563": "2025-12-15, **Exploring the freeze-in mechanism for scotogenic singlet dark matter**, Ugo de Noyers et.al., [2512.13563v1](http://arxiv.org/abs/2512.13563v1)\n\n We present an exploratory study of the freeze-in mechanism within a scotogenic framework, where dark matter can either be a scalar singlet or a fermion singlet. Based on a random parameter scan, we show that large portions of the parameter space feature a dark matter relic density in agreement with the limits derived by Planck. Moreover, constraints related to lepton flavour violation are mostly respected within such parameter regions. Our study shows that it will be worth to further investigate the freeze-in mechanism within scotogenic frameworks.\n\n", "2512.13544": "2025-12-15, **The Serendipitous Axiodilaton: A Self-Consistent Recombination-Era Solution to the Hubble Tension**, Adam Smith et.al., [2512.13544v1](http://arxiv.org/abs/2512.13544v1)\n\n Axio-dilaton cosmology provides a minimal benchmark model for both Dark Matter (DM) and Dark Energy (DE) that is well motivated by fundamental physics. The axion and dilaton arise as pseudo-Goldstone modes of symmetries that predict particle masses depend on the dilaton, and therefore to evolve cosmologically, leading to correlated modifications of recombination physics, the sound horizon, and late-time expansion and growth histories. We confront this model with Planck 2018 temperature, polarisation, and lensing data, SPT-3G high-$\\ell$ measurements, DESI DR2 BAO, and Pantheon$+$ supernovae, assuming that the axion makes up all of the dark matter and that the dilaton plays the role of a dark energy field. We find that it fits the data somewhat better than $Λ$CDM cosmology, with the $χ^2$ lowered by $\\simeq 7$ for three additional parameters, and significantly raises the inferred Hubble constant to $H\\_0 \\simeq 69.2\\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, reducing the Hubble tension to $\\lesssim 3σ$ and thereby allowing a joint fit of CMB and SH0ES data. The model fits this enlarged data set as well as the $w\\_0w\\_a$ model with an electron mass modified by hand at recombination, though it does so with calculable dynamics. Axio-dilaton self-interactions robustly fake a phantom equation of state in DESI measurements. There is a sting: cosmology prefers dilaton-matter couplings $\\|\\mathbf{g}\\|\\sim 10^{-2}$-$10^{-1}$, which are large enough to have been detected in solar-system tests of General Relativity. These results show how axio-dilatons can provide a viable cosmology preferred by current data at surprisingly large couplings, within a framework that links dark energy, dark matter, and time-dependent particle masses in a coherent way. They suggest both new observable signals and new theoretical directions, aimed at resolving the apparent inconsistency with non-cosmological observations.\n\n", "2512.13301": "2025-12-15, **DarkSHINE: Search for Light Dark Matter at the SHINE Facility in Shanghai**, Haijun Yang et.al., [2512.13301v1](http://arxiv.org/abs/2512.13301v1)\n\n DarkSHINE is an electron fixed target experiment under proposal that aims to probe light dark matter in the MeV-GeV mass range via the invisible decay of dark photons, leveraging the High repetition rate 8 GeV electron beam from the Shanghai High repetition-rate XFEL and Extreme Light Facility. This proceeding presents the core detector design of the experiment, the simulation framework, and the prospects of the physics. The detector system integrates an AC-coupled Low Gain Avalanche Diode silicon tracker, a LYSO crystal electromagnetic calorimeter, and a scintillator-based hadronic calorimeter, all optimized for SHINE high-radiation, high-rate environment. The prototype tests at DESY and CERN have validated key performance metrics, including a spatial resolution of 6.5-8.2 microns for silicon strip sensor, an electromagnetic calorimeter energy resolution of 1.8%. Based on MC simulations and 9E14 EOT, the DarkSHINE experiment is expected to rule out most of the sensitive regions predicted by popular dark photon models.\n\n", "2512.13261": "2025-12-15, **Constraints on dark matter annihilation from a nearby subhalo candidate**, Ben-Yang Zhu et.al., [2512.13261v1](http://arxiv.org/abs/2512.13261v1)\n\n A recent analysis of pulsar timing data has reported evidence for a massive ($\\sim 6 \\times 10^7 M\\_{\\odot}$) dark matter subhalo located only $\\sim 0.8$ kpc from Earth. This candidate implies an exceptionally large $J$-factor of $\\sim 10^{23}\\,{\\rm GeV^2\\,cm^{-5}}$, exceeding that of known classical dwarf spheroidal galaxies by orders of magnitude and rivaling the Galactic Center. In this work, we utilize more than 17 years of $\\textit{Fermi}$-LAT data to search for gamma-ray emission from this subhalo. We identify a tentative excess in the region with ambiguous origin. Adopting a conservative strategy, we retain this excess without modeling additional astrophysical components, treating it instead as unmodeled background to derive upper limits on the dark matter annihilation cross-section for the $b\\bar{b}$ and $τ^+τ^-$ channels. Despite this conservative treatment, the resulting limits remain stringent due to the exceptionally large $J$-factor. Subject to the dynamical confirmation of the subhalo, these constraints are potentially orders of magnitude stronger than those obtained from combined analyses of dwarf spheroidal galaxies and blind subhalo searches.\n\n", "2512.13258": "2025-12-15, **APOGEE physical properties of globular cluster tidal tails**, André E. Piatti et.al., [2512.13258v1](http://arxiv.org/abs/2512.13258v1)\n\n A recent model prediction claimed that exists a correlation between the formation scenarios of globular clusters, i.e., whether they formed in situ, or in dark matter halos that were accreted into the Milky way, with some properties of their tidal tails, particularly, their widths ($w$), their dispersion in the z-component of the angular momentum ($σ$$\\_{\\rm L\\_z}$ ), and in the line-of-sight ($σ$$\\_{\\rm V\\_{LOS}}$) and tangential ($σ$$\\_{\\rm V\\_{Tan}}$) velocities. I exploited the APOGEE DR17 data base and selected highly confident tidal tails members of 17 Milky Way globular clusters, for which the above four properties were computed for the first time. From all possible paired property combinations, I found that $σ$$\\_{\\rm V\\_{LOS}}$ and $σ$$\\_{\\rm V\\_{Tan}}$ resulted to be highly correlated, nearly to the identity relationship. This observation-based correlation resulted to be in an overall very good agreement with that arising from the aforementioned predictions. Additionally, when the four analyzed properties are linked to the accretion groups of the Milky way to which the globular clusters are meant to be associated, I found kinematically cold and hot tidal tails pertaining to globular clusters distributed in all the considered accretion groups. This outcome could be an evidence that globular clusters form in galaxies within a wide variety of dark matter halos, with different masses and profiles.\n\n", "2512.12926": "2025-12-15, **Bayesian Unification in the History of Dark Matter: Confirmation by Restructuring Old Evidence**, Simon Allzén et.al., [2512.12926v1](http://arxiv.org/abs/2512.12926v1)\n\n The history of dark matter is often glossed as a linear progression of accumulating evidence confirming its existence. The actual history, however, is far more complex and philosophically nuanced. In this paper, I revisit key moments in the establishment and justification of dark matter as a viable hypothesis and offer a Bayesian representation of the core inferences made at those moments. I argue, contrary to the textbook narrative, that certain evidential reclassifications played a pivotal confirmatory role even in the absence of new data. In particular, I show how unifying previously separate anomalous phenomena under a single modeling framework provided novel support for the dark matter hypothesis.\n\n", "2512.12846": "2025-12-14, **The Merian Survey: A Statistical Census of Bright Satellites of Milky Way Analogs**, Yue Pan et.al., [2512.12846v1](http://arxiv.org/abs/2512.12846v1)\n\n We present a statistical census of bright, star-forming satellite galaxies around Milky Way (MW) analogs using the first data release of the Merian Survey. Our sample consists of 393 MW analogs with stellar masses $10^{10.5} < M\\_{\\star, \\rm host} < 10^{10.9} M\\_\\odot$ at redshifts $0.07 < z < 0.09$, all central galaxies of their own dark matter halos. Using photometric selection -- including magnitude, color, angular size, photometric redshift, and size-mass cuts -- we identify 793 satellite candidates around these 393 hosts. Our selection leverages two medium-band filters targeting H$α$ and [O \\textsc{iii}] emission, enabling a nearly complete sample of star-forming, Magellanic Clouds-like satellites with $M\\_{\\star, \\rm sat} \\gtrsim 10^{8} M\\_\\odot$. We find that $\\sim80\\%$ of hosts have 0-3 massive satellites, and $13\\pm4\\%$ have two satellites (similar to the MW). Satellite abundance correlates with total stellar mass, and we provide significantly improved statistics for the most massive satellites at $\\log\\_{10}[M\\_{\\star, \\rm sat}/M\\_{\\odot}] \\gtrsim 10$. The completeness-corrected radial distribution is less centrally concentrated than an NFW profile. In contrast, the Milky Way satellites are more centrally concentrated than the 50\\% richest Merian systems, but are broadly consistent with the 50\\% most centrally concentrated Merian systems. Our results highlight the power of medium-band photometry for satellite identification and provide a key benchmark for studying satellite quenching, environmental effects, and hierarchical galaxy formation.\n\n", "2512.12745": "2025-12-14, **EROS light curve data base**, C. Afonso et.al., [2512.12745v1](http://arxiv.org/abs/2512.12745v1)\n\n The EROS project (Expérience de Recherche d'Objets Sombres) carried out photometric surveys of dense stellar fields towards the Magellanic Clouds (LMC and SMC), the Galactic Bulge and Galactic spiral arms, over the period 1990-2003. The main goal of the experiment was to search for the Galactic Dark Matter in the form of massive compact objects (machos), through the gravitational microlensing effect. The historical record of the flux variations of the monitored stars by EROS-2 will be a unique asset for time domain astronomy and to complement current and future searches of transient sources. We describe the set of light curves obtained by EROS-2 program over the years 1996 to 2003, monitoring more than 86 million stars, which is publicly released through the Centre de Données de Strasbourg (CDS). The numbers of light curves in this data set are 28.7 and 4.0 million in LMC, respectively SMC, 42.9 million in the Galactic Bulge and 10.4 million towards the Galactic spiral arms, with several hundred measurements for each object. Data from EROS-1 is also being released. The object catalog and light curves and images are accessible through the CDS portal. This will be useful for checking the past behavior of newly discovered variable objects.\n\n", "2512.12644": "2025-12-14, **Comments on \"Little ado about everything\" by A. Lapi et al. and on cosmological back-reaction**, Julian Adamek et.al., [2512.12644v1](http://arxiv.org/abs/2512.12644v1)\n\n In two papers, A. Lapi et al. introduce and discuss what they call the $η$CDM model, a stochastic framework in which they claim that fluctuations in the density field at the scale of tens of Mpc due to structure formation would effectively drive the accelerated expansion of the Universe. They claim that this qualitative behaviour would emerge from the dynamics of standard cold dark matter alone, without introducing any new physics. In this short comment, I argue that such a proposition is implausible. Some of my remarks are relevant more generally to frameworks that try to describe cosmological back-reaction.\n\n"}, "supernova": {"2512.13691": "2025-12-15, **Non-parametric exploration of minimally coupled gravity with phantom crossing**, Matteo Cataneo et.al., [2512.13691v1](http://arxiv.org/abs/2512.13691v1)\n\n Recent measurements of the baryon acoustic oscillations by the Dark Energy Spectroscopic Instrument (DESI), especially when combined with cosmic microwave background (CMB) and supernova data, favor a late-time dark energy equation of state that crosses $w=-1$, which has been argued to point toward non-minimal conformal coupling in Horndeski gravity. We test this interpretation by performing a non-parametric exploration of the minimally coupled, luminal Horndeski subclass known as kinetic gravity braiding (KGB). Using mochi\\_class and its manifestly stable effective field theory (EFT) basis implementation, we efficiently scan a broad class of models in which the EFT functions are allowed to vary freely in time, while enforcing the absence of ghost and gradient instabilities from the outset. We identify a set of KGB models that realize phantom crossing and remain broadly consistent with current probes of the background and linear large-scale structure, including CMB temperature and lensing power spectra, redshift-space distortions, cosmic shear, and the cross-correlation between galaxies and the Integrated Sachs-Wolfe effect. Our results demonstrate that viable phantom-crossing solutions exist without conformal coupling, motivating future full Bayesian analyses of this model class with non-parametric EFT priors.\n\n", "2512.13544": "2025-12-15, **The Serendipitous Axiodilaton: A Self-Consistent Recombination-Era Solution to the Hubble Tension**, Adam Smith et.al., [2512.13544v1](http://arxiv.org/abs/2512.13544v1)\n\n Axio-dilaton cosmology provides a minimal benchmark model for both Dark Matter (DM) and Dark Energy (DE) that is well motivated by fundamental physics. The axion and dilaton arise as pseudo-Goldstone modes of symmetries that predict particle masses depend on the dilaton, and therefore to evolve cosmologically, leading to correlated modifications of recombination physics, the sound horizon, and late-time expansion and growth histories. We confront this model with Planck 2018 temperature, polarisation, and lensing data, SPT-3G high-$\\ell$ measurements, DESI DR2 BAO, and Pantheon$+$ supernovae, assuming that the axion makes up all of the dark matter and that the dilaton plays the role of a dark energy field. We find that it fits the data somewhat better than $Λ$CDM cosmology, with the $χ^2$ lowered by $\\simeq 7$ for three additional parameters, and significantly raises the inferred Hubble constant to $H\\_0 \\simeq 69.2\\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, reducing the Hubble tension to $\\lesssim 3σ$ and thereby allowing a joint fit of CMB and SH0ES data. The model fits this enlarged data set as well as the $w\\_0w\\_a$ model with an electron mass modified by hand at recombination, though it does so with calculable dynamics. Axio-dilaton self-interactions robustly fake a phantom equation of state in DESI measurements. There is a sting: cosmology prefers dilaton-matter couplings $\\|\\mathbf{g}\\|\\sim 10^{-2}$-$10^{-1}$, which are large enough to have been detected in solar-system tests of General Relativity. These results show how axio-dilatons can provide a viable cosmology preferred by current data at surprisingly large couplings, within a framework that links dark energy, dark matter, and time-dependent particle masses in a coherent way. They suggest both new observable signals and new theoretical directions, aimed at resolving the apparent inconsistency with non-cosmological observations.\n\n", "2512.12733": "2025-12-14, **Evolution Models of CO WD -- AGB Star Merger Remnants**, Chengyuan Wu et.al., [2512.12733v1](http://arxiv.org/abs/2512.12733v1)\n\n Common envelope evolution is a critical but still poorly understood phase in binary evolution. It plays a key role in forming close binaries such as hot subdwarfs, double white dwarfs, X-ray binaries, and double neutron stars. However, its outcomes remain highly uncertain. Depending on the efficiency of envelope ejection, a system may either survive as a close binary or undergo a complete merger. In this work, we investigate the post merger evolution of systems where a CO WD mergers with the core of an AGB star. A grid of merger remnant models with various core and envelope masses is constructed. At the onset of evolution, the CO core contracts and undergoes off-center carbon ignition, producing an inwardly propagating carbon flame. For remnants with relatively low mass of CO core, the flame phase is followed by core contraction and subsequent H-shell burning. For more massive CO cores, the carbon flame reaches the center and is soon followed by off-center neon burning, which is expected to eventually lead to core-collapse supernovae. The merger remnants occupy nearly the same region on HR diagram as ordinary AGB or super-AGB stars, exhibiting similar surface properties. Although their surface abundance may differ slightly from those of normal AGB stars depending on the initial core and envelope masses, these differences are strongly reduced once mass-loss is taken into account. We suggest that some giant-like stars, including candidates for Thorne-Zytkow objects (e.g., HV 2112), might alternatively be explained as AGB-WD merger remnants.\n\n", "2512.12697": "2025-12-14, **A parameterized equation of state for dark energy and Hubble Tension**, Jing-Ya Zhao et.al., [2512.12697v1](http://arxiv.org/abs/2512.12697v1)\n\n We propose a parameterized equation of state for dark energy and perform observational tests with the Hubble parameter measurements, the Pantheon supernova sample, baryon acoustic oscillations, and DESI DR2 data. We obtain the best-fit values for the parameters as: $H\\_0=73.96\\pm 0.16$, $Ω\\_{\\rm m}=0.2434\\pm 0.0079$, and $α=-0.00049\\pm 0.00092$, demonstrating that the model exhibits a high degree of consistency with astronomical observations and provides a promising parameterized method for addressing the Hubble tension.\n\n"}}