{"neutrino": {"2407.10965": "2024-07-15, **Negative neutrino masses as a mirage of dark energy**, Willem Elbers et.al., [2407.10965v1](http://arxiv.org/abs/2407.10965v1)\n\n The latest cosmological constraints on the sum of the neutrino masses depend on prior physical assumptions about the mass spectrum. To test the accordance of cosmological and laboratory constraints in the absence of such priors, we introduce an effective neutrino mass parameter that extends consistently to negative values. For the $\\Lambda$CDM model, we analyze data from Planck, ACT, and DESI and find a $2.8-3.3\\sigma$ tension with the constraints from oscillation experiments. Motivated by recent hints of evolving dark energy, we analyze the $w\\_0w\\_a$ and mirage dark energy models, showing that they favour larger masses consistent with laboratory data, respectively $\\sum m\\_{\\nu,\\mathrm{eff}} = 0.06\\_{-0.10}^{+0.15}\\,\\mathrm{eV}$ and $\\sum m\\_{\\nu,\\mathrm{eff}} = 0.04\\_{-0.11}^{+0.15}\\,\\mathrm{eV}$ (both at 68\\%).\n\n", "2407.10962": "2024-07-15, **Benchmarking neutrino interaction models via a comparative analysis of kinematic imbalance measurements from the T2K, MicroBooNE and MINERvA experiments**, Wissal Filali et.al., [2407.10962v1](http://arxiv.org/abs/2407.10962v1)\n\n Recent neutrino-nucleus cross-section measurements of observables characterising kinematic imbalance from the T2K, MicroBooNE and MINERvA experiments are used to benchmark predictions from widely used neutrino interaction event generators. Given the different neutrino energy spectra and nuclear targets employed by the three experiments, comparisons of model predictions to their measurements breaks degeneracies that would be present in any single measurement. In particular, the comparison of T2K and MINERvA measurements offers a probe of energy dependence, whilst a comparison of T2K and MicroBooNE investigates scaling with nuclear target. In order to isolate the impact of individual nuclear effects, model comparisons are made following systematic alterations to: the nuclear ground state; final state interactions and multi-nucleon interaction strength. The measurements are further compared to the generators used as an input to DUNE/SBN and T2K/Hyper-K analyses. Whilst no model is able to quantitatively describe all the measurements, evidence is found for mis-modelling of A-scaling in multi-nucleon interactions and it is found that tight control over how energy is distributed among hadrons following final state interactions is likely to be crucial to achieving improved agreement. Overall, this work provides a novel characterisation of neutrino interactions whilst offering guidance for refining existing generator predictions.\n\n", "2407.10892": "2024-07-15, **First Measurement of Solar $^8$B Neutrino Flux through Coherent Elastic Neutrino-Nucleus Scattering in PandaX-4T**, PandaX Collaboration et.al., [2407.10892v1](http://arxiv.org/abs/2407.10892v1)\n\n The PandaX-4T liquid xenon detector at the China Jinping Underground Laboratory is used to measure the solar $^8$B neutrino flux by detecting neutrinos through coherent scattering with xenon nuclei. Data samples requiring the coincidence of scintillation and ionization signals (paired), as well as unpaired ionization-only signals (US2), are selected with energy threshold of approximately 1.1 keV (0.33 keV) nuclear recoil energy. Combining the commissioning run and the first science run of PandaX-4T, a total exposure of 1.25 and 1.04 tonne$\\cdot$year are collected for the paired and US2, respectively. After unblinding, 3 and 332 events are observed with an expectation of 2.8$\\pm$0.5 and 251$\\pm$32 background events, for the paired and US2 data, respectively. A combined analysis yields a best-fit $^8$B neutrino signal of 3.5 (75) events from the paired (US2) data sample, with $\\sim$37\\% uncertainty, and the background-only hypothesis is disfavored at 2.64$\\sigma$ significance. This gives a solar $^8$B neutrino flux of ($8.4\\pm3.1$)$\\times$10$^6$ cm$^{-2}$s$^{-1}$, consistent with the standard solar model prediction. This is the first indication of solar $^8$B neutrino ``fog'' in a dark matter direct detection experiment.\n\n", "2407.10879": "2024-07-15, **Measurement of the Lund jet plane in hadronic decays of top quarks and W bosons with the ATLAS detector**, ATLAS Collaboration et.al., [2407.10879v1](http://arxiv.org/abs/2407.10879v1)\n\n The Lund jet plane (LJP) is measured for the first time in $t\\overline{t}$ events, using 140 fb$^{-1}$ of $\\sqrt{s}$ = 13 TeV pp collision data collected with the ATLAS detector at the LHC. The LJP is a two-dimensional observable of the sub-structure of hadronic jets that acts as a proxy for the kinematics of parton showers and hadron formation. The observable is constructed from charged particles and is measured for R = 1.0 anti-$k\\_t$ jets with transverse momentum above 350 GeV containing the full decay products of either a top quark or a daughter $W$ boson. The other top quark in the event is identified from its decay into a b-quark, an electron or a muon and a neutrino. The measurement is corrected for detector effects and compared with a range of Monte Carlo predictions sensitive to different aspects of the hadronic decays of the heavy particles. In the $W$-boson-initiated jets, all the predictions are incompatible with the measurement. In the top quark initiated jets, disagreement with all predictions is observed in smaller subregions of the plane, and with a subset of the predictions across the fiducial plane. The measurement could be used to improve the tuning of Monte Carlo generators, for better modelling of hadronic decays of heavy quarks and bosons, or to improve the performance of jet taggers.\n\n", "2407.10821": "2024-07-15, **Astro-COLIBRI: Empowering Citizen Scientists in Time Domain Astronomy**, Fabian Schüssler et.al., [2407.10821v1](http://arxiv.org/abs/2407.10821v1)\n\n In recent decades, astronomy and astrophysics have experienced several fundamental changes. On one hand, there has been a significant increase in the observation of transient phenomena, which are short-lived events such as supernova explosions, fast radio bursts, and gamma-ray bursts. In addition, the detection of a growing number of different cosmic messengers provides researchers with crucial information about these objects. For example, the detection of high-energy neutrinos and gravitational waves regularly complements traditional astronomical observations in the electromagnetic spectrum. This trend is expected to intensify in the coming years with the commissioning of a wide variety of next-generation observatories, which will enable more in-depth studies of the transient sky.   To enhance our understanding and optimize the observations of these phenomena, we have developed the Astro-COLIBRI platform. It is freely available to amateur and professional astronomers in the form of a smartphone application (iOS and Android), a web interface, an API, and a chatbot 'Astro-COLIBRI GPT', among many other features. Astro-COLIBRI serves as a central access point for information on astrophysical sources and transient events, allowing a wide network of observers to track and receive real-time alerts.   Here we highlight the key features of Astro-COLIBRI, with a particular emphasis on recent innovations. These include a discussion forum that facilitates user interactions and our strengthened collaboration with various networks of amateur astronomers.\n\n", "2407.10741": "2024-07-15, **Optimizing the light output of a plastic scintillator and SiPM based detector through optical characterization and simulation: A case study for POLAR-2**, Nicolas De Angelis et.al., [2407.10741v1](http://arxiv.org/abs/2407.10741v1)\n\n The combination of plastic scintillators with Silicon Photo-Multipliers (SiPMs) is widely used for detecting radiation in high-energy astrophysics, particle physics, neutrino physics, or medical physics. An example of application for this kind of detectors are Compton polarimeters such as POLAR-2 or LEAP, for which a low-Z material is needed for the Compton effect to be dominant down to as low energy as possible. Such detectors aim to measure low energy Compton depositions which produce small amounts of optical light, and for which optimizing the instrumental optical properties consequently imperative.   The light collection efficiency of such a device was studied with a focus on the POLAR-2 GRB polarimeter, in which the conversion of incoming $\\gamma$-rays into readable signal goes through the production and collection of optical light, which was to be optimized both through measurements and simulations. The optical elements of the POLAR-2 polarimeter prototype module were optically characterized and an optical simulation based on Geant4 was developed to fully model its optical performances. The results from simulations were used to optimize the design and finally to verify its performance. The study resulted in a detector capable of measuring energy depositions of several keV. In addition an important finding of this work is the impact of the plastic scintillator surface roughness on the light collection. It was found that a plastic scintillator with a higher scintillation efficiency but made of a softer material, hence with a rougher surface, was not necessarily the best option to optimize the light collection. Furthermore, in order to optimize the optical crosstalk between different channels, a production technique for very thin ($\\sim$150$~\\mu$m) and reusable silicone-based optical coupling pads, which can be applied for other experiments, was developed.\n\n", "2407.10717": "2024-07-15, **Search for long-lived heavy neutral leptons in proton-proton collision events with a lepton-jet pair associated with a secondary vertex at $\\sqrt{s}$ = 13 TeV**, CMS Collaboration et.al., [2407.10717v1](http://arxiv.org/abs/2407.10717v1)\n\n A search for long-lived heavy neutral leptons (HNLs) using proton-proton collision data corresponding to an integrated luminosity of 138 fb$^{-1}$ collected at $\\sqrt{s}$ = 13 TeV with the CMS detector at the CERN LHC is presented. Events are selected with a charged lepton originating from the primary vertex associated with the proton-proton interaction, as well as a second charged lepton and a hadronic jet associated with a secondary vertex that corresponds to the semileptonic decay of a long-lived HNL. No excess of events above the standard model expectation is observed. Exclusion limits at 95% confidence level are evaluated for HNLs that mix with electron and/or muon neutrinos. Limits are presented in the mass range of 1-16.5 GeV, with excluded square mixing parameter values reaching as low as 2 $\\times$ 10$^{-7}$. For masses above 11 GeV, the presented limits exceed all previous results in the semileptonic decay channel, and for some of the considered scenarios are the strongest to date.\n\n", "2407.10692": "2024-07-15, **Vacuum energy density from the form factor bootstrap**, André LeClair et.al., [2407.10692v1](http://arxiv.org/abs/2407.10692v1)\n\n The form-factor bootstrap is incomplete until one normalizes the zero-particle form factor. For the stress energy tensor we describe how to obtain the vacuum energy density $\\rho\\_{\\rm vac}$, defined as $\\langle 0\\| T\\_{\\mu\\nu} \\| 0 \\rangle = \\rho\\_{\\rm vac} \\, g\\_{\\mu\\nu}$, from the form-factor bootstrap. Even for integrable QFT's in D=2 spacetime dimensions, this prescription is new, although it reproduces previously known results obtained in a different and more difficult thermodynamic Bethe ansatz computation. We propose a version of this prescription in D=4 dimensions. For these even dimensions, the vacuum energy density has the universal form $\\rho\\_{\\rm vac} \\propto m^D/\\mathfrak{g}$ where $\\mathfrak{g}$ is a dimensionless interaction coupling constant which can be determined from the high energy behavior of the S-matrix. In the limit $\\mathfrak{g} \\to 0$, $\\rho\\_{\\rm vac} $ diverges due to well understood UV divergences in free quantum field theories. If we assume the the observed Cosmological Constant originates from the vacuum energy density $\\rho\\_{\\rm vac}$ computed as proposed here, then this suggests there must exist a particle which does not obtain its mass from spontaneous symmetry breaking in the electro-weak sector, which we designate as the ``zeron\". A strong candidate for the zeron is a massive Majorana neutrino.\n\n", "2407.10604": "2024-07-15, **Muon-induced collisional flavor instability in core-collapse supernova**, Jiabao Liu et.al., [2407.10604v1](http://arxiv.org/abs/2407.10604v1)\n\n Neutrinos are known to undergo flavor conversion among their three flavors. In the theoretical modeling of core-collapse supernova (CCSN), there has been a great deal of attention to recent discoveries of a new type of neutrino flavor conversions, namely collisional flavor instability (CFI), in which the instability is induced by the flavor-dependent decoherence due to the disparity of neutrino-matter interactions among flavors. In this paper, we study how the appearance of on-shell muons and associated neutrino-matter interactions can impact CFIs based on linear stability analysis of flavor conversions. Some striking results emerge from the present study. First, we analytically show that breaking beta- and pair equilibrium is a necessary condition to trigger CFIs. This also indicates that CFIs with on-shell muons could appear in $e \\tau$ and $\\mu \\tau$ neutrino mixing sectors in very high-density region ($\\gtrsim 10^{13} {\\rm g/cm^{3}}$), exhibiting a possibility of large impacts of CFIs on CCSN. Second, resonance-like CFIs, having a much higher growth rate than normal CFIs, can be triggered by muons. The resonance point of CFIs is different between $e \\tau$ and $\\mu \\tau$ sectors; the former (latter) occurs at $\\mu\\_{e (\\mu)} = \\mu\\_{n} - \\mu\\_{p}$, where $\\mu\\_{i}$ denotes the chemical potential of $i$ constitute ($n$ and $p$ represent neutrons and protons, respectively). Our result suggests that the non-linear evolution of CFI with on-shell muons would induce flavor conversions with the complex interplay among all three different neutrino-mixing sectors.\n\n", "2407.10560": "2024-07-15, **Confronting the low-scale seesaw and leptogenesis with neutrinoless double beta decay**, J. de Vries et.al., [2407.10560v1](http://arxiv.org/abs/2407.10560v1)\n\n We revisit the impact of heavy neutrinos with masses in the MeV-GeV range on neutrinoless double beta decay ($0\\nu\\beta\\beta$) in view of updated results for the lifetime of this process. Working in a minimal realistic extension of the Standard Model by two right-handed neutrino flavours, we show that the non-observation of $0\\nu\\beta\\beta$ will impose strong bounds on the heavy neutrino properties that are complementary to the limits obtained from Big Bang Nucleosynthesis and collider searches. For an inverted mass hierarchy of the light neutrinos we find that improved limits on $0\\nu\\beta\\beta$ from next-generation experiments will restrict the allowed parameter space for fixed mass splitting to narrow bands in the mass-mixing plane. Further combining this with the requirement to explain the baryon asymmetry of the universe via leptogenesis reduces these bands to windows in parameter space that are constrained in all directions and can be targeted by direct searches at accelerators. For a normal mass hierarchy, only parts of the parameter space can be probed by such experiments.\n\n", "2407.10422": "2024-07-15, **A Semi-Empirical Formula for Two-Neutrino Double-Beta Decay**, Ovidiu Niţescu et.al., [2407.10422v1](http://arxiv.org/abs/2407.10422v1)\n\n We propose a semi-empirical formula for calculating the nuclear matrix elements for two-neutrino double-beta decay. The proposed model (PM) dependence on the proton and neutron numbers, the pairing, isospin, and deformation properties of the initial and final nuclei is inspired by the insights offered by nuclear many-body methods. Compared with the previous phenomenological and nuclear models, the PM yields the best agreement with the experimental data. Its stability and predictive power are cross-validated, and predictions for nuclear systems of experimental interest are provided.\n\n", "2407.10365": "2024-07-15, **Implications of scattering for CMB foreground emission modelling**, Jia-Rui Li et.al., [2407.10365v1](http://arxiv.org/abs/2407.10365v1)\n\n Context. The extreme precision and accuracy of forthcoming observations of CMB temperature and polarization anisotropies, aiming to detect the tiny signatures of primordial gravitational waves or of light relic particles beyond the standard three light neutrinos, requires commensurate precision in the modelling of foreground Galactic emission that contaminates CMB observations.   Aims. We evaluate the impact of second-order effects in Galactic foreground emission due to Thomson scattering off interstellar free electrons and to Rayleigh scattering off interstellar dust particles.   Methods. We use existing sky survey data and models of the distribution of free electrons and dust within the Milky Way to estimate the amplitude and power spectra of the emission originating from radiation scattered either by free electrons or by dust grains at CMB frequencies.   Results. Both processes generate corrections to the total emission that are small compared to direct emission, and are small enough not to pose problems for current-generation observations.   Conclusions. However, B-modes generated by Thomson scattering of incoming radiation by interstellar free electrons at CMB frequencies are within an order of magnitude of the sensitivity of the most advanced forthcoming CMB telescopes, and might require more precise evaluation in the future.\n\n", "2407.10357": "2024-07-14, **Solar neutrino capture by 128, 130Te isotopes and Baksan Large Neutrino Telescope Project**, A. N. Fazliakhmetov et.al., [2407.10357v1](http://arxiv.org/abs/2407.10357v1)\n\n This paper discusses the charge-exchange strength functions $S(E)$ of the isotopes $^{128,130}$Te. The experimental data of the $S(E)$ strength functions obtained from $(^{3}\\mathrm{He}, t)$ reactions, as well as the $S(E)$ strength functions calculated in the microscopic theory of finite fermi-systems, are analyzed. The resonance structure of the strength function $S(E)$ is examined, and the Gamow-Teller and Pygmy resonances are identified. The resonance structure of the strength function $S(E)$ is vital for the calculation and analysis of the process of neutrino capture by atomic nuclei.\n\n", "2407.10339": "2024-07-14, **Supernova Pointing Capabilities of DUNE**, DUNE Collaboration et.al., [2407.10339v1](http://arxiv.org/abs/2407.10339v1)\n\n The determination of the direction of a stellar core collapse via its neutrino emission is crucial for the identification of the progenitor for a multimessenger follow-up. A highly effective method of reconstructing supernova directions within the Deep Underground Neutrino Experiment (DUNE) is introduced. The supernova neutrino pointing resolution is studied by simulating and reconstructing electron-neutrino charged-current absorption on $^{40}$Ar and elastic scattering of neutrinos on electrons. Procedures to reconstruct individual interactions, including a newly developed technique called ``brems flipping'', as well as the burst direction from an ensemble of interactions are described. Performance of the burst direction reconstruction is evaluated for supernovae happening at a distance of 10 kpc for a specific supernova burst flux model. The pointing resolution is found to be 3.4 degrees at 68% coverage for a perfect interaction-channel classification and a fiducial mass of 40 kton, and 6.6 degrees for a 10 kton fiducial mass respectively. Assuming a 4% rate of charged-current interactions being misidentified as elastic scattering, DUNE's burst pointing resolution is found to be 4.3 degrees (8.7 degrees) at 68% coverage.\n\n"}, "dark matter": {"2407.10900": "2024-07-15, **Accelerated by Dark Matter: a High-redshift Pathway to Efficient Galaxy-scale Star Formation**, Michael Boylan-Kolchin et.al., [2407.10900v1](http://arxiv.org/abs/2407.10900v1)\n\n In the local Universe, star formation is typically inefficient both globally and when considered as the fraction of gas converted into stars per local free-fall time. An important exception to this inefficiency is regions of high gravitational accelerations $g$, or equivalently surface densities $\\Sigma = g/(\\pi\\,G)$, where stellar feedback is insufficient to overcome the self-gravity of dense gas clouds. In this paper, I explore whether dark matter can play an analogous role in providing the requisite accelerations on the scale of entire galaxies in the early cosmos. The key insight is that characteristic accelerations in dark matter halos scale as $(1+z)^2$ at fixed halo mass. I show this is sufficient to make dark matter the source of intense accelerations that might induce efficient star formation on galactic scales at cosmic dawn in sufficiently massive halos. The mass characterizing this regime scales as $(1+z)^{-6}$ and corresponds to a relatively constant comoving number density of $n(>\\!M\\_{\\rm vir}) \\approx 10^{-4}\\,{\\rm Mpc}^{-3}$ at $z \\gtrsim 8$. For somewhat rarer halos, this model predicts stellar masses of $M\\_{\\star} \\sim 10^{9}\\,M\\_{\\odot}$ can form in regions that end up with sizes $\\mathcal{O}(100\\,{\\rm pc})$ over $40\\,{\\rm Myr}$ time-scales at $z\\approx 12-14$; these numbers compare well to measurements for some of the brightest galaxies at that epoch from James Webb Space Telescope (JWST) observations. Dark matter and standard cosmological evolution may therefore be crucial for explaining the surprisingly high levels of star formation in the early Universe revealed by JWST.\n\n", "2407.10716": "2024-07-15, **First mechanical realization of a tunable dielectric haloscope for the MADMAX axion search experiment**, The MADMAX Collaboration et.al., [2407.10716v1](http://arxiv.org/abs/2407.10716v1)\n\n MADMAX, a future experiment to search for axion dark matter, is based on a novel detection concept called the dielectric haloscope. It consists of a booster composed of several dielectric disks positioned with $\\mu$m precision. A prototype composed of one movable disk was built to demonstrate the mechanical feasibility of such a booster in the challenging environment of the experiment: high magnetic field to convert the axions into photons and cryogenic temperature to reduce the thermal noise. It was tested both inside a strong magnetic field up to 1.6 T and at cryogenic temperatures down to 35K. The measurements of the velocity and positioning accuracy of the disk are shown and are found to match the MADMAX requirements.\n\n", "2407.10618": "2024-07-15, **Novel bounds on decaying axion-like-particle dark matter from the cosmic background**, S. Porras-Bedmar et.al., [2407.10618v1](http://arxiv.org/abs/2407.10618v1)\n\n The Cosmic Background (CB) is defined as the isotropic diffuse radiation field with extragalactic origin found across the electromagnetic spectrum. Different astrophysical sources dominate the CB emission at different energies, such as stars in the optical or active galactic nuclei in X-rays. Assuming that dark matter consists of axions or axion-like particles with masses on the order of electron volts or higher, we expect an additional contribution to the CB due to their decay into two photons. Here, we model the CB between the optical and X-ray regimes, and include the contribution of decaying axions. Through a comparison with the most recent direct and indirect CB measurements, we constrain the axion parameter space between masses $0.5\\, \\mathrm{eV}\\, - 10^7\\,\\mathrm{eV}$ and improve previous limits on axion-photon coupling derived from the CB by roughly an order of magnitude, also reaching the QCD band. We further study the contribution of axions decaying in the Milky Way halo and characterize the axion parameters that would explain the tentative excess CB emission observed with the LORRI instrument on-board the New Horizons probe.\n\n", "2407.10585": "2024-07-15, **Efficient hybrid technique for generating sub-grid haloes in reionization simulations**, Ankur Barsode et.al., [2407.10585v1](http://arxiv.org/abs/2407.10585v1)\n\n Simulating the distribution of cosmological neutral hydrogen (HI) during the epoch of reionization requires a high dynamic range and is hence computationally expensive. The size of the simulation is dictated by the largest scales one aims to probe, while the resolution is determined by the smallest dark matter haloes capable of hosting the first stars. We present a hybrid approach where the density and tidal fields of a large-volume, low-resolution simulation are combined with small haloes from a small-volume, high-resolution box. By merging these two boxes of relatively lower dynamic range, we achieve an effective high-dynamic range simulation using only 13% of the computational resources required for a full high-dynamic range simulation. Our method accurately reproduces the one- and two-point statistics of the halo field, its cross-correlation with the dark matter density field, and the two-point statistics of the HI field computed using a semi-numerical code, all within 10% accuracy at large scales and across different redshifts. Our technique, combined with semi-numerical models of reionization, provides a resource-efficient tool for modeling the HI distribution at high redshifts.\n\n", "2407.10549": "2024-07-15, **Search for dark matter produced in association with a dark Higgs boson in the $b\\bar{b}$ final state using $pp$ collisions at $\\sqrt{s}=13$ TeV with the ATLAS detector**, ATLAS Collaboration et.al., [2407.10549v1](http://arxiv.org/abs/2407.10549v1)\n\n A search is performed for dark matter particles produced in association with a resonantly produced pair of $b$-quarks with $30< m\\_{bb}<150$ GeV using 140 fb$^{-1}$ of proton-proton collisions at a center-of-mass energy of 13 TeV recorded by the ATLAS detector at the LHC. This signature is expected in extensions of the Standard Model predicting the production of dark matter particles, in particular those containing a dark Higgs boson $s$ that decays into $b\\bar{b}$. The highly boosted $s \\rightarrow b\\bar{b}$ topology is reconstructed using jet reclustering and a new identification algorithm. This search places stringent constraints across regions of the dark Higgs model parameter space that satisfy the observed relic density, excluding dark Higgs bosons with masses between $30$ and $150$ GeV in benchmark scenarios with $Z'$ mediator masses up to $4.8$ TeV at 95% confidence level.\n\n", "2407.10248": "2024-07-14, **Gravitational deflection of light in interior Schwarzschild metric**, Nikodem Popławski et.al., [2407.10248v1](http://arxiv.org/abs/2407.10248v1)\n\n We determine the angle of deflection of light by the gravitational field inside and outside a spherical body with a homogeneous mass density. We show that the largest deflections, which can be measured by weak gravitational lensing, are in a region displaced from the center of mass. This result can be extended to more general distributions of matter. This displacement, observed in galaxies and colliding galaxy clusters, may be therefore explained without dark matter, within general relativity.\n\n", "2407.10225": "2024-07-14, **Evolution of the DM distribution function in the density spikes around PBHs**, Yury N. Eroshenko et.al., [2407.10225v1](http://arxiv.org/abs/2407.10225v1)\n\n At the cosmological stage of radiation dominance, dark matter density spikes should form around primordial black holes. In the case when dark matter particles are able to annihilate, the density in the central regions of the spikes decreases due to the elimination of particles, which gives an upper bound on the central density. In this paper, the modification of the central density profile is investigated, taking into account the distribution of the particle orbits. The orbits in spike around a primordial black hole are very elongated, almost radial, and the angular momentum distribution has an exponential form. For such an initial distribution function, it is obtained that a cusp with the exponent $\\approx-0.7$ is formed in the central region, instead of an annihilation plateau. The presence of the cusp provides some correction to the rate of dark matter annihilation around primordial black holes.\n\n", "2407.10189": "2024-07-14, **Search for Dark Matter Annihilation to gamma-rays from SPT-SZ selected Galaxy Clusters**, Siddhant Manna et.al., [2407.10189v1](http://arxiv.org/abs/2407.10189v1)\n\n We search for dark matter annihilation from galaxy clusters in the energy range from 1-300 GeV using nearly 16 years of Fermi-LAT data. For this purpose, we use 350 galaxy clusters selected from the 2500 $\\rm{deg^2}$ SPT-SZ survey. We model the dark matter distribution using the NFW profile for the main halo along with the Einasto profile for the substructure. The largest signal is seen for the cluster SPT-CL J2021-5257 with a significance of around $3\\sigma$. The best-fit dark matter mass and annihilation cross-section for this cluster are equal to $(64.0 \\pm 11.8)$ GeV and $\\langle \\sigma v \\rangle= (6.0 \\pm 0.6) \\times 10^{-25} \\rm{cm^3 s^{-1}}$ for the $\\bar{b} b$ annihilation channel. However, this central estimate is in conflict with the limits on annihilation cross-section from dwarf spheroidal galaxies and hence cannot be attributed to dark matter annihilation. Three other clusters show significance between $2-2.5\\sigma$, whereas all the remaining clusters show null results. The most stringent 95\\% c.l. upper limit, which we obtain among the clusters with significance $>2\\sigma$ is from SPT-CL J2300-5331, given by $\\langle \\sigma v \\rangle = 9 \\times 10^{-26} \\text{cm}^3 \\text{s}^{-1}$ for a dark matter mass of 10 GeV corresponding to the $b\\bar{b}$ annihilation channel.\n\n", "2407.10139": "2024-07-14, **Dispersion in the Hubble-Lemaître constant measurements from gravitational clustering**, Swati Gavas et.al., [2407.10139v1](http://arxiv.org/abs/2407.10139v1)\n\n Measurements of the Hubble-Lema\\^{i}tre constant ($H\\_0$) require us to estimate the distance and recession velocity of galaxies independently. Gravitational clustering that leads to the formation of galaxies and the large scale structure leaves its imprints in the form of peculiar velocities of galaxies. In general, it is not possible to disentangle the peculiar velocity component from the recession velocities of galaxies, and this introduces an uncertainty in the determination of $H\\_0$. Using N-body simulations, we quantify the impact of peculiar velocities on the $H\\_0$ estimation. We consider observers to be located in dark matter halos and compute the distribution of the estimated value of $H\\_0$ across all such observers. We find that the dispersion of this distribution is large at small scales, and it diminishes as we go to large separations, reaching the level of the quoted statistical error in Planck and SH0ES measurements well beyond $\\sim$135 Mpc/h and $\\sim$220 Mpc/h, respectively. Measurements at smaller scales are susceptible to errors arising from peculiar motions, and this error can propagate to measurements at larger scales in the distance ladder. Notably, we observe a negative correlation between the local over-density around an observer and the deviation of the local and the global value of $H\\_0$. We show that deviations more significant than 5% of the global values can be encountered frequently at scales of up to 40 Mpc/h, and this is considerably larger than the statistical errors on local estimates. We also analyse the cumulative effect of such errors on mock measurements of $H\\_0$ as measured from Milky Way-sized halos. We find that this error is sensitive to the lowest distance at which we use measurements. The distribution of $H\\_0$ in mock measurements has a large tail, and deviations of a few percent from the global value cannot be ruled out.\n\n", "2407.10123": "2024-07-14, **Gravitational Wave Signatures of First-Order Phase Transition in Two-Component Dark Matter Model**, Seyed Yaser Ayazi et.al., [2407.10123v1](http://arxiv.org/abs/2407.10123v1)\n\n Here, we consider a classically scale-invariant extension of the Standard Model (SM) with two-component dark matter (DM) candidates, including a Dirac spinor and a scalar DM. We probe the parameter space of the model, constrained by relic density and direct detection, and investigate the generation of gravitational waves (GWs) produced by an electroweak first-order phase transition (EFOPT). The analysis demonstrates that there are points in the parameter space, leading to a detectable GW spectrum arising from the first-order phase transition, which is also consistent with the DM relic abundance and direct detection bounds. These GWs could be observed by forthcoming space-based interferometers such as the Big Bang Observer (BBO), Decihertz Interferometer Gravitational-wave Observatory (DECIGO), and Ultimate-DECIGO (UDECIGO).\n\n", "2407.10103": "2024-07-14, **From SuperBIT to GigaBIT: Informing next-generation balloon-borne telescope design with Fine Guidance System flight data**, Philippe Voyer et.al., [2407.10103v1](http://arxiv.org/abs/2407.10103v1)\n\n The Super-pressure Balloon-borne Imaging Telescope (SuperBIT) is a near-diffraction-limited 0.5m telescope that launched via NASA's super-pressure balloon technology on April 16, 2023. SuperBIT achieved precise pointing control through the use of three nested frames in conjunction with an optical Fine Guidance System (FGS), resulting in an average image stability of 0.055\" over 300-second exposures. The SuperBIT FGS includes a tip-tilt fast-steering mirror that corrects for jitter on a pair of focal plane star cameras. In this paper, we leverage the empirical data from SuperBIT's successful 45-night stratospheric mission to inform the FGS design for the next-generation balloon-borne telescope. The Gigapixel Balloon-borne Imaging Telescope (GigaBIT) is designed to be a 1.35m wide-field, high resolution imaging telescope, with specifications to extend the scale and capabilities beyond those of its predecessor SuperBIT. A description and analysis of the SuperBIT FGS will be presented along with methodologies for extrapolating this data to enhance GigaBIT's FGS design and fine pointing control algorithm. We employ a systems engineering approach to outline and formalize the design constraints and specifications for GigaBIT's FGS. GigaBIT, building on the SuperBIT legacy, is set to enhance high-resolution astronomical imaging, marking a significant advancement in the field of balloon-borne telescopes.\n\n"}, "supernova": {"2407.10929": "2024-07-15, **Evidence of gradients of density and magnetic field in the remnant of Tycho's supernova**, Oleh Petruk et.al., [2407.10929v1](http://arxiv.org/abs/2407.10929v1)\n\n By using surface brightness maps of Tycho's supernova remnant (SNR) in radio and X-rays, along with the properties of thermal and synchrotron emission, we have derived the post-shock density and magnetic field strength distributions over the projection of this remnant. Our analysis reveals a density gradient oriented towards the north-west, while the magnetic field strength gradient aligns with the Galactic plane, pointing eastward. Additionally, utilizing this magnetic field map, we have derived the spatial distributions of the cut-off frequency and maximum energy of electrons in Tycho's SNR. We further comment on the implications of these findings for interpreting the gamma-ray emission from Tycho's SNR.\n\n", "2407.10845": "2024-07-15, **Inferring dark energy properties from the scale factor parametrisation**, Upala Mukhopadhayay et.al., [2407.10845v1](http://arxiv.org/abs/2407.10845v1)\n\n We propose and implement a novel test to assess deviations from well-established concordance $\\Lambda$CDM cosmology while inferring dark energy properties. In contrast to the commonly implemented parametric forms of the dark energy equation-of-state (EoS), we test the validity of the cosmological constant on the more fundamental scale factor [$a(t)$] which determines the expansion rate of the Universe. We constrain our extended `general model' for the expansion history using the late-time cosmological observables, namely Baryon Acoustic Oscillations (BAO) and Supernovae. As a primary inference, we contrast the BAO compilations from the completed SDSS and the more recent DESI. We find that the former deviates from the $\\Lambda$CDM scenario at a mild $\\sim 2\\sigma$ level while the latter is completely consistent with the standard picture when the dark energy properties are inferred. We find that the posterior of the dark energy EoS is mainly constrained to be quintessence-like, however, we demonstrate the rich phenomenology of dark energy behaviour that can be obtained in our general model wrt to the $\\Lambda$CDM.\n\n", "2407.10729": "2024-07-15, **Testing the Molecular Cloud Paradigm for Ultra-High-Energy Gamma Ray Emission from the Direction of SNR G106.3+2.7**, R. Alfaro et.al., [2407.10729v1](http://arxiv.org/abs/2407.10729v1)\n\n Supernova remnants (SNRs) are believed to be capable of accelerating cosmic rays (CRs) to PeV energies. SNR G106.3+2.7 is a prime PeVatron candidate. It is formed by a head region, where the pulsar J2229+6114 and its boomerang-shaped pulsar wind nebula are located, and a tail region containing SN ejecta. The lack of observed gamma ray emission from the two regions of this SNR has made it difficult to assess which region would be responsible for the PeV CRs. We aim to characterize the very-high-energy (VHE, 0.1-100 TeV) gamma ray emission from SNR G106.3+2.7 by determining the morphology and spectral energy distribution of the region. This is accomplished using 2565 days of data and improved reconstruction algorithms from the HAWC Observatory. We also explore possible gamma ray production mechanisms for different energy ranges. Using a multi-source fitting procedure based on a maximum-likelihood estimation method, we evaluate the complex nature of this region. We determine the morphology, spectrum, and energy range for the source found in the region. Molecular cloud information is also used to create a template and evaluate the HAWC gamma ray spectral properties at ultra-high-energies (UHE, >56 TeV). This will help probe the hadronic nature of the highest-energy emission from the region. We resolve one extended source coincident with all other gamma ray observations of the region. The emission reaches above 100~TeV and its preferred log-parabola shape in the spectrum shows a flux peak in the TeV range. The molecular cloud template fit on the higher energy data reveals that the SNR's energy budget is fully capable of producing a purely hadronic source for UHE gamma rays.\n\n", "2407.10470": "2024-07-15, **Forecast of strongly lensed supernovae rates in the China Space Station Telescope surveys**, Jiang Dong et.al., [2407.10470v1](http://arxiv.org/abs/2407.10470v1)\n\n Strong gravitationally lensed supernovae (SNe) are a powerful probe for cosmology and stellar physics. The relative time delays between lensed SN images provide an independent way of measuring a fundamental cosmological parameter -- the Hubble constant -- , the value of which is currently under debate. The time delays also serve as a ``time machine'', offering a unique opportunity to capture the extremely early phase of the SN explosion, which can be used to constrain the SN progenitor and explosion mechanism. Although there are only a handful of strongly lensed SN discoveries so far, which greatly hinders scientific applications, the sample size is expected to grow substantially with next-generation surveys. In this work, we investigate the capability of detecting strongly lensed SNe with the China Space Station Telescope (CSST), a two-meter space telescope to be launched around 2026. Through Monte Carlo simulations, we predict that CSST can detect 1008.53 and 51.78 strongly lensed SNe from its Wide Field Survey (WFS, covering 17,500 deg$^2$) and Deep Field Survey (DFS, covering 400 deg$^2$) over the course of ten years. In both surveys, about 35\\% of the events involve Type Ia SNe as the background sources. Our results suggest that the WFS and DFS of CSST, although not designed or optimized for discovering transients, can still make a great contribution to the strongly lensed SNe studies.\n\n"}}