{"neutrino": {"2508.05456": "2025-08-07, **Weak interaction rates of $sd$-shell Urca pairs in stellar environment using a shell-model approach**, Shweta Sharma et.al., [2508.05456v1](http://arxiv.org/abs/2508.05456v1)\n\n In this work, the weak interaction rates of $sd$-shell nuclei in the hot and dense stellar environment are calculated using the shell model. The {\\it ab initio} effective interactions are employed for the calculation of Gamow-Teller strengths and weak rates in addition to the phenomenological interaction. The weak rates are evaluated in a fine grid of density and temperature. The electron capture and $\\beta^-$-decay rates of Urca pairs of nuclei with $A = 23, 25, 29, 31$ and 33 are evaluated as a function of $\\log\\_{10} \\rho Y\\_e$ and the corresponding Urca density is obtained. The screening effects are also included for the evaluation of these stellar weak rates. In addition, the intrinsic cooling strength is evaluated for $A=29,31$ and 33 Urca pairs in neutron star crusts. The stellar weak rates, along with the neutrino energy emitted and the gamma heat production, are tabulated for $A = 29-39$ nuclei.\n\n", "2508.05047": "2025-08-07, **Type-III Seesaw in Non-Holomorphic Modular Symmetry and Leptogenesis**, Priya et.al., [2508.05047v1](http://arxiv.org/abs/2508.05047v1)\n\n Recently, Qu and Ding, have proposed a formalism where modular invariance is extended to non-supersymmetric scenario considering Yukawa couplings as non-holomorphic functions of modules field $\\tau$. Adopting this formalism in this work, we propose a Type-III seesaw model as a unified framework to explain lepton masses and mixing and baryogenesis via leptogenesis. $\\chi^2$ analysis is performed to fit the neutrino oscillation data from NuFIT~6.0 leading to a normal hierarchical pattern of neutrino masses and constrained $CP$ phases. Furthermore, we analyze the generation of the observed baryon asymmetry of the Universe via thermal leptogenesis where the decays of the lightest fermion triplet $\\Sigma\\_1$ into lepton-Higgs final states produce a $CP$ asymmetry $\\varepsilon\\_{CP}$. The complex modules $\\tau$ is responsible for the $CP$ asymmetry produced during leptogenesis. The washout processes dominated by gauge scatterings and inverse decays are studied through the full set of Boltzmann equations. The resulting $B-L$ asymmetry, $Y\\_{B-L}\\sim 10^{-9}$ successfully reproduces the baryon-to-photon ratio demonstrating the model's capability to link low-energy neutrino data with the baryogenesis. The strong gauge-mediated washout of fermion triplets necessitates a leptogenesis scale of $\\mathcal{O}(10^{12}\\,\\mathrm{GeV})$ ensuring compatibility with both the Davidson-Ibarra bound and the thermal history of the Universe. Future pursuits remain open to the exploration of novel avenues aimed at lowering the energy scale associated with leptogenesis.\n\n"}, "dark matter": {"2508.05121": "2025-08-07, **Probing lepton flavor violating dark matter scenarios via astrophysical photons and positrons**, Jin-Han Liang et.al., [2508.05121v1](http://arxiv.org/abs/2508.05121v1)\n\n In this Letter we explore, for the first time, the constraints on lepton flavor violating (LFV) dark matter (DM) scenarios via the astrophysical photons and positrons, including both the annihilation and decay modes, ${\\tt DM(+DM)}\\to e^\\pm \\mu^\\mp, e^\\pm \\tau^\\mp, \\mu^\\pm \\tau^\\mp$. Given the presence of LFV interactions in various DM models and the challenge of probing such interactions at terrestrial facilities, such as DM direct detection and collider experiments, indirect detection offers a unique approach to investigating them. We utilize the currently available photon datasets from the XMM-Newton, INTEGRAL, and Fermi-LAT telescopes, along with the positron datasets from the AMS-02 satellite, to establish stringent bounds on the relevant annihilation cross sections or decay widths. In particular, we include contributions to the photon spectrum from final state radiation, radiative decays, and inverse Compton scattering. We find that the INTEGRAL (AMS-02) provides the most stringent bound on the annihilation cross sections and decay widths for DM mass below (above) approximately 20 GeV, which are comparable to those of their lepton flavor conserving counterparts.\n\n", "2508.04961": "2025-08-07, **Constraints on Symmetric Dark Matter from Neutron Star Capture and Collapse**, Yuxin Liu et.al., [2508.04961v1](http://arxiv.org/abs/2508.04961v1)\n\n Dark matter (DM) models with a conserved particle$-$antiparticle number, $n\\_\\chi-n\\_{\\tilde \\chi}$, and the asymmetry in the cosmological abundance $n\\_\\chi\\neq n\\_{\\tilde \\chi}$, are known to be challenged by the existence of old neutron stars (NSs), as the sufficient accumulation of DM will lead to the collapse of NSs into black holes. We demonstrate that the applicability of these constraints is much wider and covers models with symmetric populations of DM, $n\\_\\chi = n\\_{\\tilde \\chi}$, as the process of DM capture regulated by a nucleon-DM scattering can be inherently asymmetric, $\\sigma\\_{\\chi n}\\neq \\sigma\\_{\\tilde\\chi n}$. The asymmetry is induced by the interference of different types of $\\chi$-$n$ interactions, provided that their combination is odd under charge conjugation in the DM sector, $C\\_\\chi$, and even under combined parity $P\\_{\\chi + n}$. We provide a complete analysis of DM-nucleon bilinear $\\chi$-$n$ interactions and find that this asymmetry is very generic. Using canonical NS parameters and local DM halo inputs, we exclude spin-averaged scattering cross sections down to $\\sigma\\_{n\\chi}\\!\\gtrsim\\!10^{-46}\\,{\\rm cm}^{2}$ at DM mass $m\\_\\chi\\!\\lesssim\\!10^{10}\\,{\\rm GeV}$ for the maximally asymmetric capture rate, and show that the constraints persist down to very small values of the cross-section asymmetry, ${\\cal A}=(\\sigma\\_{\\chi n}- \\sigma\\_{\\tilde\\chi n})/(\\sigma\\_{\\chi n}+ \\sigma\\_{\\tilde\\chi n})\\gtrsim 10^{-5}$.\n\n"}, "supernova": {"2508.05151": "2025-08-07, **Laboratory Modeling of Supernova Remnants Collisions: Implications for Triggered Star Formation**, Marin Fontaine et.al., [2508.05151v1](http://arxiv.org/abs/2508.05151v1)\n\n Theoretical models of star formation consistently underestimate the rates observed in astronomical surveys. Stars form within giant molecular clouds, which fragment into dense clumps under the combined influences of turbulence, magnetic fields, radiation and gravity. While some of these clumps collapse spontaneously, others require an external trigger, a mechanism estimated to account for 14-25% of star formation in regions such as the Elephant Trunk Nebula. Laboratory astrophysics has emerged as a powerful approach for investigating such triggering processes, particularly those involving supernova remnants (SNRs). Recent experiments, guided by well-established scaling laws, have successfully replicated the dynamics of SNRs and their interactions with dense clumps or other SNRs. In this work, we present a comprehensive numerical study of these experimental configurations using the 3D radiation-hydrodynamics code TROLL. The simulations provide enhanced insight into the underlying physical mechanisms, accurately reproduce key experimental phenomena and offer valuable comparisons with analytical models. This study underscores the strong synergy between laboratory experiments and numerical simulations, laying a robust foundation for future advancements in laboratory astrophysics. Furthermore, we propose a new experimental setup that offers improved scaling for the asymmetric collision observed in the DEM L316 system. Our findings also show that SNR collisions in dense environments can decrease the gravitational stability of dense clumps, thereby promoting their collapse and potentially triggering star formation.\n\n"}}