{"neutrino": {"2505.09493": "2025-05-14, **DESI DR1 Lyα 1D power spectrum: The Fast Fourier Transform estimator measurement**, Corentin Ravoux et.al., [2505.09493v1](http://arxiv.org/abs/2505.09493v1)\n\n We present the one-dimensional Lyman-alpha forest power spectrum measurement derived from the data release 1 (DR1) of the Dark Energy Spectroscopic Instrument (DESI). The measurement of the Lyman-alpha forest power spectrum along the line of sight from high-redshift quasar spectra provides information on the shape of the linear matter power spectrum, neutrino masses, and the properties of dark matter. In this work, we use a Fast Fourier Transform (FFT)-based estimator, which is validated on synthetic data in a companion paper. Compared to the FFT measurement performed on the DESI early data release, we improve the noise characterization with a cross-exposure estimator and test the robustness of our measurement using various data splits. We also refine the estimation of the uncertainties and now present an estimator for the covariance matrix of the measurement. Furthermore, we compare our results to previous high-resolution and eBOSS measurements. In another companion paper, we present the same DR1 measurement using the Quadratic Maximum Likelihood Estimator (QMLE). These two measurements are consistent with each other and constitute the most precise one-dimensional power spectrum measurement to date, while being in good agreement with results from the DESI early data release.\n\n", "2505.09176": "2025-05-14, **Late-time suppression of structure growth as a solution for the $S_8$ tension**, Ryo Terasawa et.al., [2505.09176v1](http://arxiv.org/abs/2505.09176v1)\n\n The $S\\_8$ value inferred from the Subaru Hyper Suprime-Cam (HSC) Year 3 cosmic shear data, under the assumption of the flat $\\Lambda$CDM model, is 2-3$\\sigma$ lower than that inferred from observations of the early-time universe, such as cosmic microwave background (CMB) anisotropy data. Resolving the $S\\_8$ tension requires a scenario in which structure formation on small scales is suppressed in the late universe. As potential solutions, we consider extended models both within and beyond the $\\Lambda$CDM model -- models that incorporate parameterized baryonic feedback effects, the effect of varying neutrino mass, and modified structure growth, each of which can lead to a suppression of structure growth at lower redshifts, with its own distinct scale- and redshift-dependencies. In particular, we consider phenomenological modified gravity models in which the suppression of structure growth is triggered at lower redshifts, as dark energy ($\\Lambda$) begins to dominate the background expansion. We show that the modified growth factor models -- especially those featuring more rapid growth suppression at lower redshifts -- provide an improved fit to the combined datasets of the HSC-Y3 cosmic shear correlation functions, the Planck CMB, and the ACT DR6 CMB lensing, compared to the fiducial $\\Lambda$CDM model and the models including the baryonic effects or the massive neutrino effect within the the $\\Lambda$CDM framework.\n\n", "2505.09153": "2025-05-14, **Neutrino Fluence influenced by Memory Burdened Primordial Black Holes**, Arnab Chaudhuri et.al., [2505.09153v1](http://arxiv.org/abs/2505.09153v1)\n\n Primordial black holes (PBHs), formed in the early Universe, are capable of emitting both Standard Model (SM) and beyond the Standard Model (BSM) particles via Hawking radiation. We investigate the impact of the recently proposed memory burden effect which is a quantum gravitational backreaction that suppresses black hole evaporation once approximately half the PBH mass is lost on the production of high energy neutrinos. In particular, we examine how this suppression modifies the time-integrated muon neutrino flux, with and without the inclusion of heavy neutral leptons (HNLs) as BSM states. We compute the resulting neutrino fluence for different suppression strengths and analyze the prospects for detection in neutrino telescopes such as IceCube. Our results show that the memory burden significantly alters the neutrino energy spectrum, particularly at high energies, and that the presence of HNLs can counterbalance this suppression by introducing additional neutrino production channels. These findings have important implications for the detectability of PBH evaporation signatures and the parameter space of HNLs in cosmological settings.\n\n", "2505.09111": "2025-05-14, **Measuring the Cosmic Ray Spectrum with Next Generation Neutrino Detectors**, Stephan A. Meighen-Berger et.al., [2505.09111v1](http://arxiv.org/abs/2505.09111v1)\n\n We investigate the capabilities of upcoming kiloton-scale neutrino detectors, such as Hyper-Kamiokande, in determining the primary cosmic ray spectrum. These detectors provide full-sky coverage and long-term monitoring, unlike traditional satellite and balloon experiments that measure cosmic ray flux at specific altitudes and locations. By analyzing the atmospheric neutrino flux generated by cosmic ray interactions, we demonstrate that future detectors can differentiate between various cosmic ray models with high statistical significance, even when accounting for uncertainties in neutrino cross sections and hadronic interactions. We introduce a technique for reconstructing the primary cosmic ray spectrum using neutrino measurements, which reduces the flux uncertainty from approximately 20\\% to about 7\\%. We then show that Hyper-K has the potential to increase sensitivity to neutrino oscillation parameters, such as $\\sin^2\\theta\\_{23}$, by a factor of 2. Our results highlight the complementary role of neutrino detectors in cosmic ray physics and their critical importance for precision measurements in particle astrophysics.\n\n", "2505.09051": "2025-05-14, **Effects of virtual Majorana neutrinos on charged Lepton Flavor Violation decays from a seesaw variant with radiatively induced light neutrino masses**, Enrique Ramírez et.al., [2505.09051v1](http://arxiv.org/abs/2505.09051v1)\n\n Lepton flavor violating decays $\\ell\\_{\\alpha} \\to \\ell\\_{\\beta} \\gamma$, being forbidden in the Standard Model framework, provide a sensitive probe for new physics. We study these processes in a seesaw variant in which small neutrino masses are generated radiatively. By analyzing the parameter space constrained by electroweak precision data, we investigate the correlation between these decays and non-unitary effects from TeV-scale heavy neutrinos. According to our results, $\\mu \\to e \\gamma$ is the most promising channel for new physics searches, with the bound $\\|\\eta\\_{\\mu e}\\| \\lesssim 10^{-6}$ obtained for non-unitary effects in this radiative seesaw variant. Our estimations of $\\mathcal{BR} \\left( \\mu \\to e \\gamma \\right)$, which depends on the mass of the heavy neutrinos, shows that both current and future experimental facilities might be sensitive to these effects.\n\n", "2505.08862": "2025-05-13, **Exploring Scotogenic Parameter Spaces and Mapping Uncharted Dark Matter Phenomenology with Multi-Objective Search Algorithms**, Fernando Abreu de Souza et.al., [2505.08862v1](http://arxiv.org/abs/2505.08862v1)\n\n We present a novel artificial intelligence approach to explore beyond Standard Model parameter spaces by leveraging a multi-objective optimisation algorithm. We apply this methodology to a non-minimal scotogenic model which is constrained by Higgs mass, anomalous magnetic moment of the muon, dark matter relic density, dark matter direct detection, neutrino masses and mixing, and lepton flavour violating processes. Our results successfully expand on the phenomenological realisations presented in previous work. We compare between multi- and single-objective algorithms and we observe more phenomenologically diverse solutions and an improved search capacity coming from the former. We use novelty detection to further explore sparsely populated regions of phenomenological interest. These results suggest a powerful search strategy that combines the global exploration of multi-objective optimisation with the exploitation of single-objective optimisation.\n\n", "2505.08406": "2025-05-13, **Radiative $μ-τ$ Corrections and Renormalization of Neutrino Mass Operators in Type II Seesaw Models**, Gayatri Ghosh et.al., [2505.08406v1](http://arxiv.org/abs/2505.08406v1)\n\n We explore the impact of radiative $\\mu-\\tau$ corrections on the renormalization of neutrino mass operators in the Type II Seesaw framework, incorporating both dimension-five and dimension-six operators. Using renormalization group equations (RGE), we analyze the evolution of flavor coupling matrices and their deviations from $\\mu-\\tau$ symmetric configurations due to quantum corrections. Given the stringent constraints from the Large Hadron Collider (LHC) on the triplet scalar masses and couplings, we examine how these bounds influence the viability of $\\mu-\\tau$ symmetric seesaw models. Our analysis highlights the interplay between high-scale $\\mu-\\tau$ symmetry predictions and low-scale phenomenology, revealing whether radiative corrections remain within experimentally allowed limits.\n\n"}, "dark matter": {"2505.09470": "2025-05-14, **When Dark Matter Heats Up: A Model-Independent Search for Non-Cold Behavior**, Mazaharul Abedin et.al., [2505.09470v1](http://arxiv.org/abs/2505.09470v1)\n\n This article questions the common assumption of cold dark matter (DM) by exploring the possibility of a non-zero equation of state (EoS) without relying on any parametric approach. In standard cosmological analyses, DM is typically modeled as pressureless dust with $w\\_{\\rm DM} = 0$, an assumption that aligns with large-scale structure formation, supports the empirical success of the $\\Lambda$CDM model, and simplifies cosmological modeling. However, there is no fundamental reason to exclude a non-zero $w\\_{\\rm DM}$ from the cosmological framework. In this work, we explore this possibility through non-parametric and model-independent reconstructions based on Gaussian Process Regression. The reconstructions use Hubble parameter measurements from Cosmic Chronometers (CC), the Pantheon+ sample of Type Ia supernovae, and Baryon Acoustic Oscillation (BAO) data from DESI DR1 and DR2. Our findings suggest that a dynamical EoS for DM, although statistically mild, cannot be conclusively ruled out. Notably, we observe a tendency toward a negative $w\\_{\\rm DM}$ at the present epoch, a result that is particularly intriguing and may have meaningful implications for modern cosmology.\n\n", "2505.09337": "2025-05-14, **The Dual Primordial Black Hole Formation Scenario**, Xinpeng Wang et.al., [2505.09337v1](http://arxiv.org/abs/2505.09337v1)\n\n We report a novel mechanism where two families of primordial black holes (PBHs) may form at nearly the same comoving scales but at two different epochs. It is realized in two-stage inflation where a non-inflationary stage is sandwiched by the two inflationary stages. In this case, smaller PBHs form when the comoving scale of interest re-enters the horizon during the break period, and larger PBHs form when the scale re-enters the horizon after inflation. This mechanism may realize both reheating of the universe through the evaporation of ultralight PBHs formed during the break stage and the dark matter by those formed after inflation. We show that this scenario may give rise to a distinctive signature in the stochastic gravitational wave background that can be tested by the near-future gravitational wave observatories such as LISA and DECIGO. Our work thus provides a unified observational window into the physics of inflation, reheating, and dark matter.\n\n", "2505.09243": "2025-05-14, **The Shape and Mass of the Galactic Dark Matter Halo from the Axisymmetric Jeans Model**, Lan Zhang et.al., [2505.09243v1](http://arxiv.org/abs/2505.09243v1)\n\n We explore the density profile, shape, and virial mass of the Milky Way's dark matter halo using K giants (KG) from LAMOST and SDSS/SEGUE, as well as blue horizontal branch (BHB) stars from SDSS. Incorporating Gaia DR3 proper motions, we first investigate the velocity ellipsoid distribution within the $(R, \\|z\\|)$ space. The ellipsoids projected onto the $(v\\_R, v\\_z)$ plane exhibit near-spherical alignment. We then probe the underlying dark matter distribution using the axisymmetric Jeans equations with multi-Gaussian expansion (MGE) and the spherically aligned Jeans anisotropic modelling (JAM${\\rm sph}$), allowing for different flattened dark matter density models. For each model, we apply two fitting approaches: fitting the KGs and BHBs separately or fit them simultaneously as two dynamical tracers in one gravitational potential. We find consistent results on the dark matter density profiles, $r\\_{200}$, and $M\\_{200}$ within a 1-$\\sigma$ confidence region for models constrained by KGs, BHBs, and both. We find the strongest consistency between KGs and BHBs in constraining dark matter profiles for models incorporating radially varying halo flattening ($q(r\\_{\\rm gc})$), which suggests the Milky Way's dark matter halo shape evolves with Galactocentric distance ($r\\_{\\rm gc}$). Specifically, the halo flattening parameter $q\\_h$ decreases within $r\\_{\\rm gc} < 20$ kpc and increases for $r\\_{\\rm gc} > 20$ kpc. In this model, $M\\_{\\rm tot} (< 60~{\\rm kpc}) = 0.533^{+0.061}\\_{-0.054} \\times 10^{12}$ $M\\_{\\odot}$, $r\\_{200}$ is $188\\pm15$ kpc, with $M\\_{200}$ estimated at $0.820^{+0.210}\\_{-0.186} \\times 10^{12} M\\_{\\odot}$.\n\n", "2505.09219": "2025-05-14, **Probing Self-Interacting Dark Matter via Gravitational-Wave Background from Eccentric Supermassive Black Hole Mergers**, Mu-Chun Chen et.al., [2505.09219v1](http://arxiv.org/abs/2505.09219v1)\n\n The nature of dark matter is still mysterious despite various astronomical evidence. As a possible candidate, self-interacting dark matter (SIDM) can potentially resolve some issues appearing in cold dark matter paradigm. Here we investigate how SIDM around supermassive black holes (SMBH) in galaxy centers may form a density spike and imprint in the spectrum shape of stochastic gravitational-wave background from SMBH binaries (SMBHBs). Employing a refined dynamical friction formula and consistently evolving the orbital dynamics, we demonstrate that current pulsar timing arrays (PTAs) data is sensitive to the cross section of SIDM with $\\sigma(v)/m\\_\\chi\\lesssim0.66\\,\\mathrm{cm}^2/\\mathrm{g}$, comparable to other astrophysical probes. We also highlight the importance of including the eccentricity of SMBHBs in the parameter inference, which would affect the results significantly. Our findings reveal the promising potential of PTAs observations in probing the nature of dark matter.\n\n", "2505.09190": "2025-05-14, **Neutron Decay Anomaly and Its Effects on Neutron Star Properties**, H. C. Das et.al., [2505.09190v1](http://arxiv.org/abs/2505.09190v1)\n\n We investigate the effects of dark matter (DM) on neutron star (NS) properties using the neutron decay anomaly model within the relativistic mean-field (RMF) framework. Three nucleonic models (HCD0-HCD2) are developed, satisfying astrophysical constraints such as the maximum NS mass ($\\geq 2 M\\_\\odot$), the NICER mass-radius limits, and the tidal deformability constraint from the GW170817 event. The equation of states of the NS admixed with DM (DMANS) are calculated by incorporating the self-interactions between them. The macroscopic properties, such as mass, radius, and tidal deformability of the NSs, are obtained for HCD models along with five others by varying self-interaction strength. By combining NS observations with scattering cross-section constraints from galaxy clusters, we explore model-dependent trends in the DM self-interaction parameter space. While the quantitative bounds may vary with hadronic model choice, our analysis offers insights into the interplay between DM interactions and NS observables within the RMF framework.\n\n", "2505.08877": "2025-05-13, **On the universality of late-time ringdown tail**, Romeo Felice Rosato et.al., [2505.08877v1](http://arxiv.org/abs/2505.08877v1)\n\n The late time response of vacuum black holes in General Relativity is notoriously governed by power law tails arising from the wave scattering off the curved spacetime geometry far from the black hole. While it is known that such tails are universal to a certain extent, a precise characterization of their key ingredients is missing. Here we provide an analytical proof that the tail fall-off is universal for any effective potential asymptotically decaying as $1/r^2$, while the power law decay is different if the potential decays as $1/r^\\alpha$ with $1<\\alpha<2$. This result extends and revises some previous work and is in agreement with numerical analyses. Our proof is based on an analytical evaluation of the branch cut contribution to the Green function, and includes charged black holes, different kinds of perturbations, Teukolsky equation for the Kerr metric, exotic compact objects, extensions of General Relativity, and environmental effects. In the latter case, our results indicate that tails are largely insensitive to a wide range of physically motivated matter distributions around black holes, including the Navarro Frenk White profile commonly used to model dark matter.\n\n", "2505.08866": "2025-05-13, **A High-Quality Composite Pati-Salam Axion**, Tony Gherghetta et.al., [2505.08866v1](http://arxiv.org/abs/2505.08866v1)\n\n We present a composite QCD axion model where the Peccei--Quinn (PQ) symmetry emerges as a high-quality, accidental symmetry. The axion potential is only modified by eight-fermion, dimension 12 operators, which if present at the Planck scale, allow for axion dark matter from misalignment while solving the strong CP problem. The model is an $\\text{SU}(N\\_c)$ gauge theory with ten flavors where the Pati--Salam unified subgroup $\\text{SO}(6)\\times \\text{SO}(4) \\subset \\text{SU}(10)\\_L$ and $\\text{Sp}(10)\\subset \\text{SU}(10)\\_R$ are weakly gauged. The dynamics breaks $\\text{SU}(10)\\_L\\times \\text{SU}(10)\\_R \\rightarrow \\text{SU}(10)\\_V$ and the weakly-gauged groups to $\\text{U}(3)\\times \\text{U}(2) \\supset \\text{SU}(3)\\_c \\times \\text{SU}(2)\\_L \\times \\text{U}(1)\\_Y$, with the QCD axion identified as one of the Nambu-Goldstone bosons. This axion has a relatively large coupling to photons while a residual $\\bar{\\theta}\\_{\\rm eff}$ may be just below the current limit on the neutron electric dipole moment. If the dimension 12 operators are present near the GUT scale, they can cause domain wall networks to decay, allowing for axion dark matter even for the post-inflationary scenario.\n\n", "2505.08555": "2025-05-13, **Simulation and measurement of Black Body Radiation background in a Transition Edge Sensor**, José Alejandro Rubiera Gimeno et.al., [2505.08555v1](http://arxiv.org/abs/2505.08555v1)\n\n The Any Light Particle Search II (ALPS II) experiment at DESY, Hamburg, is a Light-Shining-through-a-Wall (LSW) experiment aiming to probe the existence of axions and axion-like particles (ALPs), which are candidates for dark matter. Data collection in ALPS II is underway utilizing a heterodyne-based detection scheme. A complementary run for confirmation or as an alternative method is planned using single photon detection, requiring a sensor capable of measuring low-energy photons ($1064\\,\\mathrm{nm}$, $1.165\\,\\mathrm{eV}$) with high efficiency (higher than $50\\,\\%$) and a low background rate (below $7.7\\cdot10^{-6}\\,\\mathrm{cps}$). To meet these requirements, we are investigating a tungsten Transition Edge Sensor (TES) provided by NIST, which operates in its superconducting transition region at millikelvin temperatures. This sensor exploits the drastic change in resistance caused by the absorption of a single photon. We find that the background observed in the setup with a fiber-coupled TES is consistent with Black Body Radiation (BBR) as the primary background contributor. A framework was developed to simulate BBR propagation to the TES under realistic conditions. The framework not only allows the exploration of background reduction strategies, such as improving the TES energy resolution, but also reproduces, within uncertainties, the spectral distribution of the observed background. These simulations have been validated with experimental data, in agreement with the modeled background distribution, and show that the improved energy resolution reduces the background rate in the $1064\\,\\mathrm{nm}$ signal region by one order of magnitude, to approximately $10^{-4}\\,\\mathrm{cps}$. However, this rate must be reduced further to meet the ALPS II requirements.\n\n", "2505.08481": "2025-05-13, **Wormholes in 4D Einstein-Gauss-Bonnet gravity with Bose-Einstein Condensated Dark Matter**, Bibhash Das et.al., [2505.08481v1](http://arxiv.org/abs/2505.08481v1)\n\n In the paper, we obtain a spherically symmetric traversable wormhole (WH) in 4D Einstein-Gauss-Bonnet (EGB) gravity with Bose-Einstein condensated (BEC) dark matter. We consider 4D EGB gravity, which one obtains by regularizing the higher dimensional EGB gravity in the limit $D \\to 4$. The Gauss-Bonnet coupling parameter ($\\alpha$) in this case is rescaled to $\\alpha \\to \\frac{\\alpha}{D-4}$. Considering the energy density profile of non-relativistic BEC matter, the shape function of the WH geometry is determined. The applicability of realistic flaring-out condition and asymptotic flatness conditions are explored here and we determined a domain of model parameters for realistic scenario. We analyse the embedding diagram of the WH obtained here with the study of the proper radial distance, volume integral quantifier, and anisotropy measurement in this model. The vanishing sound speed in the model is analyzed, and found that the WH is stable at the throat for $\\alpha = -0.0512471$ for a set of model parameters. The energy conditions are investigated, and we found that the energy conditions are satisfied at the throat of the WH for a range of the Gauss-Bonnet coupling parameter, $\\alpha \\in [-4,-4.222]$. We obtained a new result where the energy conditions are violated at the throat of the WH except for the above range of the Gauss-Bonnet coupling parameter.\n\n", "2505.08477": "2025-05-13, **Emerging axion detection in artificial magnetoelectric materials**, Runyu Lei et.al., [2505.08477v1](http://arxiv.org/abs/2505.08477v1)\n\n The origin of dark matter is a fundamental problem in physics. Axions are considered a key component of dark matter, characterized by very weak Chern-Simons couplings to electromagnetism, gravity, and fermions. We propose a novel symmetry-breaking detection mechanism in magnetoelectric materials, allowing for a linear axionic coupling between magnetism and ferroelectric polarization. We focus on strain gradient Sr2IrO4, where the breaking of space-inversion symmetry results in an emergent polar phase and out-of-plane magnetic moment, exhibiting a flexomagnetoelectric effect. In this material, the linear P\\|\\|M enables direct coupling between the external axion field and the intrinsic axion-like field within the material. This mechanism amplifies the weak electromagnetic signals induced by axions, paving the way for pioneering axion detection. These signals can be detected by monitoring changes in macroscopic physical quantities, such as the magnetoelectric and magnetic responses. In contrast to conventional detection techniques, this mechanism significantly enhances the sensitivity of the axion-electron and axion-photon coupling, providing a novel platform for axion detection and advancing the study of dark matter through the magnetoelectric effect.\n\n", "2505.08409": "2025-05-13, **Observational constraints on the Kerr and its several single-parameter modified spacetimes using quasi-periodic oscillation data**, Shining Yang et.al., [2505.08409v1](http://arxiv.org/abs/2505.08409v1)\n\n This paper investigates the dynamical effects of particles moving in the Kerr spacetime and its nine single-parameter modified spacetimes, including Bardeen, Ayon-Beato and Garcia (ABG), Hayward, Kerr-Newman (KN), Kerr-Taub-NUT (KTN), Braneworld Kerr (BK), Kerr-MOG, Kerr-Sen, and Perfect Fluid Dark Matter (PFDM) black holes. Using quasi-periodic oscillation (QPO) observational data, we constrain the free parameters of the ten spacetimes through $\\chi^2$ analysis under the relativistic precession model of QPO. We constrain the modification parameters for the nine single-parameter modified spacetimes and provide the spin and mass ranges of three microquasars within the ten spacetime models (including Kerr) at the $68\\%$ confidence level (CL). The results demonstrate that, at the $68 \\%$ CL, the QPO data impose stringent constraints on the free parameters, as evidenced by the narrow confidence intervals. Among them, only the KN spacetime yields a modification parameter constraint spanning both negative and positive values (encompassing the Kerr case at zero). In contrast, all other tested geometries mandate positive-definite parameters at $68 \\%$ CL, demonstrating statistical deviation of the Kerr solution. This highlights the significance of exploring modifications to the Kerr spacetime. Finally, we evaluate the spacetime models using the Bayes factor and the Akaike Information Criterion (AIC). Based on the current QPO observational data, the Bayesian factor analysis indicates that the ABG, Hayward, KN, BK, and Kerr-MOG spacetime have a slight advantage over the Kerr solution, while the Bardeen, KTN, Kerr-Sen, and PFDM spacetime are somewhat inferior to the Kerr model. In contrast, the AIC analysis shows that the Kerr spacetime remains the optimal model under the current QPO data.\n\n", "2505.08358": "2025-05-13, **What can solve the Strong CP problem?**, David E. Kaplan et.al., [2505.08358v1](http://arxiv.org/abs/2505.08358v1)\n\n Three possible strategies have been advocated to solve the strong CP problem. The first is the axion, a dynamical mechanism that relaxes any initial value of the CP violating angle $\\bar{\\theta}$ to zero. The second is the imposition of new symmetries that are believed to set $\\bar{\\theta}$ to zero in the UV. The third is the acceptance of the fine tuning of parameters. We argue that the latter two solutions do not solve the strong CP problem. The $\\theta$ term of QCD is not a parameter - it does not exist in the Hamiltonian. Rather, it is a property of the quantum state that our universe finds itself in, arising from the fact that there are CP violating states of a CP preserving Hamiltonian. It is not eliminated by imposing parity as a symmetry since the underlying theory is already parity symmetric and that does not preclude the existence of CP violating states. Moreover, since the value of $\\theta$ realized in our universe is a consequence of measurement, it is inherently random and cannot be fine tuned by choice of parameters. Rather any fine tuning would require a tuning between parameters in the theory and the random outcome of measurement. Our results considerably strengthen the case for the existence of the axion and axion dark matter. The confusion around $\\theta$ arises from the fact that unlike classical mechanics, the Hamiltonian and Lagrangian are not equivalent in quantum mechanics. The Hamiltonian defines the differential time evolution, whereas the Lagrangian is a solution to this evolution. Consequently, initial conditions could in principle appear in the Lagrangian but not in the Hamiltonian. This results in aspects of the initial condition such as $\\theta$ misleadingly appearing in the Lagrangian as parameters. We comment on the similarity between the $\\theta$ vacua and the violations of the constraint equations of classical gauge theories in quantum mechanics.\n\n", "2505.08154": "2025-05-13, **Quintessence Dark Matter**, Deng Wang et.al., [2505.08154v1](http://arxiv.org/abs/2505.08154v1)\n\n Recently, we give the robust $\\sim2\\,\\sigma$ evidences of dynamical dark matter and beyond $2\\,\\sigma$ signals of the coexistence of dynamical dark matter and dynamical dark energy using current cosmological observations [1]. Here we propose the quintessence dark matter model to explain the evolution of dark matter over time on cosmic scales. Interestingly, we find that the exponential quintessence is likely the origin of such an evolution.\n\n"}, "supernova": {"2505.09479": "2025-05-14, **Supernova in lost common envelope and SN 2006gy**, Nikolai Chugai et.al., [2505.09479v1](http://arxiv.org/abs/2505.09479v1)\n\n A mechanism is proposed for synchronizing core-collapse supernova with a recent loss of a red supergiant (RSG) envelope in the common envelope regime. A perequisite for the synchronization is a moderate RSG expansion during final decade. This scenario is based on the phenomenon of preSN~II dense shell formed at the final stage of 10-20 yr as a result of powerfull mass loss. The energy deposition into the RSG envelope that powers the enormous mass loss rate is able to expand the RSG. The moderate expansion is sufficient for the close secondary component to plunge into the common envelope with a subsequent explosion of stripped helium core. Superluminous SN~2006gy is suggested to be the outcome of this scenario.\n\n", "2505.09470": "2025-05-14, **When Dark Matter Heats Up: A Model-Independent Search for Non-Cold Behavior**, Mazaharul Abedin et.al., [2505.09470v1](http://arxiv.org/abs/2505.09470v1)\n\n This article questions the common assumption of cold dark matter (DM) by exploring the possibility of a non-zero equation of state (EoS) without relying on any parametric approach. In standard cosmological analyses, DM is typically modeled as pressureless dust with $w\\_{\\rm DM} = 0$, an assumption that aligns with large-scale structure formation, supports the empirical success of the $\\Lambda$CDM model, and simplifies cosmological modeling. However, there is no fundamental reason to exclude a non-zero $w\\_{\\rm DM}$ from the cosmological framework. In this work, we explore this possibility through non-parametric and model-independent reconstructions based on Gaussian Process Regression. The reconstructions use Hubble parameter measurements from Cosmic Chronometers (CC), the Pantheon+ sample of Type Ia supernovae, and Baryon Acoustic Oscillation (BAO) data from DESI DR1 and DR2. Our findings suggest that a dynamical EoS for DM, although statistically mild, cannot be conclusively ruled out. Notably, we observe a tendency toward a negative $w\\_{\\rm DM}$ at the present epoch, a result that is particularly intriguing and may have meaningful implications for modern cosmology.\n\n", "2505.09445": "2025-05-14, **The asymmetry of white dwarf double detonations and the observed scatter around the Phillips relation**, Alexander Holas et.al., [2505.09445v1](http://arxiv.org/abs/2505.09445v1)\n\n Recent Type Ia supernova (SN Ia) simulations featuring a double detonation scenario have managed to reproduce the overall trend of the Phillips relation reasonably well. However, most, if not all, multidimensional simulations struggle to reproduce the scatter of observed SNe around this relation, exceeding it substantially. In this study, we investigate whether the excessive scatter around the Phillips relation can be caused by an off-center ignition of the carbon-oxygen (CO) core in the double detonation scenario and if this can help constrain possible SN Ia explosion channels. We simulated the detonation of three different initial CO white dwarfs of $0.9$, $1.0$, and $1.1\\,M\\_\\odot$, artificially ignited at systematically offset locations using the Arepo code. After nucleosynthetic postprocessing, we generated synthetic observables using the Artis code and compared these results against observational data and models of other works. We find that our simulations produce synthetic observables well within the range of the observed data in terms of viewing angle scatter. The majority of the viewing angle variability seems to be caused by line blanketing in the blue wavelengths of intermediate-mass elements and lighter iron-group elements, which are asymmetrically distributed in the outer layers of the ashes. Our results suggest that although the off-center ignition of the CO introduces substantial line of sight effects, it is not responsible for the excessive viewing angle scatter observed in other models. Instead, this effect seems to be caused by the detonation ashes from the rather massive helium (He) shells in current state-of-the-art models. Further reducing the He-shell masses of double detonation progenitors may be able to alleviate this issue and yield observables that reproduce the Phillips relation.\n\n", "2505.09284": "2025-05-14, **Generating Full-field Evolution of Physical Dynamics from Irregular Sparse Observations**, Panqi Chen et.al., [2505.09284v1](http://arxiv.org/abs/2505.09284v1)\n\n Modeling and reconstructing multidimensional physical dynamics from sparse and off-grid observations presents a fundamental challenge in scientific research. Recently, diffusion-based generative modeling shows promising potential for physical simulation. However, current approaches typically operate on on-grid data with preset spatiotemporal resolution, but struggle with the sparsely observed and continuous nature of real-world physical dynamics. To fill the gaps, we present SDIFT, Sequential DIffusion in Functional Tucker space, a novel framework that generates full-field evolution of physical dynamics from irregular sparse observations. SDIFT leverages the functional Tucker model as the latent space representer with proven universal approximation property, and represents observations as latent functions and Tucker core sequences. We then construct a sequential diffusion model with temporally augmented UNet in the functional Tucker space, denoising noise drawn from a Gaussian process to generate the sequence of core tensors.   At the posterior sampling stage, we propose a Message-Passing Posterior Sampling mechanism, enabling conditional generation of the entire sequence guided by observations at limited time steps. We validate SDIFT on three physical systems spanning astronomical (supernova explosions, light-year scale), environmental (ocean sound speed fields, kilometer scale), and molecular (organic liquid, millimeter scale) domains, demonstrating significant improvements in both reconstruction accuracy and computational efficiency compared to state-of-the-art approaches.\n\n", "2505.08946": "2025-05-13, **On the X-ray Emission From Supernovae, and Implications for the Mass-Loss Rates of their Progenitor Stars**, Vikram V. Dwarkadas et.al., [2505.08946v1](http://arxiv.org/abs/2505.08946v1)\n\n We summarize the X-ray emission from young SNe. Having accumulated data on most observed X-ray SNe, we display the X-ray lightcurves of young SNe. We also explore the X-ray spectra of various SN types. The X-ray emission from Type Ib/c SNe is non-thermal. It is also likely that the emission from Type IIP SNe with low mass-loss rates (around 10$^{-7} \\, Msun \\,$ yr$^{-1}$) is non-thermal. As the mass-loss rate increases, thermal emission begins to dominate. Type IIn SNe have the highest X-ray luminosities, and are clearly thermal. We do not find evidence of non-thermal emission from Type IIb SNe. The aggregated data are used to obtain approximate mass-loss rates of the progenitor stars of these SNe. Type IIP's have progenitors with mass-loss rates $< 10^{-5}\\, Msun \\,$ yr$^{-1}$, while Type IIn progenitors generally have mass-loss rates $> 10^{-3}\\, Msun $ yr$^{-1}$. However, we emphasize that the density of the ambient medium is the important parameter, and if it is due to a non-steady outflow solution, it can not be translated into a mass-loss rate.\n\n", "2505.08907": "2025-05-13, **Suppression of Shock X-ray Emission in Novae from Turbulent Mixing with Cool Gas**, Brian D. Metzger et.al., [2505.08907v1](http://arxiv.org/abs/2505.08907v1)\n\n Shock interaction in classical novae occurs when a fast outflow from the white dwarf > 1000 km s/s collides with a slower, cooler shell of gas released earlier in the outburst. The shocks radiate across the electromagnetic spectrum, from radio synchrotron to GeV gamma-rays. The hot shocked gas also emits >~ keV thermal X-rays, typically peaking weeks after the eruption, once the ejecta becomes transparent to photoelectric absorption. However, the observed hard X-ray luminosities are typically >4 orders of magnitude smaller than would be naively expected given the powerful shocks implied by the gamma-rays. We argue that a key missing piece to this puzzle is turbulence behind the shock, driven, e.g., by thin-shell and/or thermal instabilities. Turbulence efficiently mixes the hot X-ray emitting gas with cooler gas, sapping the hot gas of energy faster than it can directly radiate. Using analytic arguments motivated by numerical simulations, we show that energy losses due to turbulent mixing can easily balance shock heating, greatly reducing the volume of the hot gas and suppressing the X-ray luminosity. Equating the characteristic thickness of the X-ray emitting region to the minimum outer length scale of the turbulence capable of cooling the hot gas through mixing, we obtain X-ray luminosities consistent with nova observations if only ~1% of the shock's kinetic power goes into turbulent motions. A similar process may act to suppress thermal X-rays from other shock powered transients, such as interacting supernovae.\n\n", "2505.08856": "2025-05-13, **Expanding Ejecta Method: II. Framework for Cosmological Distance Measurements via Intensity Interferometry**, David Dunsky et.al., [2505.08856v1](http://arxiv.org/abs/2505.08856v1)\n\n We explore the potential of the expanding ejecta method (EEM) as a cosmological probe, leveraging its ability to measure angular diameter distances to supernovae (SNe) with intensity interferometry. We propose three distinct applications of the EEM: (1) using Type IIP SNe as moderate-distance geometric anchors to calibrate Cepheids, replacing other local distance indicators; (2) directly calibrating Type Ia SNe, bypassing conventional calibration methods; (3) constructing a fully independent Hubble diagram with Type IIP (Type Ia) SNe, entirely decoupled from the traditional distance ladder. Incorporating realistic SN populations, we forecast a Hubble constant precision with next-generation intensity interferometers of $1.6\\%$, $1.1\\%$, and $9.3\\% \\,(3.6\\%)$, respectively, for the three different proposed applications. Future intensity interferometry could yield improvements to $1.2\\%$, $0.6\\%$, and $1.5\\%\\,(0.4\\%)$. The EEM thus offers a powerful geometric alternative for cosmic distance determination.\n\n", "2505.08857": "2025-05-13, **Evidence of polar and ultralow supernova kicks from the orbits of Be X-ray binaries**, Ruggero Valli et.al., [2505.08857v1](http://arxiv.org/abs/2505.08857v1)\n\n Supernovae, the explosive deaths of massive stars, create heavy elements and form black holes and neutron stars. These compact objects often receive a velocity at formation, a \"kick\" whose physical origin remains debated. We investigate kicks in Be X-ray binaries, containing a neutron star and a rapidly spinning companion. We identify two distinct populations: one with kicks below $10\\,\\rm{km}\\,\\rm{s}^{-1}$, much lower than theoretical predictions, and another with kicks around $100\\,\\rm{km}\\,\\rm{s}^{-1}$, that shows evidence for being aligned within 5 degrees of the progenitor's rotation axis. The distribution of progenitor masses for the two populations have medians around $2.3\\,\\rm{M}\\_\\odot$ and $4.9\\,\\rm{M}\\_\\odot$, corresponding to stars with birth masses of about $10\\,\\rm{M}\\_\\odot$ and $15\\,\\rm{M}\\_\\odot$. The second component matches the low-velocity mode observed in isolated pulsars. Combined with the known high-velocity component, which dominates isolated pulsars, this suggests three distinct kick modes. These results reveal previously unrecognized diversity in neutron-star formation.\n\n", "2505.08737": "2025-05-13, **Modeling the Light Curve and Spectra of SN 2023aew**, Rachid Ouyed et.al., [2505.08737v1](http://arxiv.org/abs/2505.08737v1)\n\n We propose that the delayed conversion of a neutron star (NS) into either a quark star (QS) or a hybrid star (HS), occurring approximately 105-109 days after the supernova (SN) explosion, injects ~ 2e49 erg of thermal energy into the expanded SN ejecta. This energy, delivered over ~ 40 days via a quark-nova (QN) shock or the spin-down power of the HS, can reproduce the photometric and spectral features observed in SN 2023aew. In this model, the first light curve peak corresponds to the 56Ni-powered SN resulting from a stripped-envelope progenitor with a zero-age main sequence mass of at least ~ (15-16)M\\_sun. The plateau between the two peaks may result from interaction between the SN ejecta and circumstellar material (CSM). Alternatively, it could be explained by the spin-down power of the NS prior to its conversion into a highly magnetized HS, which is responsible for powering the second bump. A scenario involving two phases of spin-down power - first from the NS and later from the HS - is compelling and supports the hypothesis that some magnetars are, in fact, HSs. These HSs acquire their ultra-strong magnetic fields through a quark matter phase capable of sustaining core fields on the order of ~ 1e18 G. In our model, the spin-down energy of the HS powers the QN ejecta - the outermost layers of the NS - before this energy is transferred to the expanded SN ejecta. This process produces luminous fast blue optical transients (LFBOTs). The model establishes a potential connection between superluminous SNe (SLSNe) and LFBOTs, with significant implications for high-energy astrophysics and the r-process nucleosynthesis of heavy elements. Potential consequences for Quantum Chromodynamics (QCD) are also discussed.\n\n", "2505.08332": "2025-05-13, **Improving the detection significance of gravitational wave transient searches with CNN models**, Johann Fernandes et.al., [2505.08332v1](http://arxiv.org/abs/2505.08332v1)\n\n Gravitational wave (GW) transient searches rely on signal-noise discriminators to distinguish astrophysical signals from noise artefacts. These discriminators are typically tuned towards expected signal morphologies, which may limit their effectiveness as detector sensitivity improves and more complex signals, such as from core collapse supernovae or compact binary mergers featuring precession, higher-order harmonics, or eccentricity, become detectable. In this work, we use a Convolutional Neural Network-based approach to classify noise transients from astrophysical transients, aiming to enhance the sensitivity of existing searches. We evaluate our method on two matched filter based searches, PyCBC-IMBH and PyCBC-HM tuned for Intermediate Mass Black Hole (IMBH) binary systems. Our approach improves the sensitive volume-time reach of these searches by approximately 30% at a false alarm rate of once per 100 years. Finally, we apply our method to the first four chunks of the first half of the third observation run and demonstrate a marked improvement in significance. In particular, we significantly improve the first IMBH binary GW event GW190521 with an IFAR exceeding 42000 years.\n\n", "2505.08184": "2025-05-13, **Insights into the 3D layered structure of nearby open clusters through N-body simulations**, Lang Kaixiang et.al., [2505.08184v1](http://arxiv.org/abs/2505.08184v1)\n\n Context. Open clusters (OCs) are important for understanding star formation, dynamics, and evolution. Previous studies have indicated a relationship between cluster structure and member star properties, but the formation mechanism of the layered structure of OCs remains unclear. Aims. We study the three-dimensional spatial distribution of 279 nearby OCs to understand the formation mechanism of the layered structure. Methods. We analyzed the spatial distribution of member stars within each OC and correlated the presence of a layered structure with the number of member stars. Additionally, we performd N-body simulations to model the evolution of OCSN 125. We assessd the correlation between the binary fraction, the most massive star, and the radius of the layered structure in each simulated OC. Results. Our analysis reveals that OCs with fewer member stars tend to lack a layered structure. The results from N-body simulations indicate that the presence of a layered structure is strongly influenced by dynamical factors, particularly the most massive star and the binary fraction. Massive stars drive mass loss through supernova explosions and stellar winds, which weaken the spatial layering. Furthermore, clusters with higher binary fractions exhibit a weaker layered structure, likely due to energy equipartition, dynamical friction, and perturbations caused by binary systems. These factors contribute to delaying core collapse and slowing the emergence of a layered structure. Conclusions. Our findings suggest that dynamical interactions, including the effects of the most massive stars and binary fraction, play a critical role in the formation and disruption of the layered structure in OCs.\n\n"}}