{"neutrino": {"2512.16862": "2025-12-18, **Gravity-assisted neutrino masses**, Stefan Antusch et.al., [2512.16862v1](http://arxiv.org/abs/2512.16862v1)\n\n Gravity is generally expected to violate global symmetries, including lepton number. However, neutrino masses from the Planck-suppressed Weinberg operator are typically too small to account for oscillation data. We propose a new model-building approach to low-scale neutrino mass generation, in which an intermediate spontaneous symmetry-breaking scale generates masses and mixings in the heavy neutral lepton (HNL) sector, while leaving an unbroken residual symmetry $G\\_{\\mathrm{res}}$ that forbids light-neutrino masses. The observed light-neutrino masses then arise because gravity breaks $G\\_{\\mathrm{res}}$ via Planck-suppressed operators, inducing the small lepton-number violation required in low-scale seesaw constructions. The HNLs form pseudo-Dirac pairs, with masses potentially within reach of future colliders and complementary tests in precision searches such as charged lepton flavour violation (cLFV). As an illustration, we present a representative realisation of this class of models and show that, for $\\mathcal{O}(1)$ operator coefficients, it predicts a region in the ($M\\_R$, $Θ^2$)-plane that can be testable via displaced-vertex searches at the High-Luminosity (HL) LHC and the FCC-ee.\n\n", "2512.16781": "2025-12-18, **Dark energy and neutrinos along the cosmic expansion history**, Pietro Ghedini et.al., [2512.16781v1](http://arxiv.org/abs/2512.16781v1)\n\n Recent cosmological measurements are hinting that dark energy may evolve, with its equation of state, $w\\_\\mathrm{DE}$, even showing oscillatory patterns. In this work, we employ a model-independent approach to jointly reconstruct $w\\_\\mathrm{DE}$ and the sum of neutrino masses, $\\sum m\\_ν$, adopting the PCHIP method with seven fixed nodes in which we allow the two parameters to vary. We employ CMB, Baryon Acoustic Oscillations and Supernovae Ia data to constrain the values of $w\\_\\mathrm{DE}$ and $\\sum m\\_ν$ at each node. We conduct three different analyses in which we reconstruct $w\\_\\mathrm{DE}$: one with fixed $\\sum m\\_ν=0.06~\\mathrm{eV}$; one in which we allow $\\sum m\\_ν$ to vary, and one in which we also reconstruct $\\sum m\\_ν$ using the PCHIP method. We find the dark energy equation of state to be consistent with the cosmological constant scenario, except when including DESI data and allowing for phantom crossing, where we find a $95\\%$ CL deviation from $w\\_\\mathrm{DE}=-1$ around $z\\sim1.2$. For neutrino masses, we obtain looser constraints when focusing on phantom dark energy, that show further early and late relaxation when reconstructing the mass via the PCHIP method.\n\n", "2512.16562": "2025-12-18, **Prompt Searches for Very-High-Energy γ-Ray Counterparts to IceCube Astrophysical Neutrino Alerts**, J. Abhir et.al., [2512.16562v1](http://arxiv.org/abs/2512.16562v1)\n\n The search for sources of high-energy astrophysical neutrinos can be significantly advanced through a multi-messenger approach, which seeks to detect the gamma rays that accompany neutrinos as they are produced at their sources. Multi-messenger observations have so far provided the first evidence for a neutrino source, illustrated by the joint detection of the flaring blazar TXS 0506+056 in highenergy (HE, E > 1 GeV) and very-high-energy (VHE, E > 100 GeV) gamma rays in coincidence with the high-energy neutrino IceCube-170922A, identified by IceCube. Imaging atmospheric Cherenkov telescopes (IACTs), namely FACT, H.E.S.S., MAGIC, and VERITAS, continue to conduct extensive neutrino target-of-opportunity follow-up programs. These programs have two components: followup observations of single astrophysical neutrino candidate events (such as IceCube-170922A), and observation of known gamma-ray sources after the identification of a cluster of neutrino events by IceCube. Here we present a comprehensive analysis of follow-up observations of high-energy neutrino events observed by the four IACTs between September 2017 (after the IceCube-170922A event) and January 2021. Our study found no associations between gamma-ray sources and the observed neutrino events. We provide a detailed overview of each neutrino event and its potential counterparts. Furthermore, a joint analysis of all IACT data is included, yielding combined upper limits on the VHE gamma-ray flux.\n\n", "2512.16554": "2025-12-18, **Double shell structure in supernova 2024ggi**, Kobi Shiran et.al., [2512.16554v1](http://arxiv.org/abs/2512.16554v1)\n\n We built a simple toy model of a core-collapse supernova (CCSN) ejecta composed of two shells, an outer low-mass spherical shell and an inner elongated massive shell, and show that it can reproduce the evolution of the photospheric radius of SN 2024ggi, Rph(t). During the first week, the larger spherical shell, the S-shell, forms the photosphere. As the shell expands and becomes increasingly transparent, the photosphere moves inward along the mass coordinate, although it grows in size. When the photosphere reaches the long axis of the elongated inner shell, the E-shell begins to contribute to the photosphere, ultimately comprising the entire photosphere. The simple toy model explains the transition of Rph(t) from being concave (decreasing slope) to convex (increasing slope). A single-shell model predicts only concave behavior. The structure of a spherical shell with an inner elongated shell is motivated by the morphologies of several CCSN remnants whose structures have been attributed to multiple pairs of jets in the framework of the jittering jets explosion mechanism (JJEM). The deduced multiple-shell ejecta of SN 2024ggi in this study, and of SN 2023ixf in an earlier study, as well as studies of the polarization of SN 2024ggi, are better compatible with the JJEM than with the neutrino-driven mechanism. Our study supports the growing evidence that the JJEM is the primary explosion mechanism of CCSNe.\n\n", "2512.16517": "2025-12-18, **How massive neutrinos reshape the cosmic web**, Leonor N. L. Simões et.al., [2512.16517v1](http://arxiv.org/abs/2512.16517v1)\n\n We explore the effects of massive neutrinos on the cosmic web using the FLAMINGO simulations. We classify the cosmic web into voids, sheets, filaments, and clusters, and find that massive neutrinos affect the environment by decreasing the volume occupied by clusters and voids. We find that increasing the neutrino mass shifts the volume-weighted density distribution towards higher densities and leads to a more narrow density distribution, which we interpret as neutrinos delaying structure formation. We construct the minimum spanning tree (MST) graph from the subhaloes, adopting a number density chosen to match that expected for DESI-like observations. We show that most MST edges lie in filaments, approximately 70% throughout different simulations, which we link to its sensitivity to neutrino mass. We also link the MST's edge length signal at different scales to different cosmic web environments, with clusters dominating the signal at small scales, voids at longer scales, and filaments at intermediate scales. The strong correlation between MST edges and cosmic web environments reinforces the MST's potential to be used as a classifier for large-scale structure in galaxy surveys. We compare the effects of baryonic physics and massive neutrinos and find that each produces distinct signatures in MST edge lengths. This analysis is performed in 3D space, using the true positions of subhaloes and not accounting for redshift space distortions. Nevertheless, these results emphasise the MST's capability to go beyond two-point statistics, motivating future applications to real observational data.\n\n", "2512.16427": "2025-12-18, **CHIC: Caley-Hamilton, Invariants and Constants for Neutrino Oscillation Probabilities and Gradients**, Pablo Fernández-Menéndez et.al., [2512.16427v1](http://arxiv.org/abs/2512.16427v1)\n\n We use the Caley-Hamilton theorem to derive analytical solutions for the three-flavor neutrino propagation amplitude in a constant-density medium and their derivatives with respect to the mixing parameters. This approach avoids the diagonalization of the Hamiltonian and exploits precomputed matrix invariants to separate the dependence of oscillation probabilities on neutrino energy and propagation baseline. The results are implemented in the CHIC software, which provides simple, fast and efficient computation of oscillation probabilities and their derivatives. Finally, we demonstrate the value of probability gradients for neutrino data analyses and introduce a complementary visualization, the oscillograds, to probe underlying features of neutrino mixing.\n\n", "2512.16281": "2025-12-18, **Neutrino Propagation in Quantum Field Theory at Short and Long Baselines**, Vadim A. Naumov et.al., [2512.16281v1](http://arxiv.org/abs/2512.16281v1)\n\n In a quantum field approach to neutrino oscillations, the neutrino is treated as a propagator, while the external initial and final particle states are described by covariant wave packets. For the asymptotic behavior on short and long macroscopic baselines, the wave packet modified neutrino propagator is expressed through asymptotic series in powers of dimensionless Lorentz and rotation invariant variables. In both regimes, leading-order corrections violate the classical inverse-square law and lead to a decrease in the neutrino-induced event rate. The possibility that the so-called reactor antineutrino anomaly can, at least partially, be explained within this approach is discussed.\n\n", "2512.16222": "2025-12-18, **Long-lived particle production through the PRISM**, Kevin J. Kelly et.al., [2512.16222v1](http://arxiv.org/abs/2512.16222v1)\n\n Accelerator-based neutrino experiments offer a competitive environment to search for long-lived particles with sub-GeV masses. Yet, many theoretical models involving such particles predict very similar phenomenology and nearly identical final-state signatures. In view of this, we study the capabilities of upcoming experiments -- specifically the DUNE near detectors -- to distinguish between different classes of long-lived particles and the mechanisms by which they are produces. We expound how the experiment's excellent energy resolution, combined with the possibility to move the detector off-axis (the DUNE-PRISM concept), work in tandem to improve the discrimination power.\n\n", "2512.16180": "2025-12-18, **Fatjet Signatures of Quintuplet Fermions at the LHC**, Sourabh Dube et.al., [2512.16180v1](http://arxiv.org/abs/2512.16180v1)\n\n This paper explores a simplified extension of the standard model featuring a neutral fermion quintuplet and a scalar quadruplet, which together generate neutrino masses through tree and loop level mechanisms. The quintuplet fermions decay into standard model gauge bosons via the scalars, producing unique collider signatures at the LHC characterized by multilepton and multijet final states. The study focuses on the pair production of quintuplet fermions in the 700-1200 GeV mass range, where their decays produce highly boosted W and Z bosons identifiable as fatjets. Emphasis is placed on the production and decay of doubly charged fermions due to their higher cross section. Advanced jet substructure and kinematic techniques are applied to enhance sensitivity by reducing standard model backgrounds. A detailed analysis of signal significance is performed in the two lepton, two fatjet and three lepton, one fatjet channels for different masses of the fermion and the scalars, optimizing selection cuts to maximize signal efficiency over standard model backgrounds. The study found that both channels exhibit excellent performance, with significance exceeding $5σ$ under realistic conditions including a 50\\% background uncertainty at integrated luminosity up to 3000 fb$^{-1}$.\n\n", "2512.16100": "2025-12-18, **Visible and Invisible Pseudoscalar Meson Decays from Anomaly Sum Rules**, Xurong Chen et.al., [2512.16100v1](http://arxiv.org/abs/2512.16100v1)\n\n The decays of pseudoscalar mesons to real and virtual photons as well as neutrino-antineutrino pairs are considered in the framework of the dispersive method based on Anomaly Sum Rules. The contribution of singlet channel involving the new non-perturbative gluon form factor of virtual photon $B(q^2)$ is systematically taken into account. The detailed analysis of its dependence on photon virtuality $q^2$ relying on the available data for meson transition fomfactors is performed. It is shown that B has quite a nontrivial structure at $q^2 \\sim 1 GeV^2$ which may be a signal of the existence of pseudoscalar glueball with a mass about 1.5-2 GeV. The calculation of the decay to $ν\\bar ν$ pairs leads to the compatibility with the result of Arnellos, Marciano and Parsa of 1982, when pion decay is considered neglecting the mixing effects. The account for these effects results, however, in the enhancement of pion branching ratio by a factor of 3, while that for eta decay is larger by several orders of magnitude. It is stressed, that dependence on the pair invariant mass is entirely defined by QCD and coincides with that of the meson transition form factor. The role of obtained results for the physics at HHaS detector at HIAF is discussed.\n\n"}, "dark matter": {"2512.16916": "2025-12-18, **Discovering gravitational waveform distortions from lensing: a deep dive into GW231123**, Juno C. L. Chan et.al., [2512.16916v1](http://arxiv.org/abs/2512.16916v1)\n\n Gravitational waves (GWs) are unique messengers as they travel through the Universe without alteration except for gravitational lensing. Their long wavelengths make them susceptible to diffraction by cosmic structures, providing an unprecedented opportunity to map dark matter substructures. Identifying lensed events requires the analysis of thousands to millions of simulated events to reach high statistical significances. This is computationally prohibitive with standard GW parameter estimation methods. We build on top of state-of-the-art neural posterior algorithms to accelerate the lensed inference from CPU days to minutes with DINGO-lensing. We showcase its capabilities by reanalyzing GW231123, the most promising lensed candidate so far, and find that its statistical significance cannot exceed 4$σ$. We observe that 8% of GW231123-like nonlensed simulations favor lensing, which could be explained by the self-similarity of short-duration signals. Still, 58% of GW231123-like lensed simulations have larger support for lensing, showing that higher detection statistics are possible. Although GW231123 exposes the challenges of claiming the first GW lensing detection, our deep-learning methods have demonstrated to be powerful enough to enable the upcoming discovery of lensed GWs.\n\n", "2512.16809": "2025-12-18, **Impact of Supercooling on Direct Searches for Dark Matter and Gravitational Wave Backgrounds**, Davide Racco et.al., [2512.16809v1](http://arxiv.org/abs/2512.16809v1)\n\n An interesting feature of a cosmological phase transition can be a stage of exponential expansion (supercooling). The modified expansion history and the entropy injection at reheating, can affect the final energy fraction of dark matter. In this paper, we revisit the calculation of the freeze-out and freeze-in dynamics, showing additional effects on top of the standard dilution factor if the dark matter production is completed during the supercooling stage. We show for the first time how these effects can be particularly interesting for direct detection, as the parameter space for WIMP-like candidates shifts from excluded to allowed regions, and freeze-in candidates get closer to experimental reach. A phenomenological motivation to consider supercooling is the associated gravitational wave background. The implications of a finite-duration reheating stage, when the equation of state is close to matter-domination, are a peculiar low-frequency spectrum, and its shift to lower frequencies. These effects are a complementary test of the dynamics that we study for dark matter production, and remarkably can link direct detection of dark matter and gravitational wave astronomy.\n\n", "2512.16783": "2025-12-18, **Consistent Excesses in the LHC Electroweak SUSY Searches: GUT-based Singlino/Higgsino Interpretation in the NMSSM**, Emanuele Bagnaschi et.al., [2512.16783v1](http://arxiv.org/abs/2512.16783v1)\n\n The search for supersymmetric models remains one of the main items on the BSM search program at the LHC, with EW SUSY partners still allowed with masses as low as a few hundred GeV. Over the last years, searches for the \"golden channel\", $pp \\to \\tildeχ^0\\_2 \\tildeχ^{\\pm}\\_1 \\to \\tildeχ^0\\_1 Z^{(*)} \\tildeχ^0\\_1 W^{\\pm (*)}$ show consistent excesses between ATLAS and CMS in the 2~soft-lepton and 3~soft-lepton plus missing-$E\\_T$ searches, assuming $m\\_{\\tildeχ^0\\_2} \\approx m\\_{\\tildeχ^{\\pm}\\_1} \\gtrsim 200$ GeV and $Δm\\_{21} := m\\_{\\tildeχ^0\\_2} - m\\_{\\tildeχ^0\\_1} \\approx 20$ GeV. We interpret these excesses in the framework of the Next-to-Minimal Supersymmetric Standard Model. We assume a singlino dominated lightest neutralino as a Dark Matter (DM) candidate. The second and third lightest neutralinos are higgsino like, with the higgsino mixing parameter $μ$ being smaller than the soft SUSY-breaking bino and wino masses, $M\\_1$ and $M\\_2$. We furthermore assume the approximate GUT relations $M\\_1 \\sim M\\_2/2 \\sim M\\_3/6$, with the implication for our scenario of a gluino mass $m\\_{\\tilde{g}} \\sim M\\_3 \\gtrsim 3$ TeV. Scalar masses are assumed to heavy and do not play a role in our analysis. We find that this scenario is in agreement with all relevant experimental constraints, comprising the LHC searches for SUSY particles and additional Higgs bosons, the LHC Higgs-boson rate measurements, the DM direct detection limits and the upper limit on the DM relic density. We demonstrate that this scenario gives an excellent description of the observed excesses in the search for 2~and 3~soft-leptons plus \\ETmiss, with $m\\_{\\tildeχ^0\\_2} \\sim m\\_{\\tildeχ^0\\_3} \\sim m\\_{\\tildeχ^{\\pm}\\_1}$ and $Δm\\_{21} \\sim 20$ GeV. This constitutes the first explanation of the soft-lepton excesses in a model with GUT relations among the soft SUSY-breaking parameters.\n\n", "2512.16769": "2025-12-18, **Operation of silicon photomultipliers in a dilution refrigerator down to 9.4 mK towards a cryogenic cosmic ray muon veto system**, QUEST-DMC Collaboration et.al., [2512.16769v1](http://arxiv.org/abs/2512.16769v1)\n\n We report the characterisation of a FBK NUV-HD-cryo silicon photomultiplier (SiPM) sensor operated in an 9.4 $\\pm$ 0.2 mK environment inside a dilution refrigerator, towards the development of a cryogenic cosmic ray muon veto system to be operated internal to a dilution refrigerator required for low background experiments such as the QUEST-DMC dark matter search experiment. We characterise the single photon response and the gain (the charge produced per detected photon), the dark count noise rate, and correlated noise contributions as a function of operating voltage. This paper also reports first proof of concept measurements of using a SiPM directly coupled to scintillator in a 9.4 mK temperature environment, towards detecting candidate cosmic ray muon signals.\n\n", "2512.16451": "2025-12-18, **Coherence from Randomness: Sub-keV Dark Matter Scattering off Random, Heterogeneous Materials**, Zhi-Han Liu et.al., [2512.16451v1](http://arxiv.org/abs/2512.16451v1)\n\n The sub-keV mass range has long posed a challenge for the direct detection of dark matter via elastic scattering. In this Letter, we propose a new mechanism in which dark matter, assumed to be quadratically coupled to SM particles, scatters from random heterogeneous materials with intrinsic density fluctuations, yielding an enhanced coherent response. This effect can substantially increase the total scattering rate and induce measurable accelerations of the target. Using this idea, we derive new constraints from the MICROSCOPE mission that extend into previously unexplored parameter space for sub-keV dark matter, probing cross sections down to $\\sim 4\\times10^{-38}\\,\\mathrm{cm^2}$.\n\n", "2512.16312": "2025-12-18, **PHELEX: Three Series Of Measurements in the Search for Dark Photons**, A. V. Kopylov et.al., [2512.16312v1](http://arxiv.org/abs/2512.16312v1)\n\n This paper presents the results of measurements of diurnal variations in the single electron count rate arising from dark photon conversion at the cathode of a gas proportional counter. Three experimental series were conducted, each consisting of 4 runs lasting approximately 60 days per run. One can expect an excess in the single electron count rate above the average level if the polarization vector of dark photons in the region traversed by the Sun forms an angle between 20 and 50 degrees with the Earth's rotational axis. Such an effect was observed in the first series (significance 6 sigma) and the second series (significance 4 sigma). However, in the third series, which employed two identical detectors simultaneously, the effect was not observed on either detector. This result practically excludes the possibility that the effect observed earlier was purely instrumental. The results of the three series may be interpreted as a possible effect arising from the Sun's passage through regions of dark matter characterized by different orientations of the dark photon polarization vector.\n\n", "2512.16290": "2025-12-18, **The dominant role of dark matter halo in quenching central galaxies**, Dingyi Zhao et.al., [2512.16290v1](http://arxiv.org/abs/2512.16290v1)\n\n Understanding the quenching of star formation in central galaxies remains a core challenge in galaxy evolution. Two decades ago, the concept of halo quenching was introduced as a dominant mechanism, positing that massive central galaxy quenching is governed by the thermodynamics of gas predominantly influenced by dark matter halos. However, a vastly increasing body of observational evidence consistently indicates that quenching correlates predominantly with central properties like velocity dispersion, bulge mass, and black hole mass. When these properties are controlled, halo mass appears to show weak influence, supporting AGN feedback as the primary mechanism. A recurring key issue, however, is that these studies rely on halo masses derived via abundance matching (AM). Direct observational measurements from weak lensing, satellite kinematics, and galactic dynamics reveal that AM systematically overestimates halo masses of star-forming centrals while underestimating those of passive ones. To accurately assess the true role of halo mass. we re-estimated halo masses for SDSS groups; the resulting halo mass function and stellar-to-halo mass relations (SHMRs) for both populations match theoretical predictions and weak lensing measurements. Using these improved masses, we find direct observational evidence that halo mass is the dominant factor in quenching central galaxies, with a clear threshold at $M\\_{h}\\sim 10^{12.1}M\\_\\odot; $. By applying a simple correction to AM data using weak lensing-derived SHMRs, we demonstrate that previous claims regarding the dominance of central properties stem primarily from systematic biases in AM halo masses. Our results suggest that the significance of AGN feedback is primarily manifested in halos above this mass threshold, in galaxies already primed for quenching. In other words, AGN feedback appears to become effective in halos above this mass threshold.\n\n", "2512.16162": "2025-12-18, **Probing neutron star interiors and the properties of cold ultra-dense matter with the SKAO**, Avishek Basu et.al., [2512.16162v1](http://arxiv.org/abs/2512.16162v1)\n\n Matter inside neutron stars is compressed to densities several times greater than nuclear saturation density, while maintaining low temperatures and large asymmetries between neutrons and protons. Neutron stars, therefore, provide a unique laboratory for testing physics in environments that cannot be recreated on Earth. To uncover the highly uncertain nature of cold, ultra-dense matter, discovering and monitoring pulsars is essential, and the SKA will play a crucial role in this endeavour. In this paper, we will present the current state-of-the-art in dense matter physics and dense matter superfluidity, and discuss recent advances in measuring global neutron star properties (masses, moments of inertia, and maximum rotation frequencies) as well as non-global observables (pulsar glitches and free precession). We will specifically highlight how radio observations of isolated neutron stars and those in binaries -- such as those performed with the SKA in the near future -- inform our understanding of ultra-dense physics and address in detail how SKAO's telescopes unprecedented sensitivity, large-scale survey and sub-arraying capabilities will enable novel dense matter constraints. We will also address the potential impact of dark matter and modified gravity models on these constraints and emphasise the role of synergies between the SKA and other facilities, specifically X-ray telescopes and next-generation gravitational wave observatories.\n\n"}, "supernova": {"2512.16801": "2025-12-18, **SNR 1987A : Spitzer data from days 6000 to 8000 revisited**, Patrice Bouchet et.al., [2512.16801v1](http://arxiv.org/abs/2512.16801v1)\n\n An excess emission has been observed by Spitzer in the [3, 5] micron range of the SNR 1987A spectrum. It is generally argued that this excess could be due to the presence of warm amorphous carbon dust in the equatorial ring (ER) around the supernova, but the proposed models all have problems. This prompted us to present an alternative view on the interpretation of the Spectral Energy Distribution (SED) of SNR 1987A from the near-IR wavelengths to the radio frequencies (from 3 micron up to 1.4 GHz), between 6000 and 8000 days after outburst. We argue that the origin of that excess could be attributed instead to a free-free emission. We show that under very specific conditions (the free-free is self-absorbed at a cut-off frequency imposed by the mass of the emitting region), it could be produced by collisional heating of the gas. We then discuss the time evolution of the various components of the SED. We establish a linear relationship between the growth of the warm carbon dust mass and that of the silicates dust during the analyzed period. Finally, we build the Spitzer light curves and we show that our models reproduce the observations pretty well, although our study clearly favors the free-free case. In conclusion, we argue that the free-free model provides a formally very good description of the data, however the model does require some very specific parameter choices, and results in an unusually low temperature for the ionized gas.\n\n", "2512.16591": "2025-12-18, **An effective $\\boldsymbolΛ$-Szekeres modelling of the local Universe with Cosmicflows-4**, Marco Galoppo et.al., [2512.16591v1](http://arxiv.org/abs/2512.16591v1)\n\n We develop an effective description of the local cosmic environment, namely, for redshift $z \\lesssim 0.1$, to quantify the bias induced by local structure on cosmological observables. Our approach models the metric of the nearby Universe as a superposition of multi-structured $Λ$-Szekeres patches, calibrated against the HAMLET peculiar velocity and density field reconstructions of Cosmicflows-4. From this framework we compute the fully inhomogeneous and anisotropic quasilocal expansion field predicted by our model, and use it to assess the impact of local structure on estimates of $H\\_0$. For this purpose we analyse low-redshift Type Ia supernovae from the Pantheon+ catalogue. We find that accounting for the local structure increases the Hubble tension, yielding a shift in the best-fit value of the Hubble constant of order $ΔH\\_0 \\approx 0.5\\ \\mathrm{km\\,s^{-1}Mpc^{-1}}$.\n\n", "2512.16404": "2025-12-18, **Implementing F (T ) Gravity in Boltzmann Codes: A Framework for Power Spectrum Computation**, Robert Rugg et.al., [2512.16404v1](http://arxiv.org/abs/2512.16404v1)\n\n This work investigates the nonlinearity of the power-law model of F(T) gravity, highlighting the inability of the Boltzmann solver CLASS to handle nonlinear models. As a workaround, a second-order Taylor expansion is applied to the nonlinear field equations, under the assumption that the extra degree of freedom n, which quantifies deviations from the currently favored cosmological model (ΛCDM), remains sufficiently small to preserve the key properties of the ΛCDM model. The validity of the Taylor expansion is supported by supernova data indicating n \\leq 0.05, for which the power spectrum can be accurately computed within CLASS with a negligible truncation error.\n\n", "2512.16253": "2025-12-18, **Gravitational wave interactions with a viscous fluid: Core collapse supernova, binary neutron star merger, and accretion around a black hole merger**, Nigel T. Bishop et.al., [2512.16253v1](http://arxiv.org/abs/2512.16253v1)\n\n The interaction of gravitational waves (GWs) with matter is normally treated as being insignificant. However, recent work has shown that the interaction with a viscous fluid may be astrophysically important when the distance between the matter and GW source is somewhat smaller than the GW wavelength. Previous work has mainly considered perturbations on a Minkowski background, and here these results are extended to the case that the background is a general, non-vacuum, static, spherically symmetric spacetime. Expressions are obtained for GW damping and the consequent heating of the fluid, and implemented in computer code. The results are applied to astrophysical scenarios: Core collapse supernovae, the post-merger signal from a binary neutron star merger, and matter accreting at a binary black hole merger. It is found that, compared to the Minkowski case, the damping and heating effects increase, in some cases by several orders of magnitude. It is possible for a GW signal to be completely damped, and for the heating to be such that a gamma-ray burst occurs.\n\n", "2512.16130": "2025-12-18, **Unraveling the anomaly in the production of $^{60}$Fe nucleus in massive stars**, Samapti Lakshan et.al., [2512.16130v1](http://arxiv.org/abs/2512.16130v1)\n\n The production of $^{60}$Fe is crucial for nucleosynthesis in massive stars and supernovae. In this work, by using the microscopic EP+IPM (exact pairing plus the independent-particle model) for the nuclear level density (NLD) and extended EP+PDM (exact pairing plus phonon damping model) for the $γ$-ray strength function (gSF), we re-evaluate the substantial enhancement of $^{60}$Fe production recently reported in {\\it A. Spyrou et al., Nat. Comm. {\\bf 15}, 9608 (2024)}, which was attributed to an unexpectedly large Maxwellian-averaged cross section (MACS). Our analysis demonstrates that this enhancement indeed originates from the choice of NLD, which, despite being constrained to reproduce the total NLD and gSF data, lacks a reliable spin dependence, a critical input for Hauser-Feshbach calculations of nuclear reaction rate. In contrast, our predictions yield a significantly lower MACS, calling the claimed enhancement into question. In particular, our approach highlights the microscopic nature of the low-energy enhancement of the gSF, the so-called upbend resonance, which arises from strong particle-particle ($pp$) and hole-hole ($hh$) excitations that emerge only at finite temperature, thereby further reinsisting on the invalidity of the Brink-Axel hypothesis in this low-energy region. Overall, our study reopens the question on the long-standing problem of $^{60}$Fe production in massive stars.\n\n"}}