{"neutrino": {"2402.00490": "2024-02-01, **Testing the Number of Neutrino Species with a Global Fit of Neutrino Data**, Manuel Ettengruber et.al., [2402.00490v1](http://arxiv.org/abs/2402.00490v1)\n\n We present the first experimental constraints on models with many additional neutrino species in an analysis of current neutrino data. These types of models are motivated as a solution to the hierarchy problem by lowering the species scale of gravity to TeV. Additionally, they offer a natural mechanism to generate small neutrino masses and provide interesting dark matter candidates. This study analyzes data from DayaBay, KamLAND, MINOS, NOvA and KATRIN. We do not find evidence for the presence of any additional neutrino species, therefore we report lower bounds on the allowed number of neutrino species realized in nature. For the normal/inverted neutrino mass ordering, we can give a lower bound on the number of neutrino species of O(30) and O(100), respectively, over a large range of the parameter space.\n\n", "2402.00392": "2024-02-01, **Dirac or Majorana: Higgs-$Z^\\prime$ probe to investigate neutrino nature**, ShivaSankar K. A. et.al., [2402.00392v1](http://arxiv.org/abs/2402.00392v1)\n\n We propose a novel approach to determine one of the most important properties of neutrinos, namely, a Dirac or Majorana particle in a scenario with a new $U(1)\\_X$ gauge symmetry. In this scenario, three right-handed neutrinos are inevitably introduced due to the gauge anomaly cancellations. We find that the decay branching ratio of the discovered Higgs boson into a pair of new massive gauge bosons ($Z'$) can significantly be enhanced in the Dirac neutrino case as compared with the Majorana case for a fixed value of the new gauge coupling and the mass of $Z'$ under constraints from current experimental data. Because of such an enhancement, the Dirac case can indirectly be tested via the Higgs decay in addition to the absence of neutrinoless double-beta decays.\n\n", "2402.00283": "2024-02-01, **Supernova burst and Diffuse Supernova Neutrino Background simulator for Water Cherenkov Detectors**, Fumi Nakanishi et.al., [2402.00283v1](http://arxiv.org/abs/2402.00283v1)\n\n If a galactic supernova explosion occurs in the future, it will be critical to rapidly alert the community to the direction of the supernova by utilizing neutrino signals in order to enable the initiation of follow-up optical observations. In addition, there is anticipation that observation of the diffuse supernova neutrino background will yield discoveries in the near future, given that experimental upper limits are approaching theoretical predictions. We have developed a new supernova event simulator for water Cherenkov neutrino detectors, such as the highly sensitive Super-Kamiokande. This simulator calculates the neutrino interaction in water for the two types of supernova neutrinos described above. Its purpose is to evaluate the precision in determining the location of supernovae and to estimate the expected number of events related to the diffuse supernova neutrino background in Super-Kamiokande. In this paper, we describe the basic structure of the simulator and its demonstration.\n\n"}, "dark matter": {"2402.00819": "2024-02-01, **Further understanding the interaction between dark energy and dark matter: current status and future directions**, B Wang et.al., [2402.00819v1](http://arxiv.org/abs/2402.00819v1)\n\n The interaction between dark matter and dark energy can be incorporated into field theory models of dark energy that have proved successful in alleviating the coincidence problem. We review recent advances in this field, including new models and constraints from different astronomical data sets. We show that interactions are allowed by observations and can reduce the current tensions among different measurements of cosmological parameters. We extend our discussion to include constraints from non-linear effects and results from cosmological simulations. Finally, we discuss forthcoming multi-messenger data from current and future observational facilities that will help to improve our understanding of the interactions within the dark sector.\n\n", "2402.00785": "2024-02-01, **Apparent Dark Matter Inspired by Einstein Equation of State**, Kimet Jusufi et.al., [2402.00785v1](http://arxiv.org/abs/2402.00785v1)\n\n The purpose of this article is twofold. First, by means of Padmanabhan's proposal on the emergence nature of gravity, we recover the $\\Lambda$CDM model and the effect of the dark matter in the context of cosmology. Toward this goal, we use the key idea of Padmanabhan that states cosmic space emerges as the cosmic time progress and link the emergence of space to the difference between the number of degrees of freedom on the boundary and in the bulk. Interestingly enough, we show that the effect of the cold dark matter in the cosmological setup can be understood by assuming an interaction between the numbers of degrees of freedom in the bulk. In the second part, we follow the Jacobson's argument and obtain the modified Einstein field equations with additional dark matter component emerging due to the interaction term between dark energy and baryonic matter related by $\\Omega\\_{DM,0}=\\sqrt{2 \\alpha \\Omega\\_{M,0} \\Omega\\_{DE,0}}$, where $\\alpha$ is a coupling constant. Finally, a correspondence with Yukawa cosmology is pointed out, and the role of massive gravitons as a possibility in explaining the nature of the dark sector as well as the theoretical origin of the Modified Newtonian Dynamics (MOND) are addressed. We speculate that the interaction coupling $\\alpha$ fundamentally measures the entanglement between the gravitons and matter fields and there exists a fundamental limitation in measuring the gravitons wavelength.\n\n", "2402.00741": "2024-02-01, **Axion Dark Matters from Cosmic String Network**, Heejoo Kim et.al., [2402.00741v1](http://arxiv.org/abs/2402.00741v1)\n\n We perform the lattice simulation to estimate the axion dark matter abundance radiated from the global cosmic strings in the post-inflationary scenario. The independent numerical confirmation on the recently observed logarithmic growth in both the number of strings per Hubble patch and the spectral index of the power-law scaling for the axion spectrum is reported. These logarithmic scalings are checked against two different prescriptions for generating initial random field configurations, namely fat-string type and thermal phase transition. We discuss a possible strong correlation between axion spectrum and the string evolutions with different initial conditions to support the insensitivity of scaling behaviors against different initial data and we provide a qualitative understanding of it. The impact of various combinations of the power law of the axion spectrum, nonlinearities around the QCD scale, and average inter-string distances on the axion abundance is discussed. Additionally, we introduce a new novel string identification method, based on the tetrahedralization of the space, which guarantees the connectedness of the strings and provides a convenient way of assigning the core location. Finally we derive the lower bound on the axion mass.\n\n", "2402.00473": "2024-02-01, **Detecting Extragalactic Axion-like Dark Matter with Polarization Measurements of Fast Radio Bursts**, Bao Wang et.al., [2402.00473v1](http://arxiv.org/abs/2402.00473v1)\n\n Axions or axion-like particles (ALPs) are one of the most promising candidates of dark matter (DM). A prevalent method to detect axion-like DM is to seek the periodic oscillation feature in the polarization angles of linearly polarized light emitted from astrophysical sources. In this work, we use the time-resolved polarization measurements of the hyperactive repeating fast radio burst, FRB 20220912A, detected by the Five-hundred-meter Aperture Spherical radio Telescope (FAST) to search for extragalactic axion-like DM for the first time. Given a DM density profile of FRB 20220912A's host, we obtain upper limits on the ALP-photon coupling constant of $g\\_{a \\gamma}<(2.9 \\times 10^{-11}-1.1\\times 10^{-9})\\,\\mathrm{GeV}^{-1}$ for the ALP masses $m\\_a \\sim (1.4\\times10^{-21}-5.2\\times10^{-20})$ eV. Persistent polarimetric observations with FAST would further improve the constraints. We prove that FRBs offer an alternative way to detect axion-like DM on extragalactic distance scales, complementary to other galactic DM probes.\n\n"}, "supernova": {"2402.00844": "2024-02-01, **Kinematic reconstruction of torsion as dark energy in Friedmann cosmology**, A. M. Vicente et.al., [2402.00844v1](http://arxiv.org/abs/2402.00844v1)\n\n In this paper we study the effects of torsion of space-time in the expansion of the universe as a candidate to dark energy. The analysis is done by reconstructing the torsion function along cosmic evolution by using observational data of Supernovae type Ia and Hubble parameter measurements. We have used a kinematic model for the parameterization of the comoving distance and the Hubble parameter, then the free parameters of the models are constrained by observational data. The reconstruction of the torsion function is obtained directly from the data, using the kinematic parameterizations, and the values for the Hubble parameter and the deceleration parameter are in good agreement to the standard model estimates.\n\n", "2402.00701": "2024-02-01, **From total destruction to complete survival: Dust processing at different evolutionary stages in the supernova remnant Cassiopeia A**, Florian Kirchschlager et.al., [2402.00701v1](http://arxiv.org/abs/2402.00701v1)\n\n The expanding ejecta of supernova remnants (SNRs) are believed to form dust in dense clumps of gas. Before the dust can be expelled into the interstellar medium and contribute to the interstellar dust budget, it has to survive the reverse shock that is generated through the interaction of the preceding supernova blast wave with the surrounding medium. The conditions under which the reverse shock hits the clumps change with remnant age and define the dust survival rate. To study the dust destruction in the SNR Cassiopeia A, we conduct magnetohydrodynamical simulations of the evolution of a supernova blast wave and of the reverse shock. In a second step we use these evolving conditions to model clumps that are disrupted by the reverse shock at different remnant ages. Finally, we compute the amount of dust that is destroyed by the impact of the reverse shock. We find that most of the dust in the SNR is hit by the reverse shock within the first 350 yr after the SN explosion. While the dust destruction in the first 200 yr is almost complete, we expect greater dust survival rates at later times and almost total survival for clumps that are first impacted at ages beyond 1000 yr. Integrated over the entire evolution of the SNR, the dust mass shows the lowest survival fraction (17 per cent) for the smallest grains (1 nm) and the highest survival fraction (28 per cent) for the largest grains (1000 nm).\n\n", "2402.00621": "2024-02-01, **Estimate for the bulk viscosity of strongly coupled quark matter**, Jesús Cruz Rojas et.al., [2402.00621v1](http://arxiv.org/abs/2402.00621v1)\n\n Modern hydrodynamic simulations of core-collapse supernovae and neutron-star mergers require knowledge not only of the equilibrium properties of strongly interacting matter, but also of the system's response to perturbations, encoded in various transport coefficients. Using perturbative and holographic tools, we derive here an improved weak-coupling and a new strong-coupling result for the most important transport coefficient of unpaired quark matter, its bulk viscosity. These results are combined in a simple analytic pocket formula for the quantity that is rooted in perturbative Quantum Chromodynamics at high densities but takes into account nonperturbative holographic input at neutron-star densities, where the system is strongly coupled. This expression can be used in the modeling of unpaired quark matter at astrophysically relevant temperatures and densities.\n\n", "2402.00578": "2024-02-01, **Discovery and timing of pulsar J2016$+$3711 in supernova remnant CTB 87 with FAST**, Qian-Cheng Liu et.al., [2402.00578v1](http://arxiv.org/abs/2402.00578v1)\n\n We report on our discovery of the radio pulsar, PSR J2016$+$3711, in supernova remnant (SNR) CTB 87, with a $\\sim10.8\\sigma$ significance of pulses, which confirms the compact nature of the X-ray point source in CTB 87. It is the first pulsar discovered in SNRs using Five-hundred-meter Aperture Spherical radio Telescope (FAST). Its integrated radio pulse profile can be well described by a single component, with a width at 50% of the peak flux density of about 28.1$^\\circ$ and an effective width of about 32.2$^\\circ$. The mean flux density at 1.25 GHz is estimated to be about 15.5$\\mu$Jy. Combined with the non-detection of the radio pulse at lower frequencies, the radio spectral index of the pulsar is constrained to be $\\lesssim 2.3$. We also present the timing solution based on 28 follow-up FAST observations. Our results reveal a period of 50.81 ms, period derivative of $7.2\\times 10^{-14}$ s s$^{-1}$, and dispersion measure of 428 pc cm$^{-3}$. The strength of the equatorial surface magnetic dipole magnetic field is inferred to be about $1.9\\times10^{12}$ G. Using the ephemeris obtained from the radio observations, we searched Fermi-LAT data for gamma-ray pulsations but detected no pulsed signal. We also searched for radio pulses with FAST toward the X-ray counterpart of the gamma-ray binary HESS J1832$-$093 proximate to SNR G22.7$-$00.2 but found no signal.\n\n"}}