{"neutrino": {"2306.11653": "2023-06-20, **Implications of the DLMA solution of $θ_{12}$ for IceCube data using different astrophysical sources**, Monojit Ghosh et.al., [2306.11653v1](http://arxiv.org/abs/2306.11653v1)\n\n In this paper, we study the implications of the Dark Large Mixing Angle (DLMA) solutions of $\\theta\\_{12}$ in the context of the IceCube data. We study the consequences in the measurement of the neutrino oscillation parameters namely $\\theta\\_{23}$ and $\\delta\\_{\\rm CP}$ in light of both Large Mixing Angle (LMA) and DLMA solutions of $\\theta\\_{12}$. We find that it will be impossible for IceCube to determine the $\\delta\\_{\\rm CP}$ and the true nature of $\\theta\\_{12}$ i.e., LMA or DLMA at the same time. This is because of the existence of an intrinsic degeneracy at the Hamiltonian level between these parameters. Apart from that, we also identify a new degeneracy between $\\theta\\_{23}$ and two solutions of $\\theta\\_{12}$ for a fixed value of $\\delta\\_{\\rm CP}$. We perform a chi-square fit using three different astrophysical sources, i.e., $\\mu$ source, $\\pi$ source, and $n$ source to find that both $\\mu$ source and $\\pi$ source are allowed within $1 \\sigma$ whereas the $n$ source is excluded at $2 \\sigma$. It is difficult to make any conclusion regarding the measurement of $\\theta\\_{23}$, $\\delta\\_{\\rm CP}$ for $\\mu$ source. However, The $\\pi$ ($n$) source prefers higher (lower) octant of $\\theta\\_{23}$ for both LMA and DLMA solution of $\\theta\\_{12}$. The best-fit value of $\\delta\\_{\\rm CP}$ is around $180^\\circ$ ($0^\\circ/360^\\circ$) for LMA (DLMA) solution of $\\theta\\_{12}$ whereas for DLMA (LMA) solution of $\\theta\\_{12}$, the best-fit value is around $0^\\circ/360^\\circ$ ($180^\\circ$) for $\\pi$ ($n$) source. If we assume the current best-fit values of $\\theta\\_{23}$ and $\\delta\\_{\\rm CP}$ to be true, then the $\\mu$ and $\\pi$ source prefer the LMA solution of $\\theta\\_{12}$ whereas the $n$ source prefers the DLMA solution of $\\theta\\_{12}$.\n\n", "2306.11461": "2023-06-20, **Neutrino Mixing Phenomenology: \\boldsymbol{$A_4$} Discrete Flavor Symmetry with Type-I Seesaw Mechanism**, Animesh Barman et.al., [2306.11461v1](http://arxiv.org/abs/2306.11461v1)\n\n We study a neutrino mass model with $A\\_4$ flavor symmetry using a type-I seesaw mechanism. The inclusion of extra flavons in our model leads to the deviations from exact tribimaximal mixing pattern resulting in a nonzero $\\theta\\_{13}$ consistent with the recent experimental results and a sum rule for light neutrino masses is also obtained. In this framework, a connection is established among the mixing angles ($\\theta\\_{13}$, $\\theta\\_{12}$, $\\theta\\_{13}$) and the Dirac CP-violation phase $\\delta\\_{CP}$. This model also allows us a prediction of Jarlskog parameter $J\\_{CP}$ and the octant of the mixing angle $\\theta\\_{23}$. We use the parameter space of our model of neutrino masses to study the neutrinoless double beta decay parameter $m\\_{ee}$.\n\n", "2306.11090": "2023-06-19, **Distinctive nuclear signatures of low-energy atmospheric neutrinos**, Anna M. Suliga et.al., [2306.11090v1](http://arxiv.org/abs/2306.11090v1)\n\n New probes of neutrino mixing are needed to advance precision studies. One promising direction is via the detection of low-energy atmospheric neutrinos (below a few hundred MeV), to which a variety of near-term experiments will have much-improved sensitivity. Here we focus on probing these neutrinos through distinctive nuclear signatures of exclusive neutrino-carbon interactions -- those that lead to detectable nuclear-decay signals with low backgrounds -- in both neutral-current and charged-current channels. Here the neutral-current signature is a line at 15.11 MeV and the charged-current signatures are two- or three-fold coincidences with delayed decays. We calculate the prospects for identifying such events in the Jiangmen Underground Neutrino Observatory (JUNO), a large-scale liquid-scintillator detector. A five-year exposure would yield about 16 neutral-current events (all flavors) and about 16 charged-current events (mostly from $\\nu\\_e + \\bar{\\nu}\\_e$, with some from $\\nu\\_\\mu + \\bar{\\nu}\\_\\mu$), and thus roughly 25\\% uncertainties on each of their rates. Our results show the potential of JUNO to make the first measurement of sub-100 MeV atmospheric neutrinos. They also a step towards multi-detector studies of low-energy atmospheric neutrinos, including with the goal of identifying additional distinctive nuclear signatures for carbon and other targets.\n\n", "2306.10876": "2023-06-19, **Saving CNB assisted EDE model at the expense of quantum corrections?**, Michael Maziashvili et.al., [2306.10876v1](http://arxiv.org/abs/2306.10876v1)\n\n As it is suggested in \\cite{Sakstein:2019fmf, CarrilloGonzalez:2020oac}, one can dynamically introduce the coincidence time-scale for EDE in the framework of a particular mass-varying-neutrino-model as a time at which neutrinos constituting the cosmic neutrino background enter the non-relativistic regime. The model does not predict, however, the right amount of EDE density because of smallness of neutrino masses. One may hope to adjust the parameters in such a way as to ensure that the two-loop contributions are kept small while at the same time the effective mass for scalar field that enters the expression of zero-point-energy (for the field trapped in the minimum of effective potential) is sufficient for explaining the needed amount of EDE. Unfortunately, the answer is not in the affirmative.\n\n"}, "dark matter": {"2306.11717": "2023-06-20, **Equivalence of matter-type modified gravity theories to general relativity with nonminimal matter interaction**, Özgür Akarsu et.al., [2306.11717v1](http://arxiv.org/abs/2306.11717v1)\n\n We show that gravity models, such as $f(\\mathcal{L}\\_{\\rm m})$, $f(g\\_{\\mu\\nu} T^{\\mu\\nu})$ and $f(T\\_{\\mu\\nu} T^{\\mu\\nu})$, that modify the introduction of the material source in the usual Einstein-Hilbert action by adding only matter-related terms to the matter Lagrangian density $\\mathcal{L}\\_{\\rm m}$ are equivalent to general relativity with nonminimal interactions. Through the redefinition $\\mathcal{L}\\_{\\rm m}+f \\rightarrow \\mathcal{L}\\_{\\rm m}^{\\rm tot}$, these models are exactly GR, yet the usual material field $T\\_{\\mu\\nu}$ and its accompanying partner, viz., the modification field $T\\_{\\mu\\nu}^{\\rm mod}$ interact nonminimally. That is, $\\nabla^{\\mu}T\\_{\\mu\\nu}=-Q\\_{\\nu}=-\\nabla^{\\mu}T\\_{\\mu\\nu}^{\\rm mod}$, where $Q\\_{\\nu}$ is the interaction kernel that governs the rate of energy transfer. We focus on the particular model, the energy-momentum squared gravity, where the usual material field $T\\_{\\mu\\nu}$ brings in an accompanying energy-momentum squared field , $T\\_{\\mu\\nu}^{\\rm emsf}$ along with a sui generis nonminimal interaction between them. Compared to usual phenomenological nonminimal interaction models in the literature, EMSF gives rise to more intricate interaction kernels having covariant formulation even with simple forms of the $f$ function. We elaborate upon EMSF via some different aspects: a DE component induced from the interaction of sources such as cold dark matter and relativistic species with their accompanying EMSFs generating interacting DE-DM models, mimicking noncanonical scalar field, etc., or a Hoyle-type creation field generating steady-state universe models extended to fluids other than dust and a mimicker of modified generalized Chaplygin gas. We also demonstrate the proper calculation of second metric variation of $\\mathcal{L}\\_{\\rm m}$, as well as in models that contain scalars like $g\\_{\\mu\\nu} T^{\\mu\\nu}\\,,R\\_{\\mu\\nu}T^{\\mu\\nu}$ and $G\\_{\\mu\\nu} T^{\\mu\\nu}$.\n\n", "2306.11649": "2023-06-20, **Symplectic lattice gauge theories on Grid: approaching the conformal window**, Ed Bennett et.al., [2306.11649v1](http://arxiv.org/abs/2306.11649v1)\n\n Symplectic gauge theories coupled to matter fields lead to symmetry enhancement phenomena that have potential applications in such diverse contexts as composite Higgs, top partial compositeness, strongly interacting dark matter, and dilaton-Higgs models. These theories are also interesting on theoretical grounds, for example in reference to the approach to the large-N limit. A particularly compelling research aim is the determination of the extent of the conformal window in gauge theories with symplectic groups coupled to matter, for different groups and for field content consisting of fermions transforming in different representations. Such determination would have far-reaching implications, but requires overcoming huge technical challenges.   Numerical studies based on lattice field theory can provide the quantitative information necessary to this endeavour. We developed new software to implement symplectic groups in the Monte Carlo algorithms within the Grid framework. In this paper, we focus most of our attention on the Sp(4) lattice gauge theory coupled to four (Wilson-Dirac) fermions transforming in the 2-index antisymmetric representation, as a case study. We discuss an extensive catalogue of technical tests of the algorithms and present preliminary measurements to set the stage for future large-scale numerical investigations. We also include the scan of parameter space of all asymptotically free Sp(4) lattice gauge theories coupled to varying number of fermions transforming in the antisymmetric representation.\n\n", "2306.11606": "2023-06-20, **Detectability of Supermassive Dark Stars with the Roman Space Telescope**, Saiyang Zhang et.al., [2306.11606v1](http://arxiv.org/abs/2306.11606v1)\n\n The first bright objects to form in the Universe at redshift $z \\sim 10-20$ might have been Dark Stars, made primarily of hydrogen and helium but powered by dark matter. In this study, we investigate the detectability of Supermassive Dark Stars (SMDS) by the Roman Space Telescope. RST will be able to detect SMDSs at redshifts as high as $z\\simeq 14$. In cases with gravitational lensing factors of $\\mu\\sim 100$, RST will be able to find SMDS as small as $\\sim10^4 M\\_{\\odot}$ at $z\\sim 12$ with $\\sim 10^6$ s of exposure. To differentiate SMDS from early galaxies containing zero metallicity stars at similar redshifts, we compare their spectra, photometry in RST bands, color indexes and image morphology. With RST alone, the differentiation is possible only for limited cases: SMDS formed via \"adiabatic contraction\" (DM pulled into the star via gravity alone) with $M\\gtrsim 10^5M\\_{\\odot}$ and lensed by $\\mu\\gtrsim 30$ have distinct photometric signatures from those of the first galaxies. For SMDSs formed via \"dark matter capture,\" their spectra are degenerate to those of many galaxies with little to no nebular emission. Thus with RST alone, the only way to tell them apart from first galaxies would be via image morphology: i.e. point object (SMDSs) vs. extended object (sufficiently magnified galaxies). However, if the same objects are further examined by JWST spectroscopy, a \"smoking gun\" for detection of SMDS is the HeII $\\lambda$1640 absorption line. While RST does not cover the wavelength band required to find this line (for $z\\_{\\rm emi}\\gtrsim 10$), JWST does. Hence the two detectors can be used together in identifying SMDS. The confirmed detection of any SMDSs will provide evidence for a new type of star, powered by dark matter. Moreover, such massive stars can also be natural progenitors of the supermassive black holes powering the extremely bright quasars observed at $z\\gtrsim 6$.\n\n", "2306.11602": "2023-06-20, **Chemodynamical models of our Galaxy**, James Binney et.al., [2306.11602v1](http://arxiv.org/abs/2306.11602v1)\n\n A chemodynamical model of our galaxy is fitted to data from DR17 of the APOGEE survey supplemented with data from the StarHorse catalogue and gaia DR3. Dynamically, the model is defined by action-based distribution functions for dark matter and six stellar components plus a gas disc. The gravitational potential jointly generated by the model's components is used to examine the galaxy's chemical composition within action space. The observational data probably cover all parts of action space that are populated by stars. The overwhelming majority of stars have angular momentum J\\_\\phi>0 implying that they were born in the Galactic disc. High-alpha stars dominate in a region that is sharply bounded by J\\_\\phi \\la J\\_\\phi(solar). Chemically the model is defined by giving each stellar component a Gaussian distribution in ([Fe/H],[Mg/Fe]) space about a mean that is a linear function of the actions. The model's 47 dynamical and 70 chemical parameters are chosen to maximise the likelihood of the data given the model in 72 three-dimensional velocity spaces and 30 two-dimensional chemical spaces. The circular speed falls steadily from 237\\kms at R=4\\kpc to 218\\kms at R=20\\kpc. Dark matter contributes half the radial force on the Sun and has local density 0.011\\msun\\pc^{-3}, there being 24.5\\msun\\pc^{-2} in dark matter and 26.5\\msun\\pc^{-2} in stars within 1.1\\kpc of the plane.\n\n", "2306.11575": "2023-06-20, **A Hunt for Magnetic Signatures of Hidden-Photon and Axion Dark Matter in the Wilderness**, Ibrahim A. Sulai et.al., [2306.11575v1](http://arxiv.org/abs/2306.11575v1)\n\n Earth can act as a transducer to convert ultralight bosonic dark matter (axions and hidden photons) into an oscillating magnetic field with a characteristic pattern across its surface. Here we describe the first results of a dedicated experiment, the Search for Non-Interacting Particles Experimental Hunt (SNIPE Hunt), that aims to detect such dark-matter-induced magnetic-field patterns by performing correlated measurements with a network of magnetometers in relatively quiet magnetic environments (in the wilderness far from human-generated magnetic noise). Our experiment constrains parameter space describing hidden-photon and axion dark matter with Compton frequencies in the 0.5-5.0 Hz range. Limits on the kinetic-mixing parameter for hidden-photon dark matter represent the best experimental bounds to date in this frequency range.\n\n", "2306.11437": "2023-06-20, **Multi-state Dirac stars**, Chen Liang et.al., [2306.11437v1](http://arxiv.org/abs/2306.11437v1)\n\n In this paper, we construct the multi-state Dirac stars (MSDSs) consisting of two pairs of Dirac fields. The two pairs of Dirac fields are in the ground state and the first excited state, respectively. Each pair consists of two fields with opposite spins, ensuring spherical symmetry of the system. We discuss the solutions of the MSDSs under synchronized and nonsynchronized frequencies. By varying the mass $\\tilde{\\mu}\\_1$ of the excited state Dirac field and the frequency $\\tilde{\\omega}\\_0$ of the ground state Dirac field, we obtain different types of solutions, including single-branch and double-branch solutions. These two types of solutions do not smoothly transition into each other as the parameters $\\tilde{\\mu}\\_1$ and $\\tilde{\\omega}\\_0$ continuously change, but undergo a sudden transition when $\\tilde{\\mu}\\_1$ ($\\tilde{\\omega}\\_0$) is greater than or less than the threshold value of $0.7694$ ($0.733$). Furthermore, we analyze the characteristics of the various MSDSs solutions and analyze the relationship between the ADM mass $M$ of the MSDSs and the synchronized and nonsynchronized frequencies. Subsequently, we calculate the binding energy $E\\_B$ of the MSDSs and discuss the stability of the solutions. Finally, we discuss the feasibility of simulating the dark matter halos using MSDSs.\n\n", "2306.11349": "2023-06-20, **Neutron Dark Decay**, Bartosz Fornal et.al., [2306.11349v1](http://arxiv.org/abs/2306.11349v1)\n\n There exists a puzzling disagreement between the results for the neutron lifetime obtained in experiments using the beam technique versus those relying on the bottle method. A possible explanation of this discrepancy postulates the existence of a beyond-Standard-Model decay channel of the neutron involving new particles in the final state, some of which can be dark matter candidates. We review the current theoretical status of this proposal and discuss the particle physics models accommodating such a dark decay. We then elaborate on the efforts undertaken to test this hypothesis, summarizing the prospects for probing neutron dark decay channels in future experiments.\n\n", "2306.11317": "2023-06-20, **Horn-array haloscope for volume-efficient broadband axion searches**, Junu Jeong et.al., [2306.11317v1](http://arxiv.org/abs/2306.11317v1)\n\n The invisible axion is a hypothetical particle that arises from the Peccei-Quinn mechanism proposed to resolve the CP problem in quantum chromodynamics, and is considered one of the most favoured candidates for cold dark matter. Dish antennas can provide a useful scheme for sensitive search for dark matter axions. The conversion power through axion-photon couplings is proportional to the surface area of the metal plate, rather than the volume of the available magnetic field. To maximize the effect, we propose an advanced concept of haloscope that involves an array of horn antennae to increase the axion-induced photons and a reflector to focus them onto a photo sensor. Compared to other proposed schemes, this configuration can significantly improve the experimental sensitivity, especially in the terahertz region.\n\n", "2306.11045": "2023-06-19, **A study of the evolution of bulges and disks of spiral galaxies in interacting and isolated environments**, Ankit Kumar et.al., [2306.11045v1](http://arxiv.org/abs/2306.11045v1)\n\n Galaxies usually reside in groups and clusters where they interact gravitationally. These interactions affect the internal dynamics of the galaxies. In this thesis, we have studied the effect of flyby interactions and dark matter distributions on the evolution of bulges and disks of spiral galaxies. To understand the effect of flyby interactions on the bulges, disks, and spiral arms of Milky Way mass galaxies, we simulated disk galaxies with classical bulges and boxy/peanut pseudo-bulges, then performed their flyby interactions with 1/10 and 1/5 mass galaxies. Using photometric and kinematic bulge-disk decompositions of the major galaxy, we showed that the disks get shorter and thicker during flyby interactions. Classical bulges remain intact. However, pseudo-bulges become dynamically hotter. Tidally induced spiral arms are transient density waves. They form soon after pericenter passage and decay in two phases; the initial rapid winding and the subsequent slow winding. We showed that the spirals are the main drivers of wave-like vertical breathing motion seen in the Milky Way. Tidal interactions do not directly induce breathing motion. In another work, we showed that the oblate dark matter halos delay bar formation, so bar buckling is also delayed, but probate halos promote multiple bucklings. Due to multiple bucklings, boxy/peanut bulges in prolate halos show the maximum thickness. Using SDSS galaxies, we found that pseudo-bulges are diffuse compared to classical bulges and are commonly found in low mass galaxies. In the local volume, pseudo-bulges overcome the classical bulges even in bulge dominated galaxies, so more than $75\\%$ of local volume is rotation dominated. Finally, we showed that bulgeless galaxies in Illustris TNG50 are metal-poor, have high specific angular momentum as compared to the galaxies with bulges and fall at the lower end of baryonic to dark matter mass ratio.\n\n", "2306.10896": "2023-06-19, **Dilaton-induced open quantum dynamics**, Christian Käding et.al., [2306.10896v1](http://arxiv.org/abs/2306.10896v1)\n\n In modern cosmology, scalar fields with screening mechanisms are often used as explanations for phenomena like dark energy or dark matter. Amongst a zoo of models, the environment dependent dilaton, screened by the Polyakov-Damour mechanism, is one of the least constrained ones. Using recently developed path integral tools for directly computing reduced density matrices, we study the open quantum dynamics of a probe, modelled by another real scalar field, induced by interactions with an environment comprising fluctuations of a dilaton. As the leading effect, we extract a correction to the probe's unitary evolution, which can be observed as a frequency shift. Assuming the scalar probe to roughly approximate a cold atom in matter wave interferometry, we show that comparing the predicted frequency shifts in two experimentally distinct setups has the potential to exclude large parts of the dilaton parameter space.\n\n", "2306.10828": "2023-06-19, **Gravitational Wave Probes on Self-Interacting Dark Matter Surrounding an Intermediate Mass Black Hole**, Kenji Kadota et.al., [2306.10828v1](http://arxiv.org/abs/2306.10828v1)\n\n The presence of dark matter overdensities surrounding a black hole can influence the evolution of a binary system. The gravitational wave signals emitted by a black hole binary offer a promising means to probe the dark matter environments near a black hole. The dense region of dark matter can lead to the dephasing of gravitational waveforms, which can be detected by upcoming experiments such as the Laser Interferometer Space Antenna (LISA). The dark matter density profile around the black hole can vary for different dark matter models. Our study specifically investigates the impact of the ultralight self-interacting scalar dark matter (SIDM) on the gravitational wave signals emitted by black hole binaries. A distinctive characteristic of SIDM surrounding a black hole, as opposed to collisionless dark matter, is the formation of a soliton core. We perform a Fisher matrix analysis to estimate the size of the soliton and the corresponding SIDM parameter space that future LISA-like gravitational wave experiments can explore.\n\n", "2306.10764": "2023-06-19, **Multi-frequency probes of 2HDM+S dark matter**, Geoff Beck et.al., [2306.10764v1](http://arxiv.org/abs/2306.10764v1)\n\n The two-Higgs-doublet with additional scalar (2HDM$+S$) model is one proposed to account for several anomalies that have persisted and increased in significance over runs 1 and 2 at the Large Hadron Collider (LHC). In addition to this, 2HDM+$S$ also supplies a potential Dark Matter (DM) candidate coupling to the Standard Model via the $S$ boson. So far, this model has been difficult to constrain by indirect means. Here we will explore the potential of Omega Centauri, a nearby globular cluster to constrain this interesting DM model. Although such structures are generally considered to be lacking in DM, arguments have been made that this cluster is in fact the relic of a tidally stripped dwarf galaxy. In such a scenario, the DM content would be significant. Combined with its nearness, this would suggest a potential for powerful indirect dark matter signals. We employ both Fermi-LAT gamma-ray data, as well as MeerKAT telescope sensitivities to determine the current status of Omega Centauri as a source of indirect constraints on Weakly Interacting Massive Particles (WIMPs) in a 2HDM+$S$ scenario and for general annihilation channels.\n\n", "2306.10732": "2023-06-19, **Frequency Modulation of Gravitational Waves by Ultralight Scalar Dark Matter**, Ke Wang et.al., [2306.10732v1](http://arxiv.org/abs/2306.10732v1)\n\n The oscillating pressure of the ultralight scalar dark matter (DM) can induce the oscillation of the local gravitational potential. Similar to the time-dependent frequency shift for the pulse signals of pulsars, the oscillation of the local gravitational potential can induce a time-dependent frequency shift (or frequency modulation) for quasi-monochromatic gravitational wave (GW) signals from galactic white dwarf (WD) binaries. To make this effects detectable, we suppose that some galactic WD binaries are located in the DM clumps/subhalos where the energy density of DM is about eight orders of magnitude higher than that at the position of the Earth. Turn to the fisher information matrix, we find that the amplified GW frequency modulation induced by the ultralight scalar DM with mass $m=1.67\\times10^{-23}-4.31\\times10^{-23}[{\\rm eV}/c^2]$ can be detected by LISA.\n\n"}, "supernova": {"2306.11666": "2023-06-20, **Neural Astrophysical Wind Models**, Dustin D. Nguyen et.al., [2306.11666v1](http://arxiv.org/abs/2306.11666v1)\n\n The bulk kinematics and thermodynamics of hot supernovae-driven galactic winds is critically dependent on both the amount of swept up cool clouds and non-spherical collimated flow geometry. However, accurately parameterizing these physics is difficult because their functional forms are often unknown, and because the coupled non-linear flow equations contain singularities. We show that deep neural networks embedded as individual terms in the governing coupled ordinary differential equations (ODEs) can robustly discover both of these physics, without any prior knowledge of the true function structure, as a supervised learning task. We optimize a loss function based on the Mach number, rather than the explicitly solved-for 3 conserved variables, and apply a penalty term towards near-diverging solutions. The same neural network architecture is used for learning both the hidden mass-loading and surface area expansion rates. This work further highlights the feasibility of neural ODEs as a promising discovery tool with mechanistic interpretability for non-linear inverse problems.\n\n", "2306.11663": "2023-06-20, **Not so fast, not so furious: just magnetic**, Landstreet et.al., [2306.11663v1](http://arxiv.org/abs/2306.11663v1)\n\n WD0810-353 is a white dwarf within the 20pc volume around the Sun. Using Gaia astrometric distance and proper motions, and a radial velocity derived from Gaia spectroscopy, it has been predicted that this star will pass within 1pc of the Solar System in about 30kyr. However, WD0810-353 has been also shown to host a magnetic field with strength of the order of 30MG. Its spectrum is therefore not like those of normal DA stars of similar effective temperature. We have obtained and analysed new polarised spectra of the star around Halpha. Our analysis suggests that the visible surface of the star shows two regions of different field strength (~30 and ~45MG, respectively), and opposite polarity. The spectra do not change over a 4 year time span, meaning that either the stellar rotation period is no shorter than several decades, or that the field is symmetric about the rotation axis. Taking into account magnetic shift and splitting, we obtain an estimate of the radial velocity of the star (+83+/- 140km/s); we reject both the value an the claimed precision deduced from the Gaia DR3 spectroscopy (-373.7+/- 8.2km/s), and we conclude that there will probably be no close encounter between the Solar System and WD0810-353. We also reject the suggestion that the star is a hypervelocity runaway star, a survivor of a Type Ia Supernova explosion. It is just a stellar remnant in the Solar neighborhood with a very strong and complex magnetic field.\n\n", "2306.11545": "2023-06-20, **A Machine Learning Approach to Galactic Emission-Line Region Classification**, Carter Lee Rhea et.al., [2306.11545v1](http://arxiv.org/abs/2306.11545v1)\n\n Diagnostic diagrams of emission-line ratios have been used extensively to categorize extragalactic emission regions; however, these diagnostics are occasionally at odds with each other due to differing definitions. In this work, we study the applicability of supervised machine-learning techniques to systematically classify emission-line regions from the ratios of certain emission lines. Using the Million Mexican Model database, which contains information from grids of photoionization models using \\texttt{cloudy}, and from shock models, we develop training and test sets of emission line fluxes for three key diagnostic ratios. The sets are created for three classifications: classic \\hii{} regions, planetary nebulae, and supernova remnants. We train a neural network to classify a region as one of the three classes defined above given three key line ratios that are present both in the SITELLE and MUSE instruments' band-passes: [{\\sc O\\,iii}]$\\lambda5007$/H$\\beta$, [{\\sc N\\,ii}]$\\lambda6583$/H$\\alpha$, ([{\\sc S\\,ii}]$\\lambda6717$+[{\\sc S\\,ii}]$\\lambda6731$)/H$\\alpha$. We also tested the impact of the addition of the [{\\sc O\\,ii}]$\\lambda3726,3729$/[{\\sc O\\,iii}]$\\lambda5007$ line ratio when available for the classification. A maximum luminosity limit is introduced to improve the classification of the planetary nebulae. Furthermore, the network is applied to SITELLE observations of a prominent field of M33. We discuss where the network succeeds and why it fails in certain cases. Our results provide a framework for the use of machine learning as a tool for the classification of extragalactic emission regions. Further work is needed to build more comprehensive training sets and adapt the method to additional observational constraints.\n\n", "2306.11409": "2023-06-20, **The $γ$-process nucleosynthesis in core-collapse supernovae. I. A novel analysis of $γ$-process yields in massive stars**, L. Roberti et.al., [2306.11409v1](http://arxiv.org/abs/2306.11409v1)\n\n The $\\gamma$-process nucleosynthesis in core-collapse supernovae is generally accepted as a feasible process for the synthesis of neutron-deficient isotopes beyond iron. However, crucial discrepancies between theory and observations still exist: the average production of $\\gamma$-process yields from massive stars are too low to reproduce the solar distribution in galactic chemical evolution calculations, and the yields of the Mo and Ru isotopes are by a further factor of 10 lower than the yields of the other $\\gamma$-process nuclei. We investigate the $\\gamma$-process in 5 sets of core-collapse supernova models published in literature with initial masses 15, 20, and 25 M$\\_{\\odot}$ at solar metallicity. We compared the $\\gamma$-process overproduction factors from the different models. To highlight the possible effect of nuclear physics input, we also considered 23 ratios of two isotopes close to each other in mass, relative to their solar values. Further, we investigated the contribution of C-O shell mergers in the supernova progenitors as an additional site of the $\\gamma$-process. Our analysis shows that a large scatter among the different models exists for both the $\\gamma$-process integrated yields and the isotopic ratios. We found only 10 ratios that agree with their solar values, all the others differ by at least a factor of 3 from the solar values in all the considered sets of models. The $\\gamma$-process within C-O shell mergers mostly influence the isotopic ratios that involve intermediate and heavy proton-rich isotopes with $\\rm A>100$.\n\n", "2306.11102": "2023-06-19, **CoLFI: Cosmological Likelihood-free Inference with Neural Density Estimators**, Guo-Jian Wang et.al., [2306.11102v1](http://arxiv.org/abs/2306.11102v1)\n\n In previous works (Wang et al. 2020, 2022), we proposed to estimate cosmological parameters with the artificial neural network (ANN) and the mixture density network (MDN). In this work, we propose an improved method called the mixture neural network (MNN) to achieve parameter estimation by combining ANN and MDN, which can overcome shortcomings of the ANN and MDN methods. Besides, we propose sampling parameters in a hyper-ellipsoid for the generation of the training set, which makes the parameter estimation more efficient. A high-fidelity posterior distribution can be obtained using $\\mathcal{O}(10^2)$ forward simulation samples. In addition, we develop a code-named ``CoLFI'' for parameter estimation, which incorporates the advantages of MNN, ANN, and MDN, and is suitable for any parameter estimation of complicated models in a wide range of scientific fields. CoLFI provides a more efficient way for parameter estimation, especially for cases where the likelihood function is intractable or cosmological models are complex and resource-consuming. It can learn the conditional probability density $p(\\boldsymbol\\theta\\|\\boldsymbol{d})$ using samples generated by models, and the posterior distribution $p(\\boldsymbol\\theta\\|\\boldsymbol{d}\\_0)$ can be obtained for a given observational data $\\boldsymbol{d}\\_0$. We tested the MNN using power spectra of the cosmic microwave background and Type-Ia supernovae and obtained almost the same result as the Markov Chain Monte Carlo method. The numerical difference only exists at the level of $\\mathcal{O}(10^{-2}\\sigma)$. The method can be extended to higher dimensional data.\n\n", "2306.11100": "2023-06-19, **Supernova Rates and Luminosity Functions from ASAS-SN I: 2014--2017 Type Ia SNe and Their Sub-Types**, D. D. Desai et.al., [2306.11100v1](http://arxiv.org/abs/2306.11100v1)\n\n We present the volumetric rates and luminosity functions (LFs) of Type Ia supernovae (SNe Ia) from the $V$-band All-Sky Automated Survey for Supernovae (ASAS-SN) catalogues spanning discovery dates from UTC 2014-01-26 to UTC 2017-12-29. Our standard sample consists of 404 SNe Ia with $m\\_{V,\\mathrm{peak}}<17$ mag and Galactic latitude $\\|b\\|>15^{\\circ}$. Our results are both statistically more precise and systematically more robust than previous studies due to the large sample size and high spectroscopic completeness. We make completeness corrections based on both the apparent and absolute magnitudes by simulating the detection of SNe Ia in ASAS-SN light curves. We find a total volumetric rate for all sub-types of $R\\_{\\mathrm{tot}}=2.28^{+0.20}\\_{-0.20}\\,\\times 10^{4}\\,\\mathrm{yr}^{-1}\\,\\mathrm{Gpc}^{-3}\\,h^{3}\\_{70}$ for $M\\_{V,\\mathrm{peak}}<-16.5$ mag ($R\\_{\\mathrm{tot}}=1.91^{+0.12}\\_{-0.12}\\,\\times 10^{4}\\,\\mathrm{yr}^{-1}\\,\\mathrm{Gpc}^{-3}\\,h^{3}\\_{70}$ for $M\\_{V,\\mathrm{peak}}<-17.5$ mag) at the median redshift of our sample, $z\\_{\\mathrm{med}}=0.024$. This is in agreement ($1\\sigma$) with the local volumetric rates found by previous studies. We also compile luminosity functions (LFs) for the entire sample as well as for sub-types of SNe Ia for the first time. The major sub-types with more than one SN include Ia-91bg, Ia-91T, Ia-CSM, and Ia-03fg with total rates of $R\\_{\\mathrm{Ia-91bg}}=1.4^{+0.5}\\_{-0.5} \\times 10^{3}\\,\\mathrm{yr}^{-1}\\,\\mathrm{Gpc}^{-3}\\,h^{3}\\_{70}$, $R\\_{\\mathrm{Ia-91T}}=8.5^{+1.6}\\_{-1.7} \\times 10^{2}\\,\\mathrm{yr}^{-1}\\,\\mathrm{Gpc}^{-3}\\,h^{3}\\_{70}$, $R\\_{\\mathrm{Ia-CSM}}=10^{+7}\\_{-7}\\,\\mathrm{yr}^{-1}\\,\\mathrm{Gpc}^{-3}\\,h^{3}\\_{70}$, and $R\\_{\\mathrm{Ia-03fg}}=30^{+20}\\_{-20}\\,\\mathrm{yr}^{-1}\\,\\mathrm{Gpc}^{-3}\\,h^{3}\\_{70}$, respectively. We estimate a mean host extinction of $E(V-r)\\approx 0.2$ mag based on the shift between our $V$-band and the ZTF $r$-band LFs.\n\n", "2306.10975": "2023-06-19, **A detailed look at the thermal and non-thermal X-ray emission from the Vela supernova remnant with SRG/eROSITA**, Martin G. F. Mayer et.al., [2306.10975v1](http://arxiv.org/abs/2306.10975v1)\n\n Aims. Our goal is the characterization of the hot ejecta and shocked interstellar medium (ISM) associated to the Vela supernova remnant (SNR), as well as the relativistic electrons injected into the ambient medium by its central pulsar. To achieve this, we analyze the X-ray data set of Vela acquired by SRG/eROSITA during its first four all-sky surveys. Methods. Apart from multi-band imaging, a quantitative view of the physical parameters affecting the observed thermal and non-thermal emission is obtained by performing spatially resolved X-ray spectroscopy of over 500 independent regions using multi-component spectral models. Results. Imaging demonstrates that the X-ray emission of the Vela SNR consists of at least three morphologically distinct components, with shell-like structures dominating below 0.6 keV, radial outward-directed features becoming apparent at medium energies, and the pulsar wind nebula (PWN) dominating the hard emission above 1.4 keV. Our spectroscopy reveals a highly structured distribution of X-ray absorption column densities, which intriguingly appears anticorrelated with optical extinction measurements. We find evidence for multiple ejecta clumps inside and outside the shell, within which we find a strongly supersolar concentration of neon and magnesium relative to oxygen. This includes the bright shrapnel D, in which we separate shocked ISM in the soft bow-shock from a hot, ejecta-rich clump at its apex, based on the new data. Finally, we find an extremely extended, smoothly decreasing distribution of synchrotron emission from the PWN, which extends up to 14 pc from the pulsar, with a total X-ray luminosity of $1.5\\times10^{-3}$ of the pulsar's spin-down power. The extended emission likely traces a relativistic electron population in an ISM-level magnetic field, which requires the existence of a TeV counterpart powered by inverse Compton radiation.\n\n"}}