{"neutrino": {"2406.03440": "2024-06-05, **Analysis of experimental data on neutron decay for the possibility of the existence of a right vector boson $W_R$**, A. P. Serebrov et.al., [2406.03440v1](http://arxiv.org/abs/2406.03440v1)\n\n Due to the assumption that sterile neutrinos are right-handed neutrinos, an analysis of the modern experimental situation in neutron decay for right-handed currents was carried out. As a result of the analysis, it was found that there are indications of the existence of a right-handed vector boson $W\\_R$ with a mass $M\\_{W\\_R}\\approx 870\\_{-140}^{+260} \\text{GeV}$ and a mixing angle with $W\\_L$: $\\zeta=0.061\\_{-0.024}^{+0.017}$. This circumstance is the basis for discussing the possibility of expanding the Standard Model with an additional gauge vector boson $W\\_R$ and right-handed neutrinos.\n\n", "2406.03331": "2024-06-05, **Minimal U(1) two-Higgs-doublet models for quark and lepton flavour**, J. R. Rocha et.al., [2406.03331v1](http://arxiv.org/abs/2406.03331v1)\n\n In the context of the 2HDM, and assuming that neutrinos acquire masses via the Weinberg operator, we perform a systematic analysis to determine the minimal quark and lepton flavour patterns, compatible with masses, mixing and CP violation data, realisable by Abelian symmetries. We determine four minimal models for quarks, where the number of independent parameters matches the number of observables. For the lepton sector, three minimal predictive models are identified. Namely, we find scenarios with a preference for the upper/lower octant of the $\\theta\\_{23}$ atmospheric mixing angle, that exhibit lower bounds on the lightest neutrino masses currently probed by cosmology and testable at future neutrinoless double beta decay experiments, even for a normally-ordered neutrino masses. We investigate the phenomenology of each model taking into account all relevant theoretical, electroweak precision observables, scalar sector constraints, as well as stringent quark flavour processes such as $\\overline{B} \\rightarrow X\\_s \\gamma$, $B\\_s \\rightarrow \\mu^- \\mu^+$ and meson oscillations, and the charged lepton flavour-violating decays $e\\_\\alpha^{-} \\rightarrow e\\_\\beta^{-} e\\_\\gamma^{+} e\\_\\delta^{-}$ and $e\\_\\alpha \\rightarrow e\\_\\beta \\gamma$. We show that, in some cases, Abelian flavour symmetries provide a natural framework to suppress flavour-changing neutral couplings and lead to scenarios featuring heavy neutral/charged scalar masses below the TeV scale within the reach of current experiments.\n\n", "2406.03236": "2024-06-05, **Toward the measurement of neutrino masses: Performance of cosmic magnification with submillimeter galaxies**, M. M. Cueli et.al., [2406.03236v1](http://arxiv.org/abs/2406.03236v1)\n\n The phenomenon of magnification bias can induce a non-negligible angular correlation between two samples of galaxies with nonoverlapping redshift distributions. This signal is particularly clear when background submillimeter galaxies are used, and has been shown to constitute an independent cosmological probe. This work extends prior studies on the submillimeter galaxy magnification bias to the massive neutrino scenario, with the aim being to assess its sensitivity as a cosmological observable to the sum of neutrino masses. The measurements of the angular cross-correlation function between moderate redshift GAMA galaxies and high-redshift submillimeter H-ATLAS galaxies are fit to the weak lensing prediction down to the arcmin scale. The signal is interpreted under the halo model, which is modified to accommodate massive neutrinos. We discuss the impact of the choice of cosmological parametrization on the sensitivity to neutrino masses. The currently available data on the magnification bias affecting submillimeter galaxies are sensitive to neutrino masses when a cosmological parametrization in terms of the primordial amplitude of the power spectrum $(A\\_s$) is chosen over the local root mean square of smoothed linear density perturbations $(\\sigma\\_8$). A clear upper limit on the sum of neutrino masses can be derived if the value of $A\\_s$ is either fixed or assigned a narrow Gaussian prior, a behavior that is robust against changes to the chosen value.\n\n", "2406.03174": "2024-06-05, **The Amaterasu particle: constraining the superheavy dark matter origin of UHECRs**, Prantik Sarmah et.al., [2406.03174v1](http://arxiv.org/abs/2406.03174v1)\n\n Amaterasu, the second most energetic ($244$ EeV) cosmic ray particle has been recently detected by the Telescope Array (TA) surface detector. The origin of the TA Amaterasu event is puzzling, as its arrival direction points back to a void in the local Universe, lacking conventional astrophysical ultra-high-energy (UHE) cosmic ray (CR) sources. Hence, we explore the possibility if this TA Amaterasu event could have originated from the decay of superheavy dark matter (SHDM) in the Milky Way. Such an origin also opens up multi-messenger detection channels in both UHE gamma-rays and UHE neutrinos. In this present work, using the TA Amaterasu event and the multi-messenger limits/sensitivities from various UHE telescopes, we place stringent constraints on the lifetime and mass of the SHDM. We find that the non-detection of the corresponding gamma-rays at the Pierre Auger Observatory (PAO) and the TA is in severe tension with the SHDM parameter space required to explain the TA Amaterasu event. Additionally, we extend the multi-messenger analysis to the future UHE gamma-ray and UHE neutrino telescopes such as PAO upgrade, GRAND 200k and IceCube-Gen2. We find that the bounds from the future neutrino telescopes will be able to compete with the present UHECR bounds. However, compared to the existing UHE gamma-ray bounds, the future PAO upgrade and the GRAND 200k gamma-ray detectors will improve the bounds on SHDM lifetime by at least one order of magnitude.\n\n", "2406.02986": "2024-06-05, **Effects of pairing strength on the nuclear structure and double-$β$ decay predictions within the mapped interacting boson model**, Kosuke Nomura et.al., [2406.02986v1](http://arxiv.org/abs/2406.02986v1)\n\n The low-energy nuclear structure and two-neutrino double-$\\beta$ ($2\\nu\\beta\\beta$) decay are studied within the interacting boson model (IBM) that is based on the nuclear energy density functional (EDF). The IBM Hamiltonian describing the initial and final even-even nuclei, and the interacting boson fermion-fermion Hamiltonian producing the intermediate states of the neighboring odd-odd nuclei, are determined by the microscopic inputs provided by the self-consistent mean-field (SCMF) calculations employing a relativistic EDF and a separable pairing force. Sensitivities of the low-lying structure and $2\\nu\\beta\\beta$-decay properties to the pairing strength are specifically analyzed. It is shown that the SCMF calculations with the decreased and increased pairing strengths lead to the quadrupole-quadrupole interaction strengths in the IBM that are, respectively, significantly enhanced and reduced in magnitude. When the increased pairing is adopted, in particular, the energy levels of the excited $0^+$ states are lowered, and the predicted $2\\nu\\beta\\beta$-decay nuclear matrix elements (NMEs) increase in magnitude systematically. The mapped IBM employing the increased pairing force generates effective NMEs and half-lives that are overall in a reasonable agreement with the experimental data.\n\n", "2406.02949": "2024-06-05, **Exploring active-sterile neutrino mixings models in MES mechanism using modular $S_3$ symmetry**, Mayengbam Kishan Singh et.al., [2406.02949v1](http://arxiv.org/abs/2406.02949v1)\n\n We study the minimal extended seesaw mechanism with one sterile neutrino in a 3+1 framework using modular $S\\_3$ symmetry. The active-sterile neutrino models are classified based on the assignments of $S\\_3$ representations and modular weights of the left-handed lepton doublets, triplet right-handed neutrino, and sterile neutrino. No scalar flavons are considered, and the flavor symmetry is broken by the vacuum expectation value (vev) of the modulus $\\tau$. For a particular set of representations of the Leptons and Higgs field, we obtain eleven (11) different models based on different modular weights of charged lepton $(k\\_L)$ and right-handed neutrino ($k\\_N$). Out of these, we consider two models, which are discriminated by carrying out the numerical analysis so that the parameter space in each model can fit the latest neutrino oscillation data at 3$\\sigma$. The Planck cosmological bound on the upper limit of the sum of the active neutrino masses $\\sum m\\_i <0.12$eV is also considered. Finally, the best-fit parameters of the neutrino observables and model predictions are evaluated using the minimum $\\chi^2$ analysis.\n\n", "2406.02944": "2024-06-05, **Texture Zeros in modular Left-Right Symmetric Model**, Ankita Kakoti et.al., [2406.02944v1](http://arxiv.org/abs/2406.02944v1)\n\n Texture zeros play a crucial role in the phenomenological implementation of a particular model in the Beyond Standard Model framework. As such, in this work we study the possibility concerning the origin of texture zero in the neutrino mass matrix in the context of modular Left-Right Symmetric Model. Implementation of texture zeros in the light neutrino mass matrix brings forth the existence of allowed and disallowed classes of the texture zero classification. In the present work, we have studied Neutrinoless Double-Beta Decay, Lepton flavor violation and Resonant Leptogenesis and tried to analyze if the simultaneous study of these three phenomenology are connected with a common parameter space within the model. We have determined the possible combinations of 1-0 and 2-0 textures in the context of resulting light neutrino mass matrix and illustrated the allowed classes for both textures corresponding to the realization of neutrinoless double beta decay, leptogenesis and lepton flavor violation. The study has been carried out for both normal and inverted hierarchy and the results have been illustrated in the present work.\n\n", "2406.02845": "2024-06-05, **An Expanded Set of Los Alamos OPLIB Tables in MESA: Type-1 Rosseland-mean Opacities and Solar Models**, Ebraheem Farag et.al., [2406.02845v1](http://arxiv.org/abs/2406.02845v1)\n\n We present a set of 1194 Type-1 Rosseland-mean opacity tables for four different metallicity mixtures. These new Los Alamos OPLIB atomic radiative opacity tables are an order of magnitude larger in number than any previous opacity table release, and span regimes where previous opacity tables have not existed. For example, the new set of opacity tables expands the metallicity range to $Z$\\,=\\,10$^{-6}$ to $Z$\\,=\\,0.2 which allows improved accuracy of opacities at low and high metallicity, increases the table density in the metallicity range $Z$\\,=\\,10$^{-4}$ to $Z$\\,=\\,0.1 to enhance the accuracy of opacities drawn from interpolations across neighboring metallicities, and adds entries for hydrogen mass fractions between $X$\\,=\\,0 and $X$\\,=\\,0.1 including $X$\\,=\\,$10^{-2}, 10^{-3}, 10^{-4}, 10^{-5}, 10^{-6}$ that can improve stellar models of hydrogen deficient stars. We implement these new OPLIB radiative opacity tables in \\MESA, and find that calibrated solar models agree broadly with previously published helioseismic and solar neutrino results. We find differences between using the new 1194 OPLIB opacity tables and the 126 OPAL opacity tables range from $\\approx$\\,20--80\\% across individual chemical mixtures, up to $\\approx$\\,8\\% and $\\approx$\\,15\\% at the bottom and top of the solar convection zone respectively, and $\\approx$\\,7\\% in the solar core. We also find differences between standard solar models using different opacity table sources that are on par with altering the initial abundance mixture. We conclude that this new, open-access set of OPLIB opacity tables does not solve the solar modeling problem, and suggest the investigation of physical mechanisms other than the atomic radiative opacity.\n\n", "2406.02527": "2024-06-04, **Non-holomorphic modular flavor symmetry**, Bu-Yao Qu et.al., [2406.02527v1](http://arxiv.org/abs/2406.02527v1)\n\n The formalism of non-holomorphic modular flavor symmetry is developed, and the Yukawa couplings are level $N$ polyharmonic Maa{\\ss} forms satisfying the Laplacian condition. We find that the integer (even) weight polyharmonic Maa{\\ss} forms of level $N$ can be decomposed into multiplets of the finite modular group $\\Gamma'\\_N$ ($\\Gamma\\_N$). The original modular invariance approach is extended by the presence of negative weight polyharmonic Maa{\\ss} forms. The non-holomorphic modular flavor symmetry can be consistently combined with the generalized CP symmetry. We present three example models for lepton sector based on the $\\Gamma\\_3\\cong A\\_4$ modular symmetry, the charged lepton masses and the neutrino oscillation data can be accommodated very well, and the predictions for the leptonic CP violation phases and the effective Majorana neutrino mass are studied.\n\n", "2406.02641": "2024-06-04, **The neutrino mass: A triangular formulation**, Ivan Arraut et.al., [2406.02641v1](http://arxiv.org/abs/2406.02641v1)\n\n We demonstrate that the flavor oscillation when a neutrino travels through spacetime, is equivalent to permanent changes on the vacuum state condition perceived by the same particle. This can be visualized via the Quantum Yang Baxter equations (QYBE). From this perspective, the neutrino never breaks the symmetry of the ground state because it never selects an specific vacuum condition. Then naturally the Higgs mechanism cannot be the generator of the neutrino masses. The constraints emerging from this model predict a normal mass hierarchy and some specific values for the mass eigenvalues once we fix the mixing angles. Interestingly, the model suggests that the sum of the mix angles is equal to $\\pi/2$.\n\n", "2406.02025": "2024-06-04, **First demonstration of a TES based cryogenic Li$_2$MoO$_4$detector for neutrinoless double beta decay search**, G. Bratrud et.al., [2406.02025v1](http://arxiv.org/abs/2406.02025v1)\n\n Cryogenic calorimetric experiments to search for neutrinoless double-beta decay ($0\\nu\\beta\\beta$) are highly competitive, scalable and versatile in isotope. The largest planned detector array, CUPID, is comprised of about 1500 individual Li$\\_2^{100}$MoO$\\_{4}$ detector modules with a further scale up envisioned for a follow up experiment (CUPID-1T). In this article, we present a novel detector concept targeting this second stage with a low impedance TES based readout for the Li$\\_2$MoO$\\_{4}$ absorber that is easily mass-produced and lends itself to a multiplexed readout. We present the detector design and results from a first prototype detector operated at the NEXUS shallow underground facility at Fermilab. The detector is a 2-cm-side cube with 21$\\,$g mass that is strongly thermally coupled to its readout chip to allow rise-times of $\\sim$0.5$\\,$ms. This design is more than one order of magnitude faster than present NTD based detectors and is hence expected to effectively mitigate backgrounds generated through the pile-up of two independent two neutrino decay events coinciding close in time. Together with a baseline resolution of 1.95$\\,$keV (FWHM) these performance parameters extrapolate to a background index from pile-up as low as $5\\cdot 10^{-6}\\,$counts/keV/kg/yr in CUPID size crystals. The detector was calibrated up to the MeV region showing sufficient dynamic range for $0\\nu\\beta\\beta$ searches. In combination with a SuperCDMS HVeV detector this setup also allowed us to perform a precision measurement of the scintillation time constants of Li$\\_2$MoO$\\_{4}$. The crystal showed a significant fast scintillation emission with O(10$\\,\\mu$s) time-scale, more than an order below the detector response of presently considered light detectors suggesting the possibility of further progress in pile-up rejection through better light detectors in the future.\n\n", "2406.02634": "2024-06-04, **Nuclear Data to Quantify Urca Cooling in Accreting Neutron Stars**, Rahul Jain et.al., [2406.02634v1](http://arxiv.org/abs/2406.02634v1)\n\n Neutron stars in Low Mass X-ray Binaries (LMXBs) can accrete matter onto their surface from the companion star. Transiently accreting neutron stars go through alternating phases of active accretion outbursts and quiescence. X-ray observations during the quiescence phase show a drop in X-ray luminosity with the time in quiescence. This is also inferred as the drop in surface temperature or the cooling of accreting neutron stars in quiescence. Analyzing these cooling curves reveals a great deal of information about the structure and composition of neutron stars. However, model-observation comparisons of such cooling curves are challenging - partly due to observational uncertainties, and partly due to incomplete knowledge of heating mechanisms during accretion outbursts. This situation is further exacerbated by the recent discovery of Urca cooling in the neutron star crust. These are cycles that alternate between electron-capture and beta-decay to produce a large flux of neutrinos and anti-neutrinos. These freely stream out of the star and carry energy with them, essentially cooling the neutron star crust without changing the composition. As a result, it is necessary to accurately quantify the strength of Urca cooling to constrain the heat sources in neutron star crusts and facilitate better model-observation comparisons of the cooling curves.\n\n"}, "dark matter": {"2406.03351": "2024-06-05, **Resonant phenomena in finite motions of test particles in oscillating dark matter configurations**, Vladimir A. Koutvitsky et.al., [2406.03351v1](http://arxiv.org/abs/2406.03351v1)\n\n Nonlinear differential equations are derived that describe the time evolution of the test particle coordinates during finite motions in the gravitational field of oscillating dark matter. It is shown that in the weak field approximation, the radial oscillations of a test particle and oscillations in orbital motion are described by the Hill equation and the nonhomogeneous Hill equation, respectively. In the case of scalar dark matter with a logarithmic self-interactions, these equations are integrated numerically, and the solutions are compared with the corresponding solutions of the original nonlinear system to identify possible resonance effects.\n\n", "2406.03332": "2024-06-05, **Interpreting Mass and Radius Measurements of Neutron Stars with Dark Matter Halos**, Shafayat Shawqi et.al., [2406.03332v1](http://arxiv.org/abs/2406.03332v1)\n\n The high densities of neutron stars (NSs) could provide astrophysical locations for dark matter (DM) to accumulate. Depending on the DM model, these DM admixed NSs (DANSs) could have significantly different properties than pure baryonic NSs, accessible through X-ray observations of rotation-powered pulsars. We adopt the two-fluid formalism in general relativity to numerically simulate stable configurations of DANSs, assuming a fermionic equation of state (EOS) for the DM with repulsive self-interaction. The distribution of DM in the DANS as a halo affects the path of X-rays emitted from hot spots on the visible baryonic surface causing notable changes in the pulse profile observed by telescopes such as NICER, compared to pure baryonic NSs. We explore how various DM models affect the DM mass distribution, leading to different types of dark halos. We quantify the deviation in observed X-ray flux from stars with each of these halos and explain how to interpret mass and radius measurements of NSs inferred from electromagnetic radiation if these dark halos exist.\n\n", "2406.03114": "2024-06-05, **Primordial black holes: the asteroid mass window**, Peter Tinyakov et.al., [2406.03114v1](http://arxiv.org/abs/2406.03114v1)\n\n Primordial black holes (PBHs) are an attractive dark matter candidate, particularly if they can explain the totality of it. At PBH masses below $\\sim 10^{17}$g and above $\\sim 10^{23}$g this possibility is excluded from the variety of arguments and with different confidence. The range in between, often referred to as the \"asteroid mass window\", currently remains unconstrained. The most promising, in our view, way to probe this mass range is to use stars as the PBH detectors. If a star captures even a single PBH it starts being accreted onto it and eventually gets destroyed -- converted into a sub-solar mass black hole. This process may have a variety of signatures form a mere star disappearance to supernova-type explosions of a new kind. The viability of this approach depends crucially on the probability of PBH capture by stars. In this chapter we summarize the existing capture mechanisms and discuss their implications for constraining the abundance of (or perhaps discovering) PBHs in the asteroid mass window.\n\n", "2406.03100": "2024-06-05, **Exploring the Dark Frontier: White Dwarf-Based Constraints on Light Dark Matter**, Jia-Shu Niu et.al., [2406.03100v1](http://arxiv.org/abs/2406.03100v1)\n\n In the vast expanse of our galaxy, white dwarfs (WDs) are natural sentinels, capturing the enigmatic dark matter (DM) particles that incessantly traverse their interiors. These celestial bodies provide a unique vantage point for probing interactions between DM particles and their constituents-nuclei or electrons-should such interactions exist. The captured DM particles may accumulate, undergo mutual annihilation, or be evaporated by the WD's own nuclei or electrons, thereby perturbing the standard cooling sequence predicted by stellar evolution theory. This letter reports pioneering constraints on DM-electron interactions derived from an in-depth analysis of four pulsating WDs. By leveraging the period variation rates of their pulsation modes, we delineate the following constraints: for a form factor $F(q) = 1$, in the DM mass range $20 \\mathrm{MeV}/c^{2} \\lesssim m\\_{\\chi} \\lesssim 80 \\mathrm{MeV}/c^{2}$ with a cross-section limit of $\\sigma\\_{\\chi,e} \\lesssim 10^{-56} \\mathrm{cm}^{2}$; for a form factor $F(q) = (\\alpha m\\_{e})^{2}/q^{2}$, in a the DM mass range $20\\mathrm{MeV}/c^{2} \\lesssim m\\_{\\chi} \\lesssim 70 \\mathrm{MeV}/c^{2}$ with a limit of $\\sigma\\_{\\chi,e} \\lesssim 10^{-52} \\mathrm{cm}^{2}$. These newly established constraints surpass current direct detection experiments by over fifteen orders of magnitude, forging a path into the uncharted territories of the DM parameter space. This work not only advances our understanding of light dark matter-electron interactions but also exemplifies the potential of WDs as important astrophysical laboratories for probing the elusive nature of DM.\n\n", "2406.02992": "2024-06-05, **Dark magnetohydrodynamics: Black hole accretion in superradiant dark photon clouds**, Shuo Xin et.al., [2406.02992v1](http://arxiv.org/abs/2406.02992v1)\n\n Black holes threaded by massive vector fields can be subject to a superradiant instability, growing a cloud of massive vector particles around it. In this work, we consider what happens if such a dark matter candidate field mimicking a dark photon interacts with an accretion flow onto the black hole. By including a kinetic mixing term with the standard model photon, we extend the commonly used equations of general-relativistic magnetohydrodynamics to a dark photon constituent. The coupling to the dark photon then appears as an effective dynamo term together with a dark Lorentz force acting on the accreting matter. We numerically study the interactions between the superradiant dark photon cloud and the inner accretion flow by solving the coupled system in full numerical relativity. By parameterically varying the mixing parameter between dark and standard model sector, we provide a first investigation of how the accretion flow could be modified. Depending on the coupling strength, our solutions exhibit increased wind launching, as well as oscillation modes in the disk.\n\n", "2406.02896": "2024-06-05, **Random fluctuation walk in the boson star formation process**, G. A. Kozlov et.al., [2406.02896v1](http://arxiv.org/abs/2406.02896v1)\n\n We construct the mechanism of formation of the scalar boson star (BS) having a hierarchy of self-similar \"lumps\" of dark matter (DM) built into the probability distribution function of allowed steps. It can ensure to study the dynamics of the BS formation through the \"cross-over\" between the free scalar DM and the compact condensate (CC) phase in one-dimensional model of the random fluctuation walk. The main inputs are the random fluctuating weight $\\lambda < 1$, the fundamental fluctuating length $\\xi (\\lambda)$ and the parameter $a >1$ of the spatial separation between the DM \"lumps\" inside the BS. The solution to the functional equation for the characteristic probability to find the free scalar DM and the CC phase is obtained. The time evolution of the probability to form the DM \"lump\" (growth of the BS) is presented with the power-law cascades expression depending on $\\lambda$ and $a$. The special cases for $\\lambda$ in terms of the energy densities of the BS ($\\rho\\_\\star$) and the DM ($\\rho\\_\\odot$), as well as the Bose-Einstein correlation function for two scalar DM particles, are considered. The lower bounds on the critical temperature at the \"cross-over\" depending on $\\rho\\_\\odot$, $\\rho\\_\\star$, the average multiplicities of the scalar DM particles and the parameters related to the chaotically behaviour of the particles are obtained.\n\n", "2406.02683": "2024-06-04, **TDCOSMO. XVII. Measurement of the Hubble Constant from the Lensed Quasar WGD$\\,$2038$-$4008**, Kenneth C. Wong et.al., [2406.02683v1](http://arxiv.org/abs/2406.02683v1)\n\n Time-delay cosmography is a powerful technique to constrain cosmological parameters, particularly the Hubble constant ($H\\_{0}$). The TDCOSMO collaboration is performing an ongoing analysis of lensed quasars to constrain cosmology using this method. In this work, we obtain constraints from the lensed quasar~WGD$\\,$2038$-$4008~using new time-delay measurements and previous mass models by TDCOSMO. This is the first TDCOSMO lens to incorporate multiple lens modeling codes and the full time-delay covariance matrix into the cosmological inference. The models are fixed before the time delay is measured, and the analysis is performed blinded with respect to the cosmological parameters to prevent unconscious experimenter bias. We obtain $D\\_{\\Delta t} = 1.68^{+0.40}\\_{-0.38}$ Gpc using two families of mass models, a power-law describing the total mass distribution, and a composite model of baryons and dark matter, although the composite model is disfavored due to kinematics constraints. In a flat $\\Lambda$CDM cosmology, we constrain the Hubble constant to be $H\\_{0} = 65^{+23}\\_{-14}\\, \\rm km\\ s^{-1}\\,Mpc^{-1}$. The dominant source of uncertainty comes from the time delays, due to the low variability of the quasar. Future long-term monitoring, especially in the era of the Vera C. Rubin Observatory's Legacy Survey of Space and Time, could catch stronger quasar variability and further reduce the uncertainties. This system will be incorporated into an upcoming hierarchical analysis of the entire TDCOSMO sample, and improved time delays and spatially-resolved stellar kinematics could strengthen the constraints from this system in the future.\n\n", "2406.02441": "2024-06-04, **Probing the Scalar WIMP-Pion Coupling with the first LUX-ZEPLIN data**, J. Aalbers et.al., [2406.02441v1](http://arxiv.org/abs/2406.02441v1)\n\n Weakly interacting massive particles (WIMPs) may interact with a virtual pion that is exchanged between nucleons. This interaction channel is important to consider in models where the spin-independent isoscalar channel is suppressed. Using data from the first science run of the LUX-ZEPLIN dark matter experiment, containing 60 live days of data in a 5.5~tonne fiducial mass of liquid xenon, we report the results on a search for WIMP-pion interactions. We observe no significant excess and set an upper limit of $1.5\\times10^{-46}$~cm$^2$ at a 90\\% confidence level for a WIMP mass of 33~GeV/c$^2$ for this interaction.\n\n", "2406.02306": "2024-06-04, **Bridging the micro-Hz gravitational wave gap via Doppler tracking with the Uranus Orbiter and Probe Mission: Massive black hole binaries, early universe signals and ultra-light dark matter**, Lorenz Zwick et.al., [2406.02306v1](http://arxiv.org/abs/2406.02306v1)\n\n With the recent announcement by NASA's Planetary Science and Astrobiology Decadal Survey 2023-2032, a priority flagship mission to the planet Uranus is anticipated. Here, we explore the prospects of using the mission's radio Doppler tracking equipment to detect gravitational waves (GWs) and other analogous signals related to dark matter (DM) over the duration of its interplanetary cruise. By employing a methodology to stack tracking data in combination with Monte-Carlo Markov-Chain parameter recovery tests, we show that the mission will be sensitive to GWs over the wide frequency range of $3\\times 10^{-9}$ Hz to $10^{-1}$ Hz, provided that tracking data is taken consistently over a large fraction of the cruise duration. Thus, the mission has the potential to fill the gap between pulsar timing and space-based-interferometry GW observatories. Within this assumption, we forecast the detection of $\\mathcal{\\mathcal{O}}(1 - 100)$ individual massive black hole binaries using two independent population models. Additionally, we determine the mission's sensitivity to both astrophysical and primordial stochastic gravitational wave backgrounds, as well as its capacity to test, or even confirm via detection, ultralight DM models. In all these cases, the tracking of the spacecraft over its interplanetary cruise would enable coverage of unexplored regions of parameter space, where signals from new phenomena in our Universe may be lurking.\n\n", "2406.02228": "2024-06-04, **Constrained cosmological simulations of the Local Group using Bayesian hierarchical field-level inference**, Ewoud Wempe et.al., [2406.02228v1](http://arxiv.org/abs/2406.02228v1)\n\n We present a novel approach based on Bayesian field-level inference capable of resolving individual galaxies within the Local Group (LG), enabling detailed studies of its structure and formation via posterior simulations. We extend the Bayesian Origin Reconstruction from Galaxies (BORG) algorithm with a multi-resolution approach, allowing us to reach smaller mass scales and apply observational constraints based on LG galaxies. Our updated data model simultaneously accounts for observations of mass tracers within the dark haloes of the Milky Way (MW) and M31, their observed separation and relative velocity, and the quiet surrounding Hubble flow represented through the positions and velocities of galaxies at distances from one to four Mpc. Our approach delivers representative posterior samples of $\\Lambda$CDM realisations that are statistically and simultaneously consistent with all these observations, leading to significantly tighter mass constraints than found if the individual datasets are considered separately. In particular, we estimate the virial masses of the MW and M31 to be $\\log\\_{10}(M\\_{200c}/M\\_\\odot) = 12.07\\pm0.08$ and $12.33\\pm0.10$, respectively, their sum to be $\\log\\_{10}(\\Sigma M\\_{200c}/M\\_\\odot)= 12.52\\pm0.07$, and the enclosed mass within spheres of radius $R$ to be $\\log\\_{10}(M(R)/M\\_\\odot)= 12.71\\pm0.06$ and $12.96\\pm0.08$ for $R=1$ Mpc and 3 Mpc, respectively. The M31-MW orbit is nearly radial for most of our $\\Lambda$CDM LG's, and most lie in a dark matter sheet that aligns approximately with the Supergalactic Plane, even though the surrounding density field was not used explicitly as a constraint. The approximate simulations employed in our inference are accurately reproduced by high-fidelity structure formation simulations, demonstrating the potential for future high-resolution, full-physics $\\Lambda$CDM posterior simulations of LG look-alikes.\n\n", "2406.02159": "2024-06-04, **Quantum Statistical Effects on Warm Dark Matter and the Mass Constraint from the Cosmic Large Scale Structure**, Zhijian Zhang et.al., [2406.02159v1](http://arxiv.org/abs/2406.02159v1)\n\n The suppression of small-scale matter power spectrum is a distinct feature of Warm Dark Matter (WDM), which permits a constraint on the WDM mass from galaxy surveys. In the thermal relic WDM scenario, quantum statistical effects are not manifest. In a unified framework, we investigate the quantum statistical effects for a fermion case with a degenerate pressure and a boson case with a Bose-Einstein condensation (BEC). Compared to the thermal relic case, the degenerate fermion case only slightly lowers the mass bound while the boson case with a high initial BEC fraction ($\\gtrsim90\\%$) significantly lowers it. On the other hand, the BEC fraction drops during the relativistic-to-nonrelativistic transition and completely disappears if the initial fraction is below $\\sim64\\%$. Given the rising interest in resolving the late-time galaxy-scale problems with boson condensation, a question is posed on how a high initial BEC fraction can be dynamically created so that a DM condensed component remains today.\n\n", "2406.02109": "2024-06-04, **Euler-Heisenberg black hole surrounded by quintessence in the background of perfect fluid dark matter: Thermodynamics, Shadows and Quasinormal modes**, B. Hamil et.al., [2406.02109v1](http://arxiv.org/abs/2406.02109v1)\n\n Current observations show that a significant fraction of the Universe is composed of dark energy and dark matter. In this paper, we investigate the simultaneous effects of these dark sectors on the Euler-Heisenberg black hole, using the quintessence matter field and perfect fluid to model them. In particular, we study the black hole's thermodynamics, shadows, and quasinormal modes, and discuss in detail how these properties change with relatively large or small dark sector components.\n\n", "2406.02026": "2024-06-04, **Cosmological dynamics of interacting dark energy and dark matter in $f(Q)$ gravity**, Gaurav N. Gadbail et.al., [2406.02026v1](http://arxiv.org/abs/2406.02026v1)\n\n In this work, we explore the behavior of interacting dark energy and dark matter within a model of $f(Q)$ gravity, employing a standard framework of dynamical system analysis. We consider the power-law $f(Q)$ model incorporating with two different forms of interacting dark energy and dark matter: $3\\alpha H\\rho\\_m$ and $\\frac{\\alpha}{3H}\\rho\\_m \\rho\\_{DE}$. The evolution of $\\Omega\\_m, \\Omega\\_r, \\Omega\\_{DE}, q$, and $\\omega$ for different values of the model parameter $n$ and the interaction parameter $\\alpha$ has been examined. Our results show that the universe was dominated by matter in the early stages and will be dominated by dark energy in later stages. Using the observational data, the fixed points are found to be stable and can be represented the de Sitter and quintessence acceleration solutions. We discover that the dynamical profiles of the universe in $f(Q)$ dark energy models are influenced by both the interaction term and the relevant model parameters.\n\n"}, "supernova": {"2406.03137": "2024-06-05, **Strange Dwarfs: a review on the (in)stability**, Francesco Di Clemente et.al., [2406.03137v1](http://arxiv.org/abs/2406.03137v1)\n\n White dwarfs are the remnants of stars not massive enough to become supernovae. This review explores the concept of strange dwarfs, a unique class of white dwarfs which contain cores of strange quark matter. Strange dwarfs have different sizes, masses, and evolutionary paths with respect to white dwarfs. They might form through the accumulation of normal matter on strange quark stars or by capture of strangelets. The stability of strange dwarfs has been debated, with initial studies suggesting stability, while later analyses indicated potential instability. This review revisits these discussions, focusing on the critical role of boundary conditions between nuclear and quark matter in determining stability. It also offers insights into their formation, structure, and possible detection in the universe.\n\n", "2406.03114": "2024-06-05, **Primordial black holes: the asteroid mass window**, Peter Tinyakov et.al., [2406.03114v1](http://arxiv.org/abs/2406.03114v1)\n\n Primordial black holes (PBHs) are an attractive dark matter candidate, particularly if they can explain the totality of it. At PBH masses below $\\sim 10^{17}$g and above $\\sim 10^{23}$g this possibility is excluded from the variety of arguments and with different confidence. The range in between, often referred to as the \"asteroid mass window\", currently remains unconstrained. The most promising, in our view, way to probe this mass range is to use stars as the PBH detectors. If a star captures even a single PBH it starts being accreted onto it and eventually gets destroyed -- converted into a sub-solar mass black hole. This process may have a variety of signatures form a mere star disappearance to supernova-type explosions of a new kind. The viability of this approach depends crucially on the probability of PBH capture by stars. In this chapter we summarize the existing capture mechanisms and discuss their implications for constraining the abundance of (or perhaps discovering) PBHs in the asteroid mass window.\n\n", "2406.02956": "2024-06-05, **Alleviating Hubble constant tension and growth tension via a transition of absolute magnitude favored by Pantheon+ sample**, Yang Liu et.al., [2406.02956v1](http://arxiv.org/abs/2406.02956v1)\n\n We establish a cosmological-model-independent method to extract the apparent magnitude and its derivative at different redshifts from the Pantheon+ type Ia supernova sample, and find that the obtained values deviate clearly from the prediction of the $\\Lambda$CDM model at the lowest redshift. This deviation can be explained as a result of a transition of the absolute magnitude $M$ in the low redshift region. The observations seem to favor this transition since the minimum values of $\\chi^2$ for two ansatzes of a varying $M$ are less than that of a constant $M$. The Hubble constant tension is alleviated from larger than $5\\sigma$ to be about $1$ to $2\\sigma$ for a varying $M$, and the growth tension can be resolved after attributing the variation of $M$ to a modification of the effective Newton's constant.\n\n", "2406.02816": "2024-06-04, **Red eminence: The intermediate-luminosity red transient AT 2022fnm**, S. Moran et.al., [2406.02816v1](http://arxiv.org/abs/2406.02816v1)\n\n We present results from a five-month-long observing campaign of the unusual transient AT 2022fnm, which displays properties common to both luminous red novae (LRNe) and intermediate-luminosity red transients (ILRTs). Although its photometric evolution is broadly consistent with that of LRNe, no second peak is apparent in its light curve, and its spectral properties are more reminiscent of ILRTs. It has a fairly rapid rise time of 5.3$\\pm$1.5 d, reaching a peak absolute magnitude of $-12.7\\pm$0.1 (in the ATLAS $o$ band). We find some evidence for circumstellar interaction, and a near-infrared excess becomes apparent at approximately +100 d after discovery. We attribute this to a dust echo. Finally, from an analytical diffusion toy model, we attempted to reproduce the pseudo-bolometric light curve and find that a mass of $\\sim$4 M$\\_\\odot$ is needed. Overall, the characteristics of AT 2022fnm are consistent with a weak stellar eruption or an explosion reminiscent of low-energy type IIP supernovae, which is compatible with expectations for ILRTs.\n\n", "2406.02688": "2024-06-04, **Holographic motivations and observational evidence for decreasing dark energy**, Mark Van Raamsdonk et.al., [2406.02688v1](http://arxiv.org/abs/2406.02688v1)\n\n Negative lambda gravitational effective field theories dual to holographic CFTs have potentially realistic cosmological solutions. Generic cosmological solutions of these effective field theories have scalar field evolution that can lead to a period of accelerated expansion when the scalar field is at positive values of its potential (Fig. 1). If such a model describes our universe, significant evolution of dark energy is expected over a Hubble time as the scalar descends from positive to negative values of its potential towards the AdS extremum. Our recent observational study 2305.04946 based on supernova and baryon acoustic oscillation (BAO) observations suggests that significant evolution of dark energy associated with a descending scalar field may be preferred by data (Fig. 2). Taking a linear approximation to the scalar potential around the present value, a standard likelihood analysis gives an $e^{- \\chi^2/2}$ distribution in which $dV/dt$ is presently negative in $99.99 \\%$ of the distribution, with a mean fractional variation of the potential of $36 \\%$ over the period $z \\lessapprox 2$ over which supernova data is available. In this note, we review these theoretical and observational results and provide an update on the question of how the physics of these cosmological solutions can be related to the physics of the underlying CFT.\n\n", "2406.02684": "2024-06-04, **Using CSST and ejecta-wind interaction in type II-P supernovae to constrain the wind-mass loss of red supergiant stars**, Jingxiao Luo et.al., [2406.02684v1](http://arxiv.org/abs/2406.02684v1)\n\n The properties of H-rich, type II-plateau supernova (SN II-P) progenitors remain uncertain, and this is primarily due to the complexities associated with red supergiant (RSG) wind-mass loss. Recent studies have suggested that the interaction of the ejecta with a standard RSG wind should produce unambiguous signatures in the optical (e.g., a broad, boxy H${\\alpha}$ profile) and in the UV (especially Ly ${\\alpha}$ and Mg ii ${\\lambda}{\\lambda}$ 2795, 2802) a few years following the explosion. Such features are expected to be generic in all SNe II-P and can be utilized to constrain RSG winds. Here, we investigate the possibility of detecting late-time (0.3-10 years since explosion) SNe II-P in the NUV with the China Space Station Telescope (CSST). Convolving the existing model spectra of ejecta-wind interactions in SNe II-P with the transmission functions of the CSST, we calculated the associated multiband light curves, in particular, the NUV (255 nm${\\sim}$317 nm) band, as well as the $NUV-r$ color. We find that the CSST will be able to detect the NUV radiation associated with ejecta-wind interaction for hundreds SNe II-P out to a few hundred Mpc over its ten-year main sky survey. The CSST will therefore provide a sizable sample of SNe II-P with the NUV signatures of ejecta-wind interaction. This will be helpful for understanding the mass loss history of SN II-P progenitors and their origins.\n\n", "2406.02498": "2024-06-04, **The story of SN 2021aatd -- a peculiar 1987A-like supernova with an early-phase luminosity excess**, T. Szalai et.al., [2406.02498v1](http://arxiv.org/abs/2406.02498v1)\n\n There is a growing number of peculiar events that cannot be assigned to any of the main supernova (SN) classes. SN 1987A and a handful of similar objects, thought to be explosive outcomes of blue supergiant stars, belong to them: while their spectra closely resemble those of H-rich (IIP) SNe, their light-curve (LC) evolution is very different. Here we present the detailed photometric and spectroscopic analysis of SN 2021aatd, a peculiar Type II explosion: while its early-time evolution resembles that of the slowly evolving, double-peaked SN 2020faa (however, at a lower luminosity scale), after $\\sim$40 days, its LC shape becomes similar to that of SN 1987A-like explosions. Beyond comparing LCs, color curves, and spectra of SN 2021aatd to that of SNe 2020faa, 1987A, and of other objects, we compare the observed spectra with our own SYN++ models and with the outputs of published radiative transfer models. We also modeled the pseudo-bolometric LCs of SNe 2021aatd and 1987A assuming a two-component (core+shell) ejecta, and involving the rotational energy of a newborn magnetar in addition to radioactive decay. We find that both the photometric and spectroscopic evolution of SN 2021aatd can be well described with the explosion of a $\\sim$15 $M\\_\\odot$ blue supergiant star. Nevertheless, SN 2021aatd shows higher temperatures and weaker Na ID and Ba II 6142 A lines than SN 1987A, which is reminiscent of rather to IIP-like atmospheres. With the applied two-component ejecta model (counting with both decay and magnetar energy), we can successfully describe the bolometric LC of SN 2021aatd, including the first $\\sim$40-day long phase showing an excess compared to 87A-like SNe but being strikingly similar to that of the long-lived SN 2020faa. Nevertheless, finding a unified model that also explains the LCs of more luminous events (like SN 2020faa) is still a matter of concern.\n\n", "2406.02404": "2024-06-04, **The impact of asteroseismically calibrated internal mixing on nucleosynthetic wind yields of massive stars**, Hannah E. Brinkman et.al., [2406.02404v1](http://arxiv.org/abs/2406.02404v1)\n\n Asteroseismology gives us the opportunity to look inside stars and determine their internal properties. Based on these observations, estimations can be made for the amount of the convective boundary mixing and envelope mixing of such stars, and the shape of the mixing profile in the envelope. However, these results are not typically included in stellar evolution models. We aim to investigate the impact of varying convective boundary mixing and envelope mixing in a range based on asteroseismic modelling in stellar models, both for the stellar structure and for the nucleosynthetic yields. In this first study, we focus on the pre-explosive evolution of a 20Msun star and evolve the models to the final phases of carbon burning. We vary the convective boundary mixing, implemented as step-overshoot, with the overshoot parameter in the range 0.05-0.4 and the amount of envelope mixing in the range 1-10$^{6}$ with a mixing profile based on internal gravity waves. We use a large nuclear network of 212 isotopes to study the nucleosynthesis. We find that enhanced mixing according to asteroseismology of main-sequence stars, both at the convective core boundary and in the envelope, has significant effects on the nucleosynthetic wind yields. Our evolutionary models beyond the main sequence diverge in yields from models based on rotational mixing, having longer helium burning lifetimes and lighter helium-depleted cores. We find that the asteroseismic ranges of internal mixing calibrated from core hydrogen burning stars lead to similar wind yields as those resulting from the theory of rotational mixing. Adopting the seismic mixing levels beyond the main sequence, we find earlier transitions to radiative carbon burning compared to models based on rotational mixing. This influences the compactness and the occurrence of shell-mergers, which may affect the supernova properties and explosive nucleosynthesis.\n\n", "2406.02073": "2024-06-04, **ZTF SN Ia DR2: Study of Type Ia Supernova lightcurve fits**, M. Rigault et.al., [2406.02073v1](http://arxiv.org/abs/2406.02073v1)\n\n Type Ia supernova (SN Ia) cosmology relies on the estimation of lightcurve parameters to derive precision distances that leads to the estimation of cosmological parameters. The empirical SALT2 lightcurve modeling that relies on only two parameters, a stretch x1, and a color c, has been used by the community for almost two decades. In this paper we study the ability of the SALT2 model to fit the nearly 3000 cosmology-grade SN Ia lightcurves from the second release of the Zwicky Transient Facility (ZTF) cosmology science working group. While the ZTF data was not used to train SALT2, the algorithm is modeling the ZTF SN Ia optical lightcurves remarkably well, except for lightcurve points prior to -10 d from maximum, where the training critically lacks statistics. We find that the lightcurve fitting is robust against the considered choice of phase-range, but we show the [-10; +40] d range to be optimal in terms of statistics and accuracy. We do not detect any significant features in the lightcurve fit residuals that could be connected to the host environment. Potential systematic population differences related to the SN Ia host properties might thus not be accountable for by the addition of extra lightcurve parameters. However, a small but significant inconsistency between residuals of blue- and red-SN Ia strongly suggests the existence of a phase-dependent color term, with potential implications for the use of SNe Ia in precision cosmology. We thus encourage modellers to explore this avenue and we emphasize the importance that SN Ia cosmology must include a SALT2 retraining to accurately model the lightcurves and avoid biasing the derivation of cosmological parameters.\n\n", "2406.02072": "2024-06-04, **ZTF SN Ia DR2: Colour standardisation of Type Ia Supernovae and its dependence on environment**, M. Ginolin et.al., [2406.02072v1](http://arxiv.org/abs/2406.02072v1)\n\n As Type Ia supernova cosmology transitions from a statistics dominated to a systematics dominated era, it is crucial to understand leftover unexplained uncertainties affecting their luminosity, such as the ones stemming from astrophysical biases. Indeed, SNe Ia are standardisable candles, whose absolute magnitude reach a 0.15~mag scatter once empirical correlations with their lightcurve stretch and colour and with their environment are accounted for. In this paper, we investigate how the standardisation process of SNe Ia depends on environment, to ultimately reduce their scatter in magnitude, focusing on colour standardisation. We use the volume-limited ZTF SN Ia DR2 sample, which offers unprecedented statistics for the low redshift ($z<0.06$) range. We first study the colour distribution, focusing on the effects of dust, to then select a dustless subsample of objects from low stellar mass environments and from the outskirts of their host galaxies. We then look at the colour-residuals relation and its associated parameter $\\beta$. Finally, we investigate the colour dependency of the environment-dependent magnitude offsets (steps), to try to disentangle intrinsic and extrinsic colour origin. Our sample probes well the red tail of the colour distribution, up to $c=0.8$. The dustless sample exhibits a significantly lower red tail ($4.6\\sigma$) in comparison to the whole sample. This suggests that reddening above $c\\geq0.2$ is dominated by host interstellar dust absorption. Looking at the colour-residuals relation, we find it to be linear with lightcurve colour. We show hints of a potential evolution of $\\beta$ with host stellar mass at a $2.5\\sigma$ level. Finally, unlike recent claims from the literature, we see no evolution of steps as a function of lightcurve colour, suggesting that dust may not be the dominating mechanism responsible for the environmental dependency of SNe Ia magnitude.\n\n"}}