{"neutrino": {"2307.12911": "2023-07-24, **On the impact of the Migdal effect in reactor CE$ν$NS experiments**, M. Atzori Corona et.al., [2307.12911v1](http://arxiv.org/abs/2307.12911v1)\n\n The search for coherent elastic neutrino nucleus scattering (CE$\\nu$NS) using reactor antineutrinos represents a formidable experimental challenge, recently boosted by the observation of such a process at the Dresden-II reactor site using a germanium detector. This observation relies on an unexpected enhancement at low energies of the measured quenching factor with respect to the theoretical Lindhard model prediction, which implies an extra observable ionization signal produced after the nuclear recoil. A possible explanation for this additional contribution could be provided by the so-called Migdal effect, which however has never been observed. Here, we study in detail the impact of the Migdal contribution to the standard CE$\\nu$NS signal calculated with the Lindhard quenching factor, finding that the former is completely negligible for observed energies below $\\sim 0.3\\,\\mathrm{keV}$ where the signal is detectable, and thus unable to provide any contribution to CE$\\nu$NS searches in this energy regime. To this purpose, we compare different formalisms used to describe the Migdal effect that intriguingly show a perfect agreement, making our findings robust.\n\n", "2307.12885": "2023-07-24, **Probing mass orderings in presence of a very light sterile neutrino in a liquid argon detector**, Animesh Chatterjee et.al., [2307.12885v1](http://arxiv.org/abs/2307.12885v1)\n\n Results from experiments like LSND and MiniBooNE hint towards the possible presence of an extra eV scale sterile neutrino. The addition of such a neutrino will significantly impact the standard three flavour neutrino oscillations. In particular, it can give rise to additional degeneracies due to additional sterile parameters. For an eV scale sterile neutrino, the cosmological constraints dictate that the sterile state is heavier than the three active states. However, for lower masses of sterile neutrinos, it can be lighter than one and/or more of the three states. In such cases, the mass ordering of the sterile neutrinos also becomes unknown along with the mass ordering of the active states. In this paper, we explore the mass ordering sensitivity in the presence of a sterile neutrino assuming the mass squared difference $\\|\\Delta\\_{41}\\|$ to be in the range $10^{-4} - 1$ eV$^2$. We study (i) how the ordering of the active states, i.e. the determination of the sign of $\\Delta\\_{31}$ gets affected by the presence of a sterile neutrino in the above mass range, (ii) the possible determination of the sign of $\\Delta\\_{41}$ for $\\Delta\\_{41}$ in the range $10^{-4} - 0.1$ eV$^2$. This analysis is done in the context of a liquid argon detector using both beam neutrinos traveling a distance of 1300 km and atmospheric neutrinos which propagates through a distance ranging from 10 - 10000 km allowing resonant matter effects. Apart from presenting separate results from these sources, we also do a combined study and probe the synergy between these two in giving an enhanced sensitivity.\n\n", "2307.12769": "2023-07-24, **First look at data from the 13-antenna setup of GRANDProto300 in northwest China**, Peng-Xiong Ma et.al., [2307.12769v1](http://arxiv.org/abs/2307.12769v1)\n\n The Giant Radio Array for Neutrino Detection (GRAND) is an envisioned observatory of ultra-high-energy neutrinos, cosmic rays, and gamma rays, with energies above 100 PeV. GRAND targets the radio signals emitted by extensive air showers induced by the interaction of ultra-high-energy particles in the atmosphere, using an array of 200,000 radio antennas split into sub-arrays deployed worldwide. GRANDProto13 (GP13) is a 13-antenna demonstrator array deployed in February 2023 in the Gansu province of China, as a precursor for GRANDProto300, which will validate the detection principle of the GRAND experiment. Its goal is to measure the radio background present at the site, validate the design of the detection units and develop an autonomous radio trigger for air showers. We will describe GP13 and its operation, and show preliminary results on noise monitoring.\n\n", "2307.12686": "2023-07-24, **Weak production of $η$ mesons induced by $ν_μ(\\barν_μ)$ at MicroBooNE energies**, A. Fatima et.al., [2307.12686v1](http://arxiv.org/abs/2307.12686v1)\n\n We have studied neutral and charged current (anti)neutrino induced $\\eta$ production off the free nucleon target at MicroBooNE energies, in the light of recent results reported by the MicroBooNE collaboration for the total $\\eta$ production cross section. This study has been made using a theoretical model in which the weak hadronic current receives contribution from the nonresonant Born terms as well as from the resonance excitations. The Born terms are obtained using the SU(3) symmetric chiral model, used earlier in the study of $K-$meson production. The contribution from the resonance terms is considered from the excitation of five nucleon resonances viz. $S\\_{11}(1535)$, $S\\_{11}(1650)$, $P\\_{11}(1710)$, $P\\_{11}(1880)$, and $S\\_{11}(1895)$. To fix the parameters of the vector current interaction, this model is first used to study the electromagnetic production of $\\eta$ mesons induced by real and virtual photons, and the theoretical results have been compared with the data from the MAINZ and JLab experiments. The partially conserved axial-vector current hypothesis and generalized Goldberger-Treiman relation are used to fix the parameters of the axial-vector current interaction. The results are presented for the total cross section for the neutral and charged current induced $\\eta$ production, ratio of the cross sections for the charged current to neutral current, MicroBooNE flux averaged cross section $\\langle \\sigma \\rangle$, $\\left \\langle \\frac{d\\sigma}{dQ^2} \\right\\rangle$ and $\\left\\langle \\frac{d\\sigma}{dp\\_\\eta} \\right\\rangle$, which may be useful in the future analysis of MicroBooNE as well as other accelerator and atmospheric neutrino experiments being performed in the ${\\cal O}$(1)~GeV energy region.\n\n", "2307.12561": "2023-07-24, **Majorana Phase And Matter Effects In Neutrino Chiral Oscillation**, Ming-Wei Li et.al., [2307.12561v1](http://arxiv.org/abs/2307.12561v1)\n\n Due to finite masses and mixing, for neutrinos propagation in space-time, there is a chiral oscillation between left- and right- chiral neutrinos, besides the usual oscillation between different generations. The probability of chiral oscillation is suppressed by a factor of $m^2/E^2$ making the effect small for relativistic neutrinos. However, for non-relativistic neutrinos, this effects can be significant. In matter, the equation of motion is modified. When neutrinos produced in weak interaction pass through the matter, the effective energies are split into two different ones depending on the helicity of the neutrino. This results in different oscillation behavior for neutrinos with different helicity, in particular there is a new resonant effect related to the helicity state of neutrino different than the usual MSW effect. For Majorana neutrinos, chiral oscillation also depends on Majorana phases.\n\n", "2307.12363": "2023-07-23, **On the Origin of Galactic Diffuse TeV-PeV Emission: Insight from LHAASO and IceCube**, Kai Yan et.al., [2307.12363v1](http://arxiv.org/abs/2307.12363v1)\n\n The high-energy diffuse gamma-ray emission and neutrino emission are expected from the Galactic plane, generated by hadronuclear interactions between cosmic rays (CR) and interstellar medium (ISM). Therefore, measurements of these diffuse emissions will provide important clues on the origin and nature of Galactic CRs. Comparing the latest observations of LHAASO and IceCube on the diffuse Galactic gamma-ray and neutrino emissions respectively, we suggest that the diffuse gamma-ray emission at multi-TeV energies contains a considerable contribution of a leptonic component. By modelling the gamma-ray halos powered by middle-aged pulsars in our Galaxy with taking into account the magnetic field configuration and the interstellar radiation field in the Galaxy, we demonstrate that the collective contribution of pulsar halos can account for the excess in the measured diffuse gamma-ray emission with respect to the predicted flux from CR-ISM interactions. The resulting one-dimensional profile along the Galactic longitude is also consistent with the observation.\n\n", "2307.12230": "2023-07-23, **Decoherence in Neutrino Oscillation between 3D Gaussian Wave Packets**, Haruhi Mitani et.al., [2307.12230v1](http://arxiv.org/abs/2307.12230v1)\n\n There is renewed attention to whether we can observe the decoherence effect in neutrino oscillation due to the separation of wave packets with different masses in near-future experiments. As a contribution to this endeavor, we extend the existing formulation based on a single 1D Gaussian wave function to an amplitude between two distinct 3D Gaussian wave packets, corresponding to the neutrinos being produced and detected, with different central momenta and spacetime positions and with different widths. We find that the spatial widths-squared for the production and detection appear additively in the (de)coherence length and in the localization factor for governing the propagation of the wave packet, whereas they appear as the reduced one (inverse of the sum of inverse) in the momentum conservation factor. The overall probability is governed by the ratio of the reduced to the sum.\n\n"}, "dark matter": {"2307.12952": "2023-07-24, **Search for the Migdal effect in liquid xenon with keV-level nuclear recoils**, Jingke Xu et.al., [2307.12952v1](http://arxiv.org/abs/2307.12952v1)\n\n The Migdal effect predicts that a nuclear recoil interaction can be accompanied by atomic ionization, allowing many dark matter direct detection experiments to gain sensitivity to sub-GeV masses. We report the first direct search for the Migdal effect for M- and L-shell electrons in liquid xenon using 7.0$\\pm$1.6 keV nuclear recoils produced by tagged neutron scatters. Despite an observed background rate lower than that of expected signals in the region of interest, we do not observe a signal consistent with predictions. We discuss possible explanations, including inaccurate predictions for either the Migdal rate or the signal response in liquid xenon. We comment on the implications for direct dark-matter searches and future Migdal characterization efforts.\n\n", "2307.12924": "2023-07-24, **Influence of early dark matter halos on the primordial black holes merger rate**, Viktor Stasenko et.al., [2307.12924v1](http://arxiv.org/abs/2307.12924v1)\n\n Primordial black hole (PBH) binaries forming in the early Universe may contribute to the merger events observed by the LIGO-Virgo-KAGRA collaborations. Moreover, the inferred merger rate constraints the fraction of PBH with masses $m \\sim 10 \\, M\\_{\\odot}$ in the dark matter (DM) to $f\\_{PBH} \\lesssim 10^{-3}$. This constraint assumes that after the formation of PBH binaries, they do not get destroyed or their parameters are not perturbed until the merger. However, PBHs themselves contribute to the formation of early DM structures in which the interactions between PBHs take place actively. This leads to the fact that the binaries can be perturbed in such a way that their lifetime becomes longer than the Hubble time $t\\_H$. In this work, we consider the effect of the initial spatial Poisson distribution of PBHs on the structure formation at the high redshifts $z \\gtrsim 10$. Next, we explore the evolution of such halos due to the interaction of PBHs with each other and with DM particles. We show that the early halos evolve on timescales much shorter than the age of the Universe. Furthermore, for fractions of PBHs $f\\_{PBH} < 1$, the internal dynamics of a halo is significantly accelerated due to the dynamical friction of PBHs against DM particles. As a result, a significant fraction of binaries will be perturbed in such structures, and the gravitational waves constraints on PBHs with masses $m \\sim 10 \\, M\\_{\\odot}$ can be weakened to $f\\_{PBH} \\sim 0.1$.\n\n", "2307.12891": "2023-07-24, **Design and sensitivity of a 6-axis seismometer for gravitational wave observatories**, Leonid Prokhorov et.al., [2307.12891v1](http://arxiv.org/abs/2307.12891v1)\n\n We present the design, control system, and noise analysis of a 6-axis seismometer comprising a mass suspended by a single fused silica fibre. We utilise custom-made, compact Michelson interferometers for the readout of the mass motion relative to the table and successfully overcome the sensitivity of existing commercial seismometers by over an order of magnitude in the angular degrees of freedom. We develop the sensor for gravitational-wave observatories, such as LIGO, Virgo, and KAGRA, to help them observe intermediate-mass black holes, increase their duty cycle, and improve localisation of sources. Our control system and its achieved sensitivity makes the sensor suitable for other fundamental physics experiments, such as tests of semiclassical gravity, searches for bosonic dark matter, and studies of the Casimir force.\n\n", "2307.12820": "2023-07-24, **Diurnal modulation of electron recoils from DM-nucleon scattering through the Migdal effect**, Mai Qiao et.al., [2307.12820v1](http://arxiv.org/abs/2307.12820v1)\n\n Halo dark matter (DM) particles could lose energy due to the scattering off nuclei within the Earth before reaching the underground detectors of DM direct detection experiments. This Earth shielding effect can result in diurnal modulation of the DM-induced recoil event rates observed underground due to the self-rotation of the Earth. For electron recoil signals from DM-electron scatterings, the current experimental constraints are very stringent such that the diurnal modulation cannot be observed for halo DM. We propose a novel type of diurnal modulation effect: diurnal modulation in electron recoil signals induced by DM-nucleon scattering via the Migdal effect. We set so far the most stringent constraints on DM-nucleon scattering cross section via the Migdal effect for sub-GeV DM using the S2-only data of PandaX-II and PandaX-4T with improved simulations of the Earth shielding effect. Based on the updated constraints, we show that the Migdal effect induced diurnal modulation of electron events can still be significant in the low energy region, and can be probed by experiments such as PandaX-4T in the near future.\n\n", "2307.12748": "2023-07-24, **Dark Matter Admixed Neutron Star in the light of HESS J1731-347 and PSR J0952-0607**, Pinku Routaray et.al., [2307.12748v1](http://arxiv.org/abs/2307.12748v1)\n\n This study explores the implications of Dark Matter in Neutron Stars (DMANS) by focusing on two specific astronomical objects: HESS J1731-347 and PSR J0952-0607. Varying the Fermi momentum k$f^{\\rm DM}$ of DM, the study analyzes the EOS for the INRS model with and without DM. Results show the robustness of the model, with most EOS curves within chiral Effective Field Theory bounds. Our model predicts a maximum mass of $2.343 \\ M\\_\\odot$ for PSR J0952-0607, satisfying NICER bounds. The analysis suggests HESS J1731-347 could be a DMANS. Constraints on DM within NSs are established, and tidal deformability lies within GW event limits. Nonradial $f$-mode oscillations increase with DM, concluding low mass stars pulsate at higher frequencies.\n\n", "2307.12629": "2023-07-24, **BGO quenching effect on spectral measurements of cosmic-ray nuclei in DAMPE experiment**, Zhan-Fang Chen et.al., [2307.12629v1](http://arxiv.org/abs/2307.12629v1)\n\n The Dark Matter Particle Explorer (DAMPE) is a satellite-borne detector designed to measure high energy cosmic-rays and $\\gamma$-rays. As a key sub-detector of DAMPE, the Bismuth Germanium Oxide (BGO) imaging calorimeter is utilized to measure the particle energy with a high resolution. The nonlinear fluorescence response of BGO for large ionization energy deposition, known as the quenching effect, results in an under-estimate of the energy measurement for cosmic-ray nuclei. In this paper, various models are employed to characterize the BGO quenching factors obtained from the experimental data of DAMPE. Applying the proper quenching model in the detector simulation process, we investigate the tuned energy responses for various nuclei and compare the results based on two different simulation softwares, i.e. GEANT4 and FLUKA. The BGO quenching effect results in a decrease of the measured energy by approximately $2.5\\%$ ($5.7 \\%$) for carbon (iron) at $\\sim$10 GeV/n and $<1\\%$ above 1 TeV/n, respectively. Accordingly, the correction of the BGO quenching effect leads to an increase of the low-energy flux measurement of cosmic-ray nuclei.\n\n", "2307.12624": "2023-07-24, **Hellings-Downs curve deformed by ultralight vector dark matter**, Hidetoshi Omiya et.al., [2307.12624v1](http://arxiv.org/abs/2307.12624v1)\n\n Pulsar timing arrays (PTAs) provide a way to detect gravitational waves (GWs) at nanohertz frequencies. To ensure the detection of GWs, observational data must exhibit the Hellings-Downs angular correlation. It is also known that PTAs can probe ultralight dark matter. In this paper, we consider possible contamination of the Hellings-Downs angular correlation by the ultralight dark matter. We find that ultralight vector dark matter can give rise to the deformation of the Hellings-Downs correlation curve. Thus, the Hellings-Downs correlation curve could contain information on ultralight dark matter with a spin.\n\n", "2307.12584": "2023-07-24, **Identifying the disc, bulge, and intra-halo light of simulated galaxies through structural decomposition**, Katy L. Proctor et.al., [2307.12584v1](http://arxiv.org/abs/2307.12584v1)\n\n We perform a structural decomposition of galaxies identified in three cosmological hydrodynamical simulations by applying Gaussian Mixture Models (GMMs) to the kinematics of their stellar particles. We study the resulting disc, bulge, and intra-halo light (IHL) components of galaxies whose host dark matter haloes have virial masses in the range $M\\_{200}=10^{11}$-- $10^{15}\\,{\\rm M\\_\\odot}$. Our decomposition technique isolates galactic discs whose mass fractions, $f\\_{\\rm disc}$, correlate strongly with common alternative morphology indicators; for example, $f\\_{\\rm disc}$ is approximately equal to $\\kappa\\_{{\\rm co}}$, the fraction of stellar kinetic energy in co-rotation. The primary aim of our study, however, is to characterise the IHL of galaxies in a consistent manner and over a broad mass range, and to analyse its properties from the scale of galactic stellar haloes up to the intra-cluster light. Our results imply that the IHL fraction, $f\\_{\\rm IHL}$, has appreciable scatter and is strongly correlated with galaxy morphology: at fixed stellar mass, the IHL of disc galaxies is typically older and less massive than that of spheroids. Above $M\\_{200}\\approx 10^{13}\\,{\\rm M\\_\\odot}$, we find, on average, $f\\_{\\rm IHL}\\approx 0.45$, albeit with considerable scatter. The transition radius beyond which the IHL dominates the stellar mass of a galaxy is roughly $30\\,{\\rm kpc}$ for $M\\_{200}\\lesssim 10^{12.8}\\,{\\rm M\\_\\odot}$, but increases strongly towards higher masses. However, we find that no alternative IHL definitions -- whether based on the ex-situ stellar fraction, or the stellar mass outside a spherical aperture -- reproduce our dynamically-defined IHL fractions.\n\n"}, "supernova": {"2307.12881": "2023-07-24, **Lensed type Ia supernovae in light of SN Zwicky and iPTF16geu**, Ana Sainz de Murieta et.al., [2307.12881v1](http://arxiv.org/abs/2307.12881v1)\n\n Strong gravitationally lensed supernovae (glSNe) are a powerful probe to obtain a measure of the expansion rate of the Universe, but they are also extremely rare. To date, only two glSNe with multiple images strongly lensed by galaxies have been found, but their short time delays make them unsuitable for cosmography. We simulate a realistic catalogue of lensed supernovae and study the characteristics of the population of detectable systems for different surveys. Our simulations show that the properties of glSNe in shallow surveys (such as the Zwicky Transient Facility; ZTF) are determined by the need for large magnifications, which favours systems of four images with short time delays and low image separations. This picture is consistent with the properties of iPTF16geu and SN~Zwicky, but is not representative of the population found in deeper surveys, which are limited by the volume of the Universe that is strongly lensed. In our simulations of the Legacy Survey of Space and Time (LSST), glSNe show longer time delays and greater angular separations. Of these systems in LSST, 35\\% will allow for time-delay measurements with a precision of 10\\% or better. In the 10 years of the survey LSST should be able to find $\\approx$ 180 systems, of which 60 will be suited for cosmography enabling a $\\approx 1.5 \\%$ precision $H\\_0$ measurement with LSST glSNe.\n\n", "2307.12330": "2023-07-23, **The chemical evolution of the solar neighbourhood for planet-hosting stars**, Marco Pignatari et.al., [2307.12330v1](http://arxiv.org/abs/2307.12330v1)\n\n Theoretical physical-chemical models for the formation of planetary systems depend on data quality for the Sun's composition, that of stars in the solar neighbourhood, and of the estimated \"pristine\" compositions for stellar systems. The effective scatter and the observational uncertainties of elements within a few hundred parsecs from the Sun, even for the most abundant metals like carbon, oxygen and silicon, are still controversial. Here we analyse the stellar production and the chemical evolution of key elements that underpin the formation of rocky (C, O, Mg, Si) and gas/ice giant planets (C, N, O, S). We calculate 198 galactic chemical evolution (GCE) models of the solar neighbourhood to analyse the impact of different sets of stellar yields, of the upper mass limit for massive stars contributing to GCE ($M\\_{\\rm up}$) and of supernovae from massive-star progenitors which do not eject the bulk of the iron-peak elements (faint supernovae). Even considering the GCE variation produced via different sets of stellar yields, the observed dispersion of elements reported for stars in the Milky Way disk is not reproduced. Among others, the observed range of super-solar [Mg/Si] ratios, sub-solar [S/N], and the dispersion of up to 0.5 dex for [S/Si] challenge our models. The impact of varying $M\\_{\\rm up}$ depends on the adopted supernova yields. Thus, observations do not provide a constraint on the M$\\_{\\rm up}$ parametrization. When including the impact of faint supernova models in GCE calculations, elemental ratios vary by up to 0.1-0.2 dex in the Milky Way disk; this modification better reproduces observations.\n\n"}}