{"neutrino": {"2512.15654": "2025-12-17, **Resonant Type-II + Type-I Hybrid Leptogenesis in SO(10) with Triplet--Neutrino Mass Degeneracy $M_T \\simeq M_{N_3}$**, Gayatri Ghosh et.al., [2512.15654v1](http://arxiv.org/abs/2512.15654v1)\n\n The origin of the baryon asymmetry of the Universe remains one of the central open problems in particle physics and cosmology. We identify a new regime of \\emph{hybrid resonant leptogenesis} in renormalizable SO(10) grand unified theories, where a quasi-degeneracy between the scalar triplet and the heaviest right-handed neutrino, \\( M\\_T \\simeq M\\_{N\\_3}, \\) induces an unavoidable interference between type-I and type-II decay amplitudes. This interference gives rise to a physical CP-violating phase, \\( φ\\_{\\rm HR} = \\arg(μf Y\\_ν^\\dagger), \\) which cannot be removed by field redefinitions and leads to a resonant enhancement of the baryon asymmetry without extreme Yukawa hierarchies or tuning. We show that the observed asymmetry, \\( Y\\_B \\simeq 8.7 \\times 10^{-11}, \\) is naturally reproduced for masses around \\(10^{11}\\,\\mathrm{GeV}\\), moderate washout, and \\(\\mathcal{O}(1)\\) phases. The mechanism is predictive and testable, with correlated implications for lepton-flavour violation and electric dipole moments.\n\n", "2512.15609": "2025-12-17, **Hadronic Clues in Quasars Caught by Fermi-LAT**, Antonio Galván et.al., [2512.15609v1](http://arxiv.org/abs/2512.15609v1)\n\n This work explores whether hadronic processes could be responsible for the high-energy emission seen in quasars identified by the Large Area Telescope (LAT) instrument aboard the Fermi satellite. In contrast to purely leptonic models, this work investigates whether hadronic mechanisms can explain the observed gamma-ray spectra by analyzing the spectral energy distributions (SEDs) of a chosen sample of FSRQs (Flat-Spectrum Radio Quasars). By incorporating both hadronic and leptonic components into their multi-wavelength modeling, we evaluate the model's feasibility to simultaneously describe the data collected by Fermi-LAT and neutrinos detected by IceCube. According to the results, a hadronic contribution would be required to explain the SED of quasars detected by Fermi-LAT. However, their contribution to the neutrino flux detected by IceCube remains understated.\n\n", "2512.15585": "2025-12-17, **Study of a triple-discriminating plastic scintillator detector for fast neutrons, thermal neutrons, and gamma rays**, Y. H. Liu et.al., [2512.15585v1](http://arxiv.org/abs/2512.15585v1)\n\n Detecting fast and thermal neutrons plays a crucial role in neutrino experiments and reactor physics. In this study, we propose a plastic scintillator detector which demonstrates the ability to clearly distinguish fast neutrons, thermal neutrons, and gamma rays within mixed radiation fields, offering a practical approach for multi-radiation detection. Two plastic scintillator assemblies: EJ200+EJ426 and EJ276+EJ426 were setup, and the system energy response was calibrated using three gamma sources(137Cs, 22Na and 60Co). An Am-Be neutron source was employed, and pulse shape discrimination(PSD) was used to separate fast neutrons, thermal neutrons and gamma rays. Using a three-sigma discrimination criterion, the EJ200+EJ426 configuration was found to reliably distinguish thermal neutrons from gamma rays, while the EJ276+EJ426 configuration can effectively discriminate fast neutrons, thermal neutrons and gamma rays at gamma-equivalent energies above 1 MeV.\n\n", "2512.15294": "2025-12-17, **Beyond Stage IV: Quasar and Galaxy Clustering and the Fundamental Physics of the 2040s**, M. Guidi et.al., [2512.15294v1](http://arxiv.org/abs/2512.15294v1)\n\n Stage IV galaxy surveys (DESI, 4MOST, MOONS, Euclid) are establishing precision constraints on cosmological parameters through baryon acoustic oscillations and redshift-space distortions, yet fundamental questions on neutrino masses, inflationary physics, and the nature of gravity remain beyond their reach. We present a science case for next-generation wide-field spectroscopic surveys targeting $1 < z < 6$ with simultaneous observations of thousands of galaxies, quasars, and emission-line galaxies. Such surveys would deliver transformative advances: (i) cosmological constraints on absolute neutrino masses ($Σm\\_ν\\lesssim 0.015\\,\\mathrm{eV}$), three times more stringent than Stage IV, enabling resolution of the neutrino mass hierarchy; (ii) detection of primordial non-Gaussianity at the level of $f\\_{\\mathrm{NL}} \\sim 1$, probing multi-field inflation; (iii) measurements of structure growth $fσ\\_8(z)$ spanning cosmic time to constrain dark energy and test gravitational modifications. Achieving these goals requires revolutionary advances in spectroscopic multiplexing ($\\mathcal{O}(1000)$ simultaneous spectra), sub-$2\\times10^{-4}(1+z)$ redshift precision at scale, and field-level inference techniques exploiting higher-order clustering statistics. We demonstrate that the proposed Wide-field Spectroscopic Telescope concept provides a technically feasible and scientifically compelling path to unlock the physics of neutrinos, inflation, and gravity that will remain inaccessible to Stage IV surveys.\n\n", "2512.15264": "2025-12-17, **Channel-Level Calibration Methods of Silicon Photomultiplier for JUNO-TAO Central Detector**, Jiayang Xu et.al., [2512.15264v1](http://arxiv.org/abs/2512.15264v1)\n\n The Taishan Antineutrino Observatory (TAO or JUNO-TAO) is a satellite observatory for the Jiangmen Underground Neutrino Observatory (JUNO), located 44 meters away from the No.1 reactor of the Taishan Nuclear Power Plant. TAO can measure the reactor antineutrino energy spectrum with excellent energy resolution (better than 2\\% at 1 MeV) using state-of-the-art Silicon Photomultipliers (SiPMs) operated at low temperature. To achieve this goal, the SiPMs (together with their readout electronics) must be well calibrated. This paper presents the channel-level calibration methods for the dark count rate (DCR), relative photon detection efficiency (PDE), time offset, gain, and internal optical crosstalk (IOCT) of the SiPMs based on charge and time information of the collected events. For the calibration of the external optical crosstalk (EOCT), in terms of its rate and emission angle distribution, a novel method is proposed by switching on and off different groups of SiPMs with an LED placed in the detector. Using one million simulated events, the expected calibration biases are evaluated for all the aforementioned parameters: relative PDE (2.1\\%), IOCT (1.4\\%), DCR (0.4\\%), EOCT Rate ($<0.1\\%$), gain ($<0.1\\%$), time offset (0.027 ns). The emission angle distribution of the EOCT photons could be measured with a bias of less than 4\\% in main angular range.\n\n", "2512.15065": "2025-12-17, **A Comprehensive Interpretation of Fermi-LAT Pulsars: Fundamental-Plane Death Border, Visibility Thresholds, and GeV-TeV Unification**, Constantinos Kalapotharakos et.al., [2512.15065v1](http://arxiv.org/abs/2512.15065v1)\n\n We present a framework that links equatorial-current-sheet (ECS) physics to catalog-lelvel phase-averaged gamma-ray pulsar properties. Guided by analytic scalings and 3D particle-in-cell (PIC) simulations, we show that the pulsar \"Fundamental Plane\" (relating gamma-ray luminosity, spectral cutoff energy, spin-down power $\\dot{\\cal{E}}$, and surface magnetic field) is bounded by two regimes: a radiation-reaction-limited branch and a potential-drop-limited branch. Their intersection defines a transition in $\\dot{\\cal{E}}$ that maps to a gamma-ray visibility threshold on the $P-\\dot{P}$ diagram, above which detectability is set by distance and beaming, and below which both cutoff energy and efficiency decline rapidly. Placing ATNF pulsars and McGill magnetars onto these planes reproduces the observed Fermi occupancy, with millisecond pulsars (MSPs) on the observable side, young pulsars (YPs) straddling the threshold, and magnetars clustering at or just below it. At higher $\\dot{\\cal{E}}$, both MSPs and YPs depart from the maximal radiation-reaction-limited envelope at similar cutoff energies, suggesting that enhanced pair creation screens the accelerating electric field in the ECS. We interpret this behavior with a compactness-based criterion for optically thin $γγ$ pair feedback in or near the ECS and briefly note an extension to $γγ\\rightarrowμ^\\pm$ that could yield pulsed multi-TeV neutrinos in the most energetic systems. The framework predicts an MeV-bright, GeV-faint corridor below current Fermi sensitivity, a target for next-generation MeV missions. Finally, motivated by the recent HESSII detection of pulsed multi-TeV emission from Vela, we use PIC particle distributions with a simple seed-photon model to reproduce a multi-TeV inverse-Compton component alongside the GeV curvature emission, supporting a unified ECS-based GeV-TeV origin.\n\n", "2512.14866": "2025-12-16, **Development of a Custom kV-amplitude, pressure-tolerant Radio-Frequency transmitter**, Christian Hornhuber et.al., [2512.14866v1](http://arxiv.org/abs/2512.14866v1)\n\n Current experiments seeking first-ever observation of Ultra-High Energy Neutrinos (UHEN) typically utilize radio frequency (RF) receiver antennas deployed in cold, radio-transparent polar ice, to measure the coherent RF signals resulting from neutrino interactions with ice molecules. Accurate calibration of the receiver response, sampling the full range of possible neutrino geometries, is necessary to estimate the energy and incoming direction of the incident neutrino. Herein, we detail the design and performance of a custom radio-frequency calibration transmitter, consisting of a battery-powered, kiloVolt-scale signal generator (`IDL' pulser) driving an antenna (South Pole UNiversity of Kansas antenna, or `SPUNK') capable of operating at pressures of 200 atmospheres. Performance was validated by lowering the transmitter into a borehole at the South Pole to a depth of 1740 m, yielding high Signal-to-Noise ratio signals at a distance of 5 km from the source.\n\n", "2512.14839": "2025-12-16, **Beyond $\\boldsymbol{SU(N)}$: $\\boldsymbol{U(3) \\times U(2)}$ as the underlying symmetry of the strong and electroweak interactions**, Antonio Herrero-Brocal et.al., [2512.14839v1](http://arxiv.org/abs/2512.14839v1)\n\n The gauge principle is a cornerstone of particle-physics model building. Nevertheless, many constructions leave certain global $U(1)$ redundancies ungauged. In this work, we take the gauge principle to its logical extreme by promoting all $SU(N)$ symmetries to $U(N)$. We focus on a model based on local $U(3)\\times U(2)$ invariance. This framework accounts for several otherwise ad hoc features of the Standard Model, including charge quantization and the observed hypercharge assignments, which emerge here as unique predictions. Furthermore, the internal consistency of the model requires the introduction of right-handed neutrinos and implies the presence of an additional $U(1)$ factor that can be identified with $B-L$, thereby naturally yielding non-zero neutrino masses. In light of these findings, we hypothesize that $U(3)\\times U(2)$ constitutes the underlying symmetry of the strong and electroweak interactions. More importantly, our approach opens up novel avenues for model building, driven by this extended interpretation of the gauge principle.\n\n", "2512.14824": "2025-12-16, **Towards First Detection of the Solar MSW Transition With JUNO**, Obada Nairat et.al., [2512.14824v1](http://arxiv.org/abs/2512.14824v1)\n\n Matter-induced neutrino flavor mixing (the Mikheyev-Smirnov-Wolfenstein, or MSW, effect) is a central prediction of the neutrino mixing framework, but it has not been conclusively observed. Direct observation of the energy-dependent MSW transition in the solar electron-neutrino survival probability would solve this, but backgrounds have been prohibitive. We show that our new technique for suppressing muon-induced spallation backgrounds will allow JUNO to measure the MSW transition at $>$4$σ$ significance in 10 years. This would strongly support upcoming multi-\\$1B next-generation long-baseline experiments and their goals in cementing the neutrino mixing framework.\n\n", "2512.14813": "2025-12-16, **Implications of Flavor Symmetries for Baryon Number Violation**, Arnau Bas i Beneito et.al., [2512.14813v1](http://arxiv.org/abs/2512.14813v1)\n\n In the Standard Model, baryon number is an accidental symmetry, whose violation would constitute unambiguous evidence of new physics, with proton decay providing its most prominent experimental signature. At the same time, the peculiar structure of flavor can serve as a guiding principle for exploring possible new-physics effects. In this work, we present a systematic classification of dimension-six baryon-number-violating (BNV) SMEFT operators across several flavor-symmetry assumptions and analyze the resulting phenomenology. Interestingly, in certain flavor scenarios the non-trivial interplay with tiny neutrino masses leads to proton-decay constraints compatible with BNV scales in the multi-TeV range. Finally, we complement the EFT analysis by identifying one-particle UV completions of the BNV operators, revealing scenarios in which the leading-order EFT description may not fully account for their underlying dynamics.\n\n", "2512.14684": "2025-12-16, **Cosmic Strings Gravitational Wave Probe of Leptogenesis: Thermal, Non-thermal, Near-resonant and Flavourful**, Anish Ghoshal et.al., [2512.14684v2](http://arxiv.org/abs/2512.14684v2)\n\n Breaking a global or local $U(1)\\_{\\rm B-L}$ symmetry at high scales simultaneously generates Majorana masses for heavy right-handed neutrinos and produces a network of cosmic strings. The evolution and decay of these strings source a stochastic gravitational-wave background that may be probed by current and future gravitational-wave experiments, while the decays of the resulting massive right-handed neutrinos can generate the baryon asymmetry of the Universe via leptogenesis. We derive analytical bounds for successful leptogenesis with a global and a local $U(1)\\_{B-L}$ symmetry, separately finding an absolute lower bound on the lightest right-handed neutrino mass $M\\_1 > 1.74 \\times 10^{8}\\,\\mathrm{GeV}$ for thermal initial conditions and $M\\_1 > \\mathcal{O}(10^{6})\\,\\mathrm{GeV}$ for non-thermal initial conditions. Allowing for near-resonant leptogenesis relaxes these bounds to TeV scale in both cases making it a viable target at collider searches complementing the GW signals. Full flavour effects are included, and crucially, we determine the region where successful leptogenesis can be probed through gravitational-wave observations in upcoming experiments such as LISA and Einstein Telescope. Importantly, we find that flavour effects rescue regions of the parameter space that are ruled out due to current CMB or gravitational wave measurements.\n\n", "2512.14551": "2025-12-16, **Search for heavy neutral leptons in B-meson decays**, LHCb collaboration et.al., [2512.14551v1](http://arxiv.org/abs/2512.14551v1)\n\n A search for long-lived heavy neutral leptons produced in B-meson decays and decaying to a $ μ^\\pm π^\\mp$ final state is performed with data collected by the LHCb experiment in proton-proton collisions at a centre-of-mass energy of 13 TeV, corresponding to an integrated luminosity of $5\\,\\mathrm{fb}^{-1}$. The results are interpreted in both lepton-number-conserving and lepton-number-violating scenarios. No significant excess is observed. Constraints are placed on the squared mixing element $\\|U\\_{μN}\\|^2$ to the active muon neutrino, under the assumption that couplings to other lepton flavours are negligible, in the mass range of $1.6$-$5.5$ GeV.\n\n", "2512.14546": "2025-12-16, **Multi-messenger and time-domain astronomy in the 2040s**, Samaya Nissanke et.al., [2512.14546v1](http://arxiv.org/abs/2512.14546v1)\n\n Multi-messenger astronomy will be transformed in the 2040s by an unprecedented volume of detections from next-generation gravitational wave, high-energy, and ultra-high energy neutrino, cosmic ray, and time domain observatories. This white paper, prepared for the European Southern Observatory (ESO) Expanding Horizons call, outlines the key science questions enabled by this emerging multi-messenger ecosystem, ranging from nucleosynthesis and dense matter physics to cosmology, fundamental physics, and the growth of black holes across cosmic time. We demonstrate that fully exploiting these discoveries requires a step change in optical to near infrared spectroscopic capability, including low latency response, high throughput, and flexible time domain operations across both hemispheres. We argue that without a dedicated large-aperture time domain facility, the scientific return of multi-messenger astronomy in the 2040s will be considerably limited.\n\n", "2512.14382": "2025-12-16, **Design and Evaluation of a PMT High-Voltage system for Deepsea Neutrino Telescope**, Zhu Mao et.al., [2512.14382v1](http://arxiv.org/abs/2512.14382v1)\n\n We present the design and characterization of a Cockcroft-Walton (CW) high-voltage system developed for deep-sea neutrino telescopes. The system provides independently adjustable bias voltages to 31 three-inch PMTs inside a hybrid Digital Optical Module (hDOM). This paper describes the system design, control logic, test procedures, and the combined PMT-base performance, including baseline stability, gain uniformity, and timing accuracy. Performance was evaluated under laboratory conditions that simulate the deep-sea environment. Baseline measurements indicate low and stable electronic noise, while gain calibration using single-photoelectron spectra shows that all PMTs can be tuned to a common nominal gain and remain stable over multi-day operation. Transit-time-spread measurements yield values below 1.8 ns (FWHM), consistent with manufacturer specifications. These results demonstrate that the CW-based system delivers the stability and timing precision required for deep-sea\n\n", "2512.14271": "2025-12-16, **Cosmological Bounds on Scotogenic Model with Asymmetric Mediator**, Kento Asai et.al., [2512.14271v1](http://arxiv.org/abs/2512.14271v1)\n\n We study cosmological constraints on the asymmetric mediator scenario, a variant of the scotogenic model that addresses the origins of neutrino masses, dark matter (DM), and the baryon asymmetry. An SU(2)$\\_L$ doublet scalar $η$ mediates between the visible and dark sectors, while a singlet scalar $σ$ serves as the DM candidate. We evaluate the DM relic abundance by solving the Boltzmann equations including $η$ decay and scattering processes prior to the freeze-out of the $η$ asymmetry, and show Big Bang nucleosynthesis constraints from late-time $η$ decays. Combining the DM abundance and BBN bounds, we find the favored parameter space of this model, for instance, the mediator masses of $m\\_η\\lesssim \\mathcal{O}(10)$ TeV.\n\n", "2512.14097": "2025-12-16, **The Nucleon Axial Form Factor from Elementary Target Data**, A. S. Meyer et.al., [2512.14097v1](http://arxiv.org/abs/2512.14097v1)\n\n Precise neutrino-nucleon amplitudes are essential ingredients for predicting neutrino event rates in current and upcoming long-baseline neutrino oscillation experiments. A common neutrino interaction with a low reaction threshold and with most of the energy carried by two final state particles is quasielastic scattering, for which the nucleon axial form factor, $F\\_{A}(Q^{2})$, is a dominant source of uncertainty. Improvements to the nucleon axial form factor rely on neutrino scattering data with elementary targets to reduce or eliminate the need for nuclear modeling systematics. This work examines constraints on the nucleon axial form factor that can be achieved from datasets of neutrino scattering on deuterium targets, Lattice QCD predictions, and from the recent hydrogen target data from the MINERvA Collaboration. Significant tension is found between hydrogen and deuterium target data, suggesting that extractions from deuterium underestimate both the central value and uncertainty of the form factor. Parameterizations for and uncertainties of the nucleon axial form factor using the $z$ expansion are provided.\n\n", "2512.14033": "2025-12-16, **Liquid Handling of the JUNO Experiment**, Jiajun Li et.al., [2512.14033v2](http://arxiv.org/abs/2512.14033v2)\n\n The Filling, Overflow, and Circulation (FOC) system is a critical subsystem of the Jiangmen Underground Neutrino Observatory (JUNO), responsible for the safe handling of the Liquid Scintillator (LS) and water throughout the detector's commissioning and operational lifetime. This paper details the design and operation of the FOC system, which accomplished the filling of the world's largest LS detector--taking 45 days for water (6.4*10^4 m^3) and 200 days for LS (2.3*10^4 m^3). Throughout water filling, the liquid level difference between the Central Detector and Water Pool was rigorously maintained within safety limits. During LS filling, level control achieved +/-2 cm precision with flow regulation within +/-0.5% of setpoints. An automated control system based on Programmable Logic Controllers and the Experimental Physics and Industrial Control System framework ensured reliable operation. The system preserved LS radiopurity, maintaining 222Rn below 1 mBq/m^3 during filling and achieving 238U/232Th concentrations below 10^-16 g/g. The successful commissioning and operation of the FOC system have established it as an indispensable foundation for the stable long-term operation of the JUNO detector.\n\n"}, "dark matter": {"2512.15292": "2025-12-17, **Ultralight Dark Matter Constraints from NanoHertz Gravitational Waves**, Shreyas Tiruvaskar et.al., [2512.15292v1](http://arxiv.org/abs/2512.15292v1)\n\n We investigate the impact of ultralight dark matter (ULDM) on the mergers of supermassive black holes (SMBH) and the resulting stochastic gravitational wave background. ULDM is based on exceptionally light particles and yields galactic halos with dense central solitons. This increases the drag experienced by binary SMBH, decreasing merger times and potentially suppressing gravitational radiation from the binary at low frequencies. We develop semi-analytic models for the decay of SMBH binaries in ULDM halos and use current pulsar timing array (PTA) measurements to constrain the ULDM particle mass and its fractional contribution to the dark matter content of the universe. We find a median ULDM particle mass of $7. \\times 10^{-22}$ eV and show that scaling relations suggest that the drag remains effective at relatively low ULDM fractions, which are consistent with all other constraints on the model. Consequently, future pulsar timing measurements will be a sensitive probe of any ULDM contribution to the overall dark matter content of the universe.\n\n", "2512.15278": "2025-12-17, **The Direct Search Experiment for Light Dark Matter (DELight): Overview and Perspectives**, Melih Solmaz et.al., [2512.15278v1](http://arxiv.org/abs/2512.15278v1)\n\n Driven by the null results in the searches for dark matter, the field of direct dark matter detection is constantly evolving to push new frontiers. Ultimately, a vast parameter space for dark matter masses below a few GeV is yet to be explored. That said, low mass dark matter candidates necessitate novel detector designs with lower thresholds and alternative target materials. The Direct search Experiment for Light dark matter (DELight) will deploy a target of superfluid $^4$He instrumented with large area microcalorimeters (LAMCALs) based on magnetic microcalorimeter (MMC) technology in a setup optimized for low mass dark matter searches. This paper presents an overview of this novel upcoming experiment, including detection technology, sensitivity goals and R&D studies.\n\n", "2512.15096": "2025-12-17, **Cosmological Models with Symmetric Teleparallel Gravity and its Extension**, S. A. Narawade et.al., [2512.15096v1](http://arxiv.org/abs/2512.15096v1)\n\n This thesis investigates late-time cosmic acceleration using modified gravity theories with a focus on $f(Q)$ gravity, as an alternative to the $Λ$CDM model. The standard cosmological model attributes the acceleration to a cosmological constant, but it faces issues like the unexplained nature of dark matter and dark energy and discrepancies with certain observations. Modified gravity including $f(Q)$ gravity, offers a potential solution by incorporating dynamic dark energy or changes to gravitational interactions, avoiding the need for a constant cosmological term. Also, thesis evaluates the viability of $f(Q)$ gravity by analyzing observational data from Type Ia Supernovae, Hubble parameter measurements and other cosmological datasets. Using statistical tools like Markov Chain Monte Carlo (MCMC) analysis, this work constrains the parameters of $f(Q)$ gravity and compares it to the $Λ$CDM model.....\n\n", "2512.15073": "2025-12-17, **Dark matter in ALFALFA galaxies: Investigating galaxy-halo connection**, Meng Yang et.al., [2512.15073v1](http://arxiv.org/abs/2512.15073v1)\n\n This paper aims to investigate the galaxy-halo connection using a large sample of individual galaxies with $\\mathrm{H\\,I}$ integrated spectra. We determine their dark matter content by applying a dynamical method based on $\\mathrm{H\\,I}$ line widths measured with the curve-of-growth technique, together with inclination corrections inferred from optical images. We build a sample of 2453 gas-rich predominantly late-type galaxies spanning a stellar mass range of $10^{8.7}M\\_\\odot$ to $10^{11.4}M\\_\\odot$ by matching them one-to-one with their counterparts from the ALFALFA survey and the TNG100 simulation, ensuring a direct match of stellar mass and $\\mathrm{H\\,I}$ radius. We generate mock images and mock $\\mathrm{H\\,I}$ integrated spectra for TNG100 galaxies, and apply the same dynamical method to both ALFALFA and TNG100 mock galaxies to infer their dark matter masses. Across all stellar mass bins, ALFALFA galaxies exhibit lower median dark matter masses than the mock TNG100 simulation results. In each bin, this offset is driven by a tail of galaxies with comparatively low dark matter content, which becomes more prominent toward higher stellar masses. In the highest mass bin ($M\\_* > 10^{11} M\\_\\odot$), late-type ALFALFA galaxies show a median dark matter mass that is 23% lower than that of their counterparts in the TNG100 dark-matter-only simulation, with 32% of ALFALFA galaxies having $M\\_\\mathrm{DM}(<R\\_\\mathrm{HI})<10^{11.5} M\\_\\odot$, compared to 17% in the mock TNG100 sample. These results suggest that a larger fraction of massive late-type galaxies reside in relatively less massive dark matter haloes than predicted by the TNG100 simulation.\n\n", "2512.14942": "2025-12-16, **ANUBIS: Projected Sensitivities and Initial Results from the proANUBIS demonstrator with Run 3 LHC data**, Théo Reymermier et.al., [2512.14942v1](http://arxiv.org/abs/2512.14942v1)\n\n Despite the success of the Standard Model (SM) there remains behaviour it cannot describe, in particular the presence of non-interacting Dark Matter. Many models that describe dark matter can generically introduce exotic Long-Lived Particles (LLPs). The proposed ANUBIS experiment is designed to search for these LLPs within the ATLAS detector cavern, located approximately 20-30 m from the Interaction Point (IP). A prototype detector, proANUBIS, has taken data within the ATLAS detector cavern since 2024, corresponding to 104 $fb^{-1}$ of pp data. We report on the potential sensitivity of ANUBIS to a selection of LLP models, i.e. Higgs Portal and Heavy Neutral Leptons, as well as future planned studies. Additionally, we will show the first results of the proANUBIS demonstrator, and how it will be used to study the expected backgrounds for the ANUBIS detector.\n\n", "2512.14906": "2025-12-16, **The diffusion coefficient in the Large Magellanic Cloud**, Javier Reynoso-Cordova et.al., [2512.14906v1](http://arxiv.org/abs/2512.14906v1)\n\n The Large Magellanic Cloud (LMC) is the largest satellite galaxy of the Milky Way and provides a unique laboratory for high-energy astrophysics and dark matter studies. In this work, we develop an end-to-end numerical description of cosmic-ray transport and the associated non-thermal emission in the LMC, extending the public DRAGON and HERMES codes. Within this framework, we compute the diffuse synchrotron radiation produced by cosmic-ray electrons in the LMC and compare our predictions with observed low-frequency radio maps. Because electron diffusion imprints a characteristic morphology on the radio emission, this comparison allows us to infer the effective average diffusion coefficient in the LMC. We find a diffusion coefficient D0 = (3-6) $\\times 10^{28} \\; \\rm{cm}^2 \\; \\rm{s}^{-1}$ at 1 GeV, comparable to but slightly larger than values typically inferred for the Milky Way. More generally, this work provides a scalable tool for interpreting non-thermal signals in nearby galaxies and constraining their cosmic-ray transport properties.\n\n", "2512.14838": "2025-12-16, **Non-Thermal Production of Sexaquark Dark Matter**, Marianne Moore et.al., [2512.14838v1](http://arxiv.org/abs/2512.14838v1)\n\n Standard thermal freeze-out scenarios with QCD-scale interaction rates predict a $uuddss$ sexaquark relic abundance many orders of magnitude below the observed dark matter density, representing a key challenge for sexaquark dark matter models. Additionally, if the maximum post-inflationary temperature never exceeds the QCD confinement scale, the usual thermal/chemical-equilibrium production of the sexaquark near ${T \\sim T\\_{\\rm QCD} \\simeq 150 \\text{-} 170~\\mathrm{MeV}}$ never occurs. In this work we show that non-thermal mechanisms can naturally overcome this obstacle. Using late-decaying reheatons as a representative case (while noting the broader applicability), we demonstrate that the final abundance is determined by two quantities: the branching fraction into strange-quark-rich matter and the coalescence probability into sexaquarks during the matter-dominated or early radiation-dominated epoch. We provide compact expressions and benchmark calculations for reheating temperatures $T\\_R \\in [10, 100]~\\mathrm{MeV}$ and reheaton masses above the QCD confinement scale. Unlike the predictive but unsuccessful thermal scenario, non-thermal production is sensitive to injection microphysics, coalescence efficiency, and residual entropy dilution. We delineate the viable parameter space, evaluate collider and precision constraints on representative reheaton models, and derive indirect detection bounds on residual antisexaquark populations. Our results establish non-thermal production as a viable pathway to sexaquark dark matter and highlight broader implications for non-equilibrium mechanisms in the early universe.\n\n", "2512.14837": "2025-12-16, **Compact Stars as Portals to Extra-Dimensional Dark Matter**, Raghuveer Garani et.al., [2512.14837v1](http://arxiv.org/abs/2512.14837v1)\n\n We investigate hydrostatic configurations of asymmetric dark matter (DM) spheres in scenarios where fermionic DM can propagate into extra spatial dimensions, while Standard Model fields remain confined to ordinary three dimensions. As the number of extra dimensions increases, the effective equation of state for non-relativistic matter softens, making even modest DM accumulation inside neutron stars susceptible to gravitational collapse into extra-dimensional black holes. These black holes are longer lived than their $3$ dimensional counterparts and can accrete enough material to consume an entire neutron star, ultimately producing solar-mass black holes. For geometric cross sections, DM with masses above $\\mathcal{O}(10\\,{\\rm TeV})$ may already be excluded for more than two extra dimensions of size ${\\mathcal{O}(\\rm fm})$ -- sharply contrasting with the standard $3$ dimensional case, where comparable limits only appear for masses $\\gtrsim 10^{5}$ TeV at typical halo densities of $0.3\\, \\rm{GeV/cm^3}$.\n\n", "2512.14828": "2025-12-16, **Opening the Parameter Space of sub-GeV Inelastic Dark Matter through Parity Violation**, Giovani Dalla Valle Garcia et.al., [2512.14828v1](http://arxiv.org/abs/2512.14828v1)\n\n Sub-GeV dark matter (DM) has emerged as a particularly compelling target in light of the persistent null results from conventional DM searches. While s-wave annihilating DM candidates with masses below the GeV are strongly constrained by indirect-detection bounds, inelastic scenarios can naturally evade these limits. In this work, we show that parity violation can play an important role in inelastic DM models featuring long-lived excited states by inducing small diagonal couplings that significantly relax experimental constraints. A precise determination of the excited-state abundance is essential for assessing the phenomenology of such models. To this end, we solve the integrated Boltzmann equation, fully accounting for up- and down-scattering with electrons and positrons as well as dark-sector conversion processes. Using the resulting abundance, we update the viable parameter space in light of the most recent experimental constraints and demonstrate that parity-violating interactions can reopen broad regions of parameter space that would otherwise be excluded. Moreover, the forthcoming LDMX experiment will probe a significant portion of the parameter space. The framework developed in this work can be readily applied to other exothermic sub-GeV DM scenarios.\n\n", "2512.14821": "2025-12-16, **Symmetric Dicke States as Optimal Probes for Wave-Like Dark Matter**, Ping He et.al., [2512.14821v1](http://arxiv.org/abs/2512.14821v1)\n\n We identify symmetric Dicke states as the optimal quantum probes for distributed sensing of wave-like dark-matter fields. Within an ensemble-averaged quantum-metrological framework that incorporates the field's random phases and finite coherence, they maximize the Fisher information for short-baseline arrays with $N\\_d$ sensors and realize a robust $N\\_d^2$ enhancement. They also retain this collective advantage under amplitude-damping noise, whereas GHZ-type probes are highly fragile and rapidly lose their sensitivity once such noise is included. For two sensors at separations comparable to the dark-matter coherence length, the optimal entangled state acquires an additional spatial-correlation phase and outperforms both Dicke and independent probes. Our framework applies broadly to stochastic bosonic fields, including gravitational waves, and can be implemented with superconducting qubits, atomic ensembles, and NV centers.\n\n", "2512.14808": "2025-12-16, **Discovery of Isolated, Quenched, and Likely Backsplash Dwarf Galaxies near M101**, Julian Shapiro et.al., [2512.14808v1](http://arxiv.org/abs/2512.14808v1)\n\n I report the discovery of three faint, semi-resolved quiescent dwarf galaxies, two of which are strong backsplash candidates associated with the nearby satellite-sparse spiral M101 (D ~ 6.7 Mpc). The galaxies lie within the magnitude range MV ~ -7.70 to -8.2 and half-light radii rh ~ 110 to 204 pc. Shapiro DG-I (Sha DG-I/MAGE1412+5650) is a concurrently discovered and isolated galaxy. Shapiro DG-II (Sha DG-II) is a fainter dwarf and potential companion to the SMC-mass galaxy NGC 5585 (D ~ 6.84 Mpc). Shapiro DG-III (Sha DG-III) is an isolated dwarf on the edge of the ultra-faint regime. Hydrodynamical simulations suggest a backsplash population of galaxies that have been environmentally stripped by interactions with a host and ejected from the system, though they have not yet been definitively observed in the local universe. Considering their quenched stellar populations, indicated by the lack of coincident GALEX emission, relative distances, and fitting models, the galaxies are consistent with a backsplash origin and are pending follow-up. Analysis is performed to test whether the system's population can be explained by standard cosmology. A potential correlation is found between satellite abundances and halo masses calibrated by tidal indices in a sample of nearby MW-like galaxies, suggesting the importance of environmental density in the formation of dark matter subhaloes, though a larger sample is required. M101's sparse satellite system fits well in the relation and is in agreement with ΛCDM expectations.\n\n", "2512.14672": "2025-12-16, **Clustering with Light (but Massive) Relics**, Jason Kumar et.al., [2512.14672v1](http://arxiv.org/abs/2512.14672v1)\n\n We consider the effect of Light (but Massive) Relics (LiMRs) on the clustering of matter in the early Universe. We account for the fact that LiMRs which are massive enough may cluster on large length scales at early times, and may thus impact weak lensing of the cosmic microwave background (CMB) even on small angular scales. In particular, we find that LiMRs in the $\\gtrsim$ eV mass range (and even $> 10$ eV), can constitute a non-negligible component of dark matter. This opens up a class of scenarios in which energy is injected as dark radiation, but begins to redshift as matter before recombination, thus avoiding constraints on $ΔN\\_{eff}$ while providing an eV-range dark matter component.\n\n", "2512.14636": "2025-12-16, **Cluster properties as a function of dynamical state in the DESI Legacy x UNIONS surveys**, Syeda Lammim Ahad et.al., [2512.14636v1](http://arxiv.org/abs/2512.14636v1)\n\n We investigate how the dynamical state of galaxy clusters influences their galaxy populations and mass distributions. Using photometrically selected clusters from the DESI Legacy Imaging Survey cross-matched with the UNIONS galaxy shear catalogue, we classify clusters as evolved or evolving based on their rest-frame r-band magnitude gaps and stellar mass ratios between the brightest cluster galaxies (BCGs) and bright satellites. We measure the stellar mass functions, weak-lensing profiles, and radial number density and red-fraction profiles of stacked clusters in both subsamples. Evolved clusters exhibit more concentrated lensing profiles, bimodal stellar mass functions dominated by massive BCGs, and a deficit of intermediate-mass satellites, while evolving clusters show flatter central lensing signals and an excess of massive satellites. Applying the same selection to IllustrisTNG clusters reproduces these trends and links the observed differences to distinct mass accretion histories. These results demonstrate the close link between cluster galaxy populations and the overall dynamical state of their underlying dark matter halo.\n\n", "2512.14789": "2025-12-16, **Why the Northern Hemisphere Needs a 30-40 m Telescope and the Science at Stake: Galactic Archaeology from the Northern Sky**, Borja Anguiano et.al., [2512.14789v1](http://arxiv.org/abs/2512.14789v1)\n\n By the 2040s--50s, facilities such as \\emph{Gaia}, WEAVE, 4MOST, Rubin, \\emph{Euclid}, \\emph{Roman}, and the ESO ELT will have transformed our global view of the Milky Way. Yet key questions will remain incompletely resolved: a detailed reconstruction of the Galaxy's assembly from its earliest building blocks, and robust tests of dark matter granularity using the fine structure of the stellar halo and outer disk -- particularly in the Galactic anticenter. Addressing these questions requires high-resolution spectroscopy of faint main-sequence stars (typically 1--2 mag below the turnoff) and turnoff stars ($r \\sim 21$--23) in low-surface-brightness structures: halo streams and shells, ultra-faint dwarf galaxies, the warped and flared outer disk, and anticenter substructures. We argue that addressing this science case requires a 30\\,m-class telescope in the northern hemisphere, equipped with wide-field, highly multiplexed, high-resolution spectroscopic capabilities. Such a facility would enable (i) a Northern Halo Deep Survey of $\\sim 10^{5}$--$10^{6}$ faint main-sequence and turnoff stars out to $\\sim 150$--200\\,kpc, (ii) chemodynamical mapping of dozens of streams to measure perturbations from dark matter subhalos, and (iii) tomographic studies of the anticenter and outer disk to disentangle perturbed disk material from accreted debris. A northern 30\\,m telescope would provide the essential complement to ESO's southern ELT, enabling genuinely all-sky Milky Way archaeology and delivering stringent constraints on the small-scale structure of dark matter.\n\n", "2512.14784": "2025-12-16, **Why the Northern Hemisphere Needs a 30-40 m Telescope and the Science at Stake: A Low Surface Brightness Science Case**, Mireia Montes et.al., [2512.14784v1](http://arxiv.org/abs/2512.14784v1)\n\n The Extragalactic Low Surface Brightness (LSB, $μ\\_V\\gtrsim 27$ mag/arcsec$^2$) Universe represents a crucial, yet largely unseen, frontier in modern astrophysics. This faint realm holds the keys to completing our understanding of galaxy evolution, hierarchical assembly, and even the fundamental nature of dark matter. Our current theoretical models are inherently incomplete, largely mirroring the properties of the brightest, most easily observed objects. To overcome this critical bias and unlock the secrets of this realm, a transformative leap in observational capability is required. A 30 to 40m class telescope, leveraging unprecedented sensitivity and spatial resolution, especially with adaptive optics, is the essential tool to fundamentally probe these faint, low-density stellar regimes. This white paper details the transformative LSB science that such a facility, strategically positioned in the Northern Hemisphere (NH) to access crucial nearby structures and rich environments, can achieve.\n\n", "2512.14783": "2025-12-16, **Why the Northern Hemisphere Needs a 30-40m Telescope and the Science at Stake: Ultra-Low-Mass Dwarf Galaxies Across the Boreal Cosmic Web**, J. Alfonso L. Aguerri et.al., [2512.14783v1](http://arxiv.org/abs/2512.14783v1)\n\n Dwarf galaxies dominate the galaxy population in the nearby Universe and occupy the regime where feedback, reionization, and environment exert their strongest influence on galaxy formation. Despite their importance, detailed spectroscopic constraints on the faintest dwarfs are currently limited to a handful of systems in the Local Volume, leaving the role of large-scale environment essentially unexplored at ultra-low stellar masses. A northern 30-40m class telescope equipped with a multiplexed optical integral-field spectrograph will enable a systematic, spatially resolved spectroscopic census of dwarf galaxies with $M\\_\\star \\sim 10^{5}-10^{7} M\\_\\odot$ across a wide range of environments. A deep survey of the Coma Cluster, combined with targeted observations of dwarfs in clusters, groups, filaments, and low-density regions, will map star formation histories, chemical enrichment, and internal kinematics at unprecedented depth. This program will directly test models of dark-matter physics, early-Universe feedback, and environmental quenching in the lowest-mass galaxies, establishing dwarf galaxies as precision probes of both galaxy formation and fundamental physics.\n\n", "2512.14372": "2025-12-16, **Surveying Galaxy Clusters (in formation) in the Distant Universe**, J. M. Pérez-Martínez et.al., [2512.14372v1](http://arxiv.org/abs/2512.14372v1)\n\n Present-day galaxy clusters are the largest virialized structures in the Universe, yet their early assembly remains poorly understood. At z$>$2, clusters in formation span tens of Mpc and host gas-rich, dust-obscured galaxies embedded in extended, low-surface-brightness gaseous environments. Current (sub-)millimeter facilities lack the mapping speed, sensitivity, and contiguous field of view needed to trace the cold gas and dust driving rapid galaxy growth across such scales. A future large single-dish observatory with degree-scale coverage, broad spectral access, and high-multiplex capability would enable comprehensive and uniform mapping of entire protoclusters, revealing where star formation is triggered or quenched, and quantifying the cold gas budget, thus providing information on gas cooling within protocluster environments. In synergy with wide-sky optical/NIR surveys such as Euclid, LSST, and Roman, this facility would provide the missing multi-scale and multiphase submillimeter view needed to uncover how the stellar, gaseous, and dark-matter components assemble in protoclusters, completing our view of early structure formation.\n\n", "2512.14281": "2025-12-16, **Connecting galaxies with their haloes -- from parsec to Mpc scales**, K. Fahrion et.al., [2512.14281v1](http://arxiv.org/abs/2512.14281v1)\n\n Galaxy evolution is driven by processes occurring across a wide range of scales, from star formation within giant molecular clouds (parsec scales) to outflows and secular evolution across entire galaxies (kpc scales), and the interplay between galaxies, their dark matter haloes, and large-scale structures (Mpc scales). Connecting the distribution of baryonic matter and energy across these scales will remain one of the key challenges for both theoretical and observational astrophysics in the coming decade. A major development towards meeting this challenge has been the growing ability to obtain highly spatially resolved (parsec-scale) integral-field spectroscopic observations (e.g. with VLT/MUSE), as well as to probe the extremely low-surface brightness outskirts of galaxies at large radii and high vertical scale heights. To combine the two regimes, we need a paradigm shift in the way we do spectroscopy on galaxies, especially considering the ongoing and future photometric surveys. The next decade will also bring a revolution in extensive photometric surveys of large areas of the sky, uncovering low surface brightness features around nearby galaxies. However, to fully understand the processes that connect galaxies to their haloes, shape low surface brightness features, and drive secular evolution, spatially resolved spectroscopy will be essential. Here, we outline the need for wide-field spectroscopic observations of statistically significant samples of nearby galaxies and highlight the key questions that can only be addressed with such data\n\n", "2512.14146": "2025-12-16, **Can dwarf spheroidal galaxies host a central black hole ?**, K. Aditya et.al., [2512.14146v1](http://arxiv.org/abs/2512.14146v1)\n\n We construct mass models of Milky Way dwarf spheroidal galaxies to place constraints on the central black hole (BH) masses they can host. We model the galaxies as a three-component system consisting of the stars, dark matter halo, and a central black hole, using the Osipkov--Merritt--Cuddeford class of anisotropic distribution function. The posterior distribution of black hole mass remains flat toward the low-mass end, indicating that the kinematic data places an upper limit on the black hole mass. Our analysis yields a 95% credible upper limit of $\\log(M\\_{\\bullet}/M\\_{\\odot}) < 6$. We combine our results with black hole mass measurements and upper limits from the literature to construct a unified $M\\_{\\bullet}$--$σ\\_{}$ relation spanning $σ\\_{} \\sim 10$--$300,\\mathrm{km,s^{-1}}$, described by $\\log(M\\_{\\bullet}) = 8.32 + 4.08,\\log\\left(σ\\_{}/200,\\mathrm{km,s^{-1}}\\right)$, with an intrinsic scatter of $σ\\_{\\rm int} = 0.55$. We compare the inferred limits to models of black hole growth via momentum-driven accretion and stellar capture, which predict black hole masses in the range $10^{3}$--$10^{4},M\\_{\\odot}$ for the range $σ\\_{} \\sim 6$--$12,\\mathrm{km,s^{-1}}$, in close agreement with the $M\\_{\\bullet}$--$σ\\_{*}$ relation within the 95% credible upper limits on the black hole masses derived in this work.\n\n", "2512.14119": "2025-12-16, **A new idea for relating the asymmetric dark matter mass scale to the proton mass**, Peter Cox et.al., [2512.14119v1](http://arxiv.org/abs/2512.14119v1)\n\n Asymmetric dark matter is a well-motivated approach to explain the apparent coincidence between the relic densities of visible and dark matter, $Ω\\_D \\simeq 5.4Ω\\_b$. A complete explanation requires two components, a relation between the particle masses of the dark and visible matter, and a second relation between the number densities in each sector. In this work, we propose a new mechanism to address the former. We consider an extended $SU(3)\\_1 \\times SU(3)\\_2$ colour group in the visible sector, with QCD embedded as the diagonal subgroup. A $\\mathbb{Z}\\_2$ exchange symmetry then relates $SU(3)\\_2$ to a dark, confining $SU(3)\\_D$ sector. The dark matter is a composite state of dark fermions transforming in the fundamental representation of $SU(3)\\_D$. The spontaneously broken $\\mathbb{Z}\\_2$ symmetry ultimately leads to a relation between the QCD and dark gauge couplings which, for suitable field content, gives rise to confinement scales of the same order of magnitude. The mechanism leads to a rich particle spectrum above the TeV scale which could be probed at future experiments. The model also naturally includes an axion solution to the strong CP problem.\n\n", "2512.14109": "2025-12-16, **Global fits and the search for new physics: past, present and future**, Peter Athron et.al., [2512.14109v1](http://arxiv.org/abs/2512.14109v1)\n\n In this work, we review the history and current role of global fits in the search for physics beyond the Standard Model~(BSM), including precision tests of the Standard Model (SM). Although BSM global fits were initially focused on minimal supersymmetric models, we describe how fits have evolved in response to new data from the Large Hadron Collider (LHC) and elsewhere, expanding to encompass a broad spectrum of BSM scenarios including non-minimal supersymmetry, axion-like particles, extended Higgs sectors, dark matter models, and effective field theories such as SMEFT. We discuss how the role of global fits has shifted from forecasting possible signals of new physics at the LHC to understanding the impact of null results from LHC run-I and II and the discovery of the Higgs boson, and how interest has shifted from global fits for parameter estimation to comprehensive model comparison. We close by discussing potential trends and future applications, emphasizing the potential for machine learning and artificial intelligence to enhance the efficiency of sampling algorithms and comparison between theory and experiment, as well as collaboration and software development.\n\n"}, "supernova": {"2512.15672": "2025-12-17, **Observational constraints on the spin/anisotropy of the CCOs of Cassiopeia A, Vela Jr. and G347.3-0.5 and a single surviving continuous gravitational wave candidate**, Jing Ming et.al., [2512.15672v1](http://arxiv.org/abs/2512.15672v1)\n\n We carry out the deepest and broadest search for continuous gravitational-wave signals with frequencies between 20-1500 Hz, from three neutron stars at the center of the supernova remnants Cassiopeia A, Vela Jr., and G347.3-0.5. This search was made possible by the computing power shared by thousands of Einstein@Home volunteers. After the initial Einstein@Home search, we perform a multi-stage follow-up of the most promising $\\approx$ 45 million signal candidates. In the last stages, we use independent data to further investigate the remaining candidates from the previous stages. We set the most stringent constraints to date on the gravitational-wave amplitude, equatorial ellipticity, r-mode saturation amplitude, and -- for the first time -- the neutron-star crustal anisotropy. For spin periods lower than 2 ms we constrain the ellipticity to be smaller than $4\\times 10^{-7}$ for all targets. We exclude the crustal anisotropy to be smaller than $5\\times 10^{-3}$ for spin periods between 1.3-100 ms. Only one candidate -- from the low frequency G347.3 search -- survives all follow-ups. We illustrate properties of this candidate. Investigations on new data will aid in clarifying its nature. Such ``new\" data exists and would be optimal for this purpose, but they are not publicly accessible at the time of writing.\n\n", "2512.15096": "2025-12-17, **Cosmological Models with Symmetric Teleparallel Gravity and its Extension**, S. A. Narawade et.al., [2512.15096v1](http://arxiv.org/abs/2512.15096v1)\n\n This thesis investigates late-time cosmic acceleration using modified gravity theories with a focus on $f(Q)$ gravity, as an alternative to the $Λ$CDM model. The standard cosmological model attributes the acceleration to a cosmological constant, but it faces issues like the unexplained nature of dark matter and dark energy and discrepancies with certain observations. Modified gravity including $f(Q)$ gravity, offers a potential solution by incorporating dynamic dark energy or changes to gravitational interactions, avoiding the need for a constant cosmological term. Also, thesis evaluates the viability of $f(Q)$ gravity by analyzing observational data from Type Ia Supernovae, Hubble parameter measurements and other cosmological datasets. Using statistical tools like Markov Chain Monte Carlo (MCMC) analysis, this work constrains the parameters of $f(Q)$ gravity and compares it to the $Λ$CDM model.....\n\n", "2512.15054": "2025-12-17, **A global view on star formation: The GLOSTAR Galactic plane survey XII. Effelsberg's continuum view and data release**, Y. Gong et.al., [2512.15054v1](http://arxiv.org/abs/2512.15054v1)\n\n Extended radio continuum emission and its linear polarization play a key role in probing large-scale structures of synchrotron and free-free emission in the Milky Way. Despite the existence of many radio continuum surveys, sensitive and high-angular-resolution single-dish surveys of extended radio continuum emission remain scarce. As part of the GLObal view of STAR formation (GLOSTAR) survey, we will also crucially complement the existing data from the Karl G. Jansky Very Large Array (VLA) by addressing the missing zero-spacing gap. Within the framework of the GLOSTAR Galactic plane survey, we performed large-scale radio continuum imaging observations toward the Galactic plane in the range $-2^{\\circ}< \\ell <60^{\\circ}$ and $\\|b\\|<1.1^{\\circ}$, as well as the Cygnus X region with the Effelsberg 100-m radio telescope. We present the Effelsberg continuum survey at 4.89GHz and 6.82GHz including linear polarization with angular resolutions of 145$^{\\prime\\prime}$ and 106$^{\\prime\\prime}$, respectively. The survey has been corrected for missing large-scale emission using available low-angular-resolution surveys. Comparison with previous single-dish surveys indicates that our continuum survey represents the highest-quality single-dish data collected to date at this frequency. More than 90\\% of the flux density missed by the VLA D-array data is effectively recovered by the Effelsberg continuum survey. The improved sensitivity and angular resolution of our survey enable reliable mapping of Galactic magnetic field structures, with polarization data that are less affected by depolarization than in previous surveys. The GLOSTAR single-dish continuum data will be released publicly, offering a valuable resource for studying extended objects including HII regions, supernova remnants, diffuse interstellar medium, and Galactic structure. (Abridged)\n\n", "2512.14913": "2025-12-16, **Gamma-Ray and AntiMatter Survey(GRAMS) experiment**, J. Zeng et.al., [2512.14913v1](http://arxiv.org/abs/2512.14913v1)\n\n The Gamma-Ray and AntiMatter Survey (GRAMS) is a next-generation experiment using a Liquid Argon Time Projection Chamber (LArTPC) detector to measure MeV gamma rays and antiparticles. MeV gamma-ray observations are important for understanding multi-messenger and time-domain astronomy, enabling exploration of the universe's most potent events, such as supernovae and neutron star mergers. Despite the significance of MeV gamma-rays, GRAMS could also explore the so-called 'MeV gap' region to improve MeV gamma-ray measurement sensitivity that was restricted by the challenge of accurately reconstructing Compton events. Aside from gamma-ray detection, the GRAMS proposed method also serves as an antiparticle spectrometer, targeting the low-energy range of cosmic antinuclei measurements. This work will provide updates on the current status and progress towards the prototype balloon flight with a small-scale LArTPC (pGRAMS) scheduled for early 2026, as well as the recent progress on antihelium-3 sensitivity calculation.\n\n", "2512.14832": "2025-12-16, **Luminous Fast Blue Optical Transients in the 2040s**, A. A. Chrimes et.al., [2512.14832v1](http://arxiv.org/abs/2512.14832v1)\n\n Luminous Fast Blue Optical Transients (LFBOTs) are a class of extragalactic transient of uncertain origin. Several hypotheses have been put forward which could feasibly be consistent with the sample number of events discovered thus far, including tidal disruption events around intermediate mass black holes, failed supernovae and mergers of stars with black holes. Whatever their origin, it is clear that better understanding LFBOTs will provide unique insight into the black hole formation/growth, central engine physics and transient-host galaxy interactions - themes which are expected to drive research in transient astronomy over the coming decades. The vast majority of LFBOTs are missed by current photometric surveys, or not efficiently selected for detailed follow-up. This white paper outlines the observing capabilities required on a 2040 timescale to maximise the discovery potential from these enigmatic events.\n\n", "2512.14814": "2025-12-16, **Constraining Fifth Forces using the Local Distance Ladder: Implications for the Hubble Tension**, Marcus Högås et.al., [2512.14814v1](http://arxiv.org/abs/2512.14814v1)\n\n We revisit the local distance ladder measurement of the Hubble constant in models where gravity is modified by a fifth force, an additional long-range interaction. In many such theories the force is screened; suppressed in dense environments but potentially active in galaxies used for distance calibration. We model this environmental dependence using three quantities that characterize each galaxy's large-scale gravitational environment: the external gravitational potential $Φ$, acceleration $a$, and curvature $K$. Our baseline analysis recalibrates the SH0ES-team's Cepheid-supernova distance ladder, incorporating the fifth force via its impact on the Cepheid period-luminosity relation. Across models, a fifth force is strongly constrained, with posteriors concentrated around a null result. The inferred Hubble constant is $H\\_0 = 73.1 \\pm 1.0 \\, \\mathrm{km/s/Mpc}$, retaining the Hubble tension at $>5 \\, σ$. As an additional test, we incorporate four independent Tip of the Red Giant Branch (TRGB) distance datasets into a joint Cepheid-TRGB-supernova calibration. These combined analyses further constrain the magnitude of fifth-force effects. Taken together, our results show that, across the class of screened fifth-force models we analyze, the calibration of the local distance ladder remains essentially unchanged, leaving the Hubble tension intact.\n\n", "2512.14644": "2025-12-16, **Attention-Based Preprocessing Framework for Improving Rare Transient Classification**, Xinyue Sheng et.al., [2512.14644v1](http://arxiv.org/abs/2512.14644v1)\n\n With large numbers of transients discovered by current and future imaging surveys, machine learning is increasingly applied to light curve and host galaxy properties to select events for follow-up. However, finding rare types of transients remains difficult due to extreme class imbalances in training sets, and extracting features from host images is complicated by the presence of bright foreground sources, particularly if the true host is faint or distant. Here we present a data augmentation pipeline for images and light curves that mitigates these issues, and apply this to improve classification of Superluminous Supernovae Type I (SLSNe-I) and Tidal Disruption Events (TDEs) with our existing NEEDLE code. The method uses a Similarity Index to remove image artefacts, and a masking procedure that removes unrelated sources while preserving the transient and its host. This focuses classifier attention on the relevant pixels, and enables arbitrary rotations for class upsampling. We also fit observed multi-band light curves with a two-dimensional Gaussian Process and generate data-driven synthetic samples by resampling and redshifting these models, cross-matching with galaxy images in the same class to produce unique but realistic new examples for training. Models trained with the augmented dataset achieve substantially higher purity: for classifications with a confidence of 0.8 or higher, we achieve 75% (43%) purity and 75% (66%) completeness for SLSNe-I (TDEs).\n\n", "2512.14802": "2025-12-16, **Dynamical binary interactions in the 2040s**, Nadejda Blagorodnova et.al., [2512.14802v1](http://arxiv.org/abs/2512.14802v1)\n\n Dynamical binary interactions such as common envelope (CE) evolution or stellar mergers are a critical phase in the formation of a wide variety of binary phenomena, ranging from blue stragglers to type I supernovae (of all flavours, a, b and c), $γ$-ray bursts to bipolar planetary nebulae, Thorne-Zytkow objects to X-ray binaries. In 2040s, the urgency of resolving long-standing questions regarding the physics behind the dynamical interaction stages and the absolute and relative frequencies of binary evolutionary pathways will only increase owing to rapidly expanding population statistics of gravitational wave events. Here, we argue that multi-wavelength observations (spectroscopy and photometry), linear spectropolarimetry, and interferometry of a large number of Luminous Red Novae, a particular class of transients associated with dynamical binary interactions, will provide unprecedented details about the underlying interaction physics. A breakthrough will be achieved by a tenfold or larger increase in identifications of transient-type events from interacting binaries and their follow-up with instrumentation that provides at least 10 times better angular resolution, 100 times better spectral resolution, and $\\sim$100 times higher sensitivity than 2030s facilities.\n\n", "2512.14800": "2025-12-16, **White Dwarf Binaries: Probes of Future Astrophysics**, Anna F. Pala et.al., [2512.14800v1](http://arxiv.org/abs/2512.14800v1)\n\n White dwarf binaries are fundamental astrophysical probes. They represent ideal laboratories to test the models of binary evolution, which also apply to the sources of gravitational waves, whose detection led to the award of the 2017 Nobel Prize in Physics. Moreover, their final fate is intimately linked to Type Ia Supernovae (SNe Ia), i.e. the thermonuclear explosion of a white dwarf following the interaction with a companion star, which have become the fundamental yardsticks on cosmological distance scales and led to the discovery of dark energy and the award of the 2011 Nobel Prize in Physics. Finally, white dwarf binaries play a crucial role in influencing star formation and chemical evolution of the Galaxy by injecting energy into, and enriching, the interstellar medium with material ejected during nova eruptions and SN Ia explosions. In the next decade, the advent of the Large Synoptic Survey Telescope (LSST) at the Vera Rubin Observatory will lead to the discovery of hundreds of thousands of white dwarf binaries. Nonetheless, the intrinsic faintness of the majority of these systems will prevent their spectroscopic characterisation with the instruments available in the 2030s. Hence ESO's Expanding Horizons call is timely for planning a future transformative facility, capable of delivering phase-resolved spectroscopic observations of faint white dwarf binaries, which are key to advancing our understanding of stellar and Galactic evolution and cosmology.\n\n", "2512.14143": "2025-12-16, **The role of supernova remnants for the emergence of pre-biotic chemistry in molecular clouds**, Giuliana Cosentino et.al., [2512.14143v1](http://arxiv.org/abs/2512.14143v1)\n\n There is growing evidence that the Sun might have formed within a nebula impacted by at least one SNR. In this scenario, ejecta and shocks from SNRs may have provided the elements on which life as we know it is based. Investigating the chemical complexity of molecular clouds impacted by SNRs is therefore essential to unveil the star formation process and how life appeared on Earth. In this paper, we exploit this scientific questions and describe which technical specifications will drive in future generation telescopes.\n\n"}}