{"neutrino": {"2405.20146": "2024-05-30, **Supermassive black holes and very high-energy neutrinos: the case of NGC 1068**, P. Padovani et.al., [2405.20146v1](http://arxiv.org/abs/2405.20146v1)\n\n We present a comprehensive multi-messenger study of NGC 1068, the prototype Seyfert II galaxy recently associated with high-energy IceCube neutrinos. Various aspects of the source, including its nuclear activity, jet, outflow, and starburst region, are analyzed in detail using a multi-wavelength approach and relevant luminosities are derived. We then explore its gamma-ray and neutrino emissions and investigate potential mechanisms underlying these phenomena and their relations with the different astrophysical components to try to understand which one is responsible for the IceCube neutrinos. By first using simple order-of-magnitude arguments and then applying specific theoretical models, we infer that only the region close to the accretion disc around the supermassive black hole has both the right density of X-ray photons needed to provide the targets for protons to sustain neutrino production and of optical/infrared photons required to absorb the associated but unobserved gamma rays. We conclude by highlighting ongoing efforts to constrain a possible broad connection between neutrinos and active galactic nuclei, as well as future synergies between astronomical and neutrino facilities.\n\n", "2405.20060": "2024-05-30, **Detailed nuclear structure calculations for coherent elastic neutrino-nucleus scattering**, Raghda Abdel Khaleq et.al., [2405.20060v1](http://arxiv.org/abs/2405.20060v1)\n\n Any discovery of `new physics' in the neutrino sector first requires a precise prediction of the expected Standard Model cross section. Currently, Coherent Elastic neutrino-Nucleus Scattering (CEvNS) experiments are statistics limited. However, as new and future experiments scale up, it will be necessary to improve the theoretical predictions. Here we review the calculation of the CEvNS cross section in a consistent theory of hadronic currents and compute the relevant nuclear form factors using the nuclear shell model. The uncertainty on the form factors is explored by repeating the calculation for various shell model interactions and with Skyme-Hartree-Fock evaluations of the Weak-charge radii. We then refine the Standard Model predictions for the recent experimental results of the COHERENT experiment. We find that our cross sections are in good agreement with previous predictions, but with significantly smaller uncertainties - by up to a factor of 10. Near-future CEvNS experiments will meaningfully benefit from improved predictions through an increased sensitivity to new-physics signals.\n\n", "2405.19879": "2024-05-30, **Refractive index in the JUNO liquid scintillator**, H. S. Zhang et.al., [2405.19879v1](http://arxiv.org/abs/2405.19879v1)\n\n In the field of rare event physics, it is common to have huge masses of organic liquid scintillator as detection medium. In particular, they are widely used to study neutrino properties or astrophysical neutrinos. Thanks to its safety properties (such as low toxicity and high flash point) and easy scalability, linear alkyl benzene is the most common solvent used to produce liquid scintillators for large mass experiments. The knowledge of the refractive index is a pivotal point to understand the detector response, as this quantity (and its wavelength dependence) affects the Cherenkov radiation and photon propagation in the medium. In this paper, we report the measurement of the refractive index of the JUNO liquid scintillator between 260-1064 nm performed with two different methods (an ellipsometer and a refractometer), with a sub percent level precision. In addition, we used an interferometer to measure the group velocity in the JUNO liquid scintillator and verify the expected value derived from the refractive index measurements.\n\n", "2405.19774": "2024-05-30, **CPT, Majorana fermions, and particle physics beyond the Standard Model**, Ken-ichi Hikasa et.al., [2405.19774v1](http://arxiv.org/abs/2405.19774v1)\n\n After reviewing charge conjugation and the CPT theorem, we define Majorana fermions and clarify the relationship of Majorana, Weyl, and Dirac fields. Appearance of Majorana fermions in various scenarios of physics beyond the Standard Model is discussed, including neutrino masses, baryon asymmetry of the universe, grand unified theories, and supersymmetry.\n\n", "2405.19700": "2024-05-30, **Initial measurement of reactor antineutrino oscillation at SNO+**, SNO+ Collaboration et.al., [2405.19700v1](http://arxiv.org/abs/2405.19700v1)\n\n The SNO+ collaboration reports its first spectral analysis of long-baseline reactor antineutrino oscillation using 114 tonne-years of data. Fitting the neutrino oscillation probability to the observed energy spectrum yields constraints on the neutrino mass-squared difference $\\Delta m^2\\_{21}$. In the ranges allowed by previous measurements, the best-fit $\\Delta m^2\\_{21}$ is (8.85$^{+1.10}\\_{-1.33}$) $\\times$ 10$^{-5}$ eV$^2$. This measurement is continuing in the next phases of SNO+ and is expected to surpass the present global precision on $\\Delta m^2\\_{21}$ with about three years of data.\n\n", "2405.19605": "2024-05-30, **Primitive Pythagorean triples and neutrino mixing**, Yuta Hyodo et.al., [2405.19605v1](http://arxiv.org/abs/2405.19605v1)\n\n The primitive Pythagorean triples are the three natural numbers $(a, b, c)$ that satisfy $c^2=a^2+b^2$ in a right triangle. We constructed a neutrino mixing models related to primitive Pythagorean triples that satisfy the observed values within the $3 \\sigma$ region for the reactor, solar, and atmospheric neutrino mixing angles, as well as the Dirac CP phase.\n\n"}, "dark matter": {"2405.20256": "2024-05-30, **Gravitational Lensing in More Realistic Dark Matter Halo Models**, Ali Tizfahm et.al., [2405.20256v1](http://arxiv.org/abs/2405.20256v1)\n\n In this study, we investigate gravitational lensing within the framework of more realistic dark matter halo models, transcending the limitations of spherical-collapse approximations. Through analytical computations utilizing diverse mass functions, we address critical factors typically overlooked in the standard Press-Schechter formalism, including ellipsoidal-collapse conditions, angular momentum dynamics, dynamical friction, and the cosmological constant. Our analysis incorporates two widely recognized halo density profiles, the Navarro-Frenk-White and Einasto profiles, considering both spherical and ellipsoidal-collapse scenarios. We present relevant calculations of pivotal gravitational lensing observables, such as Einstein radii, lensing optical depths, and time delays, spanning a wide range of redshifts and masses across two distinct lensing models: the point mass and singular isothermal sphere (SIS) lens models. Our findings illuminate that adopting more realistic dark matter halo models leads to heightened lensing effects compared to their spherical-collapse counterparts. Furthermore, our analyses of lensing optical depths and time delays reveal distinct characteristics between point mass and SIS lens models. These outcomes highlight the need for more realistic halo descriptions instead of simple approximations when modeling gravitational lensing, as this approach can potentially better reveal the complex structures of dark matter.\n\n", "2405.20240": "2024-05-30, **Alleviating the $H_0$ and $σ_8$ tensions in the interacting cubic covariant Galileon model**, Sihem zabat et.al., [2405.20240v1](http://arxiv.org/abs/2405.20240v1)\n\n The interaction between dark matter and dark energy has become a focal point in contemporary cosmological research, particularly in addressing current cosmological tensions. This study explores the cubic Galileon model's interaction with dark matter, where the interaction potential in the dark sector is proportional to the dark energy density of the Galileon field. By employing dimensionless variables, we transform the field equations into an autonomous dynamical system. We calculate the critical points of the corresponding autonomous systems and demonstrate the existence of a stable de Sitter epoch. Our investigation proceeds in two phases. First, we conduct a detailed analysis of the exact interacting cubic Galileon (ICG) model, derived from the precise solution of the equations of motion. Second, we explore an approximate tracker solution, labeled TICG, assuming a small coupling parameter between dark matter and dark energy. We evaluate the evolution of these models using data from two experiments, aiming to resolve the tensions surrounding $H\\_0$ and $S\\_8$. The analysis of the TICG model indicates a preference for a phantom regime and provides a negative coupling parameter in the dark sector at a $68\\%$ confidence level. This model also shows that the current tensions regarding $H\\_0$ and $S\\_8$ are alleviated. Conversely, the ICG model, despite its preference for the phantom regime, is plagued by an excess in today's matter density and a higher expansion rate, easing only the $H\\_0$ tension.\n\n", "2405.20170": "2024-05-30, **Role of Spatial Curvature in a Dark Energy Interacting Model**, Trupti Patil et.al., [2405.20170v1](http://arxiv.org/abs/2405.20170v1)\n\n This paper investigates the effects of spatial curvature in a model where dark matter and dark energy interact. The analysis employs a range of datasets, including CMB, BAO, Type Ia Supernova, $H(z)$ from cosmic chronometers, $H\\_0$ measurements from Megamasers and SH0ES, growth rate data and strong lensing time delay measurements, to assess the model's fit and explore the late-time dynamics of the interacting dark sector in a non-flat cosmological framework. The study indicates that introducing curvature can significantly impact the Hubble constant ($H\\_0$) and the structure growth parameter ($S\\_8$), potentially easing tensions between early and late universe observations. The observational data shows an indication for a closed universe. This implies that the presence of curvature and its influence cannot be neglected entirely.\n\n", "2405.20125": "2024-05-30, **Haloes, other dark matter candidates and astrophysical implications**, Philippa S. Cole et.al., [2405.20125v1](http://arxiv.org/abs/2405.20125v1)\n\n It is possible that a multi-component dark matter model is required if primordial black holes only contribute to a fraction of the energy density in dark matter. This is increasingly more likely with respect to the case of $f\\_{\\rm PBH} = 1$, since there is only one remaining window, on asteroid-mass scales, where primordial black holes can make up all of the dark matter. A mixed dark matter model can lead to interesting observables that come about due to the interactions between primordial black holes and the second dark matter component. This can provide unique signatures of the presence of primordial black holes and increase the prospects of detection or improvement of constraints in the mass ranges where $f\\_{\\rm PBH} < 1$, whilst simultaneously exploring the remaining open parameter space for other dark matter candidates.\n\n", "2405.19910": "2024-05-30, **Formation of the first halos, galaxies and magnetic fields**, M. Demiański et.al., [2405.19910v1](http://arxiv.org/abs/2405.19910v1)\n\n Cosmic objects with magnetic fields (quasars, radiogalaxies) are observed at redshifts $z\\geq 7$ (Wang et al., 2021, Fan et al., 2023, Yang et al., 2024) and more (for instance, for $z = 10.073\\pm 0.002$, Goulding et al., 2023) indicates the early creation of magnetic fields. The observations of the cosmic telescope JWST show that the first galaxies were formed at redshifts $z\\simeq$ 15 -- 20. We link the transformation of the low mass dark matter halos into galaxies with the creation of the first stars owing to the radiative cooling of partly ionized hydrogen at $z\\geq 10$. The early formation of galaxies creates favourable conditions for high impact of the Compton scattering of the relic radiation photons and electrons on the electron temperature and leads to the partial separation of electrons and protons. Together with turbulent motions such separation stimulates creation of magnetic fields on a galactic scale. The same processes distort the primordial perturbations of the relic radiation what can be observed and confirmed in special simulations.\n\n"}, "supernova": {"2405.20170": "2024-05-30, **Role of Spatial Curvature in a Dark Energy Interacting Model**, Trupti Patil et.al., [2405.20170v1](http://arxiv.org/abs/2405.20170v1)\n\n This paper investigates the effects of spatial curvature in a model where dark matter and dark energy interact. The analysis employs a range of datasets, including CMB, BAO, Type Ia Supernova, $H(z)$ from cosmic chronometers, $H\\_0$ measurements from Megamasers and SH0ES, growth rate data and strong lensing time delay measurements, to assess the model's fit and explore the late-time dynamics of the interacting dark sector in a non-flat cosmological framework. The study indicates that introducing curvature can significantly impact the Hubble constant ($H\\_0$) and the structure growth parameter ($S\\_8$), potentially easing tensions between early and late universe observations. The observational data shows an indication for a closed universe. This implies that the presence of curvature and its influence cannot be neglected entirely.\n\n", "2405.20009": "2024-05-30, **Primary and secondary source of energy in the superluminous supernova 2018ibb**, Alexandra Kozyreva et.al., [2405.20009v1](http://arxiv.org/abs/2405.20009v1)\n\n We examine the pair-instability origin of superluminous supernova 2018ibb. As the base model, we use a non-rotating stellar model with an initial mass of 250 Msun at about 1/15 solar metallicity. We consider three versions of the model as input for radiative transfer simulations done with the STELLA and ARTIS codes: with 25 Msun of 56Ni, 34 Msun of 56Ni, and a chemically mixed case with 34 Msun of 56Ni. We present light curves and spectra in comparison to the observed data of SN 2018ibb, and conclude that the pair-instability supernova model with 34 Msun of 56Ni explains broad-band light curves reasonably well between -100 and 250 days around the peak. Our synthetic spectra have many similarities with the observed spectra. The luminosity excess in the light curves and the blue-flux excess in the spectra can be explained by an additional energy source, which may be interaction of the SN ejecta with circumstellar matter. We discuss possible mechanisms of the origin of the circumstellar matter being ejected in the decades before the pair-instability explosion.\n\n"}}