{"neutrino": {"2503.16355": "2025-03-20, **DEMNUni: the Sunyaev-Zel'dovich effect in the presence of massive neutrinos and dynamical dark energy**, Davide Luchina et.al., [2503.16355v1](http://arxiv.org/abs/2503.16355v1)\n\n In recent years, the study of secondary anisotropies in the Cosmic Microwave Background has become a fundamental instrument to test our understanding of Cosmology and Astrophysics. Using a set of lightcones produced with the ``Dark Energy and Massive Neutrino Universe'' $N$-body simulations we study how different dark energy models and neutrino masses impact the properties of the Sunyaev-Zel'dovich (SZ) effects, focusing on the signal arising from galaxy clusters and groups. We analyse the distribution of values, Compton-$y$ parameter for the thermal SZ effect and $\\Delta T/T$ for the kinematic SZ effect, and study their angular power spectra. We find that the distribution of logarithmic Compton parameter can be fitted with a skewed Gaussian, with a mean that, at fixed dark energy model, decreases linearly with an approximate slope of $10 f\\_\\nu$. Regarding the power spectrum of the thermal SZ effect, we find that an increase in $\\sum {m\\_\\nu}$ is observed as a power-law scaling with respect to $\\sigma\\_8^{\\mathrm{cb}}$, with exponents ranging from 7.2 to 8.2. We also find that four cosmological models, one with $\\sum {m\\_\\nu} = 0.16$ eV and three with $\\sum {m\\_\\nu} = 0.32$ eV, fit equally well the Planck data for the Compton-$y$. For all the \\texttt{DEMNUni} models we forecast the cumulative signal-to-noise for thermal SZ observations with the LAT instrument of Simons Observatory; furthermore, we compute a tailored $\\chi\\_\\mathrm{SNR}^2$ estimator to infer if they can be distinguished from the reference $\\Lambda$CDM. We also provide estimates for the power spectrum of the cluster component of the kinematic SZ effect, in all the different cosmological scenarios.\n\n", "2503.16293": "2025-03-20, **Lepton number violating/conserving heavy baryons four-body decays, in presence of two almost degenerated heavy neutrinos**, Fabiola Fortuna et.al., [2503.16293v1](http://arxiv.org/abs/2503.16293v1)\n\n We study the four-body heavy baryon decay, including two leptons in the final state, of the form $B\\_A \\to B\\_B P \\ell\\_\\alpha \\ell\\_\\beta$, which can be either a lepton number conserving (LNC) or a lepton number violating (LNV) process (where $B$, $P$ and $\\ell$ are baryons, pseudoscalar mesons and leptons, respectively), including all kinematic allowed lepton pair possibilities. We work beyond the simplified assumption of a single heavy Majorana neutrino mixing with the active sector, considering potential interference effects when including two nearly degenerate heavy Majorana neutrinos. Particularly, we provide a first estimate of the decay channels involving different flavors for the external leptons (e.g., muon-tau), and elaborate on the interference pattern due to leptons exchange. We show that the results for the two heavy almost degenerate neutrinos can be recast into a single Majorana neutrino, and exhibit the features for both the LNC and LNV scenarios. We determine the potential exclusion region for the mass and heavy-light mixing parameters, of the neutrinos driving the decay, including finite size detector effects. We also obtain the Branching ratio as a function of the heavy neutrino mass for the current upper limit of the heavy-light mixings.\n\n", "2503.16273": "2025-03-20, **Neutrino emission and corona heating induced by high-energy proton interactions in Seyfert galaxies**, A. Neronov et.al., [2503.16273v1](http://arxiv.org/abs/2503.16273v1)\n\n Recent detection of very-high-energy neutrino emission from Seyfert type active galactic nuclei (AGN) provides a new insight into the physics of the AGN central engines. We notice that if high-energy protons responsible for neutrino emission are accelerated close to the surface of the accretion disk, the neutrino flux may have no unambiguously identifiable electromagnetic counterpart. This is because the electromagnetic power released in interactions of high-energy protons would only contribute to the heating of the disk surface and corona above the disk, rather than escape from the source. Given that the heat deposited in the corona is released in the hard X-ray range we notice that there still might be an \"indirect\" electromagnetic counterpart of the neutrino signal: the hard X-ray flux variability may be strongly or weakly correlated with the neutrino flux variations, depending on the importance of the high-energy proton heating in the disk/corona heat balance. If heating by high-energy protons provides a sizable contribution to the overall corona heating rate, the overall flux of diffuse GeV neutrino background from Seyfert galaxies may be comparable to the X-ray background flux and the high-energy tail of this background can provide a sizable contribution to the astrophysical neutrino flux in the TeV band.\n\n", "2503.16213": "2025-03-20, **Search for heavy neutral leptons in decays of W bosons using leptonic and semi-leptonic displaced vertices in $\\sqrt{s} = 13$ TeV $pp$ collisions with the ATLAS detector**, ATLAS Collaboration et.al., [2503.16213v1](http://arxiv.org/abs/2503.16213v1)\n\n A search is performed for long-lived heavy neutral leptons (HNLs), produced through the decay of a $W$ boson along with a muon or electron. Two channels are explored: a leptonic channel, in which the HNL decays into two leptons and a neutrino, and a semi-leptonic channel, in which the HNL decays into a lepton and a charged pion. The search is performed with 140~fb$^{-1}$ of $\\sqrt{s} = 13$ TeV proton--proton collision data collected by ATLAS during Run 2 of the Large Hadron Collider. No excess of events is observed; Dirac-like and Majorana-like HNLs with masses below 14.5 GeV and mixing coefficients as small as 10$^{-7}$ are excluded at the 95% confidence level. The results are interpreted under different assumptions on the flavour of the leptons from the HNL decays.\n\n", "2503.16160": "2025-03-20, **Extending evolution mapping to massive neutrinos with COMET**, A. Pezzotta et.al., [2503.16160v1](http://arxiv.org/abs/2503.16160v1)\n\n We introduce an extension of the evolution mapping framework to cosmological models that include massive neutrinos. The original evolution mapping framework exploits a degeneracy in the linear matter power spectrum when expressed in ${\\rm Mpc}$ units, which compresses its dependence on cosmological parameters into those that affect its shape and a single extra parameter $\\sigma\\_{12}$, defined as the RMS linear variance in spheres of radius $12 {\\rm Mpc}$. We show that by promoting the scalar amplitude of fluctuations, $A\\_{\\rm s}$, to a shape parameter, we can additionally describe the suppression due to massive neutrinos at any redshift to sub-0.01\\% accuracy across a wide range of masses and for different numbers of mass eigenstates. This methodology has been integrated into the public COMET package, enhancing its ability to emulate predictions of state-of-the-art perturbative models for galaxy clustering, such as the effective field theory (EFT) model. Additionally, the updated software now accommodates a broader cosmological parameter space for the emulator, enables the simultaneous generation of multiple predictions to reduce computation time, and incorporates analytic marginalisation over nuisance parameters to expedite posterior estimation. Finally, we explore the impact of different infrared resummation techniques on galaxy power spectrum multipoles, demonstrating that any discrepancies can be mitigated by EFT counterterms without impacting the cosmological parameters.\n\n", "2503.16124": "2025-03-20, **Effects of tau-neutrino detection on non-standard interactions at DUNE with a short discussion on the nature of neutrino mixing**, Xin Yue Yu et.al., [2503.16124v1](http://arxiv.org/abs/2503.16124v1)\n\n In this paper, we investigate the effects of $\\nu\\_\\tau$ and $\\bar{\\nu}\\_\\tau$ detection at the DUNE far detector on the experiment's sensitivity to Non-Standard Interactions (NSI) in neutrino propagation. We show that the strongest observable NSI effect in the $\\nu\\_\\tau$ and $\\bar{\\nu}\\_\\tau$ appearance probabilities arises from $\\epsilon\\_{\\mu\\tau}$. We have studied the hierarchy sensitivity, CP violation sensitivity and octant sensitivity of DUNE from $\\nu\\_\\tau$ and $\\bar{\\nu}\\_\\tau$ appearance channels in presence of NSI. We have also studied the detection sensitivity of NSI phases and the future constaints on NSI parameters from the tau neutrino appearance channels in DUNE. Additionally, we examine the role of $\\nu\\_\\tau$ detection in constraining the unitary nature of the PMNS matrix. These studies emphasize the importance of incorporating $\\nu\\_\\tau$ detection in long-baseline neutrino experiments such as DUNE.\n\n", "2503.15740": "2025-03-19, **Fractionally charged Weyl spinors as the bases for elementary particles**, Hyung S. Choi et.al., [2503.15740v1](http://arxiv.org/abs/2503.15740v1)\n\n We present a new model of elementary particles with a substructure that the Gell-Mann-Nishijima formula seems to suggest. This set of fractionally-charged Weyl spinors produces all the known elementary fermions out of their conjugate pairs and the elementary bosons as their composites. The model naturally yields the left-handedness of neutrinos, three generations of fermions, SU(3)xSU(2)xU(1) symmetry as its low energy approximation, and a new type of massive neutral particles that could be a dark matter candidate. In this model, the strong and the electromagnetic interactions are integrated at the fundamental level, while the weak interaction works as the next-level mechanism responsible for changing flavors.\n\n", "2503.15592": "2025-03-19, **A Fresh Look at Neutrino Self-Interactions With the Lyman-$α$ Forest: Constraints from EFT and PRIYA**, Adam He et.al., [2503.15592v1](http://arxiv.org/abs/2503.15592v1)\n\n We present the first search for evidence of neutrino self-interaction with two new, state-of-the-art likelihoods for eBOSS Lyman-$\\alpha$ data. These are an effective field theory (EFT) likelihood with priors from the Sherwood simulation suite, and a compressed likelihood derived from an emulator built using the PRIYA simulation suite. Previous analyses that combined Planck measurements with eBOSS Lyman-$\\alpha$ likelihoods based on earlier simulations found a preference for neutrino self-interactions. In contrast, using either of the new eBOSS Lyman-$\\alpha$ likelihoods, we find that a joint analysis with the cosmic microwave background (CMB) data from Planck prefers a negligible level of neutrino self-interaction, and derive new constraints on the neutrino self-coupling: $\\mathrm{log}\\_{10}(G\\_\\mathrm{eff} \\ \\mathrm{MeV}^2)=-5.57\\_{-0.58}^{+0.98}$ for Planck + EFT Lyman-$\\alpha$, and $\\mathrm{log}\\_{10}(G\\_\\mathrm{eff} \\ \\mathrm{MeV}^2)=-5.26\\_{-1.49}^{+0.87}$ for Planck + PRIYA Lyman-$\\alpha$, at 68% confidence. We also consider Planck in combination with DESI BAO data, and find that the latter does not provide significant constraining power for neutrino self-interactions.\n\n", "2503.15468": "2025-03-19, **No Flavor Anisotropy in the High-Energy Neutrino Sky Upholds Lorentz Invariance**, Bernanda Telalovic et.al., [2503.15468v1](http://arxiv.org/abs/2503.15468v1)\n\n Discovering Lorentz-invariance violation (LIV) would upend the foundations of modern physics. Because LIV effects grow with energy, high-energy astrophysical neutrinos provide the most sensitive tests of Lorentz invariance in the neutrino sector. We examine an understudied yet phenomenologically rich LIV signature: compass asymmetries, where neutrinos of different flavors propagate preferentially along different directions. Using the directional flavor composition of high-energy astrophysical neutrinos, i.e., the abundances of $\\nu\\_{e}$, $\\nu\\_{\\mu}$, and $\\nu\\_{\\tau}$ across the sky, we find no evidence of LIV-induced flavor anisotropy in 7.5 years of IceCube High-Energy Starting Events. Thus, we place upper limits on the values of hundreds of LIV parameters with operator dimensions 2-8, tightening existing limits by orders of magnitude and bounding hundreds of parameters for the first time.\n\n", "2503.15247": "2025-03-19, **Classification of Electron and Muon Neutrino Events for the ESS$ν$SB Near Water Cherenkov Detector using Graph Neural Networks**, J. Aguilar et.al., [2503.15247v2](http://arxiv.org/abs/2503.15247v2)\n\n In the effort to obtain a precise measurement of leptonic CP-violation with the ESS$\\nu$SB experiment, accurate and fast reconstruction of detector events plays a pivotal role. In this work, we examine the possibility of replacing the currently proposed likelihood-based reconstruction method with an approach based on Graph Neural Networks (GNNs). As the likelihood-based reconstruction method is reasonably accurate but computationally expensive, one of the benefits of a Machine Learning (ML) based method is enabling fast event reconstruction in the detector development phase, allowing for easier investigation of the effects of changes to the detector design. Focusing on classification of flavour and interaction type in muon and electron events and muon- and electron neutrino interaction events, we demonstrate that the GNN reconstructs events with greater accuracy than the likelihood method for events with greater complexity, and with increased speed for all events. Additionally, we investigate the key factors impacting reconstruction performance, and demonstrate how separation of events by pion production using another GNN classifier can benefit flavour classification.\n\n", "2503.15047": "2025-03-19, **Measurement of the A dependence of the muon neutrino charged-current quasielastic-like cross section as a function of muon and proton kinematics at $<$E$_ν>\\sim$6 GeV**, J. Kleykamp et.al., [2503.15047v1](http://arxiv.org/abs/2503.15047v1)\n\n The first simultaneous measurements of the $\\nu\\_{\\mu}$ quasielastic-like cross section on C, CH, H$\\_2$0, Fe, and Pb targets as a function of kinematic imbalance variables in the plane transverse to the incoming neutrino direction are presented. These variables combine the muon and proton information to provide a new way to disentangle the effects of the nucleus in quasielastic-like processes. The data were obtained using a wide-band $\\nu\\_{\\mu}$ beam with $<$E$\\_{\\nu}>\\sim$6 GeV. Cross-section ratios of the different target materials to CH are also shown. These measurements are used to explore the nature of the cross-section $A$-scaling, as well as initial and final state interaction effects. Comparisons are made to predictions from a number of commonly used neutrino Monte Carlo event generators. The range of predictions of the different models tends to cover the data but the degree and consistency of the agreement suffers in regions, and on higher $A$ targets, where the final state interactions are expected to be more pronounced.\n\n", "2503.15030": "2025-03-19, **Lepton Flavor Violation of Z Gauge Boson Decays in Supersymmetric Type-III Seesaw Model**, Vael Hajahmad et.al., [2503.15030v1](http://arxiv.org/abs/2503.15030v1)\n\n In this study, we investigate the lepton flavor violation (LFV) of Z gauge boson decaying into two different flavor charged leptons $Z\\longrightarrow l\\_i l\\_j$ ($Z\\longrightarrow \\tau \\mu$, $Z\\longrightarrow \\tau e$ and $Z\\longrightarrow \\mu e$). This work is performed in the framework of the constrained minimal supersymmetric standard model (CMSSM) which is extended by the type-III seesaw mechanism. By considering constraints from the current experimental bounds on neutrino and supersymmetric particle masses, we calculate the branching ratios of the LFV of Z boson decays. The numerical results are found to be $1.30 \\times {10}^{-9}$ for both the $\\tau \\mu$ and $\\tau e$ decay channels and $6.40 \\times {10}^{-10}$ for the $\\mu e$ channel. After applying the constraints from the experimental bounds on the radiative two body decays $l\\_{i}\\rightarrow l\\_{j} \\gamma$, the branching ratios of the LFV of Z boson decays get an additional suppression of $10^{-3}$ for the $\\tau \\mu$ and $\\tau e$ decay channels and $10^{-8}$ for the $\\mu e$ channel. The prediction of the branching ratios is found to be several orders of magnitude below the current experimental bounds for both scenarios. Thus the LFV of Z boson decays could be observed with low likelihood in the future collider experiments.\n\n", "2503.14804": "2025-03-19, **Using Lithium and Beryllium to Study Structure and Evolution of Rotating Stars**, Wuming Yang et.al., [2503.14804v1](http://arxiv.org/abs/2503.14804v1)\n\n The chemical composition of the Sun is still a highly controversial issue. No solar model has yet been able to simultaneously reproduce the solar lithium and beryllium abundances, along with helioseismic results, including the rotation profile. Lithium and beryllium are fragile elements that are highly sensitive to the physical conditions, as well as to transport and mixing processes within and below the convective zone (CZ). Uncovering the transport mechanisms responsible for the depletion of Li and Be in the Sun is crucial for using them as tools to understand stellar interiors and the associated transport and mixing processes. We constructed rotating solar models based on Magg's abundance scale, incorporating the effects of convective overshoot and magnetic fields. The rotating model exhibits superior sound speed and density profile and successfully reproduces the observed ratios $r\\_{02}$ and $r\\_{13}$. It also matches the seismically inferred CZ depth, surface helium abundance, and rotation profile, as well as the detected Li and Be abundances and neutrino fluxes within $1\\sigma$. The depletion of Li is dominated by convective overshoot and rotational mixing, while Be depletion is primarily driven by gravitational settling and rotational mixing. The presence of the tachocline accelerates Li depletion but slows down Be depletion. These distinct depletion mechanisms result in the surface abundances of Li and Be evolving differently over time.\n\n"}, "dark matter": {"2503.16415": "2025-03-20, **Apparent $w<-1$ and a Lower $S_8$ from Dark Axion and Dark Baryons Interactions**, Justin Khoury et.al., [2503.16415v1](http://arxiv.org/abs/2503.16415v1)\n\n We show that a simple coupling between dark energy and dark matter can simultaneously address two distinct hints at new physics coming from cosmological observations. The first is the recent evidence from the DESI project and supernovae observations that the dark energy equation of state~$w$ is evolving over cosmic time from an earlier value that is~$<-1$ to a present-day value~$>-1$. The second observation is the so-called~$S\\_8$ tension, describing the suppression of the growth of matter overdensities compared to that expected in the~$\\Lambda$CDM model. We propose a stable, technically natural particle physics implementation of this idea, in which dark matter consists of dark baryons in a strongly-coupled hidden sector, and the dark energy field is the associated dark axion. The time-variation of the dark matter mass results in an effective dark energy equation of state that exhibits a phantom crossing behavior consistent with recent results. It also results in a slight delay in matter-radiation equality, which suppresses the overall growth of density perturbations.\n\n", "2503.16379": "2025-03-20, **The impact of baryons on the sparsity of simulated galaxy clusters from The Three Hundred Project**, P. S. Corasaniti et.al., [2503.16379v1](http://arxiv.org/abs/2503.16379v1)\n\n Measurements of the sparsity of galaxy clusters can be used to probe the cosmological information encoded in the host dark matter halo profile, and infer constraints on the cosmological model parameters. Key to the success of these analyses is the control of potential sources of systematic uncertainty. As an example, the presence of baryons can alter the cluster sparsity with respect to predictions from N-body simulations. Similarly, a radial dependent mass bias, as in the case of masses inferred under the hydrostatic equilibrium (HE) hypothesis, can affect sparsity estimates. We examine the imprint of baryonic processes on the sparsity statistics. Then, we investigate the relation between cluster sparsities and gas mass fraction. Finally, we perform a study of the impact of HE mass bias on sparsity measurements and the implication on cosmological parameter inference analyses. We use catalogues of simulated galaxy clusters from The Three Hundred project and run a comparative analysis of the sparsity of clusters from N-body/hydro simulations implementing different feedback model scenarios. Sparsities which probe the mass profile across a large radial range are affected by the presence of baryons in a way that is particularly sensitive to astrophysical feedback, whereas those probing exclusively external cluster regions are less affected. In the former case, we find the sparsities to be moderately correlated with measurements of the gas fraction in the inner cluster regions. We infer constraints on $S\\_8$ using synthetic average sparsity measurements generated to evaluate the impact of baryons, selection effects and HE bias. In the case of multiple sparsities these lead to highly bias results. Hence, we calibrate linear bias models that enable us to correct for these effects and recover unbiased constraints that are significantly tighter than those inferred from single sparsity analyses.\n\n", "2503.16173": "2025-03-20, **Precision cross-sections for advancing cosmic-ray physics and other applications: a comprehensive programme for the next decade**, D. Maurin et.al., [2503.16173v1](http://arxiv.org/abs/2503.16173v1)\n\n Cosmic-ray physics in the GeV-to-TeV energy range has entered a precision era thanks to recent data from space-based experiments. However, the poor knowledge of nuclear reactions, in particular for the production of antimatter and secondary nuclei, limits the information that can be extracted from these data, such as source properties, transport in the Galaxy and indirect searches for particle dark matter. The Cross-Section for Cosmic Rays at CERN workshop series has addressed the challenges encountered in the interpretation of high-precision cosmic-ray data, with the goal of strengthening emergent synergies and taking advantage of the complementarity and know-how in different communities, from theoretical and experimental astroparticle physics to high-energy and nuclear physics. In this paper, we present the outcomes of the third edition of the workshop that took place in 2024. We present the current state of cosmic-ray experiments and their perspectives, and provide a detailed road map to close the most urgent gaps in cross-section data, in order to efficiently progress on many open physics cases, which are motivated in the paper. Finally, with the aim of being as exhaustive as possible, this report touches several other fields -- such as cosmogenic studies, space radiation protection and hadrontherapy -- where overlapping and specific new cross-section measurements, as well as nuclear code improvement and benchmarking efforts, are also needed. We also briefly highlight further synergies between astroparticle and high-energy physics on the question of cross-sections.\n\n", "2503.16111": "2025-03-20, **Gravitational lensing due to charged galactic wormhole**, Md Khalid Hossain et.al., [2503.16111v1](http://arxiv.org/abs/2503.16111v1)\n\n We propose the back reaction to the charged galactic wormhole spacetime based on Yoshiaki Sofue's exponential dark matter density profile to find exact solutions. The charges act as an additional component to the static wormhole, which is primarily formed by the galactic dark matter density. Unlike traditional mass-based models, this solution incorporates charge effects within a realistic dark matter distribution, revealing unique interactions between dark matter, electromagnetic fields, and spacetime curvature. This study confirms the criteria for wormhole formation, designating it the \"Charged Galactic Wormhole,\" and offers a new framework for investigating galactic structures, with potential observational signatures that deepen our understanding of dark matter and spacetime. Later, the proper radial distance and the embedding surface were also analyzed. Furthermore, the deflection of light around a charged galactic wormhole was investigated, along with a comprehensive review of the resulting image. The deflection of massive objects (charge less) near charged galactic wormholes is studied using the Gauss-Bonnet and Rindler-Ishak methods, with a detailed comparison of the results from both approaches. Additionally, in both the Rindler-Ishak (RI) and Gauss-Bonnet (GB) methods, when v tends to 1 i.e. when particle's velocity comparable to the speed of light , the results from these approaches converge, producing the same outcome as strong gravitational lensing.\n\n", "2503.16087": "2025-03-20, **Long-lived Quasinormal Modes and Gray-Body Factors of black holes and wormholes in dark matter inspired Weyl Gravity**, B. C. Lütfüoğlu et.al., [2503.16087v1](http://arxiv.org/abs/2503.16087v1)\n\n We calculate quasinormal modes and gray-body factors of a massive scalar field in the background of three compact objects in the Weyl gravity: Schwarzschild-like black holes, known as Mannheim-Kazanas solution, non-Schwrazschild-like black holes and traversable wormholes found recently in [P. Jizba, K. Mudru\\v{n}ka, Phys.Rev.D 110 (2024) 12, 124006]. We show that the spectrum of the massive field is qualitatively different from massless one both in the frequency and time domains. While the mass term leads to much longer lifetime of the modes, the arbitrarily long-lived modes, known as quasi-resonances, are not achieved.\n\n", "2503.15907": "2025-03-20, **Detection for Intermediate-mass Binary Black Holes in Population III Star Clusters with TianQin**, Hanzhang Wang et.al., [2503.15907v1](http://arxiv.org/abs/2503.15907v1)\n\n Context. Population III star clusters are predicted to form in unenriched dark matter halos. Direct N-body simulation of Pop III clusters implies the possible formation and merger of intermediate-mass binary black holes (IMBBHs). The gravitational wave signals could be detected by space-borne gravitational wave detectors like TianQin. Aims. This study evaluates the potential of TianQin in detecting IMBBHs from Pop III star clusters, focusing on key factors such as the detection horizon, detection number, and Fisher uncertainty. Methods. A Monte Carlo simulation is employed to derive IMBBH sources, utilizing the IMRPhenomD waveform model to simulate catalogs of observable IMBBH mergers. The mass and redshift distributions are derived from direct N-body simulations of IMBBHs in Population III star clusters. Detection numbers are determined by calculating the signal-to-noise ratios (SNR) of the simulated signals and applying thresholds for detection. Fisher uncertainty is obtained through Fisher information matrix analysis. Results. The findings suggest that TianQin could achieve detection numbers within 5 years ranging from 1 in the most pessimistic scenario to 253 in the most optimistic scenario. Furthermore, TianQin can precisely constrain the IMBBH mass with a relative uncertainty of $10^{-6}$, coalescence time $t\\_c$ within 1 second, and sky location $\\bar{\\Omega}\\_S$ within 1 $\\rm{deg}^2$. However, the luminosity distance $D\\_L$ and inclination angle $\\iota$ exhibit substantial degeneracies, limiting their precise estimation.\n\n", "2503.15659": "2025-03-19, **A low-redshift preference for an interacting dark energy model**, Yuejia Zhai et.al., [2503.15659v1](http://arxiv.org/abs/2503.15659v1)\n\n We explore an interacting dark sector model in trace-free Einstein gravity where dark energy has a constant equation of state, $w=-1$, and the energy-momentum transfer potential is proportional to the cold dark matter density. Compared to the standard $\\Lambda$CDM model, this scenario introduces a single additional dimensionless parameter, $\\epsilon$, which determines the amplitude of the transfer potential. Using a combination of \\textit{Planck} 2018 Cosmic Microwave Background (CMB), DESI 2024 Baryon Acoustic Oscillation (BAO), and Pantheon+ Type Ia supernovae (SNIa) data, we derive stringent constraints on the interaction, finding $\\epsilon$ to be of the order of $\\sim \\mathcal{O}(10^{-4})$. While CMB and SNIa data alone do not favor the presence of such an interaction, the inclusion of DESI data introduces a mild $1\\sigma$ preference for an energy-momentum transfer from dark matter to dark energy. This preference is primarily driven by low-redshift DESI BAO measurements, which favor a slightly lower total matter density $\\Omega\\_m$ compared to CMB constraints. Although the interaction remains weak and does not significantly alleviate the $H\\_0$ and $S\\_8$ tensions, our results highlight the potential role of dark sector interactions in late-time cosmology.\n\n", "2503.15609": "2025-03-19, **Flavour and Electroweak Precision Constraints on a Simplified Dark Matter Model with a Light Spin-0 Mediator**, Lipika Kolay et.al., [2503.15609v1](http://arxiv.org/abs/2503.15609v1)\n\n This work investigates the allowed parameter spaces of a simplified dark matter (DM) model characterized by a spin-0 mediator with masses in the low to intermediate range ($ < $ 10 GeV). We systematically divide the parameter space into various mass regions of the mediator and constrain the model parameters using a diverse set of observables, including flavour-changing charged and neutral current processes such as rare and semi-leptonic decays of pseudoscalar mesons (B and K), electroweak precision observables alongside data from fixed-target experiments. Additionally, we explore the model's capability to explain recent Belle-II data on invisible B-meson decays. Our study includes a detailed examination of DM properties and the constraints from Big Bang nucleosynthesis. We present bounds on model parameters through individual and simultaneous analyses of the available inputs and highlight their implications for understanding DM phenomenology. Furthermore, we obtain the bound on the couplings of the possible gauge invariant dimension-5 operators, leading to the possible interactions between the spin-0 mediator and the SM gauge bosons and fermions. This study comprehensively investigates the constraints and theoretical implications associated with low-mass spin-0 mediator DM models.\n\n", "2503.15605": "2025-03-19, **Self-similarity of the mass distribution in rich galaxy clusters up z~1 tracked with weak lensing**, Mauro Sereno et.al., [2503.15605v1](http://arxiv.org/abs/2503.15605v1)\n\n In the standard theory of growth of the nonbaryonic dark matter, cosmic structures form hierarchically and self-similarly from smaller clumps. The assembly merger tree goes from the linear perturbations in the early universe to highly non linear structures at late times. Gravity is the driving force and self-similarity should inform cosmic haloes. However, it is unclear if apparent anomalies at non-linear scales are due to either baryonic or new physics. Here, I show that the mass distribution of rich haloes evolve self-similarly at least since the universe was 5.7 Gyr old. Using gravitational weak lensing, I constrain the mass profiles of galaxy clusters with M\\_200c >~ 2 x 10^14 M\\_Sun that were optically detected in the HSC-SSP survey in the redshift range 0.2 <= z < 1.0. Cluster self-similarity confirms the standard theory of growth in the non-linear regime. Clusters are still growing but neither violent mergers nor matter slowly falling in from the cosmic web disrupt self-similarity, which is in place well before the halo formation time. Dark matter growth can fit the fossil cosmic microwave background as well as young, very massive haloes. Looking with next generation surveys at scales in clusters where self-similarity breaks could pose a new challenge to dark matter.\n\n", "2503.15595": "2025-03-19, **Stronger Constraints on Primordial Black Holes as Dark Matter Derived from the Thermal Evolution of the Intergalactic Medium over the Last Twelve Billion Years**, Nabendu Kumar Khan et.al., [2503.15595v1](http://arxiv.org/abs/2503.15595v1)\n\n Primordial black holes (PBHs) have been explored as potential dark matter candidates, with various astrophysical observations placing upper limits on the fraction $f\\_\\mathrm{PBH}$ of dark matter in the form of PBHs. However, a largely underutilized probe of PBH abundance is the temperature of the intergalactic medium (IGM), inferred from the thermal broadening of absorption lines in the Lyman-$\\alpha$ forest of quasar spectra. PBHs inject energy into the IGM via Hawking radiation, altering its thermal evolution. In this work, we constrain this energy injection by self-consistently modeling its interplay with the cosmological ultraviolet background from galaxies and supermassive black holes. Leveraging IGM temperature measurements spanning the past twelve billion years ($z \\sim 0$ to $6$), we derive one of the most stringent constraints on PBH-induced heating from light PBHs within the mass range $10^{15}\\unicode{x2013}10^{17}$ g. Specifically, for $M\\_\\mathrm{PBH} = 10^{16}$ g, we find $f\\_\\mathrm{PBH} < 5 \\times 10^{-5}$ at 95% confidence, with the bound scaling approximately as $M\\_\\mathrm{PBH}^{4}$ at other masses. Our inclusion of helium reionization and low-redshift temperature measurements strengthens previous IGM-based PBH constraints by an order of magnitude or more. Compared to other existing limits, our result is among the strongest, second only to the constraints from the 511 keV line from the Galactic Centre, but with distinct systematics. More broadly, this study highlights the IGM thermal history as a powerful and independent probe of beyond-standard-model physics.\n\n", "2503.15597": "2025-03-19, **SAPPHIRES: A Galaxy Over-Density in the Heart of Cosmic Reionization at $z=8.47$**, Yoshinobu Fudamoto et.al., [2503.15597v1](http://arxiv.org/abs/2503.15597v1)\n\n We report the discovery of a galaxy proto-cluster candidate (dubbed MACS0416-OD-z8p5) at a spectroscopic redshift of $z\\sim8.47$, dating back to $\\sim550$Myr after the Big Bang. The observations are part of the JWST Cycle-3 treasury program, Slitless Areal Pure-Parallel HIgh-Redshift Emission Survey (SAPPHIRES) with NIRCam-grism. Using wide field slitless spectroscopy (WFSS) obtained in the MACS0416 parallel field, we robustly confirm nine galaxies at $z\\_{\\rm spec}\\sim8.47$ via emission line detections of [OIII]5008A (with $>5\\,\\sigma$) and tentatively confirm one additional galaxy (at $\\sim3\\,\\sigma$). This discovery represents the highest-redshift, spectroscopically confirmed galaxy over-density known to date, which is $\\sim6$--$8$ times more dense than the average volume density of galaxies at the same redshift. Furthermore, a galaxy hosting a low-mass active galactic nucleus (``Little-Red-Dot'') is found as a member, suggesting an early emergence of active, massive black holes and feedback between these black holes and their surrounding environments. We also discuss the spatial structures connecting the galaxy over-density to nearby massive star-forming galaxies (separated by $\\sim 5$pMpc, including MACS0416-Y1 and MACS0416-JD. This finding of a massive dark matter halo hosting a galaxy over-density at $z\\sim8.5$ is surprising given that our survey covered only a small, random field ($16.5\\,{\\rm arcmin^2}$) as part of a pure parallel observation. The comparison with cosmological simulations shows that the likelihood of finding such a large-scale structure is $<5\\,\\%$ under the current galaxy formation scenario and the observed survey volume. Our results demonstrate the power of WFSS observations to build a complete line-emitter sample and suggest an important role for over-densities in enhancing galaxy formation by funneling large-scale gas supplies into small cosmological volumes.\n\n", "2503.15589": "2025-03-19, **Effects of Dark Matter Self Interactions on Sagittarius and Its Stream**, Connor Hainje et.al., [2503.15589v1](http://arxiv.org/abs/2503.15589v1)\n\n This work explores how assumptions regarding the particle-physics nature of dark matter can alter the evolution of the Sagittarius (Sgr) dwarf spheroidal galaxy and its expansive stellar stream. We run a large suite of $N$-body simulations to model the infall of a Sgr-like dwarf, exploring how the presence of dark matter self interactions impacts its evolution. For a scattering cross section of $\\sigma/m\\_\\chi = 30 \\text{ cm}^2\\text{/g}$ (at orbital velocity scales), these interactions result in significantly less stellar mass and little to no dark matter bound to the progenitor at the present day. To isolate the cause of this mass loss, we introduce a novel technique for controlling which pairs of dark matter simulation particles can interact. This enables us to identify ram-pressure evaporation - the scattering of satellite and host dark matter particles - as the primary source of the enhanced mass loss. The rapid disintegration of the Sgr progenitor when self interactions are allowed alters some key properties of the resulting stellar stream, most dramatically suppressing the presence of a \"spur\" on the apocenter of the trailing stream arm that correlates with the mass of the satellite at last pericenter. We demonstrate how the effects on the Sgr system scale with the particular choice of self-interaction cross section, which affects the degree of ram-pressure evaporation. These findings generalize beyond the Sgr system, underscoring that dwarf stellar streams and dwarf galaxies with close passages may serve as sensitive probes for dark matter self interactions.\n\n", "2503.15594": "2025-03-19, **The rise of the galactic empire: luminosity functions at $z\\sim17$ and $z\\sim25$ estimated with the MIDIS$+$NGDEEP ultra-deep JWST/NIRCam dataset**, Pablo G. Pérez-González et.al., [2503.15594v1](http://arxiv.org/abs/2503.15594v1)\n\n We present a sample of six F200W and three F277W dropout sources identified as $16<z<25$ galaxy candidates based on the deepest JWST/NIRCam data to date, provided by the MIRI Deep Imaging Survey (MIDIS) and the Next Generation Deep Extragalactic Exploratory Public survey (NGDEEP), reaching 5$\\sigma$ depths of $\\sim31.5$ mag (AB) at $\\geq2$ $\\mu$m. We estimate ultraviolet (UV) luminosity functions and densities at $z\\sim17$ and $z\\sim25$. We find that the number density of galaxies with absolute magnitudes $-19<M\\_\\mathrm{UV}<-18$ (AB) at $z\\sim17$ ($z\\sim25$) is a factor of 4 (25) smaller than at $z\\sim12$; a similar evolution is observed for the luminosity density. Compared to state-of-the-art galaxy simulations, we find the need for an enhanced UV-photon production at $z=17-25$ in $\\mathrm{M}\\_\\mathrm{DM}=10^{8.5-9.5}$ M$\\_\\odot$ dark matter halos, maybe provided by an increase in the star formation efficiency at early times and/or by intense bursts fed by very low metallicity or primordial gas. There are few robust theoretical predictions for the evolution of galaxies above $z\\sim20$ in the literature, however, the continuing rapid drop in the halo mass function suggests more rapid evolution than we observe if photon production efficiencies remained constant. Our $z>16$ galaxy candidates present mass-weighted ages around 30 Myr, and attenuations $\\mathrm{A(V)}<0.1$ mag. Their average stellar mass is $\\mathrm{M}\\_\\bigstar\\sim10^{7}\\,\\mathrm{M}\\_\\odot$, implying a star formation efficiency (stellar-to-baryon mass fraction) around 10%. We find three galaxies with very blue UV spectral slopes ($\\beta\\sim-3$) compatible with low metallicity or Pop III and young ($\\lesssim10$ Myr) stars and/or high escape fractions of ionizing photons, the rest presenting slopes $\\beta\\sim-2.5$ similar to $z=10-12$ samples.\n\n", "2503.15330": "2025-03-19, **Euclid Quick Data Release (Q1). The first catalogue of strong-lensing galaxy clusters**, Euclid Collaboration et.al., [2503.15330v1](http://arxiv.org/abs/2503.15330v1)\n\n We present the first catalogue of strong lensing galaxy clusters identified in the Euclid Quick Release 1 observations (covering $63.1\\,\\mathrm{deg^2}$). This catalogue is the result of the visual inspection of 1260 cluster fields. Each galaxy cluster was ranked with a probability, $\\mathcal{P}\\_{\\mathrm{lens}}$, based on the number and plausibility of the identified strong lensing features. Specifically, we identified 83 gravitational lenses with $\\mathcal{P}\\_{\\mathrm{lens}}>0.5$, of which 14 have $\\mathcal{P}\\_{\\mathrm{lens}}=1$, and clearly exhibiting secure strong lensing features, such as giant tangential and radial arcs, and multiple images. Considering the measured number density of lensing galaxy clusters, approximately $0.3\\,\\mathrm{deg}^{-2}$ for $\\mathcal{P}\\_{\\mathrm{lens}}>0.9$, we predict that \\Euclid\\ will likely see more than 4500 strong lensing clusters over the course of the mission. Notably, only three of the identified cluster-scale lenses had been previously observed from space. Thus, \\Euclid has provided the first high-resolution imaging for the remaining $80$ galaxy cluster lenses, including those with the highest probability. The identified strong lensing features will be used for training deep-learning models for identifying gravitational arcs and multiple images automatically in \\Euclid observations. This study confirms the huge potential of \\Euclid for finding new strong lensing clusters, enabling exciting new discoveries on the nature of dark matter and dark energy and the study of the high-redshift Universe.\n\n", "2503.15329": "2025-03-19, **Euclid Quick Data Release (Q1). LEMON -- Lens Modelling with Neural networks. Automated and fast modelling of Euclid gravitational lenses with a singular isothermal ellipsoid mass profile**, Euclid Collaboration et.al., [2503.15329v1](http://arxiv.org/abs/2503.15329v1)\n\n The Euclid mission aims to survey around 14000 deg^{2} of extragalactic sky, providing around 10^{5} gravitational lens images. Modelling of gravitational lenses is fundamental to estimate the total mass of the lens galaxy, along with its dark matter content. Traditional modelling of gravitational lenses is computationally intensive and requires manual input. In this paper, we use a Bayesian neural network, LEns MOdelling with Neural networks (LEMON), for modelling Euclid gravitational lenses with a singular isothermal ellipsoid mass profile. Our method estimates key lens mass profile parameters, such as the Einstein radius, while also predicting the light parameters of foreground galaxies and their uncertainties. We validate LEMON's performance on both mock Euclid data sets, real Euclidised lenses observed with Hubble Space Telescope (hereafter HST), and real Euclid lenses found in the Perseus ERO field, demonstrating the ability of LEMON to predict parameters of both simulated and real lenses. Results show promising accuracy and reliability in predicting the Einstein radius, axis ratio, position angle, effective radius, S\\'ersic index, and lens magnitude for simulated lens galaxies. The application to real data, including the latest Quick Release 1 strong lens candidates, provides encouraging results, particularly for the Einstein radius. We also verified that LEMON has the potential to accelerate traditional modelling methods, by giving to the classical optimiser the LEMON predictions as starting points, resulting in a speed-up of up to 26 times the original time needed to model a sample of gravitational lenses, a result that would be impossible with randomly initialised guesses. This work represents a significant step towards efficient, automated gravitational lens modelling, which is crucial for handling the large data volumes expected from Euclid.\n\n", "2503.15327": "2025-03-19, **Euclid Quick Data Release (Q1). The Strong Lensing Discovery Engine D -- Double-source-plane lens candidates**, Euclid Collaboration et.al., [2503.15327v1](http://arxiv.org/abs/2503.15327v1)\n\n Strong gravitational lensing systems with multiple source planes are powerful tools for probing the density profiles and dark matter substructure of the galaxies. The ratio of Einstein radii is related to the dark energy equation of state through the cosmological scaling factor $\\beta$. However, galaxy-scale double-source-plane lenses (DSPLs) are extremely rare. In this paper, we report the discovery of four new galaxy-scale double-source-plane lens candidates in the Euclid Quick Release 1 (Q1) data. These systems were initially identified through a combination of machine learning lens-finding models and subsequent visual inspection from citizens and experts. We apply the widely-used {\\tt LensPop} lens forecasting model to predict that the full \\Euclid survey will discover 1700 DSPLs, which scales to $6 \\pm 3$ DSPLs in 63 deg$^2$, the area of Q1. The number of discoveries in this work is broadly consistent with this forecast. We present lens models for each DSPL and infer their $\\beta$ values. Our initial Q1 sample demonstrates the promise of \\Euclid to discover such rare objects.\n\n", "2503.15307": "2025-03-19, **Euclid Quick Data Release (Q1): From spectrograms to spectra: the SIR spectroscopic Processing Function**, Euclid Collaboration et.al., [2503.15307v1](http://arxiv.org/abs/2503.15307v1)\n\n The Euclid space mission aims to investigate the nature of dark energy and dark matter by mapping the large-scale structure of the Universe. A key component of Euclid's observational strategy is slitless spectroscopy, conducted using the Near Infrared Spectrometer and Photometer (NISP). This technique enables the acquisition of large-scale spectroscopic data without the need for targeted apertures, allowing precise redshift measurements for millions of galaxies. These data are essential for Euclid's core science objectives, including the study of cosmic acceleration and the evolution of galaxy clustering, as well as enabling many non-cosmological investigations. This study presents the SIR processing function (PF), which is responsible for processing slitless spectroscopic data. The objective is to generate science-grade fully-calibrated one-dimensional spectra, ensuring high-quality spectroscopic data. The processing function relies on a source catalogue generated from photometric data, effectively corrects detector effects, subtracts cross-contaminations, minimizes self-contamination, calibrates wavelength and flux, and produces reliable spectra for later scientific use. The first Quick Data Release (Q1) of Euclid's spectroscopic data provides approximately three million validated spectra for sources observed in the red-grism mode from a selected portion of the Euclid Wide Survey. We find that wavelength accuracy and measured resolving power are within requirements, thanks to the excellent optical quality of the instrument. The SIR PF represents a significant step in processing slitless spectroscopic data for the Euclid mission. As the survey progresses, continued refinements and additional features will enhance its capabilities, supporting high-precision cosmological and astrophysical measurements.\n\n", "2503.15189": "2025-03-19, **Competitive Accretion and the Baryonic Fraction in Galaxies**, Ian A. Bonnell et.al., [2503.15189v1](http://arxiv.org/abs/2503.15189v1)\n\n The baryonic fraction of galaxies is observed to vary with the mass of its dark matter (DM) halo. Low-mass galaxies have low baryonic fractions which increase to a maximum for masses near $10^{12}\\ M\\_{\\odot}$, and decreases thereafter with increasing galaxy mass. This trend is generally attributed to the action of feedback from star formation at the low end and of active galactic nuclei at the high-mass end. An alternative is that the baryonic fraction is at least partially due to the ability of galaxies to competitively accrete gas in a group or clustered environment. Most galaxies in a group including those of lower masses, orbit the cluster centre at significant speeds and hence their accretion is limited by a Bondi-Hoyle type process, $\\dot{M}\\_{acc} \\propto M\\_{DM}^2$. In contrast, the few high-mass galaxies reside in the core of the cluster and accrete in a tidal accretion process, $\\dot{M}\\_{acc} \\propto M\\_{DM}^{2/3}$. These two mechanisms result in a baryonic mass fraction that increases as $M\\_{DM}$ at low masses and decreases as $M\\_{DM}^{-1/3}$ at high masses. This model predicts that lower-mass halos in small-N groups should have higher baryonic fractions relative to those in large clusters.\n\n", "2503.15066": "2025-03-19, **A Novel Quantity for Probing Matter Perturbations Below the Fresnel Scale in Gravitational Lensing of Gravitational Waves**, So Tanaka et.al., [2503.15066v1](http://arxiv.org/abs/2503.15066v1)\n\n Gravitational lensing of gravitational waves provides a powerful probe of the mass density distribution in the universe. Wave optics effects, such as diffraction, make the lensing effect sensitive to the structure around the Fresnel scale, which depends on the gravitational wave frequency and is typically sub-Galactic for realistic observations. Contrary to this common lore, we show that wave optics can, in principle, probe matter perturbations even below the Fresnel scale. This is achieved by introducing a new quantity derived from the amplification factor, which characterizes the lensing effect, and analyzing its correlation function. Our results demonstrate that this quantity defines an effective Fresnel scale: a characteristic scale that can be arbitrarily small, even when observational frequencies are bounded. In practice, the effective Fresnel scale is constrained by the observation time $T$ and is suppressed by a factor of $1/\\sqrt{fT}$ relative to the standard Fresnel scale at frequency $f$. Nevertheless, it remains significantly smaller than the conventional Fresnel scale for $fT \\gg 1$; for instance, in one-year observations of mHz GWs, the effective Fresnel scale can be as small as 1 pc. This approach opens new avenues for probing the fine-scale structure of the universe and the nature of dark matter.\n\n", "2503.14819": "2025-03-19, **Measurement of the Quantum Efficiency of Electrode Materials for VUV Photons in Liquid Xenon**, Shingo Kazama et.al., [2503.14819v1](http://arxiv.org/abs/2503.14819v1)\n\n Light dark matter searches using ionization signals in dual-phase liquid xenon (LXe) time projection chambers (TPCs) are limited by low-energy ionization backgrounds, including those from the photoelectric effect on the electrodes. To address this, we measured the quantum efficiency (QE) of various electrode materials for vacuum ultraviolet (VUV) photons in LXe, including platinum (Pt), stainless steel (SUS304), and magnesium fluoride (MgF$\\_{2}$)-coated aluminum (Al). Our results show that MgF$\\_{2}$-coated Al exhibits the lowest QE among the tested materials. The QE for VUV photons with a mean wavelength of 179.5~nm was measured to be $(7.2 \\pm 2.3) \\times 10^{-5}$, corresponding to a reduction by a factor of 4.4 compared to SUS304, a commonly used electrode material in direct dark matter experiments with LXe. These findings suggest that employing low-QE electrodes can help mitigate photoelectric-induced backgrounds, potentially improving the sensitivity of LXe TPCs in light dark matter searches.\n\n"}, "supernova": {"2503.16415": "2025-03-20, **Apparent $w<-1$ and a Lower $S_8$ from Dark Axion and Dark Baryons Interactions**, Justin Khoury et.al., [2503.16415v1](http://arxiv.org/abs/2503.16415v1)\n\n We show that a simple coupling between dark energy and dark matter can simultaneously address two distinct hints at new physics coming from cosmological observations. The first is the recent evidence from the DESI project and supernovae observations that the dark energy equation of state~$w$ is evolving over cosmic time from an earlier value that is~$<-1$ to a present-day value~$>-1$. The second observation is the so-called~$S\\_8$ tension, describing the suppression of the growth of matter overdensities compared to that expected in the~$\\Lambda$CDM model. We propose a stable, technically natural particle physics implementation of this idea, in which dark matter consists of dark baryons in a strongly-coupled hidden sector, and the dark energy field is the associated dark axion. The time-variation of the dark matter mass results in an effective dark energy equation of state that exhibits a phantom crossing behavior consistent with recent results. It also results in a slight delay in matter-radiation equality, which suppresses the overall growth of density perturbations.\n\n", "2503.16317": "2025-03-20, **Proto-neutron star oscillations including accretion flows**, Dimitra Tseneklidou et.al., [2503.16317v1](http://arxiv.org/abs/2503.16317v1)\n\n The gravitational wave signature from core-collapse supernovae (CCSNe) is dominated by quadrupolar oscillation modes of the newly born proto-neutron star (PNS), and could be detectable at galactic distances. We have developed a framework for computing the normal oscillation modes of a PNS in general relativity, including, for the first time, the presence of an accretion flow and a surrounding stalled accretion shock. These new ingredients are key to understand PNS oscillation modes, in particular those related to the standing-accretion-shock instability (SASI). Their incorporation is an important step towards accurate PNS asteroseismology. For this purpose, we perform linear and adiabatic perturbations of a spherically symmetric background, in the relativistic Cowling approximation, and cast the resulting equations as an eigenvalue problem. We discretize the eigenvalue problem using collocation Chebyshev spectral methods, which is then solved by means of standard and efficient linear algebra methods. We impose boundary conditions at the accretion shock compatible with the Rankine-Hugoniot conditions. We present several numerical examples to assess the accuracy and convergence of the numerical code, as well as to understand the effect of an accretion flow on the oscillation modes, as a stepping stone towards a complete analysis of the CCSNe case.\n\n", "2503.16242": "2025-03-20, **Gamma-Ray Burst Jets in Circumstellar Material: Dynamics, Breakout, and Diversity of Transients**, Hamid Hamidani et.al., [2503.16242v1](http://arxiv.org/abs/2503.16242v1)\n\n Recent observations indicate that stripped-envelope core-collapse supernovae are often surrounded by dense circumstellar material (CSM). Motivated by this, we develop an analytic model to systematically study the dynamics of long gamma-ray burst (LGRB) jet propagation in various CSM environments. We derive a general formula for the jet head velocity ($\\beta\\_{\\rm h}$) and breakout time ($t\\_{\\rm b}$) valid across Newtonian, relativistic, and intermediate regimes, accounting for a previously unrecognized dependence on $1 - \\beta\\_{\\rm h}$. Our results highlight a fundamental distinction between jet propagation in massive stars, where $\\beta\\_{\\rm h}\\ll 1$, and in extended CSM, where $1-\\beta\\_{\\rm h}\\ll 1$. We establish an analytic success/failure criterion for jets and express it in terms of jet and CSM parameters, revealing a strong dependence on CSM radius. To quantify the relativistic nature of the jet-cocoon system, we introduce the energy-weighted proper velocity $\\overline{\\Gamma\\beta}$. We identify three possible jet outcomes-(a) successful jets ($\\overline{\\Gamma\\beta} \\sim 10-100$), (b) barely failed jets ($\\overline{\\Gamma\\beta} \\sim 1$), and (c) completely failed jets ($\\overline{\\Gamma\\beta} \\sim 0.1$)-and constrain their respective jet/CSM parameter spaces. We show that in (b) and (c), large CSM radii can power luminous fast blue optical transients via cocoon cooling emission. This theoretical framework provides a basis for future observational and theoretical studies to elucidate the link between LGRBs, intermediate GRBs, low-luminosity LGRBs, and their environments.\n\n", "2503.16099": "2025-03-20, **Evolution of binary stars**, Pablo Marchant et.al., [2503.16099v1](http://arxiv.org/abs/2503.16099v1)\n\n Binary stars are pairs of stars that are gravitationally bound, providing in some cases accurate measurements of their masses and radii. As such, they serve as excellent testbeds for the theory of stellar structure and evolution. Moreover, binary stars that orbit each other at a sufficiently small distance will interact during their lifetimes, leading to a multitude of different evolutionary pathways that are not present in single star evolution. Among other outcomes, this can lead to the production of stellar mergers, rejuvenated and chemically contaminated accreting stars, stars stripped of their hydrogen envelopes and gravitational wave sources. For stars massive enough to undergo a supernova, binary interaction is expected to impact the evolution of most of them, making the understanding of binary evolution a critical element to comprehend stellar populations and their impact at large scales.\n\n", "2503.15977": "2025-03-20, **Hide and seek with a Neutron Star. Hint of Neutron Star activity in SN 2015ap light curve**, Fabio Ragosta et.al., [2503.15977v1](http://arxiv.org/abs/2503.15977v1)\n\n Aims. We present a detailed study of the unique SN 2015ap, a very energetic event, notable for its exceptionally high bolometric peak magnitude if compared to other well-know Type Ib supernovae. We analyzed its multi-wavelength light curve, which exhibited a possible period modulation that could result from a geometrical effect. Methods. We analyzed the modulation present at all available bands in SN 2015ap's light curves using a Bayesian approach for measuring the period of variability. Additionally, narrow Ha emission is observed in late-time spectra, exhibiting periodic velocity shifts likely originating from hydrogen gas stripped from a companion and accreted onto the compact remnant. Results. We propose that SN 2015ap's significant light curve modulation arise from accretion onto a neutron star as the remnant of SN 2015ap. Our multi-wavelength observations reveal a sinusoidal modulation with a period of 8.4 days, confirmed by periodic variations in the Ha emission lines. Traditional models of circumstellar medium interactions cannot account for these features due to the unusually high ejection rates required. Using the Taylor-Spruit dynamo model, we suggest that the interaction between accreting matter and the neutron star's magnetosphere could account for the observed periodic modulation. This implies assuming an ejecta-companion interaction because the accretion from fallback ejecta alone would not produce the observed modulation. The binary configuration, characterized by a separation of less than 50 Ro, supports a magnetized neutron star central engine as the primary mechanism, rather than models involving circumstellar material interaction.\n\n", "2503.15943": "2025-03-20, **Null tests with Gaussian Process**, Shengqing Gao et.al., [2503.15943v1](http://arxiv.org/abs/2503.15943v1)\n\n We investigate the null tests of spatial flatness and the flat $\\Lambda$CDM model using the Baryon Acoustic Oscillation (BAO) data measured by the Dark Energy Spectroscopic Instrument, the cosmic chronometers (CCH) $H(z)$ data, and the Union3 and Pantheon Plus type Ia supernovae (SNe Ia) datasets. We propose a novel non-parametric reconstruction of $F\\_{AP}$, $D\\_M/r\\_d$ and $D'\\_M/r\\_d$ from the DESI BAO data to perform the $Ok$ diagnostic, and we also conduct the $Ok$ diagnostic using the combination of CCH and SNe Ia data. The novel method avoids the issue of the dependence on cosmological parameters such as the value of the Hubble constant. There is no evidence of deviation from the flat $\\Lambda$CDM model, nor is there any indication of dynamical dark energy found in the observational data. Since we employ a non-parametric reconstruction method, all the conclusions drawn in this paper remain robust and agnostic to any cosmological model and gravitational theory.\n\n", "2503.15659": "2025-03-19, **A low-redshift preference for an interacting dark energy model**, Yuejia Zhai et.al., [2503.15659v1](http://arxiv.org/abs/2503.15659v1)\n\n We explore an interacting dark sector model in trace-free Einstein gravity where dark energy has a constant equation of state, $w=-1$, and the energy-momentum transfer potential is proportional to the cold dark matter density. Compared to the standard $\\Lambda$CDM model, this scenario introduces a single additional dimensionless parameter, $\\epsilon$, which determines the amplitude of the transfer potential. Using a combination of \\textit{Planck} 2018 Cosmic Microwave Background (CMB), DESI 2024 Baryon Acoustic Oscillation (BAO), and Pantheon+ Type Ia supernovae (SNIa) data, we derive stringent constraints on the interaction, finding $\\epsilon$ to be of the order of $\\sim \\mathcal{O}(10^{-4})$. While CMB and SNIa data alone do not favor the presence of such an interaction, the inclusion of DESI data introduces a mild $1\\sigma$ preference for an energy-momentum transfer from dark matter to dark energy. This preference is primarily driven by low-redshift DESI BAO measurements, which favor a slightly lower total matter density $\\Omega\\_m$ compared to CMB constraints. Although the interaction remains weak and does not significantly alleviate the $H\\_0$ and $S\\_8$ tensions, our results highlight the potential role of dark sector interactions in late-time cosmology.\n\n", "2503.15630": "2025-03-19, **Supernova production of axion-like particles coupling to electrons, reloaded**, Damiano F. G. Fiorillo et.al., [2503.15630v1](http://arxiv.org/abs/2503.15630v1)\n\n We revisit the production of axion-like particles (ALPs) coupled to electrons at tree-level in a relativistic plasma. We explicitly demonstrate the equivalence between pseudoscalar and derivative couplings, incorporate previously neglected processes for the first time-namely, semi-Compton production ($\\gamma e^-\\rightarrow a e^-$) and pair annihilation ($e^+e^-\\rightarrow a\\gamma$)-and derive analytical expressions for the bremsstrahlung ($e^- N\\to e^- N a$) production rate, enabling a more computationally efficient evaluation of the ALP flux. Additionally, we assess uncertainties in the production rate arising from electron thermal mass corrections, electron-electron Coulomb interactions, and the Landau-Pomeranchuk-Migdal effect. The ALP emissivity is made available in a public repository as a function of the ALP mass, the temperature, and the electron chemical potential of the plasma. Finally, we examine the impact of ALP production and subsequent decays on astrophysical observables, deriving the leading bounds on ALPs coupling to electrons. At small couplings, the dominant constraints come from the previously neglected decay $a\\to e^+ e^-\\gamma$, except for a region of fireball formation where SN~1987A X-ray observations offer the best probe. At large couplings, bounds are dominated by the energy deposition argument, with a recently developed new prescription for the trapping regime.\n\n", "2503.15423": "2025-03-19, **Spectroscopy of Supernova Remnants and Candidates in M31**, Nelson Caldwell et.al., [2503.15423v1](http://arxiv.org/abs/2503.15423v1)\n\n With a star formation rate of order 0.4 M$\\_\\odot $ yr$^{-1}$, M31 should have significant population of supernova remnants (SNRs), and, in fact, 156 SNR and SNR candidates have been suggested by Lee et al. (2014) by searching for nebulae with elevated [SII]/H${\\alpha}$ ratios in narrow band images. Here we use a combination of low and high resolution optical spectroscopy obtained with Hectospec on the MMT to characterize 152 of these nebulae. Of these candidates, we find 93 nebulae that have [SII]/H${\\alpha}$ ratios that exceed 0.4, the traditional ratio used to separate SNRs from HII regions, strongly suggesting that at least these objects are SNRs. Our high resolution spectroscopy reveals 108 nebulae that have velocity widths in H${\\alpha} $ (full-width at 20% peak flux) that exceed 50 km s$^{-1}$, significantly larger than found in HII regions. There are 72 objects that satisfy both tests. Here we discuss the spectroscopic characteristics of all of the objects in our sample, and the likelihood that other objects in the sample of Lee et al. are also SNRs, and we briefly consider confirmation by X-ray, radio and UV observations. We also discuss several new candidates that have been identified serendipitously in the course of examining a large amount of archival Hectospec data.\n\n", "2503.15334": "2025-03-19, **Euclid: Quick Data Release (Q1) -- Photometric studies of known transients**, C. Duffy et.al., [2503.15334v1](http://arxiv.org/abs/2503.15334v1)\n\n We report on serendipitous Euclid observations of previously known transients, using the Euclid Q1 data release. By cross-matching with the Transient Name Server (TNS) we identify 164 transients that coincide with the data release. Although the Euclid Q1 release only includes single-epoch data, we are able to make Euclid photometric measurements at the location of 161 of these transients. Euclid obtained deep photometric measurements or upper limits of these transients in the $I\\_E$, $Y\\_E$, $J\\_E$, and $H\\_E$ bands at various phases of the transient light-curves, including before, during, and after the observations of ground-based transient surveys. Approximately 70\\% of known transients reported in the six months before the Euclid observation date and with discovery magnitude brighter than 24 were detected in Euclid $\\IE$ images. Our observations include one of the earliest near-infrared detections of a Type~Ia supernova (SN 2024pvw) 15 days prior to its peak brightness, and the late-phase (435.9 days post peak) observations of the enigmatic core-collapse SN 2023aew. Euclid deep photometry provides valuable information on the nature of these transients such as their progenitor systems and power sources, with late time observations being a uniquely powerful contribution. In addition, Euclid is able to detect the host galaxies of some transients that were previously classed as hostless. The Q1 data demonstrate the power of the Euclid data even with only single-epoch observations available, as will be the case for much larger areas of sky in the Euclid Wide Survey.\n\n", "2503.15067": "2025-03-19, **Exploring magnetised galactic outflows in starburst dwarf galaxies NGC 3125 and IC 4662**, Sam Taziaux et.al., [2503.15067v1](http://arxiv.org/abs/2503.15067v1)\n\n The study of radio emission in starburst dwarf galaxies provides a unique opportunity to investigate the mechanisms responsible for the amplification and transport of magnetic fields. Local dwarfs are often considered proxies for early-Universe galaxies, so this study may provide insights into the role of non-thermal components in the formation and evolution of larger galaxies. By investigating the radio continuum spectra and maps of the starburst dwarf galaxies, we aim to draw conclusions on their magnetic field strengths and configurations, as well as the dynamics of cosmic ray (CR) transport. We perform a radio continuum polarimetry study of two of the brightest starburst IRAS Revised Bright Galaxy Sample (RBGS) dwarf galaxies, NGC 3125 and IC 4662. By combining data of the Australian Telescope Compact Array (2.1 GHz) and MeerKAT (1.28 GHz), we analyse the underlying emission mechanism and the CR transport in these systems. We find flat spectra in those dwarf galaxies over the entire investigated frequency range, which sharply contrasts with observations of massive spiral galaxies. Because the expected cooling time of CR electrons is much shorter than their escape time, we would expect a steepened steady-state CR electron spectrum. The flat observed spectra suggest a substantial contribution from free-free emission at high frequencies and absorption at low frequencies, which may solve this puzzle. For NGC 3125, we measure a degree of polarisation between 0.75% and 2.6%, implying a turbulent field and supporting the picture of a comparably large thermal emission component that could be sourced by stellar radiation feedback and supernovae.\n\n", "2503.14994": "2025-03-19, **V1047 Cen: The first Z And-type outburst observed in the classical nova binary**, Augustin Skopal et.al., [2503.14994v1](http://arxiv.org/abs/2503.14994v1)\n\n In 2019, the classical nova V1047 Cen experienced an unusual outburst, the nature of which has not yet been clearly determined. In this paper, we show that the 2019 V1047~Cen outburst is of Z And-type -- a type that is characteristic and has so far been observed only in symbiotic binaries. We support our claim by modeling the near-ultraviolet to near-infrared spectral energy distribution, which revealed a close similarity between the fundamental parameters and the mass-loss rate of the burning white dwarf during the 2019 V1047 Cen outburst and those measured during Z And-type outbursts in symbiotic stars. All parameters are in agreement with the theoretical prediction when the accretion rate exceeds the stable burning limit for white dwarfs with masses less than 0.7 solar units. Our analysis showed that after a nova explosion, the Z And-type outburst can occur not only in symbiotic binaries but also in short-period cataclysmic variables, when the accretion-powered system changes to a nuclear-powered one, as a consequence of the donor's reaction to the nova explosion. Such a development promotes the production of Type Ia supernovae.\n\n", "2503.14969": "2025-03-19, **Constraining Axially Symmetric Bianchi Type I Model with Self-Consistent Recombination History and Observables**, Boris Hoi-Lun Ng et.al., [2503.14969v1](http://arxiv.org/abs/2503.14969v1)\n\n Recent cosmological measurements suggest the possibility of an anisotropic universe. As a result, the Bianchi Type I model, being the simplest anisotropic extension to the standard Friedmann-Lema\\^itre-Robertson-Walker metric has been extensively studied. In this work, we show how the recombination history should be modified in an anisotropic universe and derive observables by considering the null geodesic. We then constrain the axially symmetric Bianchi Type I model by performing Markov Chain Monte Carlo with the acoustic scales in Cosmic Microwave Background (CMB) and Baryon Acoustic Oscillation data, together with local measurements of $H(z)$ and Pantheon Supernova data. Our results reveal that the anisotropic model is not worth a bare mention compared to the $\\Lambda$CDM model, and we obtain a tight constraint on the anisotropy that generally agrees with previous studies under a maximum temperature anisotropy fraction of $2\\times 10^{-5}$. To allow for a non-kinematic CMB dipole, we also present constraints based on a relaxed maximum temperature anisotropy comparable to that of the CMB dipole. We stress that there is a significant difference between the geodesic-based observables and the naive isotropic analogies when there is a noticeable anisotropy. However, the changes in recombination history are insignificant even under the relaxed anisotropy limit.\n\n"}}