{"neutrino": {"2307.14972": "2023-07-27, **Exploring Freeze-out and Freeze-in Dark Matter via Effective Froggatt-Nielsen Theory**, Rusa Mandal et.al., [2307.14972v1](http://arxiv.org/abs/2307.14972v1)\n\n Motivated by the dynamical reasons for the hierarchical structure of the Yukawa sector of the Standard Model (SM), we consider an extension of the SM with a complex scalar field, known as `flavon', based on the Froggatt-Nielsen mechanism. In an effective theory approach, the SM fermion masses and mixing patterns are generated in orders of the parameter related to the vacuum expectation value of the flavon field and the cut-off of the effective theory. By introducing right-handed neutrinos, we study the viability of the lightest right-handed neutrino as a dark matter candidate, where the same flavon field acts as a mediator between the dark and the SM sectors. We find that dark matter genesis is achieved both through freeze-out and freeze-in mechanisms encompassing the $\\mathcal{O}(\\text{GeV})$ -- $\\mathcal{O}(\\text{TeV})$ mass range of the mediator and the dark matter particle. In addition to tree-level spin-dependent cross section, the model gives rise to tree- and loop-level contributions to spin-independent scattering cross section at the direct detection experiments such as XENON and LUX-ZEPLIN which can be probed in their future upgrades. By choosing suitable Froggatt-Nielsen charges for the fermions, we also generate the mass spectrum of the SM neutrinos via the Type-I seesaw mechanism. Flavor-changing neutral current processes, such as radiative lepton decay, meson mixing, and top-quark decay remain the most constraining channels and provide testability for this minimal setup that addresses several major shortcomings of the SM.\n\n", "2307.14869": "2023-07-27, **Parity Solution to the Strong CP Problem and a Unified Framework for Inflation, Baryogenesis, and Dark Matter**, K. S. Babu et.al., [2307.14869v1](http://arxiv.org/abs/2307.14869v1)\n\n It has been known for some time that asymptotic parity invariance of weak interactions can provide a solution to the strong CP problem without the need for the axion. Left-right symmetric theories which employ a minimal Higgs sector consisting of a left-handed and a right-handed doublet is an example of such a theory wherein all fermion masses arise through a generalized seesaw mechanism. In this paper we present a way to understand the origin of matter-antimatter asymmetry as well as the dark matter content of the universe in these theories using the Affleck-Dine (AD) leptogenesis mechanism and inflaton decay, respectively. Three gauge singlet fermions are needed for this purpose, two of which help to implement the Dirac seesaw for neutrino masses while the third one becomes the non-thermal warm dark matter candidate. A soft lepton number breaking term involving the AD scalar field is used to generate lepton asymmetry which suffers no wash-out effects and maintains the Dirac nature of neutrinos. This framework thus provides a unified description of many of the unresolved puzzles of the standard model that require new physics.\n\n", "2307.14842": "2023-07-27, **Observation of high-energy neutrinos from the Galactic plane**, Stephen Sclafani et.al., [2307.14842v1](http://arxiv.org/abs/2307.14842v1)\n\n IceCube has discovered a flux of astrophysical neutrinos and presented evidence for the first neutrino sources, a flaring blazar known as TXS 0506+056 and the active galaxy NGC 1068. However, the sources responsible for the majority of the astrophysical neutrino flux remain elusive. In addition to hypothetical sources within our Galaxy, high energy neutrinos are produced when cosmic rays interact at their acceleration sites and during propagation through the interstellar medium. The Galactic plane has therefore long been hypothesized as a neutrino source. In this contribution, new results are presented for searches of neutrino sources utilizing a dataset that builds upon recent advances in deep-learning-based reconstruction methods for neutrino-induced cascades. This work presents the first observation of high-energy neutrinos from the Milky Way Galaxy, rejecting the background-only hypothesis at 4.5$\\sigma$. The neutrino signal is consistent with diffuse emission from the Galactic plane, potentially in combination with emission by a population of sources.\n\n", "2307.14728": "2023-07-27, **Angular dependence of the atmospheric neutrino flux with IceCube data**, Leonora Kardum et.al., [2307.14728v1](http://arxiv.org/abs/2307.14728v1)\n\n IceCube Neutrino Observatory, the cubic kilometer detector embedded in ice of the geographic South Pole, is capable of detecting particles from several GeV up to PeV energies enabling precise neutrino spectrum measurement. The diffuse neutrino flux can be subdivided into three components: astrophysical, from extraterrestrial sources; conventional, from pion and kaon decays in atmospheric Cosmic Ray cascades; and the yet undetected prompt component from the decay of charmed hadrons. A particular focus of this work is to test the predicted angular dependence of the atmospheric neutrino flux using an unfolding method. Unfolding is a set of methods aimed at determining a value from related quantities in a model-independent way, eliminating the influence of several assumptions made in the process. In this work, we unfold the muon neutrino energy spectrum and employ a novel technique for rebinning the observable space to ensure sufficient event numbers within the low statistic region at the highest energies. We present the unfolded energy and zenith angle spectrum reconstructed from IceCube data and compare the result with model expectations and previous measurements.\n\n", "2307.14724": "2023-07-27, **Seasonal Variations of the Atmospheric Neutrino Flux measured in IceCube**, Karolin Hymon et.al., [2307.14724v1](http://arxiv.org/abs/2307.14724v1)\n\n The IceCube Neutrino Observatory measures high energy atmospheric neutrinos with high statistics. These atmospheric neutrinos are produced in cosmic ray interactions in the atmosphere, mainly by the decay of pions and kaons. The rate of the measured neutrinos is affected by seasonal temperature variations in the stratosphere, which are expected to increase with the energy of the particle. In this contribution, seasonal energy spectra are obtained using a novel spectrum unfolding approach, the Dortmund Spectrum Estimation Algorithm (DSEA+), in which the energy distribution from 125 GeV to 10 TeV is estimated from measured quantities with machine learning algorithms. The seasonal spectral difference to the annual average flux will be discussed based on preliminary results from IceCube's atmospheric muon neutrino data.\n\n", "2307.14689": "2023-07-27, **Multiplicity of TeV muons in extensive air showers detected with IceTop and IceCube**, Stef Verpoest et.al., [2307.14689v1](http://arxiv.org/abs/2307.14689v1)\n\n We report on an analysis of the high-energy muon component in near-vertical extensive air showers detected by the surface array IceTop in coincidence with the in-ice array of the IceCube Neutrino Observatory. In the coincidence measurement, the predominantly electromagnetic signal measured by IceTop is used to estimate the cosmic-ray primary energy, and the energy loss of the muon bundle in the deep in-ice array is used to estimate the number of muons in the shower with energies above 500 GeV (\"TeV muons\"). The average multiplicity of these TeV muons is determined for cosmic-ray energies between 2.5 PeV and 100 PeV assuming three different hadronic interaction models: Sibyll 2.1, QGSJet-II.04, and EPOS-LHC. For all models considered, the results are found to be in good agreement with the expectations from simulations. A tension exists, however, between the high-energy muon multiplicity and other observables; most importantly the density of GeV muons measured by IceTop using QGSJet-II.04 and EPOS-LHC.\n\n", "2307.14636": "2023-07-27, **Final results of Borexino on CNO solar neutrinos**, D. Basilico et.al., [2307.14636v1](http://arxiv.org/abs/2307.14636v1)\n\n We report the first measurement of CNO solar neutrinos by Borexino that uses the Correlated Integrated Directionality (CID) method, exploiting the sub-dominant Cherenkov light in the liquid scintillator detector. The directional information of the solar origin of the neutrinos is preserved by the fast Cherenkov photons from the neutrino scattered electrons, and is used to discriminate between signal and background. The directional information is independent from the spectral information on which the previous CNO solar neutrino measurements by Borexino were based. While the CNO spectral analysis could only be applied on the Phase-III dataset, the directional analysis can use the complete Borexino data taking period from 2007 to 2021. The absence of CNO neutrinos has been rejected with >5{\\sigma} credible level using the Bayesian statistics. The directional CNO measurement is obtained without an external constraint on the $^{210}$Bi contamination of the liquid scintillator, which was applied in the spectral analysis approach. The final and the most precise CNO measurement of Borexino is then obtained by combining the new CID-based CNO result with an improved spectral fit of the Phase-III dataset. Including the statistical and the systematic errors, the extracted CNO interaction rate is $R(\\mathrm{CNO})=6.7^{+1.2}\\_{-0.8} \\, \\mathrm{cpd/100 \\, tonnes}$. Taking into account the neutrino flavor conversion, the resulting CNO neutrino flux at Earth is $\\Phi\\_\\mathrm{CNO}=6.7 ^{+1.2}\\_{-0.8} \\times 10^8 \\, \\mathrm{cm^{-2} s^{-1}}$, in agreement with the high metallicity Standard Solar Models. The results described in this work reinforce the role of the event directional information in large-scale liquid scintillator detectors and open up new avenues for the next-generation liquid scintillator or hybrid neutrino experiments.\n\n", "2307.14621": "2023-07-27, **Cosmological neutrino N-body simulations of dark matter halo**, Yu Chen et.al., [2307.14621v1](http://arxiv.org/abs/2307.14621v1)\n\n The study of massive neutrinos and their interactions is a critical aspect of contemporary cosmology. Recent advances in parallel computation and high-performance computing provide new opportunities for accurately constraining Large-Scale Structures (LSS). In this paper, we introduce the TianNu cosmological N-body simulation during the co-evolution of massive neutrino and cold dark matter components via the CUBEP$^3$M code running on the supercomputer Tianhe-2 and TianNu's connected works. We start by analyzing $2.537\\times10^7$ dark halos from the scientific data of TianNu simulation, and compare their angular momentum with the matched halos from neutrino-free TianZero, revealing a dependence of angular momentum modulus on neutrino injection at scales below 50 Mpc and around 10 Mpc.\n\n", "2307.14559": "2023-07-27, **TXS 0506+056 with Updated IceCube Data**, William Luszczak et.al., [2307.14559v1](http://arxiv.org/abs/2307.14559v1)\n\n Past results from the IceCube Collaboration have suggested that the blazar TXS 0506+056 is a potential source of astrophysical neutrinos. However, in the years since there have been numerous updates to event processing and reconstruction, as well as improvements to the statistical methods used to search for astrophysical neutrino sources. These improvements in combination with additional years of data have resulted in the identification of NGC 1068 as a second neutrino source candidate. This talk will re-examine time-dependent neutrino emission from TXS 0506+056 using the most recent northern-sky data sample that was used in the analysis of NGC 1068. The results of using this updated data sample to obtain a significance and flux fit for the 2014 TXS 0506+056 \"untriggered\" neutrino flare are reported\n\n"}, "dark matter": {"2307.15059": "2023-07-27, **Role of QCD in moduli stabilization during inflation and axion dark matter**, Ryuichiro Kitano et.al., [2307.15059v1](http://arxiv.org/abs/2307.15059v1)\n\n Ignorance of the initial condition for the axion dynamics in the early Universe has led us to consider an $O(1)$ valued initial amplitude, and that prefers the decay constant, $F\\_a$, of the QCD axion to be an intermediate scale such as $10^{12}$ GeV in order to explain the dark matter abundance. We explore a cosmological scenario of $F\\_a$ being much larger than $10^{12}$ GeV by considering the axion and moduli dynamics during inflation to set the initial amplitude. We show that if the volume moduli (radion) of the extra-dimension is stabilized mainly by the QCD contribution to the moduli potential during inflation, the QCD axion with the string-scale decay constant obtains a mass around the inflationary Hubble parameter. This means that the axion rolls down to the $\\theta = 0$ minimum during the inflation realizing almost vanishing initial amplitude, and the inflationary quantum fluctuation can be the dominant source of the current number density of axions. We find natural parameter regions where the axion explains the cold dark matter of the Universe, while the constraint on the isocurvature perturbation is avoided. The presence of the axion miniclusters or axion stars are predicted in a wide range of parameters, including the one explains the Subaru-HCS microlensing event.\n\n", "2307.15044": "2023-07-27, **Simulation-guided galaxy evolution inference: A case study with strong lensing galaxies**, Andreas Filipp et.al., [2307.15044v1](http://arxiv.org/abs/2307.15044v1)\n\n Understanding the evolution of galaxies provides crucial insights into a broad range of aspects in astrophysics, including structure formation and growth, the nature of dark energy and dark matter, baryonic physics, and more. It is, however, infeasible to track the evolutionary processes of individual galaxies in real time given their long timescales. As a result, galaxy evolution analyses have been mostly based on ensembles of galaxies that are supposed to be from the same population according to usually basic and crude observational criteria. We propose a new strategy of evaluating the evolution of an individual galaxy by identifying its descendant galaxies as guided by cosmological simulations. As a proof of concept, we examined the evolution of the total mass distribution of a target strong lensing galaxy at $z=0.884$ using the proposed strategy. We selected 158 galaxies from the IllustrisTNG300 simulation that we identified as analogs of the target galaxy. We followed their descendants and found 11 observed strong lensing galaxies that match in stellar mass and size with the descendants at their redshifts. The observed and simulated results are discussed, although no conclusive assessment is made given the low statistical significance due to the small sample size. Nevertheless, the test confirms that our proposed strategy is already feasible with existing data and simulations. We expect it to play an even more important role in studying galaxy evolution as more strong lens systems and larger simulations become available with the advent of next-generation survey programs and cosmological simulations.\n\n", "2307.14976": "2023-07-27, **Leading two-loop corrections to the Higgs di-photon decay in the Inert Doublet Model**, Masashi Aiko et.al., [2307.14976v1](http://arxiv.org/abs/2307.14976v1)\n\n Leading two-loop contributions to the di-photon decay of the Higgs boson are evaluated for the first time in the Inert Doublet Model (IDM). We employ for this calculation the Higgs low-energy theorem, meaning that we obtain corrections to the Higgs decay process by taking Higgs-field derivatives of the leading two-loop contributions to the photon self-energy. Specifically, we have included purely scalar corrections involving inert BSM Higgs bosons, as well as external-leg contributions involving both the inert scalars and fermions. Our calculation has been performed with a full on-shell renormalization, and in the gauge-less limit. We investigate our results numerically in two scenarios of the IDM: one with a light dark matter (DM) candidate (Higgs resonance scenario), and another with all additional scalars heavy (heavy Higgs scenario). In both cases, we find that the inclusion of two-loop corrections qualitatively modifies the behavior of the decay width, compared with the one-loop ($i.e.$ leading) order, and that they increase the deviation from the Standard Model. These large deviations can be tested at the High-Luminosity LHC.\n\n", "2307.14962": "2023-07-27, **Probing an ultralight QCD axion with electromagnetic quadratic interaction**, Hyungjin Kim et.al., [2307.14962v1](http://arxiv.org/abs/2307.14962v1)\n\n The axion-gluon coupling is the defining feature of the QCD axion. This feature induces additional and qualitatively different interactions of the axion with standard model particles -- quadratic couplings. Previously, hadronic quadratic couplings have been studied and experimental implications have been explored especially in the context of atomic spectroscopy and interferometry. We investigate additional quadratic couplings to the electromagnetic field and electron mass. These electromagnetic quadratic couplings are generated at the loop level from threshold corrections and are expected to be present in the absence of fine-tuning. While they are generally loop-suppressed compared to the hadronic ones, they open up new ways to search for the QCD axion, for instance via optical atomic clocks. Moreover, due to the velocity spread of the dark matter field, the quadratic nature of the coupling leads to low-frequency fluctuations in any detector setup. These distinctive low-frequency fluctuations offer a way to search for heavier axions. We provide an analytic expression for the power spectral density of this low-frequency background and briefly discuss experimental strategies for a low-frequency background search.\n\n", "2307.14881": "2023-07-27, **Constraints on dark matter and astrophysics from tomographic $γ$-ray cross-correlations**, Anya Paopiamsap et.al., [2307.14881v1](http://arxiv.org/abs/2307.14881v1)\n\n We study the cross-correlation between maps of the unresolved $\\gamma$-ray background constructed from the 12-year data release of the Fermi Large-Area Telescope, and the overdensity of galaxies in the redshift range $z\\lesssim0.4$ as measured by the 2MASS Photometric Redshift survey and the WISE-SuperCOSMOS photometric survey. A signal is detected at the $8-9\\sigma$ level, which we interpret in terms of both astrophysical $\\gamma$-ray sources, and WIMP dark matter decay and annihilation. The sensitivity achieved allows us to characterise the energy and redshift dependence of the signal, and we show that the latter is incompatible with a pure dark matter origin. We thus use our measurement to place an upper bound on the WIMP decay rate and the annihilation cross-section, finding constraints that are competitive with those found in other analyses. Our analysis is based on the extraction of clean model-independent observables that can then be used to constrain arbitrary astrophysical and particle physics models. In this sense we produce measurements of the $\\gamma$-ray emissivity as a function of redshift and rest-frame energy $\\epsilon$, and of a quantity $F(\\epsilon)$ encapsulating all WIMP parameters relevant for dark matter decay or annihilation. We make these measurements, together with a full account of their statistical uncertainties, publicly available.\n\n", "2307.14873": "2023-07-27, **Multicomponent Scalar Dark Matter with an Extended Gauge Sector**, Baradhwaj Coleppa et.al., [2307.14873v1](http://arxiv.org/abs/2307.14873v1)\n\n We consider an extension of the Standard Model of particle physics with an additional $SU(2)$ gauge sector along with an additional scalar bidoublet and a non-linear sigma field. The neutral components of the bidoublet serve as dark matter candidates by virtue of the bidoublet being odd under a $Z\\_2$ symmetry. Generic beyond Standard Model constraints like vacuum stability, invisible decay of higgs, Higgs alignment limit and collider constraints on heavy gauge bosons restrict the parameter space of this model. In this multicomponent dark matter scenario, we investigate the interplay between the annihilation and co-annihilation channels originating from the new gauge sector as those contribute to the relic abundance. We also inspect the direct detection constraints on scattering cross-sections of the dark matter particles with the detector nucleons and present our observations.\n\n", "2307.14865": "2023-07-27, **Search for Light Dark Matter with accelerator and direct detection experiments: comparison and complementarity of recent results**, S. ~N. ~Gninenko et.al., [2307.14865v1](http://arxiv.org/abs/2307.14865v1)\n\n We discuss the most sensitive constraints on Light Dark Matter (LDM) from accelerator experiments NA64 and BaBar and compare it with recent results from direct searches at XENON1T, DAMIC-M, SuperCDMS, and DarkSide-50. We show that for the dark photon ($A'$) model with scalar LDM, NA64 gives more stringent bounds for $A'$ masses $m\\_{A'} \\leq 0.15~GeV$ than direct searches. Moreover, for the case of Majorana LDM the damping DM velocity $v$ factor, $v^2 \\sim O(10^{-6})$, for the elastic LDM electron(nucleon) cross section makes direct observation of Majorana LDM extremely challenging, while the absence of this suppression in the NA64 case gives an advantage to the experiment. The similar situation takes place for pseudo-Dirac LDM. The BaBar provides the most stringent bounds for $A'$ masses $m\\_{A'} \\geq 0.35~GeV$. For scalar LDM the direct detection experiments give more stringent bounds at $m\\_{A'} \\geq 0.35~GeV$ while for Majorana and pseudo-Dirac LDM case, the BaBar bounds are more stringent. The complementarity of the two approaches in searching for LDM is underlined.\n\n", "2307.14862": "2023-07-27, **Compact Stars with Dark Energy in General Relativity and Modified Gravity**, Artyom V. Astashenok et.al., [2307.14862v1](http://arxiv.org/abs/2307.14862v1)\n\n We investigate realistic models of compact objects, focusing on neutron and strange stars, composed by dense matter and dark energy in the form of a simple fluid or scalar field interacting with matter. For the dark energy component, we use equations of state compatible with cosmological observations. This requirement strongly constrains possible deviations from the simple $\\Lambda$-Cold Dark-Matter model with EoS $p\\_{d}=-\\rho\\_{d}$ at least for small densities of the dark component. But we can propose that the density of dark energy interacting with matter can reach large values in relativistic stars and affects the star parameters such as the mass and radius. Simple models of dark energy are considered. Then we investigated possible effects from modified gravity choosing to study the $R^2$ model combined with dark energy. Finally, the case of dark energy as scalar field non-minimally interacting with gravity is considered.\n\n", "2307.14861": "2023-07-27, **TDiff in the Dark: Gravity with a scalar field invariant under transverse diffeomorphisms**, Darío Jaramillo-Garrido et.al., [2307.14861v1](http://arxiv.org/abs/2307.14861v1)\n\n We reflect on the possibility of having a matter action that is invariant only under transverse diffeomorphisms. This possibility is particularly interesting for the dark sector, where no restrictions arise based on the weak equivalence principle. In order to implement this idea we consider a scalar field which couples to gravity minimally but via arbitrary functions of the metric determinant. We show that the energy-momentum tensor of the scalar field takes the perfect fluid form when its velocity vector is time-like. We analyze the conservation of this tensor in detail, obtaining a seminal novel result for the energy density of this field in the kinetic dominated regime. Indeed, in this regime the fluid is always adiabatic and we obtain an explicit expression for the speed of sound. Furthermore, to get insight in the gravitational properties of these theories, we consider the fulfillment of the energy conditions, concluding that nontrivial physically reasonable matter violates the strong energy condition in the potential domination regime. On the other hand, we present some shift-symmetric models of particular interest. These are: constant equation of state models (which may provide us with a successful description of dark matter or dark radiation) and models presenting different gravitational domains (characterized by the focusing or possible defocusing of time-like geodesics), as it happens in unified dark matter-energy models.\n\n", "2307.14811": "2023-07-27, **Fate of homogeneous $Z_2$-symmetric scalar condensates**, Wen-Yuan Ai et.al., [2307.14811v1](http://arxiv.org/abs/2307.14811v1)\n\n Dark Matter, if represented by a $Z\\_2$-symmetric scalar field, can manifest as both particles and condensates. In this paper, we study the evolution of an oscillating homogeneous condensate of a $Z\\_2$-symmetric scalar field in a thermal plasma in an FLRW universe. We focus on the perturbative regime where the oscillation amplitude is sufficiently small so that parametric resonance is inefficient. This perturbative regime necessarily comprises the late stage of the condensate decay and determines its fate. The coupled coarse-grained equations of motion for the condensate, radiation, and spacetime are derived from first principles using nonequilibrium quantum field theory. We obtain analytical expressions for the relevant microscopic quantities that enter the equations of motion and solve the latter numerically. We find that there is always a nonvanishing relic abundance for a $Z\\_2$-symmetric condensate because its decay rate decreases faster than the Hubble parameter at late times due to either the amplitude-dependence or the temperature-dependence in the condensate decay rate. Consequently, accounting for the condensate contribution to the overall Dark Matter relic density is essential for $Z\\_2$ scalar singlet Dark Matter. Unlike normal thermal freeze-out for particles, the condensate relic density depends on the initial condition which we take as arbitrary in the present work provided that it falls within the perturbative regime.\n\n", "2307.14691": "2023-07-27, **Constraints on the Parameters of Modified Chaplygin-Jacobi and Modified Chaplygin-Abel Gases in $f(T)$ Gravity Model**, Himanshu Chaudhary et.al., [2307.14691v1](http://arxiv.org/abs/2307.14691v1)\n\n In this study, we investigate two dark energy models, MCJG and MCAG, in the context of $f(T)$ gravity within a non-flat FLRW Universe. Our analysis considers radiation, dark matter, and dark energy components. We compare the equation of state for MCJG and MCAG with $f(T)$ gravity. Using recent astronomical data (e.g., $H(z)$, type Ia supernovae, Gamma Ray Bursts, quasars, and BAO), we constrain the models' parameters and explore the Universe's behavior. The reduced Hubble parameter is expressed in terms of observable parameters like $\\Omega\\_{r0}$, $\\Omega\\_{m0}$, $\\Omega\\_{k0}$, $\\Omega\\_{CJ0}$, $\\Omega\\_{CA0}$, and $H\\_0$. We investigate cosmic evolution using deceleration, $\\mathrm{Om}$, and statefinder diagnostics. Information criteria are employed to assess model viability, comparing against the standard $\\Lambda$CDM model. Our objective is to deepen our understanding of dark energy, its relation to $f(T)$ gravity, and the mechanisms governing the accelerated expansion of the Universe.\n\n"}, "supernova": {"2307.14802": "2023-07-27, **The state of the dark energy equation of state circa 2023**, Luis A. Escamilla et.al., [2307.14802v1](http://arxiv.org/abs/2307.14802v1)\n\n We critically examine the state of current constraints on the dark energy (DE) equation of state (EoS) $w$. Our study is partially motivated by the observation that, while broadly consistent with the cosmological constant value $w=-1$, several independent probes appear to point towards a slightly phantom EoS ($w \\sim -1.03$). We pay attention to the apparent preference for phantom DE from Planck Cosmic Microwave Background (CMB) data alone, whose origin we study in detail and attribute to a wide range of (physical and geometrical) effects. We deem the combination of Planck CMB, Baryon Acoustic Oscillations, Type Ia Supernovae, and Cosmic Chronometers data to be particularly trustworthy, inferring from this final consensus dataset $w=-1.013^{+0.038}\\_{-0.043}$, in excellent agreement with the cosmological constant value. Overall, despite a few scattered hints, we find no compelling evidence forcing us away from the cosmological constant (yet).\n\n", "2307.14691": "2023-07-27, **Constraints on the Parameters of Modified Chaplygin-Jacobi and Modified Chaplygin-Abel Gases in $f(T)$ Gravity Model**, Himanshu Chaudhary et.al., [2307.14691v1](http://arxiv.org/abs/2307.14691v1)\n\n In this study, we investigate two dark energy models, MCJG and MCAG, in the context of $f(T)$ gravity within a non-flat FLRW Universe. Our analysis considers radiation, dark matter, and dark energy components. We compare the equation of state for MCJG and MCAG with $f(T)$ gravity. Using recent astronomical data (e.g., $H(z)$, type Ia supernovae, Gamma Ray Bursts, quasars, and BAO), we constrain the models' parameters and explore the Universe's behavior. The reduced Hubble parameter is expressed in terms of observable parameters like $\\Omega\\_{r0}$, $\\Omega\\_{m0}$, $\\Omega\\_{k0}$, $\\Omega\\_{CJ0}$, $\\Omega\\_{CA0}$, and $H\\_0$. We investigate cosmic evolution using deceleration, $\\mathrm{Om}$, and statefinder diagnostics. Information criteria are employed to assess model viability, comparing against the standard $\\Lambda$CDM model. Our objective is to deepen our understanding of dark energy, its relation to $f(T)$ gravity, and the mechanisms governing the accelerated expansion of the Universe.\n\n"}}