{"neutrino": {"2408.10926": "2024-08-20, **GRANDlib: A simulation pipeline for the Giant Radio Array for Neutrino Detection (GRAND)**, GRAND Collaboration et.al., [2408.10926v1](http://arxiv.org/abs/2408.10926v1)\n\n The operation of upcoming ultra-high-energy cosmic-ray, gamma-ray, and neutrino radio-detection experiments, like the Giant Radio Array for Neutrino Detection (GRAND), poses significant computational challenges involving the production of numerous simulations of particle showers and their detection, and a high data throughput. GRANDlib is an open-source software tool designed to meet these challenges. Its primary goal is to perform end-to-end simulations of the detector operation, from the interaction of ultra-high-energy particles, through -- by interfacing with external air-shower simulations -- the ensuing particle shower development and its radio emission, to its detection by antenna arrays and its processing by data-acquisition systems. Additionally, GRANDlib manages the visualization, storage, and retrieval of experimental and simulated data. We present an overview of GRANDlib to serve as the basis of future GRAND analyses.\n\n", "2408.10910": "2024-08-20, **Optimised neutron yield calculations from ($α,n$) reactions with the modified SOURCES4 code**, Mihaela Parvu et.al., [2408.10910v1](http://arxiv.org/abs/2408.10910v1)\n\n The sensitivity of underground experiments searching for rare events such as dark matter, neutrino interactions or several beyond the standard model phenomena is often limited by the background caused by neutrons from spontaneous fission and ($\\alpha,n$) reactions. A number of codes exist to calculate neutron yields and energy spectra due to these processes. In this paper we present new calculations of neutron production using the modified SOURCES4A code with recently updated cross-sections for ($\\alpha,n$) reactions and the comparison of the results with available experimental data. The cross-sections for ($\\alpha,n$) reactions in SOURCES4 have been taken from reliable experimental data where possible, complemented by the calculations with EMPIRE 2.19/3.2.3, TALYS 1.96 or evaluated data library JENDL-5 where the data were scarce or unavailable.\n\n", "2408.10828": "2024-08-20, **Scalable DAQ system operating the CHIPS-5 neutrino detector**, Belén Alonso Rancurel et.al., [2408.10828v1](http://arxiv.org/abs/2408.10828v1)\n\n The CHIPS R&D project focuses on development of low-cost water Cherenkov neutrino detectors through novel design strategies and resourceful engineering. This work presents an end-to-end DAQ solution intended for a recent 5 kt CHIPS prototype, which is largely based on affordable mass-produced components. Much like the detector itself, the presented instrumentation is composed of modular arrays that can be scaled up and easily serviced. A single such array can carry up to 30 photomultiplier tubes (PMTs) accompanied by electronics that generate high voltage in-situ and deliver time resolution of up to 0.69 ns. In addition, the technology is compatible with the White Rabbit timing system, which can synchronize its elements to within 100 ps. While deployment issues did not permit the presented DAQ system to operate beyond initial evaluation, the presented hardware and software successfully passed numerous commissioning tests that demonstrated their viability for use in a large-scale neutrino detector, instrumented with thousands of PMTs.\n\n", "2408.10632": "2024-08-20, **Neutrino Mass Origin and Flavored-QCD axion in an Extra-Dimension**, Y. H. Ahn et.al., [2408.10632v1](http://arxiv.org/abs/2408.10632v1)\n\n We propose a unified flavor model with the Standard Model fields on two 3-branes within an extra-dimensional setup, incorporating $\\Gamma\\_N\\times U(1)\\_X$ symmetry with a modulus and scalar field responsible for symmetry breaking. When compactified to four dimensions, Yukawa couplings, initially expressed as modular forms with mass dimensions, are normalized to conform to canonical four-dimensional theory, with the Yukawa coefficients being complex numbers of unit absolute value. We show that this model naturally explains the mass and mixing hierarchies of quarks and leptons, solves the strong CP problem, provides a natural solution to the hierarchy problem, and can inherently satisfy no axionic domain-wall problem. The $U(1)\\_X$ mixed gravitational anomaly-free condition necessitates that electrically neutral mirror bulk fermions couple to the normal neutrino field on the 3-brane, consistent with the boundary condition. Consequently, we demonstrate a mechanism for generating light neutrino masses, similar to the Weinberg operator, by transmitting the information of $U(1)\\_X$ breakdown between the two 3-branes. The scale of $U(1)\\_X$ breaking is estimated from neutrino data to be around $10^{15}$ GeV, leading to a QCD axion mass of approximately $2.5\\times10^{-9}$ eV. Through numerical analysis, we demonstrate that the model yields results consistent with current experimental data on quarks and leptons, and it also provides predictions for neutrinos.\n\n", "2408.10621": "2024-08-20, **Analyses of Neutrino Masses in the CP-Violating Standard Model**, Chilong Lin et.al., [2408.10621v1](http://arxiv.org/abs/2408.10621v1)\n\n This article examines the patterns of neutrino masses within the framework of an analytically solvable, CP-violating Standard Model (CPVSM). Using two experimentally determined mass-squared differences (MSDs), $\\Delta\\_a$ and $\\Delta\\_b$, three neutrino masses are predicted.   In the CPVSM, when $\\bf C$ = 0, or equivalently $\\gamma$ = 0, two of the three mass eigenvalues within a fermion type become degenerate. This suggests that the splitting of these masses may have resulted from a symmetry-breaking event in the early universe.   The study explores all six possible correspondences between the experimentally observed $\\Delta\\_a$ and $\\Delta\\_b$ and three quantities $\\Delta\\_{hl}$, $\\Delta\\_{ml}$, and $\\Delta\\_{hm}$. Of these six scenarios, four provide reasonable predictions for the neutrino masses, while two are logically excluded. The model predicts similar values for the heaviest neutrino mass, $m\\_h \\approx 5.0 \\cdot 10^{-2}$ eV, and the lightest mass, $m\\_l \\approx 6.091 \\cdot 10^{-3}$ eV. However, it offers two possible values for the middle mass: $m\\_m \\approx 4.973 \\cdot 10^{-2}$ eV or $m\\_m \\approx 1.055 \\cdot 10^{-2}$ eV. Additionally, CP violation in the lepton sector is predicted to be about 73 orders of magnitude weaker than that in the quark sector.\n\n", "2408.09658": "2024-08-19, **Sensitivity of WIMP bounds on the velocity distribution in the limit of a massless mediator**, Koun Choi et.al., [2408.09658v1](http://arxiv.org/abs/2408.09658v1)\n\n We discuss the sensitivity of the bounds on the spin-independent (SI) and spin-dependent (SD) WIMP-proton and WIMP-neutron interaction couplings $\\alpha\\_{SI, SD}^{p,n}$ on the WIMP velocity distribution for a massless mediator in the propagator by combining direct detection and the neutrino signal from WIMP annihilation in the Sun (fixing the annihilation channel to $b\\bar{b}$). We update the bounds in the Standard Halo Model (SHM) and using the halo-independent single-stream method. In the case of a massless mediator the SHM capture rate in the Sun diverges and is regularized by removing the contribution of WIMPs locked into orbits that extend beyond the Sun-Jupiter distance. We discuss the dependence of the SHM bounds on the Jupiter cut showing that it can be sizeable for $\\alpha\\_{\\rm SD}^p$ and a WIMP mass $m\\_\\chi$ exceeding 1 TeV. Our updated SHM bounds show an improvement between about two and three orders of magnitude compared to the previous ones in the literature. Our halo-independent analysis shows that, with the exception of $\\alpha\\_{\\rm SD}^p$ at large $m\\_\\chi$, the relaxation of the bounds compared to the SHM is of the same order of that for contact interactions, i.e. relatively moderate in the low and high WIMP mass regimes and as large as a few $\\times\\sim 10^2$ for $m\\_\\chi\\simeq$ 30 GeV. On the other hand, the exact determination of the relaxation of the bound becomes not reliable for $\\alpha\\_{\\rm SD}^p$ and $m\\_\\chi\\gtrsim$ 1 TeV due to the sensitivity of the SHM capture rate in the Sun to the details of the Maxwellian velocity distribution at low incoming WIMP speeds. The halo-independent bounds do not depend on the Jupiter cut needed to regularize the calculation of the capture rate.\n\n"}, "dark matter": {"2408.10983": "2024-08-20, **Search for GeV gamma-ray emission from SPT-CL J2012-5649 with six years of DAMPE data**, Siddhant Manna et.al., [2408.10983v1](http://arxiv.org/abs/2408.10983v1)\n\n We search for gamma-ray emission from the galaxy cluster SPT-CL J2012-5649 in the energy range from 3 GeV to 1 TeV using the DArk Matter Particle Explorer (DAMPE) telescope. For our analysis, we use three different templates: point source, radial disk and radial Gaussian. We do not detect a signal with significance $>3\\sigma$ for any of these templates at any location with $R\\_{200}$ of the cluster center. We obtain 95\\% c.l. upper limit on the energy flux between $\\sim 10^{-6}$ and $10^{-4} \\rm{MeV~cm^{-2}~s^{-1}}$ depending on the energy range. These upper limits are consistent with the a non-zero flux detected by Fermi-LAT (at $6\\sigma$ significance) for this cluster. This work represents the first proof of principle search for gamma-ray emission from a single galaxy cluster using DAMPE data.\n\n", "2408.10799": "2024-08-20, **Excluding Primordial Black Holes as Dark Matter Based on Solar System Ephemeris**, Abraham Loeb et.al., [2408.10799v1](http://arxiv.org/abs/2408.10799v1)\n\n Current cosmological constraints allow primordial black holes (PBHs) to constitute dark matter in the mass range of 10^{18}-10^{22}g. We show that a major portion of this logarithmic window can be ruled-out based on the Solar System ephemeris, given that the external mass enclosed within 50 au from the Sun did not change by more than ~5x10^{-14} solar masses per year in recent decades.\n\n", "2408.10735": "2024-08-20, **On the kinematic nature of apparent discs at high redshifts: Local counterparts are not dominated by ordered rotation but by tangentially anisotropic random motion**, Bitao Wang et.al., [2408.10735v1](http://arxiv.org/abs/2408.10735v1)\n\n It is not straightforward to physically interpret the apparent morphology of galaxies. Recent observations by James Webb Space Telescope (JWST) revealed a dominant galaxy population at high redshifts ($z>2$) that were visually classified as discs for their flattened shapes and/or exponential light profiles. The extensively accepted interpretation is that they are dynamically cold discs supported by bulk rotation. However, it is long known that flattened shapes and exponential profiles are not exclusive for rotating disc structure. To break degeneracy and assess the rotational support of typical high-$z$ galaxies in the JWST samples, those with active star formation and stellar masses $\\mathrm{lg}(\\mathcal{M}\\_{\\star}/\\mathcal{M}\\_{\\odot})\\sim9$, we study the kinematics of their equal-mass counterparts at $z=0$. While these local star-forming low-mass galaxies are photometrically similar to real dynamically cold discs, they are not supported by ordered rotation but primarily by random motion, and their flattened shapes result largely from tangential orbital anisotropy. Given the empirical and theoretical evidence that young galaxies are dynamically hotter at higher redshifts, our results suggest that the high-$z$ JWST galaxies may not be cold discs but are dynamically warm/hot galaxies with flattened shapes driven by anisotropy. While both having low rotational support, local low-mass galaxies possess oblate shapes, contrasting the prolate shapes (i.e. cigar-like) of low-mass systems at high redshifts. Such shape transition (prolate$\\Rightarrow$oblate) indicates an associated change in orbital anisotropy (radial$\\Rightarrow$tangential), with roots likely in the assembly of their host dark matter halos.\n\n", "2408.10585": "2024-08-20, **Probing Non-Thermal Gravitinos Through Large-Scale Structure Observations**, Weiyi Deng et.al., [2408.10585v1](http://arxiv.org/abs/2408.10585v1)\n\n We investigate the effects of non-thermally produced dark matter on large-scale structure formation, focusing on the gravitino dark matter. Our analysis shows that large-scale structure measurements from the SDSS LRG data offer a promising approach to probing non-thermally produced gravitinos. Specifically, if gravitinos resulting from neutralino decay constitute a fraction $F\\_\\text{dec}=0.35~(0.1)$ of the dark matter component, the data exclude bino-like neutralino with a mass $m\\_{\\chi\\_1^0}\\lesssim11~(25)\\text{ GeV}$. Furthermore, this constraint appears to be largely independent of the gravitino mass.\n\n", "2408.10559": "2024-08-20, **An Accreting Supermassive Black Hole Buried in a Faint Dwarf Galaxy**, Abhishek Paswan et.al., [2408.10559v1](http://arxiv.org/abs/2408.10559v1)\n\n In the last decade, there have been several discoveries of Active Galactic Nuclei (AGN) in dwarf galaxies including an AGN in an ultra-compact dwarf galaxy with a Black Hole mass $>$10$^{6}$ M$\\_{\\odot}$. However, finding a Supermassive Black Hole (SMBH) in a dwarf Low Surface Brightness (LSB) galaxy is rare. We report the discovery of a Seyfert type-2 class AGN which is associated with a nuclear SMBH of mass $\\sim$6.5 $\\times$ 10$^{6}$ M$\\_{\\odot}$ in a dwarf LSB galaxy ($\\mu\\_{0,r}$ $>$ 23.8 mag/arcsec$^{2}$) that we denote by MJ0818+2257. The galaxy was previously thought to be an outlying emission blob around the large spiral galaxy LEDA 1678924. In our current analysis, which includes the detection of the optical counterpart of MJ0818+2257, we study its ionized gas kinematics and find that the dynamical mass within the ionized gas disk is $\\sim$5.3 $\\times$ 10$^{9}$ M$\\_{\\odot}$. This is comparable to its stellar mass which is $\\sim$3$\\times$ 10$^{9}$ M$\\_{\\odot}$ and suggests that MJ0818+2257 is moderately dark matter-dominated within the stellar disk. The SMBH mass to galaxy stellar mass ratio is $M\\_{BH}/M(*)>0.022$ which is high compared to disk galaxies. Our detection of a SMBH in a bulgeless LSB dwarf galaxy raises questions about the growth of SMBHs in low-luminosity galaxies and suggests the possibility of detecting heavy, seed black holes from early epochs in LSB dwarf galaxies in the low redshift universe.\n\n", "2408.10379": "2024-08-19, **Testable predictions of outside-in age gradients in dwarf galaxies of all types**, Claire L. Riggs et.al., [2408.10379v1](http://arxiv.org/abs/2408.10379v1)\n\n We use a sample of 73 simulated satellite and central dwarf galaxies spanning a stellar mass range of $10^{5.3}-10^{9.1} M\\_\\odot$ to investigate the origin of their stellar age gradients. We find that dwarf galaxies often form their stars \"inside-out,\" i.e., the stars form at successively larger radii over time. However, the oldest stars get reshuffled beyond the star forming radius by fluctuations in the gravitational potential well caused by stellar feedback (the same mechanisms that cause dwarfs to form dark matter cores). The result is that many dwarfs appear to have an \"outside-in\" age gradient at $z=0$, with younger stellar populations more centrally concentrated. However, for the reshuffled galaxies with the most extended star formation, young stars can form out to the large radii to which the old stars have been reshuffled, erasing the age gradient. We find that major mergers do not play a significant role in setting the age gradients of dwarfs. We find similar age gradient trends in satellites and field dwarfs, suggesting environment plays only a minor role, if any. Finally, we find that the age gradient trends are imprinted on the galaxies at later times, suggesting that the stellar reshuffling dominates after the galaxies have formed 50% of their stellar mass. The later reshuffling is at odds with results from the FIRE-2 simulations. Hence, age gradients offer a test of current star formation and feedback models that can be probed via observations of resolved stellar populations.\n\n", "2408.10358": "2024-08-19, **The All-Sky Impact of the LMC on the Milky Way Circumgalactic Medium**, Christopher Carr et.al., [2408.10358v1](http://arxiv.org/abs/2408.10358v1)\n\n The first infall of the LMC into the Milky Way (MW) represents a large and recent disruption to the MW circumgalactic medium (CGM). In this work, we use idealized, hydrodynamical simulations of a MW-like CGM embedded in a live dark matter halo with an infalling LMC-like satellite initialized with its own CGM to understand how the encounter is shaping the global physical and kinematic properties of the MW CGM. First, we find that the LMC sources order-unity enhancements in MW CGM density, temperature, and pressure from a $\\mathcal{M} \\approx 2$ shock from the supersonic CGM-CGM collision, extending from the LMC to beyond $\\sim R\\_{\\rm 200, MW}$, enhancing column densities, X-ray brightness, the thermal Sunyaev-Zeldovich (tSZ) distortion, and potentially synchrotron emission from cosmic rays over large angular scales across the Southern Hemisphere. Second, the MW's reflex motion relative to its outer halo produces a dipole in CGM radial velocities, with $v\\_{\\rm R} \\pm 30-50$ km/s at $R > 50$ kpc in the Northern/Southern hemispheres respectively, consistent with measurements in the stellar halo. Finally, ram pressure strips most of the LMC CGM gas by the present day, leaving $\\sim 10^{8-9} M\\_{\\odot}$ of warm, ionized gas along the past orbit of the LMC moving at high radial and/or tangential velocities $\\sim 50-100$ kpc from the MW. Massive satellites like the LMC leave their mark on the CGM structure of their host galaxies, and signatures from this interaction may manifest in key all-sky observables of the CGM of the MW and other massive galaxies.\n\n", "2408.10324": "2024-08-19, **Search for fast-oscillating fundamental constants with space missions**, Dmitry Budker et.al., [2408.10324v1](http://arxiv.org/abs/2408.10324v1)\n\n While it is possible to estimate the dark matter density at the Sun distance from the galactic center, this does not give information on actual dark matter density in the Solar system. There can be considerable local enhancement of dark matter density in the vicinity of gravitating centers, including the Sun, the Earth, as well as other planets in the solar system. Generic mechanisms for the formation of such halos were recently elucidated. In this work, we studies the possible halo dark matter overdensities and corresponding dark matter masses allowed for various objects in the solar system. We explore spacecraft missions to detect such halos with instruments such as quantum clocks, atomic and molecular spectrometers designed to search for fast (tens of hertz to gigahertz) oscillations of fundamental constants, highly sensitive comagnetometers, and other quantum sensors and sensor networks.\n\n", "2408.10316": "2024-08-19, **Project Dinos II: Redshift evolution of dark and luminous matter density profiles in strong-lensing elliptical galaxies across $0.1 < z < 0.9$**, William Sheu et.al., [2408.10316v1](http://arxiv.org/abs/2408.10316v1)\n\n We present a new measurement of the dark and luminous matter distribution of massive elliptical galaxies, and their evolution with redshift, by combining strong lensing and dynamical observables. Our sample of 58 lens galaxies covers a redshift range of $0.090\\leq z\\_{\\rm l}\\leq0.884$. By combining new Hubble Space Telescope imaging with previously observed velocity dispersion and line-of-sight measurements, we decompose the luminous matter profile from the dark matter profile and perform a Bayesian hierarchical analysis to constrain the population-level properties of both profiles. We find that the inner slope of the dark matter density profile (\"cusp\"; $\\rho\\_{\\rm DM}\\propto r^{-\\gamma\\_{\\rm in}}$) is slightly steeper ($\\mu\\_{\\gamma\\_{\\rm in}}=1.18^{+0.03}\\_{-0.03}$ at $z=0.35$ with $\\leq0.16$ intrinsic scatter) than a standard Navarro$-$Frenk$-$White (NFW; $\\gamma\\_{\\rm in}=1$), with an appreciable evolution with redshift ($d\\log(\\gamma\\_{\\rm in})/dz=-0.33\\pm0.13$) and is consistent with NFW-like distributions at higher redshifts ($z\\geq0.56$ for $\\leq1\\sigma$ consistency). Additionally, we find the stellar mass-to-light ratio at the population level consistent with that of a Salpeter initial mass function, a small stellar mass-to-light gradient ($\\kappa\\_{*}(r)\\propto r^{-\\eta}$, with $\\overline{\\eta}\\leq9.4\\times10^{-3}$), and isotropic stellar orbits. Our averaged total mass density profile is consistent with a power-law profile within $0.25-4$ Einstein radii ($\\overline{\\gamma}=2.14\\pm0.06$), with an internal mass-sheet transformation parameter $\\overline{\\lambda}=1.02\\pm0.01$ consistent with no mass sheet. Our findings confirm the validity of the standard mass models used for time-delay cosmography. However, our results are in strong tension with predictions from hydrodynamical simulations such as IllustrisTNG, highlighting the need to better understand the formation of massive galaxies.\n\n", "2408.10296": "2024-08-19, **Star Shearing Season -- Transient Signals in Wave-like Dark Matter Experiments from Black Hole Formation**, Arturo de Giorgi et.al., [2408.10296v1](http://arxiv.org/abs/2408.10296v1)\n\n Ordinary matter coupled to light weakly interacting bosons can lead to the formation of a macroscopic bosonic field in the vicinity of large matter concentrations such as ordinary or neutron stars. When these objects are turned into black holes due to a supernova or a binary merger this ''hair'' could be ''shorn'' off. Part of the field configuration would then be released leading to an outgoing field wave. For small masses this field transient remains rather compact and can induce a transient signal in experiments, in particular those that look for wave-like dark matter. This signal can be correlated with the corresponding astrophysical signal of the event. In this note, we consider a variety of couplings and the associated signals and estimate the corresponding sensitivities.\n\n", "2408.10102": "2024-08-19, **From Low- to High-Frequency QPOs around the Non-Rotating Hairy Horndeski Black Hole: Microquasar GRS 1915+105**, Orhan Donmez et.al., [2408.10102v1](http://arxiv.org/abs/2408.10102v1)\n\n Research on the Horndeski black hole, associated with the scalar hairy parameter, offers insights into enigmatic cosmic phenomena such as dark matter. Additionally, the numerical study of the GRS 1915+105 source, which exhibits continuous variability in X-ray observations, along with its physical properties and mechanisms behind Quasi-periodic oscillations (QPOs) frequencies, can contribute to observational studies. Motivated by this, we examine the variations in physical mechanisms around the non-rotating Horndeski black hole with Bondi-Hoyle-Lyttleton (BHL) accretion related to the scalar hair parameter and the resulting QPO frequencies. With a decrease in the scalar hair parameter, the shock cone opening angle narrows due to the influence of the scalar field potential, and the stagnation point within the cone moves closer to the black hole horizon. With the changing scalar hair parameter, the simultaneous formation of the shock cone and bow shock is observed. Due to the intense increase in scalar potential, both the shock cone and bow shock disappeared, and a cavity surrounding the black hole forms in the area where the shock cone was. Additionally, QPO oscillations induced by the physical mechanisms observed in relation to the hair parameter are revealed through numerical simulations. A broad range of QPO frequencies is observed, from low to high frequencies, with resonance states like 3:2 occurring. Lastly, we define the potential range of the spin parameter for the GRS 1915+105 source based on the agreement between observational and numerical results. It has also been found that for most of the QPOs obtained from numerical calculations to be consistent with observations, h/M should be greater than -0.5.\n\n", "2408.09977": "2024-08-19, **Newtonian Gravity and Galaxy Rotation Curves: An Axisymmetric Green's Function Perspective**, Jan Govaerts et.al., [2408.09977v1](http://arxiv.org/abs/2408.09977v1)\n\n The standard proposal within the context of General relativity and its weak field Newtonian limit for the nature of dark matter is that it consists of dark matter particles of unknown type. In the present work and specifically for spiral galaxy rotation curves, an alternative possibility is explored, in the form of an axially symmetric vortex mass distribution of finite extent threading the centre of the galaxy and perpendicular to its disk. Some general considerations are developed and characteristic properties are identified, pointing to the potential interest of such an alternative to be studied in earnest.\n\n", "2408.09806": "2024-08-19, **Improved background modeling for dark matter search with COSINE-100**, G. H. Yu et.al., [2408.09806v1](http://arxiv.org/abs/2408.09806v1)\n\n COSINE-100 aims to conclusively test the claimed dark matter annual modulation signal detected by DAMA/LIBRA collaboration. DAMA/LIBRA has released updated analysis results by lowering the energy threshold to 0.75 keV through various upgrades. They have consistently claimed to have observed the annual modulation. In COSINE-100, it is crucial to lower the energy threshold for a direct comparison with DAMA/LIBRA, which also enhances the sensitivity of the search for low-mass dark matter, enabling COSINE-100 to explore this area. Therefore, it is essential to have a precise and quantitative understanding of the background spectrum across all energy ranges. This study expands the background modeling from 0.7 to 4000 keV using 2.82 years of COSINE-100 data. The modeling has been improved to describe the background spectrum across all energy ranges accurately. Assessments of the background spectrum are presented, considering the nonproportionality of NaI(Tl) crystals at both low and high energies and the characteristic X-rays produced by the interaction of external backgrounds with materials such as copper. Additionally, constraints on the fit parameters obtained from the alpha spectrum modeling fit are integrated into this model. These improvements are detailed in the paper.\n\n", "2408.09784": "2024-08-19, **Apostle--Auriga: Effects of stellar feedback subgrid models on the evolution of angular momentum in disc galaxies**, Hang Yang et.al., [2408.09784v1](http://arxiv.org/abs/2408.09784v1)\n\n Utilizing the Apostle--Auriga simulations, which start from the same zoom-in initial conditions of Local Group-like systems but run with different galaxy formation subgrid models and hydrodynamic solvers, we study the impact of stellar feedback models on the evolution of angular momentum in disc galaxies. At $z = 0$, Auriga disc galaxies tend to exhibit higher specific angular momenta compared to their cross-matched Apostle counterparts. By tracing the evolution history of the Lagrangian mass tracers of the in-situ star particles in the $z = 0$ galaxies, we find that the specific angular momentum distributions of the gas tracers from the two simulations at the halo accretion time are relatively similar. The present-day angular momentum difference is mainly driven by the physical processes occurring inside dark matter haloes, especially galactic fountains. Due to the different subgrid implementations of stellar feedback processes, Auriga galaxies contain a high fraction of recycled gas tracers (${\\sim} 65$ per cent) which could acquire angular momentum through mixing with the high angular momentum circumgalactic medium (CGM). In Apostle, however, the fraction of recycled gas tracers is significantly lower (down to ${\\sim} 20$ per cent for Milky Way-sized galaxies) and the angular momentum acquisition from the CGM is marginal. As a result, the present-day Auriga galaxies overall have higher specific angular momenta.\n\n"}, "supernova": {"2408.11014": "2024-08-20, **Identifying jittering-jet-shaped ejecta in the Cygnus Loop supernova remnant**, Dmitry Shishkin et.al., [2408.11014v1](http://arxiv.org/abs/2408.11014v1)\n\n Analyzing images of the Cygnus Loop, a core-collapse supernova (CCSN) remnant, in different emission bands, we identify a point-symmetrical morphology composed of three symmetry axes that we attribute to shaping by three pairs of jets. The main jet axis has an elongated S shape, appearing as a faint narrow zone in visible and UV. We term it the S-shaped hose, and the structure of three symmetry lines, the point-symmetric wind rose. The two other lines connect a protrusion (an ear or a bulge) with a hole on the opposite side of the center (a nozzle or a cavity), structures that we identify in the X-ray, UV, visible, IR, and/or radio images. There is a well-known blowout at the southern end of the S-shaped hose, and we identify a possible opposite blowout at the northern end of the S-shaped hose. The point-symmetrical morphology of the Cygnus Loop is according to the expectation of the jittering jets explosion mechanism (JJEM) of CCSNe, where several to few tens of pairs of jets with stochastically varying directions explode the star. The three pairs of jets that shaped the wind-rose structure of the Cygnus Loop are the last energetic pairs of this series of jets. Our study further supports the JJEM as the main explosion mechanism of CCSNe.\n\n", "2408.10981": "2024-08-20, **Local two-dimensional simulations of the ignition of a helium shell detonation on a white dwarf by an impacting stream**, Nethra Rajavel et.al., [2408.10981v1](http://arxiv.org/abs/2408.10981v1)\n\n The double detonation model is one of the prevalent explosion mechanisms of Type Ia Supernovae (SNe Ia) wherein an outer helium shell detonation triggers a core detonation in the white dwarf (WD). The dynamically driven double degenerate double detonation (D6) is the double detonation of the more massive WD in a binary WD system where the localized impact of the mass transfer stream from the companion sets off the initial helium shell detonation. To have high numerical resolution and control over the stream parameters, we have implemented a study of the local interaction of the stream with the WD surface in 2D. In cases with lower base density of the shell, the stream's impact can cause surface detonation soon after first impact. With higher base densities, after the stream hits the surface, hot material flows around the star and interacts with the incoming stream to produce a denser and narrower impact. Our results therefore show that (1) a directly impacting stream for both a relatively high resolution and for a range of stream parameters can produce a surface detonation, (2) thinner helium shells ignite more promptly via impact, doing so sooner, and (3) there are lower limits on ignition in both shell density and incoming stream speed with lower limits on density being well below those shown by other work to be required for normal appearing SN Ia. This supports stream ignition and therefore the D6 scenario, as a viable mechanism for normal SNe Ia.\n\n", "2408.10721": "2024-08-20, **Viewing the explosion models of type Ia supernovae via the insight from terrestrial cellular detonation**, Kazuya Iwata et.al., [2408.10721v1](http://arxiv.org/abs/2408.10721v1)\n\n The cellular structure is considered to be a key as a criterion in initiation, propagation, and quenching of terrestrial detonation. While a few studies on type Ia supernovae, which are known to involve detonation, have addressed the importance of the cellular structure, further detailed treatment will benefit enhanced understanding of the explosion outcomes. In the present study, we bridge this gap in the astrophysics and engineering fields, focusing on the detonation in a heliumrich white dwarf envelope as the triggering process for the so-called double-detonation model. The cellular structures are quantified via high-resolution two-dimensional simulations. We demonstrate that widely-accepted terrestrial-experimental criteria for quenching and initiation of detonation can indeed explain the results of previous hydrodynamic simulations very well. The present study highlights the potential of continuing to apply the insight from terrestrial detonation experiments to astrophysical problems, specifically the long unresolved problem of the explosion mechanism of type Ia supernovae.\n\n", "2408.10707": "2024-08-20, **High-redshift Cosmology by Gamma-Ray Bursts: an overview**, Giada Bargiacchi et.al., [2408.10707v1](http://arxiv.org/abs/2408.10707v1)\n\n Several correlations among Gamma-Ray Bursts (GRBs) quantities, both in the prompt and afterglow emissions, have been established during the last decades, thus enabling the standardization of GRBs as cosmological probes. Since GRBs are observed up to redshift $z \\sim 9$, they represent a valuable tool to fill in the gap of information on the Universe evolution between the farthest type Ia supernovae and the Cosmic Microwave Background Radiation and to shed new light on the current challenging cosmological tensions. Without claiming for completeness, here we describe the state of the art of GRB correlations, their theoretical interpretations, and their cosmological applications both as standalone probes and in combination with other probes. In this framework, we pinpoint the importance of correcting the correlations for selection biases and redshift evolution to derive intrinsic relations, the assets of combining probes at different scales, and the need for the employment of the appropriate cosmological likelihood to precisely constrain cosmological parameters. Furthermore, we emphasize the benefits of the cosmographic approach to avoid any cosmological assumptions and the valuable applications of machine learning techniques to reconstruct GRB light curves and predict unknown GRB redshifts. Finally, we stress the relevance of all these factors, along with future observations, to definitely boost the power of GRBs in cosmology.\n\n", "2408.10704": "2024-08-20, **$Λ$CDM model against cosmography: A possible deviation after DESI 2024**, Saeed Pourojaghi et.al., [2408.10704v1](http://arxiv.org/abs/2408.10704v1)\n\n In this study, we present an analysis of the standard flat-$\\Lambda$CDM model using a cosmographic approach, incorporating recent DESI BAO observations and Supernovae Type Ia catalogues (SNIa), including the DES-SN5YR and Pantheon+ compilations. We find full consistency between the standard model and the cosmographic approach when considering DESI BAO and SNIa catalogues independently. When combining DESI BAO with SNIa data, we examine the impact of the Planck prior on the sound horizon at the drag epoch, $r\\_d$, and the Cepheid prior on the absolute magnitude, $M$. Applying the Planck prior on $r\\_d$ alone yields an $H\\_0$ value consistent with the Planck measurement, while applying the Cepheid prior on $M$ alone results in an $H\\_0$ value consistent with the SH0ES measurement. Without any priors, the $H\\_0$ value obtained has a large error margin, reconciling the Planck and SH0ES measurements. In all cases where individual priors are applied, we observe no significant tension between the flat-$\\Lambda$CDM model and the cosmographic approach. However, when both Planck and Cepheid priors are applied simultaneously, significant tensions arise between the model and cosmography. This tension is even more pronounced when excluding LRG1 and LRG2 from the DESI measurements. These results suggest that the standard model cannot simultaneously align with both high-redshift Planck CMB observations and local Cepheid measurements.\n\n", "2408.10560": "2024-08-20, **Optimizing the $L$-$σ$ Relation of HII Galaxies for Improving Cosmological Application**, Jiaze Gao et.al., [2408.10560v1](http://arxiv.org/abs/2408.10560v1)\n\n The basic premise of using HII starburst galaxies (HIIGs) as cosmic \"standard candels\" is that there is a significant correlation between the H$\\beta$ luminosity ($L$) and the velocity dispersion ($\\sigma$) of the ionized gas from HIIGs measurements, which can be called as the empirical $L$ - $\\sigma$ relation. However, the scaling $L$ - $\\sigma$ relation well-calibrated with the lower-redshift HIIGs is unfitted for the higher-redshift HIIGs. To solve this problem, we explore new relational expression for the $L$ - $\\sigma$ relation which should be suitable for both lower-redshift and higher-redshift HIIGs. After reconstructing the Hubble diagram with the Gaussian process (GP) method from the Pantheon+ supernovae Ia sample, we examine and compare six different revised formulas of $L$ - $\\sigma$ relation. Furthermore, we use the Bayesian evidence to compare the revised $L$ - $\\sigma$ relations with the analysis of a joint sample of 36 giant extragalactic HII regions (GEHRs) and 145 HIIGs. It turns out that the redshift-dependent bilinear correction and the quadratic $\\sigma$ based correction are significantly better than the others. Moreover, a quadratic $\\sigma$ based correction is the most supported one. It suggests that the appropriate corrections to the $L$ - $\\sigma$ relation should be considered when the HIIGs are used as a kind of cosmological probes.\n\n", "2408.10449": "2024-08-19, **SAUNAS II: Discovery of Cross-shaped X-ray Emission and a Rotating Circumnuclear Disk in the Supermassive S0 Galaxy NGC 5084**, Alejandro S. Borlaff et.al., [2408.10449v1](http://arxiv.org/abs/2408.10449v1)\n\n Combining Chandra, ALMA, EVLA, and Hubble Space Telescope archival data and newly acquired APO/DIS spectroscopy, we detect a double-lobed 17~kpc X-ray emission with plumes oriented approximately perpendicular and parallel to the galactic plane of the massive lenticular galaxy NGC\\,5084 at 0.3--2.0~keV.   We detect a highly inclined ($i=71.2^{+1.8\\circ}\\_{-1.7}$), molecular circumnuclear disk ($D=304^{+10}\\_{-11}$ pc) in the core of the galaxy rotating (V$^{\\rm (2-1) CO}\\_{\\rm rot}=242.7^{+9.6}\\_{-6.4}$ km s$^{-1}$) in a direction perpendicular to that of the galactic disk, implying a total mass of $\\log\\_{10}\\left( \\frac{M\\_{\\rm BH}}{M\\_{\\odot}} \\right) = 7.66^{+0.21}\\_{-0.15}$ for NGC\\,5084's supermassive black hole. Archival EVLA radio observations at 6 cm and 20 cm reveal two symmetric radio lobes aligned with the galactic plane, extending to a distance of $\\overline{R}=4.6\\pm0.6$ kpc from the core, oriented with the polar axis of the circumnuclear disk. The spectral energy distribution lacks strong emission lines in the optical range.   Three formation scenarios are considered to explain these multi-wavelength archival observations: 1) AGN re-orientation caused by accretion of surrounding material, 2) AGN-driven hot gas outflow directed along the galactic minor axis, or 3) a starburst / supernovae driven outflow at the core of the galaxy. This discovery is enabled by new imaging analysis tools including \\SAUNAS\\ (Selective Amplification of Ultra Noisy Astronomical Signal), demonstrating the abundance of information still to be exploited in the vast and growing astronomical archives.\n\n", "2408.10372": "2024-08-19, **An Extragalactic Widefield Search for Technosignatures with the Murchison Widefield Array**, Chenoa D. Tremblay et.al., [2408.10372v1](http://arxiv.org/abs/2408.10372v1)\n\n It is common for surveys that are designed to find artificial signals generated by distant civilizations to focus on galactic sources. Recently, researchers have started focusing on searching for all other sources within the field observed, including the vast population of background galaxies. Toward a population of galaxies in the background toward the Vela supernova remnant, we search for technosignatures, spectral and temporal features consistent with our understanding of technology. We set transmitter power limits for the detection of signals in a population of over 1,300 galaxies within a single field of view observed with the Murchison Widefield Array.\n\n", "2408.10296": "2024-08-19, **Star Shearing Season -- Transient Signals in Wave-like Dark Matter Experiments from Black Hole Formation**, Arturo de Giorgi et.al., [2408.10296v1](http://arxiv.org/abs/2408.10296v1)\n\n Ordinary matter coupled to light weakly interacting bosons can lead to the formation of a macroscopic bosonic field in the vicinity of large matter concentrations such as ordinary or neutron stars. When these objects are turned into black holes due to a supernova or a binary merger this ''hair'' could be ''shorn'' off. Part of the field configuration would then be released leading to an outgoing field wave. For small masses this field transient remains rather compact and can induce a transient signal in experiments, in particular those that look for wave-like dark matter. This signal can be correlated with the corresponding astrophysical signal of the event. In this note, we consider a variety of couplings and the associated signals and estimate the corresponding sensitivities.\n\n", "2408.09645": "2024-08-19, **[O II] as an Effective Indicator of the Dependence Between the Standardised Luminosities of Type Ia Supernovae and the Properties of their Host Galaxies**, B. Martin et.al., [2408.09645v1](http://arxiv.org/abs/2408.09645v1)\n\n We have obtained IFU spectra of 75 SN Ia host galaxies from the Foundation Supernova survey to search for correlations between the properties of individual galaxies and SN Hubble residuals. After standard corrections for light-curve width and SN colour have been applied, we find correlations between Hubble residuals and the equivalent width of the [O II] $\\lambda\\lambda$ 3727, 3729 doublet (2.3$\\sigma$), an indicator of the specific star formation rate (sSFR). When splitting our sample by SN colour, we find no colour dependence impacting the correlation between EW[O II] and Hubble residual. However, when splitting by colour, we reveal a correlation between the Hubble residuals of blue SNe Ia and the Balmer decrement (2.2$\\sigma$), an indicator of dust attenuation. These correlations remain after applying a mass-step correction, suggesting that the mass-step correction does not fully account for the limitations of the colour correction used to standardise SNe Ia. Rather than a mass correction, we apply a correction to SNe from star forming galaxies based on their measurable EW[O II]. We find that this correction also removes the host galaxy mass step, while also greatly reducing the significance of the correlation with the Balmer decrement for blue SNe Ia. We find that correcting for EW[O II], in addition to or in place of the mass-step, may further reduce the scatter in the Hubble diagram.\n\n"}}