{"neutrino": {"2305.06350": "2023-05-10, **On the degeneracies between baryons, massive neutrinos and f(R) gravity in Stage IV cosmic shear analyses**, A. Spurio Mancini et.al., [2305.06350v1](http://arxiv.org/abs/2305.06350v1)\n\n Modelling nonlinear structure formation is essential for current and forthcoming cosmic shear experiments. We combine the halo model reaction formalism, implemented in the REACT code, with the COSMOPOWER machine learning emulation platform, to develop and publicly release REACTEMU-FR, a fast and accurate nonlinear matter power spectrum emulator for $f(R)$ gravity with massive neutrinos. Coupled with the state-of-the-art baryon feedback emulator BCEMU, we use REACTEMU-FR to produce Markov Chain Monte Carlo forecasts for a cosmic shear experiment with typical Stage IV specifications. We find that the inclusion of highly nonlinear scales (multipoles between $1500\\leq \\ell \\leq 5000$) only mildly improves constraints on most standard cosmological parameters (less than a factor of 2). In particular, the necessary modelling of baryonic physics effectively damps most constraining power on the sum of the neutrino masses and modified gravity at $\\ell \\gtrsim 1500$. Using an approximate baryonic physics model produces mildly improved constraints on cosmological parameters which remain unbiased at the $1\\sigma$-level, but significantly biases constraints on baryonic parameters at the $> 2\\sigma$-level.\n\n", "2305.06095": "2023-05-10, **Complete complementarity relations for three-flavor neutrino oscillations**, Massimo Blasone et.al., [2305.06095v1](http://arxiv.org/abs/2305.06095v1)\n\n We exploit complete complementarity relations to characterize quantum correlations encoded in a three-flavor oscillating neutrino system. In particular, we analyze the contributions associated to the twoflavor subsystems, each of which exhibits a particular internal structure. We focus on the behavior of the correlations at large distances, both for an initial electron and muon neutrino state. Our analysis is based on the wave packet approach in which the neutrino is represented by a mixed state: consequently, the bipartite correlations are described by the Quantum Discord.\n\n", "2305.06032": "2023-05-10, **Sensitivity of Transition-Edge Sensors to Strong DC Electric Fields**, K. M. Patel et.al., [2305.06032v1](http://arxiv.org/abs/2305.06032v1)\n\n Transition-edge sensors (TESs) have found a wide range of applications in both space- and land-based astronomical photon measurement and are being used in the search for dark matter and neutrino mass measurements. A fundamental aspect of TES physics that has not been investigated is the sensitivity of TESs to strong DC electric fields (10 kV/m and above). Understanding the resilience of TESs to DC electric fields is essential when considering their use as charged particle spectrometers, a field in which TESs could have an enormous impact. Techniques such as x-ray photoelectron spectroscopy produce a high number of low-energy electrons that are not of interest and can be screened from the detector using electrostatic deflection. The use of strong electric fields could also provide a mass-efficient route to prevent secondary electron measurements arising from cosmic radiation in space-based TES applications. Integrating electron optics into the TES membrane provides an elegant and compact means to control the interaction between charged particles and the sensor, whether by screening unwanted particles or enhancing the particle absorption efficiency but implementing such techniques requires understanding the sensitivity of the TES to the resulting electric fields. In this work, we applied a uniform DC electric field across a Mo/Au TES using a parallel pair of flat electrodes positioned above and below the TES. The electric field in the vicinity of the TES was enhanced by the presence of silicon backing plate directly beneath the TES. Using this arrangement, we were able to apply of electric fields up to 90 kV/m across the TES. We observed no electric field sensitivity at any field strength demonstrating the capability to use TESs in environments of strong electric fields.\n\n", "2305.05903": "2023-05-10, **Neutrino oscillations induced by chiral torsion**, Riya Barick et.al., [2305.05903v1](http://arxiv.org/abs/2305.05903v1)\n\n Neutrino mixing is caused by the fact that neutrino flavors are not eigenstates of the free Hamiltonian. This causes oscillations among different neutrino flavors. When neutrinos pass through a medium, weak interactions produce different effective masses for neutrinos of different flavors, leading to a modification of the mixing parameters. In curved spacetime there is an additional contribution to neutrino Hamiltonian from a torsion-induced four-fermion interaction, which also causes neutrino mixing while propagating through fermionic matter. We provide an outline of the calculation of this effect on neutrino oscillation.\n\n", "2305.05696": "2023-05-09, **Hydrodynamical structure formation in Milgromian cosmology**, Nils Wittenburg et.al., [2305.05696v1](http://arxiv.org/abs/2305.05696v1)\n\n We present the first hydrodynamical cosmological simulations in the $\\nu$HDM framework based on Milgromian dynamics (MOND) with light (11~eV) sterile neutrinos. $\\nu$HDM can explain the expansion history, CMB anisotropies, and galaxy cluster dynamics similarly to standard cosmology while preserving MOND's successes on galaxy scales, making this the most conservative Milgromian framework. We generate initial conditions including sterile neutrinos using \\textsc{camb} and \\textsc{music} and modify the publicly available code \\textsc{phantom of ramses} to run $\\nu$HDM models. The simulations start at redshift $z\\_e=199$, when the gravitational fields are stronger than $a\\_{\\_0}$ provided this does not vary. We analyse the growth of structure and investigate the impact of resolution and box size, which is at most 600 comoving Mpc. Large density contrasts arise at late times, which may explain the KBC void and Hubble tension. We quantify the mass function of formed structures at different redshifts. We show that the sterile neutrino mass fraction in these structures is similar to the cosmic fraction at high masses (consistent with MOND dynamical analyses) but approaches zero at lower masses, as expected for galaxies. We also identify structures with a low peculiar velocity comparable to the Local Group, but these are rare. The onset of group/cluster scale structure formation at $z\\_e\\approx4$ appears to be in tension with observations of high redshift galaxies, which we discuss in comparison to prior analytical work in a MONDian framework. The formation of a cosmic web of filaments and voids demonstrates that this is not unique to standard Einstein/Newton-based cosmology.\n\n", "2305.05184": "2023-05-09, **Flavor-dependent long-range neutrino interactions in DUNE & T2HK: alone they constrain, together they discover**, Masoom Singh et.al., [2305.05184v1](http://arxiv.org/abs/2305.05184v1)\n\n Discovering new neutrino interactions would represent evidence of physics beyond the Standard Model. We focus on new flavor-dependent long-range neutrino interactions mediated by ultra-light mediators, with masses below $10^{-10}$ eV, introduced by new lepton-number gauge symmetries $L\\_e-L\\_\\mu$, $L\\_e-L\\_\\tau$, and $L\\_\\mu-L\\_\\tau$. Because the interaction range is ultra-long, nearby and distant matter - primarily electrons and neutrons - in the Earth, Moon, Sun, Milky Way, and the local Universe, may source a large matter potential that modifies neutrino oscillation probabilities. The upcoming Deep Underground Neutrino Experiment (DUNE) and the Tokai-to-Hyper-Kamiokande (T2HK) long-baseline neutrino experiments will provide an opportunity to search for these interactions, thanks to their high event rates and well-characterized neutrino beams. We forecast their probing power. Our results reveal novel perspectives. Alone, DUNE and T2HK may strongly constrain long-range interactions, setting new limits on their coupling strength for mediators lighter than $10^{-18}$ eV. However, if the new interactions are subdominant, then both DUNE and T2HK, together, will be needed to discover them, since their combination lifts parameter degeneracies that weaken their individual sensitivity. DUNE and T2HK, especially when combined, provide a valuable opportunity to explore physics beyond the Standard Model.\n\n", "2305.05135": "2023-05-09, **Search for astrophysical electron antineutrinos in Super-Kamiokande with 0.01wt% gadolinium loaded water**, M. Harada et.al., [2305.05135v1](http://arxiv.org/abs/2305.05135v1)\n\n We report the first search result for the flux of astrophysical electron antineutrinos for energies O(10) MeV in the gadolinium-loaded Super-Kamiokande (SK) detector. In June 2020, gadolinium was introduced to the ultra-pure water of the SK detector in order to detect neutrons more efficiently. In this new experimental phase, SK-Gd, we can search for electron antineutrinos via inverse beta decay with efficient background rejection and higher signal efficiency thanks to the high efficiency of the neutron tagging technique. In this paper, we report the result for the initial stage of SK-Gd with a $22.5\\times552$ $\\rm kton\\cdot day$ exposure at 0.01% Gd mass concentration. No significant excess over the expected background in the observed events is found for the neutrino energies below 31.3 MeV. Thus, the flux upper limits are placed at the 90% confidence level. The limits and sensitivities are already comparable with the previous SK result with pure-water ($22.5 \\times 2970 \\rm kton\\cdot day$) owing to the enhanced neutron tagging.\n\n"}, "dark matter": {"2305.06168": "2023-05-10, **A 50 liter CYGNO prototype overground characterization**, CYGNO collaboration et.al., [2305.06168v1](http://arxiv.org/abs/2305.06168v1)\n\n The nature of dark matter is still unknown and an experimental program to look for dark matter particles in our Galaxy should extend its sensitivity to light particles in the GeV mass range and exploit the directional information of the DM particle motion. The CYGNO project is studying a gaseous time projection chamber operated at atmospheric pressure with a Gas Electron Multiplier amplification and with an optical readout as a promising technology for light dark matter and directional searches.   In this paper we describe the operation of a 50 liter prototype named LIME (Long Imaging ModulE) in an overground location at Laboratori Nazionali di Frascati of INFN. This prototype employs the technology under study for the 1 cubic meter CYGNO demonstrator to be installed at the Laboratori Nazionali del Gran Sasso. We report the characterization of LIME with photon sources in the energy range from few keV to several tens of keV to understand the performance of the energy reconstruction of the emitted electron. We achieved a low energy threshold of few keV and an energy resolution over the whole energy range of 10-20%, while operating the detector for several weeks continuously with very high operational efficiency. The energy spectrum of the reconstructed electrons is then reported and will be the basis to identify radio-contaminants of the LIME materials to be removed for future CYGNO detectors.\n\n", "2305.05684": "2023-05-09, **Signals of Millicharged Dark Matter in Light-Shining-Through-Wall Experiments**, Asher Berlin et.al., [2305.05684v1](http://arxiv.org/abs/2305.05684v1)\n\n We discuss a novel detection technique for millicharged dark matter that makes use of existing light-shining-through-wall (LSW) experiments searching for massive dark photons. Since millicharged particles interact with both the visible and dark sectors, a small background of such particles enables the search for visible signals even in the limit of a massless dark photon. Furthermore, for sufficiently large couplings, a small dark matter subcomponent consisting of millicharged particles can have a terrestrial abundance that is significantly enhanced with respect to its galactic abundance. We leverage this fact to show that in certain parts of parameter space, future runs of the LSW Dark SRF experiment can be used to set the strongest limits on millicharged relics.\n\n", "2305.05679": "2023-05-09, **The impact of UV variability on the abundance of bright galaxies at $z \\geq 9$**, Xuejian Shen et.al., [2305.05679v1](http://arxiv.org/abs/2305.05679v1)\n\n JWST observations have revealed a population of galaxies bright enough that potentially challenge standard galaxy formation models in the $\\Lambda$CDM cosmology. Using a minimal empirical framework, we investigate the influence of variability on the rest-frame ultra-violet (UV) luminosity function (UVLF) of galaxies at $z\\geq 9$. Our study differentiates between the $\\textit{median UV radiation yield}$ and the $\\textit{variability of UV luminosities}$ of galaxies at a fixed dark matter halo mass. We primarily focus on the latter effect, which depends on halo assembly and galaxy formation processes and can significantly increase the abundance of UV-bright galaxies due to the upscatter of galaxies in lower-mass haloes. We find that a relatively low level of variability, $\\sigma\\_{\\rm UV} \\approx 0.75$ mag, matches the observational constraints at $z\\approx 9$. However, increasingly larger $\\sigma\\_{\\rm UV}$ is necessary when moving to higher redshifts, reaching $\\sigma\\_{\\rm UV} \\approx 2.0\\,(2.5)\\,{\\rm mag}$ at $z\\approx 12$ ($16$). This implied variability is consistent with expectations of physical processes in high-redshift galaxies such as bursty star formation and cycles of dust clearance. Photometric constraints from JWST at $z\\gtrsim 9$ therefore can be reconciled with a standard $\\Lambda$CDM-based galaxy formation model calibrated at lower redshifts without the need for adjustments to the median UV radiation yield.\n\n", "2305.05681": "2023-05-09, **Absorption of Axion Dark Matter in a Magnetized Medium**, Asher Berlin et.al., [2305.05681v1](http://arxiv.org/abs/2305.05681v1)\n\n Detection of axion dark matter heavier than a meV is hindered by its small wavelength, which limits the useful volume of traditional experiments. This problem can be avoided by directly detecting in-medium excitations, whose $\\sim \\text{meV} - \\text{eV}$ energies are decoupled from the detector size. We show that for any target inside a magnetic field, the absorption rate of electromagnetically-coupled axions into in-medium excitations is determined by the dielectric function. As a result, the plethora of candidate targets previously identified for sub-GeV dark matter searches can be repurposed as broadband axion detectors. We find that a $\\text{kg} \\cdot \\text{yr}$ exposure with noise levels comparable to recent measurements is sufficient to probe parameter space currently unexplored by laboratory tests. Noise reduction by only a few orders of magnitude can enable sensitivity to the QCD axion in the $\\sim 10 \\ \\text{meV} - 10 \\ \\text{eV}$ mass range.\n\n", "2305.05667": "2023-05-09, **New MGCAMB tests of gravity with CosmoMC and Cobaya**, Zhuangfei Wang et.al., [2305.05667v1](http://arxiv.org/abs/2305.05667v1)\n\n We present a new version of MGCAMB, a patch for the Einstein-Boltzmann solver CAMB for cosmological tests of gravity. New features include a new cubic-spline parameterization allowing for a simultaneous reconstruction of $\\mu$, $\\Sigma$ and the dark energy density fraction $\\Omega\\_X$ as functions of redshift, the option to work with a direct implementation of $\\mu$, $\\Sigma$ (instead of converting to $\\mu$, $\\gamma$ first), along with the option to test models with a scalar field coupled only to dark matter, and the option to include dark energy perturbations when working with $w\\ne -1$ backgrounds, to restore consistency with CAMB in the GR limit. This version of MGCAMB comes with a python wrapper to run it directly from the python interface, an implementation in the latest version of CosmoMC, and can be used with Cobaya.\n\n", "2305.05664": "2023-05-09, **R-modes as a New Probe of Dark Matter in Neutron Stars**, Swarnim Shirke et.al., [2305.05664v1](http://arxiv.org/abs/2305.05664v1)\n\n In this work, we perform the first systematic investigation of effects of the presence of dark matter on r-mode oscillations in neutron stars (NSs). Using a self-interacting dark matter (DM) model based on the neutron decay anomaly and a hadronic model obtained from the posterior distribution of a recent Bayesian analysis, we impose constraints on the DM self-interaction strength using recent multimessenger astrophysical observations. The constrained DM interaction strength is then used to estimate DM self-interaction cross section and shear viscosity resulting from DM, which is found to be several orders of magnitude smaller than shear viscosity due to hadronic matter. Assuming that the DM fermion is in chemical equilibrium with the neutrons in the neutron star, we estimate the bulk viscosity resulting from the dark decay of neutrons, and find it to be much smaller than the hadronic bulk viscosity. We also conclude that the instability window with minimal hadronic damping mechanisms can become smaller when including DM shear and bulk viscosity but remains incompatible with the X-ray and pulsar observational data for the chosen DM model.\n\n", "2305.05674": "2023-05-09, **Proca Stars with Dark Photons from Spontaneous Symmetry Breaking of the Scalar Field Dark Matter**, Leonardo Sán. Hernández et.al., [2305.05674v1](http://arxiv.org/abs/2305.05674v1)\n\n Recently, the Scalar Field Dark Matter (SFDM) model (also known as Fuzzy, Wave, Bose-Einstein, Ultra-light Dark Matter) has gained a lot of attention because it has provided simpler and more natural explanations for various phenomena observed in galaxies, as a natural explanation for the center of galaxies, the number of satellite galaxies around their host and, more recently, a natural explanation for anomalous trajectories of satellite galaxies called Vast Polar Orbits (VPO) observed in various galaxies. In the present work we study the assumption that the SFDM is a type of charged dark boson whose gauge charge is associated with the Dark Photon (DP). Inspired by these results, we study the formation of compact bosonic objects, such as Boson Stars (BS) and focus on the possibility that, due to spontaneous $U(1)$ SFDM symmetry breaking, the DP may acquire mass and form compact objects like Proca Stars (PS). If this is true, we can expect measurable effects on the electromagnetic field of the Standard Model (SM) of particles due to their interaction with the DP on the formation of compact objects.\n\n", "2305.05155": "2023-05-09, **Constraining $p$-wave Dark Matter Annihilation with Gamma-ray Observations of M87**, Katharena Christy et.al., [2305.05155v1](http://arxiv.org/abs/2305.05155v1)\n\n We consider constraints on $p$-wave dark matter in a dark matter spike surrounding the supermassive black hole at the center of M87. Owing to the large mass of the black hole, and resulting large velocity dispersion for the dark matter particles in the spike, it is possible for Fermi-LAT and MAGIC data to place tight constraints on $p$-wave annihilation, which would be far more stringent than those placed by observations of dwarf spheroidal galaxies. Indeed, for optimistic choices of the spike parameters, gamma-ray data would exclude thermal $p$-wave dark matter models with a particle mass $\\lesssim {10}~\\rm TeV$. But there is significant uncertainty in the properties and parameters of the spike, and for less optimistic scenarios, thermal dark matter candidates would be completely unconstrained. In addition to better understanding the spike parameters, a second key to improving constraints on dark matter annihilation is an accurate astrophysical background model.\n\n", "2305.05125": "2023-05-09, **Accurate electron-recoil ionization factors for dark matter direct detection in xenon, krypton and argon**, A. R. Caddell et.al., [2305.05125v1](http://arxiv.org/abs/2305.05125v1)\n\n While most scintillation-based dark matter experiments search for Weakly Interacting Massive Particles (WIMPs), a sub-GeV WIMP-like particle may also be detectable in these experiments. While dark matter of this type and scale would not leave appreciable nuclear recoil signals, it may instead induce ionization of atomic electrons. Accurate modelling of the atomic wavefunctions is key to investigating this possibility, with incorrect treatment leading to a large suppression in the atomic excitation factors. We have calculated these atomic factors for argon, krypton and xenon and present the tabulated results for use with a range of dark matter models. This is made possible by the separability of the atomic and dark matter form factor, allowing the atomic factors to be calculated for general couplings; we include tables for vector, scalar, pseudovector, and pseudoscalar electron couplings. Additionally, we calculate electron impact total ionization cross sections for xenon using the tabulated results as a test of accuracy. Lastly, we provide an example calculation of the event rate for dark matter scattering on electrons in XENON1T and show that these calculations depend heavily on how the low-energy response of the detector is modelled.\n\n"}, "supernova": {"2305.06266": "2023-05-10, **Jet-powered turbulence in common envelope evolution**, Shlomi Hillel et.al., [2305.06266v1](http://arxiv.org/abs/2305.06266v1)\n\n We conduct a three-dimensional hydrodynamical simulation of a common envelope evolution (CEE) where a neutron star (NS) spirals-in inside the envelope of a red supergiant (RSG) star in a predetermined orbit. We find that the jets shed pairs of vortices in an expanding spiral pattern, inflate two expanding spirally-shaped low-density bubbles, one above and one below the equatorial plane, and deposit angular momentum to the envelope. In the simulation we do not include the gravity of the NS such that all effects we find are solely due to the jets that the spiralling-in NS launches. The angular momentum that the jets deposit to the envelope is of the same order of magnitude as the orbital angular momentum and has the same direction. The turbulence that the jets induce in the common envelope might play a role in transporting energy and angular momentum. The jet-deposited energy that is radiated away (a process not studied here) leads to a transient event that is termed common envelope jets supernova (CEJSN) and might mimic an energetic core collapse supernova. The turbulence and the spiral pattern that we explore here might lead to bumps in the late light curve of the CEJSN when different segments of the ejected envelope collide with each other. This study emphasises the roles that jets can play in CEE (including jets launched by black hole companions) and adds to the rich variety of processes in CEJSN events.\n\n", "2305.06134": "2023-05-10, **Multi-Messenger Diagnostics of the Engine behind Core-Collapse Supernovae**, Christopher L. Fryer et.al., [2305.06134v1](http://arxiv.org/abs/2305.06134v1)\n\n Core-collapse supernova explosions play a wide role in astrophysics by producing compact remnants (neutron stars, black holes) and the synthesis and injection of many heavy elements into their host Galaxy. Because they are produced in some of the most extreme conditions in the universe, they can also probe physics in extreme conditions (matter at nuclear densities and extreme temperatures and magnetic fields). To quantify the impact of supernovae on both fundamental physics and our understanding of the Universe, we must leverage a broad set of observables of this engine. In this paper, we study a subset of these probes using a suite of 1-dimensional, parameterized mixing models: ejecta remnants from supernovae, ultraviolet, optical and infra-red lightcurves, and transient gamma-ray emission. We review the other diagnostics and show how the different probes tie together to provide a more clear picture of the supernova engine.\n\n", "2305.06130": "2023-05-10, **MeerKAT caught a Mini Mouse: serendipitous detection of a young radio pulsar escaping its birth sit**, S. E. Motta et.al., [2305.06130v1](http://arxiv.org/abs/2305.06130v1)\n\n In MeerKAT observations pointed at a Galactic X-ray binary located on the Galactic plane we serendipitously discovered a radio nebula with cometary-like morphology. The feature, which we named `the Mini Mouse' based on its similarity with the previously discovered `Mouse' nebula, points back towards the previously unidentified candidate supernova remnant G45.24$+$0.18. We observed the location of the Mini Mouse with MeerKAT in two different observations, and we localised with arcsecond precision the 138 ms radio pulsar PSR J1914+1054g, recently discovered by the FAST telescope, to a position consistent with the head of the nebula. We confirm a dispersion measure of about 418 pc cm$^{-3}$ corresponding to a distance between 7.8 and 8.8 kpc based on models of the electron distribution. Using our accurate localisation and 2 period measurements spaced 90 days apart we calculate a period derivative of (2.7 $\\pm$ 0.3) $\\times$ 10 $^{-14}$ s s$^{-1}$. We derive a characteristic age of approximately 82 kyr and a spin down luminosity of 4$\\times$10$^{35}$ erg s$^{-1}$, respectively. For a pulsar age comparable with the characteristic age, we find that the projected velocity of the neutron star is between 320 and 360 km/s if it was born at the location of the supernova remnant. The size of the proposed remnant appears small if compared with the pulsar characteristic age, however the relatively high density of the environment near the Galactic plane could explain a suppressed expansion rate and thus a smaller remnant.\n\n", "2305.05796": "2023-05-09, **1100 Days in the Life of the Supernova 2018ibb -- the Best Pair-Instability Supernova Candidate, to date**, Steve Schulze et.al., [2305.05796v1](http://arxiv.org/abs/2305.05796v1)\n\n Abridged - Stars with ZAMS masses between 140 and $260 M\\_\\odot$ are thought to explode as pair-instability supernovae (PISNe). During their thermonuclear runaway, PISNe can produce up to several tens of solar masses of radioactive nickel, resulting in luminous transients similar to some superluminous supernovae (SLSNe). Yet, no unambiguous PISN has been discovered so far. SN2018ibb is a H-poor SLSN at $z=0.166$ that evolves extremely slowly compared to the hundreds of known SLSNe. Between mid 2018 and early 2022, we monitored its photometric and spectroscopic evolution from the UV to the NIR with 2-10m class telescopes. SN2018ibb radiated $>3\\times10^{51} \\rm erg$ during its evolution, and its bolometric light curve reached $>2\\times10^{44} \\rm erg\\,s^{-1}$ at peak. The long-lasting rise of $>93$ rest-frame days implies a long diffusion time, which requires a very high total ejected mass. The PISN mechanism naturally provides both the energy source ($^{56}$Ni) and the long diffusion time. Theoretical models of PISNe make clear predictions for their photometric and spectroscopic properties. SN2018ibb complies with most tests on the light curves, nebular spectra and host galaxy, potentially all tests with the interpretation we propose. Both the light curve and the spectra require 25-44 $M\\_\\odot$ of freshly nucleosynthesised $^{56}$Ni, pointing to the explosion of a metal-poor star with a He-core mass of 120-130 $M\\_\\odot$ at the time of death. This interpretation is also supported by the tentative detection of [Co II]$\\lambda$1.025$\\mu$m, which has never been observed in any other PISN candidate or SLSN before. Powering by a central engine, such as a magnetar or a black hole, can be excluded with high confidence. This makes SN2018ibb by far the best candidate for being a PISN, to date.\n\n", "2305.05695": "2023-05-09, **Dynamical He Flashes in Double White Dwarf Binaries**, Tin Long Sunny Wong et.al., [2305.05695v1](http://arxiv.org/abs/2305.05695v1)\n\n The detonation of an overlying helium layer on a $0.8-1.1\\,\\mathrm{M}\\_{\\odot}$ carbon-oxygen (CO) white dwarf (WD) can detonate the CO WD and create a thermonuclear supernova (SN). Many authors have recently shown that when the mass of the He layer is low ($\\lesssim 0.03\\,\\mathrm{M}\\_{\\odot}$), the ashes from its detonation minimally impact the spectra and light-curve from the CO detonation, allowing the explosion to appear remarkably similar to Type Ia SNe. These new insights motivate our investigation of dynamical He shell burning, and our search for a binary scenario that stably accumulates thermally unstable He shells in the $0.01-0.08\\,\\mathrm{M}\\_{\\odot}$ range, thick enough to detonate, but also often thin enough for minimal impact on the observables. We first show that our improved non-adiabatic evolution of convective He shell burning in this shell mass range leads to conditions ripe for a He detonation. We also find that a stable mass-transfer scenario with a high entropy He WD donor of mass $0.15-0.25\\,\\mathrm{M}\\_\\odot$ yields the He shell masses needed to achieve the double detonations. This scenario also predicts that the surviving He donor leaves with a space velocity consistent with the unusual runaway object, D6-2. We find that hot He WD donors originate in common envelope events when a $1.3-2.0\\,\\mathrm{M}\\_\\odot$ star fills its Roche lobe at the base of the red giant branch at orbital periods of $1-10$ days with the CO WD.\n\n", "2305.05680": "2023-05-09, **A Bayesian chemical evolution model of the DustPedia Galaxy M74**, Francesco Calura et.al., [2305.05680v1](http://arxiv.org/abs/2305.05680v1)\n\n We introduce a new, multi-zone chemical evolution model of the DustPedia galaxy M74, calibrated by means of MCMC methods.   We take into account the observed stellar and gas density profiles and use Bayesian analysis to constrain two fundamental parameters characterising the gas accretion and star formation timescale, i.e. the infall timescale tau and the SF efficiency nu, respectively, as a function of galactocentric radius R. Our analysis supports an infall timescale increasing with R and a star formation efficiency decreasing with R, thus supporting an 'Inside-Out' formation for M74. For both tau and nu, we find a weaker radial dependence than in the Milky Way.   We also investigate the dust content of M74, comparing the observed dust density profile with the results of our chemical evolution models. Various prescriptions have been considered for two key parameters, i.e. the typical dust accretion timescale and the mass of gas cleared out of the dust by a supernova remnant, regulating the dust growth and destruction rate, respectively. Two models with a different current balance between destruction and accretion, i.e. with equilibrium and dominion of accretion over destruction, can equally reproduce the observed dust profile of M74. This outlines the degeneracy between these parameters in shaping the interstellar dust content in galaxies. Our methods will be extended to more DustPedia galaxies to shed more light on the relative roles of dust production and destruction.\n\n", "2305.05104": "2023-05-09, **Fisher matrix forecasts on the astrophysics of galaxies during the epoch of reionisation from the 21-cm power spectra**, Sreedhar Balu et.al., [2305.05104v1](http://arxiv.org/abs/2305.05104v1)\n\n The hyperfine 21-cm transition of neutral hydrogen from the early Universe ($z>5$) is a sensitive probe of the formation and evolution of the first luminous sources. Using the Fisher matrix formalism we explore the complex and degenerate high-dimensional parameter space associated with the high-$z$ sources of this era and forecast quantitative constraints from a future 21-cm power spectrum (21-cm PS) detection. This is achieved using MERAXES, a coupled semi-analytic galaxy formation model and reionisation simulation, applied to an $N$-body halo merger tree with a statistically complete population of all atomically cooled galaxies out to $z\\sim20$. Our mock observation assumes a 21-cm detection spanning $z \\in [5, 24]$ from a 1000 h mock observation with the forthcoming Square Kilometre Array and is calibrated with respect to ultraviolet luminosity functions (UV LFs) at $z\\in[5, 10]$, the optical depth of CMB photons to Thompson scattering from Planck, and various constraints on the IGM neutral fraction at $z > 5$. In this work, we focus on the X-ray luminosity, ionising UV photon escape fraction, star formation and supernova feedback of the first galaxies. We demonstrate that it is possible to recover 5 of the 8 parameters describing these properties with better than $50$ per cent precision using just the 21-cm PS. By combining with UV LFs, we are able to improve our forecast, with 5 of the 8 parameters constrained to better than 10 per cent (and all below 50 per cent).\n\n"}}