{"neutrino": {"2406.16803": "2024-06-24, **Discovering neutrino tridents at the Large Hadron Collider**, Wolfgang Altmannshofer et.al., [2406.16803v1](http://arxiv.org/abs/2406.16803v1)\n\n Neutrino trident production of di-lepton pairs is well recognized as a sensitive probe of both electroweak physics and physics beyond the Standard Model. Although a rare process, it could be significantly boosted by such new physics, and it also allows the electroweak theory to be tested in a new regime. We demonstrate that the forward neutrino physics program at the Large Hadron Collider offers a promising opportunity to measure for the first time, dimuon neutrino tridents with a statistical significance exceeding $5\\sigma$. We present predictions for various proposed experiments and outline a specific experimental strategy to identify the signal and mitigate backgrounds, based on \"reverse tracking\" dimuon pairs in the FASER$\\nu$2 detector. We also discuss prospects for constraining beyond Standard Model contributions to neutrino trident rates at high energies.\n\n", "2406.16730": "2024-06-24, **Convolutional neural network for Lyman break galaxies classification and redshift regression in DESI (Dark Energy Spectroscopic Instrument)**, Julien Taran et.al., [2406.16730v1](http://arxiv.org/abs/2406.16730v1)\n\n DESI is a groundbreaking international project to observe more than 40 million quasars and galaxies over a 5-year period to create a 3D map of the sky. This map will enable us to probe multiple aspects of cosmology, from dark energy to neutrino mass. We are focusing here on one type of object observed by DESI, the Lyman Break Galaxies (LBGs). The aim is to use their spectra to determine whether they are indeed LBGs, and if so, to determine their distance from the Earth using a phenomenon called redshift. This will enable us to place these galaxies on the DESI 3D map.   The aim is therefore to develop a convolutional neural network (CNN) inspired by QuasarNET (See arXiv:1808.09955), performing simultaneously a classification (LBG type or not) and a regression task (determine the redshift of the LBGs). Initially, data augmentation techniques such as shifting the spectra in wavelengths, adding noise to the spectra, or adding synthetic spectra were used to increase the model training dataset from 3,019 data to over 66,000. In a second phase, modifications to the QuasarNET architecture, notably through transfer learning and hyperparameter tuning with Bayesian optimization, boosted model performance.   Gains of up to 26% were achieved on the Purity/Efficiency curve, which is used to evaluate model performance, particularly in areas with interesting redshifts, at low (around 2) and high (around 4) redshifts. The best model obtained an average score of 94%, compared with 75% for the initial model.\n\n", "2406.16546": "2024-06-24, **A Scotogenic model with U(1) symmetry and a scalar dark matter**, Anjan Kumar Barik et.al., [2406.16546v1](http://arxiv.org/abs/2406.16546v1)\n\n We study a scotogenic model augmented with an additional U(1) gauge and a discrete Z2 symmetry. The lightest Z2-odd particle in our model becomes the dark matter (DM) candidate while tiny neutrino masses are realized at one loop. We explore the parameter space of the model for which the DM relic density is satisfied, and the correct low-energy neutrino observables are reproduced. The extended gauge symmetry includes beyond Standard Model (SM) particle spectrum consisting of vector-like fermions and scalars. We also highlight possible collider signatures of these particles at the LHC.\n\n", "2406.16463": "2024-06-24, **Probing the Neutrino Seesaw Scale with Gravitational Waves**, Bartosz Fornal et.al., [2406.16463v1](http://arxiv.org/abs/2406.16463v1)\n\n Neutrinos are the most elusive particles of the Standard Model. The physics behind their masses remains unknown and requires introducing new particles and interactions. An elegant solution to this problem is provided by the seesaw mechanism. Typically considered at a high scale, it is potentially testable in gravitational wave experiments by searching for a spectrum from cosmic strings, which offers a rather generic signature across many high-scale seesaw models. Here we consider the possibility of a low-scale seesaw mechanism at the PeV scale, generating neutrino masses within the framework of a model with gauged U(1) lepton number. In this case, the gravitational wave signal at high frequencies arises from a first order phase transition in the early Universe, whereas at low frequencies it is generated by domain wall annihilation, leading to a double-peaked structure in the gravitational wave spectrum. The signals discussed here can be searched for in upcoming experiments, including gravitational wave interferometers, pulsar timing arrays, and astrometry observations.\n\n", "2406.16460": "2024-06-24, **Constraining dark matter from strong phase transitions in a $U(1)_{L_μ-L_τ}$ model: Implications for neutrino masses and muon $g-2$**, Sandhya Choubey et.al., [2406.16460v1](http://arxiv.org/abs/2406.16460v1)\n\n In this paper, we study a non-minimal gauged $U(1)\\_{L\\_{\\mu}-L\\_{\\tau}}$ model, where we add two complex singlet scalars, three right-handed Majorana neutrinos (RHN), and a vector-like dark fermion to the Standard Model (SM), all non-trivially charged under the extra gauge symmetry. The model offers an easy resolution to the muon $(g-2)$ anomaly, which fixes the scale of spontaneous symmetry breaking. Furthermore, the two-zero minor structure in the RHN mass matrix provides successful predictions for neutrino oscillation parameters, including the Dirac phase. The extended scalar sector can easily induce first-order phase transitions. We identify all possible phase transition patterns in the three-dimensional field space. We quantify the associated gravitational waves from the sound wave source and demonstrate that the signatures can be observed in future space-based experiments. We find that strong first-order phase transitions require large values of scalar quartic couplings which constrain the scalar dark matter (DM) relic density to a maximum of $10^{-2}$ and $10^{-5}$ when we consider the DM direct detection bound. Nonetheless, the model successfully explains the DM relic density via contribution from the vector-like dark fermion. We show the allowed range of the model parameters that can address all the beyond SM issues targeted in this study.\n\n", "2406.16431": "2024-06-24, **A ROOT based detector geometry and event visualization system for JUNO-TAO**, Minghua Liao et.al., [2406.16431v1](http://arxiv.org/abs/2406.16431v1)\n\n The Taishan Antineutrino Observatory (TAO or JUNO-TAO) is a satellite experiment of Jiangmen Underground Neutrino Observatory (JUNO) and located near the Taishan nuclear power plant (NPP). TAO will measure the energy spectrum of reactor antineutrinos with unprecedented precision, which will benefit both reactor neutrino physics and the nuclear database. A detector geometry and event visualization system has been developed for TAO. The software is based on ROOT packages and embedded in the TAO offline software framework. It provides an intuitive tool to visualize the detector geometry, tune the reconstruction algorithm, understand the neutrino physics, and monitor the operation of reactors at NPP. The further applications of the visualization system in the experimental operation of TAO and its future development are also discussed.\n\n", "2406.16352": "2024-06-24, **Large CP Violation from the Minimum Seesaw Model**, Yu-Cheng Qiu et.al., [2406.16352v1](http://arxiv.org/abs/2406.16352v1)\n\n The minimum seesaw model with two right-handed neutrinos is considered, where the lightest neutrino is naturally massless. Instead of adopting texture zeros in the lepton Yukawa matrices, which cause both theoretical and experimental troubles, here we propose two-$\\boldsymbol\\epsilon$ textures, where $\\boldsymbol\\epsilon$ is a small number. Combined with neutrino oscillation experimental data, we find that a large CP angle is preferred for the normal neutrino mass order. In contrast, the CP angle almost vanishes for the inverted order. This can be well-tested in near-future experiments, such as Hyper-Kamiokande. Besides, the predicted effective Majorana neutrino mass $m\\_{ee}$ and the total neutrino mass $\\sum m^\\nu\\_i$ are also within reach of ongoing or future experiments.\n\n", "2406.16269": "2024-06-24, **Displaced Heavy Neutral Lepton from New Higgs Doublet**, Fa-Xin Yang et.al., [2406.16269v1](http://arxiv.org/abs/2406.16269v1)\n\n Heavy neutral leptons $N$ are introduced to explain the tiny neutrino masses via the seesaw mechanism. For proper small mixing parameter $V\\_{\\ell N}$, the heavy neutral leptons $N$ become long-lived, which leads to the displaced vertex signature at colliders. In this paper, we consider the displaced heavy neutral lepton from the neutrinophilic Higgs doublet $\\Phi\\_\\nu$ decay. The new Higgs doublet with MeV scale VEV can naturally explain the tiny neutrino masses with TeV scale $N$. Different from current experimental searches via the $W^\\pm\\to \\ell^\\pm N$ decay, the new decays as $H^\\pm\\to \\ell^\\pm N$ are not suppressed by the small mixing parameter $V\\_{\\ell N}$. Therefore, a larger parameter space is expected to be detected at colliders. We then investigate the promising region at the 14 TeV HL-LHC and the 3 TeV CLIC. According to our simulation, the DV signature could probe $\\|V\\_{\\ell N}\\|^2\\gtrsim10^{-19}$ with $m\\_N<m\\_{H^+}$, which covers the seesaw predicted value $\\|V\\_{\\ell N}\\|^2\\sim m\\_\\nu/m\\_N$. We could probe $m\\_{H^+}\\lesssim1200$ GeV at the 14 TeV HL-LHC and $m\\_{H^+}\\lesssim1490$ GeV at the 3 TeV CLIC.\n\n", "2406.16081": "2024-06-23, **Impact of reactor neutrino uncertainties on coherent scattering's discovery potential**, Leendert Hayen et.al., [2406.16081v1](http://arxiv.org/abs/2406.16081v1)\n\n Nuclear power reactors are the most intense man-made source of antineutrino's and have long been recognized as promising sources for coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) studies. Its observation and the spectral shape of the associated recoil spectrum is sensitive to a variety of exotic new physics scenarios and many experimental efforts are underway. Within the context of the reactor antineutrino anomaly, which initially indicated eV-scale sterile neutrino's, the modeling of the reactor antineutrino spectrum has seen a significant evolution in the last decade. Even so, uncertainties remain due to a variety of nuclear structure effects, incomplete information in nuclear databases and fission dynamics complexities. Here, we investigate the effects of these uncertainties on one's ability to accurately distinguish new physics signals. For the scenarios discussed here, we find that reactor spectral uncertainties are similar in magnitude to the projected sensitivities pointing towards a need for $\\beta$ spectroscopy measurements below the inverse $\\beta$ decay threshold.\n\n", "2406.16059": "2024-06-23, **Measurement of the $\\mathrm{{}^{12}C}(e,e')$ cross sections at $Q^2=0.8\\,\\mathrm{GeV}^2/c^2$**, M. Mihovilovič et.al., [2406.16059v1](http://arxiv.org/abs/2406.16059v1)\n\n We present the findings of a study based on a new inelastic electron-scattering experiment on the ${}^{12}\\mathrm{C}$ nucleus focusing on the kinematic region of $Q^2=0.8\\,\\mathrm{GeV}^2/{c}^2$. The measured cross section is sensitive to the transverse response function and provides a stringent test of theoretical models, as well as of the theoretical assumptions made in Monte-Carlo event-generator codes developed for the interpretation of neutrino-nucleus experiments, such as DUNE and HyperK. We find that modern generators such as GENIE and GiBUU reproduce our new experimental data within 10$\\%$.\n\n"}, "dark matter": {"2406.16840": "2024-06-24, **A new upper limit on the axion-photon coupling with an extended CAST run with a Xe-based Micromegas detector**, CAST Collaboration et.al., [2406.16840v1](http://arxiv.org/abs/2406.16840v1)\n\n Hypothetical axions provide a compelling explanation for dark matter and could be emitted from the hot solar interior. The CERN Axion Solar Telescope (CAST) has been searching for solar axions via their back conversion to X-ray photons in a 9-T 10-m long magnet directed towards the Sun. We report on an extended run with the IAXO (International Axion Observatory) pathfinder detector, doubling the previous exposure time. The detector was operated with a xenon-based gas mixture for part of the new run, providing technical insights for future detector configurations in IAXO. No counts are detected in the 95\\% signal-encircling region during the new run, while one is expected. The new data improve the axion-photon coupling limit to 5.7$\\times 10^{-11}\\,$GeV$^{-1}$ at 95\\% C.L., the most restrictive experimental limit to date.\n\n", "2406.16796": "2024-06-24, **Modeling of axion and electromagnetic fields coupling in a particle-in-cell code**, Xiangyan An et.al., [2406.16796v1](http://arxiv.org/abs/2406.16796v1)\n\n Axions have aroused widespread research interest because they can solve the strong CP problem and serve as a possible candidate for dark matter. Currently, people have explored a lot of axion detection experiments, including passively detecting the existing axions in the universe, and actively generating axions in the laboratory. Recently, axion-coupled laser-plasma interactions have been discussed as a novel method to detect axions. Petawatt (PW) lasers are considered as a powerful tool to study not only the vacuum polarization but also the axion coupling, due to their extreme fields. However, particle-in-cell (PIC) simulation is still missed in current studies, which limits the understanding of axion-coupled laser-plasma interactions. In this paper, we proposed the method to include the axion field and the coupling with electromagnetic (EM) fields in PIC codes. The axion wave equation and modified Maxwell's equations are numerically solved, while the EM field modulation from axions is considered as a first-order perturbation. Meanwhile, different axion field boundary conditions are considered to satisfy different simulation scenarios. The processes of conversions between axions and photons, and weak laser pulse propagation with axion effects are checked as benchmarks of the code. Such an extended PIC code may help researchers develop novel axion detection schemes based on laser-plasma interactions and provide a better understanding of axion-coupled astrophysical processes.\n\n", "2406.16769": "2024-06-24, **Determination of dark matter distribution in Ursa Major III and constraints on dark matter annihilation**, Yi Zhao et.al., [2406.16769v1](http://arxiv.org/abs/2406.16769v1)\n\n The recently discovered satellite dwarf galaxy Ursa Major III provides a promising opportunity to explore the signatures resulting from dark matter (DM) annihilation, due to its proximity and large J-factor. Owing to the absence of an excess of $\\gamma$-ray signatures originating from Ursa Major III, observations of $\\gamma$-rays, such as those from Fermi-LAT, can be utilized to set constraints on the DM annihilation cross section. In this study, we determine the DM density profile, and consider the relationship between DM density and velocity dispersion at different locations within Ursa Major III through Jeans analysis. We calculate the J-factor of Ursa Major III for s-wave annihilation, along with the effective J-factors for p-wave and Sommerfeld enhanced annihilation scenarios. Utilizing these derived J-factors, we set stringent constraints on DM annihilation cross sections in three scenarios. Given the substantial impact of member star identification on the J-factor of Ursa Major III, we further calculate J-factors with the condition of excluding the largest velocity outlier. Our analysis reveals a notable reduction in the median value and an increase in the deviation of J-factors, thereby leading to considerably weaker constraints.\n\n", "2406.16545": "2024-06-24, **Canonical quantization of the dark Dirac field and time asymmetry**, Andrei Galiautdinov et.al., [2406.16545v1](http://arxiv.org/abs/2406.16545v1)\n\n We perform canonical quantization of the single-component, spin-zero field that was introduced by Dirac in 1971 and recently suggested as a candidate for dark matter by Bogomolny. The massive and massless cases are treated separately. Since in the massive case only positive-frequency modes are normalizable and regarded as physical, the mode expansion for the field involves annihilation operators only, making the quantization procedure particularly simple. The corresponding Hamiltonian of the system turns out to be unambiguous, with no need for normal ordering. The positive-energy requirement imposed on the second-quantized system leads to bosonic commutation relations, in agreement with the spin-statistics theorem. The boson nature of the positive-energy Dirac particles, which, evidently, have no antiparticles, hints at the possibility of a dark, background Bose-Einstein condensate that drives different parts of the universe in the same temporal direction. In the massless case, on the other hand, we explore the possibility of allowing the mode expansion to involve both positive- and negative-frequency components, which leads to the anticommutation relations, resulting in the fermionic behavior of the field in ultrarelativistic limit.\n\n", "2406.16103": "2024-06-23, **Populating Galaxies Into Halos Via Machine Learning on the Simba Simulation**, Pratyush Kumar Das et.al., [2406.16103v1](http://arxiv.org/abs/2406.16103v1)\n\n We present machine learning (ML)-based pipelines designed to populate galaxies into dark matter halos from N-body simulations. These pipelines predict galaxy stellar mass ($M\\_*$), star formation rate (SFR), atomic and molecular gas contents, and metallicities, and can be easily extended to other galaxy properties and simulations. Our approach begins by categorizing galaxies into central and satellite classifications, followed by their ML classification into quenched (Q) and star-forming (SF) galaxies. We then develop regressors specifically for the SF galaxies within both central and satellite subgroups. We train the model on the $(100\\mathrm{h^{-1}Mpc})^3$ Simba galaxy formation simulation at $z=0$. Our pipeline yields robust predictions for stellar mass and metallicity and offers significant improvements for SFR and gas properties compared to previous works, achieving an unbiased scatter of less than 0.2 dex around true Simba values for the halo-$M\\_{\\rm HI}$ relation of central galaxies. We also show the effectiveness of the ML-based pipelines at $z=1,2$. Interestingly, we find that training on fraction-based properties (e.g. $M\\_{\\rm HI}$/$M\\_{*}$) and then multiplying by the ML-predicted $M\\_{*}$ yields improved predictions versus directly training on the property value, for many quantities across redshifts. However, we find that the ML-predicted scatter around the mean is lower than the true scatter, leading to artificially suppressed distribution functions at high values. To alleviate this, we add a \"ML scatter bias\", finely tuned to recover the true distribution functions, critical for accurate predictions of integrated quantities such as $\\rm{HI}$ intensity maps.\n\n"}, "supernova": {"2406.16533": "2024-06-24, **The fate of the interstellar medium in early-type galaxies. IV. The impact of stellar feedback, mergers, and black holes on the cold ISM in simulated galaxies**, Jakub Nadolny et.al., [2406.16533v1](http://arxiv.org/abs/2406.16533v1)\n\n Removing cold interstellar medium (ISM) from a galaxy is central to quenching star formation. However, the exact mechanism of this process remains unclear. The objective of this work is to find the mechanism responsible for dust and gas removal in simulated early-type galaxies (ETGs). A statistically significant sample of massive (M\\_*>$10^{10}$M$\\_\\odot$), simulated ETG in a redshift range of 0.02--0.32 is studied in the context of its ISM properties. In particular, we investigate the cold dust and gas removal timescales, the cold gas inflows, and their relation with black hole (BH) mass. We also investigate the evolution of galaxies in the dust vs. star formation rate (SFR) plane and the influence of merger events. We find agreement with previous observational works considering the timescales of dust and HI removal from ETGs. When considering the dust-to-stellar mass ratio as a function of time in simulations, we recovered a similar decline as in the observational sample as a function of stellar age, validating its use for timing the ISM decline. Moreover, we recover the observed relation between dust mass and SFR for actively star-forming galaxies as well as for passive ETGs. We also show that starburst galaxies form their own sequence on the dust vs. SFR plot in a form $\\log(M\\_{\\rm dust, SB})= 0.913\\times \\log({\\rm SFR}) + 6.533$ with $2\\sigma$ scatter of 0.32. Finally, we find that type II supernova reverse shocks dominate the dust destruction at the early stages of ETG evolution, while at later times stellar feedback becomes more important. We show that merger events lead to morphological transformations by increasing the bulge-to-total stellar mass ratio followed by an increase in BH masses. The BH feedback resulting from radio mode accretion prevents the hot halo gas from cooling, indirectly leading to a decrease in the SFR.\n\n", "2406.16517": "2024-06-24, **Stellar Winds**, Jorick S. Vink et.al., [2406.16517v1](http://arxiv.org/abs/2406.16517v1)\n\n Stellar winds form an integral part of astronomy. The solar wind affects Earth's magnetosphere, while the winds of hot massive stars are highly relevant for galactic feedback through their mechanical wind energy. In different parts of the stellar HR diagram different forces dominate. On the hot side of the HRD radiative forces on ionised gas particles are active, while on the cool side molecular and dust opacities take over. Moreover, due to the convective envelopes, alternative physical ingredients may start to dominate. I will describe the basic equation of motion and give a few examples, mostly focusing on the winds from massive stars. Here mass-loss rates significantly affect the stellar evolution all the way to core collapse as a supernova and/or black hole formation event.\n\n"}}