{"neutrino": {"2408.12472": "2024-08-22, **A novel method to indirectly reconstruct neutrinos in collider experiments**, Hongrong Qi et.al., [2408.12472v1](http://arxiv.org/abs/2408.12472v1)\n\n The inclusive tagging method is a highly efficient reconstruction approach, especially in beauty-physics experiments. In this Letter, we introduce an innovative inclusive-tagging scheme that is capable of capturing the four-momentum of an undetected particle on the signal side, such as a neutrino, K\\_L^0, etc., in collider experiments. This proposed scheme, based on an asymptotically recursive vector sequence, has the potential to catalyze a significant transformation in the capabilities of the inclusive tagging method and might also have promising applications in other fields.\n\n", "2408.12462": "2024-08-22, **Unveiling the Physics of Core-Collapse Supernovae with the Line Emission Mapper: Observing Cassiopeia A**, S. Orlando et.al., [2408.12462v1](http://arxiv.org/abs/2408.12462v1)\n\n (Abridged) Core-collapse supernova remnants (SNRs) display complex morphologies and asymmetries, reflecting anisotropies from the explosion and early interactions with the circumstellar medium (CSM). Spectral analysis of these remnants can provide critical insights into supernova (SN) engine dynamics, the nature of progenitor stars, and the final stages of stellar evolution, including mass-loss mechanisms in the millennia leading up to the SN.   This white paper evaluates the potential of the Line Emission Mapper (LEM), an advanced X-ray probe concept proposed in response to NASA 2023 APEX call, to deliver high-resolution spectra of SNRs. Such capabilities would allow detailed analysis of parent SNe and progenitor stars, currently beyond our possibilities. We employed a hydrodynamic model that simulates the evolution of a neutrino-driven SN from core-collapse to a 2000-year-old mature remnant. This model successfully replicates the large-scale properties of Cassiopeia A at an age of about 350 years.   Using this model, we synthesized mock LEM spectra from different regions of the SNR, considering factors like line shifts and broadening due to plasma bulk motion and thermal ion motion, deviations from ionization and temperature equilibrium, and interstellar medium absorption. Analyzing these mock spectra with standard tools revealed LEM impressive capabilities. We demonstrated that fitting these spectra with plasma models accurately recovers the line-of-sight velocity of the ejecta, enabling 3D structure exploration of shocked ejecta, similar to optical methods. LEM also distinguishes between Doppler and thermal broadening of ion lines and measures ion temperatures near the limb of SNRs, providing insights into ion heating at shock fronts and cooling in post-shock flows. This study highlights LEM potential to advance our understanding of core-collapse SN dynamics and related processes.\n\n", "2408.12450": "2024-08-22, **Thermal and non-thermal dark matters with gravitational neutrino reheating**, Md Riajul Haque et.al., [2408.12450v1](http://arxiv.org/abs/2408.12450v1)\n\n We have discussed in detail how neutrinos produced from inflaton solely through gravitational interaction can successfully reheat the universe. For this, we have introduced the well-known Type-I seesaw neutrino model. Depending on seesaw model parameters, two distinct reheating histories have been realized and dubbed as i) Neutrino dominating: Following the inflaton domination, the universe becomes neutrino dominated, and their subsequent decay concludes the reheating process, and ii) Neutrino heating: Despite being sub-dominant compared to inflaton energy, neutrinos efficiently heat the thermal bath and produce the radiation dominated universe. Imposing baryon asymmetric yield, the $\\Delta N\\_{\\rm eff}$ constraint at Big Bang Nucleosynthesis (BBN) considering primordial gravitational waves (PGW), we have arrived at the following constraints on reheating equation of state to lie within $0.5\\lesssim w\\_\\phi\\lesssim1.0$. In these neutrino-driven reheating backgrounds, we further performed a detailed analysis of both thermal and non-thermal production of dark matter (DM), invoking two minimal models, namely the Higgs portal DM and classical QCD pseudo scalar axion. An interesting correlation between seemingly uncorrelated DM and Type-I seesaw parameters has emerged when confronting various direct and indirect observations. When DMs are set to freeze-in, freeze-out, or oscillate during reheating, new parameter spaces open, which could be potentially detectable in future experiments, paving an indirect way to look into the early universe in the laboratory.\n\n", "2408.12448": "2024-08-22, **Nuclear Production and Analytic Attenuation of Energetic MeV Solar Dark Matter**, Shao-Feng Ge et.al., [2408.12448v1](http://arxiv.org/abs/2408.12448v1)\n\n We propose a solar production mechanism of MeV dark matter to overcome the energy threshold in direct detection experiments. In particular, the proton and deuteron fussion to ${}^3 \\mathrm{He}$ of the $pp$ chain that produces energetic neutrino and gamma photon with 5.5$\\,$MeV of energy release can also produce a pair of dark matter particles. Besides, we establish an analytical formalism of using the Boltzmann equation to study the solar attenuation effect on the produced dark matter flux. The projected sensitivity is illustrated with Argon target at the DarkSide-LowMass experiment.\n\n", "2408.12155": "2024-08-22, **Féeton dark matter above the $e^-e^+$ threshold**, Tatsuya Hayashi et.al., [2408.12155v1](http://arxiv.org/abs/2408.12155v1)\n\n The new gauge boson introduced in the minimal extension of the standard model (SM) by gauging the U(1)$\\_{\\rm B-L}$ symmetry plays the role of dark matter when the U(1)$\\_{\\rm B-L}$ gauge coupling is highly suppressed. This dark matter, named the F\\'eeton dark matter is known to be efficiently created in the early universe by inflationary fluctuations with minimal gravity coupling, hence the framework, the gauged U(1)$\\_{\\rm B-L}$ extended SM + inflation, solves the four major problems of the SM; neutrino masses/mixings, dark matter, baryon asymmetry of the universe, and the initial condition of the universe (inflation). We comprehensively study the phenomenology of the dark matter when it is heavier than the $e^- e^+$ threshold, namely twice the electron mass, considering the threshold effect on the dark matter decay into $e^- e^+$. The viable parameter region is found only in the threshold region, while the branching fraction of the decay into $e^- e^+$ (i.e., the $e^- e^+$ signal) never vanishes even at the threshold due to the effect. As a result, the pure U(1)$\\_{\\rm B-L}$ extension without the kinetic mixing between the U(1)$\\_{\\rm B-L}$ and hyper-charge gauge bosons have already been excluded by the present observation of the 511\\,keV photon from the galactic center. So, the F\\'eeton dark matter requires a non-zero kinetic mixing to be a viable dark matter candidate and will be efficiently explored by future MeV-gamma ray telescopes thanks to the non-vanishing decay process into $e^- e^+$.\n\n", "2408.12123": "2024-08-22, **Search for neutrino signals correlated with LHAASO diffuse Galactic emission**, Wenlian Li et.al., [2408.12123v1](http://arxiv.org/abs/2408.12123v1)\n\n The diffuse Galactic $\\gamma$-ray emission originates from the interactions between cosmic rays and the interstellar medium or radiation fields within our Galaxy, where the production of neutrinos is also anticipated. Recently, the Large High Altitude Air Shower Observatory (LHAASO) reported measurements of diffuse $\\gamma$-rays from the Galactic plane with energies ranging from sub-TeV to 1 PeV. Using publicly available 7 years of IceCube track data with the full detector, we conduct a template search using the $\\gamma$-ray flux map observed by LHAASO-KM2A as the neutrino emission template and perform a scan search of the Galactic plane. In the template search, a mild excess of neutrinos is observed in the Galactic plane with a pretrial significance of $1.9\\sigma$. The measured muon neutrino intensity at 25 TeV is $4.73^{+2.53}\\_{-2.51}\\times10^{-14}\\,{\\rm TeV^{-1}\\,cm^{-2}\\,s^{-1}\\,sr^{-1}}$, consistent with the expected neutrino flux assuming that all the diffuse Galactic $\\gamma$-rays originate from hadronic interactions. In the Galactic plane scan search, the most significant location is found at $l=63.57^{\\circ}$ and $b=0.93^{\\circ}$ with a pretrial (posttrial) significance of $4.6\\sigma$ ($1.8\\sigma$).\n\n"}, "dark matter": {"2408.12587": "2024-08-22, **Reconstructing the Inflaton Potential: Primordial Black Holes and Gravitational Waves in Slow Roll and Ultra Slow Roll Single Field Inflation**, Gabriele Autieri et.al., [2408.12587v1](http://arxiv.org/abs/2408.12587v1)\n\n We present new single field inflationary scenarios that produce the critical abundance of primordial black holes as dark matter reconstructing the inflaton potential from an input power spectrum. The method is exact in the slow roll approximation but remains effective even when the slow roll conditions are temporarily violated such as in ultra slow roll models. With this method we construct new ultra slow roll scenarios and also models that reproduce the DM abundance within the slow roll regime. As a second application we consider a scalar power spectrum that generates a secondary gravitational wave background compatible with the one recently observed in Pulsar Timing Arrays experiments. These scenarios could be tested by future observations of $\\mu-$distortions of the CMB.\n\n", "2408.12442": "2024-08-22, **From Halos to Galaxies. VI. Improved halo mass estimation for SDSS groups and measurement of the halo mass function**, Dingyi Zhao et.al., [2408.12442v1](http://arxiv.org/abs/2408.12442v1)\n\n In $\\Lambda$CDM cosmology, galaxies form and evolve in their host dark matter (DM) halos. Halo mass is crucial for understanding the halo-galaxy connection. The abundance matching (AM) technique has been widely used to derive the halo masses of galaxy groups. However, quenching of the central galaxy can decouple the coevolution of its stellar mass and DM halo mass. Different halo assembly histories can also result in significantly different final stellar mass of the central galaxies. These processes can introduce substantial uncertainties in the halo masses derived from the AM method, particularly leading to a systematic bias between groups with star-forming centrals (blue groups) and passive centrals (red groups). To improve, we developed a new machine learning (ML) algorithm that accounts for these effects and is trained on simulations. Our results show that the ML method eliminates the systematic bias in the derived halo masses for blue and red groups and is, on average, $\\sim1/3$ more accurate than the AM method. With careful calibration of observable quantities from simulations and observations from SDSS, we apply our ML model to the SDSS Yang et al. groups to derive their halo masses down to $10^{11.5}\\mathrm{M\\_\\odot}$ or even lower. The derived SDSS group halo mass function agrees well with the theoretical predictions, and the derived stellar-to-halo mass relations for both red and blue groups matches well with those obtained from direct weak lensing measurements. These new halo mass estimates enable more accurate investigation of the galaxy-halo connection and the role of the halos in galaxy evolution.\n\n", "2408.12424": "2024-08-22, **Singlet-Doublet Fermionic Dark Matter in Gauge Theory of Baryons**, Taramati et.al., [2408.12424v1](http://arxiv.org/abs/2408.12424v1)\n\n We are considering a minimal $U(1)\\_B$ extension of the Standard Model (SM) by promoting the baryon number as a local gauge symmetry to accommodate a stable dark matter (DM) candidate. The gauge theory of baryons induces non-trivial triangle gauge anomalies, and we provide a simple anomaly-free solution by adding three exotic fermions. A scalar $S$ spontaneously breaks the $U(1)\\_B$ symmetry, leaving behind a discrete $Z\\_2$ symmetry that ensures the stability of the lightest exotic fermion was originally introduced to cancel the triangle gauge anomalies. Scenarios with weakly interacting DM candidates having non-zero hypercharge usually face stringent constraints from experimental bounds on the DM spin-independent direct-detection (SIDD) cross-section. In this work, we consider a two-component singlet-doublet fermionic dark matter scenario, which significantly relaxes the constraints from bounds on the DM SIDD cross-section for suppressed singlet-doublet mixing. We show that the model offers a viable parameter space for a cosmologically consistent DM candidate that can be probed through direct and indirect searches, collider experiments, and gravitational wave (GW) experiments.\n\n", "2408.12403": "2024-08-22, **Quantifying $S_8$ tension and evidence for interacting dark energy from redshift-space distortion measurements**, Miguel A. Sabogal et.al., [2408.12403v1](http://arxiv.org/abs/2408.12403v1)\n\n In recent years, Cosmic Microwave Background (CMB) observations, Weak Lensing surveys, and $f(z)\\sigma\\_8(z)$ measurements from Redshift-Space Distortions (RSD) have revealed a significant ($\\sim$3$-$5$\\sigma$) discrepancy in the inferred value of the matter clustering parameter $S\\_8$. In this work, we investigate the implications of RSD for a cosmological framework postulating an interaction between Dark Energy (DE) and Dark Matter (DM). We explore scenarios where DM can transfer energy-momentum to DE or vice versa. The energy-momentum flow is characterized by the strength and the sign of the coupling parameter $\\xi$. Our baseline analysis combines RSD measurements with the latest data from Baryon Acoustic Oscillations (BAO) observed by DESI, Type Ia Supernovae from the PantheonPlus sample, and CMB data from Planck. We demonstrate that RSD measurements provide significant additional information. When energy-momentum flows from DM to DE (i.e., $\\xi < 0$), these measurements set stringent new bounds on the interaction strength. Conversely, when energy-momentum flows from DE to DM ($\\xi > 0$), they favor interactions at more than the $2\\sigma$ confidence level. Models with $\\xi > 0$ can effectively resolve the tension in $S\\_8$, presenting them as compelling alternatives.\n\n", "2408.12342": "2024-08-22, **Q-ball collisions and their Gravitational Waves**, Deog Ki Hong et.al., [2408.12342v1](http://arxiv.org/abs/2408.12342v1)\n\n Sydney Coleman's Q-ball remains a compelling instance of localised object formation within classical field theory, independently of the quantum evolution. The theoretical possibility of such objects forming and colliding in the early universe from models such as Affleck-Dine fragmentation, or from a number of mechanisms where they are produced copiously with various size and charges to be dark matter candidates, makes it important to study in detail Q-ball collision phenomenology. In this work we present results from a study of Q-ball collisions and their gravitational waves, using a new general code package for scalar fields coupled to gravity. We then comment on the possibility of future gravitational wave detectors searching for signals of Q-ball collisions.\n\n", "2408.12341": "2024-08-22, **Interacting dark sector from Horndeski theories and beyond: Mapping fields and fluids**, Pulkit Bansal et.al., [2408.12341v1](http://arxiv.org/abs/2408.12341v1)\n\n In Cosmology, when dissipative effects are minimal, the energy content of the Universe can be effectively described as a sum of perfect fluids. Perfect fluid descriptions ensure thermal equilibrium since they equilibrate immediately. However, interactions among different energy content of the Universe might prevent such rapid equilibration. This limitation calls for a more fundamental framework that incorporates these interactions directly at the level of the action. In earlier work, two of the authors demonstrated that an interacting dark energy (DE)-dark matter (DM) field theory action could be derived from a modified gravity action via a conformal transformation, establishing a one-to-one correspondence between the field theory action and fluid for a unique interaction term [arXiv:2006.04618]. In this work, we extend that analysis by considering quadratic order Horndeski gravity, identifying two classes of models: field coupling and field-kinetic coupling. Our approach generalizes the coupling function for DE-DM interactions by incorporating an additional dependence on kinetic terms. We establish a field-to-fluid mapping for dark matter and find that this mapping only holds for a specific form of the interaction strength. Interestingly, we show that this interaction strength excludes non-gravitational interactions between dark energy and dark radiation. Numerical analysis reveals that purely kinetic interactions within the dark sector can significantly alter cosmological evolution compared to non-interacting scenarios, highlighting the strong dependence of cosmological dynamics on coupling strength. A preliminary examination of linear scalar perturbations indicates that the field-kinetic coupling results in a non-zero gravitational slip parameter and momentum exchange.\n\n", "2408.12144": "2024-08-22, **New Limits on Light Dark Matter-Nucleon Scattering**, Peter Cox et.al., [2408.12144v1](http://arxiv.org/abs/2408.12144v1)\n\n We derive new bounds on hadronically-interacting, sub-GeV mass dark matter. First, we show that one-loop interactions with photons can be sufficient to maintain equilibrium between the dark matter and Standard Model sectors at MeV temperatures, resulting in constraints from Big Bang Nucleosynthesis and the Cosmic Microwave Background. Using chiral perturbation theory, we find that this leads to an upper bound on the dark-matter--nucleon scattering cross-section that is orders of magnitude stronger than existing astrophysical constraints. Furthermore, we compute new bounds from rare Kaon decays and find that these provide even stronger constraints. Our results have implications for future direct detection experiments aiming to search for MeV-scale dark matter.\n\n", "2408.12132": "2024-08-22, **Imprints of dark matter on the structural properties of minimally deformed compact stars**, Z. Yousaf et.al., [2408.12132v1](http://arxiv.org/abs/2408.12132v1)\n\n In this manuscript, we investigate the possibility of constructing anisotropic dark matter compact stars motivated by the Einasto density profile. This work develops analytical solutions for an anisotropic fluid sphere within the framework of the well-known Adler-Finch-Skea metric. This toy model incorporates an anisotropic fluid distribution that includes a dark matter component. We use the minimal geometric deformation scheme within the framework of gravitational decoupling to incorporate anisotropy into the pressure profile of the stellar system. In this context, we model the temporal constituent of the $\\Theta$-field sector to characterize the contribution of dark matter within the gravitational matter source. We present an alternative approach to studying anisotropic self-gravitating structures. This approach incorporates additional field sources arising from gravitational decoupling, which act as the dark component. We explicitly verify whether the proposed model satisfies all the requirements for describing realistic compact structures in detail. We conclude that the modeling of the Einasto density model with the Adler-Finch-Skea metric gives rise to the formation of well-behaved and viable astrophysical results that can be employed to model the dark matter stellar configurations.\n\n", "2408.12052": "2024-08-22, **Cosmological perturbations with ultralight vector dark matter fields: numerical implementation in CLASS**, Tomás Ferreira Chase et.al., [2408.12052v1](http://arxiv.org/abs/2408.12052v1)\n\n In this work we consider a dark matter candidate described by an ultralight vector field, whose mass is in principle in the range $H\\_{\\rm{eq}}\\sim 10^{-28}\\rm{eV}\\ll m< \\rm{eV}$. The homogeneous background vector field is assumed to point in a given direction. We present a numerical implementation of cosmological perturbations in a Bianchi type I geometry with vector field dark matter in a modified version of the Cosmic Linear Anisotropy Solving System (CLASS). We study the evolution of large-scale cosmological perturbations in the linear regime. We compute the matter power spectrums defined for Fourier modes pointing in a given direction. We obtain interesting features in the power spectrums whose observational significance depends on the field mass. We compare the results with the standard $\\rm{\\Lambda CDM}$ and with the corresponding well-studied ultralight scalar field dark matter case. As for the scalar case we obtain a suppression in the power spectrums at small scales characterized by the same scale, namely the Jeans scale. The main characteristic feature of the vector field model we notice here for first time is that the amplitude of the suppression effect depends on the direction of the Fourier modes with respect to the background vector field, leaving eventually a possible anisotropic imprint in structure formation at small scales.\n\n"}, "supernova": {"2408.12403": "2024-08-22, **Quantifying $S_8$ tension and evidence for interacting dark energy from redshift-space distortion measurements**, Miguel A. Sabogal et.al., [2408.12403v1](http://arxiv.org/abs/2408.12403v1)\n\n In recent years, Cosmic Microwave Background (CMB) observations, Weak Lensing surveys, and $f(z)\\sigma\\_8(z)$ measurements from Redshift-Space Distortions (RSD) have revealed a significant ($\\sim$3$-$5$\\sigma$) discrepancy in the inferred value of the matter clustering parameter $S\\_8$. In this work, we investigate the implications of RSD for a cosmological framework postulating an interaction between Dark Energy (DE) and Dark Matter (DM). We explore scenarios where DM can transfer energy-momentum to DE or vice versa. The energy-momentum flow is characterized by the strength and the sign of the coupling parameter $\\xi$. Our baseline analysis combines RSD measurements with the latest data from Baryon Acoustic Oscillations (BAO) observed by DESI, Type Ia Supernovae from the PantheonPlus sample, and CMB data from Planck. We demonstrate that RSD measurements provide significant additional information. When energy-momentum flows from DM to DE (i.e., $\\xi < 0$), these measurements set stringent new bounds on the interaction strength. Conversely, when energy-momentum flows from DE to DM ($\\xi > 0$), they favor interactions at more than the $2\\sigma$ confidence level. Models with $\\xi > 0$ can effectively resolve the tension in $S\\_8$, presenting them as compelling alternatives.\n\n", "2408.12393": "2024-08-22, **Massive stars exploding in a He-rich circumstellar medium $-$ X. Flash spectral features in the Type Ibn SN 2019cj and observations of SN 2018jmt**, Z. -Y. Wang et.al., [2408.12393v1](http://arxiv.org/abs/2408.12393v1)\n\n We present optical and near-infrared observations of two Type Ibn supernovae (SNe), SN 2018jmt and SN 2019cj. Their light curves have rise times of about 10 days, reaching an absolute peak magnitude of $M\\_g$(SN 2018jmt) = $-$19.07 $\\pm$ 0.37 and $M\\_V$(SN 2019cj) = $-$18.94 $\\pm$ 0.19 mag, respectively. The early-time spectra of SN 2018jmt are dominated by a blue continuum, accompanied by narrow (600$-$1000 km~s$^{-1}$) He I lines with P-Cygni profile. At later epochs, the spectra become more similar to those of the prototypical SN Ibn 2006jc. At early phases, the spectra of SN 2019cj show flash ionisation emission lines of C III, N III and He II superposed on a blue continuum. These features disappear after a few days, and then the spectra of SN 2019cj evolve similarly to those of SN 2018jmt. The spectra indicate that the two SNe exploded within a He-rich circumstellar medium (CSM) lost by the progenitors a short time before the explosion. We model the light curves of the two SNe Ibn to constrain the progenitor and the explosion parameters. The ejecta masses are consistent with either that expected for a canonical SN Ib ($\\sim$ 2 M$\\_{\\odot}$) or those from a massive WR star ($>$ $\\sim$ 4 M$\\_{\\odot}$), with the kinetic energy on the order of $10^{51}$ erg. The lower limit on the ejecta mass ($>$ $\\sim$ 2 M$\\_{\\odot}$) argues against a scenario involving a relatively low-mass progenitor (e.g., $M\\_{ZAMS}$ $\\sim$ 10 M$\\_{\\odot}$). We set a conservative upper limit of $\\sim$0.1 M$\\_{\\odot}$ for the $^{56}$Ni masses in both SNe. From the light curve modelling, we determine a two-zone CSM distribution, with an inner, flat CSM component, and an outer CSM with a steeper density profile. The physical properties of SN 2018jmt and SN 2019cj are consistent with those expected from the core collapse of relatively massive, stripped-envelope (SE) stars.\n\n"}}