{"neutrino": {"2412.15154": "2024-12-19, **ProtoDUNE Photon Detection System**, J. Soto-Oton et.al., [2412.15154v1](http://arxiv.org/abs/2412.15154v1)\n\n The Deep Underground Neutrino Experiment (DUNE) is a long-baseline neutrino oscillation experiment aiming to measure the oscillation parameters with an unprecedented precision that will allow determining the CP violation phase in the leptonic sector and the neutrino mass ordering. The Far Detector of DUNE will consist of four 17 kton liquid argon Time Projection Chambers (LAr-TPC). Inside a LAr-TPC, a Photon Detection System (PDS) is needed to detect the scintillation light produced by the interacting particles. The PDS signal provides the interaction time for non-beam events and improves the calorimetric reconstruction. To validate DUNE technology, two large-scale prototypes, of 750 ton of LAr each, have been constructed at CERN, ProtoDUNE-HD and ProtoDUNE-VD. The PDS of both prototypes is based on the XArapuca concept, a SiPM-based device that provides good detection efficiency covering large surfaces at a reasonable cost. This document presents the preliminary performance of the ProtoDUNE-HD Photon Detection System, which has taken data from April to November 2024.\n\n", "2412.15144": "2024-12-19, **Primordial Gravitational Wave Probes of Non-Standard Thermal Histories**, Annet Konings et.al., [2412.15144v1](http://arxiv.org/abs/2412.15144v1)\n\n Primordial gravitational waves propagate almost unimpeded from the moment they are generated to the present epoch. Nevertheless, they are subject to convolution with a non-trivial transfer function. Within the standard thermal history, shifts in the temperature-redshift relation combine with damping effects by free streaming neutrinos to non-trivially process different wavelengths during radiation domination, with subsequently negligible effects at later times. Presuming a nearly scale invariant primordial spectrum, one obtains a characteristic late time spectrum, deviations from which would indicate departures from the standard thermal history. Given the paucity of probes of the early universe physics before nucleosynthesis, it is useful to classify how deviations from the standard thermal history of the early universe can be constrained from observations of the late time stochastic background. The late time spectral density has a plateau at high frequencies that can in principle be significantly enhanced or suppressed relative to the standard thermal history depending on the equation of state of the epoch intervening reheating and the terminal phase of radiation domination, imprinting additional features from bursts of entropy production, and additional damping at intermediate scales via anisotropic stress production. In this paper, we survey phenomenologically motivated scenarios of early matter domination, kination, and late time decaying particles as representative non-standard thermal histories, elaborate on their late time stochastic background, and discuss constraints on different model scenarios.\n\n", "2412.15067": "2024-12-19, **General Form of Effective Operators from Hidden Sectors**, Aqeel Ahmed et.al., [2412.15067v1](http://arxiv.org/abs/2412.15067v1)\n\n We perform a model-independent analysis of the dimension-six terms that are generated in the low energy effective theory when a hidden sector that communicates with the Standard Model (SM) through a specific portal operator is integrated out. We work within the Standard Model Effective Field Theory (SMEFT) framework and consider the Higgs, neutrino and hypercharge portals. We find that, for each portal, the forms of the leading dimension-six terms in the low-energy effective theory are fixed and independent of the dynamics in the hidden sector. For the Higgs portal, we find that two independent dimension-six terms are generated, one of which has a sign that, under certain conditions, is fixed by the requirement that the dynamics in the hidden sector be causal and unitary. In the case of the neutrino portal, for a single generation of SM fermions and assuming that the hidden sector does not violate lepton number, a unique dimension-six term is generated, which corresponds to a specific linear combination of operators in the Warsaw basis. For the hypercharge portal, a unique dimension-six term is generated, which again corresponds to a specific linear combination of operators in the Warsaw basis. For both the neutrino and hypercharge portals, under certain conditions, the signs of these terms are fixed by the requirement that the hidden sector be causal and unitary. We perform a global fit of these dimension-six terms to electroweak precision observables, Higgs measurements and diboson production data and determine the current bounds on their coefficients.\n\n", "2412.15055": "2024-12-19, **Leptoquark-induced radiative masses for active and sterile neutrinos within the framework of the 3-3-1 model**, A. Doff et.al., [2412.15055v1](http://arxiv.org/abs/2412.15055v1)\n\n In this work, we introduce the minimal set of leptoquarks into the 3-3-1 model with right-handed neutrinos, capable of generating radiative masses for active neutrinos. As a main consequence, the standard neutrinos acquire small Majorana masses at the one-loop level, while right-handed (sterile) neutrinos obtain small Majorana masses at the two-loop level, naturally making them light particles as well. Additionally, we discuss the viability of this scenario and several other interesting phenomenological consequences, including its impact on $B$-meson physics and rare Higgs decays, both of which are also induced by the leptoquarks.\n\n", "2412.14991": "2024-12-19, **Neutrino electromagnetic properties and sterile dipole portal in light of the first solar CE$ν$NS data**, Valentina De Romeri et.al., [2412.14991v1](http://arxiv.org/abs/2412.14991v1)\n\n Despite being neutral particles, neutrinos can acquire non-zero electromagnetic properties from radiative corrections that can be induced by the presence of new physics. Electromagnetic neutrino processes induce spectral distortions in neutrino scattering data, which are especially visible at experiments characterized by low recoil thresholds. We investigate how neutrino electromagnetic properties confront the recent indication of coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) from $^8$B solar neutrinos in dark matter direct detection experiments. We focus on three possibilities: neutrino magnetic moments, neutrino electric charges, and the active-sterile transition magnetic moment portal. We analyze recent XENONnT and PandaX-4T data and infer the first \\cevns-based constraints on electromagnetic properties using solar $^8$B neutrinos.\n\n", "2412.14941": "2024-12-19, **The Deep Underground Neutrino Experiment (DUNE) program**, I. Gil-Botella et.al., [2412.14941v1](http://arxiv.org/abs/2412.14941v1)\n\n The Deep Underground Neutrino Experiment (DUNE) is a next-generation long-baseline neutrino oscillation experiment aimed at determining the neutrino mass hierarchy and the CP-violating phase. The DUNE physics program also includes the detection of astrophysical neutrinos and the search for signatures beyond the Standard Model, such as nucleon decays. DUNE consists of a near detector complex located at Fermilab and four 17 kton Liquid Argon Time Projection Chamber (LArTPC) far detector modules to be built 1.5 km underground at SURF, approximately 1300 km away. The detectors are exposed to a wideband neutrino beam generated by a 1.2 MW proton beam with a planned upgrade to > 2 MW. Two 770 ton LArTPCs (ProtoDUNEs) have been operated at CERN for over 2 years as a testbed for DUNE far detectors and have been optimized to take new cosmic and test-beam data in 2024-2025. The DUNE and ProtoDUNE experiments and physics goals, as well as recent progress and results, are presented.\n\n", "2412.14937": "2024-12-19, **Improved reconstruction of highly boosted $τ$-lepton pairs in the $ττ\\rightarrow(μν_μν_τ)({hadrons}+ν_τ)$ decay channels with the ATLAS detector**, ATLAS Collaboration et.al., [2412.14937v1](http://arxiv.org/abs/2412.14937v1)\n\n This paper presents a new $\\tau$-lepton reconstruction and identification procedure at the ATLAS detector at the Large Hadron Collider, which leads to significantly improved performance in the case of physics processes where a highly boosted pair of $\\tau$-leptons is produced and one $\\tau$-lepton decays into a muon and two neutrinos ($\\tau\\_{\\mu}$), and the other decays into hadrons and one neutrino ($\\tau\\_{had}$). By removing the muon information from the signals used for reconstruction and identification of the $\\tau\\_{had}$ candidate in the boosted pair, the efficiency is raised to the level expected for an isolated $\\tau\\_{had}$. The new procedure is validated by selecting a sample of highly boosted $Z\\rightarrow\\tau\\_{\\mu}\\tau\\_{had}$ candidates from the data sample of $140$ ${fb}^{-1}$ of proton-proton collisions at $13$ TeV recorded with the ATLAS detector. Good agreement is found between data and simulation predictions in both the $Z\\rightarrow\\tau\\_{\\mu}\\tau\\_{had}$ signal region and in a background validation region. The results presented in this paper demonstrate the effectiveness of the $\\tau\\_{had}$ reconstruction with muon removal in enhancing the signal sensitivity of the boosted $\\tau\\_{\\mu}\\tau\\_{had}$ channel at the ATLAS detector.\n\n", "2412.14752": "2024-12-19, **Probing Solar Heavy Neutrinos with Heliospheric Electrons**, Marco Drewes et.al., [2412.14752v1](http://arxiv.org/abs/2412.14752v1)\n\n We search for an excess of electrons and positrons in the interplanetary space from the decays of heavy neutrinos produced in nuclear reactions in the Sun. Using measurements of the electron spectra in the MeV range from the Ulysses and SOHO satellites, we report the strongest direct upper bound to date on the mixing between heavy neutral leptons with MeV masses and electron neutrinos, reaching $U\\_e^2\\simeq 10^{-6}$ at $M\\_N=10$ MeV. Our sensitivity is predominantly constrained by the uncertainties in the propagation of electrons and positrons, particularly the diffusion coefficient in the inner Solar System, as well as the uncertainties in the astrophysical background. Enhancing our understanding of either of these factors could lead to a significant improvement in sensitivity.\n\n", "2412.14713": "2024-12-19, **Cosmology and Source Redshift Distributions from Combining Radio Weak Lensing with CMB Lensing**, Alba Kalaja et.al., [2412.14713v1](http://arxiv.org/abs/2412.14713v1)\n\n Measurements of weak gravitational lensing using the cosmic microwave background and the shapes of galaxies have refined our understanding of the late-time history of the Universe. While optical surveys have been the primary source for cosmic shear measurements, radio continuum surveys offer a promising avenue. Relevant radio sources, principally star-forming galaxies, have populations with higher mean redshifts and are less affected by dust extinction compared to optical sources. We focus on the future mid frequency SKA radio telescope and explore the cross-correlation between radio cosmic shear and CMB lensing convergence ($\\gamma\\_\\mathrm{R}\\times \\kappa\\_\\mathrm{CMB}$). We investigate its potential in constraining the redshift distribution of radio galaxy samples and improving cosmological parameter constraints, including the neutrino sector. Using simulations of the first phase of the SKA and the Simons Observatory as a CMB experiment, we show how this $\\gamma\\_\\mathrm{R}\\times \\kappa\\_\\mathrm{CMB}$ cross-correlation can provide $\\sim1 - 10\\%$ calibration of the overall radio source redshift distribution, which in turn can significantly tighten otherwise degenerate measurements of radio galaxy bias. For the case of the next-generation full SKA, we find that the cross-correlation becomes more powerful than the equivalent with a \\textit{Euclid}-like survey, with constraints $30\\%$ tighter on $\\Lambda$CDM parameters and narrower bounds on sum of neutrino masses at the level of $\\sim 24\\%$. These constraints are also driven by higher redshifts and larger scales than other galaxy-CMB cross-correlations, potentially shedding light on different physical models. Our findings demonstrate the potential of radio weak lensing in improving constraints, and establish the groundwork for future joint analyses of CMB experiments and radio continuum surveys.\n\n", "2412.14681": "2024-12-19, **Diffuse Supernova Neutrino Background and Neutrino Non-Radiative Decay: a Bayesian Perspective**, Noah Roux et.al., [2412.14681v1](http://arxiv.org/abs/2412.14681v1)\n\n Neutrinos being massive could undergo non-radiative decay, a property for which the diffuse supernova neutrino background has a unique sensitivity. We extend previous analyses to explore our ability to disentangle predictions for the diffuse supernova neutrino background in presence or absence of neutrino non-radiative two-body decay. In a three-neutrino framework, we give predictions of the corresponding neutrino fluxes and the expected number of events in the Super-Kamiokande+Gadolinium, the Hyper-Kamiokande, the JUNO and the DUNE experiments. In our analysis, we employ supernova simulations from different groups and include current uncertainties from both the evolving core-collapse supernova rate and the fraction of failed supernovae. We perform the first Bayesian analysis to see our ability to disentangle the cases in presence and absence of neutrino decay. To this aim we combine the expected events in inverse beta-decay and the neutrino-argon detection channels. We also discuss neutrino-electron, neutrino-proton and of neutrino-oxygen scattering. Our investigation covers the different possible decay patterns for normal mass ordering, both strongly-hierarchical and quasi-degenerate as well as the inverted neutrino mass ordering.\n\n", "2412.14562": "2024-12-19, **Ultraviolet Completion of a Two-loop Neutrino Mass Model**, K. S. Babu et.al., [2412.14562v1](http://arxiv.org/abs/2412.14562v1)\n\n The Zee-Babu model is an economical framework for neutrino mass generation as two-loop quantum corrections. In this work, we present a UV completion of this model by embedding it into an $SU(5)$ unified framework. Interestingly, we find that loop-induced contributions to neutrino masses arising from colored scalars are just as important as those from color-neutral ones. These new states, which are required from gauge coupling unification and neutrino oscillation data to have masses below $\\mathcal{O}(10^3)$ TeV, may be accessible to future collider experiments. Additionally, the model can be probed in proton decay searches. Our Markov chain Monte Carlo analysis of model parameters shows a high likelihood of observable $p \\rightarrow e^+ \\pi^0$ decay signal in the first decade of Hyper-Kamiokande operation. The model predicts a vector-like down-type quark at the TeV scale, utilized for realistic fermion mass generation and gauge coupling unification. The model is UV-complete in the sense that it is a unified theory which is realistic and asymptotically free that can be extrapolated to the Planck scale.\n\n"}, "dark matter": {"2412.15192": "2024-12-19, **Accurate method for ultralight axion CMB and matter power spectra**, Rayne Liu et.al., [2412.15192v1](http://arxiv.org/abs/2412.15192v1)\n\n Ultralight axions (ULAs) with masses $10^{-33} \\lesssim m/{\\rm eV} \\lesssim 10^{-12}$ are well motivated in string-inspired models and can be part or all of the dark energy or the dark matter in this range. Since the ULA field oscillates at a frequency $m$ that can be much larger than the expansion rate $H$, accurate and efficient calculation of cosmological observables requires an effective time averaged treatment. While these are well established for $m\\gg 10 H\\_{\\rm eq}$, the Hubble rate at matter radiation equality, here we extend and develop these techniques to cover the mass range $10^{-33} \\lesssim m/{\\rm eV} \\lesssim 10^{-18}$. We implement this technique in a full cosmological Boltzmann code ($\\mathrm{AxiECAMB}$) with numerical precision sufficiently accurate for current and next-generation cosmic microwave background as well as large-scale structure data analysis. New effects including the time averaging of metric perturbations and hydrostatic equilibrium of the effective fluid result in many orders of magnitude improvements for power spectra accuracy over some previous treatments such as $\\mathrm{AxionCAMB}$ in some extreme regions of parameter space and order unity changes of the ULA effects near $\\Lambda$CDM models. These improvements may impact the model parameters that resolve various tensions in $\\Lambda$CDM at a comparable level.\n\n", "2412.15031": "2024-12-19, **General tradeoff relation of fundamental quantum limits for linear multiparameter estimation**, Guolong Li et.al., [2412.15031v1](http://arxiv.org/abs/2412.15031v1)\n\n Linear measurement is an important class of measurements for sensing classical signals including gravitational wave (GW), dark matter, infrared ray, rotation rate, etc. In this Letter, we focus on multiparameter linear measurement and establish a general tradeoff relation that tightly constrains the fundamental quantum limits of two independent parameters in a monochromatic classical signal detected by any linear quantum device. Such a tradeoff relation is universal and fundamental for multiparameter linear measurement since arising from Heisenberg's uncertainty principle. Compared with the Holevo Cram\\'er-Rao bound, our tradeoff bound can completely identify the dependence between the attainable precision limits on estimated parameters. The dependence becomes more obvious such that the individual precision can not simultaneously reach the quantum limit as the so-called incompatible coefficient rises. Eventually, we find a necessary condition under which an optimal measurement protocol can saturate the general tradeoff relation, and show that the measurement phase can be tuned for adjusting different precision weight. This result is related to many applications, particularly detuned GW sensors for searching post-merger remnants due to the direct relation between the detuned frequency and incompatible coefficient.\n\n", "2412.14949": "2024-12-19, **The Line operators in the G2HDM model**, Rui Yang et.al., [2412.14949v1](http://arxiv.org/abs/2412.14949v1)\n\n We describe the global structure of a particle model with dark matter called G2HDM, which incorporates a dark sector represented by $SU(2)\\_{H} \\times U(1)\\_{X}\\;$. The gauge group of such model is $\\tilde{G}=U(1)\\_{Y} \\times SU(2)\\_{L} \\times SU(3)\\_{C} \\times SU(2)\\_{H} \\times U(1)\\_{X} \\;$, with an ambiguity that it may actually be $G= \\tilde{G} / {\\Gamma} \\;$, where $\\Gamma$ is a subgroup of its center. We also describe how the electric and magnetic charges depend on $\\Gamma$ and the periodicity of theta angles for any choice of $G$. Finally, we describe the minimal charges that arise after electroweak symmetry breaking for any choice of $\\Gamma$.\n\n", "2412.14947": "2024-12-19, **Constraining $B$-Mesogenesis models with inclusive and exclusive decays**, Alexander Lenz et.al., [2412.14947v1](http://arxiv.org/abs/2412.14947v1)\n\n The $B$-Mesogenesis model explains the matter-antimatter asymmetry and leads to the right amount of dark matter in the Universe. In particular, this model predicts new decay channels of the $b$ quark. We investigate the modification of inclusive $b$-hadron decay rates and of the lifetimes of different $B$ mesons due to these new decay channels and compare our results with available predictions for exclusive $B$ meson decays. We find a small surviving parameter space where the $B$-Mesogenesis model is working and which has not been excluded by experiment. Experimental investigations in the near future should be able to test this remaining parameter space and thus either exclude or confirm the $B$-Mesogenesis model.\n\n", "2412.14831": "2024-12-19, **Tidal Love numbers and quasi-normal modes of the Schwarzschild-Hernquist black hole**, Sumanta Chakraborty et.al., [2412.14831v1](http://arxiv.org/abs/2412.14831v1)\n\n We derive the model of the Schwarzschild black hole immersed into a dark matter halo with a relativistic Hernquist profile, the Schwarzschild-Hernquist black hole, and obtain its tidal Love numbers and quasi-normal modes. We thoroughly compare our odd and even parity perturbation equations with the literature and point out that two distinct choices of matter perturbations lead to distinct spectra. We establish that the quasi-normal modes admit qualitatively distinct scaling laws in terms of dark matter densities for non-relativistic and relativistic halos. We develop a stable numerical scheme for computing tidal Love numbers based on asymptotic series expansions. We further comment upon the existence of matter configurations obeying the dominant energy condition that lead to multiple light rings.\n\n", "2412.14823": "2024-12-19, **Baryonic Axion in neutron-antineutron oscillation**, Théo Brugeat et.al., [2412.14823v1](http://arxiv.org/abs/2412.14823v1)\n\n The accidental baryonic symmetry is expected to be broken and required from the observed matter-antimatter asymmetry. The neutron-antineutron oscillating system is the hallmark of $\\Delta \\mathcal{B} = 2$ models which have the benefits of not inducing proton decay. We study this system in a framework allowing the most general couplings to understand how a dark matter candidate such as the axion may couple to the oscillation. In particular a Rabi resonance phenomenon occurs, and this effect is unconstrained for Axion Like Particles (ALPs) models. Regarding the QCD axion, its Goldstone nature leads to a robust exclusion of the majority of scenarios allowed.\n\n", "2412.14664": "2024-12-19, **Electric Dipole Moments From Missed Dark Matter Scattering**, Jason L. Evans et.al., [2412.14664v1](http://arxiv.org/abs/2412.14664v1)\n\n Axion-like particles are a well-motivated candidate for ultralight dark matter. Because dark matter must be non-relativistic, the effects of its scattering with Standard Model particles are negligible and generally go unnoticed. However, due to the large occupation number of ultralight dark matter, the sum of all scatterings leads to a classical field-like interaction with Standard Model particles. In the case of an axion-like particle, this scattering imparts a parity violating effect. If this collective scattering with axion-like particles is inserted into the one-loop quantum electrodynamics diagram, the parity violation imparted by this scattering will convert the anomalous magnetic moment contribution into an electric dipole moment. This contribution is quite large and leads to a prediction inconsistent with precision measurements of the proton and electron electric dipole moments, unless their couplings to the axion-like particles are very weak. As a result, the constraints on the couplings of axion-like particle dark matter to the electron and proton are improved by as much as eleven and six orders of magnitude, respectively.\n\n", "2412.14621": "2024-12-19, **Diversity and universality: evolution of dwarf galaxies with self-interacting dark matter**, Zhichao Carton Zeng et.al., [2412.14621v1](http://arxiv.org/abs/2412.14621v1)\n\n Dark matter halos with self-interacting dark matter (SIDM) experience a unique evolutionary phenomenon, in that their central regions eventually collapse to high density through the runaway gravothermal process after initially forming a large and low-density core. When coupled with orbital evolution, this is expected to naturally produce a large diversity in dark-matter halos' inner mass distribution, potentially explaining the diversity problem of dwarf galaxies. However, it remains unknown how the diversity in SIDM dark-matter halos propagates to the more easily observed luminous matter at the center of the halo, especially the stellar component. In this work, we use idealized N-body simulations with two species of particles (dark matter and stars) to study the response of the stellar properties of field and satellite dwarf galaxies to SIDM evolution and orbital effects on their halos. Galaxies' stellar components, including galaxy size, mass-to-light ratio, and stellar velocity dispersion, display a much larger scatter in SIDM than the standard cold dark matter (CDM) model. Importantly, we find signs of universality in the evolution pathways, or ``tidal tracks'', of SIDM dwarf satellites, which are physically interpretable and potentially parameterizable. This type of tidal-track model can be layered onto larger-scale, cosmological simulations to reconstruct the evolution of populations of SIDM dwarfs in cases where high-resolution simulations of galaxies are otherwise prohibitively expensive.\n\n", "2412.14540": "2024-12-19, **Hyper Stealth Dark Matter and Long-Lived Particles**, George T. Fleming et.al., [2412.14540v1](http://arxiv.org/abs/2412.14540v1)\n\n A new dark matter candidate is proposed that arises as the lightest baryon from a confining $SU(N)$ gauge theory which equilibrates with the Standard Model only through electroweak interactions. Surprisingly, this candidate can be as light as a few GeV. The lower bound arises from the intersection of two competing requirements: i) the equilibration sector of the model must be sufficiently heavy, at least several TeV, to avoid bounds from colliders, and ii) the lightest dark meson (that may be the dark $\\eta'$, $\\sigma$, or the lightest glueball) has suppressed interactions with the SM, and must decay before BBN. The low energy dark sector consists of one flavor that is electrically neutral and an almost electroweak singlet. The dark matter candidate is the lightest baryon consisting of $N$ of these light flavors leading to a highly suppressed elastic scattering rate with the SM. The equilibration sector consists of vector-like dark quarks that transform under the electroweak group, ensuring that the dark sector can reach thermal equilibrium with the SM in the early Universe. The lightest dark meson lifetimes vary between $10^{-3} \\lesssim c \\tau \\lesssim 10^7$~meters, providing an outstanding target for LHC production and experimental detection. We delineate the interplay between the lifetime of the light mesons, the suppressed direct detection cross section of the lightest baryon, and the scale of equilibration sector that can be probed at the LHC.\n\n", "2412.14450": "2024-12-19, **Gravitational Wave Detection With Plasma Haloscopes**, Rodolfo Capdevilla et.al., [2412.14450v1](http://arxiv.org/abs/2412.14450v1)\n\n Searches for high frequency gravitational waves using cavities based on the Gertsenshtein effect were recently proposed, building off existing axion dark matter experiments. In particular, the sensitivity of axion dark matter experiments using metamaterial plasmas (tunable plasma haloscopes) to gravitational waves has not been explored in detail. Here we perform a full analysis of gravitational wave detection in plasma haloscopes, showing that the baseline design of experiments such as ALPHA is several orders of magnitude less sensitive than previously thought. We show how simple changes to the experiment can recover that sensitivity and lead to a powerful gravitational wave detector in the order of $(10-50)$ GHz frequency range.\n\n"}, "supernova": {"2412.15143": "2024-12-19, **Supernovae evidence for foundational change to cosmological models**, Antonia Seifert et.al., [2412.15143v1](http://arxiv.org/abs/2412.15143v1)\n\n We present a new, cosmologically model-independent, statistical analysis of the Pantheon+ type Ia supernovae spectroscopic dataset, improving a standard methodology adopted by Lane et al. We use the Tripp equation for supernova standardisation alone, thereby avoiding any potential correlation in the stretch and colour distributions. We compare the standard homogeneous cosmological model, i.e., $\\Lambda$CDM, and the timescape cosmology which invokes backreaction of inhomogeneities. Timescape, while statistically homogeneous and isotropic, departs from average Friedmann-Lema\\^{\\i}tre-Robertson-Walker evolution, and replaces dark energy by kinetic gravitational energy and its gradients, in explaining independent cosmological observations. When considering the entire Pantheon+ sample, we find very strong evidence ($\\ln B> 5$) in favour of timescape over $\\Lambda$CDM. Furthermore, even restricting the sample to redshifts beyond any conventional scale of statistical homogeneity, $z > 0.075$, timescape is preferred over $\\Lambda$CDM with $\\ln B> 1$. These results provide evidence for a need to revisit the foundations of theoretical and observational cosmology.\n\n", "2412.14766": "2024-12-19, **New Radio Observations of the Supernova Remnant CTA 1**, Tam Do et.al., [2412.14766v1](http://arxiv.org/abs/2412.14766v1)\n\n We present new radio images of the supernova remnant (SNR) CTA 1 at 1420 and 408 MHz, and in the 21 cm line of H I observed with the Dominion Radio Astrophysical Observatory Synthesis Telescope and at 1420 MHz observed with the Effelsberg 100 m telescope. We confirm previously described continuum features and elaborate further on filamentary features identified using the high-resolution (1') maps from these new observations. We investigate the abrupt change in sign of rotation measure (RM) across the SNR, using the linear polarization observations in the four bands around 1420 MHz. Following X. H. Sun et al.'s (2011) investigation, we both confirm that the distribution of signs of the RMs for extragalactic sources in the area appears to match that of the shell, as well as combine the data from the four bands to estimate the relative depolarization and the intrinsic rotation measure of the SNR. We do not conclusively reject X. H. Sun et al.'s (2011) claim of a Faraday screen in the foreground causing the distribution of RMs that we observe; however, we do suggest an alternative explanation of a swept-up stellar wind from the progenitor star with a toroidal magnetic field. Finally, we expand on the analysis of the H I observations by applying the Rolling Hough Transform to isolate filamentary structure and better identify H I emission with the SNR. Further constraining the H I velocity channels associated with CTA 1, we use more recent Galactic rotation curves to calculate an updated kinematic distance of 1.09 +/- 0.2 kpc.\n\n"}}