{"neutrino": {"2303.17356": "2023-03-30, **The ESSnuSB design study: overview and future prospects**, ESSnuSB Collaboration et.al., [2303.17356v1](http://arxiv.org/abs/2303.17356v1)\n\n ESSnuSB is a design study for an experiment to measure the CP violation in the leptonic sector at the second neutrino oscillation maximum using a neutrino beam driven by the uniquely powerful ESS linear accelerator. The reduced impact of systematic errors on sensitivity at the second maximum allows for a very precise measurement of the CP violating parameter. This review describes the fundamental advantages of measurement at the 2nd maximum, the necessary upgrades to the ESS linac in order to produce a neutrino beam, the near and far detector complexes, the expected physics reach of the proposed ESSnuSB experiment, concluding with the near future developments aimed at the project realization.\n\n", "2303.17261": "2023-03-30, **Neutrinoless double beta decay as seen by the devil's advocate**, Gia Dvali et.al., [2303.17261v1](http://arxiv.org/abs/2303.17261v1)\n\n Neutrinoless double beta decay is the textbook example of lepton number violation, often claimed to be a probe of neutrino Majorana mass. However, it could be triggered by new physics; after all, neutrino Majorana mass requires physics beyond the Standard Model. If at least one electron were right-handed, it would automatically signify new physics rather than neutrino mass. In case both electrons were left-handed, the situation would become rather complicated, and additional effort would be needed to untangle the source for this process. We offer a comprehensive study of this issue from both the effective operator approach and the possible UV completions, including the Pati-Salam quark-lepton unification. While neutrino exchange is natural and physically preferred, our findings show that new physics can still be responsible for the neutrinoless double beta decay. In particular, the Pati-Salam theory can do the job, consistently with all the phenomenological and unification constraints, as long as the unification scale lies above 10^12 GeV, albeit at the price of fine-tuning of some scalar masses.\n\n", "2303.17087": "2023-03-30, **Hermitian Matrix Diagonalization and its Symmetry Properties**, S. H. Chiu et.al., [2303.17087v1](http://arxiv.org/abs/2303.17087v1)\n\n A hermitian matrix can be parametrized by a set consisting of its determinant and the eigenvalues of its submatrices. We established a group of equations which connect these variables with the mixing parameters of diagonalization. These equations are simple in structure and manifestly invariant in form under the symmetry operations of dilatation, translation, rephasing and permutation. When applied to the problem of neutrino oscillation in matter they produced two new ``matter invariants\" which are confirmed by available data.\n\n", "2303.17007": "2023-03-29, **Impact of cross-section uncertainties on supernova neutrino spectral parameter fitting in the Deep Underground Neutrino Experiment**, DUNE Collaboration et.al., [2303.17007v1](http://arxiv.org/abs/2303.17007v1)\n\n A primary goal of the upcoming Deep Underground Neutrino Experiment (DUNE) is to measure the $\\mathcal{O}(10)$ MeV neutrinos produced by a Galactic core-collapse supernova if one should occur during the lifetime of the experiment. The liquid-argon-based detectors planned for DUNE are expected to be uniquely sensitive to the $\\nu\\_e$ component of the supernova flux, enabling a wide variety of physics and astrophysics measurements. A key requirement for a correct interpretation of these measurements is a good understanding of the energy-dependent total cross section $\\sigma(E\\_\\nu)$ for charged-current $\\nu\\_e$ absorption on argon. In the context of a simulated extraction of supernova $\\nu\\_e$ spectral parameters from a toy analysis, we investigate the impact of $\\sigma(E\\_\\nu)$ modeling uncertainties on DUNE's supernova neutrino physics sensitivity for the first time. We find that the currently large theoretical uncertainties on $\\sigma(E\\_\\nu)$ must be substantially reduced before the $\\nu\\_e$ flux parameters can be extracted reliably: in the absence of external constraints, a measurement of the integrated neutrino luminosity with less than 10\\% bias with DUNE requires $\\sigma(E\\_\\nu)$ to be known to about 5%. The neutrino spectral shape parameters can be known to better than 10% for a 20% uncertainty on the cross-section scale, although they will be sensitive to uncertainties on the shape of $\\sigma(E\\_\\nu)$. A direct measurement of low-energy $\\nu\\_e$-argon scattering would be invaluable for improving the theoretical precision to the needed level.\n\n", "2303.16962": "2023-03-29, **Gravitational Wave Eigenfrequencies from Neutrino-Driven Core-Collapse Supernovae**, Noah E. Wolfe et.al., [2303.16962v1](http://arxiv.org/abs/2303.16962v1)\n\n Core-collapse supernovae are predicted to produce gravitational waves (GWs) that may be detectable by Advanced LIGO/Virgo. These GW signals carry information from the heart of these catacylsmic events, where matter reaches nuclear densities. Recent studies have shown that it may be possible to infer properties of the proto-neutron star (PNS) via gravitational waves generated by hydrodynamic perturbations of the PNS. However, we lack a comprehensive understanding of how these relationships may change with the properties of core-collapse supernovae. In this work, we build a self-consistent suite of over 1000 exploding core-collapse supernovae from a grid of progenitor masses and metallicities combined with six different nuclear equations of state. Performing a linear perturbation analysis on each model, we compute the resonant gravitational-wave frequencies of the PNS, and we motivate a time-agnostic method for identifying characteristic frequencies of the dominant gravitational-wave emission. From this, we identify two characteristic frequencies, of the early- and late-time signal, that measure the surface gravity of the cold remnant neutron star, and simultaneously constrain the hot nuclear equation of state. However, we find that the details of the core-collapse supernova model, such as the treatment of gravity or the neutrino transport, and whether it explodes, noticeably change the magnitude and evolution of the PNS eigenfrequencies.\n\n", "2303.16895": "2023-03-29, **New Insight on Neutrino Dark Matter Interactions from Small-Scale CMB Observations**, Philippe Brax et.al., [2303.16895v1](http://arxiv.org/abs/2303.16895v1)\n\n We revisit the possibility of using cosmological observations to constrain models that involve interactions between neutrinos and dark matter. We show that small-scale measurements of the cosmic microwave background with a few per cent accuracy are critical to uncover unique signatures from models with tiny couplings that would require a much higher sensitivity at lower multipoles, such as those probed by the Planck satellite. We analyze the high-multipole data released by the Atacama Cosmology Telescope, both independently and in combination with Planck and Baryon Acoustic Oscillation measurements, finding a compelling preference for a non-vanishing coupling, $\\log\\_{10}u\\_{\\nu \\textrm{DM}}=-5.20^{+1.2}\\_{-0.74}$ at 68% CL. This aligns with other CMB-independent probes, such as Lyman-$\\alpha$. We illustrate how this coupling could be accounted for in the presence of dark matter interactions with a sterile neutrino.\n\n", "2303.16820": "2023-03-29, **General-relativistic simulations of the formation of a magnetized hybrid star**, Anson Ka Long Yip et.al., [2303.16820v1](http://arxiv.org/abs/2303.16820v1)\n\n Strongly magnetized neutron stars are popular candidates for producing detectable electromagnetic and gravitational-wave signals. A rapid density increase in a neutron star core could also trigger the phase transition from hadrons to deconfined quarks and form a hybrid star. This formation process could release a considerable amount of energy in the form of gravitational waves and neutrinos. Hence, the formation of a magnetized hybrid star is an interesting scenario for detecting all these signals. These detections may provide essential probes for the magnetic field and composition of such stars. Thus far, a dynamical study of the formation of a magnetized hybrid star has yet to be realized. Here, we investigate the formation dynamics and the properties of a magnetized hybrid star through dynamical simulations. We find that the maximum values of rest-mass density and magnetic field strength increase slightly and these two quantities are coupled in phase during the formation. We then demonstrate that all microscopic and macroscopic quantities of the resulting hybrid star vary dramatically when the maximum magnetic field strength goes beyond a threshold of $\\sim 5 \\times 10^{17}$ G but they are insensitive to the magnetic field below this threshold. Specifically, the magnetic deformation makes the rest-mass density drop significantly, suppressing the matter fraction in the mixed phase. Therefore, this work provides a solid support for the magnetic effects on a hybrid star, so it is possible to link observational signals from the star to its magnetic field configuration.\n\n", "2303.16655": "2023-03-29, **Yet another QFT model of neutrino oscillations**, W. Grimus et.al., [2303.16655v1](http://arxiv.org/abs/2303.16655v1)\n\n We consider a quantum field theory (QFT) model of neutrino oscillations in vacuum that attempts to take into account that the neutrino source particle and the neutrino detection particle both interact with their respective environments by collisions. Our model is minimal in a twofold sense. Firstly we simply assume that neutrino production and detection take place in between collisions in time intervals $\\Delta t$ and $\\tau$, respectively. Secondly, we only introduce the two wave packets that are absolutely necessary which are those of the neutrino source and the neutrino detection particle. Within this model we find that, for all practical purposes, there are no decoherence effects in the neutrino oscillation amplitude and oscillations occur in space not in time. Moreover, our model leads to the correct time correlation between neutrino production and detection and to a factorization of the event rate of the compound neutrino production--detection process into decay rate, oscillation probability and detection cross section.\n\n", "2303.16630": "2023-03-29, **Spontaneous Scalarization in Proto-neutron Stars**, Fahimeh Rahimi et.al., [2303.16630v1](http://arxiv.org/abs/2303.16630v1)\n\n Proto-neutron stars are born when a highly evolved and massive star collapses under gravity. In this paper, we investigate the spontaneous scalarization in proto-neutron stars. Based on the scalar tensor theory of gravity as well as the physical conditions in proto-neutron star, we examine the structure of proto-neutron star. To describe the fluid in proto-neutron star, we utilize $SU(2)$ chiral sigma model and the finite temperature extension of the Brueckner-Bethe-Goldstone quantum many-body theory in the Brueckner-Hartree-Fock approximation. Here, we apply the equation of state of proto-neutron stars considering different cases i.e. hot pure neutron matter and hot $\\beta$-stable neutron star matter without neutrino trapping as well as with neutrino trapping. The effects of temperature and entropy of proto-neutron stars on the star structure are also studied. Our results confirm that the spontaneous scalarization is affected by different physical conditions in proto-neutron stars.\n\n", "2303.16453": "2023-03-29, **Flavor conversions with energy-dependent neutrino emission and absorption**, Chinami Kato et.al., [2303.16453v1](http://arxiv.org/abs/2303.16453v1)\n\n Fast neutrino flavor conversions (FFCs) and collisional flavor instabilities (CFIs) potentially affect the dynamics of core-collapse supernovae (CCSNe) and binary neutron star mergers (BNSMs). Under the assumption of homogeneous neutrinos, we investigate effects of neutrino emission and absorption (EA) by matters through both single and multi-energy numerical simulations with physically motivated setup. In our models, FFCs dominate over CFIs in the early phase, while EA secularly and significantly give impacts on flavor conversions. They facilitate angular swaps, or the full exchange between electron neutrinos ($\\nu\\_e$) and heavy-leptonic neutrinos ($\\nu\\_x$). As a result, the number density of $\\nu\\_x$ becomes more abundant than the case without EA, despite the fact that the isotropization by EA terminates the FFCs earlier. In the later phase, the system approaches new asymptotic states characterized by EA and CFIs, in which rich energy-dependent structures also emerge. Multi-energy effects sustain FFCs and the time evolution of the flavor conversion becomes energy dependent, which are essentially in line with effects of the isoenergetic scattering studied in our previous paper. We also find that $\\nu\\_x$ in the high-energy region convert into $\\nu\\_e$ via flavor conversions and then they are absorbed through charged current reactions, exhibiting the possibility of new path of heating matters.\n\n", "2303.16400": "2023-03-29, **Type-II seesaw Complex Triplet Model: Phase Transition and A Global Fit Analysis**, Yong Du et.al., [2303.16400v1](http://arxiv.org/abs/2303.16400v1)\n\n The type-II seesaw model can explain neutrino masses and address the baryon asymmetry problem of the Universe simultaneously. In this letter, we explore its phase transition and the resulting gravitational wave signals. We find a strong first-order electroweak phase transition generically prefers a relatively light triplet in the $300\\sim500$GeV range, which is ideal for collider searches and can generate gravitational waves within the sensitivity reach of BBO and Ultimate-DECIGO. While above $\\sim$1TeV where a future 100TeV $pp$ collider will play a key role in model discovery, we integrate out the triplet and perform a global fit analysis of this model at various future colliders. A lower bound in the $10^{-3}\\sim10^{-2}$eV range on the triplet vacuum expectation value is obtained, which is comparable to or even better than that from current $\\mu\\to e\\gamma$ experiments depending on the lightest neutrino mass.\n\n"}, "dark matter": {"2303.17601": "2023-03-30, **Gravitational wave microlensing by dressed primordial black holes**, Juan Urrutia et.al., [2303.17601v1](http://arxiv.org/abs/2303.17601v1)\n\n We study gravitational wave microlensing by primordial black holes (PBHs), accounting for the effect of a particle dark matter minihalo surrounding them. Such minihaloes are expected when PBHs make up only a fraction of all dark matter. We find that the LIGO-Virgo detections imply a $1\\sigma$ bound on the abundance of PBHs heavier than $50 M\\_{\\odot}$. The next generation observatories can potentially probe PBHs as light as $0.01 M\\_\\odot$ and down to $2\\times10^{-4}$ fraction of all dark matter. We also show that these detectors can distinguish between dressed and naked PBHs, providing a novel way to study the distribution of particle dark matter around black holes and potentially shed light on the origins of black holes.\n\n", "2303.17545": "2023-03-30, **Constraining ultralight dark matter using the Fermi-LAT Pulsar Timing Array**, Zi-Qing Xia et.al., [2303.17545v1](http://arxiv.org/abs/2303.17545v1)\n\n Ultralight dark matter (ULDM) is proposed as a theoretical candidate of dark matter particles with masses of approximately $10^{-22}$ eV. The interactions between ULDM particles and standard model particles would cause variations in pulse arrival times of the pulsars, which makes the pulsar timing array (PTA) can be used to indirectly detect ULDM. In this work, we use the gamma-ray PTA composed of 29 millisecond pulsars observed by the Fermi Large Area Telescope (Fermi-LAT) to test four ultralight dark matter effects, including gravitational effects for generalized ULDM with different Spin-0/1, the fifth-force coupling effect of Dark Photon and the modified gravitational effect of the Spin-2 ULDM. The gamma-ray pulsar timing is not affected by the ionized interstellar medium and suffers relatively simple noises, unlike that of the radio band. No significant signals of ULDM are found based on the Fermi-LAT PTA for all four kinds of ULDM models. Constraints on ULDM parameters are set with the 95% confidence level, which provides a complementary check of the non-detection of ULDM for radio PTAs and direct detection experiments.\n\n", "2303.17516": "2023-03-30, **Reference frames in General Relativity and the galactic rotation curves**, L. Filipe O. Costa et.al., [2303.17516v1](http://arxiv.org/abs/2303.17516v1)\n\n The physical interpretation of the exact solutions of the Einstein field equations is, in general, a challenging task, part of the difficulties lying in the significance of the coordinate system. We discuss the extension of the International Astronomical Union (IAU) reference system to the exact theory. It is seen that such an extension, retaining some of its crucial properties, can be achieved in a special class of spacetimes, admitting non-shearing congruences of observers which, at infinity, have zero vorticity and acceleration. As applications, we consider the FLRW, Kerr and NUT spacetimes, the van Stockum rotating dust cylinder, spinning cosmic strings and, finally, we debunk the so-called Balasin-Grumiller (BG) model, and the claims that the galaxies' rotation curves can be explained through gravitomagnetic effects without the need for Dark Matter. The BG spacetime is shown to be completely inappropriate as a galactic model: its dust is actually static with respect to the asymptotic inertial frame, its gravitomagnetic effects arise from unphysical singularities along the axis (a pair of NUT rods, combined with a spinning cosmic string), and the rotation curves obtained are merely down to an invalid choice of reference frame -- the congruence of zero angular momentum observers, which are being dragged by the singularities.\n\n", "2303.17484": "2023-03-30, **A cosmic stream of atomic carbon gas connected to a massive radio galaxy at redshift 3.8**, Bjorn H. C. Emonts et.al., [2303.17484v1](http://arxiv.org/abs/2303.17484v1)\n\n The growth of galaxies in the early Universe is driven by accretion of circum- and inter-galactic gas. Simulations predict that steady streams of cold gas penetrate the dark matter halos of galaxies, providing the raw material necessary to sustain star formation. We report a filamentary stream of gas that extends for 100 kiloparsecs and connects to the massive radio galaxy 4C 41.17. The stream is detected using sub-millimeter observations of the [CI] line of atomic carbon, a tracer of neutral atomic or molecular hydrogen gas. The galaxy contains a central gas reservoir that is fueling a vigorous starburst. Our results show that the raw material for star formation can be present in cosmic streams outside galaxies.\n\n", "2303.17406": "2023-03-30, **Constraining the Gravitational Potential from the Projected Morphology of Extragalactic Tidal Streams**, Jacob Nibauer et.al., [2303.17406v1](http://arxiv.org/abs/2303.17406v1)\n\n The positions and velocities of stellar streams have been used to constrain the mass and shape of the Milky Way's dark matter halo. Several extragalactic streams have already been detected, though it has remained unclear what can be inferred about the gravitational potential from only 2D photometric data of a stream. We present a fast method to infer halo shapes from the curvature of 2D projected stream tracks. We show that the stream curvature vector must point within 90 deg of the projected acceleration vector, in the absence of recent time-dependent perturbations. While insensitive to the total magnitude of the acceleration, and therefore the total mass, applying this constraint along a stream can determine halo shape parameters and place limits on disk-to-halo mass ratios. The most informative streams are those with sharp turns or flat segments, since these streams sample a wide range of curvature vectors over a small area (sharp turns) or have a vanishing projected acceleration component (flat segments). We apply our method to low surface brightness imaging of NGC 5907, and find that its dark matter halo is oblate. Our analytic approach is significantly faster than other stream modeling techniques, and indicates what parts of a stream contribute to constraints on the potential. The method enables a measurement of dark matter halo shapes for thousands of systems using stellar stream detections expected from upcoming facilities like Rubin and Roman.\n\n", "2303.17107": "2023-03-30, **Annihilation of singlet fermionic dark matter into two photons via pseudo-scalar mediator**, M. M. Ettefaghi et.al., [2303.17107v1](http://arxiv.org/abs/2303.17107v1)\n\n We consider the indirect detection of dark matter within an extension of the standard model (SM) including a singlet fermion as cold dark matter (CDM) and a singlet pseudo-scalar as a mediator between dark matter and the SM particles. The annihilation cross section of the CDM into two monochromatic photons is calculated and compared with the latest H.E.S.S. data. Although for dark matter masses below 1 TeV the predicted observable cross sections are far from the sensitivity of the recent gamma-ray experiments,   it can be comparable to the strongest H.E.S.S. upper bounds for some models with more massive CDM.\n\n", "2303.17035": "2023-03-29, **On The Planetary Theory of Everything**, J. J. Charfman Jr. et.al., [2303.17035v1](http://arxiv.org/abs/2303.17035v1)\n\n Here, we present a simple solution to problems that have plagued (extra)\"galactic\" astronomers and cosmologists over the last century. We show that \"galaxy\" formation, dark matter, and the tension in the expansion of the universe can all be explained by the natural behaviors of an overwhelmingly large population of exoplanets throughout the universe. Some of these ideas have started to be proposed in the literature, and we commend these pioneers revolutionizing our understanding of astrophysics. Furthermore, we assert that, since planets are obviously the ubiquitous answer to every current question that can be posed by astronomers, planetary science must then be the basis for all science, and therefore that all current funding for science be reserved for (exo)planetary science - we happily welcome all astronomers and other scientists.\n\n", "2303.16930": "2023-03-29, **Constraining the dark matter contribution of $γ$ rays in Cluster of galaxies using Fermi-LAT data**, Mattia Di Mauro et.al., [2303.16930v1](http://arxiv.org/abs/2303.16930v1)\n\n Clusters of galaxies are the largest gravitationally-bound systems in the Universe. Their dynamics are dominated by dark matter (DM), which makes them among the best targets for indirect DM searches. We analyze 12 years of data collected by the Fermi Large Area Telescope (Fermi-LAT) in the direction of 49 clusters of galaxies selected for their proximity to the Earth and their high X-ray flux, which makes them the most promising targets. We first create physically motivated models for the DM density around each cluster considering different assumptions for the substructure distribution. Then we perform a combined search for a $\\gamma$-ray signal in the {\\it Fermi}-LAT data between 500 MeV and 1 TeV. We find a signal of $\\gamma$ rays potentially associated with DM that is at a statistical significance of $2.5\\sigma-3.0\\sigma$ when considering a slope for the subhalo mass distribution $\\alpha=1.9$ and minimum mass of $M\\_{\\rm{min}}=10^{-6}$ $M\\_{\\odot}$. The best-fit DM mass and annihilation cross-sections for a $b\\bar{b}$ annihilation channel are $m\\_{\\chi}=40-60$ GeV and $\\langle \\sigma v \\rangle = (2-4) \\times 10^{-25}$ cm$^3$/s. When we consider $\\alpha=2.0$ and $M\\_{\\rm{min}}=10^{-9}$ $M\\_{\\odot}$, the best-fit of the cross section reduces to $\\langle \\sigma v \\rangle = (4-10) \\times 10^{-26}$ cm$^3$/s. For both DM substructure models there is a tension between the values of $\\langle \\sigma v \\rangle$ that we find and the upper limits obtained with the non-detection of a $\\gamma$-ray flux from Milky Way dwarf spheroidal galaxies. This signal is thus more likely associated with $\\gamma$ rays produced in the intracluster region by cosmic rays colliding with gas and photon fields.\n\n", "2303.16922": "2023-03-29, **The Standard Model effective field theory at work**, Gino Isidori et.al., [2303.16922v1](http://arxiv.org/abs/2303.16922v1)\n\n The striking success of the Standard Model in explaining precision data and, at the same time, its lack of explanations for various fundamental phenomena, such as dark matter or the baryon asymmetry of the universe, suggests new physics at an energy scale much larger than the electroweak scale. In the absence of a short-range-long-range conspiracy, the Standard Model can be viewed as the leading term of an effective \"remnant\" theory (referred to as the SMEFT) of a more fundamental structure. Over the last years, many aspects of the SMEFT have been investigated and it has become a standard tool to analyze experimental results in an integral way. In this article, after briefly presenting the salient features of the Standard Model, we review the construction of the SMEFT. We discuss the range of its applicability and bounds on its coefficients imposed by general theoretical considerations. Since new physics models are likely to exhibit exact or approximate accidental global symmetries, especially in the flavor sector, we also discuss their implications for the SMEFT. The main focus of our review is the phenomenological analysis of experimental results. We show explicitly how to use various effective field theories to study the phenomenology of theories beyond the Standard Model. We give a detailed description of the matching procedure and the use of the renormalization group equations, allowing to connect multiple effective theories valid at different energy scales. Explicit examples from low-energy experiments and from high-$p\\_T$ physics illustrate the workflow. We also comment on the non-linear realization of the electroweak symmetry breaking and its phenomenological implications.\n\n", "2303.16807": "2023-03-29, **Development of low-threshold detectors for low-mass dark matter searches with a p-type germanium detector operated at cryogenic temperature**, Mathbar Raut et.al., [2303.16807v1](http://arxiv.org/abs/2303.16807v1)\n\n This study investigates new technology for enhancing the sensitivity of low-mass dark matter detection by analyzing charge transport in a p-type germanium detector at 5.2 K. To achieve low-threshold detectors, precise calculations of the binding energies of dipole and cluster dipole states, as well as the cross-sections of trapping affected by the electric field, are essential. The detector was operated in two modes: depleted at 77 K before cooling to 5.2 K and cooled directly to 5.2 K with various bias voltages. Our results indicate that the second mode produces lower binding energies and suggests different charge states under varying operating modes. Notably, our measurements of the dipole and cluster dipole state binding energies at zero fields were $8.716\\pm 0.435$ meV and $6.138\\pm 0.308$ meV, respectively. These findings have strong implications for the development of low-threshold detectors for detecting low-mass dark matter in the future.\n\n", "2303.16789": "2023-03-29, **The equilibrium condition in gravitational collapse and its application to a cosmological scenario**, Dipanjan Dey et.al., [2303.16789v1](http://arxiv.org/abs/2303.16789v1)\n\n We discuss the equilibrium conditions of the gravitational collapse of a spherically symmetric matter cloud. We analyze the spinor structure of a general collapsing space-time and redefine the equilibrium conditions by using Cartan scalars. We qualitatively investigate the equilibrium configuration of a two-fluid system consisting of a dust-like fluid and a fluid with a negative equation of state. We use our results to investigate certain cosmological scenarios where dark energy can cluster inside the over-dense regions of dark matter and together reaches a stable configuration. We compare the outcomes of our work with existing work where the virialization technique is used to stabilize the two-fluid system.\n\n", "2303.16679": "2023-03-29, **Pitfalls in applying gravitomagnetism to galactic rotation curve modelling**, Kostas Glampedakis et.al., [2303.16679v1](http://arxiv.org/abs/2303.16679v1)\n\n The flatness of galaxy rotation curves at large radii is generally considered to be a significant piece of evidence in support of the existence of dark matter. Several studies have claimed that post-Newtonian corrections to the Newtonian equations of galaxy dynamics remove the need for dark matter. A few recent studies have examined these claims, and identified errors in their reasoning. We add to this critique by giving what we consider to be particularly simple and transparent description of the errors made in these post-Newtonian calculations, some of which were of a rather technical nature, others more fundamental, e.g. the loss of the correct relativistic scaling, promoting small corrections to order unity changes. Our work reinforces the orthodoxy that post-Newtonian effects are indeed too small to significantly alter galactic rotation curves, and will hopefully serve as a useful guide for others, pointing out subtle errors that one might inadvertently make in such calculations.\n\n", "2303.16658": "2023-03-29, **SPARC HSBs, and LSBs, the surface density of dark matter haloes, and MOND**, Antonino Del Popolo et.al., [2303.16658v1](http://arxiv.org/abs/2303.16658v1)\n\n In this paper, we use SPARC's HSBs, and LSBs galaxies to verify two issues. The first one is related to one claim of \\citep{Donato} D09, namely: is the DM surface density (DMsd) a constant universal quantity, equal to $\\log{(\\rm \\Sigma/M\\_\\odot pc^{-2})}=2.15 \\pm 0.2$, or does it depend on the baryon surface density of the system? The second one, is based on a MOND prediction that for HSBs the DMsd is constant, and equal to $\\log{(\\rm \\Sigma/M\\_\\odot pc^{-2})}=2.14$, while for LSBs the surface density is not constant and takes values that are smaller than for HSBs and D09 prediction \\citep{Milgrom2009}. We find that HSBs shows a constant DMsd vs magnitude as in D09, and a constant DMsd vs $\\Sigma\\_{\\rm eff}$ as in MOND prediction, for HSBs with $\\Sigma\\_{\\rm eff}>200 L\\_\\odot/pc^2$, and $\\Sigma\\_{\\rm eff}>300 L\\_\\odot/pc^2$. However, the value of the DMsd is larger, $\\Sigma \\simeq 2.61$ (in the case of the DMsd-magnitude with $\\Sigma\\_{\\rm eff}>300 L\\_\\odot/pc^2$), and $\\Sigma \\simeq 2.54$ (in the case of the surface DMsd-surface brightness with $\\Sigma\\_{\\rm eff}>200 L\\_\\odot/pc^2$). This value slightly depends on the threshold to determine wheter a galaxy is HSB. In the case of LSBs, for $\\Sigma\\_{\\rm eff}<100 L\\_\\odot/pc^2$, and $\\Sigma\\_{\\rm eff}<25 L\\_\\odot/pc^2$, the surface density vs magnitude, for lower magnitudes, is approximately equal to that predicted by D09, but several galaxies, for magnitude $M>-17$, have smaller values than those predicted by D09. The DMsd vs $\\Sigma\\_{\\rm eff}$ shows a similar behavior in qualitative, but not quantitative, agreement with MOND predictions. In summary, in the case of HSBs both D09 and MOND are in qualitative, but not quantitative, agreement with the data. In the case of LSBs D09 is mainly in disagreement with the data, and MOND only in qualitative agreement with them.\n\n", "2303.16586": "2023-03-29, **T violation and the dark sector**, R. Vilela Mendes et.al., [2303.16586v1](http://arxiv.org/abs/2303.16586v1)\n\n It is argued, as a working hypothesis, that \"normal\" and dark matter interactions can only be T and CP violating. One way to implement this idea is to consider that time reversal in dark matter is implemented, not by an antiunitary operator, but by a unitary operator. It is shown how this occurs naturally in the context of complex spacetime with an extended symmetry group.\n\n", "2303.16375": "2023-03-29, **The large-scale structure of globular clusters in the NGC 1052 group**, Maria Luisa Buzzo et.al., [2303.16375v1](http://arxiv.org/abs/2303.16375v1)\n\n Prompted by the many controversial claims involving the NGC 1052 group, including that it hosts two dark matter-free galaxies with overluminous and monochromatic globular cluster (GC) systems, here we map out the large-scale structure (LSS) of GCs over the entire group. To recover the LSS, we use archival optical CFHT imaging data. We recover two GC density maps, one based on universal photometric properties of GCs from simple stellar population models, and one based on the properties of spectroscopically confirmed GCs in DF2 and DF4 (the two dwarf galaxies with overluminous GC populations). Both selection methods reveal overdensities around the massive galaxies in the group, as well as around NGC 1052 itself, that are coincident with the positions of previously identified stellar streams and tidal features. No intragroup GCs are found connecting these structures to any of the dwarf galaxies. We find, however, two other dwarfs in the group hosting GC systems. These include RCP32 with 2 GCs with ages equivalent to the GCs around NGC 1052, and DF9 with 3 GCs with ages similar to the GCs around DF2 and DF4. We conclude that the GC distribution in the group does not strongly support any formation scenario in particular. It favours, nonetheless, scenarios relying on galaxy-galaxy interactions and on the coeval formation of GCs around the DM-free dwarf galaxies. These may include the recently proposed bullet-dwarf formation, as well as high-redshift tidal dwarf galaxy models.\n\n", "2303.16371": "2023-03-29, **Dark Matter in (Volatility and) Equity Option Risk Premiums**, Gurdip Bakshi et.al., [2303.16371v1](http://arxiv.org/abs/2303.16371v1)\n\n Emphasizing the statistics of jumps crossing the strike and local time, we develop a decomposition of equity option risk premiums. Operationalizing this theoretical treatment, we equip the pricing kernel process with unspanned risks, embed (unspanned) jump risks, and allow equity return volatility to contain unspanned risks. Unspanned risks are consistent with negative risk premiums for jumps crossing the strike and local time and imply negative risk premiums for out-of-the-money call options and straddles. The empirical evidence from weekly and farther-dated index options is supportive of our theory of economically relevant unspanned risks and reveals ``dark matter\" in option risk premiums.\n\n"}, "supernova": {"2303.16925": "2023-03-29, **The Bactrian? Broad-lined Type-Ic supernova SN 2022xxf with extraordinary two-humped light curves**, H. Kuncarayakti et.al., [2303.16925v1](http://arxiv.org/abs/2303.16925v1)\n\n We report on our study of SN 2022xxf during the first four months of its evolution. The light curves (LCs) display two humps at similar maximum brightness separated by 75d, unprecedented for a broad-lined Type Ic supernova (SN IcBL). SN~2022xxf is the most nearby SN IcBL to date (in NGC~3705, $z = 0.0037$, 20 Mpc). Optical and NIR photometry and spectroscopy are used to identify the energy source powering the LC. Nearly 50 epochs of high S/N-ratio spectroscopy were obtained within 130d, comprising an unparalleled dataset for a SN IcBL, and one of the best-sampled SN datasets to date. The global spectral appearance and evolution of SN~2022xxf points to typical SN Ic/IcBL, with broad features (up to $\\sim14000$ km~s$^{-1}$) and a gradual transition from the photospheric to the nebular phase. However, narrow emission lines (corresponding to $\\sim1000-2500$ km~s$^{-1}$) are present from the time of the second rise, suggesting slower-moving circumstellar material (CSM). These lines are subtle, but some are readily noticeable at late times such as in Mg~I $\\lambda$5170 and [O~I] $\\lambda$5577. Unusually, the near-infrared spectra show narrow line peaks, especially among features formed by ions of O and Mg. We infer the presence of CSM that is free of H and He. We propose that the radiative energy from the ejecta-CSM interaction is a plausible explanation for the second LC hump. This interaction scenario is supported by the color evolution, which progresses to the blue as the light curve evolves along the second hump, and the slow second rise and subsequent rapid LC drop. SN~2022xxf may be related to an emerging number of CSM-interacting SNe Ic, which show slow, peculiar LCs, blue colors, and subtle CSM interaction lines. The progenitor stars of these SNe likely experienced an episode of mass loss shortly prior to explosion consisting of H/He-free material.\n\n", "2303.16849": "2023-03-29, **Dwarf Galaxy Discoveries from the KMTNet Supernova Program III. the Milky-Way Analog NGC~2997 Group**, Tony Junjing Fan et.al., [2303.16849v1](http://arxiv.org/abs/2303.16849v1)\n\n We present the discovery of 48 new and the analysis of 55, including 7 previously discovered, dwarf galaxy candidates around the giant spiral galaxy NGC~2997 using deep $BVI$ images from the KMTNet Supernova Program. Their $V$-band central surface brightness and total absolute magnitudes range between 20.3--26.7 mag arcsec$^{-2}$ and --(8.02--17.69) mag, respectively, while the $I$-band effective radii are between 0.14 and 2.97 kpc. We obtain $\\alpha$ $\\simeq$ --1.43 $\\pm$ 0.02 for the faint-end slope of their luminosity function, comparable to previously measured values but shallower than theoretical predictions based on $\\Lambda$CDM models. The distance-independent distributions of their mass and color from the host galaxy NGC~2997 suggest that the group could be dynamically young, prior to the development of significant mass segregation or radial color gradients. The systematically bluer colors of the brighter candidates than the fainter ones indicate higher star formation activities in brighter members. We suggest that the higher-mass dwarf galaxies in the group have maintained star-formation activities by effectively retaining gas content, while environmental quenching is only effective for the lower-mass galaxies. The interpretation of early evolutionary stage of this group is also consistent with the overall morphological distribution of the dwarf galaxy candidates showing a lack of morphologically evolved candidates but a plethora of irregularly shaped ones. Our detection rate of dwarf galaxy candidates in the NGC~2997 group and their inferred star formation activities are largely comparable to those found in Milky Way analog systems from the SAGA survey within the magnitude limit M$\\_{V}$ $\\lesssim$ --13 mag, as well as those found in the ELVES survey.\n\n", "2303.16539": "2023-03-29, **Fluxes and spectral indices of rare and abundant cosmic ray nuclei according to the NUCLEON space experiment**, I. A. Kudryashov et.al., [2303.16539v1](http://arxiv.org/abs/2303.16539v1)\n\n In this paper the dependence of the spectra of cosmic ray nuclei on the charges of nuclei was studied, according to the data of the NUCLEON space experiment. First, we studied the dependence of the spectral index of magnetic rigidity spectra on the charge for abundant nuclei. Secondly, for the charge range $Z=9\\div20$, the differences in the total spectra of rare odd and abundant even nuclei were studied. Using the GALPROP package, the inverse problem of CR propagation from a source (near supernova) to an observer was solved, a component-by-component spectrum in the source was reconstructed, and it was shown that a systematic change in the spectral index in the source exist. It is supposed that this change may be interpreted as incomplete ionization of cosmic rays at the stage of acceleration in the supernova remnant shock. The ratio of the total spectra of magnetic rigidity for low-abundance odd and abundant even nuclei from the charge range $Z=9\\div20$ is obtained, and it was shown that the spectra of odd rare nuclei are harder than the stpectra of abundat even nuclei in the rigidity range 300--10000~GV.\n\n", "2303.16497": "2023-03-29, **He abundance of Dense Circumstellar Clumps in the Cassiopeia A Supernova Remnant**, Bon-Chul Koo et.al., [2303.16497v1](http://arxiv.org/abs/2303.16497v1)\n\n We report on the result of He abundance analysis of dense circumstellar clumps in the young supernova remnant Cassiopeia A. These clumps, which are called quasi-stationary flocculi (QSFs), are known from previous optical studies to be enriched in He along with N, but the degree of He overabundance relative to H has remained uncertain. For several QSFs with near-infrared spectroscopic data, we have analyzed their He I 1.083 $\\mu$m/Pa$\\gamma$ ratios together with the ratios of [Fe II] lines by using the Raymond shock code. According to our analysis, He is overabundant relative to H by a factor of $\\lesssim 3$ in most of these QSFs. This He abundance of QSFs is consistent with the previous conclusion from the N overabundance that QSFs were ejected when a substantial amount of the H envelope of the progenitor star had been stripped off. We discuss the mass-loss history of the progenitor star and the origin of QSFs.\n\n"}}