{"neutrino": {"2505.16961": "2025-05-22, **Predicting the outcome of collisional neutrino flavor conversion**, Julien Froustey et.al., [2505.16961v1](http://arxiv.org/abs/2505.16961v1)\n\n Collisional flavor instabilities, driven by differing neutrino and antineutrino reaction rates, are expected to occur in dense astrophysical environments like supernovae and neutron star mergers, but have yet to be incorporated in large-scale simulations. We derive, for the first time, analytical expressions for the asymptotic state resulting from a homogeneous and isotropic instability, and apply these predictions to two representative conditions from a neutron star merger simulation. We emphasize the importance of using a collision term that allows for both damping of flavor coherence and relaxation back to thermal equilibrium, which leads to a \"quantum\" equilibrium with nonzero coherence. These results can be implemented in a subgrid model of collisional flavor transformation, an important step toward the inclusion of flavor oscillation physics into global simulations.\n\n", "2505.16777": "2025-05-22, **Fast Low Energy Reconstruction using Convolutional Neural Networks**, IceCube Collaboration et.al., [2505.16777v1](http://arxiv.org/abs/2505.16777v1)\n\n IceCube is a Cherenkov detector instrumenting over a cubic kilometer of glacial ice deep under the surface of the South Pole. The DeepCore sub-detector lowers the detection energy threshold to a few GeV, enabling the precise measurements of neutrino oscillation parameters with atmospheric neutrinos. The reconstruction of neutrino interactions inside the detector is essential in studying neutrino oscillations. It is particularly challenging to reconstruct sub-100 GeV events with the IceCube detectors due to the relatively sparse detection units and detection medium. Convolutional neural networks (CNNs) are broadly used in physics experiments for both classification and regression purposes. This paper discusses the CNNs developed and employed for the latest IceCube-DeepCore oscillation measurements. These CNNs estimate various properties of the detected neutrinos, such as their energy, direction of arrival, interaction vertex position, flavor-related signature, and are also used for background classification.\n\n", "2505.16699": "2025-05-22, **Neutrino Decoherence via Modified Dispersion**, Bikash Kumar Acharya et.al., [2505.16699v1](http://arxiv.org/abs/2505.16699v1)\n\n We study in detail the effect of quantum decoherence in neutrino oscillations. We adopt a phenomenological approach that allows us to parametrize the energy dependence of the decoherence effects resulting from the modification of the neutrino dispersion relation. Using the open quantum system framework we derive decoherence parameters, which are usually connected to quantum gravitational effects. Furthermore, we study the sensitivity of decoherence on high-energy astrophysical neutrinos among all possible initial source compositions. We find that variation in the flux composition at neutrino telescopes can be a good probe to test such effects. Additionally, we show that a simple extension with heavy sterile neutrino decoherence produces verifiable signatures.\n\n", "2505.16153": "2025-05-22, **Model-Independent Measurement of the Matter-Radiation Equality Scale in DESI 2024**, B. Bahr-Kalus et.al., [2505.16153v1](http://arxiv.org/abs/2505.16153v1)\n\n The peak of the matter power spectrum, known as the turnover (TO) scale, is determined by the horizon size at the time of matter-radiation equality. This scale can serve as a standard ruler, independent of other features in the matter power spectrum, such as baryon acoustic oscillations (BAO). Here, we present the first detection of the turnover in the galaxy auto-power spectrum, utilising the distribution of quasars (QSO) and luminous red galaxies (LRG) measured by the Dark Energy Spectroscopic Instrument (DESI) during its first year of survey operations in a model-independent manner. To avoid confirmation bias, we first analyse the data using data blinding methods designed for the DESI baryon acoustic oscillation, redshift space distortion and scale-dependent bias signals. We measure the angle-averaged dilation distance $D\\_V(z = 1.651) = (38.1\\pm 2.5)r\\_H$ from the quasars and $D\\_{V}(z = 0.733) = (21.8\\pm 1.0)r\\_H$ from the LRG sample in units of the horizon $r\\_H$ at the matter-radiation-equality epoch. Combining these two constraints and assuming a flat $\\Lambda$CDM model with three standard neutrino species, we can translate this into a constraint of $\\Omega\\_{m}h^2 = 0.139^{+0.036}\\_{-0.046}$. We can break the $\\Omega\\_m$-$H\\_0$ degeneracy with low-redshift distance measurements from type-Ia supernova (SN) data from Pantheon+, we obtain a sound-horizon free estimate of the Hubble-Lema\\^itre parameter of $H\\_0=65.2^{+4.9}\\_{-6.2}$ km/s/Mpc, consistent with sound-horizon dependent DESI measurements. On the other hand, combining the DESI BAO and TO, we find a truly DESI-only measurement of $H\\_0=74.0^{+7.2}\\_{-3.5}$ km/s/Mpc, in line with DESI-only full-shape results where the sound-horizon scale is marginalised out. This discrepancy in $H\\_0$ can be reconciled in a $w\\_0w\\_a$CDM cosmology, where the combination of DESI BAO and TO data yields $H\\_0 = 66.5\\pm 7.2\\;\\mathrm{km/s/Mpc}$.\n\n", "2505.16092": "2025-05-22, **Spontaneous generation of athermal phonons bursts within bulk silicon causing excess noise, low energy background events and quasiparticle poisoning in superconducting sensors**, C. L. Chang et.al., [2505.16092v1](http://arxiv.org/abs/2505.16092v1)\n\n Solid state phonon detectors used in the search for dark matter or coherent neutrino nucleus interactions (CE$\\nu$NS) require excellent energy resolution (eV-scale or below) and low backgrounds to meet their science objectives. Unfortunately, an unknown source of phonon bursts (the low energy excess, or ``LEE'') both dominates all other above threshold background sources and produces shot noise from sub-threshold bursts which greatly exceeds all fundamental noise sources. In this paper, we measure these phonon bursts for 12 days after cool down in two nearly identical multi-phonon sensor channel 1cm$^2$ silicon detectors which differ only in the thickness of their substrate (1 mm vs 4 mm thick). We find that both the correlated shot noise and near threshold shared LEE relax with time since cooldown. Additionally, we show that both shot noise and LEE rates scale linearly with substrate thickness. When combined with previous measurements of other silicon phonon detectors with different substrate geometries and mechanical support strategies, these measurements strongly suggest that the dominant source of both above and below threshold LEE is the bulk substrate. By monitoring the relation between bias power and excess phonon shot noise we estimate that $\\varepsilon = \\frac{<E^2>}{<E>}$ for sub-threshold noise events is $0.68 \\pm 0.38$ meV. In our final dataset, we report a world-leading energy resolution of 258.5$\\pm$0.4 meV in the 1mm thick detector. Simple calculations suggest that these Si substrate phonon bursts are likely the dominant source of quasi-particle poisoning in superconducting qubits and sensors that are operated in well shielded and vibration free environments.\n\n"}, "dark matter": {"2505.17007": "2025-05-22, **Broadband Search for Axion Dark Matter via Shift Current**, Dan Kondo et.al., [2505.17007v1](http://arxiv.org/abs/2505.17007v1)\n\n We propose a novel method to detect axion dark matter based on a topological phenomenon known as the shift current. We exploit the second-order nonlinearity of the shift current by applying a strong oscillating electric field. This field enhances the axion-induced shift current signal and downconverts its frequency to a more accessible range. The non-dissipative nature of the shift current allows us to achieve broadband detection via difference frequency generation. We demonstrate, using Type-I Weyl semimetal TaAs property, the possibility of probing the parameter space of the QCD axion in the mass range of $\\mathcal{O}(10)$ - $\\mathcal{O}(100) \\ \\rm meV$ corresponding to the photon coupling of $g\\_{a\\gamma\\gamma}\\simeq$ $\\mathcal{O}(10^{-12})$ - $\\mathcal{O}(10^{-11})~\\text{GeV}^{-1}$, respectively.\n\n", "2505.16981": "2025-05-22, **DarkNESS: A skipper-CCD NanoSatellite for Dark Matter Searches**, Phoenix Alpine et.al., [2505.16981v1](http://arxiv.org/abs/2505.16981v1)\n\n The Dark matter Nanosatellite Equipped with Skipper Sensors (DarkNESS) deploys a recently developed skipper-CCD architecture with sub-electron readout noise in low Earth orbit (LEO) to investigate potential signatures of dark matter (DM). The mission addresses two interaction channels: electron recoils from strongly interacting sub-GeV DM and X-rays produced through decaying DM. Orbital observations avoid attenuation that limits ground-based measurements, extending sensitivity reach for both channels. The mission proceeds toward launch following laboratory validation of the instrument. A launch opportunity has been secured through Firefly Aerospace's DREAM 2.0 program, awarded to the University of Illinois Urbana-Champaign (UIUC). This will constitute the first use of skipper-CCDs in space and evaluate their suitability for low-noise X-ray and single-photon detection in future space observatories.\n\n", "2505.16641": "2025-05-22, **Constraining anti-baryonic dark matter through correlated nucleon decay signatures**, Mathew Thomas Arun et.al., [2505.16641v1](http://arxiv.org/abs/2505.16641v1)\n\n Baryon number violation in the visible sector induced by anti-baryonic dark matter provides a viable mechanism for low-scale baryogenesis. Two of the most sensitive probes of this scenario are neutron decay processes such as $n \\to \\text{invisible}$ and $n \\to \\pi^0 + \\text{invisible}$. In this work, we discuss the generation of di-nucleon decay processes such as $nn \\to \\bar{\\nu}\\bar{\\nu}$ and $nn \\to \\pi^0\\pi^0$ at one-loop, arising from the operators responsible for induced nucleon decays. While nucleon decay rates in this model depend on the local dark matter density, di-nucleon decay processes do not, providing a complementary probe of the new physics. We thus use bounds on both nucleon and di-nucleon decays to constrain the mass and terrestrial density of anti-baryonic dark matter.\n\n", "2505.16521": "2025-05-22, **Unveiling the inert Triplet desert region with a pNGB Dark Matter and its Gravitational Wave signatures**, Pankaj Borah et.al., [2505.16521v1](http://arxiv.org/abs/2505.16521v1)\n\n In this work, we extend the scalar sector of the conventional hyperchargeless inert triplet model (ITM) to include a second dark matter (DM) candidate, which appears to be a pseudo-Nambu-Goldstone boson (pNGB). The usual ITM with an extended scalar sector offers a DM candidate along with novel signatures at different experiments, e.g., colliders, gravitational wave detectors, etc. Nevertheless, hitherto unseen experimental detections have placed stringent constraints on the ITM parameter space. Moreover, triplet masses lighter than $1.9$ TeV, consistent with the existing or upcoming collider sensitivity reach, are already excluded from the DM observable, as they yield an underabundant relic density due to a strong $SU(2)\\_L$ gauge annihilation. Inclusion of a pNGB DM, via a complex $SU(2)\\_L$ scalar singlet and through the soft-breaking of a $U(1)$ symmetry, helps to revive the sub-TeV regime of the triplet DM. This resurgence relies on a proficient conversion between the two DM species. Using this inter-conversion, with the triplet DM as the lighter one between the two, we show that it is possible to push the triplet DM contribution to $50\\% - 60\\%$ of the total relic density. This offers a significant improvement over the traditional ITM with a single DM candidate, where the same can at most reach $10\\% - 20\\%$. Besides, the concerned bipartite DM framework also offers the possibility of a first-order phase transition along various constituent field directions. Among these, the one along the real $SU(2)\\_L$ singlet direction can be a strong one which subsequently yields detectable gravitational wave signals at the upcoming space-based gravitational wave detectors such as LISA, BBO, DECIGO, etc., alongside distinctive and complementary signatures at the various DM and collider quests.\n\n", "2505.16438": "2025-05-22, **Exploring parametrized dark energy models in interacting scenario**, Sangita Goswami et.al., [2505.16438v1](http://arxiv.org/abs/2505.16438v1)\n\n In the present work, we have studied the dynamics of accelerating universe considering a simple parametrization of the equation of state parameter in an interacting scenario. In this toy model, the dark energy component is allowed to interact with the dark matter component through a source term. The expressions for various relevant cosmological parameters for the proposed parametrized model have been obtained and it has been found that the proposed model consistently drives the late time cosmic acceleration of the universe. We have also carried out the Bayesian analysis using recent observational datasets in order to obtain the best fit values of the model parameters. It has been found that the dark energy model with $Q \\propto H\\rho\\_{de}$ can provide a possible resolution of the Hubble tension in an interacting scenario where the dark energy component decays into the dark matter.\n\n", "2505.16359": "2025-05-22, **Determining non-symmetric dark matter halo around magnetars with two fluid approach**, Asit karan et.al., [2505.16359v1](http://arxiv.org/abs/2505.16359v1)\n\n We investigate the impact of dark matter on the structure and deformation of magnetars. We assume a perturbative approach for the magnetic field deformation and that the dark matter only interacts gravitationally with hardonic matter. Assuming that the DM is significantly softer than HM, we find that the magnetic field can affect dark matter through the deformation of space-time. The number of stars having a dark matter halo outside the hadronic matter surface increases with an increase in dark matter fraction and the stiffness of the dark matter equation of state. As the magnetic field deforms the stars from sphericity, we can have a situation where we have a non-symmetric dark matter halo outside the star. This can have interesting observational gravitational signatures unique to magnetars with having DM halo.\n\n", "2505.16266": "2025-05-22, **Anisotropic quantum universe in Hořava-Lifshitz gravity**, Vikramaditya Mondal et.al., [2505.16266v1](http://arxiv.org/abs/2505.16266v1)\n\n We quantize a Bianchi IX universe in Ho\\v{r}ava-Lifshitz theory. For analytical tractability, we consider the small anisotropy limit of the Bianchi IX, that is, a perturbative anisotropic deformation of a closed, homogeneous and isotropic universe. In the case of the projectable theory we further set the ``dark matter as integration constant'' to zero by assuming that the space consists of only one connected piece. In that limit and under the assumption, we first study the semi-classical WKB solutions to the Wheeler-DeWitt equation. We find the wave function of the universe, up to an overall normalization, and estimate the semi-classical tunneling probability for the emergence of an expanding universe. We establish a dictionary of correspondence between the WKB wave functions in General Relativity and Ho\\v{r}ava-Lifshitz theory in the large-scale factor (or IR) limit. For a small universe (UV limit), on the other hand, due to contributions from higher-dimensional operators, the anisotropies decouple from the scale factor, a behavior significantly different from General Relativity, and analytic solutions to the Wheeler-DeWitt equation beyond the WKB approximation can be found. The wave function of the scale factor satisfies the DeWitt criterion, whereas the wave functions of anisotropies resemble those of quantum harmonic oscillators. The quantum prediction for the initial condition of anisotropies is obtained in terms of the coupling parameters of Ho\\v{r}ava-Lifshitz theory. We find a bound on the coupling parameters from the normalizability of the wave functions of anisotropies. Further, we calculate the expectation values for squared anisotropic shear and squared anisotropies in both the large universe and small universe limits.\n\n", "2505.16224": "2025-05-22, **Dark Z-mediated dark matter with verifiable exotic scalars**, Chuan-Ren Chen et.al., [2505.16224v1](http://arxiv.org/abs/2505.16224v1)\n\n In this work, we study a dark matter scenario where a dark Z boson possessing mass mixing with the SM Z boson couples to the DM candidate and serves as the portal to the SM. The UV origin of the mass mixing in the form of an extra dark Higgs doublet and a scalar dark singlet provides new exotic scalars which can constitute the final state of DM annihilation during freeze-out. We find that existing constraints on the observed Higgs coupling strength, exotic Higgs searches and dark matter observables complement each other, while future searches for exotic Higgs decays and resonant heavy scalars at HL-LHC will be sensitive to part of the allowed parameter space.\n\n"}, "supernova": {}}