{"neutrino": {"2411.08762": "2024-11-13, **Particle acceleration and multi-messenger radiation from Ultra-Luminous X-ray Sources -- A new class of Galactic PeVatrons**, Enrico Peretti et.al., [2411.08762v1](http://arxiv.org/abs/2411.08762v1)\n\n Super-Eddington accretion onto stellar-mass compact objects powers fast outflows in Ultra-Luminous X-ray sources (ULXs). Such outflows, which can reach mildly relativistic velocities, are often observed forming bubble structures. Wind bubbles are expected to develop strong wind termination shocks, sites of great interest for diffusive shock acceleration. We develop a model of diffusive shock acceleration in the wind bubbles powered by ULXs. We find that the maximum energy in these objects can easily reach the PeV range, promoting ULX winds as a new class of PeVatrons. We specialize our model in the context of the Galactic source SS 433 and show that high-energy protons in the bubble might explain the highest energy photons (>100 TeV) and their morphology recently observed by LHAASO. We discuss the detectability of such a source in neutrinos and we analyze the possible radio counterpart of ULXs focusing on the case of W50, the nebula surrounding SS 433. We finally discuss the possible contribution of Galactic ULXs to the cosmic-ray flux at the knee concluding that their role might be substantial.\n\n", "2411.08604": "2024-11-13, **Production of GEM-like structures using laser-cutting techniques**, L. M. Ramos et.al., [2411.08604v1](http://arxiv.org/abs/2411.08604v1)\n\n To enhance the ionization yield of liquid argon time projection chambers (LArTPC) used in dark matter and neutrino experiments it was proposed the use of dopants in LAr, with ionization energies below the scintillation threshold of Ar. While dual-phase LArTPCs have excellent sensitivity to single ionization electrons, their compatibility with photosensitive dopants is hindered by gas-phase electroluminescence photons ionizing the dopants, leading to a positive feedback loop. This can be addressed by optically decoupling the gaseous and liquid phases with a barrier that transmits electrons. A possible solution relies on the use of a pair of structures based on Gaseous Electron Multipliers(GEMs) with misaligned holes. Rather than amplifying electron signals in gas pockets within their holes, their holes will be filled with LAr and a low biasing voltage, so that incident drifting electrons are drawn into the holes but not amplified. Instead, amplification will occur in the gas phase above the structures. Its core element is a GEM-like structure machined from polyethylene naphthalate(PEN). Since PEN scintillates in the visible spectrum, the risk of increased radioactivity due to the larger mass compared to traditional wire grids is negated by the potential to veto its own radioactivity. As such, these structures may also be a useful alternative to wire grids. In this work, we report the newest developments on the production of GEM-like structures using laser-based techniques, namely the manufacture of the first batch PEN and PMMA-based GEM-like structures. This process allows low-cost, reproducible fabrication of a high volume of such structures. In addition to being a low radioactive technique, we expect that it will allow the scaling up of the production of these structures at a reduced cost. First tests indicate good electrical stability, while the performance assessment is still ongoing.\n\n", "2411.08555": "2024-11-13, **The two alternative explosion mechanisms of core-collapse supernovae: 2024 status report**, Noam Soker et.al., [2411.08555v1](http://arxiv.org/abs/2411.08555v1)\n\n In comparing the two alternative explosion mechanisms of core-collapse supernovae (CCSNe), I examine recent three-dimensional (3D) hydrodynamical simulations of CCSNe in the frame of the delayed-neutrino explosion mechanism (neutrino mechanism) and argue that these valuable simulations show that neutrino heating can supply a non-negligible fraction of the explosion energy but not the observed energies, hence cannot be the primary explosion mechanism. In addition to the energy crisis, the neutrino mechanism predicts many failed supernovae that are not observed. The most challenging issue of the neutrino mechanism is that it cannot account for point-symmetric morphologies of CCSN remnants, many of which were identified in 2024. These contradictions with observations imply that the neutrino mechanism cannot be the primary explosion mechanism of CCSNe. The alternative jittering-jets explosion mechanism (JJEM) seems to be the primary explosion mechanism of CCSNe; neutrino heating boosts the energy of the jittering jets. Even if some simulations show explosions of stellar models (but usually with energies below observed), it does not mean that the neutrino mechanism is the explosion mechanism. Jittering jets, which simulations do not include, can explode the core before the neutrino heating process does. Morphological signatures of jets in many CCSN remnants suggest that jittering jets are the primary driving mechanism, as expected by the JJEM.\n\n", "2411.08542": "2024-11-13, **Neutrino mass experiments: current and future**, Larisa A. Thorne et.al., [2411.08542v1](http://arxiv.org/abs/2411.08542v1)\n\n Nearly 70 years since the neutrino was discovered, and 25 years since discovery of neutrino oscillations established its non-zero mass, the absolute neutrino-mass scale remains unknown. Due to its unique characteristics, determining this neutrino property requires new measurement techniques to be developed. Currently, there are four measurement approaches: using cosmological models, inference from time-of-arrival from supernovae, through observation of neutrinoless double beta decay, and the kinematics of weak decay processes. I will review the theoretical basis underlying neutrino mass measurement and present key experiments in this field. I will highlight the current best upper limits, how neutrino mass experiments are complementary to other neutrino property searches, and summarize the challenges that lie ahead of the neutrino mass community.\n\n", "2411.08517": "2024-11-13, **Modified Models for Neutrino Masses and Mixings**, Arak M. Mathai et.al., [2411.08517v1](http://arxiv.org/abs/2411.08517v1)\n\n The neutrino sector of the seesaw-modified Standard Model is investigated under the anarchy principle. The anarchy principle leading to the seesaw ensemble is studied analytically with tools of random matrix theory. The probability density function is obtained.\n\n", "2411.08503": "2024-11-13, **Quasi-steady evolution of fast neutrino-flavor conversions**, Jiabao Liu et.al., [2411.08503v1](http://arxiv.org/abs/2411.08503v1)\n\n In astrophysical environments such as core-collapse supernovae (CCSNe) and binary neutron star mergers (BNSMs), neutrinos potentially experience substantial flavor mixing due to the refractive effects of neutrino self-interactions. Determining the survival probability of neutrinos in asymptotic states is paramount to incorporating flavor conversions' effects in the theoretical modeling of CCSN and BNSM. Some phenomenological schemes have shown good performance in approximating asymptotic states of fast neutrino-flavor conversions (FFCs), known as one of the collective neutrino oscillation modes induced by neutrino self-interactions. However, a recent study showed that they would yield qualitatively different asymptotic states of FFC if the neutrino number is forced to evolve. It is not yet fully understood why the canonical phenomenological models fail to predict asymptotic states. In this paper, we perform detailed investigations through numerical simulations and then provide an intuitive explanation with a quasi-homogeneous analysis. Based on the analysis, we propose a new phenomenological model, in which the quasi-steady evolution of FFCs is analytically determined. The model also allows us to express the convolution term of spatial wave number as a concise form, which corresponds to useful information on analyses for the non-linear feedback from small-scale flavor conversions to large-scale ones. Our model yields excellent agreement with numerical simulations, which lends support to our interpretation.\n\n", "2411.08330": "2024-11-13, **Collisional Approach for Open Neutrino Systems**, W. L. Ribeiro et.al., [2411.08330v1](http://arxiv.org/abs/2411.08330v1)\n\n We develop a collisional framework for neutrino propagation within open quantum systems, termed the \\emph{Collisional Approach for Open Neutrino Systems} (CAONS). A Born-Markov equation is derived, linking decoherence, dissipation, decay rates, and scattering cross sections. Perturbation theory is not required and the resultant master equation is applied to visible and invisible neutrino decays and propagation through a stationary medium. Comparing with previous studies on neutrino decoherence, we show that current bounds on decoherence parameters can significantly tighten constraints on neutrino couplings with dark-matter. Lastly, we establish connections between CAONS and non-Hermitian Hamiltonian approaches.\n\n"}, "dark matter": {"2411.08737": "2024-11-13, **Perturbative Unitarity Violation in Radiative Capture Transitions to Dark Matter Bound States**, Martin Beneke et.al., [2411.08737v1](http://arxiv.org/abs/2411.08737v1)\n\n We investigate the formation of bound states of non-relativistic dark matter particles subject to long-range interactions through radiative capture. The initial scattering and final bound states are described by Coulomb potentials with different strengths, as relevant for non-abelian gauge interactions or theories featuring charged scalars. For bound states with generic quantum numbers $n$ and $\\ell$, we provide closed-form expressions for the bound-state formation (BSF) cross sections of monopole, dipole and quadrupole transitions, and of arbitrary multipole order when $\\ell=n-1$. This allows us to investigate in detail a strong enhancement of BSF that occurs for initial states in a repulsive potential. For $\\ell=n-1\\gg 1$, we show that the BSF cross section for each single bound state violates the perturbative unitarity bound in the vicinity of a certain critical initial velocity, and provide an interpretation in terms of a smooth matching of classical trajectories. When summing the BSF cross section over all possible bound states in the final state, this leads to a unitarity violation below a certain velocity, but within the validity range of the weakly coupled non-relativistic description. We identify an effectively strong interaction as the origin of this unitarity violation, which is caused by an \"anomalously\" large overlap of scattering and bound-state wave functions in Coulomb potentials of different strength.\n\n", "2411.08565": "2024-11-13, **The overconcentrated dark halo in the strong lens SDSS J0946+1006 is a subhalo: evidence for self interacting dark matter?**, Wolfgang J. R. Enzi et.al., [2411.08565v1](http://arxiv.org/abs/2411.08565v1)\n\n The nature of dark matter is poorly constrained on subgalactic scales. Alternative models to cold dark matter, such as warm dark matter or self-interacting dark matter, could produce very different dark haloes on these scales. One of the few known dark haloes smaller than a galaxy was discovered in the triple source plane strong lens system J0946+1006. Previous studies have found that this structure is much more concentrated than expected in $\\Lambda$CDM, but have assumed the dark halo is at the same redshift as the main deflector ($z\\_{\\rm main}=0.222$). In this paper, we fit for the redshift of this dark halo. We reconstruct the first two sources in the system using a forward modelling approach, allowing for additional complexity from multipole perturbations. We find that the perturber redshift is $z\\_{\\rm halo} = {0.207}^{+0.019}\\_{-0.019}$, and lower bounds on the evidence strongly prefer a subhalo over a line-of-sight structure. Whilst modelling both background sources does not improve constraints on the redshift of the subhalo, it breaks important degeneracies affecting the reconstruction of multipole perturbations. We find that the subhalo is a more than $5\\sigma$ outlier from the $\\Lambda$CDM $v\\_{\\rm max}$-$r\\_{\\rm max}$ relation and has a steep profile with an average slope of $\\gamma\\_{\\rm 2D} = {-1.81}^{+0.15}\\_{-0.11}$ for radii between $0.75-1.25$ kpc. This steep slope might indicate dark matter self-interactions causing the subhalo to undergo gravothermal collapse; such collapsed haloes are expected to have $\\gamma\\_{\\rm 2D} \\approx -2$.\n\n", "2411.08431": "2024-11-13, **Upper limit on dark matter mass in the inert doublet model**, Wararat Treesukrat et.al., [2411.08431v1](http://arxiv.org/abs/2411.08431v1)\n\n We study the upper limit on dark matter mass in the context of the inert double model. We derive analytic expression for the upper bound as a function of the mass squared differences between dark matter and other new particles. We find that the upper limit varies between 20$-$80 TeV depending on the mass squared splitting.\n\n"}, "supernova": {"2411.08866": "2024-11-13, **The GRBSN webtool: An open-source repository for gamma-ray burst-supernova associations**, Gabriel Finneran et.al., [2411.08866v1](http://arxiv.org/abs/2411.08866v1)\n\n This paper presents the GRBSN webtool, a public facing application which hosts the most complete list of GRB-SN associations to date. In contrast to other repositories of supernova or gamma-ray burst data, this tool brings together all of the information required to study a GRB-SN association. GRBSN allows users to view and interact with plots of the data; search and filter the whole database; and download all multi-wavelength data related to a GRB-SN association, including radio, X-ray, optical/NIR photometric and spectroscopic data. The tool is fully open source and is hosted on a public GitHub repository, meaning users can upload their own data, flag missing data and suggest improvements. As the number of confirmed GRB-SN associations increases, the webtool will provide a robust framework in which to catalogue these associations and their associated data. The web application is freely available and publicly accessible at https://grbsn.watchertelescope.ie.\n\n", "2411.08837": "2024-11-13, **A massive white dwarf or low-mass neutron star discovered by LAMOST**, Xinlin Zhao et.al., [2411.08837v1](http://arxiv.org/abs/2411.08837v1)\n\n We report the discovery of a close binary J0606+2132 (Gaia DR3 3423365496448406272) with $P\\_{\\rm obs}=2.77$ days containing a possible massive white dwarf or a neutron star using the LAMOST spectroscopic data. By a joint fitting of the radial velocity from LAMOST and the light curve from TESS, we derived a circular Keplerian orbit with an inclination of $i=$81.31$^{\\circ}$$^{+6.26^{\\circ}}\\_{-7.85^{\\circ}}$, which is consistent with that derived from $v{\\rm sin}I$. Together with the mass of the visible star, we derived the mass of the invisible object to be 1.34$^{+0.35}\\_{-0.40} M\\_{\\odot}$. Spectral disentangling with the LAMOST medium-resolution spectra shows no absorption feature from an additional component, suggesting the presence of a compact object. No X-ray or radio pulsed signal is detected from ROSAT and FAST archive observations. J0606+2132 could evolve into either a Type Ia supernova or a neutron star through accretion-induced collapse if it is a white dwarf, or into an intermediate-mass X-ray binary if it is a neutron star.\n\n", "2411.08639": "2024-11-13, **Revisiting holographic dark energy after DESI 2024**, Tian-Nuo Li et.al., [2411.08639v1](http://arxiv.org/abs/2411.08639v1)\n\n New insights from the Dark Energy Spectroscopic Instrument (DESI) 2024 baryon acoustic oscillations (BAO) data, in conjunction with cosmic microwave background (CMB) and Type Ia supernova (SN) data, suggest that dark energy may not be a cosmological constant. In this work, we investigate the cosmological implications of holographic dark energy (HDE) and interacting holographic dark energy (IHDE) models, utilizing CMB, DESI BAO, and SN data. By considering the combined DESI BAO and SN data, we determine that in the IHDE model, the parameter $c > 1$ and the dark-energy equation of state $w$ does not cross $-1$ at the $1\\sigma$ confidence level, whereas in the HDE model, it marginally falls below this threshold. Upon incorporating CMB data, we observe that in the HDE model, the parameter $c < 1$ and $w$ crosses $-1$ at a level beyond $10\\sigma$. Conversely, for the IHDE model, the likelihood of $w$ crossing $-1$ is considerably diminished, implying that the introduction of interaction within the HDE model could potentially resolve or mitigate the cosmic big rip conundrum. Furthermore, our analysis reveals that the HDE and IHDE models are statistically as viable as the $\\Lambda$CDM model when assessing Bayesian evidence with DESI BAO data combined with SN data. However, when CMB data are added, the HDE and IHDE models are significantly less favored compared to the $\\Lambda$CDM model. Our findings advocate for further exploration of the HDE and IHDE models using forthcoming, more precise late-universe observations.\n\n", "2411.08498": "2024-11-13, **A dark energy parameterization independent constraint of the spatial curvature $Ω_K$**, Zhennan Li et.al., [2411.08498v1](http://arxiv.org/abs/2411.08498v1)\n\n Determining the spatial curvature $\\Omega\\_K$ of the Universe has long been crucial in cosmology. In practice, this effort is often entangled with assumptions of dark energy. A combination of distance ($D\\_{\\rm M}$, $D\\_{\\rm L}$) and expansion rate ($H(z)$) measurements can break this degeneracy. However, fitting against discrete data points requires parameterizations of distance and expansion rate as functions of redshifts, which often induces cosmological model dependence. In this work, we propose a new dark energy model-independent parameterization of the cosmological comoving radial distance $\\chi$. Fitting data combining distance ($D\\_{\\rm M}$, $D\\_{\\rm L}$) and Hubble parameter (or equivalently $D\\_H$) measurements, we are then able to obtain $\\Omega\\_K$ in a dark energy model-independent manner. We test this parameterization and the associated fitting scheme with mock data generated with a wide range of fiducial dark energy equations of state ($-1.3<w<1.3$), finding that the best-fit $\\Omega\\_K$ is always unbiased. Then we combine SDSS Baryon Acoustic Oscillation (BAO), Pantheon+ sample of Type Ia Supernovae (SNe Ia), and Observational Hubble Data (OHD) to constrain $\\Omega\\_K$. We find a flat universe with $\\Omega\\_K=-0.01\\pm 0.09$. Most constraining power is contributed by SDSS BAO, with the BAO-alone constraint $\\Omega\\_K=-0.03 \\pm 0.10$. When replacing SDSS BAO with DESI year-one BAO measurement, we obtain $\\Omega\\_K=0.06 \\pm 0.08$. With the full DESI BAO data alone, we forecast $\\sigma(\\Omega\\_K)\\sim 0.03$. Our result verifies the flatness of the universe free of dark energy modeling, and the proposed parameterization would be useful for future investigation of $\\Omega\\_K$ and other parameters of interest, such as the horizon radius.\n\n", "2411.08407": "2024-11-13, **Parameter estimation of protoneutron stars from gravitational wave signals using the Hilbert-Huang transform**, Seiya Sasaoka et.al., [2411.08407v1](http://arxiv.org/abs/2411.08407v1)\n\n Core-collapse supernovae (CCSNe) are potential multimessenger events detectable by current and future gravitational wave (GW) detectors. The GW signals emitted during these events are expected to provide insights into the explosion mechanism and the internal structures of neutron stars. In recent years, several studies have empirically derived the relationship between the frequencies of the GW signals originating from the oscillations of protoneutron stars (PNSs) and the physical parameters of these stars. This study applies the Hilbert-Huang transform (HHT) [Proc. R. Soc. A 454, 903 (1998)] to extract the frequencies of these modes to infer the physical properties of the PNSs. The results exhibit comparable accuracy to a short-time Fourier transform-based estimation, highlighting the potential of this approach as a complementary method for extracting physical information from GW signals of CCSNe.\n\n"}}