{"neutrino": {"2501.08988": "2025-01-15, **Feldman-Cousins' ML Cousin: Sterile Neutrino Global Fits using Simulation-Based Inference**, Joshua Villarreal et.al., [2501.08988v1](http://arxiv.org/abs/2501.08988v1)\n\n For many small-signal particle physics analyses, Wilks' theorem, a simplifying assumption that presumes log-likelihood asymptotic normality, does not hold. The most common alternative approach applied in particle physics is a highly computationally expensive procedure put forward by Feldman and Cousins. When many experiments are combined for a global fit to data, deviations from Wilks' theorem are exacerbated, and Feldman-Cousins becomes computationally intractable. We present a novel, machine learning-based procedure that can approximate a full-fledged Bayesian analysis 200 times faster than the Feldman-Cousins method. We demonstrate the utility of this novel method by performing a joint analysis of electron neutrino/antineutrino disappearance data within a single sterile neutrino oscillation framework. Although we present a prototypical simulation-based inference method for a sterile neutrino global fit, we anticipate that similar procedures will be useful for global fits of all kinds, especially those in which Feldman-Cousins is too computationally expensive to use.\n\n", "2501.08984": "2025-01-15, **Centre-of-momentum Variables in $ν_μ$CC1p1$π$**, Weijun Li et.al., [2501.08984v1](http://arxiv.org/abs/2501.08984v1)\n\n This study introduces a novel set of variables designed to isolate final-state interactions from the effects of nuclear initial states. Through detailed simulation studies, this work demonstrates the ability of these variables to distinguish FSI contributions with minimal dependence on IS, highlighting their potential for advancing neutrino interaction modelling.\n\n", "2501.08957": "2025-01-15, **Potential Contribution of Young Pulsar Wind Nebulae to Galactic High-Energy Neutrino Emission**, Xuan-Han Liang et.al., [2501.08957v1](http://arxiv.org/abs/2501.08957v1)\n\n Pulsar wind nebulae (PWNe), especially the young ones, are among the most energetic astrophysical sources in the Galaxy. It is usually believed that the spin-down energy injected from the pulsars is converted into magnetic field and relativistic electrons, but the possible presence of proton acceleration inside PWNe cannot be ruled out. Previous works have estimated the neutrino emission from PWNe using various source catalogs measured in gamma-rays. However, such results rely on the sensitivity of TeV gamma-ray observations and may omit the contribution by unresolved sources. Here we estimate the potential neutrino emission from a synthetic population of PWNe in the Galaxy with a focus on the ones that are still in the free expansion phase. In the calculation, we model the temporal evolution of the free-expanding PWNe and consider the transport of protons inside the PWNe. The Crab nebula is treated as a standard template for young PWNe to evaluate some model parameters, such as the energy conversion fraction of relativistic protons and the target gas density for the hadronic process, which are relevant to neutrino production. In the optimistic case, the neutrino flux from the simulated young PWNe may constitute to 5% of the measured flux by IceCube around 100 TeV. At higher energy around 1 PeV, the neutrino emission from the population highly depends on the injection spectral shape, and also on the emission of the nearby prominent sources.\n\n", "2501.08876": "2025-01-15, **Diffuse Supernova Neutrino Background**, Andrew D. Santos et.al., [2501.08876v1](http://arxiv.org/abs/2501.08876v1)\n\n The Diffuse Supernova Neutrino Background (DSNB) is the collection of neutrinos from all core-collapse supernovae (CCSNe) since the beginning of the universe. It is sensitive to the universe's stellar formation history, the fraction of CCSNe forming black holes, and cosmological expansion. To this date, it has yet to be detected. The most sensitive experimental search is from the Super-Kamiokande experiment, and the next few years will see other sensitive experiments like Hyper-Kamiokande and the Jiangmen Underground Neutrino Observatory come online. Here, we summarize the latest results and sensitivity for the DSNB search as well as its potential to probe new physics.\n\n", "2501.08741": "2025-01-15, **Are there critical aspects in the time, energy and angular distributions of SN1987A?**, Veronica Oliviero et.al., [2501.08741v1](http://arxiv.org/abs/2501.08741v1)\n\n Supernova neutrinos are of considerable importance for ongoing research in astrophysics, nuclear and particle physics. Existing simulations of this complex event are increasingly sophisticated, but the accuracy with which they describe the emission is unknown. The only event observed so far with neutrino telescopes, SN1987A, still plays a crucial role and deserves to be studied meticulously. With this in mind, we have undertaken a refined analysis of the observations, taking into account the knowledge gained over the past decades. In this work, we consider a new parameterised model of electron antineutrino emission and test its adequacy in describing the observed distributions of energy, time and angle. The values of the model parameters derived from the data and their uncertainty intervals are presented and their significance is discussed.\n\n", "2501.08734": "2025-01-15, **Background reduction in $^{136}$Xe double beta decay experiments through direct barium ion detection**, Álvaro Peralta Conde et.al., [2501.08734v1](http://arxiv.org/abs/2501.08734v1)\n\n Tagging barium ions in double beta decay experiments involving $^{136}$Xe offers a promising pathway to achieving an almost background-free environment, which is essential for addressing key unresolved questions in neutrino physics, such as the nature of neutrinos and their mass hierarchy. In this manuscript, we present a novel detection scheme that relies exclusively on the intrinsic energy levels of the barium ion. This method eliminates the need for additional additives in the xenon vessel, thereby simplifying the experimental setup and enhancing the potential sensitivity of the experiment.\n\n", "2501.08725": "2025-01-15, **2p-2h Cross-Section Systematics in DUNE**, Lars Bathe-Peters et.al., [2501.08725v1](http://arxiv.org/abs/2501.08725v1)\n\n For the operation of precision neutrino experiments, the understanding of neutrino interactions with matter is a preconditioned requirement for all detections and measurements of neutrinos. The largest uncertainties in estimating neutrino-nucleus interaction cross sections arise from the incomplete understanding of nuclear effects. In the study of neutrino oscillations and nuclear scattering processes, obtaining an interaction model with associated uncertainties is of substantial interest for the neutrino physics community. This report presents studies of simulated CC 2p-2h interactions, in which a neutrino interacts with a bound pair of nucleons. This interaction mode is very poorly constrained by current data. A comparison of three leading CC 2p-2h models is presented, along with a number of uncertainty parameters that have been implemented to account for model-to-model discrepancies in the DUNE oscillation analysis.\n\n", "2501.08711": "2025-01-15, **Scotoseesaw mechanism from a $Z_3$ symmetry of matter**, Doan Minh Luong et.al., [2501.08711v1](http://arxiv.org/abs/2501.08711v1)\n\n We show that the neutrino mass generation and the dark matter stability can be governed by the center of the QCD group, which is a $Z\\_3$ group. Three right-handed neutrinos $N\\_{1,2,3R}$ transform under $Z\\_3$ as $1,w,w^2$, where $w=e^{i2\\pi/3}$ is the cube root of unity, and they couple to usual lepton doublets via the usual Higgs doublet $H$ and two new scalar doublets $\\eta,\\chi$, which transform under $Z\\_3$ as $1,w^2,w$, respectively. This leads to a scotoseesaw mechanism in which the seesaw and scotogenic neutrino mass generations are induced by the Majorana $N\\_{1R}$ mass and the Dirac $N\\_{2,3R}$ mass, respectively. Although the lightest of the $Z\\_3$ fields is stabilized, responsible for dark matter, the model lacks an explanation for relic density and/or direct detection. The issue can be solved in a $U(1)\\_{B-L}$ gauge completion of the model, for which the center of the QCD group is isomorphic to $Z\\_3=\\{1,T,T^2\\}$ for $T=w^{3(B-L)}$.\n\n"}, "dark matter": {"2501.08930": "2025-01-15, **Searches for ultralight vector and axion dark matter with KAGRA**, Yuta Michimura et.al., [2501.08930v2](http://arxiv.org/abs/2501.08930v2)\n\n We have proposed using laser interferometric gravitational wave detectors to search for ultralight vector and axion dark matter. Vector dark matter can be probed through oscillating forces on suspended mirrors, while axion dark matter can be detected via oscillating polarization rotation of laser beams. This paper reviews these searches with the KAGRA detector in Japan, including the first vector dark matter search with KAGRA's 2020 data and installation of polarization optics for axion dark matter search during the upcoming 2025 observing run.\n\n", "2501.08915": "2025-01-15, **The case for a low dark matter density in dynamical dark energy model from local probes**, Ziad Sakr et.al., [2501.08915v1](http://arxiv.org/abs/2501.08915v1)\n\n In this work we investigate, through a Bayesian study, the ability of a local low matter density $\\Omega\\_{\\rm M}$, in discrepancy with the value usually inferred from the CMB angular power spectrum, to accommodate observations from local probes without being in tension with the local values of the Hubble constant $H\\_0$ or the matter fluctuation $\\sigma\\_8$ parameters. For that, we combine multiple local probes, with the criteria that they either can constrain the matter density parameter independently from the CMB constraints, or can help in doing so after making their relevant observations more model independent by relaxing their relevant calibration parameters. We assume however, either a dynamical dark energy model, or the standard $\\Lambda$CDM model, when computing the corresponding theoretical observables. We also add, in almost all of our Monte Carlo runs, the latest Baryonic acoustic oscillations (BAO) measurements from the DESI year one release to our core group. We found that, within $\\Lambda$CDM model, for different combinations of our probes, we can accommodate a low matter density along with the $H\\_0$ and $\\sigma\\_8$ values usually obtained from local probes, providing we promote the sound drag $r\\_s$ component in BAO calculations to a free parameter, and that even if we combine with the Pantheon+ Supernova sample. Assuming $w\\_0w\\_a$CDM, we also found that relaxing $r\\_s$ allow us to accommodate $\\Omega\\_{\\rm M}$, $H\\_0$ and $\\sigma\\_8$ within their local values, with still however a preference for $w\\_0w\\_a$ values far from $\\Lambda$CDM. However, when including Pantheon+ Supernova sample, we found that the latter preference for high matter density pushes $\\sigma\\_8$ to much smaller values, mitigating by then a low matter density solution to the two common tensions. We conclude that a low matter density value, helps in preserving the concordance within $\\Lambda$CDM model. (abridged)\n\n", "2501.08675": "2025-01-15, **Magnon cat states in a cavity-magnon-qubit system via two-magnon driving and dissipation**, Gang Liu et.al., [2501.08675v1](http://arxiv.org/abs/2501.08675v1)\n\n We propose an efficient method for dissipative generation of magnonic cat states in a cavity-magnon-qubit hybrid system by exploiting a two-magnon driving and dissipation mechanism. When both the magnon and qubit are driven, a coherent nonlinear two-magnon interaction is induced, wherein the qubit and the magnon mode exchange energy through magnon pairs. The dissipation of the qubit is exploited to steer the magnon mode into a quantum superposition of distinct coherent states, where the magnon mode evolves into either an even or odd cat state, depending on the parity of the magnon initial state. For the case where the magnon initial state is a superposition state, e.g., of $\\|0\\rangle$ and $\\|1\\rangle$, the magnon mode can evolve into a weighted mixture of the even and odd cat states. We also find that magnon squeezed states may emerge during the short-time evolution, showcasing the capability of our mechanism in preparing diverse magnon non-classical states. Magnonic cat and squeezed states are macroscopic quantum states and find applications in macroscopic quantum studies and quantum sensing, e.g., in the dark matter search using ferromagnetic axion haloscopes.\n\n", "2501.08622": "2025-01-15, **Prospects of $Z'$ Portal Dark Matter in $U(1)_{L_μ-L_τ}$**, Zhen-Wei Wang et.al., [2501.08622v1](http://arxiv.org/abs/2501.08622v1)\n\n The gauged $U(1)\\_{L\\_\\mu-L\\_\\tau}$ model is well-motivated to explain the muon $g-2$ anomaly and dark matter in previous studies. However, the latest NA64$\\mu$ experiment has almost excluded all the parameter space for the muon $g-2$, which indicates that the light dark matter benchmark scenarios interpreting muon $g-2$ in previous studies are also not allowed at present. In light of many recent and future experimental results, we revisit the minimal $Z'$ portal dark matter in $U(1)\\_{L\\_\\mu-L\\_\\tau}$. Focus on the phenomenology of dark matter $\\chi$, we first explore the viable parameter space for the light dark matter under various tight constraints. Around the $Z'$ resonance, we find that there is still a large parameter space for $m\\_\\chi\\gtrsim10$ MeV via thermal freeze-out. On the other hand, the constraints on $Z'$ above the electroweak scale are quite loose but are less studied for dark matter. We also investigate the heavy dark matter around the TeV scale and corresponding constraints. A large part of the parameter space for dark matter is within the reach of future experiments.\n\n", "2501.08524": "2025-01-15, **Deep inference of simulated strong lenses in ground-based surveys**, Jason Poh et.al., [2501.08524v1](http://arxiv.org/abs/2501.08524v1)\n\n The large number of strong lenses discoverable in future astronomical surveys will likely enhance the value of strong gravitational lensing as a cosmic probe of dark energy and dark matter. However, leveraging the increased statistical power of such large samples will require further development of automated lens modeling techniques. We show that deep learning and simulation-based inference (SBI) methods produce informative and reliable estimates of parameter posteriors for strong lensing systems in ground-based surveys. We present the examination and comparison of two approaches to lens parameter estimation for strong galaxy-galaxy lenses -- Neural Posterior Estimation (NPE) and Bayesian Neural Networks (BNNs). We perform inference on 1-, 5-, and 12-parameter lens models for ground-based imaging data that mimics the Dark Energy Survey (DES). We find that NPE outperforms BNNs, producing posterior distributions that are more accurate, precise, and well-calibrated for most parameters. For the 12-parameter NPE model, the calibration is consistently within $<$10\\% of optimal calibration for all parameters, while the BNN is rarely within 20\\% of optimal calibration for any of the parameters. Similarly, residuals for most of the parameters are smaller (by up to an order of magnitude) with the NPE model than the BNN model. This work takes important steps in the systematic comparison of methods for different levels of model complexity.\n\n"}, "supernova": {"2501.08969": "2025-01-15, **Properties of high-redshift Type II supernovae discovered by the JADES transient survey**, Takashi J. Moriya et.al., [2501.08969v1](http://arxiv.org/abs/2501.08969v1)\n\n In this work we estimate the explosion and progenitor properties of six Type II supernovae (SNe) at 0.675 <= z <= 3.61 discovered by the JWST Advanced Deep Extragalactic Survey (JADES) transient survey by modeling their light curves. This high-redshift Type II SN sample allows us to compare low-redshift Type II SNe to their high-redshift counterparts. Two Type II SNe are found to have high explosion energies of 3e51 erg, while the other four Type II SNe are estimated to have typical explosion energies found in the local Universe [(0.5-2)e51 erg]. The fraction of Type II SNe with high explosion energies might be higher at high redshifts because of, e.g., lower metallicity, but it is still difficult to draw a firm conclusion because of the small sample size and potential observational biases. We found it difficult to constrain the progenitor masses for Type II SNe in our sample because of the sparse light-curve data. We found two Type II SN light curves can be better reproduced by introducing confined, dense circumstellar matter. Thus, the confined, dense circumstellar matter frequently observed in nearby Type II SNe is likely to exist in Type II SNe at high redshifts as well. Two Type II SNe are estimated to have high host galaxy extinctions, showing the ability of JWST to discover dust-obscured SNe at high redshifts. More high-redshift Type II SNe are required to investigate the differences in the properties of Type II SNe near and far, but here we show the first glimpse into the high-redshift population of Type II SNe.\n\n", "2501.08915": "2025-01-15, **The case for a low dark matter density in dynamical dark energy model from local probes**, Ziad Sakr et.al., [2501.08915v1](http://arxiv.org/abs/2501.08915v1)\n\n In this work we investigate, through a Bayesian study, the ability of a local low matter density $\\Omega\\_{\\rm M}$, in discrepancy with the value usually inferred from the CMB angular power spectrum, to accommodate observations from local probes without being in tension with the local values of the Hubble constant $H\\_0$ or the matter fluctuation $\\sigma\\_8$ parameters. For that, we combine multiple local probes, with the criteria that they either can constrain the matter density parameter independently from the CMB constraints, or can help in doing so after making their relevant observations more model independent by relaxing their relevant calibration parameters. We assume however, either a dynamical dark energy model, or the standard $\\Lambda$CDM model, when computing the corresponding theoretical observables. We also add, in almost all of our Monte Carlo runs, the latest Baryonic acoustic oscillations (BAO) measurements from the DESI year one release to our core group. We found that, within $\\Lambda$CDM model, for different combinations of our probes, we can accommodate a low matter density along with the $H\\_0$ and $\\sigma\\_8$ values usually obtained from local probes, providing we promote the sound drag $r\\_s$ component in BAO calculations to a free parameter, and that even if we combine with the Pantheon+ Supernova sample. Assuming $w\\_0w\\_a$CDM, we also found that relaxing $r\\_s$ allow us to accommodate $\\Omega\\_{\\rm M}$, $H\\_0$ and $\\sigma\\_8$ within their local values, with still however a preference for $w\\_0w\\_a$ values far from $\\Lambda$CDM. However, when including Pantheon+ Supernova sample, we found that the latter preference for high matter density pushes $\\sigma\\_8$ to much smaller values, mitigating by then a low matter density solution to the two common tensions. We conclude that a low matter density value, helps in preserving the concordance within $\\Lambda$CDM model. (abridged)\n\n", "2501.08666": "2025-01-15, **Exploring the Viability of $f(Q, T)$ Gravity: Constraining Parameters with Cosmological Observations**, Rahul Bhagat et.al., [2501.08666v1](http://arxiv.org/abs/2501.08666v1)\n\n In this paper, we explore the model of $ f(Q, T) $ gravity, an extension of symmetric teleparallel gravity where the nonmetricity scalar $ Q $ is non-minimally coupled to the trace of the energy-momentum tensor $ T $. The model is developed as an alternative to the standard $\\Lambda$CDM cosmological model and is analyzed using a cosmic chronometer and Pantheon$^+$ supernovae data sets. Through Markov Chain Monte Carlo analysis, we constrain the model parameters $ \\alpha $, $ \\beta $, and $ H\\_0 $, and compare the performance of the model with $\\Lambda$CDM by evaluating statistical measures such as chi-square, Akaike information criterion, and Bayesian information criterion. The results show that the $ f(Q, T) $ model effectively mimics $\\Lambda$CDM while offering an alternative explanation based on modified gravity. We also examine cosmographic parameters like the deceleration parameter, confirming the transition of the Universe from deceleration to acceleration, and the violation of the strong energy condition, which aligns with observed late-time cosmic acceleration. Additionally, the model provides age estimates for the Universe that are consistent with current observations.\n\n"}}