{"neutrino": {"2405.05247": "2024-05-08, **Neutrinos and gamma rays from beta decays in an active galactic nucleus NGC 1068 jet**, Koichiro Yasuda et.al., [2405.05247v1](http://arxiv.org/abs/2405.05247v1)\n\n We show that TeV neutrinos detected from the nearby active galaxy NGC 1068 can be explained by the beta decays of neutrons produced in photodisintegration of nuclei on ultraviolet photons in the jet. The photodisintergation of nuclei occurs at energies above a few PeV, which explains the 1-100 TeV energies of the observed neutrinos. The gamma-ray flux accompanying the beta decays is expected to be much lower than the neutrino flux, and it agrees well with the gamma-ray observations of NGC 1068. This scenario can be applicable to other jetted Seyfert galaxies such as NGC 4151. The flavor ratio studies could be a test of this beta decay jet scenario for gamma-ray deficit neutrino sources.\n\n", "2405.05212": "2024-05-08, **The Ghent Hybrid Model in NuWro: a new neutrino single-pion production model in the GeV regime**, Qiyu Yan et.al., [2405.05212v1](http://arxiv.org/abs/2405.05212v1)\n\n Neutrino-induced single-pion production constitutes an essential interaction channel in modern neutrino oscillation experiments, with its products building up a significant fraction of the observable hadronic final states. Frameworks of oscillation analyses strongly rely on Monte Carlo neutrino event generators, which provide theoretical predictions of neutrino interactions on nuclear targets. Thus, it is crucial to integrate state-of-the-art single-pion production models with Monte Carlo simulations to prepare for the upcoming systematics-dominated landscape of neutrino measurements. In this work, we present the implementation of the Ghent Hybrid model for neutrino-induced single-pion production in the NuWro Monte Carlo event generator. The interaction dynamics includes coherently-added contributions from nucleon resonances and a non-resonant background, merged into the pythia branching predictions in the deep-inelastic regime, as instrumented by NuWro. This neutrino-nucleon interaction model is fully incorporated into the nuclear framework of the generator, allowing it to account for the influence of both initial- and final-state nuclear medium effects. We compare the predictions of this integrated implementation with recent pion production data from accelerator-based neutrino experiments. The results of the novel model show improved agreement of the generator predictions with the data and point to the significance of the refined treatment of the description of pion-production processes beyond the $\\Delta$ region.\n\n", "2405.05000": "2024-05-08, **Neutrino Oscillations as a Gravitational Wave Detector?**, Dominik Hellmann et.al., [2405.05000v1](http://arxiv.org/abs/2405.05000v1)\n\n Gravitational Waves (GWs) can alter the neutrino propagation distance and thus affect neutrino oscillations. This can result in a complete disappearance of the oscillatory behavior that competes with other sources of neutrino decoherence. We develop a set of criteria that determines under which conditions neutrino oscillations are sensitive to this effect, and discuss three concrete scenarios for neutrinos from astrophysical sources. We find that neutrino oscillations may probe so far unexplored regions of the GW parameter space.\n\n", "2405.04986": "2024-05-08, **Constraining the core radius and density jumps inside Earth using atmospheric neutrino oscillations**, Anuj Kumar Upadhyay et.al., [2405.04986v1](http://arxiv.org/abs/2405.04986v1)\n\n Atmospheric neutrinos can act as a tool to probe the interior of Earth using weak interactions, and can provide information complementary to that obtained from gravitational and seismic measurements. While passing through Earth, multi-GeV neutrinos encounter Earth matter effects due to the coherent forward scattering with the ambient electrons, which alter the neutrino oscillation probabilities. These matter effects depend upon the density distribution of electrons inside Earth, and hence, can be used to determine the internal structure of Earth. In this work, we employ a five-layered model of Earth where the layer densities and radii are modified, keeping the mass and moment of inertia of Earth unchanged and respecting the hydrostatic equilibrium condition. We use the proposed INO-ICAL detector as an example of an atmospheric neutrino experiment that can distinguish between neutrinos and antineutrinos efficiently in the multi-GeV energy range. Our analysis demonstrates the role such an experiment can play in simultaneously constraining the density jumps inside Earth and the location of the core-mantle boundary.\n\n", "2405.04978": "2024-05-08, **Formal Theory of Heavy Ion Double Charge Exchange Reactions**, Horst Lenske et.al., [2405.04978v1](http://arxiv.org/abs/2405.04978v1)\n\n The theory of heavy ion double charge exchange (DCE) reactions $A(Z,N)\\to A(Z\\pm 2,N\\mp 2)$ is recapitulated emphasizing the role of Double Single Charge Exchange (DSCE) and pion-nucleon Majorana DCE (MDCE) reactions. DSCE reactions are of second--order distorted wave character, mediated by isovector nucleon-nucleon (NN) interactions. The DSCE response functions resemble the nuclear matrix elements (NME) of $2\\nu 2\\beta$ decay. The MDCE process proceeds by a dynamically generated effective rank-2 isotensor interaction, defined by off--shell pion--nucleon DCE scattering. In closure approximation pion potentials and two--nucleon correlations are obtained, similar to the neutrino potentials and the intranuclear exchange of Majorana neutrinos in $0\\nu 2 \\beta$ Majorana double beta decay (MDBD).\n\n", "2405.04659": "2024-05-07, **Gamma Ray Detection Efficiency of GAGG Crystal Scintillator Using Three Tagged Gamma Ray Techniques**, Brian Doty et.al., [2405.04659v1](http://arxiv.org/abs/2405.04659v1)\n\n A CubeSat with a prototype scintillating detector with a sensitive volume of GAGG crystal is being developed with a possible launch date of 2025. Its purpose is to characterize the background signals that mimic the neutrino interaction that the nuSOL team is looking for. An important part of the characterization of the backgrounds and the expected real signal is understanding the gamma ray detection efficiency of the prototype detector. To this end we have used and developed three techniques to do an absolute measurement of gamma ray efficiency. The first is using EC sources that emit an X-ray before prompt emission of a de-excitation gamma ray, specifically Zn-65 and Mn-54. The second is using a beta + decay source wherein a positron annihilates on an atomic shell electron producing two back-to-back 511 keV gammas followed promptly by a de-excitation gamma, specifically Na-22. The third is using a gamma cascade of two near-simultaneous de-excitation gammas from the same nucleus, specifically from Co-60 decay.\n\n", "2405.04651": "2024-05-07, **Artificial Broadcasts as Galactic Populations: II. Comparing Individualist and Collective Bounds on Broadcast Populations in Single Galaxies**, Brian C. Lacki et.al., [2405.04651v1](http://arxiv.org/abs/2405.04651v1)\n\n The search for extraterrestrial intelligence includes efforts to constrain populations of artificial broadcasts in other galaxies. Previous efforts use individualist methods, searching for single broadcasts with high signal-to-noise ratio. These would be detected as observables with extreme values. This approach is limited to very bright broadcasts and also is subject to confusion, where a large number of broadcasts blend together to form a noise continuum. The mean value of the total emission provides an additional collective bound: the luminosity of the transmitters is no higher than the galaxy's observed luminosity. Using the framework developed in Paper I, I evaluate how confusion affects individualist searches. I then compare individualist and collective approaches for radio broadcasts from the Milky Way, M31, and three Virgo Cluster elliptical galaxies. For current observations, confusion blurs narrowband radio broadcasts together in the Virgo ellipticals when there is one broadcast per gigahertz per 1000 stars. The collective bound implies fewer than $\\sim 10^6 (\\overline{\\ell}/10^{13} W)^{-1}$ L-band broadcasts per star gigahertz GHz in the Milky Way and is about 10 and 400 times stronger in M31 and M59, respectively. Applying the collective bound to the far-infrared--radio correlation yields constraints on radio broadcast populations in star-forming galaxies throughout the Universe. The collective bound allows us to rule out large regions of broadcast population parameter space even for distant galaxies. It also imposes constraints on gamma-ray, neutrino, and gravitational-wave broadcasts in the nearest galaxies.\n\n", "2405.04568": "2024-05-07, **Relic Neutrino Background from Cosmic-Ray Reservoirs**, Andrea Giovanni De Marchi et.al., [2405.04568v1](http://arxiv.org/abs/2405.04568v1)\n\n We compute the flux of relic neutrino background (R$\\nu$B) up-scattered by ultra-high-energy (UHE) cosmic rays (CRs) in clusters that act as CR-reservoirs. The long trapping times of UHECRs make this flux larger than that of R$\\nu$B up-scattered by UHECRs on their way to Earth, which we also compute. We find that IceCube excludes R$\\nu$B weighted overdensities larger than $10^{10}$ in clusters, and that PUEO, RNO-G, GRAND and IceCube-Gen2 will test values down to $10^{8}$. Our treatment incorporates the momentum transfer dependence of the neutrino-nucleus cross section, deep inelastic scattering, a mixed UHECR composition, and flavour information on the up-scattered R$\\nu$B fluxes for both cases of neutrino mass spectrum with normal and inverted ordering, providing new handles to possibly disentangle the up-scattered R$\\nu$B from cosmogenic neutrinos.\n\n", "2405.04427": "2024-05-07, **Landscape, Swampland, and Extra Dimensions**, Luis Anchordoqui et.al., [2405.04427v1](http://arxiv.org/abs/2405.04427v1)\n\n By combining swampland conjectures with observational data, it was recently suggested that the cosmological hierarchy problem (i.e. the smallness of the dark energy in Planck units) could be understood as an asymptotic limit in field space, corresponding to a decompactification of one extra (dark) dimension of a size in the micron range. In these Proceedings we examine the fundamental setting of this framework and discuss general aspects of the effective low energy theory inherited from properties of the overarching string theory. We then explore some novel phenomenology encompassing the dark dimension by looking at potential dark matter candidates, decoding neutrino masses, and digging into new cosmological phenomena.\n\n", "2405.04176": "2024-05-07, **Constraining the mass-spectra in the presence of a light sterile neutrino from absolute mass-related observables**, Srubabati Goswami et.al., [2405.04176v1](http://arxiv.org/abs/2405.04176v1)\n\n The framework of three-flavor neutrino oscillation is a well-established phenomenon, but results from the short-baseline experiments, such as the Liquid Scintillator Neutrino Detector (LSND) and MiniBooster Neutrino Experiment (MiniBooNE), hint at the potential existence of an additional light neutrino state characterized by a mass-squared difference of approximately $1\\,\\rm eV^2$. The new neutrino state is devoid of all Standard Model (SM) interactions, commonly referred to as a 'sterile' state. In addition, a sterile neutrino with a mass-squared difference of $10^{-2}$ $\\rm eV^2$ has been proposed to improve the tension between the results obtained from the Tokai to Kamioka (T2K) and the NuMI Off-axis $\\nu\\_e$ Appearance (NO$\\nu$A) experiments. Further, the non-observation of the predicted upturn in the solar neutrino spectra below 8 MeV can be explained by postulating an extra light sterile neutrino state with a mass-squared difference around $10^{-5} \\rm eV^2$. The hypothesis of an additional light sterile neutrino state introduces four distinct mass spectra depending on the sign of the mass-squared difference. In this paper, we discuss the implications of the above scenarios on the observables that depend on the absolute mass of the neutrinos, namely the sum of the light neutrino masses $(\\Sigma)$ from cosmology, the effective mass of the electron neutrino from beta decay $(m\\_{\\beta})$, and the effective Majorana mass $( m\\_{\\beta\\beta})$ from neutrinoless double beta decay. We show that some scenarios can be disfavored by the current constraints of the above variables. The implications for projected sensitivity of Karlsruhe Tritium Neutrino Experiment (KATRIN) and future experiments like Project-8, next Enriched Xenon Observatory (nEXO) have been discussed.\n\n", "2405.03996": "2024-05-07, **Finite modular majoron**, Tae Hyun Jung et.al., [2405.03996v1](http://arxiv.org/abs/2405.03996v1)\n\n We point out that the accidental $U(1)\\_{B-L}$ symmetry can arise from a finite modular symmetry $\\Gamma\\_N$ in the type-I seesaw. The finite modular symmetry is spontaneously broken in such a way that the residual $\\mathbb{Z}^T\\_N$ discrete symmetry, associated with the $T$-transformation which shifts the modulus $\\tau \\to \\tau+ 1$, remains unbroken. This discrete $\\mathbb{Z}^T\\_N$ symmetry mimics $U(1)\\_{B-L}$, and hence the majoron appears as a pseudo Nambu-Goldstone boson of $U(1)\\_{B-L}$. Without introducing additional interactions, the modulus $\\tau$ can be stabilized by the Coleman-Weinberg (CW) potential given by the Majorana mass terms of the right-handed neutrinos. We study cosmological implications of the majoron, with particular interests in the dark matter and dark radiation, where the latter may alleviate the Hubble tension. We also find that the CW potential can have a wide range of nearly exponential shape which prevents $\\tau$ from overshooting, and makes the amount of dark radiation not too large.\n\n", "2405.03954": "2024-05-07, **Collapse of Neutrino Wave Functions under Penrose Gravitational Reduction**, B. J. P. Jones et.al., [2405.03954v1](http://arxiv.org/abs/2405.03954v1)\n\n Models of spontaneous wave function collapse have been postulated to address the measurement problem in quantum mechanics. Their primary function is to convert coherent quantum superpositions into incoherent ones, with the result that macroscopic objects cannot be placed into widely separated superpositions for observably prolonged times. Many of these processes will also lead to loss of coherence in neutrino oscillations, producing observable signatures in the flavor profile of neutrinos at long travel distances. The majority of studies of neutrino oscillation coherence to date have focused on variants of the continuous state localization model, whereby an effective decoherence strength parameter is used to model the rate of coherence loss with an assumed energy dependence. Another class of collapse models that have been proposed posit connections to the configuration of gravitational field accompanying the mass distribution associated with each wave function that is in the superposition. A particularly interesting and prescriptive model is Penrose's description of gravitational collapse which proposes a decoherence time $\\tau$ determined through $E\\_{g}\\tau\\sim\\hbar$, where $E\\_{g}$ is a calculable function of the Newtonian gravitational potential. Here we explore application of the Penrose collapse model to neutrino oscillations, reinterpreting previous experimental limits on neutrino decoherence in terms of this model. We identify effects associated with both spatial collapse and momentum diffusion, finding that the latter is ruled out in data from the IceCube South Pole Neutrino Observatory so long as the neutrino wave packet width at production is $\\sigma\\_{\\nu,x}\\leq2\\times10^{-12}$ m.\n\n", "2405.03940": "2024-05-07, **Remark on neutrino oscillations**, Kazuo Fujikawa et.al., [2405.03940v1](http://arxiv.org/abs/2405.03940v1)\n\n The oscillations of ultra-relativistic neutrinos are realized by the propagation of assumed zero-mass on-shell neutrinos with the speed of light in vacuum combined with the phase modulation by the small mass term $\\exp[-i(m^{2}\\_{\\nu\\_{k}}/2\\|\\vec{p}\\|)\\tau]$ with a time parameter $\\tau$. This picture is realized in the first quantization by the mass expansion and in field theory by the use of $\\delta(x^{0}-y^{0}-\\tau) \\langle 0\\|T^{\\star}\\nu\\_{L k}(x)\\overline{\\nu\\_{L k}(y)}\\|0\\rangle$ with the neutrino mass eigenstates $\\nu\\_{L k}$ and a finite positive $\\tau$ after the contour integral of the propagating neutrino energies.   By noting that the conventional detectors are insensitive to neutrino masses, the measured energy-momenta of the initial and final states with assumed zero-mass neutrinos are conserved. The propagating neutrinos preserve the three-momentum in this sense but the energies of the massive neutrinos are conserved up to uncertainty relations and thus leading to oscillations. Conceptual complications in the case of Majorana neutrinos due to the charge conjugation in $d=4$ are also discussed.\n\n"}, "dark matter": {"2405.05255": "2024-05-08, **Diffusion-HMC: Parameter Inference with Diffusion Model driven Hamiltonian Monte Carlo**, Nayantara Mudur et.al., [2405.05255v1](http://arxiv.org/abs/2405.05255v1)\n\n Diffusion generative models have excelled at diverse image generation and reconstruction tasks across fields. A less explored avenue is their application to discriminative tasks involving regression or classification problems. The cornerstone of modern cosmology is the ability to generate predictions for observed astrophysical fields from theory and constrain physical models from observations using these predictions. This work uses a single diffusion generative model to address these interlinked objectives -- as a surrogate model or emulator for cold dark matter density fields conditional on input cosmological parameters, and as a parameter inference model that solves the inverse problem of constraining the cosmological parameters of an input field. The model is able to emulate fields with summary statistics consistent with those of the simulated target distribution. We then leverage the approximate likelihood of the diffusion generative model to derive tight constraints on cosmology by using the Hamiltonian Monte Carlo method to sample the posterior on cosmological parameters for a given test image. Finally, we demonstrate that this parameter inference approach is more robust to the addition of noise than baseline parameter inference networks.\n\n", "2405.05087": "2024-05-08, **Electroweak Multiplets as Dark Matter candidates: A brief review**, Paolo Panci et.al., [2405.05087v1](http://arxiv.org/abs/2405.05087v1)\n\n I provide a thorough review of the theoretical and experimental status of ElectroWeak multiplets as Dark Matter candidates, serving as the prototype of Weakly Interacting Massive Particles (WIMPs) Dark Matter. Specifically, the examination includes both real SU(2) representations with zero hypercharge and complex ones with $Y\\neq 0$. For the first time, all calculable thermal masses for scalar and fermionic WIMPs are computed, incorporating significant non-perturbative non-relativistic effects such as Sommerfeld enhancement and the formation of WIMP bound states. WIMP masses of few hundred TeV are shown to be compatible both with $s$-wave unitarity of the annihilation cross-section, and perturbativity. Additionally, a strategy is outlined for probing these scenarios in the next generation of experiments.\n\n", "2405.04933": "2024-05-08, **The Importance of Being Symmetric: Flat Rotation Curves from Exact Axisymmetric Static Vacuum Spacetimes**, Antonia Seifert et.al., [2405.04933v1](http://arxiv.org/abs/2405.04933v1)\n\n Starting from the vacuum Einstein Field Equations and a static axisymmetric ansatz, we find two new solutions describing an axisymmetric static vacuum spacetime with cylindrical symmetry: One of this exhibits an additional symmetry in $z$-direction and the other has $z$-coordinate dependent coefficients. In analogy to the Schwarzschild solution, these metrics describe a static vacuum spacetime and apply in similar settings except for the changed symmetry conditions. Analyzing the low-velocity limit corresponding to the Newtonian approximation of the Schwarzschild metric, we find an effective logarithmic potential. This yields flat rotation curves for test particles undergoing rotational motion within the spacetime described by the line elements, in contrast to Newtonian rotation curves. This analysis highlights how important the symmetry assumptions are for deriving general relativistic solutions.   One example of physical objects that are generally described in the static vacuum low-velocity limit (reducing to Newtonian gravity in the spherically symmetric case) and exhibit axial symmetry are disk galaxies. We show that symmetries and appropriate line elements that respect them are crucial to consider in such settings. In particular, the solutions presented here result in flat rotation curves without any need for dark matter. While these exact solutions are limited to static vacuum spacetimes, their application to physical galaxies relies on appropriate approximations. Nonetheless, they offer valuable insights into explanations for flat rotation curves in galaxies and their implications for dark matter.\n\n", "2405.04924": "2024-05-08, **Comparison of two different integration methods for the (1+1)-Dimensional Schroödinger-Poisson Equation**, Nico Schwersenz et.al., [2405.04924v1](http://arxiv.org/abs/2405.04924v1)\n\n We compare two different numerical methods to integrate in time spatially delocalized initial densities using the Schr\\\"odinger-Poisson equation system as the evolution law. The basic equation is a nonlinear Schr\\\"odinger equation with an auto-gravitating potential created by the wave function density itself. The latter is determined as a solution of Poisson's equation modelling, e.g., non-relativistic gravity. For reasons of complexity, we treat a one-dimensional version of the problem whose numerical integration is still challenging because of the extreme long-range forces (being constant in the asymptotic limit). Both of our methods, a Strang splitting scheme and a basis function approach using B-splines, are compared in numerical convergence and effectivity. Overall, our Strang-splitting evolution compares favourably with the B-spline method. In particular, by using an adaptive time-stepper rather large one-dimensional boxes can be treated. These results give hope for extensions to two spatial dimensions for not too small boxes and large evolution times necessary for describing, for instance, dark matter formation over cosmologically relevant scales.\n\n", "2405.04886": "2024-05-08, **Investigating the accelerated expansion of the Universe through updated constraints on viable $f(R)$ models within the Palatini formalism**, Kumar Ravi et.al., [2405.04886v1](http://arxiv.org/abs/2405.04886v1)\n\n The observed accelerated expansion of the Universe at present epoch can be explained by some of the $f(R)$ models without invoking the existence of dark energy or any other such exotic component in cosmic fluid. The $f(R)$ models in Palatini formalism is relatively less explored in recent times with respect to their counterpart in metric formalism. We study seven $f(R)$ models in Palatini formalism: Hu-Sawicki (two cases), Starobinsky, exponential, Tsujikawa, $f(R) = R -\\beta /R^ n$, and $f(R)= R + \\alpha \\ln(R) - \\beta$. Following standard statistical procedure and utilizing data sets: type Ia supernovae data, cosmic chronometer observations, baryonic acoustic oscillations data, data from H \\textsc{ii} starburst galaxies, local measurements of the \\emph{Hubble} parameter ($H\\_{0}$), and distance priors of cosmic microwave background radiation data, we obtain constraints on the model parameters. When compared with the standard `lambda-cold dark matter model', for many data set combinations, the support for $f(R)$ models is significant. We obtain the relevant quantities for characterizing the accelerated expansion of the Universe, and these quantities are consistent with those obtained in a model-independent way by others. The curve of effective/total equation-of-state parameter, obtained from parameter constraints, clearly shows correct phases of the expansion history: the radiation-dominated epochs and the matter-dominated epochs, of the past, and the current accelerated expansion epoch eventually evolving to de-Sitter phase in the distant future. Overall, our results advocate in favour of pursuing $f(R)$ models in Palatini formalism as a potential alternative for explaining accelerated expansion of the Universe.\n\n", "2405.04856": "2024-05-08, **Effect of dark matter interaction on hybrid star in the light of the recent astrophysical observations**, Suman Pal et.al., [2405.04856v1](http://arxiv.org/abs/2405.04856v1)\n\n We have explored the effect of dark matter interaction on hybrid star (HS) in the light of recent astrophysical observational constraints. The presence of dark matter is assumed to be there in both the hadron as well as the quark sector. The dark matter particle interacts with both hadron and quark matter through the exchange of a scalar as well as a vector meson. The equation of state (EOS) of the hadron part is computed using the NL3 version of the relativistic mean field(RMF) model, whereas the quark part is taken care of using the well-known MIT Bag model with the vector interaction. We investigate the effect of the dark matter density and the mass of the dark matter particle on various observables like mass, radius, tidal deformability of the dark matter admixed hybrid star(DMAHS). In this study, we have noted an intriguing aspect that is the speed of sound in the DMAHS is insensitive to both the mass as well as the density of dark matter. We also observe a striking similarity in the variation of transition mass and its corresponding radius, as well as the maximum mass of neutron stars, with dark matter density and mass. We employ observational constraints from neutron stars to narrow down the allowed range of the parameters of dark matter.\n\n", "2405.04855": "2024-05-08, **Revisiting general dark matter-bound-electron interactions**, Jin-Han Liang et.al., [2405.04855v1](http://arxiv.org/abs/2405.04855v1)\n\n In this letter we revisit general dark matter (DM)-bound-electron interactions studied previously in the influential work of [Catena et al., Phys. Rev. Res. 2, 033195 (2020)]. We derive the DM-electron response functions and find a crucial minus sign was missed for the second atomic response function $W\\_2$ defined in that work. The minus sign has significant phenomenological consequences when explaining experimental bounds on specific DM scenarios. Furthermore, for the most general DM-electron nonrelativistic or relativistic interactions for DM with spin up to one, we find there are three DM response functions ($a\\_{0,1,2}$) whose corresponding atomic response functions ($\\widetilde W\\_{0,1,2}$) are linear combinations of the four response functions ($W\\_{1,2,3,4}$) given in that work, $$ \\widetilde W\\_0 = W\\_1, \\, \\widetilde W\\_2 = \\|\\mathbf{v}\\_0^\\perp\\|^2 W\\_1+ W\\_3 - 2 {m\\_e\\, \\mathbf{q}\\cdot \\mathbf{v}\\_0^\\perp \\over \\mathbf{q}^2} W\\_2,\\, \\widetilde W\\_3 = { (\\mathbf{q}\\cdot \\mathbf{v}\\_0^\\perp)^2 \\over \\mathbf{q}^2} W\\_1 + {m\\_e^2 \\over \\mathbf{q}^2}W\\_4 - 2 {m\\_e\\, \\mathbf{q}\\cdot \\mathbf{v}\\_0^\\perp \\over \\mathbf{q}^2} W\\_2. $$ Due to the minus sign correction for $W\\_2$, there can be significant cancellations between the $W\\_2$ and $W\\_{3,4}$ terms, so that $\\widetilde W\\_{2,3}$ are dominated by the usual response function $W\\_1$ in some cases. Ignoring the sign could thus result in misinterpretation of the experimental data in some DM scenarios. As an example, we show that the recent XENON1T constraint on the fermionic DM anapole moment is weakened by a factor of 2 or so. Many DM scenarios involving DM or electron axial-vector current can yield $W\\_2$ and thus are potentially affected by the sign.\n\n", "2405.04833": "2024-05-08, **Thermal analysis of black hole in de Rham--Gabadadze--Tolley massive gravity in Barrow entropy framework**, Muhammad Yasir et.al., [2405.04833v1](http://arxiv.org/abs/2405.04833v1)\n\n This study examines a recently hypothesized black hole solution in de Rham--Gabadadze--Tolley massive gravity. Firstly, we consider the negative cosmological constant as a thermodynamic pressure. We extract the thermodynamical properties such as Hawking temperature, heat capacity and Gibbs free energy using the Barrow entropy. We also obtain a new pressure associated to the perfect fluid dark matter and discuss the first-order van der Waals-like phase transition. This black hole's stability is investigated through specific heat and Gibbs free energy. Also, we analyze the thermodynamic curvatures behavior of black hole through geometry methods (Weinhold, Ruppeiner, Hendi-Panahiyah-Eslam-Momennia (HPEM), and geometrothermodynamics (GTD)).\n\n", "2405.04784": "2024-05-08, **Lagrangian space remapping and the angular momentum reconstruction from cosmic structures**, Sijia Li et.al., [2405.04784v1](http://arxiv.org/abs/2405.04784v1)\n\n Large scale structure provides valuable information of the primordial perturbations that encode the secrets of the origin of the Universe. It is an essential step to map between observables and their initial coordinates, called Lagrangian space, from which primordial perturbations transfer their information to structures via linear theory. By using numerical simulations and state-of-the-art reconstruction techniques, we report the accuracy of estimating the Lagrangian coordinates of galaxies and galaxy clusters, represented by dark matter halos in various ranges of mass, and study the accuracy of this remapping on the angular momentum (spin) reconstruction. Our work shows that galaxy groups and clusters, represented by halos with mass $\\gtrsim 10^{13}M\\_\\odot$, can be accurately remapped to Lagrangian space, and their spin reconstruction errors are dominated by the reconstructed initial gravitational potential. For all mass ranges, the errors of Lagrangian remapping, as well as redshift space distortions, play subdominant roles in estimating their angular momenta. This study explains the low correlation level between observed galaxy spins and reconstructed cosmic initial conditions and illustrates the potential of using angular momenta of cosmic structures to improve the reconstruction of primordial perturbations.\n\n", "2405.04779": "2024-05-08, **Time Delay Anomalies of Fuzzy Gravitational Lenses**, Jianxiang Liu et.al., [2405.04779v1](http://arxiv.org/abs/2405.04779v1)\n\n Fuzzy dark matter is a promising alternative to the standard cold dark matter. It has quite recently been noticed, that they can not only successfully explain the large-scale structure in the Universe, but can also solve problems of position and flux anomalies in galaxy strong lensing systems. In this paper we focus on the perturbation of time delays in strong lensing systems caused by fuzzy dark matter, thus making an important extension of previous works. We select a specific system HS 0810+2554 for the study of time delay anomalies. Then, based on the nature of the fuzzy dark matter fluctuations, we obtain theoretical relationship between the magnitude of the perturbation caused by fuzzy dark matter, its content in the galaxy, and its de Broglie wavelength $\\lambda \\_{\\mathrm{dB}}$. It turns out that, the perturbation of strong lensing time delays due to fuzzy dark matter quantified as standard deviation is $\\sigma\\_{\\Delta t} \\propto \\lambda \\_{\\mathrm{dB}}^{1.5}$. We also verify our results through simulations. Relatively strong fuzzy dark matter fluctuations in a lensing galaxy make it possible to to destroy the topological structure of the lens system and change the arrival order between the saddle point and the minimum point in the time delays surface. Finally, we stress the unique opportunity for studying properties of fuzzy dark matter created by possible precise time delay measurements from strongly lensed transients like fast radio bursts, supernovae or gravitational wave signals.\n\n", "2405.04680": "2024-05-07, **Axi-Higgs portal Dark Matter via Wess-Zumino mechanism**, Akshay Anilkumar et.al., [2405.04680v1](http://arxiv.org/abs/2405.04680v1)\n\n We study the axion portal between the visible and the dark sector, where the Dark Matter is charged under a simple abelian extension of the Standard Model. In general, such models are anomalous and are rendered gauge invariant by a St\\\"ukelberg axion through Wess-Zumino/Green-Schwarz mechanism. This axion mixes with other Goldstone bosons in the model to give a physical axi-Higgs which becomes massive upon breaking the anomalous gauge group. Such axi-Higgs fields charged under the anomalous symmetry act as mediators for the Dark Matter annihilation to Standard Model particles and can lead to an efficient freeze-out mechanism. Here, we show that the St{\\\"u}kelberg axion and the resultant axi-Higgs, with its appropriate shift symmetry cancels the quantum anomalies and also generate the observed relic density for the Dark Matter. Moreover, we show that the relevant parameter space in our model, where photon production dominates, is safe from FermiLAT, Cherenkov Telescope Array, and H.E.S.S. indirect detection experiments.\n\n", "2405.04635": "2024-05-07, **Mysterious anomalies in Earth's atmosphere and strongly interacting Dark Matter**, Ariel Zhitnitsky et.al., [2405.04635v1](http://arxiv.org/abs/2405.04635v1)\n\n It has been recently argued [1-3] that there is a number of mysterious observations which are very hard to explain by conventional physics. The mysterious anomalies include (but not limited) to such unexpected correlations as temperature variation in stratosphere, the total electron content (TEC) of the Earths atmosphere, the earthquake activity from one hand, and positions of the planets from another hand. It has been hypothesized in [1-3] that the corresponding mysterious correlations is a result of the \"streaming invisible matter\" which suddenly become very strongly interacting material when enter the Earth's atmosphere. We propose that some of these (and many other) mysteries might be result of rare (but energetic) events when the so-called axion quark nuggets (AQN) hit the Earth. In different words, we identify \"streaming invisible matter\" conjectured by [1-3] with the AQNs. Therefore, we offer a specific microscopical mechanism which could shed some light on the mysterious correlations reported in [1-3]. One should emphasize that the AQN model was originally invented long ago to explain the observed similarity between the dark and the visible components in the Universe, i.e. $\\Omega\\_{\\rm DM}\\sim \\Omega\\_{\\rm visible}$; it was not invented to fit the observed anomalies which represent the topic of this work. We support this proposal by demonstrating that intensity and the spectral features of the AQN induced events are consistent with the corresponding characteristics of the puzzling observations as reported in [1-3].\n\n", "2405.04593": "2024-05-07, **UltraDark.jl: A Julia package for simulation of cosmological scalar fields**, Nathan Musoke et.al., [2405.04593v1](http://arxiv.org/abs/2405.04593v1)\n\n UltraDark.jl is a Julia package for the simulation of cosmological scalar fields. Scalar fields are proposed solutions to two of the fundamental questions in cosmology: the nature of dark matter and the universe's initial conditions. Modeling their dynamics requires solving the Gross-Pitaevskii-Poisson equations, which is analytically challenging. This makes simulations essential to understanding the dynamics of cosmological scalar fields. UltraDark.jl is an open, performant and user friendly option for solving these equations numerically.\n\n", "2405.04575": "2024-05-07, **A Dissipative Dark Cosmology: From Early Matter Dominance to Delayed Compact Objects**, Joseph Bramante et.al., [2405.04575v1](http://arxiv.org/abs/2405.04575v1)\n\n We demonstrate a novel mechanism for producing dark compact objects and black holes through a dark sector, where all the dark matter can be dissipative. Heavy dark sector particles with masses above $10^4$ GeV can come to dominate the Universe and yield an early matter-dominated era before Big Bang Nucleosynthesis (BBN). Density perturbations in this epoch can grow and collapse into tiny dark matter halos, which cool via self interactions. The typical halo size is set by the Hubble length once perturbations begin growing, offering a straightforward prediction of the halo size and evolution depending on ones choice of dark matter model. Once these primordial halos have formed, a thermal phase transition can then shift the Universe back into radiation domination and standard cosmology. These halos can continue to collapse after BBN, resulting in the late-time formation of fragmented dark compact objects and sub-solar mass primordial black holes. We find that these compact objects can constitute a sizable fraction of all of dark matter. The resulting fragments can have masses between $10^{20}$ g to $10^{32}$ g, with radii ranging from $10^{-2}$ m to $10^5$ m, while the black holes can have masses between $10^{8}$ g to $10^{34}$ g. Furthermore, a unique feature of this model is the late-time formation of black holes which can evaporate away today. We compare where these objects lie with respect to current primordial black hole and MACHO constraints.\n\n", "2405.04454": "2024-05-07, **Constraining Millicharged dark matter with Gravitational positivity bounds**, Suro Kim et.al., [2405.04454v1](http://arxiv.org/abs/2405.04454v1)\n\n Gravitational positivity bounds provide consistency conditions for effective field theories with gravity. They turn out to be phenomenologically useful by providing lower bounds in parameters of new physics beyond the Standard Models (BSM). In this paper, we derive constraints on millicharged fermion dark matter models with massless dark photon using gravitational positivity bounds. Combining them with upper bounds from cosmological and astrophysical observations, we can severely constrain the parameter space of the model. In particular, we show that when the dark matter mass is lighter than the solar core temperature, most of the parameter region is excluded by combining gravitational positivity bounds and the stellar bounds.\n\n", "2405.04397": "2024-05-07, **Primordial monopoles, black holes and gravitational waves**, Ahmad Moursy et.al., [2405.04397v1](http://arxiv.org/abs/2405.04397v1)\n\n We show how topologically stable superheavy magnetic monopoles and primordial black holes can be generated at observable levels by the waterfall field in hybrid inflation models based on grand unified theories. In $SU(5) \\times U(1)\\_\\chi$ grand unification, the monopole mass is of order $4 \\times 10^{17}$ GeV, and it carries a single unit ($2 \\pi /e$) of Dirac magnetic charge as well as screened color magnetic charge. The monopole density is partially diluted to an observable value, and accompanied with the production of primordial black holes with mass of order $10^{17}$-$10^{19}$ g which may make up the entire dark matter in the universe. The tensor to scalar ratio $r$ is predicted to be of order $10^{-5}$ - $10^{-4}$ which should be testable in the next generation of CMB experiments such as CMB-S4 and LiteBIRD. The gravitational wave spectrum generated during the waterfall transition is also presented.\n\n", "2405.04194": "2024-05-07, **Foreground biases in strong gravitational lensing**, Daniel Johnson et.al., [2405.04194v1](http://arxiv.org/abs/2405.04194v1)\n\n Strong gravitational lensing is a competitive tool to probe the dark matter and energy content of the universe. However, significant uncertainties can arise from the choice of lens model, and in particular the parameterisation of the line of sight. In this work, we consider the consequences of ignoring the contribution of foreground perturbers in lens modelling. We derive the explicit form of the degeneracy between the foreground shear and the ellipticity of a power law lens, which renders both quantities effectively unmeasurable from strong lensing observables. Nonetheless, we demonstrate that this degeneracy does not affect measurements of the Einstein radius. Foreground tidal effects are also not expected to bias the slope of the potential, and further that any biases in this slope should not affect the recovery of the Hubble constant. The foreground convergence term adds an additional uncertainty to the measurement of $H\\_0$, and we show that this uncertainty will be on the order of $1\\%$ for lensing systems located along random lines of sight. There is evidence to indicate that the probability of strong lensing is higher towards overdense lines of sight, and this could result in a small systematic bias towards overestimations of $H\\_0$.\n\n", "2405.03983": "2024-05-07, **MEET-U Project I: The key drivers of the preference for dynamic dark energy**, Zhiqi Huang et.al., [2405.03983v1](http://arxiv.org/abs/2405.03983v1)\n\n Joint analysis of the baryon acoustic oscillations (BAO) measurement by the Dark Energy Spectroscopic Instrument (DESI) first data release, Type Ia supernovae (SNe) of the Dark Energy Survey Year 5 (DES5YR) release and cosmic microwave background (CMB) data favors a quintom-like dynamic dark energy model over the standard Lambda cold dark matter ($\\Lambda$CDM) model at $3.9\\sigma$ level (Adame et al. 2024). We demonstrate that the preference for dynamic dark energy does not rely on the detailed modeling of CMB physics and remains at $3.2\\sigma$ level when the full CMB likelihood is replaced by a CMB acoustic-oscillation angle ($\\theta\\_\\star$) prior and a baryon abundance ($\\Omega\\_bh^2$) prior. By comparing the data with over $10^4$ $\\Lambda$CDM-based simulations, we find that both the SNe and BAO data contribute significantly to the preference for dynamic dark energy. The preference for dynamic dark energy is unlikely (probability $\\lesssim 0.02$) due to unknown systematics in DES5YR SNe and statistical fluctuations in DESI BAO, or vice versa.\n\n"}, "supernova": {"2405.04908": "2024-05-08, **Sedimentary rocks from Mediterranean drought in the Messinian age as a probe of the past cosmic ray flux**, Lorenzo Caccianiga et.al., [2405.04908v1](http://arxiv.org/abs/2405.04908v1)\n\n We propose the use of natural minerals as detectors to study the past flux of cosmic rays. This novel application of the \\textit{paleo-detector} technique requires a specific approach as it needs samples that have been exposed to secondary cosmic rays for a well defined period of time. We suggest here the use of the evaporites formed during the desiccation of the Mediterranean sea ${\\sim}6$ Myr ago. These minerals have been created and exposed to the air or under a shallow water basin for ${\\sim}500$ kyr before being quickly submerged again by a km-scale overburden of water. We show that, by looking at the damages left in the minerals by muons in cosmic ray showers, we could detect differences in the primary cosmic ray flux during that period, as the ones expected from nearby supernova explosions, below the percent-level. We show also that little to no background from radioactive contamination and other astroparticles is expected for this kind of analysis.\n\n", "2405.04898": "2024-05-08, **A Gamma-ray Emitting Collisional Ring Galaxy System in our Galactic Neighborhood**, Vaidehi S. Paliya et.al., [2405.04898v1](http://arxiv.org/abs/2405.04898v1)\n\n The astrophysical $\\gamma$-ray photons carry the signatures of the violent phenomena happening on various astronomical scales in our Universe. This includes supernova remnants, pulsars, and pulsar wind nebulae in the Galactic environment and extragalactic relativistic jets associated with active galactic nuclei (AGN). However, $\\sim$30\\% of the \\gm-ray sources detected with the Fermi Large Area Telescope lack multiwavelength counterpart association, precluding us from characterizing their origin. Here we report, for the first time, the association of a collisional ring galaxy system in our Galactic neighborhood (distance $\\sim$10 Mpc), formed as a consequence of a smaller `bullet' galaxy piercing through a larger galaxy, as the multi-frequency counterpart of an unassociated $\\gamma$-ray source 4FGL~J1647.5$-$5724. The system, also known as \"Kathryn's Wheel\", contains two dwarf irregular galaxies and an edge-on, late-type, spiral galaxy surrounded by a ring of star-forming knots. We utilized observations taken from the Neil Gehrels Swift observatory, Rapid ASKAP Continuum Survey, SuperCOSMOS H$\\alpha$ Survey, Dark Energy Survey, and Visible MultiObject Spectrograph at Very Large Telescope to ascertain the association with 4FGL~J1647.5$-$5724 and to explore the connection between the star-forming activities and the observed $\\gamma$-ray emission. We found that star-formation alone cannot explain the observed $\\gamma$-ray emission, and additional contribution likely from the pulsars/supernova remnants or buried AGN is required. We conclude that arcsecond/sub-arcsecond-scale observations of this extraordinary $\\gamma$-ray emitting galaxy collision will be needed to resolve the environment and explore the origin of cosmic rays.\n\n", "2405.04886": "2024-05-08, **Investigating the accelerated expansion of the Universe through updated constraints on viable $f(R)$ models within the Palatini formalism**, Kumar Ravi et.al., [2405.04886v1](http://arxiv.org/abs/2405.04886v1)\n\n The observed accelerated expansion of the Universe at present epoch can be explained by some of the $f(R)$ models without invoking the existence of dark energy or any other such exotic component in cosmic fluid. The $f(R)$ models in Palatini formalism is relatively less explored in recent times with respect to their counterpart in metric formalism. We study seven $f(R)$ models in Palatini formalism: Hu-Sawicki (two cases), Starobinsky, exponential, Tsujikawa, $f(R) = R -\\beta /R^ n$, and $f(R)= R + \\alpha \\ln(R) - \\beta$. Following standard statistical procedure and utilizing data sets: type Ia supernovae data, cosmic chronometer observations, baryonic acoustic oscillations data, data from H \\textsc{ii} starburst galaxies, local measurements of the \\emph{Hubble} parameter ($H\\_{0}$), and distance priors of cosmic microwave background radiation data, we obtain constraints on the model parameters. When compared with the standard `lambda-cold dark matter model', for many data set combinations, the support for $f(R)$ models is significant. We obtain the relevant quantities for characterizing the accelerated expansion of the Universe, and these quantities are consistent with those obtained in a model-independent way by others. The curve of effective/total equation-of-state parameter, obtained from parameter constraints, clearly shows correct phases of the expansion history: the radiation-dominated epochs and the matter-dominated epochs, of the past, and the current accelerated expansion epoch eventually evolving to de-Sitter phase in the distant future. Overall, our results advocate in favour of pursuing $f(R)$ models in Palatini formalism as a potential alternative for explaining accelerated expansion of the Universe.\n\n", "2405.04779": "2024-05-08, **Time Delay Anomalies of Fuzzy Gravitational Lenses**, Jianxiang Liu et.al., [2405.04779v1](http://arxiv.org/abs/2405.04779v1)\n\n Fuzzy dark matter is a promising alternative to the standard cold dark matter. It has quite recently been noticed, that they can not only successfully explain the large-scale structure in the Universe, but can also solve problems of position and flux anomalies in galaxy strong lensing systems. In this paper we focus on the perturbation of time delays in strong lensing systems caused by fuzzy dark matter, thus making an important extension of previous works. We select a specific system HS 0810+2554 for the study of time delay anomalies. Then, based on the nature of the fuzzy dark matter fluctuations, we obtain theoretical relationship between the magnitude of the perturbation caused by fuzzy dark matter, its content in the galaxy, and its de Broglie wavelength $\\lambda \\_{\\mathrm{dB}}$. It turns out that, the perturbation of strong lensing time delays due to fuzzy dark matter quantified as standard deviation is $\\sigma\\_{\\Delta t} \\propto \\lambda \\_{\\mathrm{dB}}^{1.5}$. We also verify our results through simulations. Relatively strong fuzzy dark matter fluctuations in a lensing galaxy make it possible to to destroy the topological structure of the lens system and change the arrival order between the saddle point and the minimum point in the time delays surface. Finally, we stress the unique opportunity for studying properties of fuzzy dark matter created by possible precise time delay measurements from strongly lensed transients like fast radio bursts, supernovae or gravitational wave signals.\n\n", "2405.04750": "2024-05-08, **The Catalog of early-type Runaway stars from LAMOST-DR8**, Yanjun Guo et.al., [2405.04750v1](http://arxiv.org/abs/2405.04750v1)\n\n Runaway stars are OB-type stars ejected from their birthplace with large peculiar velocities. The leading hypothesis addressed in their formation includes the supernova ejection mechanism and the dynamic ejection scenario. Identification of runaway populations is the first step to investigating their formation and evolution. Here we present our work of searching for Galactic runaway candidate stars from the LAMOST Medium-Resolution Survey DR8 database. After studying the kinematic properties for a collection of 4,432 early-type stars, predominantly B-type stars, using the radial velocity measurements from LAMOST DR8 and astrometric solutions made by Gaia DR3, we identified 229 runaway candidate stars. They span a wide distribution in projected rotational velocities. We investigated the Galactic spatial distribution of the runaway population and noticed that most of them likely reside within the Galactic thin disk. Based upon analyzing the Doppler shifts of the candidate stars, we found two binary runaway candidates displaying velocity variation with estimated orbital periods of 40 and 61 days.\n\n", "2405.04583": "2024-05-07, **SN2023fyq: A Type Ibn Supernova With Long-standing Precursor Activity Due to Binary Interaction**, Yize Dong et.al., [2405.04583v1](http://arxiv.org/abs/2405.04583v1)\n\n We present photometric and spectroscopic observations of SN 2023fyq, a type Ibn supernova in the nearby galaxy NGC 4388 (D$\\simeq$18~Mpc). In addition, we trace long-standing precursor emission at the position of SN 2023fyq using data from DLT40, ATLAS, ZTF, ASAS-SN, Swift, and amateur astronomer Koichi Itagaki. Precursor activity is observed up to nearly three years before the supernova explosion, with a relatively rapid rise in the final 100 days. The double-peaked post-explosion light curve reaches a luminosity of $\\sim10^{43}~\\rm erg\\,s^{-1}$. The strong intermediate-width He lines observed in the nebular spectrum of SN 2023fyq imply the interaction is still active at late phases. We found that the precursor activity in SN 2023fyq is best explained by the mass transfer in a binary system involving a low-mass He star and a compact companion. An equatorial disk is likely formed in this process ($\\sim$0.6$\\rm M\\_{\\odot}$), and the interaction of SN ejecta with this disk powers the main peak of the supernova. The early SN light curve reveals the presence of dense extended material ($\\sim$0.3$\\rm M\\_{\\odot}$) at $\\sim$3000$\\rm R\\_{\\odot}$ ejected weeks before the SN explosion, likely due to final-stage core silicon burning or runaway mass transfer resulting from binary orbital shrinking, leading to rapid rising precursor emission within $\\sim$30 days prior to explosion. The final explosion could be triggered either by the core-collapse of the He star or by the merger of the He star with a compact object. SN 2023fyq, along with SN 2018gjx and SN 2015G, forms a unique class of Type Ibn SNe which originate in binary systems and are likely to exhibit detectable long-lasting pre-explosion outbursts with magnitudes ranging from $-$10 to $-$13.\n\n", "2405.04522": "2024-05-07, **Astrometric Redshifts of Supernovae**, Jaemyoung et.al., [2405.04522v1](http://arxiv.org/abs/2405.04522v1)\n\n Differential Chromatic Refraction (DCR) is caused by the wavelength dependence of our atmosphere's refractive index, which shifts the apparent positions of stars and galaxies and distorts their shapes depending on their spectral energy distributions (SEDs). While this effect is typically mitigated and corrected for in imaging observations, we investigate how DCR can instead be used to our advantage to infer the redshifts of supernovae from multi-band, time-series imaging data. We simulate Type Ia supernovae (SNe Ia) in the proposed Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST) Deep Drilling Field (DDF), and evaluate astrometric redshifts. We find that the redshift accuracy improves dramatically with the statistical quality of the astrometric measurements as well as with the accuracy of the astrometric solution. For a conservative choice of a 5-mas systematic uncertainty floor, we find that our redshift estimation is accurate at $z < 0.6$. We then combine our astrometric redshifts with both host galaxy photometric redshifts and supernovae photometric (light-curve) redshifts and show that this considerably improves the overall redshift estimates. These astrometric redshifts will be valuable especially since Rubin will discover a vast number of supernovae for which we will not be able to obtain spectroscopic redshifts.\n\n", "2405.04259": "2024-05-07, **Interacting supernovae**, Luc Dessart et.al., [2405.04259v1](http://arxiv.org/abs/2405.04259v1)\n\n Modern photometric surveys of the sky suggest that many, perhaps most supernovae (SNe) associated with the explosion of massive stars are influenced at an appreciable level by their interaction with circumstellar material (CSM). The photometric and spectroscopic diversity of these transients point to a wide range of CSM properties in terms of mass, extent, composition, and location relative to the exploding star, suggesting progenitors that cover from standard to the most extreme mass loss rates. Surveys at high-cadence catch massive stars at shock breakout and inform us on the immediate mass loss history before core collapse. In contrast, long-term monitoring of these SNe cover the transition to the birth of a SN remnant and document the progenitor mass loss that took place centuries to millennia before explosion. Interacting SNe are therefore not just extraordinary astrophysical laboratories to study radiation-dominated shocks and probe the distant Universe, they also open the path to novel and fundamental studies on stellar evolution, stellar stability, or mass loss in single and binary massive stars.\n\n", "2405.04216": "2024-05-07, **DESI 2024: Reconstructing Dark Energy using Crossing Statistics with DESI DR1 BAO data**, R. Calderon et.al., [2405.04216v1](http://arxiv.org/abs/2405.04216v1)\n\n We implement Crossing Statistics to reconstruct in a model-agnostic manner the expansion history of the universe and properties of dark energy, using DESI Data Release 1 (DR1) BAO data in combination with one of three different supernova compilations (PantheonPlus, Union3, and DES-SN5YR) and Planck CMB observations. Our results hint towards an evolving and emergent dark energy behaviour, with negligible presence of dark energy at $z\\gtrsim 1$, at varying significance depending on data sets combined. In all these reconstructions, the cosmological constant lies outside the 95\\% confidence intervals for some redshift ranges. This dark energy behaviour, reconstructed using Crossing Statistics, is in agreement with results from the conventional $w\\_0$--$w\\_a$ dark energy equation of state parametrization reported in the DESI Key cosmology paper. Our results add an extensive class of model-agnostic reconstructions with acceptable fits to the data, including models where cosmic acceleration slows down at low redshifts. We also report constraints on \\Hord\\ from our model-agnostic analysis, independent of the pre-recombination physics.\n\n", "2405.04024": "2024-05-07, **Stellar Population near NGC 2021: Procession of Star Formation in the South Rim of Supergiant Shell LMC 4**, Po-Sheng Ou et.al., [2405.04024v1](http://arxiv.org/abs/2405.04024v1)\n\n Supergiant shells (SGSs) are the largest interstellar structures where heated and enriched gas flows into the host galaxy's halo. The SGSs in the Large Magellanic Cloud (LMC) are so close that their stars can be resolved with ground-based telescopes to allow studies of star formation history. Aiming to study the star formation history and energy budget of LMC 4, we have conducted a pilot study of the cluster NGC 2021 and the OB associations in its vicinity near the south rim of LMC 4. We use the Magellanic Cloud Photometric Survey data of the LMC to establish a methodology to examine the stellar population and assess the massive star formation history. We find a radial procession of massive star formation from the northwest part of the OB association LH79 through NGC 2021 to the OB association LH78 in the south. Using the stellar content of NGC 2021 and the assumption of Salpeter's initial mass function, we estimate that $\\sim$4 supernovae have occurred in NGC 2021, injecting at least $4\\times10^{51}$ ergs of kinetic energy into the interior of LMC 4.\n\n", "2405.03983": "2024-05-07, **MEET-U Project I: The key drivers of the preference for dynamic dark energy**, Zhiqi Huang et.al., [2405.03983v1](http://arxiv.org/abs/2405.03983v1)\n\n Joint analysis of the baryon acoustic oscillations (BAO) measurement by the Dark Energy Spectroscopic Instrument (DESI) first data release, Type Ia supernovae (SNe) of the Dark Energy Survey Year 5 (DES5YR) release and cosmic microwave background (CMB) data favors a quintom-like dynamic dark energy model over the standard Lambda cold dark matter ($\\Lambda$CDM) model at $3.9\\sigma$ level (Adame et al. 2024). We demonstrate that the preference for dynamic dark energy does not rely on the detailed modeling of CMB physics and remains at $3.2\\sigma$ level when the full CMB likelihood is replaced by a CMB acoustic-oscillation angle ($\\theta\\_\\star$) prior and a baryon abundance ($\\Omega\\_bh^2$) prior. By comparing the data with over $10^4$ $\\Lambda$CDM-based simulations, we find that both the SNe and BAO data contribute significantly to the preference for dynamic dark energy. The preference for dynamic dark energy is unlikely (probability $\\lesssim 0.02$) due to unknown systematics in DES5YR SNe and statistical fluctuations in DESI BAO, or vice versa.\n\n", "2405.03947": "2024-05-07, **Probing the spectrum of the magnetar 4U 0142+61 with JWST**, Jeremy Hare et.al., [2405.03947v1](http://arxiv.org/abs/2405.03947v1)\n\n JWST observed the magnetar 4U 0142+61 with the MIRI and NIRCam instruments within a 77 min time interval on 2022 September 20-21. The low-resolution MIRI spectrum and NIRCam photometry show that the spectrum in the wavelength range 1.4-11 $\\mu$m range can be satisfactorily described by an absorbed power-law model, $f\\_{\\nu}\\propto \\nu^{-\\alpha}$, with a spectral slope $\\alpha =0.96\\pm0.02$, interstellar extinction $A\\_V= 3.9\\pm0.2$, and normalization $f\\_0 = 59.4\\pm 0.5$ $\\mu$Jy at $\\lambda = 8$ $\\mu$m. These observations do not support the passive disk model proposed by Wang et al. (2006), based on the Spitzer photometry, which was interpreted as evidence for a fallback disk from debris formed during the supernova explosion. We suggest a nonthermal origin for this emission and source variability as the most likely cause of discrepancies between the JWST data and other IR-optical observing campaigns. However, we cannot firmly exclude the presence of a large disk with a different dependence of the effective disk temperature on distance from the magnetar. Comparison with the power-law fit to the hard X-ray spectrum above 10 keV, measured by NuSTAR contemporaneously with JWST, shows that the X-ray spectrum is significantly harder. This may imply that the X-ray and IR nonthermal emission come from different sites in the magnetosphere of the magnetar.\n\n"}}