{"neutrino": {"2602.09993": "2026-02-10, **The supernova remnant J0450.4-7050 possesses a jets-shaped point-symmetric morphology**, Noam Soker et.al., [2602.09993v1](http://arxiv.org/abs/2602.09993v1)\n\n By examining recently published images in different wavelengths, I identify a point-symmetric morphology in the Large Magellanic Cloud core-collapse supernova (CCSN) remnant (CCSNR) J0450.4-7050 (SNR 0450-70.9; nicknamed Veliki), which I attribute to at least three pairs of energetic jets that participated in the explosion of the progenitor in the framework of the jittering jets explosion mechanism (JJEM). Two pairs of ears, a pair of blowouts in the north and south along the long axis of this SNR, and a pair of dents compose the point symmetric morphology. The fact that the symmetry axes of two pairs include pairs of opposite structural features in the inner ejecta implies that the shaping is by jets and not due to an interaction with an ambient material. While the JJEM predicts such morphologies, the competing neutrino-driven mechanism cannot account for point-symmetric morphologies. This study provides strong support for the claim that the JJEM is the primary CCSN explosion mechanism.\n\n", "2602.09962": "2026-02-10, **Cosmological signature and light Dark Matter in Dirac $L_μ-L_τ$ model**, Pritam Das et.al., [2602.09962v1](http://arxiv.org/abs/2602.09962v1)\n\n We revisit an anomaly-free extension of the Standard Model (SM) $viz.$ gauged ${L\\_μ-L\\_τ}$ model in the Dirac framework, where the local $U(1)\\_{L\\_μ-L\\_τ}$ symmetry breaks and gives rise to a new gauge boson $Z'$ and corresponding gauge coupling $g\\_{μτ}$. Three additional heavy vector-like fermions, three light right-handed neutrinos and two heavy singlet scalars are added to complete the model framework for Dirac neutrinos. Another singlet vector-like fermion is added with a new gauge charge, which serves as a viable DM candidate, and the correct relic abundance is obtained via the resonance effect. The parameter space is considered after satisfying the current bounds on $M\\_{Z'}$ and the gauge coupling $g\\_{μτ}$. The influence of dark radiations coming from the additional light degrees of freedoms are studied in connection with the dark matter. After imposing all relevant theoretical and experimental constraints, the allowed parameter space is found to be highly restricted yet still accessible to ongoing and near-future experiments, rendering the scenario strongly predictive. Moreover, clear correlations among the relevant observables emerge throughout this study, making the model testable in current and future experimental searches.\n\n", "2602.09800": "2026-02-10, **Study of $B^+ \\to μ^+ ν_μ$ decays at Belle and Belle II**, Belle et.al., [2602.09800v1](http://arxiv.org/abs/2602.09800v1)\n\n We report a measurement of the branching fraction for the leptonic decay $B^+\\toμ^+ν\\_μ$. This work presents the first $B^+\\toμ^+ν\\_μ$ result using Belle~II data, an updated Belle measurement that supersedes the previous result, and their combination, which yields the most precise search to date. The analysis is based on $1076\\,\\mathrm{fb}^{-1}$ of $e^+e^-$ collision data collected at a center-of-mass energy of $10.58\\,\\mathrm{GeV}$ with the Belle and Belle~II detectors at the KEKB and SuperKEKB colliders, respectively. We measure $\\mathcal{B}(B^+\\toμ^+ν\\_μ)=(4.4\\pm1.9\\pm 1.0)\\times10^{-7}$, where the first uncertainty is statistical and the second systematic. The observed significance relative to the background-only hypothesis is 2.4 standard deviations. We set a 90\\% confidence level upper limit of $\\mathcal{B}(B^+\\toμ^+ν\\_μ)<6.7\\times10^{-7}$ using a frequentist approach and a 90\\% credibility level upper limit of $\\mathcal{B}(B^+\\toμ^+ν\\_μ)<7.2\\times 10^{-7}$ using a Bayesian approach. These are the most stringent limits to date. The result is interpreted as an exclusion region in the parameter space of type~II and type~III two-Higgs-doublet models. We search for stable sterile neutrinos with masses $m\\_N\\in[0,1.5]\\,\\mathrm{GeV}$. No signal is observed, and the resulting exclusion on the squared mixing parameter $\\|U\\_{μN}\\|^2$ provides improvement over previous limits. We report a measurement of the partial branching fraction of semileptonic $B\\to X\\_u\\ellν\\_\\ell$ decays with $p\\_μ^B>2.2\\,\\mathrm{GeV}$, obtaining $Δ\\mathcal{B}(B\\to X\\_u\\ellν\\_\\ell)=(2.72\\pm0.05\\pm0.29)\\times10^{-4}$. We present a model-dependent study of weak annihilation decays using the muon momentum spectrum. We observe a signal of 2.4 standard deviations above the background-only hypothesis in regions where the distribution resembles that of $B\\to X\\_u\\ellν\\_\\ell$ decays.\n\n", "2602.09097": "2026-02-09, **Experimental Tests of Baryon and Lepton Number Conservation**, Volodymyr Takhistov et.al., [2602.09097v1](http://arxiv.org/abs/2602.09097v1)\n\n Baryon number ($B$) conservation underlies the apparent stability of ordinary matter by forbidding the decay of nucleons, while lepton number ($L$) conservation plays a central role in the structure of lepton interactions and the possible origin of neutrino mass. In the Standard Model, $B$ and $L$ are accidental global symmetries rather than imposed fundamental principles. However, they are expected to be violated in many extensions of the theory, including frameworks of unification and processes in the early Universe. This review summarizes the status of experimental tests of $B$ and $L$ conservation and discusses them within a unified framework for interpreting current and future searches across different processes and experimental approaches, outlining historical and theoretical motivation, key physical processes, as well as their broader connections and complementarity to other searches.\n\n", "2602.09095": "2026-02-09, **Long-lived Left-Right signals at the FCC-ee**, Benjamin Fuks et.al., [2602.09095v1](http://arxiv.org/abs/2602.09095v1)\n\n We give an extensive discussion of the displaced signals of heavy Majorana neutrino production at future electron-positron colliders operating at various proposed energies in the context of the Left-Right symmetric model. A comprehensive collection of channels is taken into account, ranging from those featuring $W$ and $W\\_R$ mediation to those induced by scalar mixing and gauge/scalar boson fusion, with connections to the mechanism of neutrino mass origin. The emerging signatures feature possibly multiple displaced heavy neutrinos that are in some cases accompanied by prompt activity and forward leptons. We derive the corresponding total production rates and differential distributions, which allow us to differentiate the channels and have analytical estimates of the signal yield. We then develop realistic estimates of the selection efficiencies using a dedicated vertexing algorithm which establishes the displaced decay positions and supplies a reliable proxy for reconstructing the full four-momenta of long-lived particles. This allows to determine the realistic reaches in the parameter space of the Left-Right symmetric model across the various channels, and we show that these can strongly surpass the LHC ones, demonstrating that future lepton colliders are sensitive to left-right symmetry breaking scales in the deep multi-TeV regime.\n\n", "2602.09025": "2026-02-09, **An Exploration of the Equation of State Dependence of Core-Collapse Supernova Explosion Outcomes and Signatures**, Aleksandr Rusakov et.al., [2602.09025v1](http://arxiv.org/abs/2602.09025v1)\n\n We explore, using a state-of-the-art simulation code in 3D and to late enough times to witness final observables, the dependence of core-collapse supernova explosions on the nuclear equation of state. Going beyond questions of explodability, we compare final explosion energies, nucleosynthetic yields, recoil kicks, and gravitational-wave and neutrino signatures using the SFHo and DD2 nuclear equations of state (EOS) for a 9-$M\\_{\\odot}$/solar-metallicity progenitor star. The DD2 EOS is stiffer and has a lower effective nucleon mass. The result is a more extended protoneutron star (PNS) and lower central densities. As a consequence, the mean neutrino energies, final explosion energy, and recoil kick speed are lower. Moreover, the evolution of PNS convection differs between the two EOS models in significant ways. This translates in part into interestingly altered neutrino ``light\" curves and noticeably altered gravitational-wave signal strengths and frequency characteristics that may be diagnostic. The faster exploding model (SFHo) yields slightly more neutron-rich ejecta and more species with atomic weights between 60 and 90 and a weak r-process. However, this is merely a preliminary study. The next step is a more comprehensive and multi-progenitor set of 3D supernova simulations for various EOSes to late times when the observables have asymptoted. Such a future investigation will have a direct bearing on the neutron star and black hole birth mass functions and the quest towards a fully quantitative theory of supernova observables.\n\n", "2602.08921": "2026-02-09, **Seasonal Variation of Polar Ice: Implications for Ultrahigh Energy Neutrino Detectors**, Alexander Kyriacou et.al., [2602.08921v1](http://arxiv.org/abs/2602.08921v1)\n\n The upper $100 \\, \\mathrm{m}$ to $150 \\, \\mathrm{m}$ of the polar ice sheet, called the firn, has a time-dependent density due to seasonal variations in the surface temperature and snow accumulation. We present RF simulations of an in-ice neutrino-induced radio source that show that these density anomalies create variations in the amplitude and propagation times of radio signals propagating through polar firn at an altitude of ${\\sim}3000 \\, \\mathrm{m}$ above sea level. The received power from signals generated in the ice that refract within the upper ${\\sim} 15 \\, \\mathrm{m}$ firn are subject to a seasonal variation on the order of 10\\%. These variations result in an irreducible background uncertainty on the reconstructed neutrino energy and arrival direction for detectors using ice as a detection medium.\n\n", "2602.08685": "2026-02-09, **Constraints on non-standard neutrino interactions from Borexino extended data-set**, V. Antonelli et.al., [2602.08685v1](http://arxiv.org/abs/2602.08685v1)\n\n Neutrino non-standard interactions (NSI) constitute an active research field, as they are closely related to potential new physics associated with dark matter searches and exotic interactions arising from fundamental symmetry violations. The Borexino's unprecedented sensitivity to solar neutrinos, derived from its low background and precision spectral measurements, enables stringent constraints on potential deviations from the standard three-flavor neutrino oscillation paradigm. This work presents an update on the analysis of flavor-diagonal NSI using the full Borexino Phase-III data set, extending the study previously reported in Constraints on flavor-diagonal non-standard neutrino interactions from Borexino Phase-II (JHEP 2020, 38). The updated analysis incorporates the extended temporal and statistical coverage of Phase-III. The results indicate improved sensitivity to the diagonal NSI parameters, with constraints exceeding those obtained in Phase-II. Furthermore, a more general analysis that includes all possible off-diagonal NSI terms is presented for the first time, providing a comprehensive exploration of the NSI parameter space associated with the flavors of the incoming and outgoing neutrinos. This work once again underlines Borexino's critical role in probing new physics scenarios and reinforces its legacy in neutrino research. Detailed comparisons with Phase-II results are discussed, along with implications for theoretical models of NSI.\n\n", "2602.08649": "2026-02-09, **IceCube's Sensitivity Prospects to MeV-Scale Axion-Like Particles from Core-Collapse Supernovae**, Nora Valtonen-Mattila et.al., [2602.08649v1](http://arxiv.org/abs/2602.08649v1)\n\n We present a novel framework to estimate the sensitivity and discovery potential of IceCube to axion-like particles (ALPs) produced in core-collapse supernovae (CCSNe), covering ALP masses from 1 MeV to several hundred MeV. A key feature of this work is the explicit handling of the final-state leptons produced in ALP interactions with $^{16}$O nuclei and protons, which can generate Cherenkov light detectable in IceCube. These processes are being fully integrated into a detector-level simulation chain, enabling realistic detector signal modeling beyond existing estimates. The framework enables sensitivity forecasts for both direct detection and constraints based on time delays relative to the neutrino burst, across a range of ALP emission models. This approach may also extend to other MeV-scale dark sector particles. Preliminary sensitivity estimates are in progress and will be presented.\n\n", "2602.08523": "2026-02-09, **A light DM model for large $B \\to K + \\mbox{invisible}$ and $K \\to π+ \\mbox{invisible}$ decays and its implications for $B_s-\\bar B_s$ mixing and neutron EDM**, Xuan Hong et.al., [2602.08523v1](http://arxiv.org/abs/2602.08523v1)\n\n We present a light dark matter model with sizable invisible rare meson decays to accommodate possible larger than standard model (SM) predictions for both $B^+\\to K^+ν\\barν$ by Belle II and $K^+\\toπ^+ν\\bar ν$ by NA62. Since the emitted neutrinos are unobserved, the excesses may be due to light dark matter pairs in the final states. We show that it is possible to realize this by a UV-complete model based on a two Higgs doublet model. The neutral spin-zero Higgs bosons (scalar or pseudoscalar) mediating dark matter interaction, can also produce some effects at low energies which modify the SM predictions significantly. In particular we find large testable consequences for $B\\_s - \\bar B\\_s$ mixing due to splitting of scalar and pseudoscalar masses, and also neutron EDM. We find that there is a cancellation due to exchange of neutral spin-zero particle for neutron EDM in general, but QCD running will lift this cancellation.This is generally true for any neutral Higgs contributions. However, we find that such a cancellation does not happen for charged scalar contribution. The allowed CP violating phase in the Yukawa sector can produce a neutron EDM experimental bound.\n\n", "2602.08453": "2026-02-09, **Neutrinoless double beta decays of hyperons in covariant chiral perturbation theory**, Zi-Ying Zhao et.al., [2602.08453v1](http://arxiv.org/abs/2602.08453v1)\n\n Neutrinoless double beta ($0νββ$) decays of spin-1/2 hyperons are investigated in a covariant baryon chiral perturbation theory framework, extended by a $ΔL=2$ operator proportional to the Majorana neutrino mass, where $L$ denotes the lepton number. Within the light Majorana neutrino exchange mechanism, the decay amplitudes are found to emerge at the one-loop level, representing the long-range contribution. The extended-on-mass-shell scheme is employed to renormalize the one-loop amplitudes and restore consistent chiral power counting. Consequently, the differential decay rates for all accessible hyperon $0νββ$ channels are predicted and the corresponding branching ratios are more than 20 orders of magnitude smaller than the current experimental upper bounds. Interestingly, it is found that the leading contribution to hyperon $0νββ$ decay is actually from short-range counterterm operators, as required by the renormalization argument. Neutrinoless transition form factors are proposed to determine this leading contribution through future lattice QCD simulations.\n\n", "2602.08319": "2026-02-09, **Neutrino Emission from Gamma-ray Burst Jet Propagating inside the Cavity within Active Galactic Nucleus Accretion Disks**, Hao-Yu Yuan et.al., [2602.08319v1](http://arxiv.org/abs/2602.08319v1)\n\n Short gamma-ray bursts (sGRBs) from the merger of binary compact objects (BCOs) could occur in the accretion disks of the active galactic nucleus (AGN). Before merging, the BCO will inevitably form a low-density cavity. The sGRB jet will interact with the AGN disk photons during its propagation through the cavity, leading to unique electromagnetic and neutrino signatures. In this work, we investigate the influence of the AGN disk photon field on neutrino emission within the internal dissipation regions of a two-component sGRB jet (a narrow core and a wide wing). We find that, due to the strong AGN disk photon field, the neutrino flux at high-energy part (e.g., PeV to EeV) will be suppressed, while the relatively lower-energy part (e.g., TeV to PeV) will be enhanced. Such a conclusion can enhance the constraints on GRB parameters (e.g., baryonic loading factor and bulk Lorentz factor) based on the future detection or non-detection of high-energy neutrinos from GRBs. Besides, the two-component jet can display two-bump structure at higher and lower energy in the neutrino spectrum. Therefore, the joint observations of electromagnetic and neutrinos emission can help us identify the sGRB jet and its structure in the AGN disk.\n\n", "2602.08314": "2026-02-09, **Probing Light Dark Particles in Neutrino Scattering Experiments**, Ruofei Feng et.al., [2602.08314v1](http://arxiv.org/abs/2602.08314v1)\n\n In this work we investigate the production of a dark fermionic particle $χ$ in the neutrino scattering experiments. In the framework of effective field theory, such process can be induced by the effective four-fermion interactions involving neutrinos, the dark particle $χ$ and standard model particles. In particular, we examine the constraints on the effective couplings from the neutrinos scattering off nuclei in the COHERENT and CONUS+ experiments as well as the prospects at the DUNE near detector from neutrino-electron scattering. It turns out the current COHERENT and CONUS+ constraints on the cutoff scales are less stringent than those from the existing Large Hadron Collider data. However, the DUNE near detector could probe the cutoff scales beyond the existing CHARM II and LEP limits up to roughly 1 TeV, for the dark particle mass up to roughly 50 MeV.\n\n"}, "dark matter": {"2602.10112": "2026-02-10, **Minimal Freeze-in Dark Matter: Reviving electroweak doublet dark matter with Boltzmann suppressed freeze-in**, Nicolás Bernal et.al., [2602.10112v1](http://arxiv.org/abs/2602.10112v1)\n\n Dark matter communicating with the Standard Model solely via electroweak interactions provides a compelling picture. However, thermal freeze-out of electroweak doublet dark matter is generically strongly excluded by direct detection. We show that SU(2)${}\\_L$ doublet fermion dark matter evades direct detection if its mass exceeds $10^{10}$ GeV. If the neutral Dirac fermion is split into a pseudo-Dirac pair (via high dimension operator) this limit can be relaxed to 300 GeV. Provided the dark matter mass is above the reheat temperature of the Universe, the production rate never exceeds the Hubble rate in cases of interest, thus the dark matter never thermalizes. We apply constraints from direct detection (e.g. LZ) and consider the discovery potential of Darwin. This scenario presents the most minimal model of freeze-in dark matter, and is both elegant and highly predictive.\n\n", "2602.09773": "2026-02-10, **Massive disk galaxies with high surface brightness plus low surface brightness stellar disks, hosted by massive dark matter halo -- a TNG50 simulation study**, Suchira Sarkar et.al., [2602.09773v1](http://arxiv.org/abs/2602.09773v1)\n\n We study massive disk galaxies (total stellar mass$>=10^{11}$ $\\mathrm{M\\_{\\odot}}$) from IllustrisTNG50 simulation, and perform 2-D structural decomposition of the galaxies using their idealised, synthetic SDSS images for z=0. We find an interesting sample of galaxies having a central high surface brightness (HSB) stellar disk, surrounded by an extended low surface brightness (LSB) stellar disk, similar to giant LSB galaxies. These massive, double-exponential disk galaxies are found to be hosted by dark matter haloes of $\\sim 10^{12} \\mathrm{M\\_{\\odot}}$ in agreement to observations of such galaxies. Their maximum rotation velocity, an approximate measure of their dynamical mass, lies within $\\sim$ (300-500) km/s. The stellar-to-dark matter mass ratio and the baryon-to-dark matter mass ratio of the sample lies in the range of $\\sim$ (0.04 - 0.46) and $\\sim$ (0.07 - 0.47) respectively. Our results show that cosmological simulations are able to form disc galaxies with HSB plus LSB disks, as in observations.\n\n", "2602.09558": "2026-02-10, **Microlensing events and primordial black holes in the axionlike curvaton model**, Kentaro Kasai et.al., [2602.09558v1](http://arxiv.org/abs/2602.09558v1)\n\n Recently, Subaru Hyper Suprime-Cam (HSC) observations found 12 candidates for microlensing events. These events can be explained by primordial black holes (PBHs) with masses of $10^{-7}$-$10^{-6} M\\_\\odot$ and a fraction of all dark matter of $f\\_\\mathrm{PBH} = \\mathcal{O}(10^{-1})$. In this paper, we consider the PBH production in two types of the axionlike curvaton models, which predict an enhancement of the curvature perturbations on small scales. We show that the microlensing events can be explained in the axionlike curvaton model and discuss the cosmological implications such as gravitational waves.\n\n", "2602.09471": "2026-02-10, **Field-Dependent Qubit Flux Noise Simulated from Materials-Specific Disordered Exchange Interactions Between Paramagnetic Adsorbates**, Keith G. Ray et.al., [2602.09471v1](http://arxiv.org/abs/2602.09471v1)\n\n Superconducting quantum devices, from qubits and magnetometers to dark matter detectors, are influenced by magnetic flux noise originating from paramagnetic surface defects and impurities. These spin systems can feature complex dynamics, including a Berezinskii-Kosterlitz-Thouless transition, that depend on the lattice, interactions, external fields, and disorder. However, the disorder included in typical models is not materials-specific, diminishing the ability to accurately capture measured flux noise phenomena. We present a first principles-based simulation of a spin lattice consisting of paramagnetic O$\\_2$ molecules on an Al$\\_2$O$\\_3$ surface, a likely flux noise source in superconducting qubits, to elucidate opportunities to mitigate flux noise. We simulate an ensemble of surface adsorbates with disordered orientations and calculate the orientation-dependent exchange couplings using density functional theory. Thus, our spin simulation has no free parameters or assumed functional form of the disorder, and captures correlation in the defect landscape that would appear in real systems. We calculate a range of exchange interactions between electron pairs, with the smallest values, 0.016 meV and -0.023 meV, being in the range required to act as a two-level system and couple to GHz resonators. We calculate the flux noise frequency, temperature, and applied external magnetic field dependence, as well as the susceptibility-flux noise cross-correlation. Calculated trends agree with experiment, demonstrating that a surface harboring paramagnetic adsorbates arranged with materials-specific disorder and interactions captures the various properties of magnetic flux noise observed in superconducting circuits. In addition, we find that an external electric field can tune the spin-spin interaction strength and reduce magnetic flux noise.\n\n", "2602.09421": "2026-02-10, **First Nuclear Ultra-Heavy Dark Matter Search in Argon Time Projection Chambers with the DarkSide-50 Experiment**, P. Agnes et.al., [2602.09421v1](http://arxiv.org/abs/2602.09421v1)\n\n We report the first search for nuclear ultra-heavy dark matter (UHDM) in a dual-phase liquid argon time projection chamber using the DarkSide-50 experiment. Unlike conventional weakly interacting massive particles (WIMPs), nuclear UHDM candidates may be composed of many dark nucleons and scatter numerous times while passing through the detector. Accounting for energy loss through the Earth's overburden, we apply selection criteria optimized for multi-scatter event topologies using the 532-day low-radiation campaign of the DarkSide-50 detector. Excluded limits on the UHDM-nucleon scattering cross section for dark nucleon masses of $m\\_χ= 10, 50, 100, 500 \\, \\mathrm{GeV/c^2}$ are presented.\n\n", "2602.09274": "2026-02-09, **Are carbon deflagration supernovae triggered by dark matter ?**, Jeremy Mould et.al., [2602.09274v1](http://arxiv.org/abs/2602.09274v1)\n\n Collisions between stellar remnants and dark matter in the Galactic bulge are frequent, and the kinetic energy of a primordial black hole incident on a white dwarf, if it is all thermalized, will raise the degenerate core's temperature, by at least a degree in the case of a lunar mass black hole. This is an underestimate in two ways: the specific heat is less than 3k/2 per particle, and the incoming object is accelerated by gravitational focusing. Detailed physical models have recently been made of this triggering event. Present observational data are equivocal as to whether the radial distribution of type Ia supernovae in galaxies follows the starlight in the galaxies, or is more concentrated towards the center, as collisional triggering would suggest. But future samples of millions of supernovae from the Rubin telescope will change that.\n\n", "2602.09249": "2026-02-09, **Towards a general field equation for galaxies and galaxy clusters**, Albert Raymond Penner et.al., [2602.09249v1](http://arxiv.org/abs/2602.09249v1)\n\n The MONDian theory of AQUAL (AQUAdratic Lagrangian) and the theory of GRAS (GRavitational Anti-Screening) are alternatives to the theory of dark matter. When these theories are applied to galaxy dynamics they are in excellent agreement with observations including the galactic RAR (Radial Acceleration Relationship). However, when applied to galaxy clusters they do not explain the bulk of the missing mass. This manuscript develops a modified version of the GRAS/AQUAL field equation that can be extended to galaxy clusters. It involves just a single free parameter. The new field equation is then applied to a sample of galaxy clusters and checked against modeled galaxies and solar system constraints. Further to this, the modified field equation leads to an understanding of the difference between the galactic RAR and the RAR recently found for clusters.\n\n", "2602.09244": "2026-02-09, **Temperature of a spinning black hole via a simple derivation**, Ronald J. Adler et.al., [2602.09244v1](http://arxiv.org/abs/2602.09244v1)\n\n According to current theory a black hole has a nonzero temperature and thus radiates like any black body. This remarkable result was first shown by Hawking for a non-spinning black hole using general relativity to describe the black hole gravitational field and quantum field theory to describe the radiation. Since then the temperature of a spinning Kerr black hole has been calculated. There have also been many heuristic derivations for the temperature. In this work we derive the temperature of a Kerr spinning black hole using only classical general relativity and thermodynamics. It is very similar to Ref. 11 but is mathematically simpler and more self-contained. Our purpose is mainly pedagogical, to be more accessible to students and non-specialists with a knowledge of general relativity. We also call further attention to the expected explosive evaporation of small black holes, not yet observed, which would be an almost unique window into Planck scale physics. Finally, we discuss the idea that the cosmological dark matter, whose nature is currently unknown, may be composed of small primordial black hole remnants.\n\n", "2602.09221": "2026-02-09, **On the structure of interactions of mass dimension one fermions: a functional renormalization group perspective**, Gustavo P. de Brito et.al., [2602.09221v1](http://arxiv.org/abs/2602.09221v1)\n\n In this paper, we provide the first systematic investigation of renormalization group properties of mass dimension one fermions described by ELKO spinors. By construction, ELKOs must be neutral under any Standard Model charge, therefore, providing a natural candidate for dark matter. We consider two versions of scalar-ELKO systems: the first characterized by a derivative Yukawa-like interaction, while the second involves ELKO four-fermion interactions as well as a scalar-ELKO portal. We also considered a system composed of ELKOs interacting with an Abelian gauge field via Pauli-like term. In all cases, we identified the minimal set of interactions that are required by a consistent renormalization group flow, and we discussed the possibility of constructing UV-complete trajectories based on asymptotic freedom. We used the functional renormalization group as a method of investigation.\n\n", "2602.09187": "2026-02-09, **pMSSM versus complete models and the excellent prospects for top-squark discovery at HL-LHC**, Howard Baer et.al., [2602.09187v1](http://arxiv.org/abs/2602.09187v1)\n\n LHC sparticle search limits are usually performed within the context of simplified models and subsequently interpreted within the 19 parameter phenomenological MSSM (pMSSM) as to how many models avoid search limits for a particular sparticle mass, often including WIMP dark matter constraints. We provide a critical discussion of this procedure and how it can go wrong due to the introduction of new prejudices. By ameliorating these conditions, one is pushed into the more plausible four extra parameter non-universal Higgs model (NUHM4). Implementing a decoupling/quasi-degeneracy solution to the SUSY flavor and CP problems leads to first/second generation sfermions in the tens-of-TeV range. In this case, the natural solutions typically contain top-squarks in the 1-2 TeV range which are accessible to high-lumi LHC (HL-LHC) searches. This search channel, along with higgsino and wino pair production, may allow a nearly complete scan of natural/plausible parameter space by HL-LHC.\n\n", "2602.09168": "2026-02-09, **Optical Signatures of a Schwarzschild Black Hole in a Dehnen-Type Dark Matter Halo**, Javokhir Sharipov et.al., [2602.09168v1](http://arxiv.org/abs/2602.09168v1)\n\n In this paper, the optical effects that occur near a Schwarzschild-like black hole (BH) with a Dehnen-type $(1,4,2)$ dark matter (DM) halo are explored. We first derive the photon sphere radius and obtain an analytical expression for the deflection angle in the weak-field regime by applying the Gauss-Bonnet theorem (GBT). For the strong-field regime, we perform ray-tracing calculations to examine the behavior of light trajectories and determine the corresponding number of orbits. We further compute the BH shadow and gravitational lensing in a plasma medium and provide constraints arising from the DM halo parameters. We also extend our analysis to weak gravitational lensing within plasma environments, considering both uniform and singular isothermal sphere (SIS) distributions. We find the analytical expressions for the deflection angle in the presence of plasma and examine the resulting effects on image magnification. The overall results highlight how DM halo properties and plasma characteristics jointly alter observable lensing signatures.\n\n", "2602.09141": "2026-02-09, **NIAC project report: Solar system-scale VLBI to dramatically improve cosmological distance measurements**, Matthew McQuinn et.al., [2602.09141v1](http://arxiv.org/abs/2602.09141v1)\n\n We investigate the feasibility and scientific potential of the Cosmic Positioning System (CPS), a space mission concept enabling purely geometric distance measurements to sources at hundreds of megaparsecs by directly detecting electromagnetic wavefront curvature. CPS consists of a constellation of radio antennas distributed across the outer Solar System, operating on baselines of tens of astronomical units. By precisely timing the arrival of repeating fast radio bursts (FRBs), CPS infers source distances via trilateration -- analogous to global navigation satellite systems such as GPS but on cosmological scales.   We show that CPS distance measurements could result in sub-percent constraints on the Hubble constant with even a handful of detections, whereas we predict that 10-100 FRB sources are likely visible. We evaluate dominant sources of uncertainty -- wavefront timing precision, interstellar refractive delays, spacecraft positional knowledge, and onboard clock stability -- finding these controllable at required levels using near-term technologies. Our nominal design employs five spacecraft with 8 m deployable antennas, 3-6 GHz receivers with sub-30 K system temperatures, and space-qualified atomic clocks similar to those on GPS satellites, supported by a ground network for ranging calibration and FRB alerts.   Beyond cosmic expansion, CPS may enable frontier measurements in astrophysics and fundamental physics, including constraints on small-scale dark matter structure, microhertz gravitational waves (bridging pulsar timing arrays and LISA), and the outer Solar System mass distribution. The most significant viability issue concerns FRB properties at several-GHz frequencies; we recommend observational campaigns to characterize repeating FRBs in this band.\n\n", "2602.08981": "2026-02-09, **Cascaded Optomechanical Sensing for Small Signals**, Marta Maria Marchese et.al., [2602.08981v1](http://arxiv.org/abs/2602.08981v1)\n\n We propose a sensing scheme for detecting weak forces that achieves Heisenberg-limited sensitivity without relying on entanglement or other non-classical resources. Our scheme utilizes coherent averaging across a chain of N optomechanical cavities, unidirectionally coupled via a laser beam. As the beam passes through the cavities, it accumulates phase shifts induced by a common external force acting on the mechanical elements. Remarkably, this fully classical approach achieves the sensitivity scaling typically associated with quantum-enhanced protocols, providing a robust and experimentally feasible route to precision sensing. Potential applications range from high-sensitivity gravitational field measurements at the Large Hadron Collider to probing dark matter interactions and detecting gravitational waves. This work opens a new pathway for leveraging coherent light-matter interactions for force sensing.\n\n", "2602.08731": "2026-02-09, **Synchrotron Self-Compton Process for Constraining sub-GeV Dark Matter in Omega Centauri via SKA**, Guan-Sen Wang et.al., [2602.08731v1](http://arxiv.org/abs/2602.08731v1)\n\n The search for the particle identity of dark matter (DM) continues to be a primary objective in modern physics. In this field, the sub-GeV mass range of DM detection remains a crucial yet challenging window. We investigate synchrotron self-Compton (SSC) emission from electrons and positrons produced by MeV-scale DM annihilation as a novel indirect detection channel. Focusing on the globular cluster Omega Centauri and the sensitivity of the Square Kilometre Array, we derive constraints on the annihilation cross section reaching $\\langleσv\\rangle \\sim 10^{-30}\\,\\rm{cm}^{3}\\,\\rm{s}^{-1}$ in the tens-of-MeV range. Furthermore, constraints could even reach below $\\langleσv\\rangle \\sim 10^{-32}\\,\\rm{cm}^{3}\\,\\rm{s}^{-1}$ for extreme parameter choices. Remarkably, even under deliberately conservative astrophysical assumptions, this channel outperforms existing indirect limits, establishing SSC emission as a robust probe of sub-GeV DM.\n\n", "2602.08359": "2026-02-09, **FIMPs in a two-component dark matter model with $Z_2 \\times Z_4$ symmetry**, XinXin Qi et.al., [2602.08359v1](http://arxiv.org/abs/2602.08359v1)\n\n We consider the FIMPs scenario in a two-component dark matter model with $Z\\_2 \\times Z\\_4$ symmetry, where a singlet scalar $S$ and a Majorana fermion $χ$ are introduced as dark matter candidates. We also introduce another singlet scalar $S\\_0$ with a non-zero vacuum expectation value to the SM so that the fermion dark matter can obtain mass after spontaneous symmetry breaking. The model admits six free parameters in the decoupling limit: three masses and three dimensionless parameters. Depending on the mass hierarchies between dark matter particles with half of the new Higgs mass, the DM relic density will be determined by different channels, where $χ$ and $S$ production can be generated individually. We numerically study the relic density as a function of the model's free parameters and determine the regions consistent with the dark matter constraint for four possible cases. Our results show that this scenario is viable over a wide range of couplings and dark matter masses, where the coupling $λ\\_{ds}$ can be as tiny as $\\mathcal{O}(10^{-20})$ level. We stress that even for such tiny couplings, the new Higgs can still play a dominant role in determining dark matter production.\n\n", "2602.08338": "2026-02-09, **Dark Matter from Eternity**, G. Franciolini et.al., [2602.08338v1](http://arxiv.org/abs/2602.08338v1)\n\n We propose that the totality of dark matter in the universe might ascribe its origin to one of the key properties of cosmological inflation, that it may be eternal: regions that at the end of the primordial accelerated expansion of the universe never reheated, but keep eternally inflating, manifest themselves as primordial black holes in our observable universe. This mechanism can provide a primordial black hole abundance which is larger than the standard one due to the gravitational collapse of sizeable overdensities in the radiation phase. It also predicts a broad spectrum for the curvature perturbation and a flat stochastic gravitational wave background at a level of $Ω\\_\\text{GW} h^2 \\simeq 10^{-10}$ up to the mHz.\n\n"}, "supernova": {"2602.10084": "2026-02-10, **Narrow absorption lines from intervening material in supernovae. IV. Type Ia supernovae: Na I D line strength relating to external material and intrinsic properties**, Santiago González-Gaitán et.al., [2602.10084v1](http://arxiv.org/abs/2602.10084v1)\n\n Type Ia supernovae (SNe Ia) are thermonuclear runaways in certain white dwarfs in binary systems. They have been extensively studied, yet their progenitor and explosion mechanisms remain poorly understood. We study a large sample of SNe Ia comparing the narrow interstellar absorption features in their spectra with various photometric and spectroscopic supernova properties, as well as with environmental characteristics. We find that the sodium absorption is significantly stronger in younger, more star-forming and more centrally located SNe Ia, as expected. However, we also show that there is a strong dependence on intrinsic properties that is independent of the environment. In fact, we find strong evidence for two environmental SN Ia populations, an old and a young one, with the young population showing significantly different distributions of sodium strength when divided according to the Si II ejecta velocity, nebular velocity, extinction, E(B-V), and reddening curve, RV. Performing a clustering of the SNe Ia, we recover an old population of SNe with low extinction and normal ejecta velocity, while we confirm that the young population can be subdivided into a group of highly-extincted, high-velocity SNe Ia with much stronger blueshifted sodium absorption, and another of low-extincted, normal-velocity objects with little sodium absorption. We interpret this relation of intervening material with intrinsic properties as evidence for the young SN Ia population, occurring in young and star-forming environments, to have asymmetric radiation that interacts with nearby material, and whose observables depend thus on the viewing angle. Finally, we show that the cosmological mass-step is consistent with these populations.\n\n", "2602.09561": "2026-02-10, **Observational Constraints and Geometric Diagnostics of Barboza-Alcaniz and Logarithmic Dark Energy Parametrizations**, Archana Dixit et.al., [2602.09561v1](http://arxiv.org/abs/2602.09561v1)\n\n This study investigates and compares two prominent two-dimensional dark energy (DE) parameterizations: Barboza-Alcaniz (BA) and Logarithmic forms by comparing them with a comprehensive set of observational data comprising Type Ia Supernovae (SNe Ia) from the Pantheon compilation, Baryon Acoustic Oscillations (DESI BAO), and Cosmic Chronometers (CC). The primary objective was to explore the constraining power and cosmological implications of each parameterization in light of the current data. After formulating the theoretical framework and background equations governing cosmic expansion, we employ Markov Chain Monte Carlo (MCMC) techniques using the emcee Python package to constrain the free parameters of each model. The best-fit values for parameters $ω\\_0$, $ω\\_a$, and $H\\_0$ were extracted for each model using individual and combined datasets. The results include confidence contours at the levels $1σ$ and $2σ$. Our findings demonstrate that both parameterizations are consistent with observational data, with logarithmic parameterization showing slightly better constraints in terms of parameter evolution. Furthermore, we employed a statefinder diagnostic to analyze the geometric behavior of the models, providing an effective distinction between the two DE scenarios. This study contributes to a deeper understanding of DE evolution and its constraints in light of current cosmological data.\n\n", "2602.09377": "2026-02-10, **Orbital Period Changes of Recurrent Nova T Pyxidis Demonstrate that M_ejecta >> 11.3xM_accreted and Is Not a Type Ia Supernova Progenitor**, Bradley E. Schaefer et.al., [2602.09377v1](http://arxiv.org/abs/2602.09377v1)\n\n Recurrent nova (RN) T Pyxidis (T Pyx) has a complex history of mass accreting-onto and ejection-from the white dwarf, with a classical nova eruption around 1866 kick-starting a RN-phase with six RN eruptions from 1890--2011. T Pyx is a primary progenitor candidate for Type Ia supernovae (SNIa). This is chiefly a question of whether the mass accreted by the white dwarf ($M\\_{\\rm accreted}$) is more-or-less than the mass ejected by the nova eruptions ($M\\_{\\rm ejecta}$) over the entire eruption cycle. Prior attempts to measure $M\\_{\\rm ejecta}$ from the traditional methods have a scatter of $>$130$\\times$, so only a new technique can provide a measure of adequate accuracy and reliability. This new technique is the timing experiment of measuring the orbital period from 1986 to 2025, where the period increased by $+$50.3$\\pm$7.9 parts-per-million across the 2011 eruption. With simple and sure physics, the best estimate for the mass ejected by one RN event is $>$2400$\\times$10$^{-7}$ M$\\_{\\odot}$, with an extreme inviolate limit of $\\gg$354$\\times$10$^{-7}$ M$\\_{\\odot}$. Over all eruptions in a cycle, $M\\_{ejecta}$$>$17120$\\times$10$^{-7}$ M$\\_{\\odot}$, with an inviolate limit of $M\\_{ejecta}$$\\gg$2144$\\times$10$^{-7}$ M$\\_{\\odot}$. Over the full eruption cycle, the white dwarf accreted 220$\\times$10$^{-7}$ M$\\_{\\odot}$. So M$\\_{\\rm ejecta}$$\\gg$11.3$\\times$M$\\_{\\rm accreted}$, and T Pyx can never become a SNIa. This paper is the seventh in a series proving that each of various popular candidate SNIa progenitors cannot possibly evolve to a supernova; including V445 Pup, U Sco, T CrB, all symbiotic stars, FQ Cir, V1405 Cas, and now T Pyx.\n\n", "2602.09274": "2026-02-09, **Are carbon deflagration supernovae triggered by dark matter ?**, Jeremy Mould et.al., [2602.09274v1](http://arxiv.org/abs/2602.09274v1)\n\n Collisions between stellar remnants and dark matter in the Galactic bulge are frequent, and the kinetic energy of a primordial black hole incident on a white dwarf, if it is all thermalized, will raise the degenerate core's temperature, by at least a degree in the case of a lunar mass black hole. This is an underestimate in two ways: the specific heat is less than 3k/2 per particle, and the incoming object is accelerated by gravitational focusing. Detailed physical models have recently been made of this triggering event. Present observational data are equivocal as to whether the radial distribution of type Ia supernovae in galaxies follows the starlight in the galaxies, or is more concentrated towards the center, as collisional triggering would suggest. But future samples of millions of supernovae from the Rubin telescope will change that.\n\n", "2602.09175": "2026-02-09, **A Comparative Study of the Supernova Remnant Cassiopeia A from 2013--2020 Deep [Fe II]+[Si I] Images**, Seung-Hoon Jung et.al., [2602.09175v1](http://arxiv.org/abs/2602.09175v1)\n\n We present a comparative analysis of supernova remnant Cassiopeia A based on two deep, narrow-band images covering the [Fe II] 1.644um + [Si I] 1.645um lines obtained in 2013 and 2020 with the same instruments on the UKIRT 3.8m telescope. The identical setup and observing procedure allow for direct, accurate measurements of morphological and kinematic changes over a seven-year baseline. We identified 263 compact knots in the 2020 image and, through comparison with the 2013 catalog of Koo et al. 2018 (arXiv:1809.07935), classified them into quasi-stationary circumstellar knots and fast-moving knots (FMKs) of supernova ejecta. The FMKs show significant flux fluctuations, and many of those detected in 2013 are absent in the 2020 image. Proper-motion measurements derived from cross-correlation analysis indicate that most FMKs follow nearly ballistic expansion, whereas some, particularly those just beyond the eastern Fe-rich, X-ray emitting ejecta region, exhibit noticeable deceleration. The proper motions of the main ejecta shell were also measured and modeled as a uniformly expanding shell with a systemic motion, which reproduces the observed geometric and kinematic asymmetries of the remnant.\n\n", "2602.09104": "2026-02-09, **Black Hole Feedback, Galaxy Quenching and Outflows at Cosmic Dawn: Analysis of the SEEDZ Simulations**, Lewis R. Prole et.al., [2602.09104v1](http://arxiv.org/abs/2602.09104v1)\n\n Here we analyse the growth and feedback effects of massive black holes (MBHs) in the SEEDZ simulations. The most massive black holes grow to masses of $\\sim10^{6}$ M$\\_\\odot$ by $z=12.5$ during short bursts of super-Eddington accretion, sustained over a period of 5-30 Myr. We find that the determining factor that cuts off this initial growth is feedback from the MBH itself, rather than nearby supernovae or exhausting the available gas reservoir. Our simulations show that for the most actively accreting MBHs, feedback completely evacuates the gas from the host halo and ejects it into the inter-galactic medium. Despite implementing a relatively weak feedback model, the energy injected into the gas surrounding the MBH exceeds the binding energy of the halo. These results either indicate that MBH feedback in the early ($Λ$CDM) Universe is much weaker than previously assumed, or that at least some of the high redshift galaxies we currently observe with JWST formed via a two-step process, whereby a MBH initially quenches its host galaxy and later reconstitutes its baryonic reservoir, either through mergers with gas rich galaxies or from accretion from the cosmic web. Moreover, the maximum black hole masses that emerge in SEEDZ are effectively set by a combination of MBH feedback modelling and the binding potential of the host halo. Unless feedback is extremely ineffective at early times (for example if growth is merger dominated rather than accretion dominated or feedback is contained close to the MBH) then the maximum mass of black holes at redshift before 12.5 should not significantly exceed $10^6$ M$\\_\\odot$.\n\n", "2602.09094": "2026-02-09, **Downsizing does not extend to dwarf galaxies: identifying the stellar mass regimes shaped by supernova and AGN feedback**, Ilin Lazar et.al., [2602.09094v1](http://arxiv.org/abs/2602.09094v1)\n\n We explore how the fraction of red (quenched) galaxies varies in the dwarf galaxy regime (10^7 MSun < Mstar < 10^9.5 MSun), using a mass-complete sample of ~5900 dwarfs at z<0.15, constructed using deep multi-wavelength data in the COSMOS field. The red fraction decreases steadily until Mstar ~ 10^8.5 MSun and then increases again towards lower stellar masses. This 'U' shape demonstrates that the traditional notion of 'downsizing' (i.e. that progressively lower mass galaxies maintain star formation until later epochs) is incorrect -- downsizing does not continue uninterrupted into the dwarf regime. The U shape persists regardless of environment, indicating that it is driven by internal processes rather than external environment-driven mechanisms. Our results suggest that, at Mstar < 10^8 MSun, the quenching of star formation is dominated by supernova (SN) feedback and becomes more effective with decreasing stellar mass, as the potential well becomes shallower. At Mstar > 10^9 MSun, the quenching is driven by a mix of SN feedback and AGN feedback (which becomes more effective with increasing stellar mass, as central black holes become more massive). The processes that quench star formation are least effective in the range 10^8 MSun < Mstar < 10^9 MSun, likely because the potential well is deep enough to weaken the impact of SN feedback, while the effect of AGN feedback is still insignificant. The cosmological simulations tested here do not match the details of how the red fraction varies as a function of stellar mass -- we propose that the red fraction vs stellar mass relation (particularly in the dwarf regime) is a powerful calibrator for the processes that regulate star formation in galaxy formation models.\n\n", "2602.09096": "2026-02-09, **A Faint Progenitor System for the Faint Supernova 2024vjm**, Erez A. Zimmerman et.al., [2602.09096v1](http://arxiv.org/abs/2602.09096v1)\n\n Type Ia Supernovae (SNe Ia) are well known for their role as standardizable cosmological candles. Their uniformity is credited to their single origin as thermonuclear explosions of White dwarf (WD) stars. Nevertheless, some SNe Ia break this regularity. Prominently, the Iax subclass are less energetic and remarkably diverse, raising questions about their progenitor systems. While no progenitor system of a normal SN Ia has ever been detected, a luminous blue star was identified in pre-explosion images of the site of the bright SN Iax SN 2012Z, suggested to be a helium giant companion star acting as a mass donor to a WD SN progenitor. This is in line with models of weak mass accretion of a WD from a binary companion, producing an explosion that does not fully disrupt the star. However, these models fail to explain the properties of the faintest Type Iax explosions, suggesting either they originate from other WD binary systems, or even from massive progenitor stars. Here, we present the faint SN Iax SN 2024vjm - possibly the faintest supernova observed to date. Using a deep pre-explosion image taken by the recently launched Euclid space mission, we show that its progenitor system must be fainter than the helium giant SN Iax progenitor candidate of SN 2012Z, as well as that of the luminous red companion or remnant of the faint SN 2008ha, and may require a subdwarf helium star as a mass donor. The deep image also provides strong arguments against a massive star origin for this faint supernova. Our observations argue that SN 2024vjm is a WD explosion, but we find that remarkably faint SNe Iax fade more slowly than bright ones, i.e., they evolve in an opposite manner from the famous Phillips relation that makes regular SNe Ia cosmological candles.\n\n", "2602.08928": "2026-02-09, **Hints of sign-changing scalar field energy density and a transient acceleration phase at $z\\sim 2$ from model-agnostic reconstructions**, Özgür Akarsu et.al., [2602.08928v1](http://arxiv.org/abs/2602.08928v1)\n\n We present a data-driven reconstruction of the late-time expansion history and its implications for dark-energy dynamics. Modeling the reduced Hubble rate with a node-based Gaussian-process-kernel interpolant, we constrain the reconstruction using CC, Pantheon+ SNIa, BAO data from SDSS and DESI, transversal BAO data, and external $H\\_0$ priors (SH0ES and H0DN). Assuming GR at the background level, we map the reconstructed kinematics onto a dark-energy fluid and a scalar-field description, yielding the total potential and kinetic contributions that reproduce the inferred $H(z)$. To interpret the reconstruction, we consider both a minimal single-field model (canonical or phantom) and a two-field (quintom) system consisting of one canonical and one phantom scalar field (or families). Within the GR-based effective-fluid mapping, the inferred dark-energy density changes sign for all dataset combinations explored, transitioning from $ρ\\_{\\rm DE}<0$ at higher redshift to $ρ\\_{\\rm DE}>0$ toward the present, and defining a transition redshift $z\\_\\dagger$ by $ρ\\_{\\rm DE}(z\\_\\dagger)=0$. A single canonical scalar cannot realize such a smooth evolution during expansion, whereas a phantom field or a two-field quintom framework can accommodate the required behavior; in particular, the two-field system permits smooth phantom-divide crossings at finite $ρ\\_{\\rm DE}>0$ and distinguishes them from the separate notion of a density zero crossing. The reconstructed kinematics admit intermediate-redshift structure in some combinations, including hints of an additional accelerated-expansion interval around $z\\sim 1.7$--$2.3$. The present-day equation of state remains close to a cosmological constant: combinations including supernovae give $w\\_0\\simeq -1$, while combinations without supernovae but with an external $H\\_0$ prior show only a mild preference for $w\\_0<-1$ at the $\\sim1.5$--$1.7σ$ level.\n\n", "2602.08756": "2026-02-09, **An unusual pair of interstellar HI features and a related white dwarf star inside the HI cavity surrounding the Upper Sco-Cen OB2 Association**, Gerrit L. Verschuur et.al., [2602.08756v1](http://arxiv.org/abs/2602.08756v1)\n\n Two mysterious unresolved HI structures at velocities of +12 and -6 km/s were discovered in high resolution 21-cm survey data in the direction of a faint white dwarf star. Examination of the HI morphology in this area of sky shows that the star and HI features exists in a large cavity in interstellar HI surrounding the Upper Sco-Cen OB2 Association. The cavity may have been created by an ancient supernova. It is hypothesized that the pair of HI features and filamentary HI structure found in its immediate vicinity may be the remnants of a planetary nebula some 3 x 10^5 years old that have cooled to the point that the gas is neutral and emitting the 21-cm spectral line. This remnant has maintained the morphological characteristics of the original planetary nebula because it expanded into a volume of space relatively devoid of interstellar gas that would otherwise have absorbed any traces of the original nebula.\n\n", "2602.08424": "2026-02-09, **Kosmulator: A Python framework for cosmological inference with MCMC**, Renier T. Hough et.al., [2602.08424v1](http://arxiv.org/abs/2602.08424v1)\n\n We present Kosmulator, a modular and vectorised Python framework designed to accelerate the statistical testing of cosmological models. As the theoretical landscape expands beyond standard $Λ$CDM, implementing new expansion histories into traditional Einstein--Boltzmann solvers becomes a significant computational bottleneck. Kosmulator addresses this by leveraging array-native execution and efficient ensemble slice sampling (via Zeus) to perform rapid Bayesian inference. We validate the framework against the industry-standard Cobaya code using a combination of Type Ia Supernovae, Cosmic Chronometers, and Baryon Acoustic Oscillation (BAO) data. Our results demonstrate that Kosmulator reproduces Cobaya's posterior constraints to within $\\leq0.3σ$ statistical agreement on $H\\_{0}$ and $Ω\\_{m}$ and $<0.6\\%$ precision on $χ^{2}$, while achieving a $\\sim 4.5\\times$ reduction in wall-clock time on a single CPU core compared to a standard MPI-parallelised baseline. Furthermore, we showcase the framework's utility by constraining the implicit power-law $f(Q)$ \"$f\\_1$CDM\" model and demonstrating its automated model selection capabilities (AIC/BIC). Kosmulator is introduced as a \"scientific sieve\" for rapid hypothesis testing, allowing researchers to efficiently filter theoretical candidates before deploying high-precision resources.\n\n", "2602.08223": "2026-02-09, **A Minimal Interpretation of the Galactic Cosmic-Ray Spectrum from GeV to PeV Energies**, Felix Aharonian et.al., [2602.08223v1](http://arxiv.org/abs/2602.08223v1)\n\n High-precision measurements of the cosmic-ray (CR) proton spectrum have revealed significant deviations from a simple power-law behaviour. These deviations are characterised by three prominent features: (i) a progressive spectral hardening above approximately 200 GeV, (ii) an excess between 10 and 30 TeV (the ``multi-TeV bump''), followed by a sharp turnover around 100 TeV, and (iii) a pronounced structure between 0.1 and 10 PeV (the ``PeV bump''). We propose a minimal two cosmic-ray population framework that consistently accounts for the observed CR proton spectrum across six decades in energy, from GeV to PeV. In this scenario, the spectral complexity arises naturally from a transition between two Galactic CR proton populations in the 10-100 TeV energy range. The low-energy population exhibits a sharp cutoff at tens of TeV, while a second, higher-energy population emerges and dominates above 100 TeV, terminating with a smooth exponential cutoff at approximately 6.5 PeV. This framework reproduces all observed spectral features without invoking contributions from nearby sources or requiring non-standard assumptions about particle acceleration or propagation. Recent gamma-ray observations of supernova remnants, star-forming regions, and microquasars provide plausible astrophysical candidates for the origin of the two CR components.\n\n"}}