{"neutrino": {"2307.16793": "2023-07-31, **Equilibration of quantum many-body fast neutrino flavor oscillations**, Joshua D. Martin et.al., [2307.16793v1](http://arxiv.org/abs/2307.16793v1)\n\n In hot and dense astrophysical environments, neutrinos are emitted in such numbers that their flavor content is expected to have an appreciable effect on the local system's dynamic and chemical evolution. In this work, we consider such a gas in the regime for which neutrino-neutrino coherent forward scattering dominates the flavor evolution. We show evidence that the generic potential induced by this effect is non-integrable and that the statistics of its energy level spaces are in good agreement with the Wigner surmise. We also find that individual neutrinos rapidly entangle with all of the others present which results in an equilibration of the flavor content of individual neutrinos. We show that the average neutrino flavor content can be predicted utilizing a thermodynamic partition function. A random phase approximation to the evolution gives a simple picture of this equilibration. In the case of neutrinos and antineutrinos, processes like $\\nu\\_e {\\bar{\\nu}}\\_e \\leftrightarrows \\nu\\_\\mu {\\bar{\\nu}\\_\\mu} $ yield a rapid equilibrium satisfying $n( \\nu\\_e) n({\\bar \\nu}\\_e) = n( \\nu\\_\\mu) n({\\bar \\nu}\\_\\mu) = n( \\nu\\_\\tau) n({\\bar \\nu}\\_\\tau)$ in addition to the standard lepton number conservation in regimes where off-diagonal vacuum oscillations are small compared to $\\nu-\\nu$ interactions.\n\n", "2307.16698": "2023-07-31, **Estimating at Earth the Ultra-High Energy Neutrino Flux from the Accretion Disks in the Galactic Core**, Ayshea Bains et.al., [2307.16698v1](http://arxiv.org/abs/2307.16698v1)\n\n This research is to determine at Earth the high-energy neutrino flux coming from the galactic core, and from the many other accretion disks within the galactic core. It is estimated there are 10,000 such accretion disk within the cubic parsec of the galactic core alone and many more in the galactic core halo. There are various neutrino detectors, such as IceCube, which can detect energetic neutrinos. However, the direct galactic core neutrino flux is exceptionally low, so very few neutrinos from the galactic core are measured. We created two models to simulate the galactic core neutrino flux. To better estimate the neutrino flux we randomly distributed the accretion disks and generated bodies of varying sizes. This was then used to determine the ultra-high energy neutrino flux. Since it is extremely difficult to determine neutrino direction from interactions of neutrinos, we envision an application where the energetic galactic core neutrinos are gravitationally focused by the Sun with a large light collecting power of eleven to twelve orders of magnitude. They could interact in a planet's atmosphere where the produced showers containing energetic charged particles can produce Cherenkov rings imageable by an orbiting spacecraft or upward going muons which can be observed in a cosmic ray experiment. Estimating the flux will provide a general approximation of the number of ultra-high energy neutrinos that should reach Earth, with Earth being the overall detector. Moreover, studying the neutrinos will provide more information on the conditions of the galactic region, and allow characterizations of it to be formed.\n\n", "2307.16667": "2023-07-31, **Two Candidate Obscured Tidal Disruption Events Coincident with High-Energy Neutrinos**, Ning Jiang et.al., [2307.16667v1](http://arxiv.org/abs/2307.16667v1)\n\n Recently, three optical tidal disruption event (TDE) candidates discovered by the Zwicky Transient Facility (ZTF) have been suggested to be coincident with high-energy neutrinos. They all exhibit unusually strong dust infrared (IR) echoes, with their peak times matching the neutrino arrival time even better than the optical peaks. We hereby report on two new TDE candidates that are spatially and temporally coincident with neutrinos by matching our sample of mid-infrared outbursts in nearby galaxies (MIRONG) with Gold alerts of IceCube high-energy neutrino events up to June 2022. The two candidates show negligible optical variability according to their ZTF light curves and can therefore be classified as part of the growing population of obscured TDE candidates. The chance probability of finding two such candidates about $\\sim3\\%$ by redistributing the MIRONG sources randomly in the SDSS footprint, which will be as low as $\\sim0.1\\%$ (or $\\sim0.2\\%$) if we limit to sources with increased fluxes (or variability amplitudes) comparable with the matched two sources. Our findings further support the potential connection between high-energy neutrinos and TDEs in dusty environments by increasing the total number of neutrino-associated TDE and TDE candidates to five, although the underlying physics remains poorly understood.\n\n", "2307.16569": "2023-07-31, **The intelligent Photomultiplier Tubes for OSIRIS**, Feng Gao et.al., [2307.16569v1](http://arxiv.org/abs/2307.16569v1)\n\n The dimensions of liquid scintillator neutrino detectors have grown over the years. Thus, the analog cable length required for the readout increases. In consequence, the signal loss increases as well. With the intelligent Photomultiplier Tube this problem can be solved. The digitiser is moved as close as possible to the Photomultiplier Tube. This concept allows nearly lossless digitisation of the analog signal. Furthermore, a computing unit next to the analog-to-digital converter enables implementation of on-the-fly data processing and control algorithms. This paper presents the detailed concept and the performance of the intelligent Photomultiplier Tube.\n\n", "2307.16547": "2023-07-31, **On the 'Loose' Constraint from IceCube Neutrino Non-Detection of GRB 230307A**, Xin-Ying Song et.al., [2307.16547v1](http://arxiv.org/abs/2307.16547v1)\n\n The recent extremely bright GRB 230307A from a binary neutron star merger may offer a good probe for the production of GRB-neutrinos. Within the constraint from IceCube neutrino non-detection, the limitations for key physical parameters of this burst are extracted in different scenarios including the fireball, Poynting-flux-dominated (PFD) and hybrid jet. Different from the former nearby `monsters' and due to its smaller isotropic equivalent radiated energy ($E\\_{\\gamma,\\rm iso}\\sim4\\times10^{52}$ erg), the constraint seems loose if non-thermal neutrinos produced from photomeson interactions are the only consideration. However, a quasi-thermal neutrino emission from hadronuclear processes is constrained in this neutron-rich post-merger environment, and the upper limit of the allowed nucleon loading factor is about a few. Based on this, a discussion is presented on the possible prompt emission mechanism and jet composition for GRB 230307A in the context of multi-messenger astrophysics.\n\n", "2307.16480": "2023-07-31, **R-parity Conserving Minimal SUSY U(1)$_{X}$ Model**, Satsuki Oda et.al., [2307.16480v1](http://arxiv.org/abs/2307.16480v1)\n\n We propose a minimal gauged U(1)$\\_X$ extension of the MSSM with R-parity conservation. In this model, U(1)$\\_X$ is a generalization of the well-known U(1) $B-L$. Apart from the MSSM particle content, the model includes three right-handed neutrino (RHN) chiral superfields, each carrying a unit U(1)$\\_X$ charge. In the presence of RHNs, the model is free from all gauge and mixed gauge-gravitational anomalies. However, there are no U(1)$\\_X$ Higgs chiral superfields with U(1)$\\_X$ charge $\\pm2$ involved in the model. Two of the RHN superfields are assigned an odd R-parity, while the last one ($\\Psi$) has an even parity. The U(1)$\\_X$ symmetry is radiatively broken by the VEV of the scalar component of $\\Psi$. As a consequence of the absence of U(1)$\\_X$ Higgs fields and the novel R-parity assignment, the three light neutrinos consist of one massless neutrino and two Dirac neutrinos. In the early universe, the right-handed components of the Dirac neutrinos are in thermal equilibrium with the SM particles through the U(1)$\\_X$ gauge ($Z^\\prime$) boson. The extra energy density from the RHNs is constrained to avoid disrupting the success of BBN, leading to a lower bound on the scale of U(1)$\\_X$ symmetry breaking. In our model, a mixture of the U(1)$\\_X$ gaugino and the fermionic component of $\\Psi$ becomes a new dark matter (DM) candidate if it is the lightest sparticle mass eigenstate. We examine this DM phenomenology and identify a parameter region that reproduces the observed DM relic density. Furthermore, we consider constraints from the search for $Z'$ boson resonance at the LHC. The three constraints obtained from the success of BBN, the observed DM relic density, and the $Z^\\prime$ resonance search at the LHC complement each other, narrowing down the allowed parameter region.\n\n", "2307.16470": "2023-07-31, **Predictions of $m_{ee}$ and neutrino mass from a consistent Froggatt-Nielsen model**, Yu-Cheng Qiu et.al., [2307.16470v1](http://arxiv.org/abs/2307.16470v1)\n\n The seesaw mechanism is the most attractive mechanism to explain the small neutrino masses, which predicts the neutrinoless double beta decay ($0\\nu\\beta\\beta$) of the nucleus. Thus the discovery of $0\\nu\\beta\\beta$ is extremely important for future particle physics. However, the present data on the neutrino oscillation is not sufficient to predict the value of $m\\_{ee}$ as well as the neutrino mass $m\\_\\nu^i$. In this short article, by adopting a simple and consistent Froggatt-Nielsen model, which can well explain the observed masses and mixing angles of quark and lepton sectors, we calculate the distribution of $m\\_{ee}$ and $m\\_\\nu^i$. Interestingly, a relatively large part of the preferred parameter space can be detected in the near future.\n\n", "2307.16432": "2023-07-31, **Prometheus: An Open-Source Neutrino Telescope Simulation**, David Kim et.al., [2307.16432v1](http://arxiv.org/abs/2307.16432v1)\n\n The soon-to-be-realized, global network of neutrino telescopes will allow new opportunities for collaboration between detectors. While each detector is distinct, they share the same underlying physical processes and detection principles. The full simulation chain for these telescopes is typically proprietary which limits the opportunity for joint studies. This means there is no consistent framework for simulating multiple detectors. To overcome these challenges, we introduce Prometheus, an open-source simulation tool for neutrino telescopes. Prometheus simulates neutrino injection and final state and photon propagation in both ice and water. It also supports user-supplied injection and detector specifications. In this contribution, we will introduce the software; show its runtime performance; and highlight successes in reproducing simulation results from multiple ice- and water-based observatories.\n\n", "2307.16373": "2023-07-31, **2D Convolutional Neural Network for Event Reconstruction in IceCube DeepCore**, J. H. Peterson et.al., [2307.16373v1](http://arxiv.org/abs/2307.16373v1)\n\n IceCube DeepCore is an extension of the IceCube Neutrino Observatory designed to measure GeV scale atmospheric neutrino interactions for the purpose of neutrino oscillation studies. Distinguishing muon neutrinos from other flavors and reconstructing inelasticity are especially difficult tasks at GeV scale energies in IceCube DeepCore due to sparse instrumentation. Convolutional neural networks (CNNs) have been found to have better success at neutrino event reconstruction than conventional likelihood-based methods. In this contribution, we present a new CNN model that exploits time and depth translational symmetry in IceCube DeepCore data and present the model's performance, specifically for flavor identification and inelasticity reconstruction.\n\n", "2307.16354": "2023-07-31, **IceCube search for neutrinos from GRB 221009A**, Karlijn Kruiswijk et.al., [2307.16354v1](http://arxiv.org/abs/2307.16354v1)\n\n GRB 221009A is the brightest Gamma Ray Burst (GRB) ever observed. The observed extremely high flux of high and very-high-energy photons provide a unique opportunity to probe the predicted neutrino counterpart to the electromagnetic emission. We have used a variety of methods to search for neutrinos in coincidence with the GRB over several time windows during the precursor, prompt and afterglow phases of the GRB. MeV scale neutrinos are studied using photo-multiplier rate scalers which are normally used to search for galactic core-collapse supernovae neutrinos. GeV neutrinos are searched starting with DeepCore triggers. These events don't have directional localization, but instead can indicate an excess in the rate of events. 10 GeV - 1 TeV and >TeV neutrinos are searched using traditional neutrino point source methods which take into account the direction and time of events with DeepCore and the entire IceCube detector respectively. The >TeV results include both a fast-response analysis conducted by IceCube in real-time with time windows of T$\\_0 - 1$ to T$\\_0 + 2$ hours and T$\\_0 \\pm 1$ day around the time of GRB 221009A, as well as an offline analysis with 3 new time windows up to a time window of T$\\_0 - 1$ to T$\\_0 + 14$ days, the longest time period we consider. The combination of observations by IceCube covers 9 orders of magnitude in neutrino energy, from MeV to PeV, placing upper limits across the range for predicted neutrino emission.\n\n", "2307.16286": "2023-07-30, **Cosmic Birefringence as a probe of dark matter nature: Sterile neutrino and dipolar dark matter**, Jafar Khodagholizadeh et.al., [2307.16286v1](http://arxiv.org/abs/2307.16286v1)\n\n Recently, non-zero rotation angle $\\beta=0.30^\\circ\\pm0.11^\\circ$ $(68\\%\\text{ C.L.})$ [Phys. Rev. Lett. \\textbf{128}, no.9, 091302 (2022)] has been reported for linear polarization of cosmic microwave background (CMB) radiation, which is known as cosmic birefringence (CB). We used this birefringence angle of CMB to study and distinguish different candidates of dark matter (DM), e.g., dipolar and sterile neutrino DM. We calculated CMB forward scattering by those probable candidates of DM to generate $\\beta$ in the presence of primordial scalar fluctuations' background. We explicitly plotted bounds on the mass and electromagnetic coupling for different sectors of DM, sterile neutrino, and dipolar DM, and compared them with other experimental bounds. Regarding dipolar DM, our calculations put a bound on the Majorana magnetic dipole moment about $\\mathcal{M}\\leqslant 1.4\\times10^{-14}\\,\\frac{\\beta}{0.30^\\circ}\\sqrt{\\frac{m\\_{\\text{\\tiny{DM}}}}{1\\,GeV}}\\, e.\\text{\\,cm}$. In the case of sterile neutrino DM, the bound on the mass and mixing angle was estimated at $\\theta^2 \\leqslant 3.3\\,(rad)^2\\frac{\\beta}{0.30^\\circ}\\,\\frac{m\\_{DM}}{\\rm{KeV}} $, which can be a new constraint for sterile neutrino DM whose production mechanism is motivated by models with a hidden sector coupled to the sterile neutrino. Based on our results, if the constraint on the mass and the electromagnetic coupling for DM must be within the allowed region, none of the considered candidates can compensate for all the observed CB angles. We also discussed the maximum contribution of the CB angle via CMB forward scattering by different sectors of the dark matter.\n\n", "2307.16276": "2023-07-30, **Precise determination of $^{210}$Pb $β$ Decay Spectrum at 0 keV and its Implication to Theoretical Calculations**, Shuo Zhang et.al., [2307.16276v1](http://arxiv.org/abs/2307.16276v1)\n\n The atomic exchange effect will lead to a significant increase in the probability density of $\\beta$ decays below a few keV. This effect is very important for scientific experiments that performed by low-energy electron spectroscopy measurements. However, the atomic exchange effect involves multi-electron interactions, especially for a system with 82 electrons such as lead. Different parameters will lead to different trends in the energy spectrum predicted by the theory, so it is urgent to carry out experimental measurements to provide parameter limits for the theory. The probability increase brought about by the atomic exchange effect is most obvious near 0keV, and the $\\beta$ energy spectrum is accurately measured near this energy point, so as to provide constraints for the physical model of atomic exchange. However, it is extremely difficult to measure the $\\beta$ energy spectrum at 0keV due to the limitations of electronic noise and internal conversion effects. The excited decay path of $^{210}$Pb was taken as the observation object,by measuring the total energy spectrum of $\\beta$ rays and cascaded gamma rays, the precise measurement of the $\\beta$ energy spectrum near 0keV has been completed. The analysis of the $\\beta$ energy spectrum of $^{210}$Pb gives the following conclusions. The experimental results first verified the theory that the exchange effect causes the probability increase at the low energy end near 0keV. At the same time, the experimental results are higher than the existing predictions of the atomic exchange effect. At least for Pb element, all the electron shells have played a role in improving the probability density of the low end of the $\\beta$ energy spectrum. This discovery will promote the theoretical calculation of the $\\beta$ energy spectrum of $^{214}$Pb, at the same time, it also indicates that the reactor neutrinos have a higher probability density at the omnipotent end.\n\n", "2307.16249": "2023-07-30, **Prediction of solar flares using neutrino detectors of the second generation**, Oleg Boyarkin et.al., [2307.16249v1](http://arxiv.org/abs/2307.16249v1)\n\n The physics-based method of forecasting the high energy solar flares (SFs) with the help of the neutrino detectors utilizing the coherent elastic neutrino-nucleus scattering (CE$\\nu$NS) is considered. The behavior of the neutrino beams traveling through the coupled sunspots (CSs) being the sources of the future SFs is investigated. Two neutrino beams are included into consideration, namely, the $\\nu\\_{eL}$ beam and the $\\nu\\_{\\mu L}$ beam which have been produced after the passage of the Micheev-Smirnov-Wolfenstein resonance. It is assumed that the neutrinos possess the charge radius, the magnetic and anapole moments while the CS magnetic field is vortex, nonhomogeneous and has twisting. Estimations of the weakening of the neutrino beams after traversing the resonant layers are given. It is demonstrated, that this weakening could be registered by the detectors employing CE$\\nu$NS only when the neutrinos have the Dirac nature.\n\n", "2307.16229": "2023-07-30, **On ultrahigh-energy neutrino-nucleon deep-inelastic scattering and the Froissart bound**, A. V. Kotikov et.al., [2307.16229v1](http://arxiv.org/abs/2307.16229v1)\n\n A brief review of the results for the total cross section \\sigma^{\\nu N} of ultrahigh-energy neutrino deep inelastic scattering on isoscalar nuclear targets is presented. These results are based on simple approximations for \\sigma^{\\nu N} and are compared with the experimental data of the IceCube Collaboration. The total cross section \\sigma^{\\nu N} is proportional to the structure function F\\_2^{\\nu N}(M\\_V^2/s,M\\_V^2), where M\\_V is the intermediate boson mass and s is square of the energy of the center of mass. The coefficient in the front of F\\_2^{\\nu N}(M\\_V^2/s,M\\_V^2) depends on the asymptotic behavior of F\\_2^{\\nu N} at low values of x. It contains an additional term \\sim \\ln{s} if F\\_2^{\\nu N} is scaled by the power \\ln(1/x). Therefore, the asymptotic behavior of F\\_2^{\\nu N}\\propto\\ln^2(1/x) for small x often assumed in the literature already leads to violation of the Froissart bound for \\sigma^{\\nu N}.\n\n", "2307.16190": "2023-07-30, **Probing neutrino emission at GeV energies from astrophysical transient events with the IceCube Neutrino Observatory**, Karlijn Kruiswijk et.al., [2307.16190v1](http://arxiv.org/abs/2307.16190v1)\n\n Astrophysical transient events like Gamma Ray Bursts (GRBs) have always been promising candidates for multi-messenger astronomy, with electromagnetic and gravitational wave signals having already been observed in GRBs such as GRB 170817A. The neutrino signatures of these bursts have been long-awaited as well, with many models predicting different spectra. Most of these searches have been in the hundreds of GeV to PeV range. However, as different models indicate a possible lower energy neutrino signal, we intend to expand this search to the lowest limits of IceCube (0.5-5 GeV) as well. With the plan to look at more transient events, we present the result of the first IceCube search for < 5 GeV astrophysical neutrinos emitted from a GRB, for GRB 221009A; the brightest GRB ever observed. Furthermore, we present plans to improve the observations of < 5 GeV neutrinos in IceCube, with which we plan to probe more transient events in the future. These improvements include the addition of direction reconstruction at these energies, and optimization of the noise rejection. With these improvements, GRB 221009A is just the start of the low-energy neutrino search from transient events with IceCube.\n\n", "2307.16111": "2023-07-30, **Doubly-charged scalars of the Minimal Left-Right Symmetric Model at Muon Colliders**, Mohamed Belfkir et.al., [2307.16111v1](http://arxiv.org/abs/2307.16111v1)\n\n We investigate the prospects of probing the doubly-charged scalars of the minimal Left-Right Symmetric model (MLRSM) at a muon collider. We assess its capability by studying the production of doubly-charged scalars and their subsequent decay into four charged lepton final states containing the same-charge lepton pairs. We find that the channels with same-charge electron and muon pairs, i.e., ($e^{\\pm}e^{\\pm}\\mu^{\\mp}\\mu^{\\mp}$ and its charge conjugated pairs), have the largest sensitivity due to the lowest Standard Model background. Besides, we show that the possibility of using fully polarized initial muon beams in the muon collider can enhance the detection sensitivity of doubly-charged scalars of the MLRSM. Furthermore, we show that one can put exclusion limits on the magnitudes of triplet Yukawa couplings that are directly related to the neutrino sector of the MLRSM for the mass range $1.1-5$ TeV of the doubly-charged scalars.\n\n"}, "dark matter": {"2307.16733": "2023-07-31, **Painting baryons onto N-body simulations of galaxy clusters with image-to-image deep learning**, Urmila Chadayammuri et.al., [2307.16733v1](http://arxiv.org/abs/2307.16733v1)\n\n Galaxy cluster mass functions are a function of cosmology, but mass is not a direct observable, and systematic errors abound in all its observable proxies. Mass-free inference can bypass this challenge, but it requires large suites of simulations spanning a range of cosmologies and models for directly observable quantities. In this work, we devise a U-net - an image-to-image machine learning algorithm - to ``paint'' the IllustrisTNG model of baryons onto dark-matter-only simulations of galaxy clusters. Using 761 galaxy clusters with $M\\_{200c} \\gtrsim 10^{14}M\\_\\odot$ from the TNG-300 simulation at $z<1$, we train the algorithm to read in maps of projected dark matter mass and output maps of projected gas density, temperature, and X-ray flux. The models train in under an hour on two GPUs, and then predict baryonic images for $\\sim2700$ dark matter maps drawn from the TNG-300 dark-matter-only (DMO) simulation in under two minutes. Despite being trained on individual images, the model reproduces the true scaling relation and scatter for the $M\\_{DM}-L\\_X$, as well as the distribution functions of the cluster X-ray luminosity and gas mass. For just one decade in cluster mass, the model reproduces three orders of magnitude in $L\\_X$. The model is biased slightly high when using dark matter maps from the DMO simulation, which is known to have ultra-dense clumps that in the FP simulation are smoothed out by baryonic feedback. The model performs well on inputs from TNG-300-2, whose mass resolution is 8 times coarser; further degrading the resolution biases the predicted luminosity function high. We conclude that U-net-based baryon painting is a promising technique to build large simulated cluster catalogs which can be used to improve cluster cosmology by combining existing full-physics and large $N$-body simulations.\n\n", "2307.16437": "2023-07-31, **Deep learning forecasts of cosmic acceleration parameters from DECi-hertz Interferometer Gravitational-wave Observatory**, Meng-Fei Sun et.al., [2307.16437v1](http://arxiv.org/abs/2307.16437v1)\n\n Validating the accelerating expansion of the universe is an important issue for understanding the evolution of the universe. By constraining the cosmic acceleration parameter $X\\_H$, we can discriminate between the $\\Lambda \\mathrm{CDM}$ (cosmological constant plus cold dark matter) model and LTB (the Lema\\^itre-Tolman-Bondi) model. In this paper, we explore the possibility of constraining the cosmic acceleration parameter with the inspiral gravitational waveform of neutron star binaries (NSBs) in the frequency range of 0.1Hz-10Hz, which can be detected by the second-generation space-based gravitational wave detector DECIGO. We use a convolutional neural network (CNN), a long short-term memory (LSTM) network combined with a gated recurrent unit (GRU), and Fisher information matrix to derive constraints on the cosmic acceleration parameter $X\\_H$. Based on the simulated gravitational wave data with a time duration of 1 month, we conclude that CNN can limit the relative error to 14.09%, while LSTM network combined with GRU can limit the relative error to 13.53%. Additionally, using Fisher information matrix for gravitational wave data with a 5-year observation can limit the relative error to 32.94%. Compared with the Fisher information matrix method, deep learning techniques will significantly improve the constraints on the cosmic acceleration parameters at different redshifts. Therefore, DECIGO is expected to provide direct measurements of the acceleration of the universe, by observing the chirp signals of coalescing binary neutron stars.\n\n", "2307.16308": "2023-07-30, **Recent Advances on Inflation**, S. D. Odintsov et.al., [2307.16308v1](http://arxiv.org/abs/2307.16308v1)\n\n We review recent trends on inflationary dynamics in the context of viable modified gravity theories. After providing a general overview of the inflationary paradigm emphasizing on what problems of hot Big Bang theory inflation solves, and a somewhat introductory presentation of single field inflationary theories with minimal and non-minimal couplings, we review how inflation can be realized in terms of several string motivated models of inflation, which involve Gauss-Bonnet couplings of the scalar field, higher order derivatives of the scalar field, and some subclasses of viable Horndeski theories. We also present and analyze inflation in the context of Chern-Simons theories of gravity, including various subcases and generalizations of string corrected modified gravities which also contain Chern-Simons correction terms, with the scalar field being identified with the invisible axion, which is the most viable to date dark matter candidate. We also provide a detailed account of vacuum $f(R)$ gravity inflation, and also inflation in $f(R,\\phi)$ and kinetic-corrected $f(R,\\phi)$ theories of gravity. In the end of the review we discuss the technique for calculating the overall effect of modified gravity on the waveform of the standard general relativistic gravitational wave form.\n\n", "2307.16161": "2023-07-30, **Bose-Einstein Condensation and Black Holes in Dark Matter and Dark Energy**, Kemal Gültekin et.al., [2307.16161v1](http://arxiv.org/abs/2307.16161v1)\n\n The main aim of this study is to reveal curved space and particle physics effects on the formation of Bose-Einstein condensate (BEC) scalar fields in cosmology and around a black hole. Cosmological scalar fields for dark energy and dark matter may be considered as a result of Bose-Einstein condensation. In this regard, our main attention will be devoted to BECs in curved space. By considering the dynamics of a BEC scalar field at a microscopic level, we first study the initial phase of the formation of condensation in cosmology. To this end, we initially introduce an effective Minkowski space formulation that enables considering only the effect of particle physics processes, excluding the effect of gravitational particle production and enabling us to see cosmological evolution more easily. Then, by using this formulation, we study a model with a trilinear coupling that induces the processes. After considering the phase evolution of the produced particles, we find that they evolve towards the formation of a BEC if some specific conditions are satisfied. In principle, the effective Minkowski space formulation introduced in this study can be applied to particle physics processes in any sufficiently smooth spacetime. In this regard, we also analyse if a BEC scalar field is realized in the spacetime around a Reissner - Nordstr\\\"om black hole. We find that the produced particles of particle physics processes are localized in a region around the black hole and have a tendency toward condensation if the emerged particles are much heavier than ingoing particles. We also find that such a configuration is phenomenologically viable only if the scalars and the black hole have dark electric charges. Finally, we consider gravitational collapse around Schwarzschild black holes and form a first step towards a study in future about the effects of gravitational collapse on Bose-Einstein condensation.\n\n"}, "supernova": {"2307.16556": "2023-07-31, **The evolution of relative frequencies of ONe and CO SNe Ia**, A. I. Bogomazov et.al., [2307.16556v1](http://arxiv.org/abs/2307.16556v1)\n\n In this population synthesis work we study a variety of possible origin channels of supernovae type Ia (SNe Ia) Among them mergers of carbon-oxygen (CO) and oxygen-neon (ONe) white dwarfs (WDs) under the influence of gravitational waves are considered as the primary channel of SNe Ia formation. We estimated frequencies of mergers of WDs with different chemical compositions and distributions of masses of merging WDs. We computed the dependence of the ratio of merger frequencies of ONe and CO WDs as primaries in corresponding binaries on time. The scatter of masses of considered sources (up to the factor $1.5-2$) of SNe Ia is important and should be carefully studied with other sophisticated methods from theoretical point of view. Our ``game of parameters'' potentially explains the increased dimming of SNe Ia in the redshift range $z\\approx 0.5-1$ by the changes in the ratio of ONe and CO WDs, i.e., to describe the observed accelerated expansion of the Universe in terms of the evolution of properties of SNe Ia instead of cosmological explanations. This example shows the extreme importance of theoretical studies of problems concerning SNe Ia, because evolutionary scenario and parameter games in nature potentially lead to confusions in their empirical standardization and, therefore, they can influence on cosmological conclusions.\n\n", "2307.16467": "2023-07-31, **Constraints on Cosmological Models with Gamma-Ray Bursts in Cosmology-Independent Way**, Hanbei Xie et.al., [2307.16467v1](http://arxiv.org/abs/2307.16467v1)\n\n In this paper, we present a cosmology-independent method to constrain cosmological models from the latest 221 gamma-ray bursts (GRBs) sample, including 49 GRBs from Fermi catalog with the Amati relation (the $E\\_{\\rm p}$-${E}\\_{\\rm iso}$ correlation), which calibrated by using a Gaussian process from the Pantheon+ type Ia supernovae (SNe Ia) sample. With 182 GRBs at $0.8\\le z\\le8.2$ in the Hubble diagram and the latest observational Hubble data (OHD) by the Markov Chain Monte Carlo (MCMC) method, we obtained $\\Omega\\_{\\rm m}$ = $0.348^{+0.048}\\_{-0.066}$ and $h$ = $0.680^{+0.029}\\_{-0.029}$ for the flat $\\Lambda$CDM model, and $\\Omega\\_{\\rm m}$ = $0.318^{+0.067}\\_{-0.059}$, $h$ = $0.704^{+0.055}\\_{-0.068}$, $w$ = $-1.21^{+0.32}\\_{-0.67}$ for the flat $w$CDM model. These results are consistent with those in which the coefficients of the Amati relation and the cosmological parameters fitted simultaneously.\n\n"}}