{"neutrino": {"2412.18550": "2024-12-24, **Fermion masses and mixings and charged lepton flavor violation in a 3-3-1 model with inverse seesaw**, A. E. Cárcamo Hernández et.al., [2412.18550v1](http://arxiv.org/abs/2412.18550v1)\n\n We propose a 3-3-1 model augmented with $A\\_4$ flavor symmetry to address fermion mass hierarchy, mixing patterns, and charged Lepton Flavor Violating (cLFV). The model incorporates an inverse seesaw mechanism to explain the small active neutrino masses through sterile neutrinos. Discrete symmetries, including $Z\\_2, Z\\_2^\\prime, Z\\_3, Z\\_4, Z\\_7$ and $Z\\_{10}$ distinct mixing for the quarks and neutrinos . The model successfully predicts observed fermion masses and mixing patterns. Additionally, the constrained parameter space, particularly in the lepton sector, allows for potentially observable cLFV processes like $\\mu \\rightarrow e \\gamma$.\n\n", "2412.18538": "2024-12-24, **Anomalous Spin Precession Frequency Analysis in the Muon $g-2$ Experiment at Fermilab**, On Kim et.al., [2412.18538v1](http://arxiv.org/abs/2412.18538v1)\n\n The Muon $g-2$ experiment at Fermilab aims to measure the muon anomalous magnetic moment with an unprecedented precision of 140 parts per billion (ppb). Data collection concluded in June 2023, and analysis of the largest dataset (2021-2023) is underway. Previous publications based on data from 2018-2020 established the experimental foundation. This document provides an overview of the measurement of the muon anomalous spin precession frequency ($\\omega\\_a$) and the associated systematic corrections. The precision of these results directly tests the Standard Model's completeness, making the experiment a cornerstone in the field of particle physics.\n\n", "2412.18509": "2024-12-24, **The first JSNS$^2$ measurement of electron neutrino flux using $^{12}C(ν_{e},e^{-}) ^{12}N_{g.s.}$ reaction**, T. Dodo et.al., [2412.18509v1](http://arxiv.org/abs/2412.18509v1)\n\n JSNS$^2$ (J-PARC Sterile Neutrino Search at J-PARC Spallation Neutron Source) is an experiment searching for sterile neutrinos through the observation of $\\bar{\\nu}\\_{\\mu} \\rightarrow \\bar{\\nu}\\_e$ appearance oscillations, using neutrinos produced by muon decay-at-rest. A key aspect of the experiment involves accurately understanding the neutrino flux and the quantities of pions and muons, which are progenitors of (anti-)neutrinos, given that their production rates have yet to be measured. We present the first electron-neutrino flux measurement using $^{12}\\mathrm{C}(\\nu\\_{e},e^{-}) ^{12}\\mathrm{N}\\_{g.s.}$ reaction in JSNS$^2$, yielding a flux of (6.7 $\\pm$ 1.6 (stat.) $\\pm$ 1.7 (syst.)) $\\times$ 10$^{-9}$ cm$^{-2}$ proton$^{-1}$ at the JSNS$^2$ detector location, located at 24 meters distance from the mercury target. This flux measurement is consistent with predictions from simulations based on hadron models.\n\n", "2412.18433": "2024-12-24, **About Matter Effects on Neutrino Mixing Matrix Phases**, Macello Jales de Carvalho Fonseca Filho et.al., [2412.18433v1](http://arxiv.org/abs/2412.18433v1)\n\n As is widely known, the flavour and mass eigenbasis in neutrino sector can be related by a reduced unitary matrix, described by 3 real parameters and one phase for Dirac neutrinos, and 2 extra phases if neutrinos are Majorana particles. Neutrino flavour oscillation experiments are insensitive to Majorana phases, which leads to using the PMNS matrix with only one phase to describe flavour transitions. In this paper, we point out one feature of such choice that is commonly ignored: when neutrinos propagate in matter, the reduced unitary matrix PMNS does not properly diagonalize the neutrino system. We present some numerical calculations and analytical estimations to illustrate such statement, and discuss some scenarios where this effect can be probed.\n\n", "2412.18278": "2024-12-24, **Forbidden neutrinogenesis**, Shinya Kanemura et.al., [2412.18278v1](http://arxiv.org/abs/2412.18278v1)\n\n The origin of neutrino masses can be simply attributed to a new scalar beyond the Standard Model. We demonstrate that leptogenesis can explain the baryon asymmetry of the universe already in such a minimal framework, where the electroweak scalar is favored to enhance the baryon asymmetry. Different from traditional leptogenesis, the realization here exploits the thermal behavior of leptons at finite temperatures, which is otherwise kinetically forbidden in vacuum. We present detailed calculations of the CP asymmetry in the Schwinger-Keldysh Closed-Time-Path formalism, and compute the asymmetry evolution via the Kadanoff-Baym equation. Such minimal forbidden neutrinogenesis establishes a direct link between the baryon asymmetry and the CP-violating phase from neutrino mixing, making the scenario a compelling target in neutrino oscillation experiments. Complementary probes from cosmology, flavor physics and colliders are also briefly discussed.\n\n", "2412.18095": "2024-12-24, **Zee model in a non-holomorphic modular $A_4$ symmetry**, Takaaki Nomura et.al., [2412.18095v1](http://arxiv.org/abs/2412.18095v1)\n\n We study a Zee model in a non-holomorphic modular $A\\_4$ flavor symmetry in which we find good predictions in both the cases of normal and inverted hierarchy. Parameter reduction on neutrino sector occurs due to large mass hierarchies between charged-leptons mass eigenvalues and new singly-charged bosons in addition to this flavor symmetry. As a result, we have two complex free parameters including modulus $\\tau$. We show several predictions in terms of verifiable observables such as Dirac CP, Majorana phases, sum of the neutrino masses, and the effective mass for neutrino double beta decay in addition to demonstrating allowed regions for our input parameters.\n\n", "2412.18055": "2024-12-24, **Low-Energy Neutrino-Nucleus Scattering and New Physics**, S. Carey et.al., [2412.18055v1](http://arxiv.org/abs/2412.18055v1)\n\n The interactions of low-energy neutrinos with nuclei provide a unique window to explore various Standard Model (SM) and Beyond the Standard Model (BSM) processes. In particular, the recent observation of coherent elastic neutrino-nucleus scattering (CEvNS), predicted over five decades ago, has generated significant interest across disciplines. With its high cross section and suitability for compact detectors, particularly with stopped pion neutrinos, CEvNS offers a powerful probe for light, weakly coupled new physics. Ongoing global experimental efforts now aim to leverage CEvNS to test SM predictions and search for BSM signals, where deviations in event rates or spectra could reveal new physics. We present here an estimate of the number of recoil events obtained from CEvNS using the current and upcoming liquid argon based experiments. Furthermore, the event rate due to the inclusion of neutrino magnetic moment is also discussed.\n\n"}, "dark matter": {"2412.18330": "2024-12-24, **Halo-dependent Anharmonic Effects in Collective Excitation for Light Dark Matter Direct Detection**, Jun Guo et.al., [2412.18330v1](http://arxiv.org/abs/2412.18330v1)\n\n Phonon, the collective excitation of lattice vibration in the crystal, has been put forward as a means to search for light dark matter. However, the accurate modeling of the multi-phonon production process is challenging in theory. The anharmonicity of the crystal must be taken into account, as it has a significant impact on dark matter-nucleus scattering cross section in the low dark matter mass region. Notably, such an effect is sensitive to the velocity distribution of the dark matter halo. In this work, we consider the potential dark matter substructures indicated by the recent Gaia satellite observation and investigate their impact on the anharmonicity of the silicon crystal. By employing the likelihood analysis with the Asimov dataset, we present the expected sensitivity of dark matter-nucleus interactions, which can differ from the standard halo model by a factor of 2-3.\n\n", "2412.18318": "2024-12-24, **Search for a gravitational wave background from primordial black hole binaries using data from the first three LIGO-Virgo-KAGRA observing runs**, Tore Boybeyi et.al., [2412.18318v1](http://arxiv.org/abs/2412.18318v1)\n\n Using the cross-correlation data from the first three observing runs of the LIGO-Virgo-KAGRA Collaboration, we search for a gravitational-wave background (GWB) from primordial black holes, arising from the superposition of compact binary coalescence events. We consider both early and late binary formation mechanisms, and perform Bayesian parameter inference, investigating different prior distributions of the model parameters. From the non-detection of the GWB, we provide constraints on the fraction of primordial black holes contributing to the present dark matter energy density.\n\n"}, "supernova": {"2412.18493": "2024-12-24, **Determining $H_0$ from distance sum rule combining gamma-ray bursts with observational Hubble data and strong gravitational lensing**, Orlando Luongo et.al., [2412.18493v1](http://arxiv.org/abs/2412.18493v1)\n\n Model-independent bounds on the Hubble constant $H\\_0$ are important to shed light on cosmological tensions. We work out a model-independent analysis based on the sum rule, which is applied to late- and early-time data catalogs to determine $H\\_0$. Through the model-independent B\\'ezier interpolation of the observational Hubble data (OHD) and assuming a flat universe, we reconstruct the dimensionless distances of the sum rule and apply them to strong lensing data to derive constraints on $H\\_0$. Next, we extend this method to the high-redshift domain including, in other two separated analyses, gamma-ray burst (GRB) data sets from the well-established Amati and Combo correlations. In all three analyses, our findings agree at $1\\sigma$ level with the $H\\_0$ determined from type Ia supernovae (SNe Ia), and only at $2\\sigma$ level with the measurement derived from the cosmic microwave background (CMB) radiation. Our method evidences that the bounds on $H\\_0$ are significantly affected by strong lensing data, which favor the local measurement from SNe Ia. Including GRBs causes only a negligible decrease in the value of $H\\_0$. This may indicate that GRBs can be used to trace the expansion history and, in conjunction with CMB measurements, may heal the Hubble tension and accommodate to the flat $\\Lambda$CDM paradigm purported by CMB data.\n\n", "2412.18226": "2024-12-24, **Ejecta Wakes from Companion Interaction in Type Ia Supernova Remnants**, Logan J. Prust et.al., [2412.18226v1](http://arxiv.org/abs/2412.18226v1)\n\n Type Ia supernovae are triggered by accretion onto a white dwarf from a companion which is most likely Roche lobe-filling at the time of the explosion. The collision between the ejecta and a surviving companion carves out a conical wake, which could manifest as an asymmetry when the ejecta reaches the remnant phase. We simulate the companion interaction using the Athena++ hydrodynamics solver to determine the ejecta structure for a double-degenerate type Ia supernova. Ejecta in the wake is of lower density and higher velocity than the unperturbed ejecta. We then evolve the ejecta for several thousand years using the expanding-grid code Sprout. The forward shock within the wake is initially indented, but becomes spherical after roughly a thousand years due to transverse motion of shocked ejecta that fills the wake. The reverse shock travels quickly within the wake, leading to an off-center convergence of the reverse shock and leaving the remnant with an asymmetrical core. This also draws material from the interstellar medium deep into the remnant, eventually reaching the center. Large Rayleigh-Taylor plumes are found around the edge of the wake, creating a toroidal structure composed primarily of ejecta. Estimates of the thermal X-ray emission show that such remnants exhibit observable asymmetries for thousands of years.\n\n"}}