{"neutrino": {"2405.14826": "2024-05-23, **New limits on neutrino decay from high-energy astrophysical neutrinos**, Victor B. Valera et.al., [2405.14826v1](http://arxiv.org/abs/2405.14826v1)\n\n Since neutrinos have mass differences, they could decay into one another. But their lifetimes are likely long, even when shortened by new physics, so decay likely impacts neutrinos only during long trips. This makes high-energy astrophysical neutrinos, traveling for up to billions of light-years, sensitive probes of decay. However, their sensitivity must be tempered by reality. We derive from them thorough bounds on the neutrino lifetimes accounting for critical astrophysical unknowns and the nuances of neutrino detection. Using the diffuse neutrino flux, we disfavor lifetimes $\\tau \\lesssim 20$-450 s $(m/{\\rm eV})$, based on present IceCube data, and forecast factor-of-10 improvements by upcoming detectors. Using, for the first time, neutrinos from the active galaxy NGC 1068, extant unknowns preclude placing lifetime bounds today, but upcoming detectors could disfavor $\\tau \\sim 100$-5000 s $(m/{\\rm eV})$.\n\n", "2405.14764": "2024-05-23, **Multi-Messenger Emission Characteristics of Blazars**, Ronald Gamble Jr et.al., [2405.14764v1](http://arxiv.org/abs/2405.14764v1)\n\n Multi-Messenger observations and theory of astrophysical objects is fast becoming a critical research area in the astrophysics scientific community. In particular, point-like objects like that of BL Lac, flat spectrum radio quasars (FSRQ), and blazar candidates of uncertain type (BCU) are of distinct interest among those who look at the synchrotron, Compton, neutrino, and cosmic ray emissions sourced from compact objects. Notably, there is also much interest in the correlation between multi-frequency observations of blazars and neutrino surveys on source demographics. In this review we look at such multi-frequency and multi-physics correlations of the radio, X-ray, and $\\gamma$-ray fluxes of different classes of blazars from a collection of survey catalogues. This multi-physics survey of blazars shows that there are characteristic cross-correlations in the spectra of blazars when considering their multi-frequency and multi-messenger emission. Accompanying this will be a review of cosmic ray and neutrino emissions from blazars and their characteristics.\n\n", "2405.14332": "2024-05-23, **Thermal Wash-in Leptogenesis via Heavy Higgs Decay**, Kyohei Mukaida et.al., [2405.14332v1](http://arxiv.org/abs/2405.14332v1)\n\n We present a conceptually simple model to generate asymmetries that are not directly related to baryon nor lepton charges. The model employs a three-Higgs doublet framework, wherein the other two Higgs fields are significantly heavier than the Standard Model (SM) Higgs field. The decay of these heavier Higgs fields generates asymmetry for approximately conserved charges in the Standard Model at a high temperature. These asymmetries will be converted into baryon/lepton asymmetry through $B-L$ violating interactions associated with right-handed neutrinos via the wash-in mechanism.\n\n", "2405.13862": "2024-05-22, **On the properties of qudits**, A. B. Balantekin et.al., [2405.13862v1](http://arxiv.org/abs/2405.13862v1)\n\n Motivated by the growing interest in the applications of quantum information science in astrophysical settings, especially for the neutrino transport in compact objects where three-flavors of neutrinos need to be mapped on qutrits, we review properties of one- and two-qudit systems. We contrast two-qubit and two-qudits systems by pointing out how some of the properties of two-qubit systems generalize to higher dimensions and explore emerging new properties for dimensions three or higher. One example is provided by the Werner states: when the density operator is written in the fundamental representation, we show that only two-qubit Werner states can be pure states, but not two-qudit Werner states when the qudit dimension is larger than two.\n\n", "2405.13760": "2024-05-22, **New global bounds on heavy neutrino mixing**, Daniel Naredo-Tuero et.al., [2405.13760v1](http://arxiv.org/abs/2405.13760v1)\n\n We present an updated and improved global fit analysis of precision and flavor observables so as to derive constraints on deviations from unitarity in the leptonic mixing matrix. We focus on the case in which these deviations are sourced by heavy neutrinos, such that our results can also be interpreted as bounds on their mixing with the active flavors. Our analysis is motivated by new results on key observables, such as $M\\_W$, $\\|V\\_{ud}\\|$ and $\\Gamma\\_{\\text{inv}}$.\n\n", "2405.13700": "2024-05-22, **Theory of Majorana-Type Heavy Ion Double Charge Exchange Reactions by Pion--Nucleon Isotensor Interactions**, Horst Lenske et.al., [2405.13700v1](http://arxiv.org/abs/2405.13700v1)\n\n The theory of heavy ion double charge exchange (DCE) reactions proceeding by effective rank-2 isotensor interactions is presented. Virtual pion--nucleon charge exchange interactions are investigated as the source for induced isotensor interactions, giving rise to the Majorana DCE (MDCE) reaction mechanism. MDCE is of a generic character, proceeding through pairs of complementary ($\\pi^\\pm,\\pi^\\mp$) reactions in the projectile and target nucleus. The dynamics of the elementary processes is discussed, where the excitation of pion--nucleon resonances are of central importance. Investigations of initial and final state ion--ion interactions show that these effects are acting as vertex renormalizations. In closure approximation, well justified by the finite pion mass, the second-order transition matrix elements reduce to pion potentials and effective two-body isotensor DCE interactions, giving rise also to two-body correlations in either of the participating nuclei. Connections to neutrinoless Majorana double beta decay (MDBD) are elucidated at various levels of the dynamics, from the underlying fundamental electro-weak and QCD scales to the physical scales of nuclear MDBD and MDCE physics. It is pointed out that heavy ion MDCE reactions may also proceed by competing electro-weak charge exchange processes, leading to lepton MDCE by electrons, positrons, and neutrinos.\n\n", "2405.13687": "2024-05-22, **Effect of spin in binary neutron star mergers**, Beyhan Karakas et.al., [2405.13687v1](http://arxiv.org/abs/2405.13687v1)\n\n We investigate the effect of spin on equal and unequal mass binary neutron star mergers using finite-temperature, composition-dependent Hempel-Schaffner-Bielich (SFHo) equation of state, via 3+1 general relativistic hydrodynamics simulations which take into account neutrino emission and absorption. Equal mass cases that have a mass of $M\\_{1,2}$ =$1.27$, $1.52$ and $2.05M\\_{\\odot}$, result in a supramassive neutron star, a delayed, and a prompt collapse to a black hole, respectively. For all cases, we analyse the effect of initial spin on dynamics, on the structure of the final remnant, its spin evolution, the amount and composition of the ejected matter, gravitational waves, neutrino energy and luminosities. We show that in equal mass binary neutron star mergers, the ejected mass could reach $\\sim0.085M\\_{\\odot}$ for highly aligned-spins ($\\chi=0.67$). The black hole which results from such highly spinning, high-mass binary neutron star merger reaches a dimensionless spin of $0.92$; this is the highest spin reached in binary neutron star mergers, to date.\n\n", "2405.13679": "2024-05-22, **Charged Nariai black holes on the dark bubble**, Ulf Danielsson et.al., [2405.13679v1](http://arxiv.org/abs/2405.13679v1)\n\n In this paper, we realise the charged Nariai black hole on a braneworld from a nucleated bubble in AdS$\\_5$, known as the dark bubble model. Geometrically, the black hole takes the form of a cylindrical spacetime pulling on the dark bubble. This is realised by a brane embedding in an AdS$\\_5$ black string background. Identifying the brane with a D3-brane in string theory allows us to determine a relation between the fine structure constant and the string coupling, $\\alpha\\_\\text{EM} = \\frac{3}{2} g\\_s$, which was previously obtained for a microscopic black hole. We also speculate on the consequences for the Festina Lente bound and neutrino masses.\n\n", "2405.13523": "2024-05-22, **Induced Isotensor Interactions in Heavy-Ion Double-Charge-Exchange Reactions and the Role of Initial and Final State Interactions**, Horst Lenske et.al., [2405.13523v1](http://arxiv.org/abs/2405.13523v1)\n\n The role of initial state (ISI) and final state (FSI) ion-ion interactions in heavy-ion double-charge-exchange (DCE) reactions $A(Z,N)\\to A(Z\\pm 2,N\\mp 2)$ are studied for double single-charge-exchange (DSCE) reactions given by sequential actions of the isovector nucleon-nucleon (NN) T-matrix. In momentum representation, the second-order DSCE reaction amplitude is shown to be given in factorized form by projectile and target nuclear matrix elements and a reaction kernel containing ISI and FSI. Expanding the intermediate propagator in a Taylor series with respect to auxiliary energy allows us to perform the summation in the leading-order term over intermediate nuclear states in closure approximation. %Please ensure meaning has been retained - corrected HL. The nuclear matrix element attains a form given by the products of two-body interactions directly exciting the $n^2p^{-2}$ and $p^2n^{-2}$ DCE transitions in the projectile and the target nucleus, respectively. %Please ensure meaning has been retained - corrected HL. A surprising result is that the intermediate propagation induces correlations between the transition vertices, showing that DSCE reactions are a two-nucleon process that resembles a system of interacting spin-isospin dipoles. Transformation of the DSCE NN T-matrix interactions from the reaction theoretical t-channel form to the s-channel operator structure required for spectroscopic purposes is elaborated in detail, showing that, in general, a rich spectrum of spin scalar, spin vector and higher-rank spin tensor multipole transitions will contribute to a DSCE reaction. Similarities (and differences) to two-neutrino double-beta decay (DBD) are discussed. ISI/FSI distortion and absorption effects are illustrated in black sphere approximation and in an illustrative application to data.\n\n", "2405.13460": "2024-05-22, **Minimal eclectic flavor group $Q_{8}\\rtimes S_3$ and neutrino mixing**, Cai-Chang Li et.al., [2405.13460v1](http://arxiv.org/abs/2405.13460v1)\n\n We perform a comprehensive analysis of the minimal eclectic flavor group $Q\\_{8}\\rtimes S\\_3$ which is isomorphic to $GL(2,3)$, and all its irreducible representations are induced from the irreducible representations of $Q\\_{8}$ and $S\\_{3}$. The consistency conditions between EFG and generalized CP (gCP) symmetry are revisited, and we find the gCP symmetry compatible with the minimal EFG $Q\\_{8}\\rtimes S\\_3$. The most general forms of K\\\"ahler potential and superpotential based on $Q\\_{8}\\rtimes S\\_3$ are discussed, and the corresponding fermion mass matrices are presented. A concrete lepton model invariant under $Q\\_{8}\\rtimes S\\_3$ and gCP is constructed, in which the experimental data of all six lepton masses and six mixing parameters can be successfully described through seven real input parameters. The model predicts a vanishing effective mass $m\\_{\\beta\\beta}$ in neutrinoless double beta decay.\n\n"}, "dark matter": {"2405.14799": "2024-05-23, **Exploring modified Kaniadakis entropy: MOND theory and the Bekenstein bound conjecture**, Gabriella V. Ambrósio et.al., [2405.14799v1](http://arxiv.org/abs/2405.14799v1)\n\n We examine the potential of Kaniadakis entropy to describe black hole entropy, proposing a modified version accounting for black hole thermodynamics. Additionally, we discuss the Modified Newtonian Dynamics (MOND) theory, a modification of Newton's second law aimed at explaining galaxy rotation curves without resorting to dark matter. Furthermore, we consider the Bekenstein bound conjecture, which imposes an upper limit on the entropy of confined quantum systems. We analyze this conjecture in the context of a modified Kaniadakis entropy and find that it holds for typical values of $\\kappa$, as evidenced by our numerical investigation and displaying a figure. Our exploration underscores the potential of modified Kaniadakis statistics in understanding diverse physical phenomena, from gravitational systems to quantum mechanics, offering a promising direction for future research at the intersection of statistical mechanics and other important areas of physics as well.\n\n", "2405.14732": "2024-05-23, **The Data Acquisition System of the LZ Dark Matter Detector: FADR**, J. Aalbers et.al., [2405.14732v1](http://arxiv.org/abs/2405.14732v1)\n\n The Data Acquisition System (DAQ) for the LUX-ZEPLIN (LZ) dark matter detector is described. The signals from 745 PMTs, distributed across three subsystems, are sampled with 100-MHz 32-channel digitizers (DDC-32s). A basic waveform analysis is carried out on the on-board Field Programmable Gate Arrays (FPGAs) to extract information about the observed scintillation and electroluminescence signals. This information is used to determine if the digitized waveforms should be preserved for offline analysis.   The system is designed around the Kintex-7 FPGA. In addition to digitizing the PMT signals and providing basic event selection in real time, the flexibility provided by the use of FPGAs allows us to monitor the performance of the detector and the DAQ in parallel to normal data acquisition.   The hardware and software/firmware of this FPGA-based Architecture for Data acquisition and Realtime monitoring (FADR) are discussed and performance measurements are described.\n\n", "2405.14638": "2024-05-23, **Screened Scalar Fields in the Laboratory and the Solar System**, Hauke Fischer et.al., [2405.14638v1](http://arxiv.org/abs/2405.14638v1)\n\n The last few decades have provided abundant evidence for physics beyond the two standard models of particle physics and cosmology. As is now known, the by far largest part of our universe's matter/energy content lies in the `dark' and consists of dark energy and dark matter. Despite intensive efforts on the experimental as well as the theoretical side, the origins of both are still completely unknown. Screened scalar fields have been hypothesized as potential candidates for dark energy or dark matter. Among these, some of the most prominent models are the chameleon, symmetron, and environment-dependent dilaton. In this article, we present a summary containing the most recent experimental constraints on the parameters of these three models. For this, experimental results have been employed from the qBOUNCE collaboration, neutron interferometry, and Lunar Laser Ranging (LLR), among others. In addition, constraints are forecast for the Casimir And Non Newtonian force EXperiment (CANNEX). Combining these results with previous ones, this article collects the most up-to-date constraints on the three considered screened scalar field models.\n\n", "2405.14610": "2024-05-23, **Flavored Dark Matter: Freeze-out Scenarios and LHC Signatures**, Jan Heisig et.al., [2405.14610v1](http://arxiv.org/abs/2405.14610v1)\n\n We present the phenomenology of a simplified dark matter model within the dark minimal flavor violation framework, extending the standard model with a Majorana fermion flavor triplet and colored scalar mediator. We explore the allowed parameter space considering constraints from flavor observables, direct and indirect dark matter detection, and the relic density measurement. Our analysis reveals previously unexplored scenarios such as conversion-driven freeze-out within the model. We study limits from the LHC and discuss new signatures of the model, highlighting its richer phenomenology compared to single flavor dark matter.\n\n", "2405.14309": "2024-05-23, **Gamma-ray Signal from $Z_{N\\geq 3}$ Dark Matter-Companion Models**, Jun Guo et.al., [2405.14309v1](http://arxiv.org/abs/2405.14309v1)\n\n In Ref.~\\cite{Guo:2021rre}, we proposed to replace the final dark matter (DM) particle in the semi-annihilation mode $\\rm DM+DM\\to antiDM+Higgs~boson$ with its $Z\\_{N\\geq 3}$ companion, thus reducing DM number density without DM-nucleon scattering. In this work, we study the indirect detection signals from DM annihilation, the Higgs boson pair with one of them from the companion decay being on- or off- shell, depending on the DM-companion mass splitting. We generate the photon spectrum by using PYTHIA8 and study the properties of the spectrum, to find that the hard part of the spectrum in our model is mainly shaped by the direct Higgs boson and thus does not differ much from that of the conventional semi-annihilation mode. Using the Fermi-LAT data of white dwarfs, we derive the current limit of the DM annihilation cross section for ${\\rm DM+DM\\to companion^*+Higgs~ boson}$, and for the relatively light DM, it reaches the typical thermal cross section. However, for the TeV scale DM, we have to rely on the Cherenkov Telescope Array, which is able to rule out the whole parameter space except for the coannihilation region.\n\n", "2405.14163": "2024-05-23, **Flavino Dark Matter in a Non-Abelian Discrete Flavor Model**, Takaaki Nomura et.al., [2405.14163v1](http://arxiv.org/abs/2405.14163v1)\n\n We study a relic density of the flavino dark matter in modified Altarelli and Feruglio $A\\_4$ model which is respecting the $SU(2)\\_L\\times A\\_4\\times Z\\_3\\times U(1)\\_R$ symmetry. We calculate the Lagrangian from the superpotential in the model. In estimating relic density, we consider the relevant interactions from the Lagrangian that realize the vacuum expectation value alignments and charged lepton masses where we assume that the supersymmetry breaking effects are small for flavon sector. As a result, we find the degenerate masses between the lightest ``flavon'' and ``flavino'', and only two parameters in the potential determines the relic density. Then allowed parameter space of these parameters are estimated from relic density calculation taking a constraint from lepton flavor violation into account. We also briefly discuss other dark matter physics such as direct detection, indirect detection and collider search.\n\n", "2405.14015": "2024-05-22, **Euclid preparation. Detecting globular clusters in the Euclid survey**, Euclid Collaboration et.al., [2405.14015v1](http://arxiv.org/abs/2405.14015v1)\n\n Extragalactic globular clusters (EGCs) are an abundant and powerful tracer of galaxy dynamics and formation, and their own formation and evolution is also a matter of extensive debate. The compact nature of globular clusters means that they are hard to spatially resolve and thus study outside the Local Group. In this work we have examined how well EGCs will be detectable in images from the Euclid telescope, using both simulated pre-launch images and the first early-release observations of the Fornax galaxy cluster. The Euclid Wide Survey will provide high-spatial resolution VIS imaging in the broad IE band as well as near-infrared photometry (YE, JE, and HE). We estimate that the galaxies within 100 Mpc in the footprint of the Euclid survey host around 830 000 EGCs of which about 350 000 are within the survey's detection limits. For about half of these EGCs, three infrared colours will be available as well. For any galaxy within 50Mpc the brighter half of its GC luminosity function will be detectable by the Euclid Wide Survey. The detectability of EGCs is mainly driven by the residual surface brightness of their host galaxy. We find that an automated machine-learning EGC-classification method based on real Euclid data of the Fornax galaxy cluster provides an efficient method to generate high purity and high completeness GC candidate catalogues. We confirm that EGCs are spatially resolved compared to pure point sources in VIS images of Fornax. Our analysis of both simulated and first on-sky data show that Euclid will increase the number of GCs accessible with high-resolution imaging substantially compared to previous surveys, and will permit the study of GCs in the outskirts of their hosts. Euclid is unique in enabling systematic studies of EGCs in a spatially unbiased and homogeneous manner and is primed to improve our understanding of many understudied aspects of GC astrophysics.\n\n", "2405.13882": "2024-05-22, **Resonant Conversion of Wave Dark Matter in the Ionosphere**, Carl Beadle et.al., [2405.13882v1](http://arxiv.org/abs/2405.13882v1)\n\n We consider resonant wave-like dark matter conversion into low-frequency radio waves in the Earth's ionosphere. Resonant conversion occurs when the dark matter mass and the plasma frequency coincide, defining a range $m\\_{ \\text{DM} } \\sim 10^{-9} - 10^{-8}$ eV where this approach is best suited. Owing to the non-relativistic nature of dark matter and the typical variational scale of the Earth's ionosphere, the standard linearized approach to computing dark matter conversion is not suitable. We therefore solve a second-order boundary-value problem, effectively framing the ionosphere as a driven cavity filled with a positionally-varying plasma. An electrically-small dipole antenna targeting the generated radio waves can be orders of magnitude more sensitive to dark photon and axion-like particle dark matter in the relevant mass range. The present study opens up a promising way of testing hitherto unexplored parameter space which could be further improved with a dedicated instrument.\n\n", "2405.13883": "2024-05-22, **Gravitational Production of Heavy Particles during and after Inflation**, Davide Racco et.al., [2405.13883v1](http://arxiv.org/abs/2405.13883v1)\n\n We investigate the gravitational production of a scalar field $\\chi$ with a mass exceeding the Hubble scale during inflation $m\\_\\chi \\gtrsim H\\_I$, employing both analytical and numerical approaches. We demonstrate that the steepest descent method effectively captures the epochs and yields of gravitational production in a compact and simple analytical framework. These analytical results align with the numerical solutions of the field equation. Our study covers three spacetime backgrounds: de Sitter, power-law inflation, and the Starobinsky inflation model. Within these models, we identify two distinct phases of particle production: during and after inflation. During inflation, we derive an accurate analytic expression for the particle production rate, accounting for a varying Hubble rate. After inflation, the additional burst of particle production depends on the inflaton mass around its minimum. When this mass is smaller than the Hubble scale during inflation, $H\\_I$, there is no significant extra production. However, if the inflaton mass is larger, post-inflation production becomes the dominant contribution. Furthermore, we explore the implications of gravitationally produced heavy fields for dark matter abundance, assuming their cosmological stability.\n\n", "2405.13871": "2024-05-22, **Gravitational wave background from primordial black holes in globular clusters**, Eleonora Vanzan et.al., [2405.13871v1](http://arxiv.org/abs/2405.13871v1)\n\n Primordial black holes still represent a viable candidate for a significant fraction, if not for the totality, of dark matter. If these compact objects have masses of order tens of solar masses, their coalescence can be observed by current and future ground-based gravitational wave detectors. Therefore, finding new gravitational wave signatures associated with this dark matter candidate can either lead to their detection or help constraining their abundance. In this work we consider the phenomenology of primordial black holes in dense environments, in particular globular clusters. We model the internal structure of globular clusters in a semi-analytical fashion, and we derive the expected merger rate. We show that, if primordial black holes are present in globular clusters, their contribution to the GW background can be comparable to other well-known channels, such as early- and late-time binaries, thus enhancing the detectability prospects of primordial black holes and demonstrating that this contribution needs to be taken into account.\n\n", "2405.13778": "2024-05-22, **Dark sector searches with the CMS experiment**, CMS Collaboration et.al., [2405.13778v1](http://arxiv.org/abs/2405.13778v1)\n\n Astrophysical observations provide compelling evidence for gravitationally interacting dark matter in the universe that cannot be explained by the standard model of particle physics. The extraordinary amount of data from the CERN LHC presents a unique opportunity to shed light on the nature of dark matter at unprecedented collision energies. This Report comprehensively reviews the most recent searches with the CMS experiment for particles and interactions belonging to a dark sector and for dark-sector mediators. Models with invisible massive particles are probed by searches for signatures of missing transverse momentum recoiling against visible standard model particles. Searches for mediators are also conducted via fully visible final states. The results of these searches are compared with those obtained from direct-detection experiments. Searches for alternative scenarios predicting more complex dark sectors with multiple new particles and new forces are also presented. Many of these models include long-lived particles, which could manifest themselves with striking unconventional signatures with relatively small amounts of background. Searches for such particles are discussed and their impact on dark-sector scenarios is evaluated. Many results and interpretations have been newly obtained for this Report.\n\n", "2405.13504": "2024-05-22, **Euclid: Early Release Observations -- A preview of the Euclid era through a galaxy cluster magnifying lens**, H. Atek et.al., [2405.13504v1](http://arxiv.org/abs/2405.13504v1)\n\n We present the first analysis of the Euclid Early Release Observations (ERO) program that targets fields around two lensing clusters, Abell 2390 and Abell 2764. We use VIS and NISP imaging to produce photometric catalogs for a total of $\\sim 500\\,000$ objects. The imaging data reach a $5\\,\\sigma$ typical depth in the range 25.1-25.4 AB in the NISP bands, and 27.1-27.3 AB in the VIS band. Using the Lyman-break method in combination with photometric redshifts, we identify $30$ Lyman-break galaxy (LBG) candidates at $z>6$ and 139 extremely red sources (ERSs), most likely at lower redshift. The deeper VIS imaging compared to NISP means we can routinely identify high-redshift Lyman breaks of the order of $3$ magnitudes, which reduces contamination by brown dwarf stars and low-redshift galaxies. Spectroscopic follow-up campaigns of such bright sources will help constrain both the bright end of the ultraviolet galaxy luminosity function and the quasar luminosity function at $z>6$, and constrain the physical nature of these objects. Additionally, we have performed a combined strong lensing and weak lensing analysis of A2390, and demonstrate how Euclid will contribute to better constraining the virial mass of galaxy clusters. From these data, we also identify optical and near-infrared counterparts of known $z>0.6$ clusters, which exhibit strong lensing features, establishing the ability of Euclid to characterize high-redshift clusters. Finally, we provide a glimpse of Euclid's ability to map the intracluster light out to larger radii than current facilities, enabling a better understanding of the cluster assembly history and mapping of the dark matter distribution. This initial dataset illustrates the diverse spectrum of legacy science that will be enabled by the Euclid survey.\n\n", "2405.13501": "2024-05-22, **Euclid: Early Release Observations -- Overview of the Perseus cluster and analysis of its luminosity and stellar mass functions**, J. -C. Cuillandre et.al., [2405.13501v1](http://arxiv.org/abs/2405.13501v1)\n\n The Euclid ERO programme targeted the Perseus cluster of galaxies, gathering deep data in the central region of the cluster over 0.7 square degree, corresponding to approximately 0.25 r\\_200. The data set reaches a point-source depth of IE=28.0 (YE, JE, HE = 25.3) AB magnitudes at 5 sigma with a 0.16\" and 0.48\" FWHM, and a surface brightness limit of 30.1 (29.2) mag per square arcsec. The exceptional depth and spatial resolution of this wide-field multi-band data enable the simultaneous detection and characterisation of both bright and low surface brightness galaxies, along with their globular cluster systems, from the optical to the NIR. This study advances beyond previous analyses of the cluster and enables a range of scientific investigations summarised here. We derive the luminosity and stellar mass functions (LF and SMF) of the Perseus cluster in the Euclid IE band, thanks to supplementary u,g,r,i,z and Halpha data from the CFHT. We adopt a catalogue of 1100 dwarf galaxies, detailed in the corresponding ERO paper. We identify all other sources in the Euclid images and obtain accurate photometric measurements using AutoProf or AstroPhot for 138 bright cluster galaxies, and SourceExtractor for half a million compact sources. Cluster membership for the bright sample is determined by calculating photometric redshifts with Phosphoros. Our LF and SMF are the deepest recorded for the Perseus cluster, highlighting the groundbreaking capabilities of the Euclid telescope. Both the LF and SMF fit a Schechter plus Gaussian model. The LF features a dip at M(IE)=-19 and a faint-end slope of alpha\\_S = -1.2 to -1.3. The SMF displays a low-mass-end slope of alpha\\_S = -1.2 to -1.35. These observed slopes are flatter than those predicted for dark matter halos in cosmological simulations, offering significant insights for models of galaxy formation and evolution.\n\n", "2405.13495": "2024-05-22, **Euclid. V. The Flagship galaxy mock catalogue: a comprehensive simulation for the Euclid mission**, Euclid Collaboration et.al., [2405.13495v1](http://arxiv.org/abs/2405.13495v1)\n\n We present the Flagship galaxy mock, a simulated catalogue of billions of galaxies designed to support the scientific exploitation of the Euclid mission. Euclid is a medium-class mission of the European Space Agency optimised to determine the properties of dark matter and dark energy on the largest scales of the Universe. It probes structure formation over more than 10 billion years primarily from the combination of weak gravitational lensing and galaxy clustering data. The breath of Euclid's data will also foster a wide variety of scientific analyses. The Flagship simulation was developed to provide a realistic approximation to the galaxies that will be observed by Euclid and used in its scientific analyses. We ran a state-of-the-art N-body simulation with four trillion particles, producing a lightcone on the fly. From the dark matter particles, we produced a catalogue of 16 billion haloes in one octant of the sky in the lightcone up to redshift z=3. We then populated these haloes with mock galaxies using a halo occupation distribution and abundance matching approach, calibrating the free parameters of the galaxy mock against observed correlations and other basic galaxy properties. Modelled galaxy properties include luminosity and flux in several bands, redshifts, positions and velocities, spectral energy distributions, shapes and sizes, stellar masses, star formation rates, metallicities, emission line fluxes, and lensing properties. We selected a final sample of 3.4 billion galaxies with a magnitude cut of H\\_E<26, where we are complete. We have performed a comprehensive set of validation tests to check the similarity to observational data and theoretical models. In particular, our catalogue is able to closely reproduce the main characteristics of the weak lensing and galaxy clustering samples to be used in the mission's main cosmological analysis. (abridged)\n\n", "2405.13494": "2024-05-22, **Euclid. IV. The NISP Calibration Unit**, Euclid Collaboration et.al., [2405.13494v1](http://arxiv.org/abs/2405.13494v1)\n\n The near-infrared calibration unit (NI-CU) onboard Euclid's Near-Infrared Spectrometer and Photometer (NISP) is the first astronomical calibration lamp based on light-emitting diodes (LEDs) to be operated in space. Euclid is a mission in ESA's 'Cosmic Vision 2015-2025' framework, to explore the dark universe and provide a next-level characterisation of the nature of gravitation, dark matter, and dark energy. Calibrating photometric and spectrometric measurements of galaxies to better than 1.5% accuracy in a survey homogeneously mapping ~14000 deg^2 of extragalactic sky requires a very detailed characterisation of near-infrared (NIR) detector properties, as well their constant monitoring in flight. To cover two of the main contributions - relative pixel-to-pixel sensitivity and non-linearity characteristics - as well as support other calibration activities, NI-CU was designed to provide spatially approximately homogeneous (<12% variations) and temporally stable illumination (0.1%-0.2% over 1200s) over the NISP detector plane, with minimal power consumption and energy dissipation. NI-CU is covers the spectral range ~[900,1900] nm - at cryo-operating temperature - at 5 fixed independent wavelengths to capture wavelength-dependent behaviour of the detectors, with fluence over a dynamic range of >=100 from ~15 ph s^-1 pixel^-1 to >1500 ph s^-1 pixel^-1. For this functionality, NI-CU is based on LEDs. We describe the rationale behind the decision and design process, describe the challenges in sourcing the right LEDs, as well as the qualification process and lessons learned. We also provide a description of the completed NI-CU, its capabilities and performance as well as its limits. NI-CU has been integrated into NISP and the Euclid satellite, and since Euclid's launch in July 2023 has started supporting survey operations.\n\n", "2405.13493": "2024-05-22, **Euclid. III. The NISP Instrument**, Euclid Collaboration et.al., [2405.13493v1](http://arxiv.org/abs/2405.13493v1)\n\n The Near-Infrared Spectrometer and Photometer (NISP) on board the Euclid satellite provides multiband photometry and R>=450 slitless grism spectroscopy in the 950-2020nm wavelength range. In this reference article we illuminate the background of NISP's functional and calibration requirements, describe the instrument's integral components, and provide all its key properties. We also sketch the processes needed to understand how NISP operates and is calibrated, and its technical potentials and limitations. Links to articles providing more details and technical background are included. NISP's 16 HAWAII-2RG (H2RG) detectors with a plate scale of 0.3\" pix^-1 deliver a field-of-view of 0.57deg^2. In photo mode, NISP reaches a limiting magnitude of ~24.5AB mag in three photometric exposures of about 100s exposure time, for point sources and with a signal-to-noise ratio (SNR) of 5. For spectroscopy, NISP's point-source sensitivity is a SNR = 3.5 detection of an emission line with flux ~2x10^-16erg/s/cm^2 integrated over two resolution elements of 13.4A, in 3x560s grism exposures at 1.6 mu (redshifted Ha). Our calibration includes on-ground and in-flight characterisation and monitoring of detector baseline, dark current, non-linearity, and sensitivity, to guarantee a relative photometric accuracy of better than 1.5%, and relative spectrophotometry to better than 0.7%. The wavelength calibration must be better than 5A. NISP is the state-of-the-art instrument in the NIR for all science beyond small areas available from HST and JWST - and an enormous advance due to its combination of field size and high throughput of telescope and instrument. During Euclid's 6-year survey covering 14000 deg^2 of extragalactic sky, NISP will be the backbone for determining distances of more than a billion galaxies. Its NIR data will become a rich reference imaging and spectroscopy data set for the coming decades.\n\n", "2405.13492": "2024-05-22, **Euclid. II. The VIS Instrument**, Euclid Collaboration et.al., [2405.13492v1](http://arxiv.org/abs/2405.13492v1)\n\n This paper presents the specification, design, and development of the Visible Camera (VIS) on the ESA Euclid mission. VIS is a large optical-band imager with a field of view of 0.54 deg^2 sampled at 0.1\" with an array of 609 Megapixels and spatial resolution of 0.18\". It will be used to survey approximately 14,000 deg^2 of extragalactic sky to measure the distortion of galaxies in the redshift range z=0.1-1.5 resulting from weak gravitational lensing, one of the two principal cosmology probes of Euclid. With photometric redshifts, the distribution of dark matter can be mapped in three dimensions, and, from how this has changed with look-back time, the nature of dark energy and theories of gravity can be constrained. The entire VIS focal plane will be transmitted to provide the largest images of the Universe from space to date, reaching m\\_AB>24.5 with S/N >10 in a single broad I\\_E~(r+i+z) band over a six year survey. The particularly challenging aspects of the instrument are the control and calibration of observational biases, which lead to stringent performance requirements and calibration regimes. With its combination of spatial resolution, calibration knowledge, depth, and area covering most of the extra-Galactic sky, VIS will also provide a legacy data set for many other fields. This paper discusses the rationale behind the VIS concept and describes the instrument design and development before reporting the pre-launch performance derived from ground calibrations and brief results from the in-orbit commissioning. VIS should reach fainter than m\\_AB=25 with S/N>10 for galaxies of full-width half-maximum of 0.3\" in a 1.3\" diameter aperture over the Wide Survey, and m\\_AB>26.4 for a Deep Survey that will cover more than 50 deg^2. The paper also describes how VIS works with the other Euclid components of survey, telescope, and science data processing to extract the cosmological information.\n\n", "2405.13491": "2024-05-22, **Euclid. I. Overview of the Euclid mission**, Euclid Collaboration et.al., [2405.13491v1](http://arxiv.org/abs/2405.13491v1)\n\n The current standard model of cosmology successfully describes a variety of measurements, but the nature of its main ingredients, dark matter and dark energy, remains unknown. Euclid is a medium-class mission in the Cosmic Vision 2015-2025 programme of the European Space Agency (ESA) that will provide high-resolution optical imaging, as well as near-infrared imaging and spectroscopy, over about 14,000 deg^2 of extragalactic sky. In addition to accurate weak lensing and clustering measurements that probe structure formation over half of the age of the Universe, its primary probes for cosmology, these exquisite data will enable a wide range of science. This paper provides a high-level overview of the mission, summarising the survey characteristics, the various data-processing steps, and data products. We also highlight the main science objectives and expected performance.\n\n", "2405.13354": "2024-05-22, **Some Classes of Interacting Two-Fluid Model of the Expanding Universe**, Subhra Bhattacharya et.al., [2405.13354v1](http://arxiv.org/abs/2405.13354v1)\n\n We consider interacting dark matter-dark energy models arising out of a general interaction term $Q=f(\\rho\\_{m},\\rho\\_{d},\\dot{\\rho}\\_{m},\\dot{\\rho}\\_{d}).$ Here $f$ is a functional relation connecting the energy densities $\\rho\\_{m}$ and $\\rho\\_{d}$ and their derivatives w.r.t. time $t.$ In our model we consider two interacting barotropic fluid with constant equation of state $\\omega\\_{m}$ and $\\omega\\_{d}.$ By considering a dynamical interaction between them we trace out the cosmological evolution dynamics of the universe. We analytically solve the model by considering a constant ratio between the two fluids and then track the corresponding analytical results using observational data from the baryon acoustic oscillation measurements, Type Ia supernovae measurements and the local Hubble constant measurements. From this general setting we introduce three different models and nine different interaction function. Our final aim is to set up a comparative analysis of the various class of models under the different interaction function using common theoretical and numerical analysis.\n\n"}, "supernova": {"2405.14663": "2024-05-23, **WTP19aalnxx: Discovery of a bright mid-infrared transient in the emerging class of low luminosity supernovae revealed by delayed circumstellar interaction**, Charlotte Myers et.al., [2405.14663v1](http://arxiv.org/abs/2405.14663v1)\n\n While core-collapse supernovae (SNe) often show early and consistent signs of circumstellar (CSM) interaction, some exhibit delayed signatures due to interaction with distant material around the progenitor star. Here we present the discovery in NEOWISE data of WTP19aalnxx, a luminous mid-infrared (IR) transient in the outskirts of the galaxy KUG 0022-007 at $\\approx 190$ Mpc. First detected in 2018, WTP19aalnxx reaches a peak absolute (Vega) magnitude of $\\approx-22$ at $4.6 \\, \\mu$m in $\\approx3$ yr, comparable to the most luminous interacting SNe. Archival data reveal a $\\gtrsim 5\\times$ fainter optical counterpart detected since 2015, while follow-up near-IR observations in 2022 reveal an extremely red ($Ks-W2 \\approx 3.7$ mag) active transient. Deep optical spectroscopy confirm strong CSM interaction signatures via intermediate-width Balmer emission lines and coronal metal lines. Modeling the broadband spectral energy distribution, we estimate the presence of $\\gtrsim 10^{-2}$ M$\\_\\odot$ of warm dust, likely formed in the shock interaction region. Together with the lack of nebular Fe emission, we suggest that WTP19aalnxx is a missed, low (optical) luminosity SN in an emerging family of core-collapse SNe distinguished by their CSM-interaction-powered mid-IR emission that outshines the optical bands. Investigating the Zwicky Transient Facility sample of SNe in NEOWISE data, we find $17$ core-collapse SNe ($\\gtrsim 3$% in a volume-limited sample) without early signs of CSM interaction that exhibit delayed IR brightening, suggestive of dense CSM shells at $\\lesssim 10^{17}$cm. We suggest that synoptic IR surveys offer a new route to revealing late-time CSM interaction and the prevalence of intense terminal mass loss in massive stars.\n\n", "2405.14357": "2024-05-23, **Cosmological Constraints on Long Gamma-Ray Bursts from Fermi observations**, Huifeng Wang et.al., [2405.14357v1](http://arxiv.org/abs/2405.14357v1)\n\n In this paper, we compile a \\emph{Fermi} sample of the \\emph{long} GRBs from \\emph{Fermi} observations with 15 years of the Fermi-GBM catalogue with identified redshift, in which the GOLD sample contains 123 long GRBs at $z\\le5.6$ and the FULL sample contains 151 long GRBs with redshifts at $z\\le8.2$. The Amati relation (the $E\\_{\\rm p,i}$-$E\\_{\\rm iso}$ correlation) are calibrated at $z<1.4$ by a Gaussian Process from the latest observational Hubble data (OHD) with the cosmic chronometers method to obtain GRBs at high-redshift $z\\ge1.4$ which can be used to constrain cosmological models via the Markov chain Monte Carlo (MCMC) method. With the cosmology-independent GRBs with the GOLD sample at $z\\ge1.4$ and the Pantheon sample of type Ia supernovae (SNe Ia) at $0.01<z\\leq2.3$, we obtain $\\Omega\\_{\\rm m} = 0.354\\pm0.018, H\\_0 = 73.05\\pm0.002$ for the flat $\\Lambda$CDM model; $w\\_0 = -1.22^{+0.18}\\_{-0.15}$ for the flat $w$CDM model; and $w\\_{a} = -1.12^{+0.45}\\_{-0.83}$ for the flat Chevallier-Polarski-Linder model at the 1$\\sigma$ confidence level. Our results with the GOLD and FULL sample are almost identical, which are more stringent than the previous results with GRBs.\n\n", "2405.13665": "2024-05-22, **Unveiling the Hubble Constant through Galaxy Cluster Gas Mass Fractions**, Javier E. Gonzalez et.al., [2405.13665v1](http://arxiv.org/abs/2405.13665v1)\n\n In this work, we obtain Hubble constant ($H\\_0$) estimates by using two galaxy cluster gas mass fraction measurement samples, Type Ia supernovae luminosity distances and the validity of the cosmic distance duality relation. Notably, the angular diameter distance (ADD) to each galaxy cluster in the samples is determined by combining its gas mass fraction measurement with galaxy clustering observations, more precisely, the $\\Omega\\_b / \\Omega\\_m$ ratio. Such a combination results in a $H\\_0$ estimate that is independent of a specific cosmological framework. In one of the samples, the gas fraction measurements were calculated in spherical shells at radii near $r\\_{\\rm 2500}$ (44 data points), while in the other (103 data points) the measurements were obtained by integrating X-ray observations across all radii $< r\\_{\\rm 500}$. The quantities $r\\_{2500}$ and $r\\_{\\rm 500}$ define the radii within which the mean cluster density is 2500 or 500 times the critical density of the Universe at the cluster's redshift. We find $H\\_0=71.4^{+10.5}\\_{-8.9}$ km/s/Mpc and $H\\_0=75.5^{+9.9}\\_{-7.9}$ km/s/Mpc at 68\\% CL, respectively. We also investigate the impact on the $H\\_0$ determination by exploring the precision and number of gas mass fraction data by performing a data Monte Carlo simulation. Our simulations show that future measurements could achieve a precision of up to 3.5\\% for $H\\_0$.\n\n", "2405.13596": "2024-05-22, **SN 2023zaw: the low-energy explosion of an ultra-stripped star, with non-radioactive heating**, Thomas Moore et.al., [2405.13596v1](http://arxiv.org/abs/2405.13596v1)\n\n Most stripped envelope supernova progenitors are formed through binary interaction, losing hydrogen and/or helium from their outer layers. An emerging class of supernovae with the highest degree of envelope-stripping are thought to be the product of stripping by a NS companion. However, relatively few examples are known and the outcomes of such systems can be diverse and are poorly understood at present. Here, we present spectroscopic observations and high cadence multi-band photometry of SN 2023zaw, a low ejecta mass and rapidly evolving supernova. SN 2023zaw was discovered in a nearby spiral galaxy at D = 39.7 Mpc, with significant Milky Way extinction, $E(B-V) = 0.21$, and significant (but uncertain) host extinction. Bayesian evidence comparison reveals that nickel is not the only power source and an additional energy source is required to explain our observations. Our models suggest an ejecta mass of $M\\_{\\rm ej} \\sim 0.07\\,\\rm M\\_\\odot$ and a synthesised nickel mass of $M\\_{\\rm ej} \\sim 0.007\\,\\rm M\\_\\odot$ is required to explain the explosion. However an additional heating from a magnetar or interaction with circumstellar material is required to power the early light curve.\n\n", "2405.13588": "2024-05-22, **DESI 2024: Constraints on Physics-Focused Aspects of Dark Energy using DESI DR1 BAO Data**, K. Lodha et.al., [2405.13588v1](http://arxiv.org/abs/2405.13588v1)\n\n Baryon acoustic oscillation data from the first year of the Dark Energy Spectroscopic Instrument (DESI) provide near percent-level precision of cosmic distances in seven bins over the redshift range $z=0.1$-$4.2$. We use this data, together with other distance probes, to constrain the cosmic expansion history using some well-motivated physical classes of dark energy. In particular, we explore three physics-focused behaviors of dark energy from the equation of state and energy density perspectives: the thawing class (matching many simple quintessence potentials), emergent class (where dark energy comes into being recently, as in phase transition models), and mirage class (where phenomenologically the distance to CMB last scattering is close to that from a cosmological constant $\\Lambda$ despite dark energy dynamics). All three classes fit the data at least as well as $\\Lambda$CDM, and indeed can improve on it by $\\Delta\\chi^2\\approx -5$ to $-17$ for the combination of DESI BAO with CMB and supernova data, while having one more parameter. The mirage class does essentially as well as $w\\_0w\\_a$CDM while having one less parameter. These classes of dynamical behaviors highlight worthwhile avenues for further exploration into the nature of dark energy.\n\n", "2405.13354": "2024-05-22, **Some Classes of Interacting Two-Fluid Model of the Expanding Universe**, Subhra Bhattacharya et.al., [2405.13354v1](http://arxiv.org/abs/2405.13354v1)\n\n We consider interacting dark matter-dark energy models arising out of a general interaction term $Q=f(\\rho\\_{m},\\rho\\_{d},\\dot{\\rho}\\_{m},\\dot{\\rho}\\_{d}).$ Here $f$ is a functional relation connecting the energy densities $\\rho\\_{m}$ and $\\rho\\_{d}$ and their derivatives w.r.t. time $t.$ In our model we consider two interacting barotropic fluid with constant equation of state $\\omega\\_{m}$ and $\\omega\\_{d}.$ By considering a dynamical interaction between them we trace out the cosmological evolution dynamics of the universe. We analytically solve the model by considering a constant ratio between the two fluids and then track the corresponding analytical results using observational data from the baryon acoustic oscillation measurements, Type Ia supernovae measurements and the local Hubble constant measurements. From this general setting we introduce three different models and nine different interaction function. Our final aim is to set up a comparative analysis of the various class of models under the different interaction function using common theoretical and numerical analysis.\n\n"}}