{"neutrino": {"2512.09820": "2025-12-10, **Scintillation response of cryogenic CsI to few-keV and sub-keV nuclear recoils**, J. I. Collar et.al., [2512.09820v1](http://arxiv.org/abs/2512.09820v1)\n\n Monochromatic neutron emissions from photonuclear sources $^{88}$Y/Be and $^{124}$Sb/Be are employed to obtain the response of pure (undoped) cesium iodide at 80 K. The use of a low-noise, high-quantum-efficiency avalanche photodiode in combination with a novel waveshifter results in a 70 eV analysis threshold. This reach allows to observe signals from sub-keV nuclear recoils originating in neutron scattering. The extracted quenching factor drops much faster towards low energy than the extrapolation of a model developed for room-temperature CsI[Na]. We comment on the impact of our measurement on planned use of cryogenic CsI in neutrino physics and dark matter experiments.\n\n", "2512.09748": "2025-12-10, **Euclid preparation. Review of forecast constraints on dark energy and modified gravity**, Euclid Collaboration et.al., [2512.09748v1](http://arxiv.org/abs/2512.09748v1)\n\n The Euclid mission has been designed to provide, as one of its main deliverables, information on the nature of the gravitational interaction, which determines the expansion of the Universe and the formation of structures. Thus, Euclid has the potential to test deviations from general relativity that will allow us to shed light on long-lasting problems in the standard cosmological model, $Λ$CDM. Euclid will mainly do this by using two complementary probes: weak gravitational lensing and galaxy clustering. In this paper we review pre-launch Euclid analyses for dark energy and modified gravity. These include forecast constraints with future Euclid data on cosmological parameters for different cosmological models, such as a time-varying dark energy component, phenomenological modifications of the perturbation sector and specific modified gravity models, with further extensions that include neutrino physics and the coupling to the electromagnetic sector through the fine-structure constant. We review the study of the impact of nonlinear clustering methods on beyond-$Λ$CDM constraints with Euclid. This is of fundamental importance to efficiently predict the large-scale clustering of matter and dark matter halos, given that we will have access to a wealth of information on scales beyond the linear regime. We inspect the extension of theoretical predictions for observable quantities in alternative cosmologies to $Λ$CDM at fully nonlinear scales by means of $N$-body simulations. We discuss the impact of relativistic corrections in extended cosmological models. Overall, this review highlights the significant potential of the Euclid mission to tightly constrain parameters of dark energy and modified gravity models, or perhaps to detect possible signatures of a $Λ$CDM failure.\n\n", "2512.09287": "2025-12-10, **Nucleon decays into three leptons: contact contributions**, Yi Liao et.al., [2512.09287v1](http://arxiv.org/abs/2512.09287v1)\n\n Baryon number violating (BNV) nucleon decays into three leptons provide a unique probe of BNV interactions beyond the conventional two-body modes involving a single lepton and a light meson. In a previous work [Nucleon decays into three leptons: noncontact contributions, arXiv:2512.02692.], two of us analyzed the noncontact contributions to these decays arising from dimension-6 (dim-6) operators within the low-energy effective field theory (LEFT), and found that they are severely suppressed due to stringent constraints on these dim-6 operators. In this work, we continue this endeavor by systematically investigating the contact contributions originating from dim-9 LEFT operators. We construct a complete basis of dim-9 operators relevant to these processes, and subsequently match them onto chiral perturbation theory to calculate their decay widths. By employing existing experimental data, we derive stringent constraints on the relevant operators. In addition, we present the analysis of an ultraviolet-complete model to demonstrate its connection with our theoretical framework, thereby facilitating further studies of these exotic nucleon decays in upcoming neutrino experiments with large fiducial masses.\n\n", "2512.09063": "2025-12-09, **A novel two loop inverse seesaw model**, Gonzalo Benítez-Irarrázabal et.al., [2512.09063v1](http://arxiv.org/abs/2512.09063v1)\n\n We propose a Standard Model (SM) extension where neutrinos get masses through a two-loop inverse seesaw mechanism. This naturally explains the smallness of the neutrino masses and allows seesaw mediators to be at the TeV scale with testable phenomenology. The model adds two real singlet scalars and four electrically neutral leptons to the SM. The extension considers the existence of two global Abelian symmetries, a continuous $U(1)$ and a discrete $Z\\_3$. The latter, remains unbroken after spontaneous symmetry breaking and forbids tree-level and one-loop neutrino masses, and stabilizes the dark matter (DM) candidates. This setup accommodates neutrino-oscillation data, yields two pseudo-Dirac heavy pairs with small active-sterile mixing, and predicts an effective Majorana mass $m\\_{ee}$ in the $2.1$-$4.4$ meV range for normal ordering. Charged-lepton flavor violation is naturally suppressed yet testable: for a representative benchmark we obtain BR$(μ\\to e γ)\\simeq 1.6 \\times 10^{-14}$, with correlated signals in $μ\\to eee$ and $μ$-$e$ conversion within next-generation experimental reach. Altogether, the radiative origin of neutrino masses links low-energy flavor observables to collider signatures, delineating discovery targets for MEG II, Mu2e/COMET, and the HL-LHC and distinguishing this framework from conventional inverse- and radiative-seesaw models. Moreover, the $Z\\_3$ guarantees a stable DM candidate, either scalar ($ρ$) or fermionic ($Ω$). Then, here we analyze and identify the viable parameter space that is consistent with the observed DM relic abundance for both situations.\n\n", "2512.09052": "2025-12-09, **Neutrinos, B-L Symmetry and the Dark Dimension**, Miguel Montero et.al., [2512.09052v1](http://arxiv.org/abs/2512.09052v1)\n\n We consider realizations of a gauged B-L symmetry in the context of the Dark Dimension scenario, where the SM lives on a codimension one brane in 5d spacetime. The B-L can naturally be a bulk gauge symmetery leading to a global symmetry on the SM brane, and have its gauge anomaly canceled by charged bulk modes. This naturally leads to the existence of 3 right-handed neutrinos propagating in the dark dimension. Allowing for Higgsing of B-L by a bulk scalar at the Higgs scale, results in a massive gauge field with $m\\_{B-L}\\sim 100$ GeV and weak coupling $g\\_{B-L}\\sim 10^{-10}$ which is allowed by current bounds. The model also predicts a natural matching $m\\_ν\\sim m\\_{KK}\\simΛ^{1/4}$, thereby providing a theoretical explanation for the observed coincidence between neutrino masses and the Dark Energy scale. It also predicts a tower of sterile right-handed neutrinos in the $keV$ mass range.\n\n", "2512.09046": "2025-12-09, **Long-Lived-Particle Signals of a Composite Hidden Sector through the Neutrino Portal**, Aqeel Ahmed et.al., [2512.09046v1](http://arxiv.org/abs/2512.09046v1)\n\n We explore the signals of a scenario in which the composite states of a strongly coupled hidden sector couple to the Standard Model through the neutrino portal, giving rise to the neutrino masses. We consider a framework in which the hidden sector is conformal in the ultraviolet and the compositeness scale lies below the weak scale. If the lightest composite state in the hidden sector is a scalar, its decay rate back to the Standard Model is suppressed by angular momentum considerations and can naturally be small, giving rise to long-lived particle signals. We determine the current constraints on this class of models and explore the reach of future collider and beam dump searches. We find that FASER, SHiP, and Belle II can potentially probe a significant part of the unexplored parameter space.\n\n", "2512.09027": "2025-12-09, **Testing lepton non-unitarity with the next generation of (Germanium-based) CE$ν$NS reactor experiments**, Salvador Centelles Chuliá et.al., [2512.09027v1](http://arxiv.org/abs/2512.09027v1)\n\n Coherent elastic neutrino-nucleus scattering (CE$ν$NS) has been experimentally confirmed using neutrinos from pion decay at rest, solar neutrinos and reactor antineutrinos. Future CE$ν$NS experiments will foreseeable lead to precision measurements which will be a powerful tool to search for new physics beyond the Standard Model. In this work, we investigate possible deviations from unitarity in the $3\\times3$ leptonic mixing matrix that controls the propagation of active neutrinos. Such deviations may originate from the mixing with additional gauge singlet fermions and depending on their mass scale and mixing, the resulting phenomenology can differ substantially. We explore two well-motivated regimes: the \\textit{seesaw limit}, where the new fermions are heavy and kinematically inaccessible, leading to effective deviations from unitarity in the active sector; and the \\textit{light sterile limit}, where they are light enough to be produced and participate in neutrino propagation and scattering processes. We show how these scenarios modify both CE$ν$NS and elastic neutrino--electron scattering (E$νe$S), and we present the corresponding sensitivity projections for a future CE$ν$NS reactor experiment obtained by upscaling the CONUS+ experiment, which reported the first observation of reactor CE$ν$NS. We identify the leading experimental systematics relevant for such an upscaling and demonstrate the resulting capability to probe TeV-scale new physics. Our results highlight the strong potential of CE$ν$NS to test the structure of the lepton sector and to search for physics beyond the Standard Model.\n\n", "2512.08853": "2025-12-09, **New light mediators and the neutrino fog: Implications from XENONnT nuclear recoil data**, Valentina De Romeri et.al., [2512.08853v1](http://arxiv.org/abs/2512.08853v1)\n\n Current ton-scale, xenon-based dark matter (DM) direct detection experiments have now reached the sensitivity required to observe solar neutrinos, marking the onset of the so-called neutrino fog. In this work, we explore how this fog is modified when either neutrinos or DM interact with nuclei through a new scalar, vector, or axial-vector interaction, considering both heavy and light mediators. Using the latest nuclear-recoil data from XENONnT, which show indications of coherent elastic neutrino-nucleus scattering from $^8$B solar neutrinos, we derive new strong bounds on light mediator couplings. We find that these limits are significantly more stringent when the mediator couples to DM, rather than when new physics affects only neutrino interactions. Building on these results, we recompute the expected neutrino fog and compare it with the corresponding constraints on spin-independent and spin-dependent DM-nucleon interactions. We show that the morphology of the neutrino fog can be markedly modified if either neutrinos or DM interact with nuclei through light mediators, even in light of these recent constraints.\n\n", "2512.08822": "2025-12-09, **A search for successful and choked jets in nearby broad-lined Type Ic supernovae**, Tanner O'Dwyer et.al., [2512.08822v1](http://arxiv.org/abs/2512.08822v1)\n\n The observational link between long gamma-ray bursts (GRBs) and broad-lined stripped-envelope core-collapse supernovae (SNe Ic-BL) is well established. Significant progress has been made in constraining what fraction of SNe Ic-BL may power high- or low-luminosity GRBs when viewed at small off-axis angles. However, the GRB-SN connection still lacks a complete understanding in the broader context of massive-star evolution and explosion physics. Models predict a continuum of outcomes for the fastest ejecta, from choked to ultra-relativistic jets, and observations from radio to X-rays are key to probing these scenarios across a range of viewing angles and velocities. Here, we present results from a coordinated radio-to-X-ray campaign targeting nearby (z<=0.1) SNe Ic-BL designed to explore this diversity. With eight new radio-monitored events and updated data for one previously observed SN, we further tighten constraints on the fraction of SNe Ic-BL as relativistic as SN 1998bw/GRB 980425. We identify SN 2024rjw as a new radio-loud event likely powered by strong interaction with circumstellar material (CSM), and add evidence supporting a similar interpretation for SN 2020jqm. We also establish new limits on the properties of radio-emitting ejecta with velocities consistent with cocoons from choked jets, highlighting SN 2022xxf as a promising cocoon-dominated candidate. These results refine our understanding of the continuum linking ordinary SNe Ic-BL, engine-driven explosions, and GRBs, and contribute to building a sample that will inform future multi-messenger searches for electromagnetic counterparts to high-energy neutrinos.\n\n", "2512.08780": "2025-12-09, **Neutrino pair bremsstrahlung due to electromagnetic collisions in neutron star cores revisited**, P. S. Shternin et.al., [2512.08780v1](http://arxiv.org/abs/2512.08780v1)\n\n We reconsider the problem of neutrino pair bremsstrahlung emission originating from the electromagnetic collisions of charged particles in nucleonic ($npeμ$) neutron star cores. Two limiting cases are considered: (i) protons are in the normal state and (ii) protons are in the superconducting state. In both cases, the dominant contribution to the bremsstrahlung emissivity $Q^{\\mathrm{em}}\\_{\\mathrm{Br}}$ comes from the transverse part of in-medium electromagnetic interactions. For non-superconducting matter, we obtain an unusual $Q^{\\mathrm{em}}\\_{\\mathrm{Br}}\\propto T^{23/3}$ temperature dependence due to the dynamical character of plasma screening in the transverse channel, but considerably smaller values of $Q^{\\mathrm{em}}\\_{\\mathrm{Br}}$ than in previous studies, rendering the considered process unimportant in practice. In contrast, for superconducting and superfluid matter, the neutrino emission processes involving nucleons are suppressed and $Q^{\\mathrm{em}}\\_{\\mathrm{Br}}$ due to lepton collisions provides the residual contribution to the neutrino emissivity of neutron star core matter. In the superconducting case, the plasma screening becomes static and the standard $Q^{\\mathrm{em}}\\_{\\mathrm{Br}}\\propto T^{8}$ temperature scaling is restored. Simple analytical expressions for $Q^{\\mathrm{em}}\\_{\\mathrm{Br}}$ in both limiting cases are provided.\n\n", "2512.08752": "2025-12-09, **Neutrino mass constraints in the context of 4-parameter dark energy equation of state and DESI DR2 observations**, Gowri S Nair et.al., [2512.08752v1](http://arxiv.org/abs/2512.08752v1)\n\n Cosmological constraints on the total neutrino mass, $\\sum m\\_ν$, are strongly shaped by assumptions about the dark-energy equation of state due to the well-known degeneracy between massive neutrinos and late-time cosmic acceleration. In this work, we move beyond the two-parameter Chevallier-Polarski-Linder (CPL) form adopted in recent DESI analyses and re-examine neutrino mass constraints using a flexible four-parameter dark energy equation of state (4pDE). We implement the 4pDE model in a modified version of CLASS and perform a full MCMC analysis using Planck, DESI DR2 BAO, and Pantheon+ data. Relative to our previous 4pDE study based on pre-DESI BAO datasets, the inclusion of DESI DR2 substantially tightens the constraints on the transition parameters while still yielding a relaxed neutrino-mass bound compared to $Λ$CDM, $\\sum m\\_ν< 0.101$ eV ($95\\%$ C.L.). This upper limit is more stringent than the DESI DR2 constraint obtained within the $w\\_0w\\_a$CDM framework. From the best-fit parameters, we reconstruct the evolution of the 4pDE equation of state along with both $68\\%$ and $95\\%$C.L. We do not find a statistically significant phantom-crossing at $z \\sim 0.5$, consistent with the conclusion from the DESI collaboration; at higher redshifts, the reconstructed $w(z)$ follows the CPL evolution and deviates only at low redshift. Additionally we also find reduction in $Δχ^2\\_{\\rm min}=-7.3$ compared to $Λ$CDM model.\n\n", "2512.08539": "2025-12-09, **Further study on the lepton mass spectra and flavor mixing with $S_{3L} \\times S_{3R}$ flavor symmetry**, Chang-Qi Hu et.al., [2512.08539v1](http://arxiv.org/abs/2512.08539v1)\n\n Neutrino oscillation experiments have confirmed that neutrinos are massive particles and lepton flavors are mixed. To explain the observed lepton mass spectra and flavor mixing patterns, flavor symmetry plays a crucial and unique role. In this paper, we propose a useful symmetry-breaking scheme by applying $S\\_{3L} \\times S\\_{3R} \\rightarrow S\\_{2L} \\times S\\_{2R} \\rightarrow \\emptyset$ within both charged-lepton and neutrino sectors at the mass-matrix level. For the three distinct residual subgroups $S\\_{2L}^{(23)} \\times S\\_{2R}^{(23)}$, $S\\_{2L}^{(13)} \\times S\\_{2R}^{(13)}$ and $S\\_{2L}^{(12)} \\times S\\_{2R}^{(12)}$ under consideration, we systematically analyze the various parameterizations of the lepton mass matrices. It is shown that all the three scenarios are in good agreement with current neutrino oscillation data. Notably, within the latest best-fit values of neutrino oscillation parameters, the predicted Dirac CP-violating phase $δ$ is calculated to be $294.6^\\circ$, $302.3^\\circ$ and $287.0^\\circ$, respectively. To further assess the viability of the model, a comprehensive numerical analysis is performed by utilizing neutrino oscillation parameters at the $3σ$ level. It is found that the allowed range of $δ$ is $281.2^\\circ \\rightarrow 338.7^\\circ$, $287.0^\\circ \\rightarrow 342.2^\\circ$ and $282.7^\\circ \\rightarrow 297.0^\\circ$, all fall within its $3σ$ range. These results indicate that the proposed symmetry-breaking scheme $S\\_{3L} \\times S\\_{3R} \\rightarrow S\\_{2L} \\times S\\_{2R} \\rightarrow \\emptyset$ can naturally explain the realistic lepton mass hierarchy and mixing pattern, thereby providing valuable theoretical perspectives for future research.\n\n", "2512.08523": "2025-12-09, **Superluminal constraints from ultra-high-energy neutrino events**, J. M. Carmona et.al., [2512.08523v1](http://arxiv.org/abs/2512.08523v1)\n\n The $\\sim 100\\,$PeV neutrino detected by KM3NeT marks the beginning of ultra-high-energy neutrino astronomy and provides a powerful probe of Lorentz Invariance Violation (LIV). In superluminal scenarios, neutrinos can decay through vacuum $e^-e^+$ pair emission or neutrino splitting. Previous analyses of the KM3-230213A event relied on simplified survival-probability estimates and, in some cases, used inaccurate decay-width expressions or neglected redshift and threshold effects. In this work we present a unified and self-consistent framework that corrects these issues and applies to both the energy-independent ($n=0$) and quadratic ($n=2$) superluminal cases. We collect and recast the decay-width and threshold expressions, clarify their flavor dependence, and include a consistent treatment of cosmological propagation. We also assess the impact of cascade regeneration and show that cascade effects are negligible for the purpose of setting LIV bounds. The survival-probability approximation adopted in previous works is therefore justified, while our framework provides a coherent basis for future analyses of superluminal neutrino constraints, which should consistently include possible time-delay signatures.\n\n", "2512.08361": "2025-12-09, **Impact of antiparticle degrees of freedom on neutrino flavor oscillations in frames of quantum field theory**, Maxim Dvornikov et.al., [2512.08361v1](http://arxiv.org/abs/2512.08361v1)\n\n We study neutrino flavor oscillations using the approach based on the quantum field theory (QFT), where neutrinos are taken to be virtual particles. One deals with the propagators of neutrino mass eigenstates in this formalism. Previously, while applying this approach to neutrino oscillations in external fields, we decomposed the propagators and used only the particle contribution in the calculation of the matrix element. In the present work, we carefully justify the validity of this kind of transformation by considering neutrino oscillations in vacuum. In principle, the results obtained can be extended for the QFT applied to neutrino oscillations in external fields.\n\n", "2512.08301": "2025-12-09, **Isocurvature Induced Gravitational Waves at Pulsar Timing Arrays**, Yi-Fu Cai et.al., [2512.08301v1](http://arxiv.org/abs/2512.08301v1)\n\n Gravitational waves (GWs) are powerful probes of new physics in the early Universe. In particular, GWs induced by primordial isocurvature perturbations encode information of novel dynamics beyond the standard $Λ$CDM model. Existing studies of isocurvature induced GWs focus on a particular type: cold dark matter (CDM) isocurvature. In this work, we present a more comprehensive study of four kinds of isocurvature involving CDM, baryons, neutrinos and free-streaming dark radiation (DR). We first reformulate initial conditions of isocurvature with coupled neutrinos because modes relevant for observations at Pulsar Timing Arrays enter the horizon before neutrino decoupling. With these new initial conditions, neutrino isocurvature is phenomenologically similar to CDM isocurvature up to an overall coefficient, which leads to an interesting conversion of isocurvature between radiation and matter sectors. We then find that the spectrum of isocurvature induced GWs from free-streaming DR is qualitatively different than that from CDM due to the presence of anisotropic stress. Unlike GWs induced by CDM isocurvature that are suppressed at high frequencies due to matter density being suppressed at early times, DR isocurvature induced GWs is proportional to the constant ratio between DR density and total radiation. Finally, we utilize two general parametrizations of the isocurvature power spectrum: a delta function and a broken power law, and derive novel constraints with recent NANOGrav data. Our results set stringent constraints on isocurvature around $10^{6}\\,\\textrm{Mpc}^{-1}$, which are complementary to cosmological observations at large scales.\n\n"}, "dark matter": {"2512.09891": "2025-12-10, **Self-consistent secondary cosmic microwave background anisotropies and extragalactic foregrounds in the FLAMINGO simulations**, Tianyi Yang et.al., [2512.09891v1](http://arxiv.org/abs/2512.09891v1)\n\n Secondary anisotropies in the cosmic microwave background (CMB) contain information that can be used to test both cosmological models and models of galaxy formation. Starting from lightcone-based HEALPix maps and catalogues, we present a new set of mock CMB maps constructed in a self-consistent manner from the FLAMINGO suite of cosmological hydrodynamical simulations, including CMB lensing, thermal and kinetic Sunyaev-Zeldovich effects, cosmic infrared background, radio point source and anisotropic screening maps. We show that these simulations reproduce a wide range of observational constraints. We also compare our simulations with previous predictions based on dark matter-only simulations which generally model the secondary anisotropies independently from one another, concluding that our hydrodynamical simulation mocks perform at least as well as previous mocks in matching the observations whilst retaining self-consistency in the predictions of the different components. Using the model variations in FLAMINGO, we further explore how the signals depend on cosmology and feedback modelling, and we predict cross-correlations between some of the signals that differ significantly from those in previous mocks. The mock CMB maps should provide a valuable resource for exploring correlations between different secondary anisotropies and other large-scale structure tracers, and can be applied to forecasts for upcoming surveys.\n\n", "2512.09760": "2025-12-10, **Reconciling ALP Dark Matter and Electroweak Baryogenesis through First-Order Electroweak Phase Transition**, Dipendu Bhandari et.al., [2512.09760v1](http://arxiv.org/abs/2512.09760v1)\n\n We show that an axionlike particle (ALP) can simultaneously generate the baryon asymmetry and constitute dark matter through dynamics triggered by a first-order electroweak phase transition (EWPT). In our proposal, the transition briefly reshapes the ALP potential via a temperature-dependent vacuum expectation value of a scalar field $S$, responsible for making the EWPT of first order, inducing a transient mass enhancement of ALP via higher-dimensional $U(1)$-breaking operator(s). This sudden kick generates a large ALP velocity near the onset of EWPT enabling the broadening of relic satisfied parameter space and predict a complementary stochastic gravitational-wave signal from the underlying first-order transition. We further show that the same ALP dynamics can naturally fuel electroweak baryogenesis through its coupling to electroweak anomaly.\n\n", "2512.09567": "2025-12-10, **3-Dimensional WIMP Effective Velocity Distribution**, Chung-Lin Shan et.al., [2512.09567v1](http://arxiv.org/abs/2512.09567v1)\n\n In this talk, I discussed a 3-dimensional \"effective\" velocity distribution of Weakly Interacting Massive Particles (WIMPs), which, instead of the theoretically predicted velocity distribution of \"entire\" Galactic Dark Matter particles, describes the actual velocity distribution of WIMPs \"scattering off\" (specified) target nuclei in an underground detector. Based on numerical results carried out by our double Monte Carlo scattering-by-scattering simulation of 3-dimensional elastic WIMP-nucleus scattering, an (asymmetric) \"forward-backward asymmetry\" was also demonstrated.\n\n", "2512.09512": "2025-12-10, **SLICE -- Combining Strong Lensing and X-ray in AC\\,114. Insights into the Merger Scenario**, Marceau Limousin et.al., [2512.09512v1](http://arxiv.org/abs/2512.09512v1)\n\n AC114 is a historically significant galaxy cluster, being one of the first strong lensing clusters detected from the ground in the early 1990s, prior to the launch of the HST. Despite this early prominence, no detailed lensing analyses have been carried out for more than fifteen years. We here study this cluster using JWST imaging obtained as part of the SLICE program, complemented by archival HST and X-ray observations. JWST data reveal ten new multiply imaged systems and enable the identification of conjugate substructures in several of the sixteen systems, significantly increasing the number of strong lensing constraints. Using these data, we construct a parametric mass model with Lenstool and extend it by explicitly incorporating the Chandra data in a combined strong lensing+X-ray fit. Our best-fit model reproduces the multiple images with an RMS of 0.4\" while simultaneously matching the X-ray data. The dark matter distribution is unimodal and centered on the brightest cluster galaxy, with a large core radius of 83+-5kpc, consistent with values reported in other strong lensing clusters. The strong lensing constraints require the inclusion of an external shear component which position angle points unambiguously towards a nearby (~1Mpc), well defined mass concentration at the same redshift in the North-West, for which we propose the naming AC114b. The spatial coverage of the XMM-Newton data encompasses the whole structure, allowing us to probe the X-ray properties of the companion cluster and the thermodynamics of AC114, providing evidence for a major merger, in line with previous signatures seen in Chandra, radio and optical spectroscopic data. Our results shed new light on the merging scenario, revealing a major merger caught in a late post-collisional phase, where AC114 is the dominant system and Ac114b has likely been stripped of its hot gas.\n\n", "2512.09498": "2025-12-10, **Dirac vs. Majorana Dark Matter Imprints on Neutron Star Observables**, M. Bhuyan et.al., [2512.09498v1](http://arxiv.org/abs/2512.09498v1)\n\n The fundamental character of a fermionic dark matter, whether it is a Dirac or Majorana particle remains a key unresolved issue whose answer would profoundly affect dark-sector phenomenology and detection strategies thereby motivates complementary probes across particle and astrophysical experiments. Compact stars, particularly neutron stars, offer unique astrophysical laboratories for probing such fundamental properties under extreme densities. The presence of a fermionic DM admixed with nuclear matter can modify the equation of state, thereby affecting observable quantities such as the mass-radius (M-R) relation and tidal deformability. In this work, we investigate how the intrinsic particle nature of fermionic DM influences neutron star structure. Within a relativistic mean-field framework extended by a scalar (or Higgs like) portal coupling between DM and nucleons, we construct self-consistent equation of states for both Dirac and Majorana cases and solve the Tolman-Oppenheimer-Volkoff equations to obtain stellar configurations. Owing to the difference in internal degrees of freedom, Dirac DM (four degrees of freedom) generally softens the equation of state more strongly than Majorana DM (two degrees of freedom), leading to smaller radii and lower maximum masses. We identify the parameter space consistent with current NICER and gravitational-wave constraints, highlighting the potential of compact-star observations to discriminate between Dirac and Majorana dark matter.\n\n", "2512.09404": "2025-12-10, **Dark Matter and Dark Energy in Three-Higgs Doublet Model**, Mohid Farhan et.al., [2512.09404v1](http://arxiv.org/abs/2512.09404v1)\n\n This article discusses the incorporation of dark matter and dark energy into a new physics model called the Three-Higgs Doublet Model. Dark matter and dark energy are accommodated as CP-even and $Z\\_2$-odd scalars in their respective inert doublets. By leveraging a $Z\\_2$ symmetry to suppress certain interactions, we model the behavior of dark matter. Similarly, by imposing a shift symmetry, dark energy can be mimicked within the same framework for the current cosmic epoch. The dark matter relic density is calculated for our model using \\texttt{micrOMEGAs}. It is shown that despite the inclusion of dark energy, dark matter relic density can be brought within observational bounds and match existing literature. Furthermore, the one-loop and two-loop Renormalization Group Equations (RGEs) were computed using \\texttt{SARAH} to ensure radiative stability over a large range of energies. This study lays the groundwork for a future study of dark matter-dark energy interactions in the early universe and the exploration of different early universe dynamics.\n\n", "2512.09353": "2025-12-10, **Bimetric MOND as a framework for variable-$G$ theories -- local systems and cosmology**, Mordehai Milgrom et.al., [2512.09353v1](http://arxiv.org/abs/2512.09353v1)\n\n Bimetric MOND (BIMOND) is used as a platform for variable-$G$ theories that have MOND-specific idiosyncrasies. E.g., MOND premises dictate return to standard dynamics in the high-acceleration limit, predicting the standard value of $G$ for high-acceleration systems. This automatically ensures compliance of such theories with all the constraints on inconstancy of $G$ that emerge from the study of high-acceleration systems: geophysics, solar system, pulsars, supernovae, stellar evolution, emission of gravitational waves, etc. In MOND, constraints deduced from such phenomena have no bearing on possible $G$ variability in cosmology. My guiding motivation is to see if such theories may account for some roles of dark matter in cosmology; e.g., in accounting for the expansion history of the Universe in the matter-dominated era, by having a $G\\_e\\approx 2πG$ govern the later stages of the expansion, instead of invoking matter density $\\approx 2π\\times$ baryon density. Without adding degrees of freedom, or new dimensionful constants, BIMOND can be extended to a class of theories that entail what is best described as phenomenon-dependence of Newton's constant, $G$. I cannot yet present a consistent model that complies with all the observations in cosmology, including the expansion history, with all its details. Instead, I describe some examples of theories in the class that predict different values of $G\\_e$ in different circumstances, including one where $G$ takes its standard value for all subcosmological systems -- even if they are deep in the MOND regime. I also discuss scenarios in which $G\\_e\\approx G$ in the early Universe, as required by constraints from big-bang nucleosynthesis, but with $G\\_e> G$ setting in at later times, where it can affect the expansion history during the matter-dominated era.\n\n", "2512.09342": "2025-12-10, **The stellar and dark matter distributions in elliptical galaxies measured by stacked weak gravitational lensing**, Momoka Fujikawa et.al., [2512.09342v1](http://arxiv.org/abs/2512.09342v1)\n\n We investigate stellar mass and central dark matter density profiles of photometric luminous red galaxies with stellar masses of $\\sim10^{10}-10^{12}M\\_\\odot$ using weak gravitational lensing measurements from the Hyper Suprime-Cam Subaru Strategic Program data obtained with the Subaru Telescope. By stacking weak lensing signals from a large number of galaxies, we obtain average tangential shear profiles down to $\\sim 10\\,\\mathrm{kpc}/h$, which are fitted assuming a two-component model consisting of stellar and dark matter components to constrain their central dark matter distribution. We find a preference for non-zero core radii of dark matter distributions in galaxies with stellar masses of $\\sim 10^{11}M\\_\\odot$. Our results imply a stronger feedback effect than that typically predicted by current hydrodynamical simulations. In addition, we provide a new constraint on the stellar-to-halo mass relation, where both stellar and halo masses are, for the first time, directly constrained by weak gravitational lensing. Our results prefer the stellar initial mass function (IMF) that is more bottom-heavy than the Salpeter IMF.\n\n", "2512.09072": "2025-12-09, **Comparative Study of Dark Matter Relic Density in IDM, MSSM and NMSSM**, Mohid Farhan et.al., [2512.09072v1](http://arxiv.org/abs/2512.09072v1)\n\n This article presents a computational comparison of relic density predictions for three prominent frameworks Beyond the Standard Model (BSM): the Inert Doublet Model (IDM), the Minimal SuperSymmetric Standard Model (MSSM), and the Next-to-Minimal SuperSymmetric Standard Model (NMSSM). Using MicrOMEGAs, we calculate relic densities over varying mass ranges in the low coupling regime. We highlight key differences in each model's behavior relative to current observational bounds and identify viable mass regions. The findings contribute towards guiding model selection based on relic density constraints and suitability.\n\n", "2512.09023": "2025-12-09, **The eventful life journey of galaxy clusters. II. Impact of mass accretion on the thermodynamical structure of the ICM**, David Vallés-Pérez et.al., [2512.09023v1](http://arxiv.org/abs/2512.09023v1)\n\n Context. The internal structure of the intracluster medium (ICM) is tightly linked to the assembly history and physical processes in groups and clusters, but the role of recent accretion in shaping these profiles has not been fully explored.   Aims. We investigate to what extent mass accretion accounts for the variability in ICM density and thermodynamic profiles, and what can present-day structures reveal about their formation histories.   Methods. We analyze a hydrodynamical cosmological simulation including gas cooling but no feedback, to isolate the effects of heating from structure formation. Median profiles of ICM quantities are introduced as a robust description of the bulk ICM. We then examine correlations between mass accretion rates or assembly indicators with the profiles of temperature, entropy, pressure, gas and dark-matter density, as well as their scatter.   Results. Accretion in the last dynamical time strongly lowers central gas densities, while leaving dark matter largely unaffected, producing a distinct signature in the baryon depletion function. Pressure and entropy show the clearest dependence on accretion, whereas temperature is less sensitive. The radii of steepest entropy, temperature, and pressure shift inward by $\\sim (10-20)\\%$ between high- and low-accretion subsamples. Assembly-state indicators are also related to the location of these features, and accretion correlates with the parameters of common fitting functions for density, pressure, and entropy.   Conclusions. Recent accretion leaves measurable imprints on the ICM structure, highlighting the potential of thermodynamic profiles as diagnostics of cluster growth history.\n\n", "2512.09019": "2025-12-09, **Search for Dark Matter Annihilation and Decay with H$α$ Line Emission**, Rebecca K. Leane et.al., [2512.09019v1](http://arxiv.org/abs/2512.09019v1)\n\n I present a new indirect search for dark matter (DM) using Hydrogen-$α$ (H$α$) recombination emission. DM annihilation or decay products can ionize neutral gas; subsequent recombination cascades generate H$α$ photons through the $3\\rightarrow2$ transition. In quiet gas-rich dwarf galaxies, the $n{=}2$ population is negligible, so H$α$ is effectively unabsorbed and traces the DM-energy injection site. Using the non-detection of extended H$α$ emission in the Leo T dwarf galaxy with Multi Unit Spectroscopic Explorer (MUSE) observations, I derive the first H$α$-based limits on DM annihilation and decay, reaching leading sensitivity for parts of the eV-GeV mass range. Existing and upcoming telescopes can further extend this reach, establishing H$α$ imaging as a powerful DM search strategy.\n\n", "2512.08904": "2025-12-09, **Regular black hole sourced by the Dehnen-type distribution of matter: The sound of the event horizon**, Erdinç Ulaş Saka et.al., [2512.08904v1](http://arxiv.org/abs/2512.08904v1)\n\n We compute the fundamental and overtone quasinormal modes of a regular, asymptotically flat black hole supported by a Dehnen-type matter halo. Gravitational perturbations in this background split into two distinct axial sectors, and our analysis confirms that the presence of the halo parameter $a$ breaks the isospectrality that holds in vacuum. The dependence of the quasinormal spectrum on $a$ is moderate for the fundamental modes and even weaker for the overtones, which approach one another in the complex-frequency plane as the halo parameter increases. No enhancement or rapid growth of overtone amplitudes is observed, indicating that the halo does not induce the type of strong near-horizon effects characteristic of quantum-corrected or exotic compact objects. Overall, our results show that the dark-matter halo introduces controlled and comparatively mild modifications to the ringdown spectrum while preserving its qualitative structure.\n\n", "2512.08807": "2025-12-09, **Interpreting the current Higgs excesses at the LHC in the 2HD+a framework**, Giorgio Arcadi et.al., [2512.08807v1](http://arxiv.org/abs/2512.08807v1)\n\n There are several excesses of events in current LHC data, yet not exceeding the level of significance which would make them to be considered as firm. They point to the possibility of the presence of a new Higgs particle in the spectrum, in addition to the already observed 125 GeV state. In particular, there are excesses involving a diphoton resonance at invariant masses of about 95 GeV, 152 GeV and 650 GeV and an extra scalar might accompany the recent observation of a toponium at a mass of about 350 GeV. Several interpretations of these excesses have been attempted in extensions of the Standard Model. In this paper, we aim to explain them in the framework of a two Higgs doublet model supplemented by a relatively light pseudoscalar Higgs boson $a$ which would correspond to the putative resonance in most cases. This realistic 2HD+a scenario is attractive as it is has the virtue to pass all experimental constraints from high-precision experiments and collider searches and, at the same time, to allow for a viable explanation of the dark matter in the universe. We first update the present constraints on the model, in particular taking into account the latest results on dark matter and Higgs searches, as well the high-precision measurements, including those from Higgs and flavor physics. We then show that the additional Higgs states with the proper mass spectrum and adjusted couplings to fermions, would explain all the LHC excesses (but individually) while passing the former experimental constraints as well as the theoretical ones.\n\n", "2512.08718": "2025-12-09, **The bound state of dark atom with the nucleus of substance**, T. E. Bikbaev et.al., [2512.08718v1](http://arxiv.org/abs/2512.08718v1)\n\n The hypothesis of composite $XHe$ dark atoms offers a compelling framework to address the challenges in direct dark matter particles detection, as their neutral, atom-like configuration evades conventional experimental signatures. A critical issue may arise in interaction between $XHe$ and atomic nuclei due to the unshielded nuclear attraction, which could destabilize the dark atom's bound state. To resolve this, we propose a novel numerical quantum mechanical approach that accounts for self-consistent electromagnetic-nuclear couplings. This method addresses to eliminate the inherent complexity of the $XHe$-nucleus three-body system, where analytical solutions are intractable. By reconstructing the effective interaction potential - including dipole Coulomb barrier and shallow potential well - we demonstrate how these features lead to the formation of $XHe$-nucleus bound states and modulate low-energy capture processes. Our model enables validation of the dark atom hypothesis, particularly in interpreting experimental anomalies like annual modulation signals observed in DAMA/LIBRA. These findings advance the theoretical foundation for dark matter interactions and provide a robust framework for future experimental design.\n\n", "2512.08622": "2025-12-09, **Freeze-in Production of Non-Abelian Millicharged Vector Dark Matter**, Van Que Tran et.al., [2512.08622v1](http://arxiv.org/abs/2512.08622v1)\n\n We present the first predictive realization of vector freeze-in dark matter from a hidden non-Abelian gauge sector, spontaneously broken to a residual $U(1)$ with a massless dark photon mediator. A massive dark vector particle-antiparticle pair acquires small millicharges via a dimension-five kinetic mixing operator that induces a dimension-four mixing term with effective coefficient $ε$, and interacts through the hidden gauge coupling $g\\_D$, linking it weakly to the Standard Model. Solving the relic abundance with a two-temperature Boltzmann evolution including plasmon decays, we find that $ε, g\\_D \\sim 10^{-7}$ reproduce the observed density while satisfying astrophysical and cosmological bounds. This minimal framework links non-Abelian vector dynamics, long-range dark forces, and dark matter, and can be testable with upcoming sub-GeV dark matter direct-detection experiments.\n\n", "2512.08616": "2025-12-09, **New dark matter production mechanism and the gravitational wave signals**, Fa Peng Huang et.al., [2512.08616v1](http://arxiv.org/abs/2512.08616v1)\n\n The microscopic origin and production mechanism of dark matter (DM) remain central questions in cosmology and particle physics. While thermal freeze-out has long dominated DM model building, alternative non-thermal scenarios are gaining prominence. In this work, we explore novel production channels for heavy DM candidates, including pseudo-Nambu-Goldstone bosons (pNGBs), Q-balls, and filtered DM arising from early-universe phenomena such as primordial black hole (PBH) evaporation, superradiance, and first-order phase transitions. We demonstrate that these mechanisms naturally generate gravitational wave signals detectable by future observatories, such as LISA, TianQin, Taiji, and Cosmic Explorer. This multi-messenger approach offers a promising pathway to probe the origin and nature of DM beyond conventional paradigms.\n\n", "2512.08603": "2025-12-09, **Pulse Shape Discrimination for Germanium Detectors using Variational Quantum Circuits**, Fabrizio Napolitano et.al., [2512.08603v1](http://arxiv.org/abs/2512.08603v1)\n\n Pulse shape discrimination (PSD) is a critical component in background rejection for neutrinoless double-beta decay and dark matter searches using Broad Energy Germanium (BEGe) detectors. To date, advanced discrimination has relied on Deep Learning approaches employing e.g. Denoising Autoencoders (DAE) and Convolutional Neural Networks (CNN). While effective, these models require tens of thousands of parameters and heavy pre-processing. In this work, we present, to the best of our knowledge, the first application of Quantum Machine Learning (QML) to real, experimental pulse waveforms from a germanium detector. We propose a quantum-classical hybrid approach using Variational Quantum Circuits (VQC) with amplitude encoding. By mapping the 1024-sample waveforms directly into a 10-qubit Hilbert space, we demonstrate that a VQC with only 302 trainable parameters achieves a receiver operating characteristic (ROC) area under the curve (AUC) of 0.98 and a global accuracy of 97.1%. This result demonstrates that even in the current Noisy Intermediate-Scale Quantum (NISQ) era, quantum models can match the performance of state-of-the-art classical baselines while reducing model complexity by over two orders of magnitude. Furthermore, we envision a scenario where future quantum sensors transmit quantum states directly to such processing units, exploiting the exponentially large Hilbert space in a natively quantum pipeline.\n\n", "2512.08517": "2025-12-09, **On the existence of bound states in SIMP dark sectors**, Xiaoyong Chu et.al., [2512.08517v1](http://arxiv.org/abs/2512.08517v1)\n\n In strongly interacting massive particle (SIMP) scenarios, dark matter is comprised of stable dark pions whose $3\\to 2$ or $4\\to 2$ reactions set the dark matter relic abundance. Recent work has shown that shallow two-pion bound states significantly affect the freeze-out, but did not establish whether such states actually form. In this work we demonstrate that a scalar isosinglet bound state does exist in a well-defined region of parameter space by solving an on-shell Lippmann--Schwinger equation in a chiral-unitary framework and analyzing the $S$-wave $ππ$ amplitude in the complex energy plane. We determine the range of $m\\_π/f\\_π$ for which a pole appears below the two-pion threshold, extract the corresponding residue, and, in the non-relativistic limit, obtain the bound-state wave function at the origin, $\\|Ψ(0)\\|$, which controls bound-state-assisted annihilation and decay rates relevant for catalyzed freeze-out. Comparing this T-matrix based result with variational estimates using simple finite-range potentials, we find agreement within order-one factors for shallow binding. For binding energies of order the freeze-out temperature, $E\\_B \\sim m\\_π/20$, we obtain $\\|Ψ(0)\\|\\sim \\mathcal{O}(0.1)\\,m\\_π^{3/2}$, thereby supporting the parametric assumptions used in previous phenomenological analyses.\n\n", "2512.08515": "2025-12-09, **Reviving $Z^\\prime$ Portal Dark Matter with Conversion Mechanism**, Zhen-Wei Wang et.al., [2512.08515v1](http://arxiv.org/abs/2512.08515v1)\n\n In many new physics models with extended gauge symmetry, the new gauge boson $Z'$ could mediate the interactions between the dark matter and standard model particles. For the conventional $Z^\\prime$ portal dark matter, the collider and the direct detection constraints typically pose a significant challenge. To address this pressing issue, we present in this paper a new benchmark model based on the gauged $U(1)\\_{B-L}$ symmetry, which introduces a Dirac dark fermion $\\tildeχ\\_1$ and a heavier partner $\\tildeχ\\_2$ with zero and nonzero $U(1)\\_{B-L}$ charge, respectively. Including the mass term $δm \\bar{\\tildeχ}\\_1\\tildeχ\\_2$ results in the dark fermions $χ\\_1$ and $χ\\_2$ in the mass eigenstate, where the lighter one $χ\\_1$ is regarded as the dark matter candidate. Various intriguing processes for the relic density arise with the compressed mass spectrum $m\\_{χ\\_1}\\simeq m\\_{χ\\_2}$, such as the coscattering $χ\\_2f\\toχ\\_1f$, the conversion $χ\\_2χ\\_i\\toχ\\_1χ\\_j$, and the coannihilation $χ\\_1χ\\_2\\to f\\bar{f}$ processes. Suppressed by the small mixing angle $θ$ between the dark fermions, the small effective gauge coupling of dark matter $χ\\_1$ to the gauge boson $Z'$ is one distinct feature of this model, rendering phenomenology in many aspects more promising. In this paper, we investigate the production of dark matter through new mechanisms within the frameworks of resonance and secluded scenarios. The impacts of phenomenological constraints from collider, dark matter, and cosmology are also taken into account. We report that the conversion mechanism is both favored by the resonance and secluded scenarios under current constraints.\n\n", "2512.08368": "2025-12-09, **Probing Cosmic Strings via Black Hole Quasinormal Modes in Gravitational Wave Astronomy**, Ishan Swamy et.al., [2512.08368v1](http://arxiv.org/abs/2512.08368v1)\n\n Black holes, the simplest solution to Einstein's field equations, do not emit light, making their observations a major challenge for researchers. However, discovery of binary black holes (BBHs) in 2015 by LIGO has transformed the study of compact objects, with over 300 BBHs recorded, providing a new avenue for probing new physics. GWs remain a prominent and precise method of observing not only BBHs, but also dark matter and cosmic strings. Cosmic strings -- hypothetical one dimensional topological defects formed in the early universe, are yet to be observed, with multiple detection methods such as particle radiation, gravitational waves and lensing being proposed. Here we present a novel framework to search for cosmic strings by modeling them as perturbations within non-rotating black hole spacetime, focusing on their imprint on the spectrum of quasinormal modes (QNMs). Our numerical simulations identify a lower limit on perturbation strength, $λ\\sim 10^{-10}$ for uncharged string and $λ\\sim 10^{-7}$ for charged string, below which cosmic string effects become unobservable in QNM signals. By analyzing eigenvalue splitting and centers, we show that cosmic string properties impart distinct and detectable features to GW signals. Our results establish QNM analysis as a powerful, alternative observational strategy for constraining or detecting cosmic strings, and offer an inverse approach to estimate string energy or charge if a signal is detected. With upgrades in LIGO technologies and advanced multimessenger astronomy under development, these findings highlight new potential for detecting cosmic strings.\n\n"}, "supernova": {"2512.09878": "2025-12-10, **GFH-v2 Pipeline for Searches of Long-Transient Gravitational Waves from Newborn Magnetars**, Sandhya Sajith Menon et.al., [2512.09878v1](http://arxiv.org/abs/2512.09878v1)\n\n This paper presents an enhanced methodology for searching long transient gravitational waves associated with a newborn magnetar using a strongly improved version of the generalized Frequency Hough Transform algorithm, called GFH-v2. We describe the main developments introduced relative to the original implementation and outline the optimized parameter-space selection used in the search. We then compute the theoretical sensitivity of the method and compare it with an empirical sensitivity estimate obtained by injecting simulated signals into LIGO-Virgo-KAGRA O4a data. The updated framework achieves improved sensitivity and computational performance. These results provide a robust basis for future directed searches for long-transient gravitational-wave signals from core-collapse supernovae and other transient events in current and upcoming observing runs.\n\n", "2512.09866": "2025-12-10, **Beyond Two Parameters: Revisiting Dark Energy with the Latest Cosmic Probes**, Hanyu Cheng et.al., [2512.09866v1](http://arxiv.org/abs/2512.09866v1)\n\n Dark energy (DE) models with many free parameters are often considered excessive, as constraining all parameters poses a significant challenge. On the other hand, such models offer greater flexibility to probe the DE sector in more detail. With the rapid advancement of astronomical surveys and the availability of diverse datasets, it is timely to examine whether current combined observations can effectively constrain an extended parameter space in DE models. This article investigates a four-parameter dynamical dark energy (DDE) model that spans a broad region of the universe's expansion history through four key parameters: the present-day value of the DE equation of state ($w\\_0$), its initial value ($w\\_m$), the scale factor depicting transition from $w\\_m$ to $w\\_0$ occurs ($a\\_t$), and the steepness of this transition ($Δ\\_{\\rm de}$). We constrain the model using CMB data from Planck, BAO from DESI DR2, and three distinct compilations of Type Ia Supernovae: PantheonPlus, DESY5, and Union3. Our results show that constraining all four parameters remains difficult: $a\\_t$ is not constrained by any dataset, while the remaining three parameters can be constrained only when all observational probes are combined (with the exception of DESY5). The results further show that DE has a quintessential nature at present ($w\\_0 > -1$), while $w\\_m$ is negative, indicating a phantom-like behaviour at early times. Interestingly, despite its larger parameter space, the proposed DDE model is preferred over the $Λ$CDM scenario, based on both $Δχ^2$ and Bayesian evidence, for certain combined datasets, particularly CMB+BAO+DESY5 and CMB+BAO+Union3.\n\n", "2512.09744": "2025-12-10, **Tachyonic dark energy- Constraints from current observations**, Ramanpreet Singh et.al., [2512.09744v1](http://arxiv.org/abs/2512.09744v1)\n\n Recent observations from the Dark Energy Spectroscopic Instrument (DESI) survey have reignited the debate on the true nature of dark energy, challenging the standard cosmological constant model of cosmology. The results suggest a preference for dark energy to be dynamical rather than a cosmological constant. Several recent analyses of DESI data indicate that the universe's expansion may not be accelerating in the way suggested by supernova based cosmology. Motivated by these studies, we investigated a tachyon type scalar field $φ$ as a model for dark energy, assuming an exponential potential for the field and performed parameter estimation using Markov Chain Monte Carlo (MCMC) techniques. Such a model offers solutions that have $w \\sim -1$ and are decelerating without requiring a phantom like equation of state. The present day value of the equation of state parameter is treated as a free parameter; however, for the reference model, we fix its present value to $-1$. The analysis is carried out using the latest Supernovae dataset (Pantheon+) and BAO measurements from DESI. The results show that both types of datasets consistently predict a turnaround in the equation of state, regardless of whether $w\\_{φ0}$ is treated as a free parameter or fixed to $-1$. The corresponding deceleration parameter also exhibits a future turnaround for both datasets when $w\\_{φ0}$ is free. However, in the reference model with $w\\_{φ0} = -1$, the deceleration parameter instead approaches $-1$ asymptotically. A model comparison using the Akaike and Bayesian Information Criteria shows that the Pantheon+ dataset favors the free $w\\_{φ0}$ scenario, while BAO observations prefer the $w\\_{φ0} = -1$ case. This indicates a disagreement in the future evolution trends predicted by the two datasets within the tachyon type dark energy model.\n\n", "2512.09743": "2025-12-10, **Massive Star Clusters as sources of high-energy gamma radiation**, Luana N. Padilha et.al., [2512.09743v1](http://arxiv.org/abs/2512.09743v1)\n\n This paper investigates the contribution of massive star clusters (MSC) as sources of high-energy gamma rays and their impact on the ultra-high-energy (UHE) emission observed throughout the Galaxy. By modeling proton injection, the study explores how the acceleration of protons in massive star clusters contributes to the gamma radiation detectable from Earth. The analysis focuses on two primary types of clusters: widespread, dispersed clusters and younger, compact massive clusters, both of which host shock waves generated by supernova remnants (SNR). Clusters located near the solar system, within a 3-kiloparsec radius,are identified. Analytical methods are used to calculate energy spectra and gamma-ray production rates. The findings suggest that young and compact MSC contribute to multi-TeV to PeV gamma-ray emission, with the dominant contribution arising from nearby populations.\n\n", "2512.09725": "2025-12-10, **Numerical simulations of astrophysical dynamos and applications to giant planets**, Albert Elias-López et.al., [2512.09725v1](http://arxiv.org/abs/2512.09725v1)\n\n Magnetic fields pervade astrophysical systems and strongly influence their dynamics. Because magnetic diffusion is usually much faster than system evolution, ancient fields cannot explain the present magnetization of planets, stars, and galaxies. Instead, self-sustaining dynamos, which convert fluid motion into magnetic energy, offer the most robust explanation. Numerical magnetohydrodynamic simulations are essential to understanding this phenomenon. This thesis uses numerical models of self-excited dynamos in two contexts: the interstellar medium (ISM) and the interiors of gas giant planets. First, I use 3D MHD simulations with the Pencil Code to study magnetic growth from irrotational, subsonic expansion flows, a simplified representation of supernova-driven motions in the ISM. These curl-free flows mimic stellar explosions and winds, drive turbulence, and seed magnetic amplification. The second part examines planetary dynamos. I outline the properties of planetary magnetic fields and their modeling through convection in spherical shells. Although many exoplanets are known, their magnetic fields remain difficult to detect, but may be observable through coherent radio emission with new low-frequency instruments. Using 3D dynamo simulations with the MagIC code, coupled to thermodynamic profiles from MESA-based evolution models, I study the magnetic evolution of cold gas giants. The models show a slow decline in field strength, a shift from multipolar to dipolar states, and clear evolutionary trends in dynamo behavior. I also investigate hot Jupiters, where strong irradiation alters convection and rotation. Most remain fast rotators, but massive, distant planets may enter different regimes. When heating is concentrated in outer layers, convection in the dynamo region weakens, reducing expected field strengths and helping explain the absence of confirmed detections in past radio surveys.\n\n", "2512.09724": "2025-12-10, **Bayesian Model Selection with an Application to Cosmology**, Nikoloz Gigiberia et.al., [2512.09724v1](http://arxiv.org/abs/2512.09724v1)\n\n We investigate cosmological parameter inference and model selection from a Bayesian perspective. Type Ia supernova data from the Dark Energy Survey (DES-SN5YR) are used to test the \\(Λ\\)CDM, \\(w\\)CDM, and CPL cosmological models. Posterior inference is performed via Hamiltonian Monte Carlo using the No-U-Turn Sampler (NUTS) implemented in NumPyro and analyzed with ArviZ in Python. Bayesian model comparison is conducted through Bayes factors computed using the \\texttt{bridgesampling} library in R. The results indicate that all three models demonstrate similar predictive performance, but \\(w\\)CDM shows stronger evidence relative to \\(Λ\\)CDM and CPL. We conclude that, under the assumptions and data used in this study, \\(w\\)CDM provides a better description of cosmological expansion.\n\n", "2512.09660": "2025-12-10, **Cosmic-Ray Bath in a Past Supernova Gives Birth to Earth-Like Planets**, Ryo Sawada et.al., [2512.09660v1](http://arxiv.org/abs/2512.09660v1)\n\n A key question in astronomy is how ubiquitous Earth-like rocky planets are. The formation of terrestrial planets in our solar system was strongly influenced by the radioactive decay heat of short-lived radionuclides (SLRs), particularly $^{26}$Al, likely delivered from nearby supernovae. However, current models struggle to reproduce the abundance of SLRs inferred from meteorite analysis without destroying the protosolar disk. We propose the `immersion' mechanism, where cosmic-ray nucleosynthesis in a supernova shockwave reproduces estimated SLR abundances at a supernova distance ($\\sim$1 pc), preserving the disk. We estimate that solar-mass stars in star clusters typically experience at least one such supernova within 1 pc, supporting the feasibility of this scenario. This suggests solar-system-like SLR abundances and terrestrial planet formation are more common than previously thought.\n\n", "2512.09384": "2025-12-10, **SN 2022ngb: a faint, slow-evolving Type IIb Supernova with a low-mass envelope**, J. -W. Zhao et.al., [2512.09384v1](http://arxiv.org/abs/2512.09384v1)\n\n An extensive photometric and spectroscopic follow-up campaign of the Type IIb SN 2022ngb is presented in the article. Through detailed modeling of this dataset, we aim to constrain the key physical parameters of the explosion, infer the nature of the progenitor star and its environment, and probe the dynamical properties of the ejecta. We analyze photometric and spectroscopic data of SN 2022ngb. By constructing and modeling the bolometric light curve with semi-analytic models, we estimate the primary explosion parameters. The spectroscopic data are compared with those of well-studied SNe IIb and NLTE models to constrain the properties of the progenitor and the structure of the resulting ejecta. SN 2022ngb is a low-luminosity SN IIb with a peak bolometric luminosity of L\\_bol = 7.76 (+1.15/-1.00) x 10^41 erg/s and a V-band rising time of 24.32 +/- 0.50 days. Light curve modeling indicates an ejecta mass of ~2.9-3.2 M\\_sun, an explosion energy of ~1.4 x 10^51 erg, and a low synthesized 56Ni mass of ~0.045 M\\_sun. Nebular phase spectra exhibit asymmetric line profiles, pointing to a non-spherical explosion and an anisotropic distribution of radioactive material. Our analysis reveals a relatively compact stripped-envelope progenitor with a pre-SN mass of approximately 4.7 M\\_sun (corresponding to a 15-16 M\\_sun ZAMS star). Our analysis suggests that SN 2022ngb originated from the explosion of a moderate-mass relatively compact, stripped-envelope star in a binary system. The asymmetries inferred from the nebular phase spectral line features suggest a non-spherical explosion.\n\n", "2512.09353": "2025-12-10, **Bimetric MOND as a framework for variable-$G$ theories -- local systems and cosmology**, Mordehai Milgrom et.al., [2512.09353v1](http://arxiv.org/abs/2512.09353v1)\n\n Bimetric MOND (BIMOND) is used as a platform for variable-$G$ theories that have MOND-specific idiosyncrasies. E.g., MOND premises dictate return to standard dynamics in the high-acceleration limit, predicting the standard value of $G$ for high-acceleration systems. This automatically ensures compliance of such theories with all the constraints on inconstancy of $G$ that emerge from the study of high-acceleration systems: geophysics, solar system, pulsars, supernovae, stellar evolution, emission of gravitational waves, etc. In MOND, constraints deduced from such phenomena have no bearing on possible $G$ variability in cosmology. My guiding motivation is to see if such theories may account for some roles of dark matter in cosmology; e.g., in accounting for the expansion history of the Universe in the matter-dominated era, by having a $G\\_e\\approx 2πG$ govern the later stages of the expansion, instead of invoking matter density $\\approx 2π\\times$ baryon density. Without adding degrees of freedom, or new dimensionful constants, BIMOND can be extended to a class of theories that entail what is best described as phenomenon-dependence of Newton's constant, $G$. I cannot yet present a consistent model that complies with all the observations in cosmology, including the expansion history, with all its details. Instead, I describe some examples of theories in the class that predict different values of $G\\_e$ in different circumstances, including one where $G$ takes its standard value for all subcosmological systems -- even if they are deep in the MOND regime. I also discuss scenarios in which $G\\_e\\approx G$ in the early Universe, as required by constraints from big-bang nucleosynthesis, but with $G\\_e> G$ setting in at later times, where it can affect the expansion history during the matter-dominated era.\n\n", "2512.09223": "2025-12-10, **An extragalactic gamma-ray binary formed in supernova 2022jli**, Pengfei Zhang et.al., [2512.09223v1](http://arxiv.org/abs/2512.09223v1)\n\n On May 5 2022, a type Ic supernova (SN) explosion SN~2022jli was discovered. This SN showed additional optical emissions, which were found to exhibit 12.4-day periodic undulations and concordant periodic velocity shifts. These key features likely indicate a compact object in a binary system was formed. A faint $γ$-ray source was also detected at the position of the SN and upon checking the $γ$-ray photons' arrival times, it was revealed that the same 12.4-day periodicity was likely present. Here we report our detailed analysis results for the $γ$-ray source. Not only was the $γ$-ray emission detectable for $\\sim$1.5\\,years since the discovery time, but a strong modulation at period 12.5\\,day was also clearly determined. Considering the newly formed compact object to be a neutron star or a stellar-mass black hole, the putative binary, having an orbital period of 12.5\\,day, is likely the first extragalactic high-energy system detected. The system may serve as a valuable example for the formation of many such binaries observed in the Milky Way and nearby galaxies.\n\n", "2512.09020": "2025-12-09, **University of Hawaii 88-inch Telescope Observations of the Interstellar Comet 3I/ATLAS: Spectrophotometric Blue-Sensitive Spectral Time Series Spanning Two Months from Discovery**, W. B. Hoogendam et.al., [2512.09020v1](http://arxiv.org/abs/2512.09020v1)\n\n Interstellar objects are the ejected building blocks of other solar systems. As such, they enable the acquisition of otherwise inaccessible information about nascent extrasolar systems. The discovery of the third interstellar object, 3I/ATLAS, provides an opportunity to explore the properties of a small body from another solar system and to compare it to the small bodies in our own. To that end, we present spectrophotometric observations of 3I/ATLAS taken using the SuperNova Integral Field Spectrograph on the University of Hawaii 2.2-m telescope. Our data includes the earliest $λ\\leq3800$ A spectrum of 3I/ATLAS, obtained $\\sim$12.5 hours after the discovery announcement. Later spectra confirm previously reported cometary activity, including Ni and CN emission. The data show wavelength-varying spectral slopes ($S\\approx($0\\%-29\\%)/1000 A, depending on wavelength range) throughout the pre-perihelion ($r\\_h=4.4$-$2.5$ au) approach of 3I/ATLAS. We perform synthetic photometry on our spectra and find 3I/ATLAS shows mostly stable color evolution over the period of our observations, with $g-r$ colors ranging from $\\sim$0.69-0.75 mag, $r-i$ colors ranging from $\\sim$0.26-0.30 mag, and $c-o$ colors ranging from $\\sim$0.50-0.55 mag. Ongoing post-perihelion observations of 3I/ATLAS will provide further insight into its potentially extreme composition.\n\n", "2512.08821": "2025-12-09, **Exploring the binary origin of B and Be rapid rotators**, Jonathan Labadie-Bartz et.al., [2512.08821v1](http://arxiv.org/abs/2512.08821v1)\n\n Observational evidence has continued to mount that a significant fraction of rapidly rotating early-B type stars are products of binary mass transfer. However, very few mid- and late-type B stars with rapid rotation have been demonstrated to be post-interaction products, despite a growing sample of SB1 binaries among stars within this range of spectral types. By considering the currently available information over the entire range of rapidly rotating B-type binaries, we argue that a significant fraction of the mid- and late-type rapid rotators found in binaries are also likely the result of past mass transfer episodes. The observed properties of this sample are compared to the predictions from the Binary Population and Spectral Synthesis code (BPASS), with attention given to the expected evolutionary pathways of stripped stars and the stellar and binary properties of both components of post-interaction systems across a range of initial conditions. Prospects for directly detecting and characterizing the stripped cores of the previous mass donors in such systems are described, and the implications for the role of binary interaction in causing rapid rotation are discussed. An accurate description of prevalence of binary interaction, the physics of mass transfer, and the post-interaction configuration of systems over a range of initial conditions has far-reaching implications including double-degenerate binaries and their eventual mergers, the output of ionizing UV flux of stellar populations, and the supernova explosions that can arise from stripped or rapidly-rotating progenitors.\n\n", "2512.08528": "2025-12-09, **Dark Photons in the Early Universe: From Thermal Production to Cosmological Constraints**, Xun-Jie Xu et.al., [2512.08528v1](http://arxiv.org/abs/2512.08528v1)\n\n Dark photons, a generic class of light gauge bosons that interact with the Standard Model (SM) exclusively through kinetic mixing, arise naturally in many gauge extensions of the SM. Motivated by these theoretical considerations, we present a comprehensive analysis of their thermal production in the early universe. Our calculation covers a broad range of dark photon masses from 0.1 keV to 100 MeV and include inverse decay, annihilation, and semi-Compton processes. Wherever possible, we present analytical estimates of the production rates and yields, and verify their accuracy numerically. For dark photons lighter than twice the electron masses (around 1 MeV), we find that our analytical estimate of the freeze-in yield based on resonant production is very accurate, implying that off-resonance contributions can be neglected in practice. For heavy dark photons, although this conclusion no longer holds, we derive an interesting ratio, $4πe/27\\approx0.14$, with $e$ the coupling constant of QED, that can be used to estimate the relative importance of on- and off-resonance contributions. Finally, using the calculated abundance of dark photons in the early universe, we derive cosmological constraints on the dark photon mass and kinetic mixing. Compared with bounds from stellar cooling and supernovae, the cosmological constraints are most stringent in the mass range from 0.1 MeV to 6 MeV, within which kinetic mixing at the level of $10^{-12}\\sim10^{-10}$ can be probed.\n\n", "2512.08231": "2025-12-09, **The Head-on Collision of a Neutron Star with a White Dwarf**, Zong-kai Peng et.al., [2512.08231v1](http://arxiv.org/abs/2512.08231v1)\n\n We have computed the physical processes involved in a head-on collision between a neutron star (NS) and a white dwarf (WD). The outcomes of such collisions vary depending on the mass and type of the WD. We have separately examined the dynamical processes for collisions between NSs and helium WDs (He-WDs), carbon-oxygen WDs (CO-WDs), and oxygen-neon WDs (ONe-WDs). We aim to investigate whether the collision can trigger a thermonuclear explosion of the WD, and if not, whether the NS can remain bound within the WD to form a Thorne-Zytkow-like object (TZlO). For a thermonuclear explosion to occur, at least two conditions must be satisfied: (i) the collision-induced temperature must reach the ignition threshold of the relevant nuclear reactions, and (ii) the burning material must remain in a degenerate state. For different types of WDs, there exist parameter ranges where both conditions are fulfilled, implying that NS-WD collisions can indeed induce thermonuclear explosions, leading to sub-Chandrasekhar Type Ia supernovae or other exotic optical transients powered by thermonuclear explosion. On the other hand, the formation of a TZlO requires that the WD material exerts sufficient drag on the NS to prevent its escape, while the interaction must not trigger a thermonuclear explosion of the WD. Our results indicate that such conditions can be realized in the case of low-mass CO-WDs and low-mass ONe-WDs, provided that the viscous coefficient is sufficiently large.\n\n", "2512.08212": "2025-12-09, **Supernovae Shock Breakout from Red Supergiants in Two Dimensions**, Wun-Yi Chen et.al., [2512.08212v1](http://arxiv.org/abs/2512.08212v1)\n\n We present new two-dimensional radiation hydrodynamic simulations of supernova shock breakout from red supergiants using the $\\texttt{CASTRO}$ code. Our progenitors are 20 and 25 M$\\_{\\odot}$ solar-metallicity stars evolved from the zero-age main sequence with $\\texttt{MESA}$ and exploded in one dimension using $\\texttt{FLASH}$. We consider a range of circumstellar media (CSM) produced by stellar winds to investigate how pre-explosion mass-loss affects shock breakout. The multigroup flux-limited diffusion scheme in $\\texttt{CASTRO}$ captures the interaction between the explosion shock, its radiation precursor, and the surrounding CSM. We find that strong radiation precursors, generated by radiation leakage behind the shock, can drive fluid instabilities and move the effective photosphere outward before the shock reaches the stellar surface. The resulting breakout emissions reach peak luminosities of ${\\sim}10^{44}$ erg s$^{-1}$ with full-width half-maximum durations of 1-3 hr, which are much dimmer and longer than those from blue supergiants. The light-curve colors gradually evolve from blue to red after the peak. The 25 M$\\_{\\odot}$ model with explosion energy $E \\sim 1.69\\times10^{51}$ erg produces ${\\sim}$10-30\\% higher maximum luminosity than the 20 M$\\_{\\odot}$ model with $E \\sim 1.09\\times10^{51}$ erg. The dense CSM further extends the breakout rise time by increasing the photon diffusion. These results provide new constraints on red supergiant atmospheres and mass-loss histories prior to core collapse.\n\n"}}